{
  "articles": [
    {
      "title": "The Most Mystifying Lines of Sarah Palin’s Endorsement Speech",
      "url": "https://www.nytimes.com/2016/01/21/us/politics/sarah-palin-endorsement-speech-donald-trump.html?searchResultPosition=99",
      "subtitle": "null",
      "author": "Michael Barbaro",
      "content": " Sarah Palin’s meandering, fiery, sarcastic, patriotic and blustery speech endorsing Donald J. Trump for president on Tuesday in Ames, Iowa, does not easily submit to categorization. It has been described as performance art, a filibuster, even slam poetry. (Watch the video, read the transcript.) Mrs. Palin has always been a singular force on the campaign trail. But in her years away from politics, the former Alaska governor and Senator John McCain’s Republican vice-presidential pick in 2008 seems to have spawned a whole new series of idiosyncratic expressions and unusual locutions — to the point where even Mr. Trump seemed occasionally mystified as he tried to follow along. Below, a list of 10 of the most memorable lines of the speech, and an attempt to translate them: “They stomp on our neck, and then they tell us, ‘Just chill, O.K., just relax.’ Well, look, we are mad, and we’ve been had. They need to get used to it.” An impressive example of internal rhyme — if a tad violent, as Mrs. Palin describes the Republican establishment trying to quash the anger of the party’s rebellious base. _____ “We’re talking about no more Reaganesque power that comes from strength. Power through strength.” Whoops! Mrs. Palin seems to be grasping for President Ronald Reagan’s signature Cold War slogan, “Peace through strength.” _____ “And you quit footing the bill for these nations who are oil-rich, we’re paying for some of their squirmishes that have been going on for centuries. Where they’re fighting each other and yelling ‘Allahu akbar,’ calling jihad on each other’s heads forever and ever. Like I’ve said before, let them duke it out and let Allah sort it out.” Here, Mrs. Palin accomplishes many things unusual for a political speaker: She recites the Arabic phrase for “God is great,” and, more notably, coins a new word, squirmishes, a cross between squirm (which means to wriggle the body from side to side) and skirmish (which means a brief fight or encounter between small groups). Twitter embraced the new term instantly. _____ “How about the rest of us? Right-winging, bitter-clinging, proud clingers of our guns, our God, and our religion, and our Constitution.” Remember President Obama’s famously dismissive description of conservatives as bitter people who “cling to guns or religion” before a crowd of wealthy donors in San Francisco? Mrs. Palin wants to make sure you never forget it. _____ “He is from the private sector, not a politician. Can I get a ‘Hallelujah!’ ” Mrs. Palin goes godly as she enthuses about the business world. _____ “Mr. Trump, you’re right, look back there in the press box. Heads are spinning, media heads are spinning. This is going to be so much fun.” This is perhaps the most accurate statement in her speech. _____ “In fact it’s time to drill, baby, drill down, and hold these folks accountable.” The slogan Mrs. Palin popularized in 2008 just won’t die. And it has taken on metaphoric meaning now. _____ “Well, and then, funny, ha ha, not funny, but now, what they’re doing is wailing, ‘Well, Trump and his Trumpeters, they’re not conservative enough.’ ” We’re still stumped by this one. _____ “And he, who would negotiate deals, kind of with the skills of a community organizer maybe organizing a neighborhood tea, well, he deciding that, ‘No, America would apologize as part of the deal,’ as the enemy sends a message to the rest of the world that they capture and we kowtow, and we apologize, and then, we bend over and say, ‘Thank you, enemy.’ ” It’s a mouthful. But this section, in which Mrs. Palin contrasts Mr. Trump with Mr. Obama, has everything she relishes: Mockery of Mr. Obama’s early years working in Chicago neighborhoods, right-wing accusations that the president has apologized for America, and a crude reference to him as a submissive sissy on foreign policy. _____ “He’s got the guts to wear the issues that need to be spoken about and debate on his sleeve, where the rest of some of these establishment candidates, they just wanted to duck and hide. They didn’t want to talk about these issues until he brought ’em up. In fact, they’ve been wearing a, this, political correctness kind of like a suicide vest.” Her biggest misstep in the speech: In 2016, fear of suicide bombers is real for many, not the stuff of political punch lines.",
      "date": "Jan. 20, 2016",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "‘Who Is America?’ Ends With O.J. Simpson. But Where Was Sarah Palin?",
      "url": "https://www.nytimes.com/2018/08/27/arts/television/who-is-america-sarah-palin.html?searchResultPosition=69",
      "subtitle": "null",
      "author": "Sopan Deb",
      "content": " The final episode of Sacha Baron Cohen’s Showtime series — “Who Is America?” — aired on Sunday night and it was as notable for what didn’t air as it was for what did. Where was the highly anticipated interview featuring the former Republican vice-presidential nominee Sarah Palin? You might remember: She was among the first to come out and publicly admit she had been duped by Mr. Cohen. In a July Facebook post, Ms. Palin said, “I join a long list of American public personalities who have fallen victim to the evil, exploitive, sick ‘humor’ of the British ‘comedian’ Sacha Baron Cohen, enabled and sponsored by CBS/Showtime.” She said she had been interviewed by Mr. Cohen, who “heavily disguised himself as a disabled U.S. Veteran,” as part of a “legit Showtime historical documentary.” Showtime issued a statement soon after, pushing back, saying, “Baron Cohen never presented himself as a veteran of the U.S. military to former Alaska Governor Sarah Palin during the booking process or during the filming of her interview, and contrary to her claims he did not appear in a wheelchair.” The network added that Mr. Cohen was in character as Dr. Billy Wayne Ruddick Jr., who had interviewed several prominent figures for the show. The finale on Sunday started off being quite underwhelming, when the former Massachusetts Congressman Barney Frank wasn’t quite fooled by the Ruddick character. Ruddick, a Trump supporter, tried to convince Mr. Frank that Hillary Clinton was a ringleader in a fringe conspiracy theory having to do with child trafficking known as “Pizzagate.” The second segment featured three real Trump supporters, only identified as Glenn, Darren and Cody. In character as Lt. Erran Morad, an Israeli antiterrorism expert, Mr. Cohen trained the three to fight antifa. (The term, a contraction of “anti-fascist,” describes the loose affiliation of radical activists who have openly fought white supremacists, right-wing extremists and, in some cases, ordinary supporters of President Trump.) This involved learning to cook quinoa, memorizing plotlines of HBO’s “Girls,” and taking a mannequin resembling President Trump and putting it in sexual positions — all to embody being a liberal, in Morad’s eyes. Then, at a Women’s March in San Francisco, Mr. Cohen (as Morad) persuaded Glenn to detonate an explosive device. Glenn did so — without reservation or regret. (Of course, there was no actual explosive.) The show ended with a bit with O.J. Simpson. Mr. Cohen, this time as Gio Monaldo, an Italian billionaire playboy, repeatedly tried to goad Mr. Simpson into admitting that he was guilty of murder. A hint that Ms. Palin’s segment might not air came from Showtime’s chief executive, David Nevins, earlier this month. Speaking to reporters, in response to a question about Ms. Palin, Mr. Nevins said, “There are several people who have thrown themselves in front of buses that may not be headed their way.” The season has now ended — and Ms. Palin’s interview never aired. When asked about it Monday, Showtime said it had no comment. It’s possible she didn’t sign a release. It’s also possible her segment didn’t provide enough comedic juice for Mr. Cohen — although several segments from “Who Is America?” have featured subjects who have caught on to the gag early. But the episode did not go without a Palin reference. She received a post-show credit: “Special Publicity Consultant (Inadvertent).”",
      "date": "Aug. 27, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin Says She Was ‘Duped’ by Sacha Baron Cohen",
      "url": "https://www.nytimes.com/2018/07/11/arts/television/sarah-palin-sacha-baron-cohen.html?searchResultPosition=68",
      "subtitle": "null",
      "author": "Alex Marshall",
      "content": " The comedian Sacha Baron Cohen has been called many things during his years of embarrassing celebrities on camera — and he can now add “evil,” “exploitative” and “truly sick” to the list. Sarah Palin, the former vice-presidential candidate, said on Tuesday in a lengthy Facebook post that she and one of her daughters were “duped” into apparently appearing on the British comedian’s new TV series. “Yup — we were duped. Ya’ got me, Sacha. Feel better now?” Ms. Palin wrote, saying she was a “victim” of the comedian for the Showtime series “Who Is America?,” which debuts on Sunday. Ms. Palin said she was invited to appear on a “legit Showtime historical documentary.” She was interviewed by what appeared to be a disabled veteran in a wheelchair, who she assumes was Mr. Cohen in disguise. He peppered her with questions, she added, that were “full of Hollywoodism’s disrespect and sarcasm.” Ms. Palin “finally had enough and literally, physically removed my mic and walked out,” she wrote. “The disrespect of our U.S. military and middle-class Americans via Cohen’s foreign commentaries under the guise of interview questions was perverse,” she added, before saying she was “purposefully” taken to the wrong airport after the interview and missed her flight home. Showtime declined to comment, and Mr. Cohen’s representatives did not immediately respond to a request. Ms. Palin did not threaten legal action in her Facebook post but called on Mr. Cohen, Showtime and its parent company, CBS, to donate any profits from the series to veterans’ charities. Joe Walsh, the former Republican congressman turned TV and radio personality, said in a series of Twitter posts late Tuesday and early Wednesday that he, too, had been deceived by Mr. Cohen’s show. He described being invited to a supposed pro-Israel event and interviewed on camera until “producers rushed me out of the studio as an apparent fight broke out.” “Strangest interview of my life,” Mr. Walsh added. Mr. Cohen has been sued in the past by people who have complained about his work after appearing in his films, such as 2006’s “Borat” and 2009’s “Brüno,” but several cases were dismissed. Dick Cheney, the former vice president, is among the other political figures interviewed for “Who Is America?” One clip from the series features Mr. Cheney signing what was described as a “waterboard kit.” President Trump also might be a target of the series. A teaser released on July 4 showed Mr. Trump calling Mr. Cohen “a third-rate character.” “I only wish he’d been punched in the face so many times right now he’d be in a hospital,” he added. Mr. Trump appeared in a segment of Mr. Cohen’s breakthrough “Da Ali G Show” in 2003. Mr. Cohen’s character pitched a clearly disgruntled Mr. Trump a business idea involving gloves to stop drips while eating ice cream. Mr. Trump has said he “immediately walked out” of the encounter, but Mr. Cohen said he was there for “about seven minutes.”",
      "date": "July 11, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "My Sarah Palin Romance",
      "url": "https://www.nytimes.com/2016/01/21/opinion/campaign-stops/my-sarah-palin-romance.html?searchResultPosition=34",
      "subtitle": "null",
      "author": "Ross Douthat",
      "content": " As a political journalist, you never forget the first time you stop just covering a politician and start identifying with her. The first time you wed your high-minded vision of what politics should be to a real candidate’s perishable breath. My first time arrived in 2008. It lasted only a short while. Her name was Sarah Palin. Let me explain. That spring, in between the Republican primary and the fall campaign, my friend Reihan Salam and I had published a book called “Grand New Party: How Republicans Can Win the Working Class and Save the American Dream.” As the title suggests, we were calling for the G.O.P. to change, but not to moderate in the way that a lot of centrist pundits favored, returning to a Rockefeller-Republican model of fiscally prudent social liberalism. Rather, we thought the party’s opportunity (and the country’s) lay in a kind of socially conservative populism, which would link the family-values language of the religious right to an economic agenda more favorable to the working class than what the Republicans usually had offered. Unfortunately this message conspicuously lacked a tribune in 2008. Mike Huckabee flirted with populism in the primary but never fleshed out an agenda, and the eventual nominee, John McCain, was an “honor and country” candidate who didn’t care much about economic policy. But in Alaska, there was a young, rising-star governor. She was pro-life, evangelical, a working mom. And her record way up north was reformist in a distinctly nonideological way: She was best known for fighting a corrupt nexus of politicians and the oil-and-gas industry, tackling crony capitalism on behalf of ordinary Alaskans. And then, shockingly, McCain picked her as his running mate. At which point the chattering classes went temporarily insane. Or maybe I went insane, who can say? But either way it seemed like everything I hated, a mix of sneering social liberalism, fecundophobia, anti-evangelical paranoia and class contempt, was being hurled at a candidate who seemed to fit exactly with the “Grand New Party” mold. So I defended her. I assailed her critics. And then — well, you know what happened then. Palin gave interviews — terrible, terrible interviews. She was in over her head. Her own paranoia took center stage. She became her critics’ caricature, embracing a mix of willful ignorance and proud ressentiment. What was distinctive about her Alaskan career was subsumed into a much more conventional sort of movement conservatism, which she picked up from the professional ideologues who rallied to her during her trial by fire. And eventually the movement tired of her, the culture tired of her, and her act ceased to be interesting even as reality TV. But now that she has re-emerged to endorse Donald Trump, uniting her brand with his “Make America Great Again” nationalism, it’s worth revisiting the original Palin, the outsider who took on a corrupt Alaskan establishment. A lot of conservatives, especially in Ted Cruz’s orbit, have acted shocked or disappointed that Palin would endorse a figure like Trump, who has no plausible claim to be a principled conservative. But given Palin’s Alaskan past, the endorsement makes perfect sense. Her real roots are not in Reaganism or libertarianism or the orthodoxies of the donor class. They’re in the same kind of blue-collar, Jacksonian, “who’s looking out for you?” populism that has carried Trump to the top of the Republican polls. And it’s a populism that the G.O.P. is discovering has a lot more appeal to many of its voters than the litmus tests of the official right. Which means that in a certain way, Trump and Palin together on a stage is the closest American politics has come to offering the populist grand new party that Salam and I called for two presidential campaigns ago. Except that it isn’t what we called for, because we wanted a populism with substance — one that actually offered policy solutions to stagnant wages and rising health care costs, one that could help Republicans reach out to upwardly mobile blacks and Hispanics as well as whites, and so on down an optimistic wish list. Whereas Trump-era populism, while it plays very effectively on economic anxiety, mostly offers braggadocio rather than solutions, and white identity politics rather than any kind of one-nation conservatism. I would like to tell you that this is all the fault of the Republican leadership — that had they been more receptive to populist ideas in 2008 or 2012, they wouldn’t be facing a Trumpian revolt today. That’s roughly the argument that David Frum makes in this month’s Atlantic, in a sweeping essay on the roots of Trumpism. And he makes a strong case. A large part of the Republican donor class would rather lose with “you didn’t build that!” than compromise on upper-bracket tax cuts. It would rather try to win Hispanics with immigration reform a hundred times over than try to win them once on pocketbook issues. It prefers to campaign as though it’s always 1980, and has little to say to people who have lost out from globalization and socioeconomic change. A critique that stops with G.O.P. elites, though, might let the voting public off the hook. Because it’s also possible that Trumpism, in all its boastful, lord-of-misrule meretriciousness, is what many struggling Americans actually want. That is, at a certain point disillusionment with the system becomes so strong that no wonkish policy proposal is likely to resonate anymore. So you can talk all you want (as Marco Rubio’s water-treading campaign has tried to do) about improving vocational education or increasing the child-tax credit, and people will tune you out: They want someone who will arm-wrestle the Chinese, make Mexico pay for the wall, smite our enemies and generally stand in solidarity with their resentments, regardless of the policy results. Since this is a recipe for American-style Putinism, it’s not exactly a good sign for the republic that it seems to be resonating. But those of us who want a better, saner and more decent populism than what Donald Trump is selling need to reckon with the implications of his indubitable appeal. Maybe — hopefully — there’s a bridge from Trumpism to a more responsible alternative, as there was between Huey Long and F.D.R. or from George Wallace to Richard Nixon. But it’s also possible that my fellow eggheads and I are grasping at a dream that’s already slipped behind us — lost back in the land of might-have-beens, where the dark fields of Wasilla roll on under the night.",
      "date": "Jan. 20, 2016",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Meet the Sarah Palin sisterhood",
      "url": "https://www.nytimes.com/2008/09/05/world/americas/05iht-05women.15920493.html?searchResultPosition=27",
      "subtitle": "null",
      "author": "Kim Severson",
      "content": " WASILLA, Alaska — People here in Sarah Palin's hometown learned science from her father. They remember how she led the Warriors to an unexpected high school basketball championship, her success as a beauty queen and how her family grew along with the Wasilla Bible Church. So when Palin, then a young mother, ran for the City Council in 1992, of course they voted for her. And they kept doing so, for mayor and then for governor — especially the women who, like her, had small children, hated abortion and prayed every day. \"I admire her intelligence and I admire her integrity, but first and foremost she's a mom, and she has an understanding of what being a mom is,\" said Janet Kincaid, a grandmother and Republican who last summer opened her lakeside Wasilla home for a $20,000 Palin fund-raiser. As Palin, a first-term Republican governor, sampled the curried tuna puffs and gave her speech, Kincaid recalled, even the woman who cleans Kincaid's house decided to give money. Although some liberal Democrats dismiss them as \"Palinbots\" for their reflexive devotion, these women are as dedicated to Palin as the women Senator Hillary Rodham Clinton, Democrat of New York, called her sisterhood of the traveling pantsuits were to their very different version of the modern female politician. These are women who dip in and out of the work force, believe in prayer and spend their days trying to keep the crayon off the walls. They feel they have been looked down on by Clinton feminists and ignored by the power structure in the Republican Party. The fact that Palin has five children, including Trig, a newborn with Down syndrome, only makes her that much more part of the sisterhood. \"I'm not that into politics,\" said Delores Field, an Alaska Inupiat from Eagle River, near Anchorage, who does not consider herself a Democrat or a Republican. \"I'm just going to vote for Trig Van Palin's mom.\" This segment of Palin's supporters are not the women of Phyllis Schlafly's deeply conservative generation of Republican women, nor are they the polished women who might have enjoyed lunch with the first lady, Laura Bush, in her Texas days. Like many women in the valley where Palin comes from, her appeal here, and in recent days across the country, is more about who she is — that is, a devout Christian with a husband who supports her career, but a person who is not afraid to show up in public with a baby on her hip. \"She didn't create this, but she showed up at the right time,\" said Darla Shine, whose Happy Housewife Club franchise includes a talk radio show, a book and a Web site that receives millions of hits a month. \"She represents a huge pocket of women who have been the ignored community for so long.\" Although strong opposition to abortion and an evangelical approach to Christianity are often shared traits among the Palin women, they do not necessarily walk lock step with Republican politics, said Serrin Foster, president of Feminists for Life, a lobbying group with 28,000 members, including Palin. Some of the group's members are vegans who might not appreciate Palin's penchant for hunting moose. Others might consider themselves moderates who could vote for either party. \"There is a spectrum within the pro-life movement,\" Foster said, \"and Sarah is proof that you can be pro-life and pro-woman.\" Rick Mystrom, a Republican who was the mayor of Anchorage when Palin was Wasilla's mayor, said other women in Alaska who are politicians, like Senator Lisa Murkowski, also a Republican, are seen differently, as part of the Alaska political machine. ( Murkowski supports abortion rights.) \"Sarah's appeal,\" Mystrom said, \"is that she is everywoman and she became what every woman thinks she can become.\" Palin's evangelical Christian beliefs were an asset in this conservative state, and they also helped propel her to the Republican ticket as Senator John McCain's running mate. She is part of a generation of Christian women who began serving on school boards and small governmental bodies in the 1990s, and often look out for one another. When she bucked her party and then ran against the Republican governor in 2006, she did not get much support from the traditional channels. So Republican women's clubs around the state came through by raising tens of thousands of dollars for her campaign. Palin's political career has grown along with her church, which began with a few families and recently moved to a new building that seats 400 and hosts three services on Sunday. Steve Menard, a member of the church who is running for Wasilla mayor next month, said that although the church helped Palin's rise, a political climate ready for someone like her was helping her national profile. \"You needed the right candidate at the right time,\" Menard said, \"to open doors for working women who share a set of values.\" Her ability to mix church, family and politics is part of the draw. Through connections with other longtime family friends, including political allies and members of her church, she was able to raise the sales tax in Wasilla as a way to help finance a $15 million sports complex that featured a new hockey rink for her son Track to play on. This summer, several Christian groups came together for a day of prayer at the arena. Palin was there with her infant Trig in her arms and a daughter, Piper, nearby. Some of Palin's critics say that her popularity, to a degree, is superficial. Mike Doogan, who for 14 years was a columnist with The Anchorage Daily News before he became a Democratic state legislator, said he understood her appeal to a certain type of female voter. But Doogan said her image was carefully cultivated to do just that. \"There is no more unlikely hockey mom on this planet,\" he said. \"They are usually not this politically ambitious or cut-throat.\" Anne Kilkenny, who said she voted for Palin in city elections, said she became disillusioned with her after participating in Wasilla city government and seeing Palin up close. \"You've got to remember,\" Kilkenny said, \"we are not much bigger than a high school and she is the homecoming queen.\" None of that matters for the women who see Palin's rise as their rise. \"Sarah Palin is a different kind of feminist,\" said Joy Ng, who lives in Kodiak with her husband of 35 years. \"She is a strong woman who can wear a skirt and be proud of it.\"",
      "date": "Sept. 5, 2008",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin Saves Feminism",
      "url": "https://www.nytimes.com/2016/01/24/opinion/sunday/sarah-palin-saves-feminism.html?searchResultPosition=23",
      "subtitle": "null",
      "author": "Maureen Dowd",
      "content": " WASHINGTON — IT’S a tough call to figure out which place is more benighted: Hollywood or Saudi Arabia. Saudi Arabia was pulling ahead with all its beheadings and its top cleric’s fatwa on chess as “the work of Satan.” But then Hollywood took the lead with its Jim Crow Oscars, Scully being offered half of Mulder’s pay for the “X-Files” reboot, and its second-class treatment of Rey — the scrappy heroine of “Star Wars: The Force Awakens.” Rey, played by Daisy Ridley, embodies the awakening Force. Yet even the director, J.J. Abrams, called it “preposterous and wrong” that Rey’s action figure was missing in action from some game and toy tie-ins — a traditionally male realm. And Lucasfilm is run by a girl action figure, Kathleen Kennedy, so go figure. That is why it’s so inspiring to see a woman out on the campaign trail who has had such a historic impact on feminism, helping to recast outmoded assumptions about women. Yes, Sarah Palin, I’m giving you a shout-out. Before Palin, if a woman flamed out in a spectacular fashion, it was considered an X through the X chromosome. If Billie Jean King lost to Bobby Riggs, women would be seen as second-class athletes. If Geraldine Ferraro seemed unfit for the White House, all women might be judged incapable. But when Palin turned out to be utterly unqualified and unintelligible, spouting her own special Yoda-like language, it did not reflect poorly on women as a whole — only on her and John McCain. What the hell were you thinking, Senator? Ordinarily, it’s considered sexist to call a woman shrill. But Palin liberated us on that score. She really is shrill. Ordinarily, it’s dicey to focus on what a woman in politics is wearing. But again, Palin has freed us up. She sported a cardigan so gaudy and rogue at her Iowa endorsement of Donald Trump (the man who viciously mocked her former running mate’s war record) that we would be remiss not to mention that it was the sartorial reflection of Palin and Trump themselves. Ordinarily, you have to tread gingerly in critiquing a working woman on her mothering skills. But Palin’s brawling brood runs so wild around the state she once governed, in a way that is so contrary to her evangelistic, sanctimonious homilies on family values, that it seems only Christian to advise her to study the Obamas to see what exceptional parenting looks like. With Palin and Trump, a failed reality star and a successful one, gall is divided into two parts. There has been a lot of talk this campaign season about how women pols bring superior qualities to the table: collegiality and listening skills. But Sarahcuda shows that we are truly the equals of men, capable of narcissistic explosions, brazen hypocrisy and unapologetic greed. She had barely finished the endorsement Tuesday when she began using it to raise money for SarahPAC, so she can take her show on the road. Her oldest son, Track, was a kid with a temper before he served in Iraq for a year, conveniently shipping off in the fall of 2008 as his mother began her hockey-mom spiel. The 26-year-old was arrested Monday  on an assault charge, accused of punching his girlfriend in the face and kicking her during an alcohol-fueled argument at the Palins’ home in Wasilla, Alaska. His girlfriend told the police that he was also waving around an AR-15 assault rifle. Instead of just admitting that her family is a mess, Palin exhibited Trump-like swagger, conjuring a story in an attempt to gin up the crowd and occlude her son’s behavior. She used the last refuge of scoundrels in Tulsa, Okla., Wednesday, wrapping herself in patriotism. In her convoluted, disingenuous way, she charged President Obama with a lack of “respect” for veterans and suggested that Track had post-traumatic stress disorder and became “hardened,” implying this is what led to the incident prompting his arrest. This from the archconservative who presents herself as a model of personal responsibility and scourge of victimhood? Outraged vets urged Palin not to reduce PTSD to a political “chew toy,” as one put it, or to excuse domestic violence by citing the disorder. The rattlebrained Palin has reversed her Iraq position, so that now her stance somehow matches Trump’s consistent and prescient one against the Iraq invasion. When she saw Track off to Iraq in 2008, she echoed W.’s specious argument, calling the war a “righteous cause” to avenge “the enemies who planned and carried out” 9/11. But in her endorsement of Trump, she praised Rand Paul, who thinks we should have left Saddam Hussein in place, and argued that America should stop “footin’ the bill” for oil-rich nations and “their squirmishes that have been going on for centuries, where they’re fightin’ each other and yellin’ ‘Allah akbar,’ calling jihad on each other’s heads for ever and ever.” Hillary Clinton is presenting herself as the embodiment of women, an American Marianne, pushing her gender in an all-for-one-one-for-all, now-or-never way. She’s even campaigning this week in Iowa with Billie Jean King. Women should support her because if she founders, it will be bad for women. One Democratic senator said privately that many Democrats believe that Hillary is still the presumed nominee only because she is a woman. But Palin has done us a favor by proving that a woman can stumble, babble incoherently on stage and spew snide garbage, and it isn’t a blot on the female copybook. It’s all on her. Can I get a hallelujah?",
      "date": "Jan. 23, 2016",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin, Rage Whisperer",
      "url": "https://www.nytimes.com/2016/01/26/opinion/sarah-palin-rage-whisperer.html?searchResultPosition=19",
      "subtitle": "null",
      "author": "Nicolle Wallace",
      "content": " DONALD J. TRUMP has made a shrewd bet. For the first time since he descended an escalator in Trump Tower last June to announce that this time, he really was running for president, he ceded control of his campaign message. He handed the Trump-bedecked podium over to Sarah Palin. Mr. Trump’s bet: When the politician most fluent in American rage roars, the movement she gave voice to in the fall of 2008 will roar back today. With his call to deport illegal immigrants, especially because Mexico sends us its “bad ones,” his proposal to bar Muslims from entering the country, his emphasis on the threats to lawful gun ownership and his promise to protect American goods and workers from China, Mr. Trump is riding the wave of anxiety that Ms. Palin first gave voice to as Senator John McCain’s running mate. Mr. Trump has now usurped and vastly expanded upon Ms. Palin’s constituency, but the connection between the two movements is undeniable. As a senior adviser to the McCain-Palin campaign in 2008, I understand why, to this day, Senator McCain remains gracious toward Ms. Palin. Despite her shortcomings, she brought out the largest crowds that we’d seen since the campaign started. Voters stood for hours on the rope line to meet her. Her legacy lies in her innate ability to wrap herself in the anger that those voters felt. While Senator McCain seemed slightly unnerved by the intensity of their discontent, Ms. Palin basked in it. I stood backstage at a rally in Minnesota in October 2008 where Senator McCain took the microphone from a woman in the crowd who spoke about her fears, including that Barack Obama was “an Arab.” Senator McCain said, “No, ma’am,” and explained that Mr. Obama was a good and decent family man and an American with whom he simply disagreed on policy matters. This interaction will go down as one of the finest moments from one of the country’s finest men. But it was also an early warning that the Republican base was profoundly agitated. To some in the news media, voter anger seems like a new phenomenon. But they attended the same Palin rallies I did — we all should have seen this coming. The Alaska governor whipped the crowds into a frenzy with her fiery attacks on the media and the establishment politicians that she had gleefully upended in the Alaska statehouse. When her rallygoers shouted crude comments from the stands, as the woman at the Minnesota rally had done, there was no confrontation between Ms. Palin and the offender. When the press started to report on the angry rhetoric coming from those Palin crowds, I remember Senator McCain’s concern. The growing furor in the Republican Party was something that we, as a campaign, failed to address, but to the crowds, Sarah Palin proved the more satisfying politician on the ticket because of it. Ms. Palin owned the resentment voters in the Republican Party. They became her cause. And when the campaign concluded, she became the poster politician for the Tea Party movement. She was its first star, and hers became a coveted endorsement. Ms. Palin typically picks candidates who are trying to unseat incumbents and more experienced politicians, an ironic development considering that she was selected as a running mate to reinforce Mr. McCain’s brand as a “maverick” — but a maverick who worked within the Senate and the Republican Party. She has now turned the institutions in which he has proudly served into liabilities for the candidates running against her mama-grizzly-approved outsiders. The party bears some responsibility for her success. Our base has grown increasingly exasperated with Washington Republicans who, despite historic victories in the midterm elections of 2010 and 2014, seem incapable of reversing President Obama’s legislative agenda or asserting themselves in the country’s foreign policy debates. Ms. Palin has amassed a decent record of success by endorsing conservative stars like Gov. Nikki Haley of South Carolina, Senator Joni Ernst of Iowa and Ted Cruz, of Texas, in his Senate bid. But no endorsement returned her to the spotlight like this embrace of Mr. Trump. Mr. Trump improves upon Ms. Palin’s jagged attempts at a post-2008 message with a vision for reclaiming American greatness by promising better trade deals, improved care for veterans, a more successful foreign policy based on his personal strength and immigration reform that is based mostly on building a wall. His proposals are, at best, vague and of questionable legal soundness, but they’ve propelled his candidacy by inflaming voter concern that America has lost ground. That he would refine and recalibrate his proclamations in a general election or as president is a widely held assumption among the Republican establishment. It’s possible that this is the kind of false comfort that people on a sinking ship murmur to one another about how death by drowning really isn’t a bad way to go. We’ll never know if Sarah Palin would have taken her turn atop the polls at any point during this year’s Republican primary if she’d decided to run. Her inclusion may be the only thing that could have made it more extraordinary. During Ms. Palin’s 37-minute score settling-slash-endorsement address last week, Mr. Trump seemed, at times, uncomfortable and eager for her to wrap things up. Should he come out on top in Iowa, he has her to thank.",
      "date": "Jan. 25, 2016",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin’s Mustache",
      "url": "https://www.nytimes.com/2016/02/26/opinion/campaign-stops/sarah-palins-mustache.html?searchResultPosition=15",
      "subtitle": "null",
      "author": "Julia Baird",
      "content": " IT’S hard to know exactly what impact Sarah Palin’s endorsement of Donald J. Trump has had on his campaign. We do know, however, that the sparkly Milly beaded silk bolero jacket she wore while giving her speech sold out soon after, despite its $695 price tag. But several style experts slammed her choice as inappropriate, and on Twitter a marketing executive likened her to a “disco ball hedgehog.” Women in the public eye walk a perilous line. Last month, President Obama told Politico that he admired Hillary Clinton for the fact that when she was campaigning against him, she had to do everything he had to do but “like Ginger Rogers, backwards in heels.” She even had to wake up earlier than he did, the president said, “because she had to get her hair done.” And now she may yet compete against Mr. Trump, a former owner of the Miss Universe pageant, who poked fun at Carly Fiorina’s face and asked, “Would anyone vote for that?” In Mr. Trump’s spiteful eye, even Angelina Jolie is unattractive and Heidi Klum is “no longer a 10.” Which is ridiculous, coming from a man who is no longer young and has a peculiar hairstyle. Why, then, does the lens through which we view and judge prominent people still remain more magnified, harsh and unforgiving for women than for men? Take, for example, an incident during the run-up to the 2008 presidential election, when I was a senior editor at Newsweek. We were given about 15 minutes to snap Senator John McCain and his running mate, whose identity was at that time a guarded secret: The photo of Mr. McCain and Ms. Palin ran on the cover of our Sept. 8 issue, devoted to the Republican convention. Two months later, we ran a cover story on Ms. Palin with the tag line “She’s One of the Folks.” The editor in charge of covers, Bruce Ramsay, said he wanted a more intimate portrait, so we used a closely cropped version of the earlier image. A female staffer noticed that the crop revealed some untended lip and eyebrow hair, but Mr. Ramsay decided to go ahead with the image unaltered, for several reasons. The magazine had a policy of not retouching photos, and Mr. Ramsay wanted the strong eye contact in the image; in any case, the facial hair was barely noticeable. Once it hit the newsstands, though, conservative commentators fumed, accusing Newsweek of trying to damage Ms. Palin. One Republican media consultant called the cover “mortifying,” “a clear slap in the face.” The image “highlights every imperfection,” she said. “We’re talking unwanted facial hair, pores, wrinkles.” A media business analyst decried it as an insult. “Here’s your beauty queen,” he wrote. Ms. Palin was “your ‘hottest governor from the coldest state.’ How do you like her now that you’ve seen her crows’ feet, her clumpy mascara, her bloodshot eyes, her faint mustache, her cakey makeup, her gaping pores etc?” In short, Newsweek was accused of sexism because we did not airbrush the photo. The truth was, we’d portrayed Ms. Palin just the way we did male candidates. “What was most interesting about the episode is that Newsweek (and probably other media) typically shot men and women differently for news covers,” says Mark Miller, who was Newsweek’s assistant managing editor in 2008. “So when the photographer and crew set up for the August shoot, the lighting was created in anticipation of a male candidate. It was, for lack of a better word, harsher than we would have used for a woman. “In effect, we had typically ‘man lighting’ and ‘female lighting’ — and they weren’t the same. Also, because our editorial policy was not to alter news photos, we generally did not use close-up images of women on the cover because of the potential for an unflattering image.” Bizarre, isn’t it? As Mr. Miller points out: “Close-up photos of men are used all the time without being touched up — men, particularly our political leaders, are expected to have lines and wrinkles. In fact, the cragginess of a man’s face is thought to express character.” The incident reveals fascinating fault lines in the way we view public figures: Why do women need to be perfect? What do we expect from our political leaders? Why can we portray men in close-up and not women? Why are male blemishes signs of authority while women’s are signs of shame? And why, in particular, do we stigmatize female facial hair so savagely? As Victorian literature reveals, women have long sported mustaches, and were not always judged so sorely for it. When Tess rides away with Alec in Thomas Hardy’s “Tess of the D’Urbervilles,” a character’s mother laughs while “stroking her mustache.” In Victoria Cross’s 1903 novel “Six Chapters of a Man’s Life,” the heroine has a mustache “so perceptible that you can see it all across the room.” The male narrator is charmed: “It would spoil most women I know, but it doesn’t seem to spoil her.” The lead character in Albert W. Aiken’s 1895 dime novel “The Female Barber Detective,” Mignon Lawrence, confesses to her landlady that “if I didn’t shave I would have a regular mustache, and as a woman can’t very well go to a barber I am compelled to shave myself.” In “The Woman in White,” the character Marian Halcombe is described as having “dark down on her upper lip” that “was almost a mustache.” Yet when Wilkie Collins’s 1859 story was adapted as a musical by Andrew Lloyd Webber in 2004, this aspect of her appearance was ignored so that the audience would not be “distracted” by her facial hair. Why do we consider a mere hint of the hirsute such a disgrace for women when men can mooch about our cities with goatees, mutton-chop whiskers, navel-skimming beards and even “man buns” with little comment? We think of ourselves as liberated, yet it is still considered embarrassing and shameful for a woman’s upper lip to be imperfectly depilated. I could not care less whether someone waxes, trims, bleaches or zaps — I’m not volunteering to become a champion of hirsutism. Mightier ladies than I may blaze that path. The real question here is about perfection: the standards by which women are judged, and the seemingly ever-present, imposed need to airbrush the images of women. Even vice-presidential candidates. This is something we must ask if we want to shrink the too-long list of things that distract people from what women actually say when we try to speak in public.",
      "date": "Feb. 26, 2016",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin’s Defamation Suit Against New York Times Is Reinstated",
      "url": "https://www.nytimes.com/2019/08/06/business/sarah-palin-lawsuit-new-york-times.html?searchResultPosition=2",
      "subtitle": "null",
      "author": "Marc Tracy",
      "content": " Sarah Palin’s defamation lawsuit against The New York Times Company was reinstated by a federal appellate court on Tuesday, with a three-judge panel ruling that a District Court judge was wrong to dismiss it two years ago. The case involves an editorial The New York Times published in June 2017. Ms. Palin, the former vice presidential candidate, argued in her lawsuit that the editorial had incorrectly linked her to a 2011 mass shooting in which Gabrielle Giffords, then a congresswoman from Arizona, was severely wounded. Ms. Palin’s political action committee had previously circulated a map of electoral districts, some with cross hairs on them, and she said The Times had connected the map to the shooting despite knowing that tie to be false. The Times later issued a correction, saying there was no link between that political rhetoric and the shooting. In August, Judge Jed S. Rakoff of Federal District Court in Manhattan dismissed the suit after an unusual evidentiary hearing in which James Bennet, the editor of the Times editorial page, testified. He said he had not intended to blame Ms. Palin for the shooting of Ms. Giffords, but rather to make a broader statement about the country’s heated political environment. Mr. Bennet inserted the statements that Ms. Palin said were defamatory during the editing process. On Tuesday, a three-judge panel of the United States Court of Appeals for the Second Circuit ruled that it was not for a judge to determine whether Mr. Bennet had acted out of “actual malice,” meaning that he either knew that what he wrote was false or that he acted with “reckless disregard.” The judges said that in light of Mr. Bennet’s testimony, Ms. Palin’s case remained “plausible.” “This is — and has always been — a case about media accountability,” Libby Locke and Ken Turkel, lawyers for Ms. Palin, said in a statement on Tuesday. “We are pleased with the court’s decision, and we look forward to starting discovery and ultimately proceeding to trial.” Eileen Murphy, a spokeswoman for The Times, said, “We are disappointed in the decision and intend to continue to defend the action vigorously.”",
      "date": "Aug. 6, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    }
  ]
}