{
  "articles": [
    {
      "title": "Longing for Obama as President — of France",
      "url": "https://www.nytimes.com/2017/02/28/world/europe/france-obama-president.html?searchResultPosition=109",
      "subtitle": "null",
      "author": "Aurelien Breeden",
      "content": " PARIS — Many voters in France cannot identify all the candidates running for president, who now number more than a dozen. But they recognize the smiling politician on campaign posters with the slogan “Oui on peut.” That’s French for “Yes we can.” While the politician, Barack Obama, is American, that has not stopped a group of Parisians who have started a campaign to persuade him to run for president of France. They say they are deeply uninspired or worried by the actual candidates, most notably Marine Le Pen, the far-right politician who is leading in the polls. The organizers have placed red-white-and-blue posters with Mr. Obama’s portrait, and the French translation of his slogan, around Paris to publicize their campaign. “There isn’t one man or woman that we can project ourselves onto, someone we would want to vote for and fight for without hesitation, someone who unites people and has a strong aura,” one of the French organizers said of why they are supporting Mr. Obama. The idea was originally conceived as a joke, concocted recently over drinks with friends, said the organizer, who asked to be identified only by the name Antoine. He described himself as a fan of the Yes Men, the famous political pranksters, and said that he and his friends were surprised by how many people had signed their online petition. By Tuesday evening, it had attracted more than 43,000 signatures. The goal is to gather one million signatures by March 15 to convince Mr. Obama that he should run because “he has the best C.V. in the world for the job,” according to the petition. Kevin Lewis, a spokesman for Mr. Obama, declined to comment. Europeans viewed Mr. Obama’s departure from office with a mix of admiration and regret, and for those who have struggled to come to grips with President Trump’s attitude and policies, that feeling has only intensified. “I think the timing of it all means that people are very nostalgic of Obama,” Antoine said. But the organizers do not have French law on their side. Presidential candidates must be at least 18 and part of the French electorate. They must gather the signatures of at least 500 elected officials from around the country to be put on the ballot, a requirement introduced by President Charles de Gaulle in 1962. (At that time, the bar was 100.) Most important, they have to be French.",
      "date": "Feb. 28, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Obama Finds a Pen Pal in Iran",
      "url": "https://www.nytimes.com/2013/09/20/world/middleeast/through-diplomacy-obama-finds-a-pen-pal-in-iran.html?searchResultPosition=107",
      "subtitle": "null",
      "author": "Mark Landler",
      "content": " WASHINGTON — Few American presidents have held a deeper belief in the power of the written word than President Obama. And in few ways has that belief been more tested than in his frustrating private correspondence with the leaders of Iran, a country with which the United States has had no diplomatic ties for 34 years. This week, Mr. Obama indicated that he might finally have found a pen pal in Tehran. At the core of Iran’s recent diplomatic charm offensive — a process that has included the release of 11 prominent political prisoners and a series of conciliatory statements by top Iranian officials — is an exchange of letters, confirmed by both sides, between Mr. Obama and President Hassan Rouhani. The election of Mr. Rouhani, a moderate, in June kindled hopes that diplomacy might end the chronic impasse with Iran over its nuclear ambitions. But the letters, and the cautious hope they have generated, suggest there is a genuine opportunity for change. It is not the first time since entering the White House that Mr. Obama has put pen to paper to try to sway Iran’s leadership. Until now, he has had little to show for it: even under the pain of punishing economic sanctions, the Iranian government has shown little interest in negotiating a deal with Washington on its nuclear program. This time, Mr. Rouhani said in an NBC News interview broadcast on Wednesday, the tone of Mr. Obama’s letter was “positive and constructive.” He added, “It could be subtle and tiny steps for a very important future.” Mr. Obama, speaking to the Spanish-language network Telemundo on Tuesday, said there were indications that Mr. Rouhani “is somebody who is looking to open dialogue with the West and with the United States, in a way that we haven’t seen in the past. And so we should test it.” The president has tested Iran before. Having promised as a candidate to extend an olive branch to old enemies, he sent a letter early in his first term to Iran’s supreme leader, Ayatollah Ali Khamenei, proposing a new diplomatic chapter. Ayatollah Khamenei sent a reply, but failed to take Mr. Obama up on his offer. Their correspondence was cut short after Iran’s disputed presidential election in June 2009 unleashed a popular uprising. The ensuing bloody crackdown all but snuffed out diplomacy for the next year. The re-elected president, Mahmoud Ahmadinejad, wrote a lengthy letter to Mr. Obama in 2010, but it did nothing to break the diplomatic ice. The White House declined to discuss the contents of Mr. Obama’s letter to Mr. Rouhani. But a senior administration official said it reflected the president’s judgment that Mr. Rouhani should be taken “very seriously,” in part because he appeared to have a broad mandate within Iran. This is the first time that Mr. Obama has written directly to an Iranian president, and not the supreme leader. That suggests that the White House believes Ayatollah Khamenei has empowered Mr. Rouhani, at least for now, to seek an opening with the West. Mr. Ahmadinejad, though not as hostile to a nuclear agreement as sometimes portrayed, was undermined by other senior officials and did not enjoy the supreme leader’s full confidence. “The administration’s previous position was that we correspond with the person who makes decisions,” said Ray Takeyh, an Iran expert at the Council on Foreign Relations. “Now they’re sending them to Rouhani.” Another major difference is that the new exchange of letters comes in the wake of the administration’s agreement with Russia to seek the peaceful transfer of Syria’s chemical weapons. To make that plan work, analysts said, it would be helpful for Iran, as the staunchest regional ally of President Bashar al-Assad of Syria, to play a constructive role. Whether that is possible is highly questionable, of course. But it gives Mr. Obama a broader diplomatic context in which to engage Mr. Rouhani. The United States has generally insisted on negotiating with Iran purely on its nuclear program, which has left both sides with little to talk about after the inevitable clashes over the number of centrifuges or the amount of enriched uranium that the Iranians are producing. “At the end of the day, Obama stumbled into diplomacy because of what happened with Syria,” said Trita Parsi, president of the National Iranian American Council, who has written a book about Mr. Obama’s diplomatic efforts, “A Single Roll of the Dice.” Iran’s news media have reported that Mr. Obama’s letter included a plea to re-engage in diplomacy; a suggestion — depending on how any talks went — that the United States would be willing to ease sanctions; and a request to initiate direct discussions between Washington and Tehran, something diplomats say is critical to striking a nuclear deal. None of this should be a big surprise. The United States has long been eager for direct talks with Iran. The bigger question is whether Mr. Rouhani is in the position to make concessions on a nuclear program that Tehran insists is for peaceful purposes and that the United States suspects is aimed at achieving the ability to produce nuclear weapons. If direct negotiations were to begin, Mr. Obama’s letter-writing skills might again be called into play. “Presidential correspondence,” said Dennis B. Ross, who advised Mr. Obama on Iran at the White House, “is used often in negotiations as a form of assurance or clarification.” Mr. Ross said the president’s reliance on letters to Iranian leaders made sense because in the absence of a formal relationship, “there are few other fully authoritative ways to convey a message we completely control.” The letters, his advisers say, also reflect the value that Mr. Obama attaches to direct diplomacy. Mr. Obama and Mr. Rouhani both plan to speak to the United Nations General Assembly on Tuesday. Will they try an even more direct form of diplomacy: greeting each other in person? The White House says nothing is planned. For now, though, Mr. Obama’s pen-pal diplomacy has accomplished the most basic goal of any letter. It got a reply.",
      "date": "Sept. 19, 2013",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Obama Family Spring Break: Making History and Doing the Tango",
      "url": "https://www.nytimes.com/2016/03/26/world/americas/obama-argentina-tango.html?searchResultPosition=105",
      "subtitle": "null",
      "author": "Julie Hirschfeld Davis",
      "content": " BARILOCHE, Argentina — The presidential motorcade wove down winding roads flanked by steep grass-covered hills and a deep-blue alpine lake, delivering President Obama and his family to the trailhead of a hike through the lush woods of one of Argentina’s most spectacular regions. It was the final day of the Obama Family Spring Break, and one of the last big overseas adventures Mr. Obama and his wife and daughters will have before he leaves office. Mr. Obama and Michelle Obama, along with their daughters, Sasha, 14, and Malia, 17, and Mrs. Obama’s mother, Marian Robinson, were here in Patagonia for a glimpse of stunning scenery after a trip to Cuba and Argentina that has been packed with diplomatic firsts — official meetings and state dinners — but not much family downtime. So on Thursday, the president took the afternoon off and flew Air Force One two hours southwest of Buenos Aires for a hike in Llao Llao Park and a boat ride on Lake Nahuel Huapi, with Mrs. Obama and Malia in tow. Sasha and Mrs. Robinson skipped the activities, relaxing at a luxury resort overlooking the lake. It is rare for Mr. Obama to bring his daughters, whose privacy the White House guards vigilantly, with him on his closely watched trips overseas. This time, with a history-making adventure during school vacation, the president was determined to show them parts of the world they might not otherwise get to see. “My wife, Michelle, and I brought our daughters — and by the way, they don’t always want to go with us; they’re teenagers now,” Mr. Obama told reporters in Havana. “They have friends at home and they have things to do, but they wanted to come to Cuba because they understood, and we wanted to show them, the beauty of Cuba and its people.” Like many family vacations, this one had its ups and downs. What was planned as a leisurely family stroll through Old Havana became a soaked slog over slippery cobblestones on Sunday under an unexpected downpour. Malia and Sasha, grim-faced under large umbrellas, stepped around puddles as crowds of Cubans gawked and applauded, yelling, “Obama!” Later, Malia translated Spanish for her father at a Cuban restaurant when he chatted with the chef. The daughters appeared cheerier in the sun on Tuesday during a baseball game at the Estadio Latinamericano, watching the Tampa Bay Rays beat the Cuban national team. But when Mr. Obama and the rest of his entourage rose to do the wave, Sasha stayed seated, her arm over her face as if mortified. A Presidential Tango It’s not every day that the leader of the free world engages in a steamy dance routine with a stranger. But on Wednesday at a state dinner in Buenos Aires hosted by Mauricio Macri, the Argentine president, Mr. Obama succumbed to one of the country’s best-known charms, doing an impromptu tango with a professional dancer clad in a silver dress. Mora Godoy, a renowned Argentine dancer, and a male partner were on hand as entertainment at the elegant dinner, which featured a menu of smoked trout, lamb and a dulce de leche “volcano.” But after their performance, Ms. Godoy approached Mr. Obama and asked him to join her. He initially refused but then, prodded by his Argentine counterpart, relented. What followed was a presidential tango, complete with dramatic steps, spins and what appeared to be an aborted dip in which Ms. Godoy raised a bent leg high against Mr. Obama’s thigh. Mrs. Obama got in on the fun as well, dancing her own tango with Ms. Godoy’s partner. Détente’s Body Language They shook hands cheerfully, eyed each other warily, touched arms awkwardly and locked eyes meaningfully across a crowded theater. Then they donned shades and kicked back together for a baseball game. To watch the body language between Mr. Obama and President Raúl Castro of Cuba this week was to witness the unfolding of a complicated relationship — warm and respectful yet tinged with suspicion, cooperative yet competitive. At an extraordinary joint news conference at the Revolutionary Palace, they seemed to grapple for control, Mr. Obama gently coaching Mr. Castro on how to handle questions from a free press, and the Cuban president resisting testily. Mr. Obama leaned indulgently on his lectern at one point when Mr. Castro abruptly paused the news conference to confer with an aide over whether to answer an American reporter’s question about Cuba’s political prisoners. After several moments, Mr. Obama, with a wry and somewhat impatient look on his face, glanced toward Mr. Castro and said, “Excuse me.” All the while, Mr. Castro’s grandson and head bodyguard stood off to one side of the stage, looking ready to pounce. The Cuban leader showed flashes of temper, at times yanking at his translation headset, at others raising his voice. The episode ended with a supremely goofy salute, Mr. Castro clasping Mr. Obama’s limp wrist as they appeared to vacillate between handshake and revolutionary fist pump. The next day, Mr. Castro smiled broadly and waved from the balcony of the ornate Grand Theater of Havana before Mr. Obama’s speech. As the audience cheered him, Mr. Castro kept pointing to the stage where Mr. Obama would stand. But Mr. Castro sat stonily as Mr. Obama directly admonished him during the speech to open Cuba’s economy and political system. Afterward, Mr. Obama gazed across the theater and silently mouthed “Thank you” to his host as the Cuban classic “Guantanamera” blared. By the start of the baseball game between the Rays and the Cuban team, the two presidents had traded ties for shades. Surrounded by their families, they sat side by side, an interpreter just behind them, and chatted like old friends. An Invasion of a Different Sort It was not the invasion that the Cubans have long feared. But when Mr. Obama arrived in Havana with hundreds of Americans in his entourage, it did seem a bit like the United States had taken over the island. Members of Congress milled around the Parque Central, gawking and snapping pictures like tourists. The White House press corps took over a floor in a large hotel, treating it as a filing center, snack bar and general meeting area. At a Havana restaurant with sweeping harbor views and cannons out front, Jimmy Buffett sat with the band and Derek Jeter mingled with guests invited by Major League Baseball to celebrate the game. Senior White House staff members stood elbow to elbow with the professional ballplayers, and next to 1950s cars, as waiters passed trays of mojitos. Secretary of State John Kerry and Penny Pritzker, the commerce secretary, were also there. Late in the evening, after the state dinner, several lawmakers joined in, bopping to Mr. Buffett’s music in their cocktail attire. As a man hand-rolled Cuban cigars nearby, Representative Nancy Pelosi, Democrat of California and the minority leader, belted out all the words to “Margaritaville.”",
      "date": "March 25, 2016",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Obama’s Global Visits Inspire Wistful Comparisons of Then and Now",
      "url": "https://www.nytimes.com/2017/06/09/world/americas/obama-trudeau-dinner.html?searchResultPosition=104",
      "subtitle": "null",
      "author": "Mark Landler",
      "content": " WASHINGTON — Sleeves rolled up and tieless, with a candle glowing between them, the two friends slid into a booth next to the kitchen at Liverpool House, a cozy seafood place in a hip Montreal neighborhood. They chatted over oysters, Nova Scotia halibut and a rib steak for two. That was former President Barack Obama and Prime Minister Justin Trudeau of Canada last Tuesday. Two weeks ago, Mr. Obama and former Prime Minister David Cameron shared a similar scene at a hotel in London. Before that, there were meet-ups with Chancellor Angela Merkel at the Brandenburg Gate in Berlin, and Matteo Renzi, the former prime minister of Italy, in Milan. One might be forgiven for thinking that Mr. Obama was trolling President Trump. At a moment when Mr. Trump has left Europeans despairing about the trans-Atlantic relationship, his predecessor is in the middle of a Group of 7 reunion tour. While Mr. Trump lectures his fellow leaders about paying more for NATO or ignores their pleas not to pull out of the Paris climate accord, Mr. Obama appears on panels with allies to discuss issues like food security or how to inspire young people to be more active in their communities. The meetings beforehand or afterward are private, though they quickly end up on social media, often accompanied by commentary so wistful it makes one imagine the nostalgic G-7 leaders murmuring, “We may not always have Paris, but we’ll always have Barack.” Mr. Obama has generally tried to stay above the political fray in his nascent post-presidency. But in these charged times, just breaking bread with a world leader can take on a political subtext. It is a tension his advisers recognize, and say they try to mitigate by holding get-togethers at Mr. Obama’s hotel and avoiding the trappings of leader-to-leader meetings. “We recognize if he goes to a foreign country and meets the leader of that country, there is an interest, given the unusual circumstance we’re in,” said Benjamin J. Rhodes, who advised Mr. Obama in the White House and still goes with him on overseas trips. “He’s really trying not to have these be platforms to weigh in on the issues of the day.” The challenge, Mr. Rhodes acknowledged, is, “How does he do it without looking like the leader of the global progressive resistance?” The former president’s situation is complicated by the fact that he remains extremely popular in most of the world — starkly contrasting with Mr. Trump — meaning foreign leaders can easily use a meeting with Mr. Obama to their political advantage at home. Mr. Trudeau lost no time tweeting a picture of himself at dinner with the former president, adding a post, in French and English: “How do we get young leaders to take action in their communities? Thanks @BarackObama for your visit & insights tonight in my hometown.” Mr. Renzi, whom Mr. Obama feted in his last state dinner at the White House, is plotting his own political comeback after resigning in the wake of a failed Italian referendum last December. During their meeting in Milan, Mr. Renzi suggested they place an impromptu call to another friend of his, Emmanuel Macron, who had just won the French presidency. Mr. Obama had broken his stay-out-of-politics vow to endorse Mr. Macron. The former president viewed it as “almost an emergency election,” Mr. Rhodes said, given that a victory by France’s far-right leader, Marine Le Pen, would have meant another Western country lost to a populist tide. The alliance between Mr. Obama and Mr. Macron draws an inevitable contrast to the new French president’s relationship with Mr. Trump. It began in Brussels with a death-grip handshake and continued when Mr. Macron frowned visibly as he watched Mr. Trump scold NATO members for not paying their fair share for the upkeep of the alliance. In that speech, which came after the two presidents lunched, Mr. Trump also failed to reaffirm America’s commitment to the mutual defense clause in the NATO alliance — although he reversed that stance on Friday. Mr. Trump’s omission in Brussels caught his national security team off guard. One official said the president and his senior adviser, Stephen Miller, tinkered with his remarks after seeing Mr. Macron. With atmospherics like that, diplomats said, Mr. Obama could not help but be viewed as a kind of antidote. “With Trump’s rude, insulting and destabilizing NATO trip, Obama hardly needs to go out of his way to remind people how disastrous Trump is for the trans-Atlantic alliance,” said Philip H. Gordon, who was assistant secretary for European affairs in the Obama administration. “The comparison is inevitable and, I’m sure, doesn’t bother him.” For Mr. Obama, the irony is that while he was president, he was criticized for keeping his distance from foreign leaders and not cultivating the kind of friendships that Bill Clinton or the elder George Bush did. But Mr. Obama did befriend a small circle of mostly European leaders: Mrs. Merkel and Mr. Cameron, and later in his presidency, Mr. Renzi and Mr. Trudeau. His recent meetings, Mr. Rhodes said, have been driven less by political symbolism than by a desire to maintain these friendships. In the case of Ms. Merkel, Mr. Obama last year accepted her invitation to appear on a panel on the occasion of the 500th anniversary of Martin Luther’s Reformation. Tens of thousands of people gathered at the Brandenburg Gate last month to listen to Mr. Obama praise Ms. Merkel for her “outstanding work, not just here but around the world.” On his next trip, to South Korea in July, Mr. Obama plans to see Lee Myung-bak, a former president with whom he developed a rapport while in office. But even there, politics could intrude. South Korea’s new president, Moon Jae-in, recently halted the deployment of an American missile-defense battery designed to protect the South from North Korea. Mr. Trump ruffled feathers during South Korea’s presidential campaign when he demanded that Seoul pay for the system. The next day, his national security adviser, Lt. Gen. H. R. McMaster, called South Korean officials to clarify that the United States would pay for it. Over time, Mr. Rhodes predicted, people would lose interest in Mr. Obama’s meetings with foreign leaders. Some Europeans argue that beyond the gauzy symbolism, that is already happening. “It was nice for the chancellor to have him in Berlin,” said Norbert Röttgen, a foreign affairs expert in Ms. Merkel’s Christian Democratic Union party. “He is a striking contrast to his successor. But it doesn’t matter at all in the political sense. He is the past.”",
      "date": "June 9, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Obama, Perhaps Slyly, Calls Attention to Vietnam’s Brain Drain",
      "url": "https://www.nytimes.com/2016/05/26/world/asia/obama-vietnam-visit.html?searchResultPosition=100",
      "subtitle": "null",
      "author": "Gardiner Harris",
      "content": " HO CHI MINH CITY, Vietnam — President Obama told a gathering of young Vietnamese on Wednesday that the country need not worry about losing its most talented people, but then he proceeded to describe conditions for emigration that fit Vietnam perfectly. “The places that lose talent, it’s where there’s a lot of corruption,” Mr. Obama said in Ho Chi Minh City at a town-hall style meeting of the Young Southeast Asian Leaders Initiative, a United States-sponsored mentoring program. Mr. Obama said that people despair of having to pay bribes to start businesses or do the things they want to do, so they leave. Development agencies and businesses say they must pay bribes to Vietnamese officials for anywhere from 20 percent to 50 percent of the cost of a project to get it completed. Another reason people leave their home countries is environmental issues, Mr. Obama added. “No job is so important that it’s O.K. if your children have asthma and they can’t breathe.” The United States Embassy in Hanoi, the capital, recently installed air pollution monitors, and during Mr. Obama’s speech, the level of the most dangerous particles in Hanoi was 158, which is considered unhealthy. High pollution levels substantially increase the risk that children grow up with asthma and weakened lungs. Heavy pollution also increases the risk of heart attacks and strokes in adults. Mr. Obama said that countries with poor education systems tend to lose talent. Vietnam’s higher education system is considered poor, and many Vietnamese go abroad in search of a better education. More than 125,000 Vietnamese studied abroad in 2013, with more than 19,000 going to the United States. As part of efforts to improve Vietnam’s education system, the United States is supporting the creation of Fulbright University Vietnam. It was most likely intentional that Mr. Obama’s reasons for countries losing their most talented people were such a close match for Vietnam. During his three-day trip, which ended Wednesday, the president had sought to prod Vietnam’s authoritarian Communist government into loosening its grip. Mr. Obama also called on Hang Lam Trang Anh, a young rapper known as Suboi who has performed at the Austin, Tex., music and technology event South by Southwest. She said, “As an artist we have a lot to say.” “I want to know how important it is for a nation to really help and promote their art and culture,” Ms. Trang Anh said. Mr. Obama asked her to rap and even provided a brief beat by aspirating into the microphone. Ms. Trang Anh obliged in Vietnamese, and Mr. Obama asked what she had rapped about. “I was just talking about some people having a lot of money, having big houses, but actually are they really happy,” she said. Mr. Obama also promised that his commitment to mentoring programs would continue no matter who succeeds him, even if he has to support such efforts through his own philanthropy. “If you ask me what I’m most excited about in terms of my legacy 20 years from now, I would feel really good if I see 10,000 or 20,000 or 50,000 young leaders who are now taking over governments and businesses and nonprofit organizations,” he said. “If I can help facilitate that, that would be something I’d be very proud of.” The president then headed to Shima, Japan, where he met with Prime Minister Shinzo Abe ahead of Group of 7 meetings. Mr. Obama said he would use his visit to Hiroshima on Friday to reflect on the suffering caused by war. Mr. Abe said he had “no specific plans” to reciprocate the gesture by visiting Pearl Harbor.",
      "date": "May 25, 2016",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Obama Reports Gains, and ‘Momentum,’ Against ISIS",
      "url": "https://www.nytimes.com/2016/04/14/world/middleeast/obama-reports-gains-and-momentum-against-isis.html?searchResultPosition=99",
      "subtitle": "null",
      "author": "Julie Hirschfeld Davis",
      "content": " WASHINGTON — President Obama said on Wednesday that while the Islamic State could still “inflict horrific violence on the innocent,” the United States had made substantial gains in combating the group, reducing its forces to the lowest level in two years and squeezing its cash flow. “We have momentum, and we intend to keep that momentum,” Mr. Obama said after meeting with a broad group of national security officials at the headquarters of the Central Intelligence Agency in Langley, Va. “The ISIL core in Syria and Iraq continues to shrink.” The meeting was one in a series of high-level gatherings Mr. Obama has convened outside the White House to take stock of the United States-led effort against the Sunni extremist group, also known as ISIS and ISIL, and to plot strategy for the months ahead. It was the first of those meetings since the bombings in Brussels last month, which killed 32 people and injured 300 more, the latest demonstration of the organization’s continuing ability to attack Western capitals far from its base in Syria and Iraq. Mr. Obama said the attacks were intended to “weaken our collective resolve.” “Once again, they have failed,” he added. “Their barbarism only stiffens our unity and determination to wipe this vile terrorist organization off the face of the earth.” Mr. Obama has faced criticism for his approach, mostly from Republicans who argue that he has been too restrained in using military force to destroy the Islamic State and insufficiently concerned about the threat it poses. On Wednesday, he sought to demonstrate the intensity of his focus on the issue, citing the number of top leaders who have been killed, the battlefield gains in Iraq and Syria, and the setbacks inflicted on the oil production that provides the Islamic State with its main source of money as evidence of the progress the United States and its allies have made against the group. “Their ranks of fighters are estimated to be at their lowest levels in about two years, and more and more of them are realizing that their cause is lost,” Mr. Obama said. “Our cyberoperations are disrupting their command and control and communications. We continue to target ISIL’s financial infrastructure.” Mr. Obama said American-led forces were also continuing to go after remnants of Al Qaeda “that still pose a significant threat to U.S. interests, our allies and the homeland,” and trying to prevent foreign fighters from entering Europe to carry out attacks. “We’re sending a message: If you target Americans, you have no safe haven — we will find you,” Mr. Obama said. “Our intelligence professionals and those of other nations have stopped numerous terrorist operatives in Syria and Iraq from entering Europe, thereby preventing attacks and gaining valuable intelligence.” “The world does not always hear about” these operations, Mr. Obama added. The president, who has drawn criticism for saying the Islamic State does not pose an existential threat to the United States, used the appearance to press that case. “In the face of terrorists who try to spread panic, we have to refuse to give in to fear,” Mr. Obama said. “We’ve prevailed over much greater threats.”",
      "date": "April 13, 2016",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Obama Looks to History and Future in Senegal",
      "url": "https://www.nytimes.com/2013/06/28/world/africa/obama-africa-tour.html?searchResultPosition=97",
      "subtitle": "null",
      "author": "Michael D. Shear",
      "content": " DAKAR, Senegal — President Obama looked across the Atlantic Ocean as he stood in a stone doorway at Gorée Island, a symbolically important landmark that serves as a reminder of ships bound for America bearing African slaves in shackles. America’s first black president spent about a half-hour inside the slave house on the edge of the water, walking quietly with his wife, Michelle Obama, a descendant of slaves, by his side. Photographers briefly captured a reflective-looking president in the “door of no return.” Afterward, Mr. Obama was stoic, describing the visit only as a “very powerful moment” that helped him to “fully appreciate the magnitude of the slave trade,” which for so long defined the history of blacks in the United States. “Obviously, for an African-American, an African-American president, to be able to visit this site, I think gives me even greater motivation in terms of human rights around the world,” he said. Mr. Obama formally opened his visit to the African continent earlier in the day at the Palace of the President, where he met with President Macky Sall of Senegal to discuss opportunities for greater trade and investment that could bolster the economies of both countries. “I see this as a moment of great promise and great progress for the continent,” Mr. Obama said. “All too often, the world overlooks the amazing progress that Africa is making.” In his first extended visit to Africa since becoming president, Mr. Obama was greeted by some large crowds, including women dressed in traditional white garb to signify peace. Despite that greeting, some Africans have criticized Mr. Obama for what they say has been a lack of attention and investment. As president, he spent one day in sub-Saharan Africa in 2009, delivering a speech in Ghana. Mwangi S. Kimenyi, a senior fellow at the Brookings Institution, said: “Africans have been largely disappointed, especially when they look at the focus on Africa by the previous presidents. They therefore have a feeling that President Obama is still not in tune with the emerging continent.” Meanwhile, Chinese leaders have traveled extensively in Africa in the last several years, investing billions of dollars in infrastructure throughout the continent. American officials concede the challenge from China and other countries but insist that the United States has not been absent. “China’s paying a lot of attention to Africa,” Mr. Obama said in his news conference. “Brazil, Turkey, India are heavily invested in trying to expand trade and commerce with Africa.” White House officials said the president’s trip would provide an opportunity for American businesses to increase their investments in African countries and to bolster trade with their counterparts on the continent. “We, frankly, have heard a high-demand signal from the U.S. private sector for us to play an active role in deepening our trade and investment partnerships in Africa,” said Benjamin J. Rhodes, Mr. Obama’s deputy national security adviser. For Mr. Obama’s administration, the weeklong visit to Africa is an important part of shaping policy regarding trade, security and human rights. But for the president himself, it is also a personal journey to countries that count him as one of their own. As he walked onto Gorée Island from a ferry on Thursday afternoon, hundreds of residents of the area screamed with glee, many of them wearing white T-shirts emblazoned with his face and the words: “Welcome home, Mr. President.” If the slave quarters made him somber, then the long rope line packed with eager faces had the opposite effect. Mr. Obama had a broad smile on his face as he shook the many hands reaching out to touch him. He held a baby for the cameras and moved briefly to the beat of bongo drums. Since becoming president in 2009, Mr. Obama has often deflected questions about the racial barrier he broke in that first election. When asked about his efforts to raise the quality of life for African-Americans, he often responds by saying that he was elected to be the president of all Americans. But here, in Africa, it is harder for him to avoid the history he has made. In the days ahead, Mr. Obama will have more opportunities to reflect on the connection he feels with Africa. He is scheduled to deliver the marquee speech of his trip to college students in South Africa. “This is going to be a continent that is on the move,” Mr. Obama said at the end of a news conference in Senegal. “It is young. It is vibrant and full of energy. And there’s a reason why a lot of other countries around the world are spending a lot of time here.” He will not visit Kenya, where his father was born. That has become a source of disappointment for many there. And anger about some of Mr. Obama’s policies — including his embrace of some of the antiterrorism efforts of President George W. Bush — has dampened the enthusiasm for his arrival in some places. In his remarks to reporters, Mr. Obama gave little indication of his personal motivations on the trip. Instead, he repeated his belief that the United States should not “lose focus” on cultivating relationships with African countries. “The reason I came to Africa is because Africa is rising,” Mr. Obama said. “And it is in the United States’ interests — not simply in Africa’s interests — that the United States don’t miss the opportunity to deepen and broaden the partnerships and potential here.”",
      "date": "June 27, 2013",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Extending a Hand, Obama Finds a Cold Shoulder Abroad",
      "url": "https://www.nytimes.com/2013/06/19/world/americas/extending-a-hand-abroad-obama-often-finds-a-cold-shoulder.html?searchResultPosition=96",
      "subtitle": "null",
      "author": "Mark Landler",
      "content": "  WASHINGTON — Over porterhouse steak and cherry pie at a desert estate in California earlier this month, President Obama delivered a stern lecture to President Xi Jinping about China’s disputes with its neighbors. If it is going to be a rising power, he scolded, it needs to behave like one. The next morning, Mr. Xi punched back, accusing the United States of the same computer hacking tactics it attributed to China. It was, Mr. Obama acknowledged, “a very blunt conversation.” Ten days later, in Northern Ireland, Mr. Obama had another tough meeting with a prickly leader, President Vladimir V. Putin of Russia. At odds with him over the Syrian civil war, Mr. Obama tried to lighten the mood by joking about how age was depleting their athletic skills. Mr. Putin, a decade older and fending off questions at home about his health, seemed sensitive on the point. “The president just wants to get me to relax,” he said with a taut smile. While tangling with the leaders of two cold war antagonists of the United States is nothing new, the two bruising encounters in such a short span underscore a hard reality for Mr. Obama as he heads deeper into a second term that may come to be dominated by foreign policy: his main counterparts on the world stage are not his friends, and they make little attempt to cloak their disagreements in diplomatic niceties. Even his friends are not always so friendly. On Wednesday, for example, the president is to meet in Berlin with Chancellor Angela Merkel of Germany, who has invited him to deliver a speech at the Brandenburg Gate. But Ms. Merkel is also expected to press Mr. Obama about the National Security Agency’s surveillance programs, which offend privacy-minded Germans. For all of his effort to cultivate personal ties with foreign counterparts over the last four and a half years — the informal “shirt-sleeves summit” with Mr. Xi was supposed to nurture a friendly rapport that White House aides acknowledge did not materialize — Mr. Obama has complicated relationships with some, and has bet on others who came to disappoint him. “In Europe, especially, Obama was welcomed with open arms, and some people had unrealistic expectations about him,” said R. Nicholas Burns, a longtime senior American diplomat. Noting that Mr. Obama continued some unpopular policies like the use of drones, he said, “People don’t appreciate that American interests continue from administration to administration.” White House officials said Mr. Obama’s meetings with Mr. Xi and Mr. Putin were productive, regardless of the atmospherics. One of the president’s most problematic relationships, with Prime Minister Benjamin Netanyahu of Israel, has improved since he visited Jerusalem in March, with their differences over Iran’s nuclear program narrowing. Still, for a naturally reserved president who has assiduously cultivated a handful of leaders, it has been a dispiriting stretch. Prime Minister Recep Tayyip Erdogan of Turkey, whom Mr. Obama views as a new kind of Muslim leader, has used tear gas and water cannons against protesters in Istanbul. Mohamed Morsi, the Muslim Brotherhood leader whom Mr. Obama telephoned repeatedly after he became president of Egypt, later granted himself unlimited powers, though he also cut off ties with Syria. Mr. Obama spent nearly four years befriending Mr. Putin’s predecessor, Dmitri A. Medvedev, hoping to build him up as a counterweight to Mr. Putin. That never happened, and Mr. Obama now finds himself back at square one with a Russian leader who appears less likely than ever to find common ground with the United States on issues like Syria. Administration officials argue that their bet on Mr. Medvedev made sense at the time and yielded benefits, not just in an arms treaty but also in Russian support for sanctions against Iran, acquiescence to the NATO operation in Libya and agreement to allow American troops to travel through Russian airspace to Afghanistan. While White House officials worry about Mr. Morsi’s authoritarian tendencies, they note that he was helpful in brokering a cease-fire between Israel and Hamas in Gaza. Mr. Erdogan’s troubles, they said, do not obscure the fact that at Mr. Obama’s behest, he and Mr. Netanyahu agreed to mend the frayed ties between Turkey and Israel. As for Mr. Xi, officials said, the body language matters less than the fact that he and Mr. Obama were able to discuss the most difficult issues between China and the United States. On one — how to deal with a nuclear North Korea — they appeared to make progress. “You don’t need to be buddies with someone to establish an effective relationship,” said Mr. Burns, who now teaches at Harvard. “Not everyone can be Roosevelt and Churchill forming a personal bond to end the Second World War.” Even with friends, however, there is tension. President François Hollande of France was initially thrilled with Mr. Obama because he saw him as an ally against Ms. Merkel on economic issues. But by the time they met at the Group of 8 summit meeting in Northern Ireland on Tuesday, the relationship had soured, according to French analysts, because France is frustrated that the United States did not do more to help with the war in Mali and resisted a more robust response to Syria. Mr. Obama differs from his most recent predecessors, who made personal relationships with leaders the cornerstone of their foreign policies. The first George Bush moved gracefully in foreign capitals, while Presidents Bill Clinton and George W. Bush related to fellow leaders as politicians, trying to understand their pressures and constituencies. “That’s not President Obama’s style,” said James B. Steinberg, Mr. Clinton’s deputy national security adviser and Mr. Obama’s deputy secretary of state. Such relationships matter, Mr. Steinberg said, but they are not the driving force behind a leader’s decision making. “They do what they believe is in the interest of their country and they’re not going to do it differently just because they have a good relationship with another leader,” he said. For Mr. Obama, no relationship is more prickly, and yet more significant, than that with Mr. Putin. Mr. Clinton and Mr. Bush forged strong partnerships with their Russian counterparts, Boris Yeltsin and Mr. Putin, respectively. But even that did not prevent ruptures over NATO military action in Kosovo and the Russian war in Georgia. Mr. Obama arrived in office determined to invest in Mr. Medvedev, but he underestimated Mr. Putin’s continuing power. Their first meeting was marked by a nearly hourlong lecture by Mr. Putin about all the ways the United States had offended Moscow. At their second, Mr. Putin kept Mr. Obama waiting 30 minutes. “Obama doesn’t really take kindly to being harangued, so we knew from the beginning that he and Putin weren’t going to have a good basis together,” said Fiona Hill, a former top American analyst about Russia and co-author of a book on Mr. Putin. However strained their appearance on Monday, Mr. Obama did not publicly criticize Mr. Putin on human rights or the rule of law. While the White House is frustrated by Russia’s refusal to abandon Syria’s president, Bashar al-Assad, Mr. Obama has been reluctant to intervene more forcefully on behalf of the rebels. As Ms. Hill noted, even Mr. Bush’s friendship did not stop Mr. Putin from crossing him. “With Obama,” she said, “there’s no pretense of personal chemistry, and the results may be the same.”",
      "date": "June 18, 2013",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Obama Meets Raúl Castro, Making History",
      "url": "https://www.nytimes.com/2015/04/12/world/americas/obama-cuba-summit-of-the-americas.html?searchResultPosition=95",
      "subtitle": "null",
      "author": "Julie Hirschfeld Davis",
      "content": "  PANAMA — President Obama and President Raúl Castro of Cuba met here Saturday in the first face-to-face discussion between the leaders of the two countries in a half-century. Seated beside Mr. Castro in a small room in the convention center downtown where the Summit of the Americas was being held, Mr. Obama called it a “historic meeting.” “Our governments will continue to have differences,” he said at a news conference wrapping up the summit meeting. “At the same time, we agreed that we can continue to take steps forward that advance our mutual interests.” He called his meeting with Mr. Castro “candid and fruitful,” and said work would continue on the goal he announced in December of re-establishing diplomatic relations and reopening embassies in Havana and Washington. Still, Mr. Obama said crucial steps in the normalization process would not be completed rapidly. He stopped short of announcing a final decision, now widely expected, to remove Cuba from the United States’ list of state sponsors of terrorism, saying he wanted to study it further. For now, Mr. Obama argued, the best way to address the United States’ disagreements with Cuba and other countries in the hemisphere on such issues as human rights and democracy was by engaging with them. “So often, when we insert ourselves in ways that go beyond persuasion, it’s counterproductive, it backfires,” he said, adding that was “why countries keep on trying to use us as an excuse for their own governance failures.” “Let’s take away the excuse,” Mr. Obama said. Mr. Castro said he wanted a new beginning with the United States despite the two countries’ “long and complicated history.” He added that “we are willing to discuss everything, but we need to be patient — very patient.” The meeting on the sidelines of the Summit of the Americas was an important step for Mr. Obama as he seeks to ease tensions with Cuba and defuse a generations-old dispute that has also affected relations with the other countries of the region. Since his first foray to the summit meeting three months after taking office, Mr. Obama has seen one bone of contention frustrate his efforts to reach out to the United States’ hemispheric neighbors: the fact that Cuba was blackballed from the gathering. He was scolded by Argentina’s president for maintaining an “anachronistic blockade,” lectured by Bolivia’s president about behaving “like a dictatorship,” and in 2012 blamed for the failure of leaders to agree on a joint declaration — the result, his Colombian host said, of the dispute over Cuba. This year, Mr. Obama came to the summit meeting here determined to change the dynamic with a series of overtures to Cuba. In addition to the meeting with Mr. Castro, 83, the gathering was the first time in the more than 20-year history of the summit meeting that Cuba was allowed to attend. “The United States will not be imprisoned by the past — we’re looking to the future,” Mr. Obama, 53, said of his approach to Cuba at the summit meeting’s first plenary session on Saturday. “I’m not interested in having battles that frankly started before I was born.” “The Cold War,” he added, “has been over for a long time.” He said the shift in policy would be a turning point for the entire region. Mr. Castro, in a speech of more than 45 minutes that went well beyond the allotted eight minutes, spoke in unusually warm tones about an American president who has sought reconciliation with his country. But in a nod to allies like Venezuela that still support Cuba, he also delivered a lengthy diatribe on historical American injustices in the hemisphere. Mr. Castro said he had read Mr. Obama’s books and praised his background as “humble.” He saluted his “brave” decision to take steps against a trade embargo against Cuba by using his executive powers to loosen a host of travel and commerce restrictions. And he thanked Mr. Obama for vowing a “rapid decision” on removing Cuba from the United States government’s list of states that sponsor international terrorism, a designation that has hobbled Cuba’s ability to bank with the United States and some foreign creditors. Mr. Obama and Mr. Castro spent time during their hourlong meeting reflecting on the significance of the moment for Cubans, Americans and the entire region, said a senior administration official who would describe the private session only on the condition of anonymity. There was no tension in the room, the official said, but the two presidents did not agree on everything. While they both committed to opening embassies in each other’s countries, Mr. Obama stressed what has emerged as a sticking point in the talks over opening an American embassy in Havana: ensuring that diplomats could move freely around the country. And Mr. Castro said he wanted to see the United States trade embargo against Cuba lifted, which Mr. Obama has called on Congress to do. At a news conference, Bruno Rodríguez, the Cuban foreign minister, said his meeting with Secretary of State John Kerry on Thursday, and Mr. Castro’s with Mr. Obama, allowed the countries to draw closer. “A principal result is that these two governments now know each other better,” Mr. Rodríguez said. “We have a better understanding of our common ground, a better idea of our mutual interests” and “better knowledge of the scope and depth of our differences.” For Mr. Obama, the summit meeting was a chance to showcase progress toward a goal he aspired to during the first Latin American summit meeting he attended — where he spoke of a “new beginning” with Cuba even in its absence — and to clear away what had become a dysfunctional subtext of the meeting for generations of American presidents. “Our Cuba policy, instead of isolating Cuba, was isolating the United States in our own backyard,” said Benjamin J. Rhodes, Mr. Obama’s deputy national security adviser for strategic communications. “This time, we arrived here, yes, certainly not agreeing with everybody on everything,” he said, but with “broad agreement with the leaders here that what the president did was the right thing.” “It is going to open up the door not just to greater engagement with Cuba, but potentially more constructive relations across the hemisphere,” Mr. Rhodes said. Several Latin American nations have criticized recent United States sanctions against several Venezuelan officials it has accused of human rights violations. But Mr. Obama’s overtures to Cuba, and his recent executive action on immigration to make it easier for some people who are in the United States without authorization to stay legally, have brought an unusual round of salutes and congratulations. “President Obama is going to leave a legacy the way he is supporting Hispanics in the United States, and also his new policy for Cuba for us is very important,” President Juan Carlos Varela of Panama said just before meeting with Mr. Obama. President Juan Manuel Santos of Colombia, who demanded Cuba’s inclusion in this summit meeting as he closed the last one, in his country in 2012, also celebrated Cuba’s arrival. “The Cuba situation has been an obstacle going back a long time in the relations of the United States with Latin America and the Caribbean, and without that obstacle the cooperation on many fronts will be more fluid,” he told the Colombian newspaper El Tiempo before arriving here. It was a far cry from the last Summit of the Americas in 2012 in Cartagena, Colombia — marred by a prostitution scandal involving Secret Service agents — when some Latin American leaders openly berated Mr. Obama for the United States’ stance on excluding Cuba. Bolivia, Nicaragua and Venezuela said they would not attend again unless Cuba could. The president ended that gathering with a testy lament, seemingly irritated by his inability to move past old disputes. “Sometimes those controversies date back to before I was born,” Mr. Obama said in his closing news conference, adding that it felt at times as if “we’re caught in a time warp, going back to the 1950s and gunboat diplomacy, and ‘Yanquis’ and the Cold War, and this and that and the other.” The meeting was not without reminders of the old animosities. It was marred by several clashes in the streets between Cuban dissidents and government representatives, one of whom accused the demonstrators of being paid by foreign governments, including the United States. And President Nicolás Maduro of Venezuela came to the summit meeting armed with a petition demanding that Mr. Obama lift sanctions that he imposed by executive order last month on members of the country’s government for human rights abuses. “I respect you, but I don’t trust you, President Obama,” he said in a profanity-laced speech. But longtime observers of the region said Mr. Obama’s move had robbed hemispheric neighbors of an oft-repeated knock against this American president and his predecessors. “It opens the door for the U.S. government by removing this argument that has been a pretext and an issue that has been invoked, not only by Cuba but other countries in the region, as a distraction,” said José Miguel Vivanco, the director of the Latin America program at Human Rights Watch. “The focus has been for so many years on the U.S. policy toward Cuba, not on the record of Cuba,” he added. “This puts the U.S. government and the Obama administration in a very different position with much more credibility when it comes to talking about democracy and human rights.”",
      "date": "April 11, 2015",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Obama Denounces Attempts to Derail Nuclear Deal With Iran",
      "url": "https://www.nytimes.com/2015/04/12/world/middleeast/obama-denounces-attempts-to-derail-nuclear-deal-with-iran.html?searchResultPosition=92",
      "subtitle": "null",
      "author": "Julie Hirschfeld Davis",
      "content": " PANAMA — President Obama fiercely defended the framework nuclear agreement with Iran on Saturday and criticized those Republicans he said were politicizing foreign policy and working to derail the deal. “I don’t understand why it is that everybody’s working so hard to anticipate failure,” Mr. Obama said of the negotiations to hammer out a final nuclear accord, during a news conference at the end of a summit meeting of Latin American nations here. “My simple point is let’s wait and see what the deal is.” He said he remained “absolutely positive” that if a final agreement codified the commitments agreed upon earlier this month, it would be the best way of preventing Iran from obtaining a nuclear weapon. And he said that he was worried that Republican critics of the deal were trying to “screw up” its completion. Mr. Obama singled out Senator John McCain, Republican of Arizona, who he said had suggested that Secretary of State John Kerry was “somehow less trustworthy” than Iran’s supreme leader in describing the deal, calling it “an indication of the degree to which partisanship has crossed all boundaries.” “That’s not how we’re supposed to run foreign policy,” Mr. Obama said. “That’s a problem. It needs to stop.” As he departed the summit meeting where a historic meeting with President Raúl Castro of Cuba provided concrete evidence of one of his most significant foreign policy achievements, Mr. Obama faced mounting questions about another goal — the Iran deal. The framework was forged in Switzerland this month, and American negotiators and allies are working with Iran to finalize an agreement by June 30. “We’ve got work until the end of June to make sure that we’ve got a document that works,” Mr. Obama said. “If, in fact, we’re not satisfied that it cuts off the pathways for Iran obtaining a nuclear weapon, then we won’t sign it.” Mr. Obama is facing a double bind over the next two months with the deal pending. Iran’s supreme leader, Ayatollah Ali Khamenei, has suggested that his country will not comply with crucial conditions, including unfettered access to nuclear sites. He has insisted that sanctions be lifted immediately after a deal is signed, something the United States has said would not happen. Closer to home, the Republican-led Congress is demanding review power over any agreement, and will begin considering bipartisan legislation next week that would allow them to review the deal, vote to disapprove it and limit Mr. Obama’s ability to waive sanctions. Some Republican critics of the accord, including Mr. McCain, have seized upon the assertions of Iran’s leaders to argue that Mr. Obama is on the brink of ceding too much in the talks. “It’s not surprising to me that the supreme leader or a whole bunch of other people are going to try to characterize the deal in a way that protects their political position, but I know what was discussed in arriving at the political agreement,” Mr. Obama said. As for Congress, he said he had talked to Senator Bob Corker, Republican of Tennessee, the chairman of the Foreign Relations Committee and a sponsor of the review bill, and Senator Benjamin L. Cardin of Maryland, the panel’s senior Democrat, about how to give Congress a voice in the debate. “I want to work with them so that Congress can look at this deal when it’s done,” Mr. Obama said. “What I’m concerned about is making sure that we don’t prejudge it,” he added, or allow opponents of the deal to “try to use a procedural argument essentially to screw up the possibility of a deal.”",
      "date": "April 12, 2015",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "In Mandela, Obama Found a Beacon Who Inspired From Afar",
      "url": "https://www.nytimes.com/2013/06/28/world/africa/mandela-obama-africa.html?searchResultPosition=90",
      "subtitle": "null",
      "author": "Michael D. Shear",
      "content": " DAKAR, Senegal — Barack Obama had been a United States senator for just weeks in early 2005 when Oprah Winfrey offered to carry a message for him to Nelson Mandela, the iconic South African leader. Mr. Obama disappeared into a back room in Ms. Winfrey’s television studio to write the note, but he was gone so long that his spokesman, Robert Gibbs, popped his head in after half an hour. “You’ve got to give me some time here,” Mr. Obama, pen in hand, told Mr. Gibbs, who recalled the moment recently. “I can’t just wing a note to Nelson Mandela.” Mr. Obama had been hoping to have his first face-to-face meeting as president with the ailing 94-year-old leader during a three-country, weeklong trip to Africa that began on Wednesday. But Mr. Mandela was hospitalized on June 8 for a chronic lung infection, and on Thursday he remained in critical but stable condition. A meeting between Mr. Mandela and Mr. Obama would have been rich with symbolism and symmetry for people on both continents: two men from different generations who made history as the first black presidents of nations with deep racial divides. Both embraced a cool pragmatism in their attempt to be post-racial leaders, and both have inspired as well as disappointed many supporters. Mr. Mandela has long been a beacon for Mr. Obama, who recounted again on Thursday how the revolution unleashed by Mr. Mandela a world away had inspired his own activism. Friends of Mr. Obama say that for him and many of his contemporaries, the fight against apartheid was the equivalent of the civil rights movement of an earlier generation. “My first act of political activism was when I was at Occidental College,” Mr. Obama said Thursday at a news conference here in Dakar, referring to a brief speech he gave at the time. “I got involved in the anti-apartheid movement back in 1979-80 because I was inspired by what was taking place in South Africa.” Recalling Mr. Mandela’s long imprisonment, Mr. Obama said, “I didn’t necessarily imagine that Nelson Mandela might be released.” Mr. Obama rarely dwells on his own strides against racial barriers and has for the most part steered away from invoking Mr. Mandela’s struggles in public or in private. Aides say he considers it presumptuous to compare his own life to that of Mr. Mandela, who was imprisoned for 27 years, part of that time in a tiny cell on Robben Island, before forging an end to apartheid and becoming South Africa’s first black leader. But Mr. Obama’s closest advisers say people do not realize how much Mr. Mandela has been an inspiration to Mr. Obama in some of the president’s most difficult moments. Valerie B. Jarrett, a senior adviser and close friend of Mr. Obama’s, said Mr. Mandela had given Mr. Obama “the strength to persevere.” In the foreword that Mr. Obama wrote to Mr. Mandela’s 2010 book, “Conversations With Myself,” he describes the early impact that Mr. Mandela’s struggle had on his life and his entry into politics. “His sacrifice was so great that it called upon people everywhere to do what they could on behalf of human progress,” Mr. Obama wrote. “In the most modest of ways, I was one of those people who tried to answer his call.” Mr. Obama hinted in the foreword at what might be his most important lesson from Mr. Mandela’s struggles, the need to be stubborn in the face of obstacles. Like Mr. Mandela, who angered some black South Africans who wanted a more radical reordering of the country’s wealth, Mr. Obama has sometimes disillusioned his most ardent supporters. Mr. Obama’s embrace of some of his predecessor’s antiterrorism policies has frustrated liberals. Revelations about secret surveillance programs have prompted concerns about privacy. And frequent budget clashes with Congress have left those who expected a new tone in Washington disillusioned. “All of us face days when it can seem like change is hard — days when our opposition and our own imperfections may tempt us to take an easier path that avoids our responsibilities to one another,” Mr. Obama wrote in the foreword. “But even when little sunlight shined into that Robben Island cell, he could see a better future — one worthy of sacrifice.” In 2006, Mr. Obama stood inside that cell during a visit to South Africa as a senator. After the tour, Mr. Gibbs remembered Mr. Obama as quiet and somber. “You could see it immediately on his face,” said Mr. Gibbs, who was with Mr. Obama on the trip. “It is almost impossible to comprehend spending that amount of your time imprisoned and in the conditions he was. Nobody really had to say anything. You felt the gravity of history literally on your shoulders.” During that trip, Mr. Obama did not meet with Mr. Mandela, who was out of the country at the time. The two have met in person only once, in a spontaneous encounter in Washington in 2005, when Mr. Mandela was in town and was urged by advisers to take a few minutes to meet a rising Democratic senator named Barack Obama. Mr. Obama was in a car, on the way to a meeting, but diverted to the Four Seasons hotel in Georgetown, where Mr. Mandela was staying. The conversation produced a lasting image of Mr. Obama, in silhouette, standing next to a reclining Mr. Mandela. David Katz, Mr. Obama’s driver and personal aide at the time, took the photo, a copy of which now sits in Mr. Mandela’s foundation office. Another copy is on Mr. Obama’s desk in the Oval Office. “He was subdued and reflective and honored to have met a man like Nelson Mandela,” Mr. Katz recalled of the young senator’s demeanor after the five-minute exchange. “He was processing the experience, processing the history.” Mr. Mandela, who was already a retired statesman at the time, expressed admiration for Mr. Obama after meeting him, said his granddaughter Tukwini Mandela. “He thought that President Obama was a very intelligent young man and that he liked him very much,” she said in an e-mail. Mr. Obama’s engagement in Mr. Mandela’s history began with the speech while he was a student at Occidental College in Los Angeles, where he urged the board of trustees to divest the college of South African investments as a protest against the country’s apartheid policies. At the time, Mr. Mandela was nearing the end of his second decade in prison. In his brief remarks, Mr. Obama told the crowd that although South Africa’s racial struggles were “happening an ocean away,” it was “a struggle that touches each and every one of us.” In the few instances since then that Mr. Obama has mentioned Mr. Mandela publicly, it has usually been in conjunction with other renowned leaders. When Mr. Obama accepted the Nobel Peace Prize in 2009, he said, “Compared to some of the giants of history who’ve received this prize — Schweitzer and King, Marshall and Mandela — my accomplishments are slight.” In a separate interview with Russian television that year, Mr. Obama was asked about his heroes. “Internationally, Nelson Mandela, Mahatma Gandhi,” Mr. Obama said. “I always am interested in leaders who are able to bring about transformative change without resort to violence, but rather changing people’s minds and people’s hearts.” Aides said Mr. Obama identified with Mr. Mandela’s willingness to work, pragmatically and without anger or emotion, alongside those who had imprisoned him for so many years. “The discipline, foresight, endurance — it all really struck a chord,” said Mark Lippert, a longtime foreign policy aide to Mr. Obama who now serves as the chief of staff to Chuck Hagel, the secretary of defense. “He admired Mandela’s ability to rise above it.”",
      "date": "June 27, 2013",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Obama Pledges Support for a New Iraqi Leader",
      "url": "https://www.nytimes.com/2014/08/12/world/middleeast/obama-pledges-support-for-a-new-iraqi-leader.html?searchResultPosition=86",
      "subtitle": "null",
      "author": "Michael D. Shear",
      "content": " EDGARTOWN, Mass. — President Obama said Monday that Iraq had taken a “promising step forward” in forming a more inclusive government even as Prime Minister Nuri Kamal al-Maliki appeared to resist efforts to replace him as the country’s leader. Speaking briefly to reporters from his vacation home on Martha’s Vineyard, Mr. Obama did not mention Mr. Maliki but pledged his support for Haider al-Abadi, the man chosen to succeed him. And Mr. Obama vowed to step up his support for a new government in its intensifying fight against Sunni militants. “There will be difficult days ahead,” Mr. Obama said. “We stand ready to partner with Iraq in its fight against these terrorist forces.” The president spoke as the president of Iraq, Fuad Masum, named Mr. Abadi to succeed Mr. Maliki as prime minister. It was less than a day after Mr. Maliki demanded in a television address that the nation’s army come to the defense of the constitution and his right to stay in the office he has held for eight years. Mr. Obama has previously said that support for the Iraqi government is dependent on a new government that includes all of the country’s factions to unify against the militants. In his remarks Monday evening, Mr. Obama praised Iraq’s leadership for beginning the process of building that government. “Today, Iraq took a promising step forward in this critical effort,” Mr. Obama said. The president said the United States military had stepped up its assistance to Iraqi and Kurdish forces, but he was not specific about what that assistance included. He said American forces continued to try and rescue Iraqi refugees who are trapped on Mount Sinjar, surrounded by militants. “Some have begun to escape their perch on that mountain,” Mr. Obama said, adding that the United States was working with other countries to find a place for the refugees to relocate.",
      "date": "Aug. 11, 2014",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Obama, in Brazil, Offers Familiar Slogan to Corporate Audience",
      "url": "https://www.nytimes.com/2017/10/05/world/americas/obama-speech-brazil.html?searchResultPosition=85",
      "subtitle": "null",
      "author": "Shasta Darlington",
      "content": "  SÃO PAULO, Brazil — Former President Barack Obama on Thursday told business leaders in Brazil that he regretted not having been able to do more to remedy the deeply polarized politics of the United States while he was in office. Mr. Obama did not mention his successor’s name and steered clear of discussing the turbulence afflicting President Trump’s administration. The former president also did not bring up the Trump administration’s efforts to reverse the reconciliation he negotiated with Cuba in 2014, a signature policy initiative that was hailed across Latin America. “My biggest regret is not being able to bridge the differences that were emerging in our politics as much as I wanted,” Mr. Obama told an audience of about 1,000 people who paid $1,500 to $2,400 to hear him speak. Mr. Obama has given at least 10 paid speeches since leaving office, charging as much as $400,000 per appearance. He has addressed audiences in Montreal, Italy and Indonesia in recent months. A spokesman declined to say how much he was paid for this speech. His 23-minute keynote address in São Paulo, Brazil’s financial capital, was titled “Change the World? Yes, You Can,” echoing his 2008 campaign slogan, “Yes, we can.” Mr. Obama made only fleeting references to the scandals that have roiled Brazil in recent years, ensnarling scores of politicians and business leaders in a wide-ranging corruption investigation. Political leaders “have to be held accountable,” Mr. Obama said, without elaborating. The event, sponsored by the Spanish bank Santander and the Brazilian media conglomerates Valor and Globo, attracted mainly bankers and other business people. For Brazilians, it was an opportunity to see a statesman who was widely admired here when he was president and whose message about overcoming political divisions resonates powerfully in a country that has endured years of political upheaval. “He’s a pop star here,” said Fernando, an asset manager from a rival bank who declined to give his full name. “It was worth every penny.” But Claudia, another attendee who declined to give her last name, said she was underwhelmed after paying a discounted rate, $1,116. “It was a bit disappointing,” she whispered. “I don’t feel like he said anything new.” Public interest groups have expressed disappointment over the speed with which Mr. Obama has cashed in after leaving office. A recent paid speech by Mr. Obama to a  Wall Street firm  drew pointed scorn. Robert Weissman, the president of the Washington-based group Public Citizen, said Mr. Obama’s corporate speeches seemed jarring and tone deaf at the onset of the Trump era. “With our democracy in such a crisis right now, Americans want to feel like their leaders aren’t cashing in,” Mr. Weissman said in an interview on Thursday. “Particularly with President Obama, who displayed such a strong ethical compass, it diminishes him at a time when the country needs him not to be diminished.” Mr. Obama said during Thursday’s address that the pace of recovery from the economic crisis that he inherited had exacerbated divisions. “It happened slowly enough that people got frustrated and people went to their two different corners,” he said. “And the anger in our politics — rather than me being able to pull it out, it increased.” Nonetheless, Mr. Obama said he would continue to try to bridge that gap at home and globally as a former president with his Obama Foundation, which is largely focused on young people. Mr. Obama took part in a question-and-answer period with a moderator at the end of his remarks that elicited familiar responses. One was about climate change. “I don’t mind if you want to have an argument with me that says, ‘You know what, there’s nothing we can do about the climate changing,’ ” Mr. Obama said. “But what I don’t want to have is an argument where you say the planet is not getting warmer.” Mr. Obama last visited Brazil in 2011 with the first lady, Michelle Obama, and their daughters. Two years later, the United States and Brazil hit a low point in their relationship amid revelations that the National Security Agency had eavesdropped on Dilma Rousseff, then the president, who abruptly postponed a state visit to Washington in response.",
      "date": "Oct. 5, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Obama, in Speech on ISIS, Promises Sustained Effort to Rout Militants",
      "url": "https://www.nytimes.com/2014/09/11/world/middleeast/obama-speech-isis.html?searchResultPosition=83",
      "subtitle": "null",
      "author": "Mark Landler",
      "content": " WASHINGTON — President Obama on Wednesday authorized a major expansion of the military campaign against rampaging Sunni militants in the Middle East, including American airstrikes in Syria and the deployment of 475 more military advisers to Iraq. But he sought to dispel fears that the United States was embarking on a repeat of the wars in Iraq and Afghanistan. In a speech to the nation from the State Floor of the White House, Mr. Obama said the United States was recruiting a global coalition to “degrade and ultimately destroy” the militants, known as the Islamic State in Iraq and Syria. He warned that “eradicating a cancer” like ISIS was a long-term challenge that would put some American troops at risk. “We will hunt down terrorists who threaten our country, wherever they are,” Mr. Obama declared in a 14-minute address. “That means I will not hesitate to take action against ISIL in Syria, as well as Iraq,” he added, using an alternative name for ISIS. “This is a core principle of my presidency: If you threaten America, you will find no safe haven.” The president drew a distinction between the military action he was ordering and the two wars begun by his predecessor, George W. Bush. He likened this campaign to the selective airstrikes that the United States has carried out for years against suspected terrorists in Yemen and Somalia, few of which have been made public. After enduring harsh criticism for saying two weeks ago that he did not have a strategy for dealing with ISIS in Syria, Mr. Obama outlined a plan that will bolster American training and arming of moderate Syrian rebels to fight the militants. Saudi Arabia has agreed to provide a base for the training of those forces. Mr. Obama called on Congress to authorize the plan to train and equip the rebels — something the Central Intelligence Agency has been doing covertly and on a much smaller scale — but he asserted his authority as commander in chief to expand the overall campaign, which will bring the number of American troops in Iraq to 1,600. “These American forces will not have a combat mission; we will not get dragged into another ground war in Iraq,” Mr. Obama pledged, adding that the mission “will be different from the wars in Iraq and Afghanistan; it will not involve American combat troops fighting on foreign soil.” For all of Mr. Obama’s efforts to reassure the public, his remarks were a stark acknowledgment of the threat posed by the militants, whose lightning advance through Iraq and Syria and videotaped beheading of two American journalists have reignited fears of radical Islamic terrorism. There is no evidence that ISIS is plotting an attack on the United States, Mr. Obama said. But he added, “If left unchecked, these terrorists could pose a growing threat” to Americans because of foreign fighters, including some from the United States, who have traveled to Syria and Iraq and who could return home to carry out attacks. Standing just outside the Blue Room, steps from where he announced the raid that killed Osama bin Laden in May 2011, Mr. Obama delivered a message that seemed worlds away from his confident assertions that the United States had decimated Al Qaeda. The United States, he said, was locked in a long battle with a successor to Al Qaeda, “unique in their brutality.” The president’s remarks, on the eve of the 13th anniversary of the Sept. 11, 2001, terrorist attacks, will thrust the United States into a civil war in Syria that he had long sought to avoid, and will return a significant American military presence to Iraq, not quite three years after the last American troops withdrew. Mr. Obama has sought to surround the United States with partners. Earlier on Wednesday, he called King Abdullah of Saudi Arabia to enlist his support for the plan to step up training of the Syrian rebels. Mr. Obama is acting as polls show rapidly shifting public opinion, with a large majority of Americans now favoring military action against ISIS in Iraq and Syria, even as they express deep misgivings about the president’s leadership, Mr. Obama is also facing difficult crosscurrents on Capitol Hill, where Republican lawmakers, initially reluctant to demand congressional authorization of military action, have begun agitating for a vote, even as some Democrats warn of a stampede to war. On Wednesday, Senate Democratic leaders prepared legislation on the narrow issue of authorizing the American military to train the Syrian rebels. House Republicans appeared ready to follow their lead. The surge of activity means Congress is likely to weigh in on the military action before the midterm elections in eight weeks. Former Vice President Dick Cheney further roiled the political atmosphere on Capitol Hill when he gave a speech on Wednesday blaming Mr. Obama’s “arbitrary and hasty” withdrawal of troops in 2011 for the chaos in Iraq. Senator Richard J. Durbin, an Illinois Democrat and a political ally of Mr. Obama, rejected Mr. Cheney’s critique, saying, “We want to be careful that we don’t engage ourselves for a long period of time in a long-term war involving the vulnerability of our troops.” Mr. Obama’s speech amounted to a strategy for a problem he has long said would defy an American remedy: sectarian strife between Sunni and Shiite Muslims in countries with deeply disaffected minorities and no history of democratic government. Among the questions that Mr. Obama did not answer: How will the United States and its allies reinvigorate a moderate Syrian opposition that has been marginalized by more extremist forces? And how can the United States act against ISIS in Syria without benefiting President Bashar al-Assad? While Mr. Obama said that Mr. Assad had lost his legitimacy to govern Syria, he did not call again for his ouster. Instead, he spoke of strengthening the moderate rebels to give them a seat at the table in a political settlement with the Assad government. Administration officials indicated that airstrikes in Syria could still be weeks away, while American surveillance planes continue to gather intelligence on the location of ISIS targets. They also tried to manage expectations about whether the United States could truly destroy ISIS. Wiping out a group whose roots go back to the start of the Iraq war is a formidable challenge, a senior official said in a briefing for reporters, speaking on the condition of anonymity under White House ground rules. “What we can do is systematically roll back the organization, shrink the territory where they’re operating, decimate its ranks, cut off its sources of support in terms of funding and equipment, and have the threat methodically and relentlessly reduced,” he said.",
      "date": "Sept. 10, 2014",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "No Easy Answers on Syria, Obama Says",
      "url": "https://www.nytimes.com/2013/05/08/world/asia/obama-on-syria.html?searchResultPosition=82",
      "subtitle": "null",
      "author": "Mark Landler",
      "content": " WASHINGTON – President Obama on Tuesday defended his cautious response to evidence that the Syrian government had used chemical weapons on its citizens, saying that he could not make high-stakes decisions based on a “perceived” use of those weapons. Mr. Obama, who last summer declared that the use of chemical weapons would cross a “red line” and trigger an unspecified American response, said the evidence of such use was not conclusive enough to require action or enable him to mobilize American allies behind a response. Speaking at a news conference with President Park Geun-hye of South Korea, Mr. Obama said: “Understandably, there’s a desire for easy answers. That’s not the situation there.” “My job is to constantly measure our very real and legitimate humanitarian and national security interests in Syria,” he said, adding that that must be measured against “my bottom line: which is what’s in the best interest of America’s security.” Still, Mr. Obama sought to dispel suggestions that he faced a credibility gap in the wake of intelligence showing that sarin gas was used on March 19 in a Syrian village west of Aleppo and in the outskirts of Damascus. He cited the commando raid that killed Osama bin Laden and the NATO-led air campaign against Col. Muammar el-Qaddafi in Libya as evidence of his resolve. “There have been several instances during the course of my presidency where I said I was going to do something,” he said, “and it ended up getting done.” Mr. Obama, however, offered no insight into measures his administration might be contemplating, merely citing the humanitarian and nonlethal aid to the opposition that the United States has already pledged. Ms. Park, asked if the confusion over Mr. Obama’s red line might spill over into the confrontation with North Korea, said that country’s behavior was so poorly understood that “whether the Syrian situation would have an impact, it’s hard to say.” Mr. Obama threw his full support behind Ms. Park as she navigates a confrontation with North Korea, which has been leveling a barrage of threats at the South. “President Park’s approach is very compatible with my approach and the approach that we have been taking together for several years now,” Mr. Obama said. The key, he said, is “that we will be prepared for deterrence, that we will respond to aggression, that we will not reward aggressive actions, but that we will maintain an openness to an engagement process.” The meeting came as tensions on the Korean Peninsula seemed to ebb after several weeks of warlike threats by North Korea. The North appeared to roll back two Musadan missiles from their coastal launching sites, according to American officials. Analysts said they believed the reduction in tensions was a pause rather than a long-term trend. “I think the lull is mostly about tone, and the trajectory hasn’t changed at all,” said Michael J. Green, a Korea expert at the Center for Strategic and International Studies in Washington. “There may a Musadan launch soon; they are chugging ahead.” Ms. Park has embarked on a policy known as “trust politik,” in which South Korea projects deterrence but makes a series of small gestures to the North to try to build trust for negotiations. She appeared to win an endorsement of the policy from Mr. Obama. “President Park is tough,” he said. “She has a very clear, realistic view of the situation, but she also has the wisdom to believe that conflict is not inevitable and is not preferable.”",
      "date": "May 7, 2013",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Obama Speaks in Milan, With Food as Text and Politics as Subtext",
      "url": "https://www.nytimes.com/2017/05/09/world/europe/obama-food-milan-seeds-chips.html?searchResultPosition=79",
      "subtitle": "null",
      "author": "Jason Horowitz",
      "content": "  ROME — Barack Obama took his first step back onto the world stage on Tuesday, shedding his tie to give wide-ranging, if studiously nonpartisan, remarks during a food and technology conference in Milan. First in a keynote address, during which he often consulted his notes, and then in a policy-heavy conversation with his former chef, Sam Kass, Mr. Obama spoke about how climate change was imperiling food production around the world and threatening to aggravate the “migration that has put such a burden on Europe.” In a conversation that seemed intended to avoid making news, he also spoke about rain patterns, income inequality, privacy issues, his post-presidential life and cows. When President Trump was mentioned, Mr. Obama politely turned the page, saying that while “the current administration has differences with my administration in terms of energy policy,” he believed that “the private sector has already made a decision that the future is in clean energy.” Since leaving office, Mr. Obama has kitesurfed with the billionaire Richard Branson, started writing his memoirs and begun earning speaking fees. Critics have accused Mr. Obama, who campaigned as a different kind of politician, of hypocrisy for accepting an offer of $400,000 to speak in September at a health care conference run by the Wall Street firm Cantor Fitzgerald. Organizers of the event in Milan — the Seeds & Chips conference on global food innovation — declined to say how much Mr. Obama was paid, and the Obama Foundation declined to comment. Mr. Obama could hardly have found safer ground for a return to the global stage than discussing food in Italy. He offered observations about how changing diets around the world were driving increases in carbon emissions from agriculture, and how agricultural interests tended to stick together politically across party lines. “Because food is so close to us and is part of our family and is part of what we do every single day, people, I think, are more resistant to the idea of government or bureaucrats telling them what to eat, how to eat and how to grow,” he said. But food may not have been all that was on some attendees’ minds. Among the prominent attendees was Matteo Renzi, the former prime minister of Italy, with whom Mr. Obama has developed a rapport and whom he mentioned several times, calling him Matteo. Mr. Renzi, who resigned in December after voters rejected constitutional amendments he proposed, is trying to make a political comeback, and hoping that association with Mr. Obama will help him more this time. Soon after Mr. Obama arrived in Milan on Monday morning, in dark sunglasses and an open white collar, he received Mr. Renzi at the Park Hyatt hotel. They spoke for more than an hour, and according to a person close to Mr. Obama, they discussed the recent surge of the anti-establishment Five Star Movement in Italy, Mr. Renzi’s comeback attempt and concerns about Russian meddling in the Italian election. At one point, according to Kevin Lewis, a spokesman for Mr. Obama, Mr. Renzi suggested that the two phone Emmanuel Macron, who won the French presidential election on Sunday, and congratulate him together. The impromptu conference call seemed to connect a progressive power triumvirate that never was. Mr. Obama, 55, Mr. Renzi, 42, and Mr. Macron, 39, represent an alternate reality for a trans-Atlantic political landscape disrupted by Mr. Trump’s election and the rise of populist forces in other nations. Mr. Macron decisively dispatched his hard-right opponent, but Mr. Renzi and Mr. Obama have more time on their hands now, and they made the most of it. After their meeting, the two men went to the Palazzo Clerici for a dinner organized by the Obama Foundation and the Italian Institute for International Political Studies. Mr. Obama also found time for sightseeing. He viewed da Vinci’s “Last Supper,” which he tried to tie into his remarks about food. After a somewhat wooden start at the lectern, he settled into a chair next to Mr. Kass and touched on a variety of topics: farmers, the role of employment in combating radicalization, income inequality. In the end, even Mr. Obama seemed a bit exhausted by the talk; he reminded Mr. Kass, to applause, that “I have to go home and have dinner with my family.”",
      "date": "May 9, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Obama Visits Kenya, Land of His Father, to Promote Local Charity",
      "url": "https://www.nytimes.com/2018/07/16/world/africa/obama-kenya-visit-africa.html?searchResultPosition=76",
      "subtitle": "null",
      "author": "Mike Ives",
      "content": " Former President Barack Obama has arrived in Kenya, his father’s home country, in what was expected to be a lower-profile visit than the ones he made to the country as senator and president. Mr. Obama traveled to Kenya on Sunday to promote the opening of a sports and training center that his half sister, Auma Obama, founded through her charitable foundation, The Associated Press reported. In a Twitter post on Sunday night, President Uhuru Kenyatta of Kenya showed photos of himself meeting a tieless Mr. Obama in Nairobi, the capital. “It was a great pleasure to welcome you back,” he wrote in welcoming Mr. Obama. In another Twitter post, sent from the official presidential account, Mr. Kenyatta said he and his deputy had “had a refreshing chat” with the former American president and his half sister. Dr. Obama grew up in Kenya and returned there, after living in Germany and the United Kingdom, to work for the charity CARE International, according to a brief biography posted on the website of her foundation, Sauti Kuu. Her work at CARE focused partly on familiarizing girls with sports as a vehicle for social empowerment. Sauti Kuu, based in Nairobi, serves children and young people, particularly from urban slums and rural communities. According to the foundation’s website, its new sports and training center is in Alego, apparently the same village where Mr. Obama has said that his Kenyan family is from. Kenya has always loomed large in the personal narrative of Mr. Obama, the son of a black university student from the country, whom he met only once, and a white anthropologist originally from Kansas. He first visited Kenya in 1987, sleeping for several weeks on his half sister’s sofa, and later described the trip in his first book, “Dreams From My Father.” Mr. Obama returned to Kenya as a senator in 2006 and again as president in 2015 to rapturous receptions. Many in the country celebrate him as a son of Africa who reached the pinnacle of power. In a Twitter post last week, Mr. Obama described Africa as “a continent of wonderful diversity, thriving culture, and remarkable stories.” But Kenya is also tied up in a conspiracy theory, fanned by President Trump for years before he entered politics, that Mr. Obama had actually been born there and was therefore ineligible to be president. Mr. Obama dispelled that false claim in 2011 by publicly showing his American birth certificate, but Mr. Trump did not abandon it until 2016. Mr. Obama is in Kenya at a delicate political moment — about four months after Mr. Kenyatta and his top political rival, the opposition leader Raila Odinga, held a surprise meeting and promised a new focus on national unity after months of escalating tensions. The A.P. reported that Mr. Obama was expected to meet Mr. Odinga during his trip. Mr. Obama is also expected to visit Kogelo, his father’s home village, The A.P. said. That had not been possible in 2015 because of security and logistical concerns. Ahead of his 2015 trip to Kenya, Mr. Obama told reporters that he looked forward to the visit and saw it as symbolically important. But he also acknowledged that visiting the country as a private citizen “is probably more meaningful to me than visiting as president, because I can actually get outside of a hotel room or a conference center.”",
      "date": "July 16, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Obama’s Turn in Bush’s Bind",
      "url": "https://www.nytimes.com/2013/02/10/world/obamas-turn-in-bushs-bind-with-defense-policies.html?searchResultPosition=75",
      "subtitle": "null",
      "author": "Peter Baker",
      "content": " WASHINGTON — If President Obama tuned in to the past week’s bracing debate on Capitol Hill about terrorism, executive power, secrecy and due process, he might have recognized the arguments his critics were making: He once made some of them himself. Four years into his tenure, the onetime critic of President George W. Bush finds himself cast as a present-day Mr. Bush, justifying the muscular application of force in the defense of the nation while detractors complain that he has sacrificed the country’s core values in the name of security. The debate is not an exact parallel to those of the Bush era, and Mr. Obama can point to ways he has tried to exorcise what he sees as the excesses of the last administration. But in broad terms, the conversation generated by the confirmation hearing of John O. Brennan, his nominee for C.I.A. director, underscored the degree to which Mr. Obama has embraced some of Mr. Bush’s approach to counterterrorism, right down to a secret legal memo authorizing presidential action unfettered by outside forces. At the same time, a separate hearing in Congress revealed how far Mr. Obama has gone to avoid what he sees as Mr. Bush’s central mistake. Testimony indicated that the president had overruled his secretaries of state and defense and his military commanders when they advised arming rebels in Syria. With troops only recently home from Iraq, Mr. Obama made clear that he was so intent on staying out of another war against a Middle East tyrant that he did not want to be involved even by proxy, especially if the proxies might be questionable. Critics on the left saw abuse of power, and critics on the right saw passivity. The confluence of these debates suggests the ways Mr. Obama is willing to emulate Mr. Bush and the ways he is not. In effect, Mr. Obama relies on his predecessor’s aggressive approach in one area to avoid Mr. Bush’s even more aggressive approach in others. By emphasizing drone strikes, Mr. Obama need not bother with the tricky issues of detention and interrogation because terrorists tracked down on his watch are generally incinerated from the sky, not captured and questioned. By dispensing with concerns about due process, he avoids a more traditional war that he fears could lead to American boots on the ground. “I’d argue the shift to more targeted action against A. Q. has been a hallmark of Obama’s approach against terrorism, whereas Iraq was Bush’s signature decision in his global war on terror,” said Benjamin J. Rhodes, a deputy national security adviser to Mr. Obama, using the initials for Al Qaeda. The Brennan hearing highlighted the convoluted politics of terrorism. Conservatives complained that if Mr. Bush had done what Mr. Obama has done, he would have been eviscerated by liberals and the news media. But perhaps more than ever before in Mr. Obama’s tenure, liberals voiced sustained grievance over the president’s choices. “That memo coming out, I think, was a wake-up call,” said Christopher Anders, senior legislative counsel of the American Civil Liberties Union. “These last few days, it was like being back in the Bush days.” “It’s causing a lot of cognitive dissonance for a lot of people,” he added. “It’s not the President Obama they thought they knew.” The dissonance is due in part to the fact that Mr. Obama ran in 2008 against Mr. Bush’s first-term policies but, after winning, inherited Mr. Bush’s second-term policies. By the time Mr. Bush left office, he had shaved off some of the more controversial edges of his counterterrorism program, both because of pressure from Congress and the courts and because he wanted to leave behind policies that would endure. He had closed the secret C.I.A. prisons, obtained Congressional approval for warrantless surveillance and military commissions, and worked to close the prison at Guantánamo Bay, Cuba. So while Mr. Obama banned harsh interrogation techniques, he preserved much of what he inherited, with some additional safeguards; expanded Mr. Bush’s drone campaign; and kept on veterans of the antiterrorism wars like Mr. Brennan. Some efforts at change were thwarted, like his vow to close the Guantánamo prison and to try Sept. 11 plotters in civilian court. “These are the same issues we’ve been grappling with for years that are uncomfortable given our legal structures and the nature of the threat, but the Obama team is addressing these issues the same way we did,” said Juan Carlos Zarate, who was Mr. Bush’s deputy national security adviser for combating terrorism. Peter D. Feaver, a Duke University professor and former Bush national security aide, said Mr. Obama “believed the cartoon version of the Bush critique so that Bush wasn’t just trying to make tough calls how to protect America in conditions of uncertainty, Bush actually was trying to grab power for nefarious purposes.” “So even though what I, Obama, am doing resembles what Bush did, I’m doing it for other purposes,” Mr. Feaver added. Others said that oversimplified the situation and ignored modifications that Mr. Obama had enacted. “It is a vast overstatement to suggest that President Obama is channeling President Bush,” said Geoffrey R. Stone, a University of Chicago law professor who hired a young Mr. Obama to lecture there. “On almost every measure, Obama has been more careful, more restrained and more respectful of individual liberties than President Bush was.” “On the other hand,” Mr. Stone added, “at least in his use of drones, President Obama has legitimately opened himself up to criticism for striking the wrong balance” between civil liberties and national security. Particularly stark has been the secret memo authorizing the targeted killing of American citizens deemed terrorists under certain circumstances without judicial review, a memo that brought back memories of those in which John Yoo, a Justice Department official under Mr. Bush, declared harsh interrogation legal. That broad assertion of power, even with limits described by administration officials, combined with the initial White House refusal to release even a sanitized summary of the memo touched off protests from left and right. Some called Mr. Obama a hypocrite. But Mr. Yoo himself saw it differently, arguing in The Wall Street Journal that the memo, whatever the surface similarities to his own, betrayed a flawed vision because it presented the issue in law enforcement terms rather than as an exercise of war powers. Michael V. Hayden, the C.I.A. director under Mr. Bush, said that if Mr. Obama learned one thing from experience it should be that controversial programs require public support to be sustained. “Err on the side of being open, at least with Congress,” he said. “Otherwise you’re going to find yourself in a politically vulnerable position.” For four years, Mr. Obama has benefited at least in part from the reluctance of Mr. Bush’s most virulent critics to criticize a Democratic president. Some liberals acknowledged in recent days that they were willing to accept policies they once would have deplored as long as they were in Mr. Obama’s hands, not Mr. Bush’s. “We trust the president,” former Gov. Jennifer Granholm of Michigan said on Current TV. “And if this was Bush, I think that we would all be more up in arms because we wouldn’t trust that he would strike in a very targeted way and try to minimize damage rather than contain collateral damage.” But some national security specialists said questions about the limits of executive power to conduct war should not depend on the person in the Oval Office. “That’s not how we make policy,” said Douglas Ollivant, a former national security aide under Mr. Bush and Mr. Obama and now a fellow at the New America Foundation. “We make policy assuming that people in power might abuse it. To do otherwise is foolish.”",
      "date": "Feb. 9, 2013",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Israel: Obama to Receive Award",
      "url": "https://www.nytimes.com/2013/02/19/world/middleeast/israel-obama-to-receive-award.html?searchResultPosition=68",
      "subtitle": "null",
      "author": "Jodi Rudoren",
      "content": " President Shimon Peres plans to give President Obama a special award at a state dinner next month when Mr. Obama is expected to visit Israel. Mr. Obama would be the first sitting American president to receive the award, Israel’s Presidential Medal of Distinction. Previous recipients include Henry A. Kissinger and the conductor Zubin Mehta. “Barack Obama is a true friend of the State of Israel, and has been since the beginning of his public life,” Mr. Peres said in a statement.",
      "date": "Feb. 18, 2013",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Obama’s Path Was Shaped by Mandela’s Story",
      "url": "https://www.nytimes.com/2013/12/06/world/africa/obama-mandela.html?searchResultPosition=65",
      "subtitle": "null",
      "author": "Michael D. Shear",
      "content": " WASHINGTON — Without Nelson Mandela, there might never have been a President Obama. That is the strong impression conveyed from Mr. Obama, whose political and personal bonds to Mr. Mandela, the former South African president, transcended their single face-to-face meeting, which took place at a hotel here in 2005. It was the fight for racial justice in South Africa by Mr. Mandela that first inspired a young Barack Obama to public service, the American president recalled on Thursday evening after hearing that Mr. Mandela, the 95-year-old world icon, had died. Mr. Obama delivered his first public speech, in 1979, at an anti-apartheid rally. Mr. Obama’s first moment on the public stage was the start of a life and political career imbued with the kind of hope that Mr. Mandela personified. “The day that he was released from prison gave me a sense of what human beings can do when they’re guided by their hopes and not by their fears,” Mr. Obama said on Thursday. “Hope” would eventually become the mantra for his ascension to the White House. On two continents separated by thousands of miles and vastly different political cultures, the lives of the two men rarely intersected. Weeks before their only meeting, Mr. Obama wrote Mr. Mandela a letter that Oprah Winfrey carried to South Africa. As Mr. Obama later emerged as a national political leader, he and Mr. Mandela occasionally traded phone calls or letters. But the trajectories of the two leaders, who broke political and social barriers in their own countries, were destined to be connected, even if mostly from afar. Mr. Obama wrote about Mr. Mandela as a distant but inspirational figure in the forward to Mr. Mandela’s 2010 book, “Conversations With Myself.” “His sacrifice was so great that it called upon people everywhere to do what they could on behalf of human progress,” Mr. Obama wrote. “In the most modest of ways, I was one of those people who tried to answer his call.” Mr. Mandela and Mr. Obama served as the first black leaders of their nations and both were looked to by some as the vehicles for reconciliation between polarized electorates. Both won the Nobel Peace Prize, in part for their charisma and their ability to inspire and communicate. Mr. Obama often referred to Mr. Mandela by the former president’s clan name, Madiba — a term of affection for the aging, beloved leader in South Africa. On Thursday, Mr. Obama spoke of the goals that Mr. Mandela worked decades for, and eventually achieved. “A free South Africa at peace with itself — that’s an example to the world, and that’s Madiba’s legacy to the nation he loved,” Mr. Obama said from the White House as news of Mr. Mandela’s death spread. But the American president regularly shied from direct comparisons with Mr. Mandela. Mr. Obama often noted privately and publicly that his sacrifices would never compare to Mr. Mandela’s. Aides to Mr. Obama said he was uncomfortable when people drew parallels between them, as they often did. Robert Gibbs, the former White House press secretary, accompanied Mr. Obama on his first visit to the tiny prison cell on Robben Island where Mr. Mandela had been jailed for years. “Having stood in that space that day, you realize that whatever analogies you might draw, that Mandela is and always will be a singular figure in the history of the world,” Mr. Gibbs recalled this summer. “I don’t think the president would look at even the hardest days as equal even to the very best day that he might have spent inside of Robben Island.” And yet, the struggle by Mr. Mandela has been a beacon to Mr. Obama, drawing him to South Africa twice to pay homage. The last trip came in June of this year, as Mr. Obama traveled to Senegal, Tanzania and South Africa on a visit overshadowed by the possibility that the ailing Mr. Mandela might die at any moment. On the trip, Mr. Obama did not visit with Mr. Mandela, who was fighting a lung infection. Officials said a visit would have been disruptive and unhelpful to Mr. Mandela’s recovery. Instead, Mr. Obama and the first lady, Michelle Obama, visited with Mr. Mandela’s family. “I don’t need a photo-op, and the last thing I want to do is to be in any way obtrusive at a time when the family is concerned about Nelson Mandela’s condition,” Mr. Obama said at the time. During the trip, Mr. Obama reflected repeatedly on the impact Mr. Mandela had on him, and people around the world. Moments before he again stood in the cell on Robben Island, Mr. Obama told his daughters of Mr. Mandela’s legacy. “One thing you guys might not be aware of is that the idea of political nonviolence first took root here in South Africa because Mahatma Gandhi was a lawyer here in South Africa,” the president told them. “When he went back to India the principles ultimately led to Indian independence, and what Gandhi did inspired Martin Luther King.” In a speech to students at Cape Town University, Mr. Obama lauded Mr. Mandela as a leader whose “spirit could never be imprisoned” and a man who serves as an inspiration for all. “Nelson Mandela showed us that one man’s courage can move the world,” Mr. Obama told the students. “And he calls on us to make choices that reflect not our fears, but our hopes — in our own lives, and in the lives of our communities and our countries.” The 2005 meeting between Mr. Obama and Mr. Mandela was brief, just a few minutes, as a young American senator shook the hands of an elderly man. The moment was captured in a photograph taken by Mr. Obama’s driver. It shows Mr. Obama, silhouetted against a bright window, holding hands with Mr. Mandela, who is reclining on a couch. One copy of the photograph has sat for years on a desk in Mr. Mandela’s office in South Africa. Another copy is on Mr. Obama’s desk in the Oval Office.",
      "date": "Dec. 5, 2013",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Obama Evokes Nostalgia in Germany, but Message Focuses on Future Struggles",
      "url": "https://www.nytimes.com/2019/04/06/world/europe/obama-berlin-germany.html?searchResultPosition=63",
      "subtitle": "null",
      "author": "Katrin Bennhold",
      "content": " BERLIN — The man whom Chancellor Angela Merkel calls “dear Barack” was back in Berlin on Saturday, his lanky figure and easy smile a reminder for Germans of a different era that ended not so long ago. But former President Barack Obama had not come to speak about the past. He came to speak to the future: some 300 young leaders from across Europe, who had gathered for a town hall-style meeting in the German capital. It did not take long for Mr. Obama to touch on one of his main concerns — and the reason he had come to what he called “the heart of Europe.” Europe, Mr. Obama suggested, is one of the main battlefields between liberal democracy and far-right populism. “Nationalism, particularly on the far right, is re-emerging,” he told a packed auditorium. “We know where that leads. Europe knows better than anyone where that leads.” “It leads to conflict, bloodshed and catastrophe,” he said. Mr. Obama did not mention his successor’s name. But the contrast with President Trump, issue by issue, was plain. “I believe that climate change is an existential challenge for all of humanity,” Mr. Obama said. “I believe that creating tolerance and respect in our countries is vital,” he added. “I believe deeply in gender equality.” In a two-hour exchange with his young audience, Mr. Obama frequently returned to the issue of racism and immigration. “Immigration issues are driving a lot of the political turmoil here in Europe and in my own country,” Mr. Obama said. But he also urged his audience to view those unsettled by the newcomers with empathy. “We can’t label everyone who is disturbed by migration as racist,” he said. Mr. Obama has long been popular in Germany. Even before he was elected, in July 2008, 200,000 Berliners flocked to see him speak at the Victory Column in the heart of the city. For many, the affection has not abated. “Our President,” gushed a front-page headline in the liberal newspaper Tagesspiegel, before listing the policies that had made Germans feel at ease with Mr. Obama: His support for multilateral institutions and his willingness to fight climate change and deal with Iran on freezing its nuclear program. “Obama felt like a president for the Germans, as if he was made for them,” Tagesspiegel wrote. “The feeling has stayed. The contrast with Donald Trump has even reinforced it.” In Germany, Mr. Trump’s presidency is increasingly seen as a challenge to America’s commitment to Europe and the values that underpin the Western alliance. Three times more Germans trust President Vladimir V. Putin of Russia and President Xi Jinping of China to “do the right thing” than Mr. Trump, according to a survey by the Pew Research Center released last September. Ms. Merkel, Germany’s first female chancellor, and Mr. Obama, America’s first black president, always had a special connection, their aides said. Outsiders in their own countries, they also often agreed on key political issues. Mr. Trump and Ms. Merkel by contrast, clash both in style and on substance. The meeting in Berlin comes after similar events in South Africa and smaller gatherings in places including Brazil and Indonesia hosted by the Obama Foundation and is central to Mr. Obama’s post-White House effort to “partner with the next generation” to solve the big problems of the day. “It was a call to action for the next generation of European leaders and an effort to bring them together at a time when Europe’s social fabric is tearing apart,” said Julianne Smith, a former adviser in the Obama administration who is now a senior fellow at the Bosch Academy in Berlin. The foundation’s approach differs from that of groups like the Clinton Foundation or the Bill and Melinda Gates Foundation, which seek to address specific issues. Some see in Mr. Obama’s approach a return to his roots as a community organizer — and that also is how many of the young activists, who gave him a standing ovation in Berlin on Saturday, described the ex-president. “He was here as a former activist, he is a bringer of hope,” said Leonie Eland, a journalist from Germany who was among the 300 young leaders in the room. “He represents the other America, the progressive America and in a way the American dream.”",
      "date": "April 6, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Text of President Obama’s Speech in Hiroshima, Japan",
      "url": "https://www.nytimes.com/2016/05/28/world/asia/text-of-president-obamas-speech-in-hiroshima-japan.html?searchResultPosition=61",
      "subtitle": "null",
      "author": "",
      "content": "The following is a transcript of President Obama’s speech in Hiroshima, Japan, as recorded by The New York Times. Seventy-one years ago, on a bright cloudless morning, death fell from the sky and the world was changed. A flash of light and a wall of fire destroyed a city and demonstrated that mankind possessed the means to destroy itself. Why do we come to this place, to Hiroshima? We come to ponder a terrible force unleashed in a not-so-distant past. We come to mourn the dead, including over 100,000 Japanese men, women and children, thousands of Koreans, a dozen Americans held prisoner. Their souls speak to us. They ask us to look inward, to take stock of who we are and what we might become. It is not the fact of war that sets Hiroshima apart. Artifacts tell us that violent conflict appeared with the very first man. Our early ancestors having learned to make blades from flint and spears from wood used these tools not just for hunting but against their own kind. On every continent, the history of civilization is filled with war, whether driven by scarcity of grain or hunger for gold, compelled by nationalist fervor or religious zeal. Empires have risen and fallen. Peoples have been subjugated and liberated. And at each juncture, innocents have suffered, a countless toll, their names forgotten by time. The world war that reached its brutal end in Hiroshima and Nagasaki was fought among the wealthiest and most powerful of nations. Their civilizations had given the world great cities and magnificent art. Their thinkers had advanced ideas of justice and harmony and truth. And yet the war grew out of the same base instinct for domination or conquest that had caused conflicts among the simplest tribes, an old pattern amplified by new capabilities and without new constraints. In the span of a few years, some 60 million people would die. Men, women, children, no different than us. Shot, beaten, marched, bombed, jailed, starved, gassed to death. There are many sites around the world that chronicle this war, memorials that tell stories of courage and heroism, graves and empty camps that echo of unspeakable depravity. Yet in the image of a mushroom cloud that rose into these skies, we are most starkly reminded of humanity’s core contradiction. How the very spark that marks us as a species, our thoughts, our imagination, our language, our toolmaking, our ability to set ourselves apart from nature and bend it to our will — those very things also give us the capacity for unmatched destruction. How often does material advancement or social innovation blind us to this truth? How easily we learn to justify violence in the name of some higher cause. Every great religion promises a pathway to love and peace and righteousness, and yet no religion has been spared from believers who have claimed their faith as a license to kill. Nations arise telling a story that binds people together in sacrifice and cooperation, allowing for remarkable feats. But those same stories have so often been used to oppress and dehumanize those who are different. Science allows us to communicate across the seas and fly above the clouds, to cure disease and understand the cosmos, but those same discoveries can be turned into ever more efficient killing machines. The wars of the modern age teach us this truth. Hiroshima teaches this truth. Technological progress without an equivalent progress in human institutions can doom us. The scientific revolution that led to the splitting of an atom requires a moral revolution as well. That is why we come to this place. We stand here in the middle of this city and force ourselves to imagine the moment the bomb fell. We force ourselves to feel the dread of children confused by what they see. We listen to a silent cry. We remember all the innocents killed across the arc of that terrible war and the wars that came before and the wars that would follow. Mere words cannot give voice to such suffering. But we have a shared responsibility to look directly into the eye of history and ask what we must do differently to curb such suffering again. Some day, the voices of the hibakusha will no longer be with us to bear witness. But the memory of the morning of Aug. 6, 1945, must never fade. That memory allows us to fight complacency. It fuels our moral imagination. It allows us to change. And since that fateful day, we have made choices that give us hope. The United States and Japan have forged not only an alliance but a friendship that has won far more for our people than we could ever claim through war. The nations of Europe built a union that replaced battlefields with bonds of commerce and democracy. Oppressed people and nations won liberation. An international community established institutions and treaties that work to avoid war and aspire to restrict and roll back and ultimately eliminate the existence of nuclear weapons. Still, every act of aggression between nations, every act of terror and corruption and cruelty and oppression that we see around the world shows our work is never done. We may not be able to eliminate man’s capacity to do evil, so nations and the alliances that we form must possess the means to defend ourselves. But among those nations like my own that hold nuclear stockpiles, we must have the courage to escape the logic of fear and pursue a world without them. We may not realize this goal in my lifetime, but persistent effort can roll back the possibility of catastrophe. We can chart a course that leads to the destruction of these stockpiles. We can stop the spread to new nations and secure deadly materials from fanatics. And yet that is not enough. For we see around the world today how even the crudest rifles and barrel bombs can serve up violence on a terrible scale. We must change our mind-set about war itself. To prevent conflict through diplomacy and strive to end conflicts after they’ve begun. To see our growing interdependence as a cause for peaceful cooperation and not violent competition. To define our nations not by our capacity to destroy but by what we build. And perhaps, above all, we must reimagine our connection to one another as members of one human race. For this, too, is what makes our species unique. We’re not bound by genetic code to repeat the mistakes of the past. We can learn. We can choose. We can tell our children a different story, one that describes a common humanity, one that makes war less likely and cruelty less easily accepted. We see these stories in the hibakusha. The woman who forgave a pilot who flew the plane that dropped the atomic bomb because she recognized that what she really hated was war itself. The man who sought out families of Americans killed here because he believed their loss was equal to his own. My own nation’s story began with simple words: All men are created equal and endowed by our creator with certain unalienable rights including life, liberty and the pursuit of happiness. Realizing that ideal has never been easy, even within our own borders, even among our own citizens. But staying true to that story is worth the effort. It is an ideal to be strived for, an ideal that extends across continents and across oceans. The irreducible worth of every person, the insistence that every life is precious, the radical and necessary notion that we are part of a single human family — that is the story that we all must tell. That is why we come to Hiroshima. So that we might think of people we love. The first smile from our children in the morning. The gentle touch from a spouse over the kitchen table. The comforting embrace of a parent. We can think of those things and know that those same precious moments took place here, 71 years ago. Those who died, they are like us. Ordinary people understand this, I think. They do not want more war. They would rather that the wonders of science be focused on improving life and not eliminating it. When the choices made by nations, when the choices made by leaders, reflect this simple wisdom, then the lesson of Hiroshima is done. The world was forever changed here, but today the children of this city will go through their day in peace. What a precious thing that is. It is worth protecting, and then extending to every child. That is a future we can choose, a future in which Hiroshima and Nagasaki are known not as the dawn of atomic warfare but as the start of our own moral awakening.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "President Obama Calls Preliminary Iran Nuclear Deal ‘Our Best Bet’",
      "url": "https://www.nytimes.com/2015/04/06/world/middleeast/obama-strongly-defends-iran-nuclear-deal.html?searchResultPosition=60",
      "subtitle": "null",
      "author": "Peter Baker",
      "content": " WASHINGTON — President Obama strongly defended last week’s preliminary agreement with Iran as a “once in a lifetime opportunity” to curb the spread of nuclear weapons in a dangerous region while reassuring critics that he would keep all options available if Tehran ultimately cheated. As he sought in an interview with The New York Times to sell the tentative deal to skeptics accusing him of giving away too much, Mr. Obama emphasized to Israel that “we’ve got their backs” in the face of Iranian hostility. And he suggested that he could accept some sort of vote in Congress if it did not block his ability to carry out the agreement. “This is our best bet by far to make sure Iran doesn’t get a nuclear weapon,” Mr. Obama said in an interview with Thomas L. Friedman, an Op-Ed columnist for The Times, published on Sunday. “What we will be doing even as we enter into this deal is sending a very clear message to the Iranians and to the entire region that if anybody messes with Israel, America will be there.” In the interview, held Saturday, Mr. Obama provided new details about how international inspectors would try to access suspected covert nuclear sites and about the sequence that would lead to sanctions being lifted. Both were major issues in the last days of negotiations in Switzerland, and Mr. Obama’s descriptions differed in key respects from Iran’s interpretations. That gap suggested the hardest moments in the negotiations may yet be ahead, given that commitments made last week must still be enshrined in a written document signed by all parties by June 30. But Mr. Obama seemed to gain breathing space as Republicans signaled they would give him until then to see what the final deal looks like before directly intervening. The president’s comments came as the White House embarked on a campaign to sell a preliminary agreement that he hopes will transform security in the Middle East. Under the framework, negotiated with the United States and five other world powers, Iran agreed to scale back its nuclear program significantly for 10 to 15 years and accept intense international inspections. In exchange, the United States and the international community would lift sanctions that have punished the Iranian economy. While in theory preventing Iran from being able to quickly build a bomb, the agreement leaves it with a nuclear program in place, even if much diminished, drawing criticism from Prime Minister Benjamin Netanyahu of Israel and Republican leaders in Congress as well as skepticism from Arab allies and many Democrats. “Not a single centrifuge is destroyed,” Mr. Netanyahu said Sunday on “State of the Union” on CNN. “Not a single nuclear facility is shut down, including the underground facilities that they build illicitly. Thousands of centrifuges will keep spinning, enriching uranium. That’s a very bad deal.” Senator Lindsey Graham of South Carolina, a possible Republican presidential candidate, said it was “probably the best deal that Barack Obama could get with the Iranians because the Iranians don’t fear” him. “Hillary Clinton could do better,” he added, as could all the Republican candidates, “except maybe Rand Paul.” But Mr. Graham said he would wait to see how the final agreement looked. “I don’t mind giving the administration the time between now and June to put this deal together,” he said on “Face the Nation” on CBS. In the interview, the president struck a conciliatory note after weeks of open tension with Mr. Netanyahu, a clash that has worried even some White House advisers. Mr. Obama said “I respect” Mr. Netanyahu’s security argument and agreed that Israelis “have every right to be concerned about Iran,” a country that has threatened “to destroy Israel, that has denied the Holocaust, that has expressed venomous anti-Semitic ideas.” He pledged to redouble support for Israeli security. “I would consider it a failure on my part, a fundamental failure of my presidency, if on my watch, or as a consequence of work that I had done, Israel was rendered more vulnerable,” he said. Similarly, he said he wanted to use a meeting he has called at Camp David to “formalize” security aid for Arab allies threatened by Iran. While still resisting what he deemed congressional interference, Mr. Obama reached out to Republicans, calling Senator Bob Corker of Tennessee, chairman of the Foreign Relations Committee, a “good and decent man.” He did not embrace Mr. Corker’s legislation to give Congress the right to approve or reject the deal. But when asked about a nonbinding vote, the president appeared supportive. “My hope is that we can find something that allows Congress to express itself but does not encroach on traditional presidential prerogatives and ensures that if in fact we get a good deal that we can go ahead and implement it,” Mr. Obama said. Mr. Corker, appearing on “Fox News Sunday,” immediately rejected the idea of a nonbinding vote. “There is strong bipartisan support for a binding vote by Congress,” he said. “Look, the president needs to sell this to the American people, and Congress needs to be involved in this way.” Under the agreement, Iran would limit enrichment of uranium at its Natanz facility to a level useful only for civilian purposes; cut back the number of installed centrifuges by approximately two-thirds; convert its Fordo deep-underground enrichment facility into a research center; and modify its Arak heavy-water reactor to render it incapable of producing plutonium for a bomb. But the structure of international inspections was left vague, as was the timing for lifting sanctions. Mr. Obama said that inspectors would be able to watch “the entire nuclear chain” and that a “procurement committee” would examine Iranian imports to be sure equipment would be appropriate for peaceful nuclear uses, not a weapon. Inspectors from the International Atomic Energy Agency, he said, “can go anyplace.” But the administration has been vague about how to define “anyplace,” and Iran has said it would not be required to allow inspections of military bases. “Iran could object,” Mr. Obama acknowledged, “but what we have done is to try to design a mechanism whereby once those objections are heard, that is not a final veto that Iran has but in fact some sort of international mechanism will be in place that makes a fair assessment.” Mr. Obama said sanctions would be lifted only after Iran lived up to its commitments. “There are still details to be worked out,” he said, “but I think that the basic framework calls for Iran to take the steps that it needs to around Fordo, the centrifuges and so forth. At that point, then the U.N. sanctions are suspended.” He said the United States would “preserve the ability to snap back those sanctions if there is a violation.” And he added that separate sanctions imposed for other reasons, namely Iran’s sponsorship of terrorists and its ballistic missile program, would remain in place. Administration officials said they envisioned Iran being able to take the required steps within months or a year of an agreement, at which point nuclear-related economic sanctions would be removed. But a major sticking point in the coming months will be the issue of additional sanctions imposed for other reasons. Mr. Obama said almost nothing about how the United States and its allies would force Iran to answer questions about suspected past work on weapons designs. For years, Iran has blocked inspectors from visiting laboratories where such work is believed to have been conducted. Mr. Obama presented the nuclear agreement in broader terms. He admitted that he remained uncertain about the intentions of the supreme leader, Ayatollah Ali Khamenei, with whom he has exchanged letters. “He’s a pretty tough read,” Mr. Obama said. The ayatollah’s letters, he said, are filled with “a lot of reminders of what he perceives as past grievances against Iran.” But Mr. Obama said it was telling that the ayatollah allowed his negotiators to make concessions, and he held out hope that the agreement would empower more moderate figures, although he said he was not counting on it. “Who knows?” he added. “Iran may change.” But if not, he said, the United States retains “the most firepower” to address any contingencies. “It’s not as if in all these conversations, I’m leaving all my, you know, rifles at the door,” he said. Asked about an Obama Doctrine, he said: “The doctrine is we will engage, but we preserve all our capabilities. And I’ve been very clear that Iran will not get a nuclear weapon on my watch, and I think they should understand that we mean it. But I say that hoping that we can conclude this diplomatic arrangement and that it ushers in a new era in U.S.-Iranian relations.”",
      "date": "April 5, 2015",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Fidel Castro Criticizes Barack Obama’s Efforts to Change Cuba",
      "url": "https://www.nytimes.com/2016/03/29/world/americas/fidel-castro-criticizes-barack-obamas-efforts-to-change-cuba.html?searchResultPosition=59",
      "subtitle": "null",
      "author": "Azam Ahmed",
      "content": " MEXICO CITY — Fidel Castro, the former president of Cuba, offered a critical response on Monday to President Obama’s recent visit to his country, declaring that despite the warming relations between the two Cold War enemies, “we do not need the empire to give us anything.” In a long and digressive letter titled “Brother Obama” published in Granma, the official Communist Party newspaper, Mr. Castro struck a discordant note with the country’s political class, including his younger brother Raúl Castro, the current president. Mr. Obama did not meet with the elder Mr. Castro during his three-day visit to Cuba last week, which was meant to be a capstone to efforts to bury hostilities between the two countries, and to encourage the reform of Cuba’s flagging economy and political system. Mr. Castro, who is 89 and has not been seen in public since last summer, remains highly influential in the Communist Party even after his retirement, and took the opportunity on Monday to offer a counterpoint to the optimism of Mr. Obama’s visit. In his nearly 1,600-word missive, Mr. Castro recounted the history of United States aggression against his country, including the Bay of Pigs invasion in 1961 and the decades-long economic embargo of the island, which is still in effect. He chastised Mr. Obama, 54, for his youth and for failing to recognize what Mr. Castro said were the major accomplishments of Cuba’s Communist revolution, such as state pensions and salaries, the steps to eradicate racial discrimination and the role of Cuba’s indigenous people in society. The letter urged Mr. Obama not to jump to conclusions about the Cuban system, or assume that the past could be so easily forgotten. “My modest suggestion is that he reflects and doesn’t try to develop theories about Cuban politics,” Mr. Castro wrote, citing Mr. Obama’s own words during the trip, including a request to leave the past behind and embark on a future of hope and togetherness. “I suppose all of us were at risk of a heart attack upon hearing these words from the president of the United States.” Theodore Piccone, a senior fellow at the Brookings Institution in Washington, said that Mr. Castro was “exercising the Cuban people’s muscle memory on the bad things the United States did after he led the revolution,” but that the letter was probably not intended to derail the diplomatic opening. “The timing of the editorial — coming after the visit, during which Fidel was neither seen nor heard — signals an effort to do minimal harm to his brother’s rapprochement with the U.S.,” Mr. Piccone added. Mr. Castro’s admonition comes across as something of a reminder to the Cuban people that shedding the government’s long-running enmity with the United States and reforming its economic system should not undermine what he and other Cubans view as the ideals and achievements of the revolution. “Nobody should be under the illusion that the people of this dignified and selfless country will renounce the glory, the rights or the spiritual wealth they have gained with the development of education, science and culture,” Mr. Castro wrote.",
      "date": "March 28, 2016",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "White House Says President Obama and Vladimir Putin Will Meet Next Week",
      "url": "https://www.nytimes.com/2015/09/25/world/europe/white-house-to-announce-that-obama-and-putin-will-meet.html?searchResultPosition=58",
      "subtitle": "null",
      "author": "Peter Baker",
      "content": "  WASHINGTON — In case anyone had doubt, the White House wanted it known on Thursday that it was President Vladimir V. Putin of Russia who asked to meet with President Obama, not the other way around. Mr. Putin was not just eager for a meeting, said Josh Earnest, the White House press secretary, but in fact “desperate” for one. The emphasis on who wanted to meet more underscored the sensitivities and risks of the meeting, which the White House officially announced on Thursday. Mr. Obama has not seen Mr. Putin in nearly a year, and the two have not had a formal sit-down meeting in more than two years, before Russia annexed Crimea and intervened in eastern Ukraine. “It is fair for you to say that based on the repeated requests we’ve seen from the Russians, that they are quite interested in having a conversation with President Obama,” Mr. Earnest said. Ultimately, Mr. Obama decided “that it was worth it at this point to engage with President Putin in a face-to-face meeting to see if the interests of the United States could be advanced.” The meeting, to be held in New York on Monday, where both will be attending the annual session of the United Nations General Assembly, presents a challenge to Mr. Obama. Aides said Mr. Obama would press Mr. Putin to live up to a cease-fire in Ukraine and test his intentions in Syria, where he has recently dispatched combat jets, tanks and other military equipment. Officials said they hoped to explore a settlement of Syria’s four-year-old civil war without leaving in power President Bashar al-Assad, a longtime Russian ally. But they said Mr. Putin’s deployment to Syria seemed to be an effort to make himself a player again on the international stage and change the subject from his encroachment in Ukraine. “It’s a tough one for Obama,” said Fiona Hill, a former national intelligence officer on Russia who is now at the Brookings Institution. “He has to meet with him given the circumstances. But it’s not very clear what we’re going to get out of it. The Russians have made their position crystal clear: They want to have a central say about what happens.” The announcement ended a debate inside the administration about whether a meeting might reward Mr. Putin for disruptive behavior. In the end, officials indicated, Mr. Obama decided to take that risk in part because Mr. Putin is the only real decision maker in Russia and any resolution in Ukraine or Syria depends on him. But the White House seemed to go out of its way on Thursday not to show deference. At one point during his daily briefing, Mr. Earnest noted Mr. Putin’s habit of slouching while meeting with counterparts, pointing to a recent photo of him with Israel’s prime minister. “President Putin was striking a now-familiar pose of less-than-perfect posture and unbuttoned jacket and, you know, knees spread far apart to convey a particular image,” he said. White House officials said the core message of the meeting would be Mr. Obama’s insistence that Russia live up to the terms of the cease-fire in Ukraine negotiated in Minsk, the capital of neighboring Belarus. But Mr. Earnest said the meeting would not undermine international solidarity against Russian actions in Ukraine. “That’s not going to change because of one in-person conversation,” he said. The Kremlin has continued to provide military support to separatists in eastern Ukraine, and few observers expect the Minsk peace agreement to be fully put in effect in the coming months. Benjamin J. Rhodes, a deputy national security adviser to the president, said the meeting would also allow Mr. Obama to assess whether the two sides could collaborate against the Islamic State terrorist group in Syria, also known as ISIS or ISIL. “President Obama will seek to understand what the Russian government means when it states it is enhancing or increasing its military involvement in Syria in order to enhance efforts to counter ISIL,” Mr. Rhodes said. The last time Mr. Obama and Mr. Putin had a formal, scheduled meeting was in June 2013 in Northern Ireland on the sidelines of a meeting of the Group of 8 powers. Mr. Obama canceled a summit meeting with Mr. Putin that fall after Russia gave shelter to Edward J. Snowden, the former National Security Agency contractor who leaked documents. After Russia’s intervention in Ukraine, it was kicked out of the Group of 8, and Mr. Obama’s contacts with Mr. Putin were limited even further to occasional telephone calls and passing encounters, such as brief words they exchanged on the sidelines of two international economic summit meetings last November in China and Australia. But through it all, Secretary of State John Kerry has remained in regular contact with his Russian counterpart, Foreign Minister Sergey V. Lavrov, and American officials credited the Russians with playing a mostly helpful role during multinational negotiations that led to the recent nuclear accord with Iran. Russia’s decision to begin a military buildup in Syria at an air base south of Latakia, including the deployment of Su-25 Frogfoot ground-attack planes, has increased the Kremlin’s leverage for a potential political settlement. Russian diplomats have asserted in closed-door meetings with Western officials that they are not wedded to Mr. Assad’s continuing as Syria’s president. Obama administration officials hope that they can eventually persuade Moscow to withdraw support for Mr. Assad and encourage a political transition in which he would leave power. But the effort to elicit Moscow’s cooperation on Syria, including a May meeting between Mr. Kerry and Mr. Putin in Sochi, Russia, has yet to bear fruit. Mr. Putin left his bottom line unclear in an interview with Charlie Rose for “60 Minutes” on CBS. “There is no other solution to the Syrian crisis than strengthening the effective government structures and rendering them help in fighting terrorism,” he said. “But at the same time, urging them to engage in positive dialogue with the rational opposition and conduct reform.” The doubts in the administration were voiced on Thursday by Defense Secretary Ashton B. Carter, who said he remained unsure whether American and Russian interests truly converged on Syria. At a news conference with the Ukrainian defense minister at the Pentagon, Mr. Carter expressed worry that Russia may use its military buildup to indiscriminately attack Syrian rebels who oppose Mr. Assad, a move he compared to “pouring gasoline” on the war there. “We will continue to work with Russia on issues where our interests overlap,” Mr. Carter said. But he added, “It is possible but not yet clear that such an overlap might exist in Syria.”",
      "date": "Sept. 24, 2015",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Cubans Pack the Streets for a Glimpse of President Obama",
      "url": "https://www.nytimes.com/2016/03/21/world/americas/obama-arrives-in-cuba.html?searchResultPosition=54",
      "subtitle": "null",
      "author": "Julie Hirschfeld Davis",
      "content": "  HAVANA — Shouts of “U.S.A.!” and “Obama!” echoed over the stone plazas as President Obama and his family made their way around rain-slicked courtyards in Old Havana on Sunday evening, savoring the adulation of Cubans welcoming him warmly despite a driving rain as he began a history-making visit. “Welcome to Cuba! We like you!” a man shouted as Mr. Obama’s entourage passed. Above, a woman applauded and hooted from her wrought-iron balcony. Later, a motorcade including the presidential limousine, adorned for the first time with Cuban and American flags, snaked through narrow streets where elated residents, their clothing soaked from waiting in the rain, hoisted cellphones and cheered the first sitting American leader to set foot on Cuban soil in 88 years. Mr. Obama himself marveled aloud at the significance of his trip. “It’s a historic opportunity to engage directly with the Cuban people and to forge new agreements and commercial deals,” he told employees of the United States Embassy, his first stop in the country, “and build new ties between our two peoples, and for me to lay out my vision for a future that’s brighter than our past.” Noting that Calvin Coolidge, the last sitting president to visit the island nation, in 1928, had arrived on a battleship after a three-day journey, Mr. Obama remarked, “It only took me three hours.” Mr. Obama thanked embassy personnel who had brought young children to the ceremony. “By the time they’re adults,” he said, “our hope is that they think it’s natural that a U.S. president should be visiting Cuba, and they think it’s natural that the two peoples are working together.” The Obamas then set off for the cobblestone streets of Old Havana, strolling to a statue of Carlos Manuel de Céspedes and then to the Museum of the City of Havana, set in a leafy courtyard that features a statue of Christopher Columbus. At the Cathedral de San Cristóbal de la Habana, Mr. Obama met with Cardinal Jaime Ortega, who played a pivotal role in the secret talks that led to an initial rapprochement in 2014. The cardinal made a clandestine trip to the White House as an interlocutor for Pope Francis to prod an agreement between Mr. Obama and President Raúl Castro. The sightseeing was a prelude to a meeting Mr. Obama is to have on Monday with his Cuban counterpart — the first official meeting of the two governments in more than a half-century All around the city on Sunday, Mr. Obama’s name could be heard — before he arrived, when bartenders on a hotel rooftop thought they saw his entourage; when he landed, as groups of Cubans stood under verandas by the sea; and in homes across the city, where families watched him wave and smile on Cuban television. “It totally satisfies my soul to be able to have lived to see this moment, a moment I never thought I would have seen,” said Carmen Diaz, 70, watching Mr. Obama’s arrival from her daughter’s living room. “I feel this visit of an American president to Cuba is being done in the most elegant way possible.” Still, between the rain and the muscular security presence throughout Havana after the arrest of dozens of dissidents Sunday morning, the arrival brought out little of the excitement and pride that many Cubans have expressed at having an American president — and better yet, this president — in their midst. In Old Havana, many of the old streets were empty during Mr. Obama’s tour. A few people tried to sneak a peek at the president, but were turned back more than a dozen blocks away. One shop owner, near a poster showing President Castro and President Obama together, said before Mr. Obama landed that she had been told to close her shop during his walk through the area. “People will look in the windows,” she said. “It’s fine. I’ve been talking to all my friends about Obama, and we’re all just happy to see him coming.” Mr. Obama has long been admired by Cubans, first as a candidate, then as a president. When he announced restored relations with Cuba on Dec. 17, 2014, he came to embody a Cuban moment that symbolizes opportunity. That date is now recited often as a new national starting point, joining other historic dates, like July 26, 1953, when President Castro’s brother Fidel mounted an attack on the Moncada barracks, initiating the revolution. The Cuban government has signaled that its leaders and people plan to treat the president with respect. They have been working to beautify Havana for weeks. Roads with more potholes than flat patches have been repaved. Buildings along the president’s route have also been painted in attractive pastels, prompting Cubans to call the president “Saint Obama” and to joke, “Too bad Obama can’t stay for a month or a year.” The government, though, has also made clear to all Cubans, with editorials and preventive detentions and by other means, that it will not tolerate public demonstrations or any other form of public dissent — against the government or the United States. That urge for control has left some Cubans with nagging doubts about what this trip, and the change in United States-Cuba relations, really means. Outside the baseball stadium that Mr. Obama will visit on Tuesday, Juliet Garcia Gonzalez, 17, said she was glad the president was visiting because he had given her generation hope, a rare commodity in a country that has long seemed stuck in place. She just wasn’t sure it was enough. “I want to travel, I want to leave,” she said, tapping at her phone, connected through a new Wi-Fi hot spot outside the stadium. “I want to come back when Cuba is better.”",
      "date": "March 20, 2016",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Along With President Obama, the 21st Century Visited Cuba",
      "url": "https://www.nytimes.com/2016/03/28/world/americas/along-with-president-obama-the-21st-century-visited-cuba.html?searchResultPosition=53",
      "subtitle": "null",
      "author": "Julie Hirschfeld Davis",
      "content": " HAVANA — The White House made sure the wireless signal inside the Grand Theater of Havana was strong and fast last week as President Obama made his case for change to the Cuban people. He spoke of evolution and burying old wounds from before he was born. He bluntly challenged President Raúl Castro of Cuba, sitting across the hall, to change his ways. Outside that theater and throughout Cuba, Internet access ranges from sluggish to nonexistent, and change is equally slow. The wounds that Mr. Obama spoke of are the defining grievances of Mr. Castro’s lifetime and that of his older brother, Fidel. The 30 years between Mr. Obama, 54, and Mr. Castro, 84, help explain the vast gulf that separates the two leaders, on vivid display last week as the American president made a historic visit to Cuba. Mr. Obama’s trip was calculated to highlight the generational contrast and appeal to a younger cohort both in Cuba and in the United States, presenting his vision for a thaw as the inevitable way of the future, and the hostility and isolation that came before as the stale remnant of another century. “He moved with this fluid, lanky, youthful movement, and that contrasted so strongly with Raúl and his stiff military bearing,” said Richard Feinberg, a senior fellow in the Latin America initiative at the Brookings Institution, who traveled to Cuba last week to witness the visit. “His speech constantly focused on generational shift, youth, the future, let’s put the past behind us,” Mr. Feinberg added. “A lot of these things didn’t have to be said — you had the visual representation that sent the message.” At a news conference last Monday at the Revolutionary Palace, Mr. Obama was confident and in his element as he addressed reporters and fielded questions, while Mr. Castro, unaccustomed to such an exchange and apparently irritated with his translation headset, showed his age. “The iconic image was Castro getting all huffy about some pretty anodyne critiques of the human rights situation in Cuba,” said Michael C. Desch, a political-science professor at the University of Notre Dame. “The gestalt of the visit for Obama was very much ‘I know you’re on your way out, and I’m going to speak to the Cuban population about what the future looks like after you.’” It was a message that Mr. Obama delivered visually as much as verbally. In Cuba, where two-thirds of the population is black or mixed-race — and Mr. Castro and the vast majority of his government are white — a mixed-race American president embodied possibilities that most Cubans consider out of reach. Mr. Obama, who built his first presidential campaign around support from younger voters and themes of generational change, gravitates to youths wherever he travels. Forums at universities or with young leaders active in their communities are staples of his foreign trips, and Cuba was no exception. At an entrepreneurship event in Havana, Mr. Obama offered encouragement to young Cubans working to establish their own businesses within their country’s state-run economy. He brought along Brian Chesky, the 34-year-old founder of the online booking company Airbnb, telling the audience, “You can see how young he is.” Later, at his speech to the Cuban people at the Grand Theater, Mr. Obama pressed the generational argument on Mr. Castro, who sat listening in a balcony across the room. “If you can’t access information online, if you cannot be exposed to different points of view, you will not reach your full potential, and over time, the youth will lose hope,” Mr. Obama said. “I know these issues are sensitive, especially coming from an American president,” he added. Mr. Obama’s message is grounded in the political reality of a changing Cuban population, both in the United States and on the island. While older Cuban-Americans tend to harbor lingering feelings of anger and resentment about that country’s Communist government, leading them to favor embargo and isolation, a younger generation has less emotional investment in those decades-old disputes. Likewise, while many members of older generations who remained on the island have a visceral connection to the revolution and all that followed, their children and grandchildren may have little memory of the roots of resentment toward the United States. Speaking directly to their perspective, Mr. Obama said in his speech: “I know the history, but I refuse to be trapped by it.” A New York Times/CBS News poll conducted before the president’s trip and released last week illustrates the divide. Among respondents in the United States ages 18 to 29, fully 64 percent said they approved of Mr. Obama’s handling of Cuba, compared with 49 percent of those 30 and older. While the poll showed majority support over all for his approach, with 52 percent approving of it and 30 percent opposed to it, people 65 and older were substantially more negative, with 42 percent of them disapproving. Lopsided percentages of young people said re-establishing relations with Cuba would be good for the United States, according to the poll, while a smaller majority of older people did. Mr. Obama moved around Havana in the sleek black limousine known as “the Beast,” through streets that appeared frozen in time, packed with classic American cars of the mid-20th century. “You drive around Havana and you say, ‘This economy is not working,’” he said later. “It looks like it did in the 1950s.” Likewise, the theater where he spoke to the Cuban people looks very much as it did 88 years ago, when Calvin Coolidge, the last sitting American president to go to Cuba, spoke there to a Western Hemisphere summit meeting. This time, though, Mr. Obama’s staff made sure there was plenty of Internet connectivity for his message of change and transformation to be posted on Twitter, streamed and broadcast as widely as possible. And then, just as quickly, the president finished speaking, and the signal strength died. Mr. Obama left Cuba not long after, his motorcade passing by signs bearing old revolutionary slogans and portraits of Fidel in younger days as it went.",
      "date": "March 27, 2016",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "President Obama and India’s Modi Forge an Unlikely Friendship",
      "url": "https://www.nytimes.com/2016/06/06/world/asia/india-narendra-modi-obama.html?searchResultPosition=51",
      "subtitle": "null",
      "author": "Gardiner Harris",
      "content": " WASHINGTON — There are few relationships between President Obama and another world leader more unlikely than the one he has with Prime Minister Narendra Modi of India. The two have a public warmth — or “chemistry,” as the Indian news media like to describe it — and that is likely to be on display Tuesday when Mr. Modi visits the White House for the second time in two years. It will be the seventh time the two leaders have met. There are compelling reasons the leaders of the world’s largest democracies would find common cause. The United States is encouraging the rise of India as a giant Asian partner to balance China, and India is trying to accelerate its economy with an injection of investment from American companies. “It is true that Obama and I have a special friendship, a special wavelength,” Mr. Modi said last month in an interview with The Wall Street Journal. Benjamin J. Rhodes, the president’s deputy national security adviser for strategic communication, said on Saturday that the two leaders “have each invested in developing a close relationship.” It is worth recounting just how unlikely such a friendship is. The nation’s first black president, Mr. Obama has made the protection of minorities a central pillar of his life. And he has argued that criticism and dissent are core tenets of democracy. Mr. Modi, by contrast, spent much of his life rising through the ranks of the Rashtriya Swayamsevak Sangh, a right-wing paramilitary organization that campaigns forcefully for India’s Hindu majority. Mr. Modi was in charge of the state of Gujarat when rioting in 2002 cost the lives of more than 1,000 people, most of them Muslims. Just last week, 24 people were convicted of massacring Muslims during the riots, and pending cases are attempting to prove that Mr. Modi, who has so far escaped judicial censure, was part of a high-level conspiracy to encourage the killings. Generally poorer and less educated than India’s Hindus, Muslims are about 14 percent of the population, about the same proportion as African-Americans in the United States. In India, Mr. Modi’s reputation among Muslims could broadly be compared to that of a Southern segregationist from the 1950s. Perhaps just as troubling, Mr. Modi’s government has increasingly used the country’s broad and vague laws restricting free speech to stifle dissent, according to a recent report by Human Rights Watch. Other laws have been used to intimidate and even shut down nongovernmental organizations, such as Greenpeace. Neither Mr. Obama nor Mr. Modi is given to displaying affection. Both avoid the socializing common in their capitals. And while Mr. Obama is a doting father and dutiful husband who maintains close bonds with his childhood friends, Mr. Modi abandoned his arranged marriage decades ago and has no children or any public friendships. Some political analysts have expressed deep skepticism that the two leaders have any real fondness for each other. Mr. Modi is part of a class of “populist, electable, narcissistic right-wing autocrats whose appeal is that they pander to majoritarian anger,” said Kanti Prasad Bajpai, a professor of Asian studies at the National University of Singapore. “Obama is the opposite of that, so it is hard to see how close they can be,” Mr. Bajpai said. Others see similarities that extend beyond political beliefs. Both men rose from modest circumstances, had difficult relationships with their fathers and were widely considered transformational figures when elected. (Mr. Modi’s humble origins, largely corruption-free government and intense focus on winning foreign investment are sharp breaks from his predecessor.) And parts of Mr. Modi’s political operation, in particular its effective use of social media, were based on Mr. Obama’s model. Ashley J. Tellis, a senior associate with the Carnegie Endowment for International Peace, said both men “are remarkably warm and have a personal graciousness about them that is very evident in personal encounters.” Raymond E. Vickery, a former United States assistant secretary of commerce who has met Mr. Modi, said both had grown up as outsiders and valued frankness. “Modi is a really down-to-earth guy who tries to answer your questions and doesn’t just go to talking points,” Mr. Vickery said. Mr. Obama made the first significant gesture in the relationship when, during Mr. Modi’s first official visit to Washington in 2014, the president left his White House staff behind to give a personal 15-minute tour of the Martin Luther King Jr. Memorial. Mr. Modi responded by inviting Mr. Obama to be his guest at the annual Republic Day celebrations in New Delhi in January 2015. When Mr. Obama arrived, Mr. Modi broke with protocol to greet the president at the airport with a hug. And at a later appearance, Mr. Modi referred to the president as Barack and thanked him for his “deep personal commitment” to their friendship. In a toast at a state dinner, Mr. Obama called Mr. Modi “my partner and friend.” “The hours they’ve spent together,” Mr. Rhodes said Saturday, “have allowed them to have a good understanding of their respective worldviews and domestic circumstances, and made it possible to deepen defense ties, advance our civil nuclear cooperation and achieve a breakthrough on climate change.” He added, “It’s also an indication of how important President Obama thinks our relationship is with India, as the world’s largest democracy and an increasingly important partner.” On Tuesday, White House officials said, the two leaders are expected to discuss climate change and clean energy partnerships, security cooperation, and economic growth. Analysts said the leaders might announce a new defense logistics agreement, further progress on India’s efforts to phase out ozone-depleting hydrofluorocarbons and perhaps a deal for Westinghouse Electric Corporation to build nuclear power plants in India in a long-delayed fulfillment of a pact first struck in 2006. A shared interest in clean power and climate change is central to their personal bond, some analysts said. “These two guys get very little political traction at home for being climate champions, but they are anyway, and I think they respect each other for that,” said Andrew Light, a former senior adviser to the United States special envoy on climate change. Tavleen Singh, an Indian commentator and admirer of Mr. Modi, said the prime minister’s high-profile sanitation campaign and his efforts to improve the status of women would also endear him to Mr. Obama. Still, she said she doubted that the two men were truly affectionate. Zia Haq, an assistant editor at The Hindustan Times in India, was also skeptical. “I refuse to believe the two men could be very good personal friends deep down, because Modi is all things Obama can’t possibly be,” Mr. Haq wrote in an email.",
      "date": "June 5, 2016",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "President Obama’s Speech to the United Nations General Assembly 2015",
      "url": "https://www.nytimes.com/2015/09/29/world/americas/president-obamas-speech-to-the-united-nations-general-assembly-2015.html?searchResultPosition=50",
      "subtitle": "null",
      "author": "",
      "content": "The following speech was delivered by President Obama at the United Nations General Assembly as transcribed and released by the White House. Mr. President, Mr. Secretary General, fellow delegates, ladies and gentlemen: Seventy years after the founding of the United Nations, it is worth reflecting on what, together, the members of this body have helped to achieve. Out of the ashes of the Second World War, having witnessed the unthinkable power of the atomic age, the United States has worked with many nations in this Assembly to prevent a third world war — by forging alliances with old adversaries; by supporting the steady emergence of strong democracies accountable to their people instead of any foreign power; and by building an international system that imposes a cost on those who choose conflict over cooperation, an order that recognizes the dignity and equal worth of all people. That is the work of seven decades. That is the ideal that this body, at its best, has pursued. Of course, there have been too many times when, collectively, we have fallen short of these ideals. Over seven decades, terrible conflicts have claimed untold victims. But we have pressed forward, slowly, steadily, to make a system of international rules and norms that are better and stronger and more consistent. It is this international order that has underwritten unparalleled advances in human liberty and prosperity. It is this collective endeavor that’s brought about diplomatic cooperation between the world’s major powers, and buttressed a global economy that has lifted more than a billion people from poverty. It is these international principles that helped constrain bigger countries from imposing our will on smaller ones, and advanced the emergence of democracy and development and individual liberty on every continent. This progress is real. It can be documented in lives saved, and agreements forged, and diseases conquered, and in mouths fed. And yet, we come together today knowing that the march of human progress never travels in a straight line, that our work is far from complete; that dangerous currents risk pulling us back into a darker, more disordered world. Today, we see the collapse of strongmen and fragile states breeding conflict, and driving innocent men, women and children across borders on an epic scale. Brutal networks of terror have stepped into the vacuum. Technologies that empower individuals are now also exploited by those who spread disinformation, or suppress dissent, or radicalize our youth. Global capital flows have powered growth and investment, but also increased risk of contagion, weakened the bargaining power of workers, and accelerated inequality. How should we respond to these trends? There are those who argue that the ideals enshrined in the U.N. charter are unachievable or out of date — a legacy of a postwar era not suited to our own. Effectively, they argue for a return to the rules that applied for most of human history and that pre-date this institution: the belief that power is a zero-sum game; that might makes right; that strong states must impose their will on weaker ones; that the rights of individuals don’t matter; and that in a time of rapid change, order must be imposed by force. On this basis, we see some major powers assert themselves in ways that contravene international law. We see an erosion of the democratic principles and human rights that are fundamental to this institution’s mission; information is strictly controlled, the space for civil society restricted. We’re told that such retrenchment is required to beat back disorder; that it’s the only way to stamp out terrorism, or prevent foreign meddling. In accordance with this logic, we should support tyrants like Bashar al-Assad, who drops barrel bombs to massacre innocent children, because the alternative is surely worse. The increasing skepticism of our international order can also be found in the most advanced democracies. We see greater polarization, more frequent gridlock; movements on the far right, and sometimes the left, that insist on stopping the trade that binds our fates to other nations, calling for the building of walls to keep out immigrants. Most ominously, we see the fears of ordinary people being exploited through appeals to sectarianism, or tribalism, or racism, or anti-Semitism; appeals to a glorious past before the body politic was infected by those who look different, or worship God differently; a politics of us versus them. The United States is not immune from this. Even as our economy is growing and our troops have largely returned from Iraq and Afghanistan, we see in our debates about America’s role in the world a notion of strength that is defined by opposition to old enemies, perceived adversaries, a rising China, or a resurgent Russia; a revolutionary Iran, or an Islam that is incompatible with peace. We see an argument made that the only strength that matters for the United States is bellicose words and shows of military force; that cooperation and diplomacy will not work. As President of the United States, I am mindful of the dangers that we face; they cross my desk every morning. I lead the strongest military that the world has ever known, and I will never hesitate to protect my country or our allies, unilaterally and by force where necessary. But I stand before you today believing in my core that we, the nations of the world, cannot return to the old ways of conflict and coercion. We cannot look backwards. We live in an integrated world — one in which we all have a stake in each other’s success. We cannot turn those forces of integration. No nation in this Assembly can insulate itself from the threat of terrorism, or the risk of financial contagion; the flow of migrants, or the danger of a warming planet. The disorder we see is not driven solely by competition between nations or any single ideology. And if we cannot work together more effectively, we will all suffer the consequences. That is true for the United States, as well. No matter how powerful our military, how strong our economy, we understand the United States cannot solve the world’s problems alone. In Iraq, the United States learned the hard lesson that even hundreds of thousands of brave, effective troops, trillions of dollars from our Treasury, cannot by itself impose stability on a foreign land. Unless we work with other nations under the mantle of international norms and principles and law that offer legitimacy to our efforts, we will not succeed. And unless we work together to defeat the ideas that drive different communities in a country like Iraq into conflict, any order that our militaries can impose will be temporary. Just as force alone cannot impose order internationally, I believe in my core that repression cannot forge the social cohesion for nations to succeed. The history of the last two decades proves that in today’s world, dictatorships are unstable. The strongmen of today become the spark of revolution tomorrow. You can jail your opponents, but you can’t imprison ideas. You can try to control access to information, but you cannot turn a lie into truth. It is not a conspiracy of U.S.-backed NGOs that expose corruption and raise the expectations of people around the globe; it’s technology, social media, and the irreducible desire of people everywhere to make their own choices about how they are governed. Indeed, I believe that in today’s world, the measure of strength is no longer defined by the control of territory. Lasting prosperity does not come solely from the ability to access and extract raw materials. The strength of nations depends on the success of their people — their knowledge, their innovation, their imagination, their creativity, their drive, their opportunity — and that, in turn, depends upon individual rights and good governance and personal security. Internal repression and foreign aggression are both symptoms of the failure to provide this foundation. A politics and solidarity that depend on demonizing others, that draws on religious sectarianism or narrow tribalism or jingoism may at times look like strength in the moment, but over time its weakness will be exposed. And history tells us that the dark forces unleashed by this type of politics surely makes all of us less secure. Our world has been there before. We gain nothing from going back. Instead, I believe that we must go forward in pursuit of our ideals, not abandon them at this critical time. We must give expression to our best hopes, not our deepest fears. This institution was founded because men and women who came before us had the foresight to know that our nations are more secure when we uphold basic laws and basic norms, and pursue a path of cooperation over conflict. And strong nations, above all, have a responsibility to uphold this international order. Let me give you a concrete example. After I took office, I made clear that one of the principal achievements of this body — the nuclear non-proliferation regime — was endangered by Iran’s violation of the NPT. On that basis, the Security Council tightened sanctions on the Iranian government, and many nations joined us to enforce them. Together, we showed that laws and agreements mean something. But we also understood that the goal of sanctions was not simply to punish Iran. Our objective was to test whether Iran could change course, accept constraints, and allow the world to verify that its nuclear program will be peaceful. For two years, the United States and our partners — including Russia, including China — stuck together in complex negotiations. The result is a lasting, comprehensive deal that prevents Iran from obtaining a nuclear weapon, while allowing it to access peaceful energy. And if this deal is fully implemented, the prohibition on nuclear weapons is strengthened, a potential war is averted, our world is safer. That is the strength of the international system when it works the way it should. That same fidelity to international order guides our responses to other challenges around the world. Consider Russia’s annexation of Crimea and further aggression in eastern Ukraine. America has few economic interests in Ukraine. We recognize the deep and complex history between Russia and Ukraine. But we cannot stand by when the sovereignty and territorial integrity of a nation is flagrantly violated. If that happens without consequence in Ukraine, it could happen to any nation gathered here today. That’s the basis of the sanctions that the United States and our partners impose on Russia. It’s not a desire to return to a Cold War. Now, within Russia, state-controlled media may describe these events as an example of a resurgent Russia — a view shared, by the way, by a number of U.S. politicians and commentators who have always been deeply skeptical of Russia, and seem to be convinced a new Cold War is, in fact, upon us. And yet, look at the results. The Ukrainian people are more interested than ever in aligning with Europe instead of Russia. Sanctions have led to capital flight, a contracting economy, a fallen ruble, and the emigration of more educated Russians. Imagine if, instead, Russia had engaged in true diplomacy, and worked with Ukraine and the international community to ensure its interests were protected. That would be better for Ukraine, but also better for Russia, and better for the world — which is why we continue to press for this crisis to be resolved in a way that allows a sovereign and democratic Ukraine to determine its future and control its territory. Not because we want to isolate Russia — we don’t — but because we want a strong Russia that’s invested in working with us to strengthen the international system as a whole. Similarly, in the South China Sea, the United States makes no claim on territory there. We don’t adjudicate claims. But like every nation gathered here, we have an interest in upholding the basic principles of freedom of navigation and the free flow of commerce, and in resolving disputes through international law, not the law of force. So we will defend these principles, while encouraging China and other claimants to resolve their differences peacefully. I say this, recognizing that diplomacy is hard; that the outcomes are sometimes unsatisfying; that it’s rarely politically popular. But I believe that leaders of large nations, in particular, have an obligation to take these risks — precisely because we are strong enough to protect our interests if, and when, diplomacy fails. I also believe that to move forward in this new era, we have to be strong enough to acknowledge when what you’re doing is not working. For 50 years, the United States pursued a Cuba policy that failed to improve the lives of the Cuban people. We changed that. We continue to have differences with the Cuban government. We will continue to stand up for human rights. But we address these issues through diplomatic relations, and increased commerce, and people-to-people ties. As these contacts yield progress, I’m confident that our Congress will inevitably lift an embargo that should not be in place anymore. (Applause.) Change won’t come overnight to Cuba, but I’m confident that openness, not coercion, will support the reforms and better the life the Cuban people deserve, just as I believe that Cuba will find its success if it pursues cooperation with other nations. Now, if it’s in the interest of major powers to uphold international standards, it is even more true for the rest of the community of nations. Look around the world. From Singapore to Colombia to Senegal, the facts shows that nations succeed when they pursue an inclusive peace and prosperity within their borders, and work cooperatively with countries beyond their borders. That path is now available to a nation like Iran, which, as of this moment, continues to deploy violent proxies to advance its interests. These efforts may appear to give Iran leverage in disputes with neighbors, but they fuel sectarian conflict that endangers the entire region, and isolates Iran from the promise of trade and commerce. The Iranian people have a proud history, and are filled with extraordinary potential. But chanting “Death to America” does not create jobs, or make Iran more secure. If Iran chose a different path, that would be good for the security of the region, good for the Iranian people, and good for the world. Of course, around the globe, we will continue to be confronted with nations who reject these lessons of history, places where civil strife, border disputes, and sectarian wars bring about terrorist enclaves and humanitarian disasters. Where order has completely broken down, we must act, but we will be stronger when we act together. In such efforts, the United States will always do our part. We will do so mindful of the lessons of the past — not just the lessons of Iraq, but also the example of Libya, where we joined an international coalition under a U.N. mandate to prevent a slaughter. Even as we helped the Libyan people bring an end to the reign of a tyrant, our coalition could have and should have done more to fill a vacuum left behind. We’re grateful to the United Nations for its efforts to forge a unity government. We will help any legitimate Libyan government as it works to bring the country together. But we also have to recognize that we must work more effectively in the future, as an international community, to build capacity for states that are in distress, before they collapse. And that’s why we should celebrate the fact that later today the United States will join with more than 50 countries to enlist new capabilities — infantry, intelligence, helicopters, hospitals, and tens of thousands of troops — to strengthen United Nations peacekeeping. (Applause.) These new capabilities can prevent mass killing, and ensure that peace agreements are more than words on paper. But we have to do it together. Together, we must strengthen our collective capacity to establish security where order has broken down, and to support those who seek a just and lasting peace. Nowhere is our commitment to international order more tested than in Syria. When a dictator slaughters tens of thousands of his own people, that is not just a matter of one nation’s internal affairs — it breeds human suffering on an order of magnitude that affects us all. Likewise, when a terrorist group beheads captives, slaughters the innocent and enslaves women, that’s not a single nation’s national security problem — that is an assault on all humanity. I’ve said before and I will repeat: There is no room for accommodating an apocalyptic cult like ISIL, and the United States makes no apologies for using our military, as part of a broad coalition, to go after them. We do so with a determination to ensure that there will never be a safe haven for terrorists who carry out these crimes. And we have demonstrated over more than a decade of relentless pursuit of al Qaeda, we will not be outlasted by extremists. But while military power is necessary, it is not sufficient to resolve the situation in Syria. Lasting stability can only take hold when the people of Syria forge an agreement to live together peacefully. The United States is prepared to work with any nation, including Russia and Iran, to resolve the conflict. But we must recognize that there cannot be, after so much bloodshed, so much carnage, a return to the pre-war status quo. Let’s remember how this started. Assad reacted to peaceful protests by escalating repression and killing that, in turn, created the environment for the current strife. And so Assad and his allies cannot simply pacify the broad majority of a population who have been brutalized by chemical weapons and indiscriminate bombing. Yes, realism dictates that compromise will be required to end the fighting and ultimately stamp out ISIL. But realism also requires a managed transition away from Assad and to a new leader, and an inclusive government that recognizes there must be an end to this chaos so that the Syrian people can begin to rebuild. We know that ISIL — which emerged out of the chaos of Iraq and Syria — depends on perpetual war to survive. But we also know that they gain adherents because of a poisonous ideology. So part of our job, together, is to work to reject such extremism that infects too many of our young people. Part of that effort must be a continued rejection by Muslims of those who distort Islam to preach intolerance and promote violence, and it must also a rejection by non-Muslims of the ignorance that equates Islam with terror. (Applause.) This work will take time. There are no easy answers to Syria. And there are no simple answers to the changes that are taking place in much of the Middle East and North Africa. But so many families need help right now; they don’t have time. And that’s why the United States is increasing the number of refugees who we welcome within our borders. That’s why we will continue to be the largest donor of assistance to support those refugees. And today we are launching new efforts to ensure that our people and our businesses, our universities and our NGOs can help as well — because in the faces of suffering families, our nation of immigrants sees ourselves. Of course, in the old ways of thinking, the plight of the powerless, the plight of refugees, the plight of the marginalized did not matter. They were on the periphery of the world’s concerns. Today, our concern for them is driven not just by conscience, but should also be drive by self-interest. For helping people who have been pushed to the margins of our world is not mere charity, it is a matter of collective security. And the purpose of this institution is not merely to avoid conflict, it is to galvanize the collective action that makes life better on this planet. The commitments we’ve made to the Sustainable Development Goals speak to this truth. I believe that capitalism has been the greatest creator of wealth and opportunity that the world has ever known. But from big cities to rural villages around the world, we also know that prosperity is still cruelly out of reach for too many. As His Holiness Pope Francis reminds us, we are stronger when we value the least among these, and see them as equal in dignity to ourselves and our sons and our daughters. We can roll back preventable disease and end the scourge of HIV/AIDS. We can stamp out pandemics that recognize no borders. That work may not be on television right now, but as we demonstrated in reversing the spread of Ebola, it can save more lives than anything else we can do. Together, we can eradicate extreme poverty and erase barriers to opportunity. But this requires a sustained commitment to our people — so farmers can feed more people; so entrepreneurs can start a business without paying a bribe; so young people have the skills they need to succeed in this modern, knowledge-based economy. We can promote growth through trade that meets a higher standard. And that’s what we’re doing through the Trans-Pacific Partnership — a trade agreement that encompasses nearly 40 percent of the global economy; an agreement that will open markets, while protecting the rights of workers and protecting the environment that enables development to be sustained. We can roll back the pollution that we put in our skies, and help economies lift people out of poverty without condemning our children to the ravages of an ever-warming climate. The same ingenuity that produced the Industrial Age and the Computer Age allows us to harness the potential of clean energy. No country can escape the ravages of climate change. And there is no stronger sign of leadership than putting future generations first. The United States will work with every nation that is willing to do its part so that we can come together in Paris to decisively confront this challenge. And finally, our vision for the future of this Assembly, my belief in moving forward rather than backwards, requires us to defend the democratic principles that allow societies to succeed. Let me start from a simple premise: Catastrophes, like what we are seeing in Syria, do not take place in countries where there is genuine democracy and respect for the universal values this institution is supposed to defend. (Applause.) I recognize that democracy is going to take different forms in different parts of the world. The very idea of a people governing themselves depends upon government giving expression to their unique culture, their unique history, their unique experiences. But some universal truths are self-evident. No person wants to be imprisoned for peaceful worship. No woman should ever be abused with impunity, or a girl barred from going to school. The freedom to peacefully petition those in power without fear of arbitrary laws — these are not ideas of one country or one culture. They are fundamental to human progress. They are a cornerstone of this institution. I realize that in many parts of the world there is a different view — a belief that strong leadership must tolerate no dissent. I hear it not only from America’s adversaries, but privately at least I also hear it from some of our friends. I disagree. I believe a government that suppresses peaceful dissent is not showing strength; it is showing weakness and it is showing fear. (Applause.) History shows that regimes who fear their own people will eventually crumble, but strong institutions built on the consent of the governed endure long after any one individual is gone. That’s why our strongest leaders — from George Washington to Nelson Mandela — have elevated the importance of building strong, democratic institutions over a thirst for perpetual power. Leaders who amend constitutions to stay in office only acknowledge that they failed to build a successful country for their people — because none of us last forever. It tells us that power is something they cling to for its own sake, rather than for the betterment of those they purport to serve. I understand democracy is frustrating. Democracy in the United States is certainly imperfect. At times, it can even be dysfunctional. But democracy — the constant struggle to extend rights to more of our people, to give more people a voice — is what allowed us to become the most powerful nation in the world. (Applause.) It’s not simply a matter of principle; it’s not an abstraction. Democracy — inclusive democracy — makes countries stronger. When opposition parties can seek power peacefully through the ballot, a country draws upon new ideas. When a free media can inform the public, corruption and abuse are exposed and can be rooted out. When civil society thrives, communities can solve problems that governments cannot necessarily solve alone. When immigrants are welcomed, countries are more productive and more vibrant. When girls can go to school, and get a job, and pursue unlimited opportunity, that’s when a country realizes its full potential. (Applause.) That is what I believe is America’s greatest strength. Not everybody in America agrees with me. That’s part of democracy. I believe that the fact that you can walk the streets of this city right now and pass churches and synagogues and temples and mosques, where people worship freely; the fact that our nation of immigrants mirrors the diversity of the world — you can find everybody from everywhere here in New York City — (applause) — the fact that, in this country, everybody can contribute, everybody can participate no matter who they are, or what they look like, or who they love — that’s what makes us strong. And I believe that what is true for America is true for virtually all mature democracies. And that is no accident. We can be proud of our nations without defining ourselves in opposition to some other group. We can be patriotic without demonizing someone else. We can cherish our own identities — our religion, our ethnicity, our traditions — without putting others down. Our systems are premised on the notion that absolute power will corrupt, but that people — ordinary people — are fundamentally good; that they value family and friendship, faith and the dignity of hard work; and that with appropriate checks and balances, governments can reflect this goodness. I believe that’s the future we must seek together. To believe in the dignity of every individual, to believe we can bridge our differences, and choose cooperation over conflict — that is not weakness, that is strength. (Applause.) It is a practical necessity in this interconnected world. And our people understand this. Think of the Liberian doctor who went door-to-door to search for Ebola cases, and to tell families what to do if they show symptoms. Think of the Iranian shopkeeper who said, after the nuclear deal, “God willing, now we’ll be able to offer many more goods at better prices.” Think of the Americans who lowered the flag over our embassy in Havana in 1961 — the year I was born — and returned this summer to raise that flag back up. (Applause.) One of these men said of the Cuban people, “We could do things for them, and they could do things for us. We loved them.” For 50 years, we ignored that fact. Think of the families leaving everything they’ve known behind, risking barren deserts and stormy waters just to find shelter; just to save their children. One Syrian refugee who was greeted in Hamburg with warm greetings and shelter, said, “We feel there are still some people who love other people.” The people of our United Nations are not as different as they are told. They can be made to fear; they can be taught to hate — but they can also respond to hope. History is littered with the failure of false prophets and fallen empires who believed that might always makes right, and that will continue to be the case. You can count on that. But we are called upon to offer a different type of leadership — leadership strong enough to recognize that nations share common interests and people share a common humanity, and, yes, there are certain ideas and principles that are universal. That’s what those who shaped the United Nations 70 years ago understood. Let us carry forward that faith into the future — for it is the only way we can assure that future will be brighter for my children, and for yours. Thank you very much. (Applause.)",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Shalom, Mr. President: Obama Tries to Charm Israelis With Hebrew",
      "url": "https://www.nytimes.com/2013/03/23/world/middleeast/obama-tries-to-charm-israelis-with-hebrew.html?searchResultPosition=42",
      "subtitle": "null",
      "author": "Jodi Rudoren",
      "content": " JERUSALEM — As one Israeli columnist put it, he had them at “Shalom.” That was the first word President Obama uttered in public when he landed in Israel Wednesday afternoon, and again when he took the stage at a convention center here Thursday. But unlike other foreign leaders, Mr. Obama went far beyond the simple greeting — which translates as “peace” but also is used for “hello” and “goodbye” — to sprinkle Hebrew throughout his remarks, an effective if gimmicky element of his all-out effort to connect with the Israeli public. It worked on the headline writers. On Friday morning, three Israeli newspapers blared Mr. Obama’s declaration “Atem lo levad” — You are not alone — across their front pages. The simple phrase, which sparked one of the strongest of multiple ovations punctuating his 50-minute speech Thursday afternoon, may be one of the lasting memories of the three-day visit, seared in public consciousness like President Clinton’s poignant “Shalom, chaver” — Goodbye, friend — at the 1995 funeral of Yitzhak Rabin, the prime minister assassinated by a Jewish extremist. But that was not all. Mr. Obama also spoke Thursday about “tikkun olam,” repairing the world, and while viewing the Dead Sea Scrolls that morning, he asked whether Hebrew had evolved much over the centuries (no, he was told). At the Yad Vashem Holocaust memorial Friday, he used the Hebrew word for the horrific tragedy, “Shoah.” On Wednesday, he said, “Tov lehiot shuv ba’aretz” — it’s good to be back in the land. He also underlined his statement “Our alliance is eternal; it is forever,” with “lanetzach,” for eternity, particularly risky because its last letter, chet, is tough for English speakers to get right. If his accent was not perfect, it was perfectly acceptable. “He did his homework,” said Gabriel Weimann, a communications professor at the University of Haifa who specializes in politics. “I’m quite sure that he exercised well, and he exercised with someone who knows how to pronounce it, not with some Hebrew 101 teacher.” That someone was Daniel B. Shapiro, Mr. Obama’s ambassador to Israel, who often impresses audiences here by delivering full speeches in Hebrew. (At last year’s conference of the American Israel Public Affairs Committee, Prime Minister Benjamin Netanyahu lauded Mr. Shapiro’s fluency, saying, “Your Hebrew is improving, though it is not on par with Michael Oren’s,” a gentle jab at Israel’s New Jersey-born ambassador to Washington.) “Wherever he goes, he tries to find the opportunity to communicate with people in their native language because he really understands the power of language,” Mr. Shapiro said of the president. “It’s important to find the right words, the words that really convey a message, pack a certain kind of power, resonate and have certain associations with them.” It is also important to find words that are easy to pronounce. Some with too many syllables were rejected. One longer phrase with a word containing that tough “chet” in the middle was cut. When the president declared “Atem lo levad” during Thursday’s speech, Mr. Shapiro’s wife, Julie Fisher, whose Hebrew is not as solid, excitedly posted it to her Facebook page from the convention hall, only to be quickly called out for a misspelling. (She used two “vavs” instead of a “vet.”) Of course, leaders have long used foreign languages to make an impression. President John F. Kennedy’s “Ich bin ein Berliner” may be the most famous, but Tony Blair, the former prime minister of Britain, gave an entire speech in French to the National Assembly in Paris in 1998. Mr. Obama also started his news conference with President Mahmoud Abbas of the Palestinian Authority on Thursday with the Arabic greeting “marhaba.” And in his 2009 speech at Cairo University, he quieted the audience by saying, “Shukran, thank you very much.” Mr. Weimann said Israelis were moved not just by the use of Hebrew but by Mr. Obama’s extensive quoting of revered Israeli and Jewish sources: the Talmud; the Passover Haggadah; the founding prime minister, David Ben-Gurion; the novelist David Grossman; even the television satire “Eretz Nehederet” (Wonderful Country). “'I’m using your language’ means that I’m trying to get close to you,” Mr. Weimann said. “It’s not just the text and not just the pronunciation, it’s the variety of sources. Every public appearance there was at least one sentence.” As he snaked his way through a farewell gauntlet at the airport Friday afternoon, Mr. Obama offered a “todah” — thank you — to an Israeli official who helped plan the trip. To Mr. Shapiro’s oldest daughter, Liat, who recently celebrated her bat mitzvah, he said, “mazel tov.”",
      "date": "March 22, 2013",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Barack Obama's March 4 speech",
      "url": "https://www.nytimes.com/2008/03/05/world/americas/05iht-04textobama.10720835.html?searchResultPosition=32",
      "subtitle": "null",
      "author": "",
      "content": "The following is the text as prepared for delivery of Senator Barack Obama's speech to supporters after the March 4 nominating contests, as provided by his presidential campaign. BARACK OBAMA: Well, we are in the middle of a very close race right now in Texas, and we may not even know the final results until morning. We do know that Senator Clinton has won Rhode Island, and while there are a lot of votes to be counted in Ohio, it looks like she did well there too, and so we congratulate her on those states. We also know that we have won the state of Vermont. And we know this – no matter what happens tonight, we have nearly the same delegate lead as we did this morning, and we are on our way to winning this nomination. You know, decades ago, as a community organizer, I learned that the real work of democracy begins far from the closed doors and marbled halls of Washington. It begins on street corners and front porches; in living rooms and meeting halls with ordinary Americans who see the world as it is and realize that we have it within our power to remake the world as it should be. It is with that hope that we began this unlikely journey – the hope that if we could go block by block, city by city, state by state and build a movement that spanned race and region; party and gender; if we could give young people a reason to vote and the young at heart a reason to believe again; if we could inspire a nation to come together again, then we could turn the page on the politics that's shut us out, let us down, and told us to settle. We could write a new chapter in the American story. We were told this wasn't possible. We were told the climb was too steep. We were told our country was too cynical – that we were just being naïve; that we couldn't really change the world as it is. But then a few people in Iowa stood up to say, \"Yes we can.\" And then a few more of you stood up from the hills of New Hampshire to the coast of South Carolina. And then a few million of you stood up from Savannah to Seattle; from Boise to Baton Rouge. And tonight, because of you – because of a movement you built that stretches from Vermont's Green Mountains to the streets of San Antonio, we can stand up with confidence and clarity to say that we are turning the page, and we are ready to write the next great chapter in America's story. In the coming weeks, we will begin a great debate about the future of this country with a man who has served it bravely and loves it dearly. And tonight, I called John McCain and congratulated him on winning the Republican nomination. But in this election, we will offer two very different visions of the America we see in the twenty-first century. Because John McCain may claim long history of straight talk and independent-thinking, and I respect that. But in this campaign, he's fallen in line behind the very same policies that have ill-served America. He has seen where George Bush has taken our country, and he promises to keep us on the very same course. It's the same course that threatens a century of war in Iraq – a third and fourth and fifth tour of duty for brave troops who've done all we've asked them to, even while we ask little and expect nothing of the Iraqi government whose job it is to put their country back together. A course where we spend billions of dollars a week that could be used to rebuild our roads and our schools; to care for our veterans and send our children to college. It's the same course that continues to divide and isolate America from the world by substituting bluster and bullying for direct diplomacy – by ignoring our allies and refusing to talk to our enemies even though Presidents from Kennedy to Reagan have done just that; because strong countries and strong leaders aren't afraid to tell hard truths to petty dictators. And it's the same course that offers the same tired answer to workers without health care and families without homes; to students in debt and children who go to bed hungry in the richest nation on Earth – four more years of tax breaks for the biggest corporations and the wealthiest few who don't need them and aren't even asking for them. It's a course that further divides Wall Street from Main Street; where struggling families are told to pull themselves up by their bootstraps because there's nothing government can do or should do – and so we should give more to those with the most and let the chips fall where they may. Well we are here tonight to say that this is not the America we believe in and this is not the future we want. We want a new course for this country. We want new leadership in Washington. We want change in America. John McCain and Senator Clinton echo each other in dismissing this call for change. They say it is eloquent but empty; speeches and not solutions. And yet, they should know that it's a call that did not begin with my words. It began with words that were spoken on the floors of factories in Ohio and across the deep plains of Texas; words that came from classrooms in South Carolina and living rooms in the state of Iowa; from first-time voters and life-long cynics; from Democrats and Republicans alike. They should know that there's nothing empty about the call for affordable health care that came from the young student who told me she gets three hours of sleep because she works the night shift after a full day of college and still can't pay her sister's medical bills. There's nothing empty about the call for help that came from the mother in San Antonio who saw her mortgage double in two weeks and didn't know where her two-year olds would sleep at night when they were kicked out of their home. There's nothing empty about the call for change that came from the elderly woman who wants it so badly that she sent me an envelope with a money order for $3.01 and a simple verse of scripture tucked inside. These Americans know that government cannot solve all of our problems, and they don't expect it to. Americans know that we have to work harder and study more to compete in a global economy. We know that we need to take responsibility for ourselves and our children – that we need to spend more time with them, and teach them well, and put a book in their hands instead of a video game once in awhile. We know this. But we also believe that there is a larger responsibility we have to one another as Americans. We believe that we rise or fall as one nation – as one people. That we are our brother's keeper. That we are our sister's keeper. We believe that a child born tonight should have the same chances whether she arrives in the barrios of San Antonio or the suburbs of St. Louis; on the streets of Chicago or the hills of Appalachia. We believe that when she goes to school for the first time, it should be in a place where the rats don't outnumber the computers; that when she applies to college, cost is no barrier to a degree that will allow her to compete with children in China or India for the jobs of the twenty-first century. We believe that these jobs should provide wages that can raise her family, health care for when she gets sick and a pension for when she retires. We believe that when she tucks her own children into bed, she should feel safe knowing that they are protected from the threats we face by the bravest, best-equipped, military in the world, led by a Commander-in-Chief who has the judgment to know when to send them into battle and which battlefield to fight on. And if that child should ever get the chance to travel the world, and someone should ask her where she is from, we believe that she should always be able to hold her head high with pride in her voice when she answers \"I am an American.\" That is the course we seek. That is the change we are calling for. You can call it many things, but you cannot call it empty. If I am the nominee of this party, I will not allow us to be distracted by the same politics that seeks to divide us with false charges and meaningless labels. In this campaign, we will not stand for the politics that uses religion as a wedge, and patriotism as a bludgeon. I owe what I am to this country I love, and I will never forget it. Where else could a young man who grew up herding goats in Kenya get the chance to fulfill his dream of a college education? Where else could he marry a white girl from Kansas whose parents survived war and depression to find opportunity out west? Where else could they have a child who would one day have the chance to run for the highest office in the greatest nation the world has ever known? Where else, but in the United States of America? It is now my hope and our task to set this country on a course that will keep this promise alive in the twenty-first century. And the eyes of the world are watching to see if we can. There is a young man on my campaign whose grandfather lives in Uganda. He is 81 years old and has never experienced true democracy in his lifetime. During the reign of Idi Amin, he was literally hunted and the only reason he escaped was thanks to the kindness of others and a few good-sized trunks. And on the night of the Iowa caucuses, that 81-year-old man stayed up until five in the morning, huddled by his television, waiting for the results. The world is watching what we do here. The world is paying attention to how we conduct ourselves. What will we they see? What will we tell them? What will we show them? Can we come together across party and region; race and religion to restore prosperity and opportunity as the birthright of every American? Can we lead the community of nations in taking on the common threats of the 21st century – terrorism and climate change; genocide and disease? Can we send a message to all those weary travelers beyond our shores who long to be free from fear and want that the United States of America is, and always will be, 'the last best, hope of Earth?' We say; we hope; we believe – yes we can.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Text of President Obama’s Remarks on Syria",
      "url": "https://www.nytimes.com/2013/09/01/world/middleeast/text-of-president-obamas-remarks-on-syria.html?searchResultPosition=29",
      "subtitle": "null",
      "author": "",
      "content": "Following is the text of President Obama’s address on Saturday, as provided by the White House, saying he would seek Congressional authorization for a strike on Syria: Good afternoon, everybody. Ten days ago, the world watched in horror as men, women and children were massacred in Syria in the worst chemical weapons attack of the 21st century. Yesterday the United States presented a powerful case that the Syrian government was responsible for this attack on its own people. Our intelligence shows the Assad regime and its forces preparing to use chemical weapons, launching rockets in the highly populated suburbs of Damascus, and acknowledging that a chemical weapons attack took place. And all of this corroborates what the world can plainly see -- hospitals overflowing with victims; terrible images of the dead. All told, well over 1,000 people were murdered. Several hundred of them were children -- young girls and boys gassed to death by their own government. This attack is an assault on human dignity. It also presents a serious danger to our national security. It risks making a mockery of the global prohibition on the use of chemical weapons. It endangers our friends and our partners along Syria’s borders, including Israel, Jordan, Turkey, Lebanon and Iraq. It could lead to escalating use of chemical weapons, or their proliferation to terrorist groups who would do our people harm. In a world with many dangers, this menace must be confronted. Now, after careful deliberation, I have decided that the United States should take military action against Syrian regime targets. This would not be an open-ended intervention. We would not put boots on the ground. Instead, our action would be designed to be limited in duration and scope. But I’m confident we can hold the Assad regime accountable for their use of chemical weapons, deter this kind of behavior, and degrade their capacity to carry it out. Our military has positioned assets in the region. The Chairman of the Joint Chiefs has informed me that we are prepared to strike whenever we choose. Moreover, the Chairman has indicated to me that our capacity to execute this mission is not time-sensitive; it will be effective tomorrow, or next week, or one month from now. And I’m prepared to give that order. But having made my decision as Commander-in-Chief based on what I am convinced is our national security interests, I’m also mindful that I’m the President of the world’s oldest constitutional democracy. I’ve long believed that our power is rooted not just in our military might, but in our example as a government of the people, by the people, and for the people. And that’s why I’ve made a second decision: I will seek authorization for the use of force from the American people’s representatives in Congress. Over the last several days, we’ve heard from members of Congress who want their voices to be heard. I absolutely agree. So this morning, I spoke with all four congressional leaders, and they’ve agreed to schedule a debate and then a vote as soon as Congress comes back into session. In the coming days, my administration stands ready to provide every member with the information they need to understand what happened in Syria and why it has such profound implications for America’s national security. And all of us should be accountable as we move forward, and that can only be accomplished with a vote. I’m confident in the case our government has made without waiting for U.N. inspectors. I’m comfortable going forward without the approval of a United Nations Security Council that, so far, has been completely paralyzed and unwilling to hold Assad accountable. As a consequence, many people have advised against taking this decision to Congress, and undoubtedly, they were impacted by what we saw happen in the United Kingdom this week when the Parliament of our closest ally failed to pass a resolution with a similar goal, even as the Prime Minister supported taking action. Yet, while I believe I have the authority to carry out this military action without specific congressional authorization, I know that the country will be stronger if we take this course, and our actions will be even more effective. We should have this debate, because the issues are too big for business as usual. And this morning, John Boehner, Harry Reid, Nancy Pelosi and Mitch McConnell agreed that this is the right thing to do for our democracy. A country faces few decisions as grave as using military force, even when that force is limited. I respect the views of those who call for caution, particularly as our country emerges from a time of war that I was elected in part to end. But if we really do want to turn away from taking appropriate action in the face of such an unspeakable outrage, then we must acknowledge the costs of doing nothing. Here’s my question for every member of Congress and every member of the global community: What message will we send if a dictator can gas hundreds of children to death in plain sight and pay no price? What’s the purpose of the international system that we’ve built if a prohibition on the use of chemical weapons that has been agreed to by the governments of 98 percent of the world’s people and approved overwhelmingly by the Congress of the United States is not enforced? Make no mistake -- this has implications beyond chemical warfare. If we won’t enforce accountability in the face of this heinous act, what does it say about our resolve to stand up to others who flout fundamental international rules? To governments who would choose to build nuclear arms? To terrorist who would spread biological weapons? To armies who carry out genocide? We cannot raise our children in a world where we will not follow through on the things we say, the accords we sign, the values that define us. So just as I will take this case to Congress, I will also deliver this message to the world. While the U.N. investigation has some time to report on its findings, we will insist that an atrocity committed with chemical weapons is not simply investigated, it must be confronted. I don’t expect every nation to agree with the decision we have made. Privately we’ve heard many expressions of support from our friends. But I will ask those who care about the writ of the international community to stand publicly behind our action. And finally, let me say this to the American people: I know well that we are weary of war. We’ve ended one war in Iraq. We’re ending another in Afghanistan. And the American people have the good sense to know we cannot resolve the underlying conflict in Syria with our military. In that part of the world, there are ancient sectarian differences, and the hopes of the Arab Spring have unleashed forces of change that are going to take many years to resolve. And that’s why we’re not contemplating putting our troops in the middle of someone else’s war. Instead, we’ll continue to support the Syrian people through our pressure on the Assad regime, our commitment to the opposition, our care for the displaced, and our pursuit of a political resolution that achieves a government that respects the dignity of its people. But we are the United States of America, and we cannot and must not turn a blind eye to what happened in Damascus. Out of the ashes of world war, we built an international order and enforced the rules that gave it meaning. And we did so because we believe that the rights of individuals to live in peace and dignity depends on the responsibilities of nations. We aren’t perfect, but this nation more than any other has been willing to meet those responsibilities. So to all members of Congress of both parties, I ask you to take this vote for our national security. I am looking forward to the debate. And in doing so, I ask you, members of Congress, to consider that some things are more important than partisan differences or the politics of the moment. Ultimately, this is not about who occupies this office at any given time; it’s about who we are as a country. I believe that the people’s representatives must be invested in what America does abroad, and now is the time to show the world that America keeps our commitments. We do what we say. And we lead with the belief that right makes might -- not the other way around. We all know there are no easy options. But I wasn’t elected to avoid hard decisions. And neither were the members of the House and the Senate. I’ve told you what I believe, that our security and our values demand that we cannot turn away from the massacre of countless civilians with chemical weapons. And our democracy is stronger when the President and the people’s representatives stand together. I’m ready to act in the face of this outrage. Today I’m asking Congress to send a message to the world that we are ready to move forward together as one nation. Thanks very much.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Barack Obama's inaugural address",
      "url": "https://www.nytimes.com/2009/01/20/world/americas/20iht-20textobama.19532874.html?searchResultPosition=22",
      "subtitle": "null",
      "author": "",
      "content": "Following is the prepared text of President-elect Barack Obama's Inaugural Address, as provided by the Presidential Inaugural Committee: My fellow citizens: I stand here today humbled by the task before us, grateful for the trust you have bestowed, mindful of the sacrifices borne by our ancestors. I thank President Bush for his service to our nation, as well as the generosity and cooperation he has shown throughout this transition. Forty-four Americans have now taken the presidential oath. The words have been spoken during rising tides of prosperity and the still waters of peace. Yet, every so often the oath is taken amidst gathering clouds and raging storms. At these moments, America has carried on not simply because of the skill or vision of those in high office, but because We the People have remained faithful to the ideals of our forebearers, and true to our founding documents. So it has been. So it must be with this generation of Americans. That we are in the midst of crisis is now well understood. Our nation is at war, against a far-reaching network of violence and hatred. Our economy is badly weakened, a consequence of greed and irresponsibility on the part of some, but also our collective failure to make hard choices and prepare the nation for a new age. Homes have been lost; jobs shed; businesses shuttered. Our health care is too costly; our schools fail too many; and each day brings further evidence that the ways we use energy strengthen our adversaries and threaten our planet. These are the indicators of crisis, subject to data and statistics. Less measurable but no less profound is a sapping of confidence across our land - a nagging fear that America's decline is inevitable, and that the next generation must lower its sights. Today I say to you that the challenges we face are real. They are serious and they are many. They will not be met easily or in a short span of time. But know this, America - they will be met. On this day, we gather because we have chosen hope over fear, unity of purpose over conflict and discord. On this day, we come to proclaim an end to the petty grievances and false promises, the recriminations and worn out dogmas, that for far too long have strangled our politics. We remain a young nation, but in the words of Scripture, the time has come to set aside childish things. The time has come to reaffirm our enduring spirit; to choose our better history; to carry forward that precious gift, that noble idea, passed on from generation to generation: the God-given promise that all are equal, all are free, and all deserve a chance to pursue their full measure of happiness. In reaffirming the greatness of our nation, we understand that greatness is never a given. It must be earned. Our journey has never been one of short-cuts or settling for less. It has not been the path for the faint-hearted - for those who prefer leisure over work, or seek only the pleasures of riches and fame. Rather, it has been the risk-takers, the doers, the makers of things - some celebrated but more often men and women obscure in their labor, who have carried us up the long, rugged path towards prosperity and freedom. For us, they packed up their few worldly possessions and traveled across oceans in search of a new life. For us, they toiled in sweatshops and settled the West; endured the lash of the whip and plowed the hard earth. For us, they fought and died, in places like Concord and Gettysburg; Normandy and Khe Sanh. Time and again these men and women struggled and sacrificed and worked till their hands were raw so that we might live a better life. They saw America as bigger than the sum of our individual ambitions; greater than all the differences of birth or wealth or faction. This is the journey we continue today. We remain the most prosperous, powerful nation on Earth. Our workers are no less productive than when this crisis began. Our minds are no less inventive, our goods and services no less needed than they were last week or last month or last year. Our capacity remains undiminished. But our time of standing pat, of protecting narrow interests and putting off unpleasant decisions - that time has surely passed. Starting today, we must pick ourselves up, dust ourselves off, and begin again the work of remaking America. For everywhere we look, there is work to be done. The state of the economy calls for action, bold and swift, and we will act - not only to create new jobs, but to lay a new foundation for growth. We will build the roads and bridges, the electric grids and digital lines that feed our commerce and bind us together. We will restore science to its rightful place, and wield technology's wonders to raise health care's quality and lower its cost. We will harness the sun and the winds and the soil to fuel our cars and run our factories. And we will transform our schools and colleges and universities to meet the demands of a new age. All this we can do. And all this we will do. Now, there are some who question the scale of our ambitions - who suggest that our system cannot tolerate too many big plans. Their memories are short. For they have forgotten what this country has already done; what free men and women can achieve when imagination is joined to common purpose, and necessity to courage. What the cynics fail to understand is that the ground has shifted beneath them - that the stale political arguments that have consumed us for so long no longer apply. The question we ask today is not whether our government is too big or too small, but whether it works - whether it helps families find jobs at a decent wage, care they can afford, a retirement that is dignified. Where the answer is yes, we intend to move forward. Where the answer is no, programs will end. And those of us who manage the public's dollars will be held to account - to spend wisely, reform bad habits, and do our business in the light of day - because only then can we restore the vital trust between a people and their government. Nor is the question before us whether the market is a force for good or ill. Its power to generate wealth and expand freedom is unmatched, but this crisis has reminded us that without a watchful eye, the market can spin out of control - and that a nation cannot prosper long when it favors only the prosperous. The success of our economy has always depended not just on the size of our Gross Domestic Product, but on the reach of our prosperity; on our ability to extend opportunity to every willing heart - not out of charity, but because it is the surest route to our common good. As for our common defense, we reject as false the choice between our safety and our ideals. Our Founding Fathers, faced with perils we can scarcely imagine, drafted a charter to assure the rule of law and the rights of man, a charter expanded by the blood of generations. Those ideals still light the world, and we will not give them up for expedience's sake. And so to all other peoples and governments who are watching today, from the grandest capitals to the small village where my father was born: know that America is a friend of each nation and every man, woman, and child who seeks a future of peace and dignity, and that we are ready to lead once more. Recall that earlier generations faced down fascism and communism not just with missiles and tanks, but with sturdy alliances and enduring convictions. They understood that our power alone cannot protect us, nor does it entitle us to do as we please. Instead, they knew that our power grows through its prudent use; our security emanates from the justness of our cause, the force of our example, the tempering qualities of humility and restraint. We are the keepers of this legacy. Guided by these principles once more, we can meet those new threats that demand even greater effort - even greater cooperation and understanding between nations. We will begin to responsibly leave Iraq to its people, and forge a hard-earned peace in Afghanistan. With old friends and former foes, we will work tirelessly to lessen the nuclear threat, and roll back the specter of a warming planet. We will not apologize for our way of life, nor will we waver in its defense, and for those who seek to advance their aims by inducing terror and slaughtering innocents, we say to you now that our spirit is stronger and cannot be broken; you cannot outlast us, and we will defeat you. For we know that our patchwork heritage is a strength, not a weakness. We are a nation of Christians and Muslims, Jews and Hindus - and non-believers. We are shaped by every language and culture, drawn from every end of this Earth; and because we have tasted the bitter swill of civil war and segregation, and emerged from that dark chapter stronger and more united, we cannot help but believe that the old hatreds shall someday pass; that the lines of tribe shall soon dissolve; that as the world grows smaller, our common humanity shall reveal itself; and that America must play its role in ushering in a new era of peace. To the Muslim world, we seek a new way forward, based on mutual interest and mutual respect. To those leaders around the globe who seek to sow conflict, or blame their society's ills on the West - know that your people will judge you on what you can build, not what you destroy. To those who cling to power through corruption and deceit and the silencing of dissent, know that you are on the wrong side of history; but that we will extend a hand if you are willing to unclench your fist. To the people of poor nations, we pledge to work alongside you to make your farms flourish and let clean waters flow; to nourish starved bodies and feed hungry minds. And to those nations like ours that enjoy relative plenty, we say we can no longer afford indifference to suffering outside our borders; nor can we consume the world's resources without regard to effect. For the world has changed, and we must change with it. As we consider the road that unfolds before us, we remember with humble gratitude those brave Americans who, at this very hour, patrol far-off deserts and distant mountains. They have something to tell us today, just as the fallen heroes who lie in Arlington whisper through the ages. We honor them not only because they are guardians of our liberty, but because they embody the spirit of service; a willingness to find meaning in something greater than themselves. And yet, at this moment - a moment that will define a generation - it is precisely this spirit that must inhabit us all. For as much as government can do and must do, it is ultimately the faith and determination of the American people upon which this nation relies. It is the kindness to take in a stranger when the levees break, the selflessness of workers who would rather cut their hours than see a friend lose their job which sees us through our darkest hours. It is the firefighter's courage to storm a stairway filled with smoke, but also a parent's willingness to nurture a child, that finally decides our fate. Our challenges may be new. The instruments with which we meet them may be new. But those values upon which our success depends - hard work and honesty, courage and fair play, tolerance and curiosity, loyalty and patriotism - these things are old. These things are true. They have been the quiet force of progress throughout our history. What is demanded then is a return to these truths. What is required of us now is a new era of responsibility - a recognition, on the part of every American, that we have duties to ourselves, our nation, and the world, duties that we do not grudgingly accept but rather seize gladly, firm in the knowledge that there is nothing so satisfying to the spirit, so defining of our character, than giving our all to a difficult task. This is the price and the promise of citizenship. This is the source of our confidence - the knowledge that God calls on us to shape an uncertain destiny. This is the meaning of our liberty and our creed - why men and women and children of every race and every faith can join in celebration across this magnificent mall, and why a man whose father less than sixty years ago might not have been served at a local restaurant can now stand before you to take a most sacred oath. So let us mark this day with remembrance, of who we are and how far we have traveled. In the year of America's birth, in the coldest of months, a small band of patriots huddled by dying campfires on the shores of an icy river. The capital was abandoned. The enemy was advancing. The snow was stained with blood. At a moment when the outcome of our revolution was most in doubt, the father of our nation ordered these words be read to the people: \"Let it be told to the future world...that in the depth of winter, when nothing but hope and virtue could survive...that the city and the country, alarmed at one common danger, came forth to meet [it].\" America. In the face of our common dangers, in this winter of our hardship, let us remember these timeless words. With hope and virtue, let us brave once more the icy currents, and endure what storms may come. Let it be said by our children's children that when we were tested we refused to let this journey end, that we did not turn back nor did we falter; and with eyes fixed on the horizon and God's grace upon us, we carried forth that great gift of freedom and delivered it safely to future generations.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Barack Obama's inauguration a global event",
      "url": "https://www.nytimes.com/2009/01/20/world/americas/20iht-21reax.19522639.html?searchResultPosition=16",
      "subtitle": "null",
      "author": "Alan Cowell",
      "content": " PARIS — Around the globe, from Hong Kong to London, Barack Obama's inauguration became a day for millions to fete an event they insisted was one that touched lives far beyond the United States. As the ceremonies began, people around the world clustered around television screens in public squares, cafes, and living rooms to watch Obama accept the mantle of American leadership, and with it, the assembled hopes of a world battered by war and recession. The focus for Americans may well have been defined by the election of the first black president, the end of the Bush administration, the promise of renewal or the hope for change. But, in specific terms, many outsiders saw the transition as a signal for their own new era, a starting gun for a new manner of international behavior. In Britain, Prime Minister Gordon Brown hailed Obama's ascendance as a \"new chapter in both American history and the world's history.\" President Nicolas Sarkozy of France said he had sent a message to President Obama saying: \"We are eager for him to get to work so that with him we can change the world.\" Celebrations began hours before the inauguration. In Paris, a party at the ornate Hôtel de Ville on the banks of the River Seine was set to be followed by less formal merriment around the city. The American Library in Paris offered a screen and a debate. British cities including Belfast, Liverpool, Leeds and London, scheduled big-screen viewings of the inauguration. Equally, some of the British comedians who have turned the mannerisms of President George W. Bush into the stuff of parody and steady income staged \"Bye, George\" events to mark the transition and bid farewell to the butt of their satire. To welcome the new American leader, Madame Tussauds in London said it would unveil a new wax-work of Obama. In Tottenham, a multiethnic neighborhood of north London, Juliet Alexander, the organizer of an inauguration celebration in an arts center, said the significance of the American election lay in the belief that \"he is not just a black president, he is a politically educated man who has touched the imaginations of people all around the world.\" \"He represents a movement to people — and we are happy to celebrate that,\" she said. Many of the events in Paris and London were organized by groups representing American Democrats living abroad, but, like Obama's election campaign, they drew in many others who saw the change of leadership in Washington as bearing directly on their own lives and hopes. As President Shimon Peres of Israel put it, \"Today is a great day not only for the United States of America, but for the entire world.\" \"I pray here in Jerusalem that Barack Obama will be a great president of the United States. If he will be a great president of the United States, he will serve all humankind, all nations and all persons,\" he said. Indeed, Israeli forces were pulling out of Gaza on Tuesday, anxious to be out after their war on Hamas by the time the inauguration ceremonies began in Washington. The political significance was not lost on German Chancellor Angela Merkel, who said she hoped the Obama era would be built on a broad international agreement that \"no single country can solve the problems of the world,\" a hope built in part on the perceived unilateralism and bellicosity of the Bush years. But there was a sense, too, that Obama would seek changes from America's allies in handling international problems, like the war in Afghanistan, where European countries are under American pressure to increase their troop levels in the American-led coalition fighting the resurgent Taliban. \"I think there will be big change, but there will also be demands, and Europeans are going to have to say: 'Yes, we can',\" David Miliband, the British foreign secretary, told BBC television. That sentiment was echoed by Pope Benedict XVI, who sent a telegram to Obama saying: \"At a time when so many of our brothers and sisters throughout the world yearn for liberation from the scourge of poverty, hunger and violence, I pray that you will be confirmed in your resolve to promote understanding, cooperation and peace among the nations, so that all may share in the banquet of life, which God wills to set for the whole human family.\" In Hong Kong, the inauguration took place at midnight and, amid the economic gloom, some expressed skepticism about the likely impact of a new American president. \"I am less than convinced the Obama effect will be so quick or so significant,\" said David Eldon, the former chairman of Asia and Pacific operations at the bank HSBC. But in Indonesia, Obama's boyhood home, the interest was keener, Reuters reported. \"We feel that he is an inspiring figure,\" said Enda Nasution, a prominent pro-Obama blogger, \"so we hope, without being naïve, that the world will change. In Kogelo, the Kenyan village where Obama's father was born, a crowd of more than 3,000 — three times the normal population — gathered on the grounds of a local school to listen to Obama's speech. Banners read, \"Congratulations, our son, our hope,\" Agence France-Presse reported. And in the tiny village of Zubar, 12 miles south of Basra in southern Iraq, a group of some 5,000 people — some of them migrant workers with African roots — held a celebration. They had followed Obama's campaign closely, in part identifying with him as someone who came from a disadvantaged position but rose to prominence. \"After today, the slaves are free,\" said one of them, Jalal Thugeel.",
      "date": "Jan. 20, 2009",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Analysis of President Obama’s Speech",
      "url": "https://www.nytimes.com/2014/06/05/world/europe/the-timess-peter-baker-in-warsaw.html?searchResultPosition=6",
      "subtitle": "null",
      "author": "The New York Times",
      "content": " Peter Baker, the chief White House correspondent for The New York Times, was in Warsaw with President Obama reporting on the president’s speech commemorating the 25th anniversary of elections in Poland that led to the end of Communist rule. You can read Mr. Baker’s article on nytimes.com and follow him on Twitter - @peterbakernyt.",
      "date": "June 4, 2014",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Barack Obama's search for faith",
      "url": "https://www.nytimes.com/2007/04/30/world/americas/30iht-30obama.5501905.html?searchResultPosition=5",
      "subtitle": "null",
      "author": "Jodi Kantor",
      "content": " CHICAGO — Members of Trinity United Church of Christ squeezed into a downtown hotel ballroom in early March to celebrate the long service of their pastor, the Rev. Jeremiah A. Wright Jr. One congregant stood out amid the flowers and finery: Senator Barack Obama, there to honor the man who led him from skeptic to self-described Christian. Twenty years ago at Trinity, Mr. Obama, then a community organizer in poor Chicago neighborhoods, found the African-American community he had sought all his life, along with professional credibility as a community organizer and an education in how to inspire followers. He had sampled various faiths but adopted none until he met Mr. Wright, a dynamic pastor who preached Afrocentric theology, dabbled in radical politics and delivered music-and-profanity-spiked sermons. Few of those at Mr. Wright's tribute in March knew of the pressures that Mr. Obama's presidential run was placing on the relationship between the pastor and his star congregant. Mr. Wright's assertions of widespread white racism and his scorching remarks about American government have drawn criticism, and prompted the senator to cancel his delivery of the invocation when he formally announced his candidacy in February. Mr. Obama, a Democratic presidential candidate who says he was only shielding his pastor from the spotlight, said he respected Mr. Wright's work for the poor and his fight against injustice. But \"we don't agree on everything,\" Mr. Obama said. \"I've never had a thorough conversation with him about all aspects of politics.\" It is hard to imagine, though, how Mr. Obama can truly distance himself from Mr. Wright. The Christianity that Mr. Obama adopted at Trinity has infused not only his life, but also his campaign. He began his presidential announcement with the phrase \"Giving all praise and honor to God,\" a salutation common in the black church. He titled his second book, \"The Audacity of Hope,\" after one of Mr. Wright's sermons, and often talks about biblical underdogs, the mutual interests of religious and secular America, and the centrality of faith in public life. The day after the party for Mr. Wright, Mr. Obama stood in an A.M.E. church pulpit in Selma, Ala., and cast his candidacy in nothing short of biblical terms, implicitly comparing himself to Joshua, known for his relative inexperience, steadfast faith and completion of Moses' mission of delivering his people to the Promised Land. \"Be strong and have courage, for I am with you wherever you go,\" Mr. Obama said in paraphrasing God's message to Joshua. It is difficult to tell whether Mr. Obama's religious and political beliefs are fused or simply run parallel. The junior senator from Illinois often talks of faith as a moral force essential for solving America's vexing problems. Like Senator Hillary Rodham Clinton of New York and John Edwards, his fellow Democratic candidates, he expresses both a political and a religious obligation to help the downtrodden. Like conservative Christians, he speaks of AIDS as a moral crisis. And like his pastor, Mr. Obama opposes the Iraq war. His embrace of faith was a sharp change for a man whose family offered him something of a crash course in comparative religion but no belief to call his own. \"He comes from a very secular, skeptical family,\" said Jim Wallis, a Christian antipoverty activist and longtime friend of Mr. Obama. \"His faith is really a personal and an adult choice. His is a conversion story.\" The grandparents who helped raise Mr. Obama were nonpracticing Baptists and Methodists. His mother was an anthropologist who collected religious texts the way others picked up tribal masks, teaching her children the inspirational power of the common narratives and heroes. His mother's tutelage took place mostly in Indonesia, in the household of Mr. Obama's stepfather, Lolo Soetoro, a nominal Muslim who hung prayer beads over his bed but enjoyed bacon, which Islam forbids. \"My whole family was Muslim, and most of the people I knew were Muslim,\" said Maya Soetoro-Ng, Mr. Obama's younger half sister. But Mr. Obama attended a Catholic school and then a Muslim public school where the religious education was cursory. When he was 10, he returned to his birthplace of Hawaii to live with his grandparents and attended a preparatory school with a Christian affiliation but little religious instruction. Years later, Mr. Obama met his father's family, a mix of Muslim and Christian Kenyans. Sarah Hussein Obama, who is his stepgrandmother but whom Mr. Obama calls his grandmother, still rises at 5 a.m. to pray before tending to her crops and the three orphans she has taken in. \"I am a strong believer of the Islamic faith,\" Ms. Obama, 85, said in a recent interview in Kenya. From Skepticism to Belief This polyglot background made Mr. Obama tolerant of others' faiths yet reluctant to join one, said Mr. Wright, the pastor. In an interview in March in his office, filled with mementos from his 35 years at Trinity, Mr. Wright recalled his first encounters with Mr. Obama in the late 1980s, when the future senator was organizing Chicago neighborhoods. Though minister after minister told Mr. Obama he would be more credible if he joined a church, he was not a believer. \"I remained a reluctant skeptic, doubtful of my own motives, wary of expedient conversion, having too many quarrels with God to accept a salvation too easily won,\" he wrote in his first book, \"Dreams From My Father.\" Still, Mr. Obama was entranced by Mr. Wright, whose sermons fused analysis of the Bible with outrage at what he saw as the racism of everything from daily life in Chicago to American foreign policy. Mr. Obama had never met a minister who made pilgrimages to Africa, welcomed women leaders and gay members and crooned Teddy Pendergrass rhythm and blues from the pulpit. Mr. Wright was making Trinity a social force, initiating day care, drug counseling, legal aid and tutoring. He was also interested in the world beyond his own; in 1984, he traveled to Cuba to teach Christians about the value of nonviolent protest and to Libya to visit Col. Muammar el-Qaddafi, along with the Nation of Islam leader Louis Farrakhan. Mr. Wright said his visits implied no endorsement of their views. Followers were also drawn simply by Mr. Wright's appeal. Trinity has 8,500 members today, making it the largest American congregation in the United Church of Christ, a mostly white denomination known for the independence of its congregations and its willingness to experiment with traditional Protestant theology. Mr. Wright preached black liberation theology, which interprets the Bible as the story of the struggles of black people, whom by virtue of their oppression are better able to understand Scripture than those who have suffered less. That message can sound different to white audiences, said Dwight Hopkins, a professor at University of Chicago Divinity School and a Trinity member. \"Some white people hear it as racism in reverse,\" Dr. Hopkins said, while blacks hear, \"Yes, we are somebody, we're also made in God's image.\" Audacity and Hope It was a 1988 sermon called \"The Audacity to Hope\" that turned Mr. Obama, in his late 20s, from spiritual outsider to enthusiastic churchgoer. Mr. Wright in the sermon jumped from 19th-century art to his own youthful brushes with crime and Islam to illustrate faith's power to inspire underdogs. Mr. Obama was seeing the same thing in public housing projects where poor residents sustained themselves through sheer belief. In \"Dreams From My Father,\" Mr. Obama described his teary-eyed reaction to the minister's words. \"Inside the thousands of churches across the city, I imagined the stories of ordinary black people merging with the stories of David and Goliath, Moses and Pharaoh, the Christians in the lion's den, Ezekiel's field of dry bones,\" Mr. Obama wrote. \"Those stories — of survival, and freedom, and hope — became our story, my story.\" Mr. Obama was baptized that year, and joining Trinity helped him \"embrace the African-American community in a way that was whole and profound,\" said Ms. Soetoro, his half sister. It also helped give him spiritual bona fides and a new assurance. Services at Trinity were a weekly master class in how to move an audience. When Mr. Obama arrived at Harvard Law School later that year, where he fortified himself with recordings of Mr. Wright's sermons, he was delivering stirring speeches as a student leader in the classic oratorical style of the black church. But he developed a tone very different from his pastor's. In contrast with Mr. Wright — the kind of speaker who could make a grocery list sound like a jeremiad — Mr. Obama speaks with cool intellect and on-the-one-hand reasoning. He tends to emphasize the reasonableness of all people; Mr. Wright rallies his parishioners against oppressors. While Mr. Obama stated his opposition to the Iraq war in conventional terms, Mr. Wright issued a \"War on Iraq I.Q. Test,\" with questions like, \"Which country do you think poses the greatest threat to global peace: Iraq or the U.S.?\" In the 16 years since Mr. Obama returned to Chicago from Harvard, Mr. Wright has presided over his wedding ceremony, baptized his two daughters and dedicated his house, while Mr. Obama has often spoken at Trinity's panels and debates. Though the Obamas drop in on other congregations, they treat Trinity as their spiritual home, attending services frequently. The church's Afrocentric focus makes Mr. Obama a figure of particular authenticity there, because he has the African connections so many members have searched for. To the many members who, like the Obamas, are the first generation in their families to achieve financial success, the church warns against \"middleclassness,\" its term for selfish individualism, and urges them to channel their gains back into the community. Mr. Obama has written that when he became a Christian, he \"felt God's spirit beckoning\" and \"submitted myself to His will and dedicated myself to discovering His truth.\" While he has said he shares core Christian beliefs in God and in Jesus as his resurrected son, he sometimes mentions doubts. In his second book, he admitted uncertainty about the afterlife, and \"what existed before the Big Bang.\" Generally, Mr. Obama emphasizes the communal aspects of religion over the supernatural ones. Bridging Religious Divides He has said that he relies on Mr. Wright to ensure \"that I am speaking as truthfully about what I believe as possible.\" He tends to turn to his minister at moments of frustration, Mr. Wright said, such as when Mr. Obama felt a Congressional Black Caucus meeting was heavier on entertainment than substance. As a presidential candidate, Mr. Obama is reaching out to both liberal skeptics and committed Christians. In many speeches or discussions, he never mentions religion. When Mr. Obama, a former constitutional law professor, does speak of faith, he tends to add a footnote about keeping church and state separate. But he also talks of building a consensus among secular liberal and conservative Christian voters. Mr. Wallis, the antipoverty advocate who calls himself a \"progressive evangelical,\" first met Mr. Obama 10 years ago when both participated in traveling seminars on American civic life. On bus rides, Mr. Wallis and Mr. Obama would huddle, away from company like George Stephanopoulos and Ralph Reed, to plot building a coalition of progressive and religious voters. \"The problems of poverty and racism, the uninsured and the unemployed, are not simply technical problems in search of the perfect 10 point plan,\" Mr. Obama says in one of his standard campaign lines. \"They are rooted in both societal indifference and individual callousness — in the imperfections of man.\" He often makes reference to the civil rights movement, when liberals used Christian rhetoric to win change. Mr. Obama reassures liberal audiences about the role of religion in public life, and he tells conservative Christians that he understands why abortion horrifies them and why they may prefer to curb H.I.V. through abstinence instead of condoms. AIDS has spread in part because \"the relationship between men and women, between sexuality and spirituality, has broken down, and needs to be repaired,\" he said to thunderous applause in December at the megachurch in California led by the Rev. Rick Warren, a best-selling author. At the same time, Mr. Obama's ties to Trinity have become more complicated than those simply of proud congregation and favorite son. Since Mr. Obama announced his candidacy, the church has received threatening phone calls. On blogs and cable news shows, conservative critics have called it separatist and antiwhite. Congregants respond by saying critics are misreading the church's tenets, that it is a warm and accepting community and is not hostile to whites. But Mr. Wright's political statements may be more controversial than his theological ones. He has said that Zionism has an element of \"white racism.\" (For its part, the Anti-Defamation League says it has no evidence of any anti-Semitism by Mr. Wright.) On the Sunday after the terrorist attacks of 9/11, Mr. Wright said the attacks were a consequence of violent American policies. Four years later he wrote that the attacks had proved that \"people of color had not gone away, faded into the woodwork or just 'disappeared' as the Great White West went on its merry way of ignoring Black concerns.\" Provocative Assertions Such statements involve \"a certain deeply embedded anti-Americanism,\" said Michael Cromartie, vice president of the Ethics and Public Policy Center, a conservative group that studies religious issues and public policy. \"A lot of people are going to say to Mr. Obama, are these your views?\" Mr. Obama says they are not. \"The violence of 9/11 was inexcusable and without justification,\" he said in a recent interview. He was not at Trinity the day Mr. Wright delivered his remarks shortly after the attacks, Mr. Obama said, but \"it sounds like he was trying to be provocative.\" \"Reverend Wright is a child of the 60s, and he often expresses himself in that language of concern with institutional racism and the struggles the African-American community has gone through,\" Mr. Obama said. \"He analyzes public events in the context of race. I tend to look at them through the context of social justice and inequality.\" Despite the canceled invocation, Mr. Wright prayed with the Obama family just before his presidential announcement. Asked later about the incident, the Obama campaign said in a statement, \"Senator Obama is proud of his pastor and his church.\" In March, Mr. Wright said in an interview that his family and some close associates were angry about the canceled address, for which they blamed Obama campaign advisers but that the situation was \"not irreparable.\" adding, \"Several things need to happen to fix it.\" Asked if he and Mr. Wright had patched up their differences, he said: \"Those are conversations between me and my pastor.\" Mr. Wright, who has long prided himself on criticizing the establishment, said he knew that he may not play well in Mr. Obama's audition for the ultimate establishment job. \"If Barack gets past the primary, he might have to publicly distance himself from me,\" Mr. Wright said with a shrug. \"I said it to Barack personally, and he said yeah, that might have to happen.\" Reuben Kyama contributed reporting from Nyangoma-Kogelo, Kenya.",
      "date": "April 30, 2007",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Obama Endorses Trudeau for Re-election Ahead of Canada Vote",
      "url": "https://www.nytimes.com/2019/10/16/world/canada/obama-trudeau-election.html?searchResultPosition=1",
      "subtitle": "Former President Barack Obama said “the world needs his progressive leadership now” of Prime Minister Justin Trudeau of Canada, who faces a federal election this month.",
      "author": "Dan Bilefsky",
      "content": " MONTREAL — Former President Barack Obama endorsed Justin Trudeau’s re-election as prime minister on Wednesday, potentially giving him a lift just days before Canadians go to the polls in closely fought elections. “I was proud to work with Justin Trudeau as President,” Mr. Obama wrote on Twitter. “He’s a hard-working, effective leader who takes on big issues like climate change. The world needs his progressive leadership now, and I hope our neighbors to the north support him for another term.” [Oct. 21 is Election Day in Canada. Here’s what you need to know.] The approbation of Mr. Obama, who was very popular in Canada during his presidency, could buttress Mr. Trudeau at home, where his image as a liberal world leader — welcoming immigrants, defending the rights of women and Indigenous people, and fighting climate change and racism — has suffered repeated blows over the last year. In September, he faced revelations that he dressed in brownface and blackface two decades ago. In August, Mr. Trudeau was also found to have violated an ethics law in his handling of a corporate criminal case, by improperly pressuring his attorney general to seek a civil penalty against a company accused of corruption, rather than a criminal conviction. Mr. Trudeau apologized for wearing blackface and brownface, and said he took responsibility for mistakes made in the ethics case. Gérard Bouchard, an eminent historian and sociologist with the University of Quebec in Chicoutimi, said Mr. Obama’s backing would reinforce Mr. Trudeau’s stature on the global stage. “President Obama is hugely respected on the international stage and in Canada and this endorsement could help elevate Mr. Trudeau,” Professor Bouchard said. “It gives him authority and credibility at a time when he has lost that.” Whatever his challenges domestically, Mr. Trudeau has won points both at home and abroad for standing up to an often-adversarial President Trump, including by hammering out a sweeping trade deal among Canada, Mexico and the United States. During Mr. Obama’s presidency, the Canadian and American leaders formed a close bromance, united by progressive policies on issues such as climate change and women’s rights. Both also had telegenic families. Like Mr. Obama, Mr. Trudeau swept to power by fashioning himself as a transformational leader, who would bring change to Canada. And both men were first elected after nearly a decade of conservative rule. In 2016, President Obama served smoked duck poutine canapés to Mr. Trudeau at the White House, underlining the kinship between the two world leaders by serving him a dish inspired by his native province, Quebec. In that same year, Mr. Obama addressed the Canadian Parliament, praising Mr. Trudeau for “the new energy and hope” his “leadership” had brought to Canada and to the alliance between Canada and the United States. In 2017, the two men enjoyed a candlelit dinner at a hip restaurant in Montreal, where Mr. Trudeau grew up, ending the meal with a warm embrace. Mr. Obama has rarely spoken out explicitly about political leaders, in the United States or abroad, since he left office in 2017. He has so far declined to make an endorsement in the Democratic primary campaign, in which his vice president, Joseph R. Biden Jr., is a candidate. However, he did endorse Emmanuel Macron of France for president in 2017, praising him for standing up for liberal values. At a time when there have been concerns about foreign interference in the election, some critics lashed out at Mr. Obama for what they said amounted to interfering in Canada’s domestic affairs. “Canadians would appreciate if you did not interfere in our democratic process,” a self-described Conservative man from Toronto wrote on Twitter.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    }
  ]
}