{
  "articles": [
    {
      "title": "Live Updates: Remembering Senator John McCain, With Eulogies by Obama and Bush",
      "url": "https://www.nytimes.com/2018/09/01/us/politics/john-mccain-funeral-updates-coverage.html?searchResultPosition=30",
      "subtitle": "null",
      "author": "Peter Baker",
      "content": "     • Senator John McCain received a full-fledged Washington send-off on Saturday as former Presidents George W. Bush and Barack Obama led an invitation-only service at Washington National Cathedral. • A motorcade carrying Mr. McCain’s coffin left Capitol Hill around 8:40 a.m. and stopped along the way at the Vietnam Veterans Memorial, where Cindy McCain laid a wreath in honor of her husband, a naval aviator who was held for five and a half years as a prisoner of war. • The memorial service at the Cathedral began shortly after 10 a.m. Meghan McCain, one of his daughters, delivered an emotional tribute to her father that included a steely rebuke to President Trump. Former Senator Joseph Lieberman, independent of Connecticut, and former Secretary of State Henry A. Kissinger also made remarks. After the formal remarks by the former presidents and the other speakers, the service wrapped up with readings by Sidney McCain, another daughter of the senator, former Senator Kelly Ayotte of New Hampshire and Senator Lindsey Graham of South Carolina, and a homily by the Rev. Edward A. Reese. Renée Fleming, the famed opera singer, then performed “Danny Boy,” and the audience joined in the Lord’s Prayer and “America the Beautiful.” Mr. McCain’s flag-draped coffin was escorted out of the cathedral by 15 honorary pallbearers representing a who’s who of the senator’s friends and colleagues from both sides of the aisle, including former Vice President Joseph R. Biden Jr., former Mayor Michael R. Bloomberg of New York, the actor Warren Beatty and a plethora of current and former senators and cabinet secretaries from both parties. Also among the pallbearers was Vladimir Kara-Murza, a prominent Russian dissident, a choice meant to symbolize Mr. McCain’s unflinching opposition to the authoritarian government of President Vladimir V. Putin. Among the invited guests elsewhere in the cathedral was Bill Browder, the investor who championed legislation that Mr. McCain helped sponsor to punish Russia for human rights abuses. Echoing the words of his predecessor, former President Barack Obama recalled Mr. McCain’s mischievous streak, his passion and his frequent sparring with people he disagreed with. “What better way to get a last laugh than make George and I say nice things about him to a national audience?” Mr. Obama said as Mr. Bush laughed along with the rest of the audience. Mr. McCain’s critiques, he said, made both men better presidents. And like Mr. Bush, Mr. Obama did not mention the absent president by name, but delivered an implicit censure of Mr. Trump’s immigration policies and attacks on the press. “He understood that if we get in the habit of bending the truth to suit political expediency or party orthodoxy, our democracy will not work,” Mr. Obama said. “So much of our politics, our public life, our public discourse, can seem small and mean and petty, trafficking in bombast and insult, in phony controversies and manufactured outrage,” Mr. Obama said. “It’s a politics that pretends to be brave, but in fact is born of fear. John called us to be bigger than that. He called us to be better than that.” [Read Barack Obama’s eulogy for John McCain.] Former President George W. Bush reflected on a political rivalry with Mr. McCain during the campaign for the 2000 Republican presidential nomination, a rivalry that later became camaraderie. “In the end, I got to enjoy one of life’s great gifts, the friendship of John McCain,” Mr. Bush said. “And I’ll miss it.” Mr. Bush did not mention the current president, but his tribute carried an undeniable contrast with the current administration’s policies. “He respected the dignity inherent in every life, a dignity that does not stop at borders and cannot be erased by dictators,” he said. “He was honorable, always recognizing that his opponents were still patriots and human beings.” [Read George W. Bush’s eulogy for John McCain.] The service began with Meghan McCain delivering an emotional tribute to her father through tears, one that included a steely rebuke to her father’s most prominent critic — President Trump, who had spent the morning talking about himself and his administration on Twitter. “We gather to mourn the passing of American greatness, the real thing, not cheap rhetoric from men who will never come near the sacrifice he gave so willingly,” she said. “He was a great fire who burned bright,” she added. “A few have resented that fire for that light it cast upon them, for the truth it revealed about their character, but my father never cared what they thought. And even that small number still have the opportunity, as long as they draw breath, to live up to the example of John McCain.” Her voice strengthened as she described her father’s America, explicitly contradicting the president. “America does not boast, because she has no need to,” she said to applause. “The America of John McCain has no need to be made great again because America was always great.” As Henry A. Kissinger, the former secretary of state and national security adviser, began recalling Mr. McCain’s years as a prisoner of war in Vietnam, Mr. Trump continued to post on Twitter, switching his focus to Canada and the North American Free Trade Agreement. He said there was “no political necessity” to keep Canada in a newly negotiated deal with Mexico. He warned that Congress should not interfere with the negotiations, or he would “simply terminate NAFTA entirely & we will be far better off.” “Remember,” he added, “NAFTA was one of the WORST Trade Deals ever made.” Mr. Trump was en route to his golf course in Virginia. Ivanka Trump, his eldest daughter and senior adviser, was in attendance at Mr. McCain’s funeral, along with other senior members of his administration. In the final moments of Meghan McCain’s eulogy, Mr. Trump took off in a motorcade from the White House, destination unknown but presumably his golf course in Virginia. According to reporters traveling with Mr. Trump, “the president is wearing a white shirt-sleeved shirt and white MAGA hat” — the very slogan that Meghan McCain took aim at in her eulogy. In the week since Mr. McCain’s death, his closest friends have been recalling their favorite, private moments with him. For John Lehman, the former Navy secretary, one of them came shortly before Mr. McCain received the diagnosis of brain cancer that would eventually take his life. On the weekend of June 14, 2017, Mr. McCain, Mr. Lehman and three other friends secretly escaped Washington for a three-day dining and gambling trip to Monaco, the place where Mr. McCain had first learned to play craps while on shore leave from the Intrepid in 1961. Mr. Lehman recalled how the small group was greeted by Prince Albert and Princess Caroline — the leaders of the tiny principality and longtime friends of the senator. Past midnight, after a long meal at the palace, with a lot of wine and a leisurely tour, Mr. Lehman said the group — which included Rick Davis, a former campaign chairman; Steve Duprey, a New Hampshire businessman; and Steve Wynn, a Las Vegas casino magnate — prepared to head to their hotel. “The hell with the hotel. We’re going to the casino,” Mr. McCain said, according to Mr. Lehman. For more than four hours, Mr. McCain stood at a craps table, merrily placing bets and rolling the dice as he occasionally paused to take a selfie with admirers. In the end, they finally pulled him away from the table after 4 a.m., having won €900. “He was really happy,” Mr. Lehman recalled fondly. As the McCain family, led by Ms. McCain, filed out of the motorcade and walked in front of the cathedral, the dull hum of noise at the scene went silent. The family watched pallbearers carry the flag-draped coffin up the steps and into the cathedral and quietly followed, heads bowed. Split screen: Minutes after a somber-looking Ivanka Trump and Jared Kushner entered the cathedral, the sizable McCain funeral procession pulled up. As a hearse carrying Mr. McCain’s flag-draped coffin pulled up to the cathedral, the church’s bells played a rendition of “America the Beautiful.” The proceedings played out against gray skies and were punctuated by the angry tweets of a president who had not been invited. Back at the White House, Mr. Trump refrained through midmorning from leaving for his usual trip to his golf club, and instead tweeted about the Steele dossier, President Barack Obama and Hillary Clinton. He also shared a favorable review of his administration just as the hearse carrying Mr. McCain arrived. The president was not alone in his desire to publicly squabble over partisan politics as the McCain family followed their patriarch into the cathedral. A tweet sent by Senator Chuck Schumer, the New York Democrat, angrily accused Republicans of colluding to keep documents related to Judge Brett M. Kavanaugh, the Supreme Court nominee, private. Minutes later, Mr. Schumer quietly took his seat near Senator Mitch McConnell, the majority leader. While the rest of Washington was honoring Mr. McCain, President Trump spent the early hours of the day tweeting his anger about the investigation into his campaign’s ties with Russia during the 2016 election and sending out quotes from a mutual critic of the F.B.I. and Justice Department. “You have a Fake Dossier, gathered by Steele, paid by the Clinton team to get information on Trump,” he wrote, citing Tom Fitton of Judicial Watch (and misspelling the first name of his predecessor as president). “The Dossier is Fake, nothing in it has been verified. It then filters into our American court system in order to spy on Barrack Obama and Hillary Clinton’s political opponent.” He also tweeted out his well-known disdain for the news media, which Mr. McCain used to jokingly call “my base.” Mr. Trump cited Alan Dershowitz, the emeritus Harvard Law School professor, saying that “news reporting has become part of the adversary system.” Mr. Trump added: “It has become tainted and corrupt!” While President Trump was not invited to the service, his daughter, Ivanka Trump, and son-in-law, Jared Kushner, arrived, the most prominent figures from the current administration to attend. John Bolton, the president’s national security adviser, also made his way in. Most of the rest of the crowd filling the Washington National Cathedral were committed opponents of the current president, not just Democrats. Former President Bill Clinton and former Secretary of State Hillary Rodham Clinton were expected to attend. Former Secretary of State John Kerry, Senator Elizabeth Warren of Massachusetts and Gov. John Kasich of Ohio mingled among the dignitaries. Two minutes before 9 a.m., Ms. McCain began walking down the path to the Vietnam Veterans Memorial, flanked by John F. Kelly, the White House chief of staff, and Jim Mattis, the secretary of defense. As she slowly walked, the crowd of onlookers held American flags and cellphones aloft, watching the procession of the McCain children following her. In front of the memorial, Ms. McCain paused and stood by a patriotic wreath that was moved toward her. A minute later, she turned to make her way back to the funeral procession, striding past unfurled American flags and veterans wiping away tears. As she and her children returned to the black cars waiting to head to the Washington National Cathedral, the crowd broke into a minute of applause: a steady stream of clapping that broke the morning silence. In Ms. McCain’s presence, several onlookers saw recognition of more than just Mr. McCain’s legacy, but of their own: the high school classmates they mourned from a despised war, the family members currently in service and veterans they have loved and lost. “He embodied what all these men fought for,” said Cyndy Hollender-Stancliff, a volunteer at the Vietnam Veterans Memorial. After Ms. McCain left, the crowd made its own procession: walking the length of the memorial to stop in front of the wreath of red, white and blue flowers with a Navy ribbon that read “In Honor of All Who Served” in gold curlicue font. They left their own tokens — American flags in the stone, posters — before quietly leaving, their fingers brushing against the names of others who served. One woman, standing off to the side with a small American flag, smiled slightly when asked why she came to the memorial. “Just a good man,” she said, wiping away a tear. Joseph R. Biden Jr., Mitt Romney, Madeleine Albright, David Petraeus and Jay Leno were among the guests trickling into the Washington National Cathedral as the church bells chimed. Lines of naval officers in their crisp dress whites walked to and from the cathedral, all in front of a sprawling media encampment preparing for the day’s events. Mr. Biden, who delivered an emotional eulogy at Mr. McCain’s funeral service in Arizona, pulled out a handkerchief and dabbed his eyes as he entered the cathedral. Among the uninvited: members of the Westboro Baptist Church, who gathered a few blocks away from the cathedral. “MOST PEOPLE GO TO HELL” was among the few printable signs. Dozens of people gathered around the Vietnam Veterans Memorial, forming a quiet ring on the outskirts of the wall before Ms. McCain arrived to honor her husband and other veterans of the Vietnam War. It was almost silent, except for the clipping of Park Police horse hooves on gravel, the rustling of the leaves and the faint strains of the national anthem played in the distance. The people who gathered — veterans, parents in uniform with their children, runners who paused midstride — were there not just to pay respects to Mr. McCain. They were there for Ms. McCain and their own loved ones who had served. “Makes us feel special at a very hard time for all of us,” said Bruce Whiteaker, 69, who served in the Air Force during the Vietnam War. “We’re grateful that she’s decided to stop and honor the fallen in this way.” Mr. Whiteaker made the 10-hour drive from Knoxville, Tenn., with his wife, Shirley, who also served in the Air Force. They brought handmade signs, decorated with American flag stickers, and condolences for the McCain family. “With Cindy McCain coming today,” Ms. Whiteaker said, tears beginning to run down her face, “we wanted her to know what we felt for her and her family.” A stubborn grayness rested over Washington, the vast sheet of dark clouds threatening rain as clusters of mourners walked into the cathedral, dressed in black. An American flag hung at half-staff on the front lawn. Police cars and television vans lined the block, the hum of a dozen running engines clashing with the cathedral’s bells. People began lining the streets around the cathedral long before Mr. McCain arrived, pushing baby strollers and holding cups of coffee. Two blocks away, a family stood in their driveway, packing up their car for a camping trip. “On Saturday mornings, we usually go get doughnuts,” said Louie Renjel, 9, who stood with his father, Louis, at the base of the cathedral’s driveway in a T-shirt and flip-flops, waiting to see Mr. McCain’s coffin arrive. Louie detailed the data points he had learned from his father, a former Senate staff member, about Mr. McCain’s five and a half years as a prisoner of war. Mr. Renjel in recent days found himself watching Mr. McCain’s concession speech for the 2008 presidential election on YouTube. “After that loss, to see McCain feeling that kind of personal pain and to put the country ahead of him,” Mr. Renjel said. “I want to teach my son that — what it means to be great.”",
      "date": "Sept. 1, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "null",
      "url": "https://dealbook.nytimes.com/2013/11/12/morning-agenda-obamas-pick-to-lead-trading-commission/?searchResultPosition=29",
      "subtitle": "null",
      "author": "The New York Times Company",
      "content": "",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "null",
      "url": "https://www.nytimes.com/2009/11/06/world/asia/06training.html?searchResultPosition=28",
      "subtitle": "null",
      "author": "THOM SHANKER",
      "content": "  ",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Trump Inaugural Fund and Super PAC Said to Be Scrutinized for Illegal Foreign Donations",
      "url": "https://www.nytimes.com/2018/12/13/us/politics/trump-inauguration-investigation.html?searchResultPosition=27",
      "subtitle": "null",
      "author": "Sharon LaFraniere",
      "content": "   WASHINGTON — Federal prosecutors are examining whether foreigners illegally funneled donations to President Trump’s inaugural committee and a pro-Trump super PAC in hopes of buying influence over American policy, according to people familiar with the inquiry. The inquiry focuses on whether people from Middle Eastern nations — including Qatar, Saudi Arabia and the United Arab Emirates — used straw donors to disguise their donations to the two funds. Federal law prohibits foreign contributions to federal campaigns, political action committees and inaugural funds. The line of questioning underscores the growing scope of criminal inquiries that pose a threat to Mr. Trump’s presidency. The special counsel, Robert S. Mueller III, is focusing on whether anyone in the Trump campaign conspired with Russia to tip the 2016 presidential election in Mr. Trump’s favor, while prosecutors in New York are pursuing evidence he secretly authorized illegal payments of hush money to silence accusations of extramarital affairs that threatened his campaign. The inquiry into potential foreign donations to the inaugural fund and the super PAC is yet another front being pursued by multiple teams of prosecutors. Thomas J. Barrack Jr., a billionaire financier and one of Mr. Trump’s closest friends, raised money for both funds. “Tom has never talked with any foreign individual or entity for the purposes of raising money for or obtaining donations related to either the campaign, the inauguration or any such political activity,” said Owen Blicksilver, a spokesman for Mr. Barrack. The inaugural committee focus was reported earlier on Thursday by The Wall Street Journal. The super PAC, Rebuilding America Now, was formed in the summer of 2016 when Mr. Trump’s presidential campaign was short of cash and out of favor with many major Republican donors. While Mr. Trump insisted that he could finance his own campaign, he refused to dig too deeply into his own pockets. According to several of the people familiar with the investigation, Paul Manafort, who then headed the campaign, suggested that Mr. Barrack step into the void by creating and raising funds for the political action committee, which could collect unlimited amounts of money as long as it avoided coordinating closely with the candidate. In an interview with investigators a year ago, Mr. Barrack said that Mr. Manafort seemed to view the political committee as an arm of the campaign, despite laws meant to prevent such coordination, according to a person familiar with the interview. Federal election law requires a cooling-off period of at least 120 days before campaign staff members join a political committee backing the same candidate, but Mr. Manafort dispatched two friends from the campaign, Laurance Gay and Ken McKay, to run the operation. A press officer said at the time that the committee violated no rules because the campaign never paid the two men. Neither man returned repeated phone calls seeking comment. According to filings with the Federal Election Commission, the committee raised $23 million, making it one of the most important sources of funds for advertisements, polls and other political expenditures on Mr. Trump’s behalf. Most money came from several big donors, including from Linda McMahon, a professional wrestling executive who donated $6 million and was later appointed by Mr. Trump to head the Small Business Administration. Prosecutors from New York and from Mr. Mueller’s team have asked witnesses whether anyone from Qatar or other Middle Eastern countries also contributed money, perhaps using American intermediaries. Among other issues, they asked about a Mediterranean cruise that Mr. Barrack and Mr. Manafort took after Mr. Manafort was fired in August 2016 from the Trump campaign because of a scandal over his previous work for pro-Russian politicians in Ukraine. Mr. Manafort was in serious financial trouble at the time, and Mr. Barrack, who has an extensive business network in the Persian Gulf, may have been attempting to help him find clients. On the cruise, the pair met one of the world’s richest men, Hamad bin Jassim bin Jaber Al Thani, the former prime minister of Qatar. Until 2013, Mr. Al Thani presided over the country’s $230 billion sovereign wealth fund. He remains a highly influential member of the nation’s governing royal family. Investigators also sought information from a businessman, Rashid Al Malik, an associate of Mr. Barrack’s who heads a private investment firm in the United Arab Emirates, according to a person familiar with the inquiry. Mr. Malik, whose lawyer did not immediately respond to a request for comment, has been described as close to a key figure in the U.A.E.’s government. After Mr. Trump was elected, any troubles he had finding donors appeared to have vanished. His inaugural fund raised $107 million — four times as much as the pro-Trump political action committee and twice as much as the amount raised for President Barack Obama’s first inauguration. Mr. Barrack was its chairman, and Rick Gates, a longtime business associate of Mr. Manafort’s who served as deputy campaign chairman, ran it. The inquiry into the inaugural fund appears to involve prosecutors from United States attorney’s offices in Manhattan and Brooklyn, people familiar with the investigation said. The fund has long been a source of infighting among White House advisers and personal friends of Mr. Trump’s, who blamed each other for news reports about questionable expenditures. The prosecutors in Manhattan were apparently following up on leads from their case against Michael D. Cohen, the president’s former longtime fixer. Mr. Cohen was sentenced on Wednesday to three years in prison, in part for organizing payments to cover up sex scandals that could have threatened Mr. Trump’s chances of winning the White House. Among other documents seized during raids on Mr. Cohen’s home and office in the spring, investigators found a tape recording of a conversation with Stephanie Winston Wolkoff, a friend of Melania Trump’s, who ran entities that collected $26 million from the fund. Ms. Winston Wolkoff blamed Mr. Barrack for news reports questioning the payments to her and criticized him for failing to properly manage the account, according to people who spoke with her. She complained about how he had handled the money to several friends, including Mr. Cohen, those people said. The inaugural committee complied with all laws and “has not been contacted by any prosecutors,” said Mr. Blicksilver, who is also a spokesman for the fund. Its finances “were fully audited internally and independently,” and donors were fully vetted and disclosed to the Federal Election Commission, as required, he said. In fact, though, the fund has already run into trouble related to both donations and expenditures. Mr. Gates, who is awaiting sentencing for crimes related to a financial fraud scheme he executed with Mr. Manafort, has testified that he may have submitted personal expenses for reimbursement from the fund. A later review of the inaugural expenses found no issue with his reimbursements, a person close to Mr. Gates said. And this year, a well-known Republican lobbyist, Sam Patten, pleaded guilty to arranging for a Ukrainian oligarch and another foreigner to buy $50,000 worth of tickets to an inaugural event, using an American as a straw purchaser. Investigators have asked witnesses whether other foreigners also contributed illegally to the inaugural committee. Once Mr. Trump was elected, foreign governments were frantically trying to build connections to the incoming administration, including Qatar, Saudi Arabia and the United Arab Emirates. Although it hosts and heavily subsidizes an American military base, Qatar is constantly striving to counter the influence of its powerful neighbors, also allies of the United States.",
      "date": "Dec. 13, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "null",
      "url": "https://www.nytimes.com/2007/02/23/us/politics/23geffen.html?searchResultPosition=26",
      "subtitle": "null",
      "author": "JENNIFER STEINHAUER",
      "content": "  ",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "null",
      "url": "https://dealbook.nytimes.com/2010/03/09/leibovitz-said-to-ink-deal-with-colony-capital/?searchResultPosition=25",
      "subtitle": "null",
      "author": "The New York Times Company",
      "content": "",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "At Trump’s Inauguration, $10,000 for Makeup and Lots of Room Service",
      "url": "https://www.nytimes.com/2019/01/14/us/politics/trump-inauguration-spending.html?searchResultPosition=24",
      "subtitle": "null",
      "author": "Maggie Haberman",
      "content": "   WASHINGTON — Private donors put up $107 million to usher Donald J. Trump into office in style two years ago, and it is now clear just how enthusiastically his inaugural committee went to town with it. There was $10,000 for makeup for 20 aides at an evening inaugural event. There was another $30,000 in per diem payments to dozens of contract staff members, in addition to their fully covered hotel rooms, room service orders, plane tickets and taxi rides, including some to drop off laundry. The bill from the Trump International Hotel was more than $1.5 million. And there was a documentary, overseen by a close friend of Melania Trump’s, that was ultimately abandoned. The details of the expenditures, gleaned from interviews and from documents reviewed by The New York Times and not previously made public, show that the committee spent heavily on nearly every aspect of the events surrounding the inauguration. In 72 days, it laid out about $100 million, roughly twice as much or more than was raised by Barack Obama or George W. Bush for their first and second presidential inaugurations. The expansive spending reflected Mr. Trump’s desire to make a grand entrance, with roughly 20 events around Washington, people familiar with the events said. It also had the hallmarks of previous Trump efforts, such as the campaign, with some Trump-family friends circumventing existing chains of command. Disclosure of the spending details comes at a time when the inaugural committee is facing legal scrutiny over the donations that funded it. Inaugural committees are required to document every donation with the Federal Election Commission, and the Trump team’s reports are now under investigation by federal prosecutors in Manhattan and Brooklyn. Investigators are also looking into whether any foreign donations, which are illegal in the United States, were passed through Americans, and whether any donations went unrecorded, people familiar with the inquiries said. People involved with the committee have said that they vetted all donors, but that they could do only so much to prove someone’s money was their own. False statements to the Federal Election Commission can be a crime. The investigation by federal prosecutors in Manhattan was prompted at least partly by a recording that Mr. Trump’s former lawyer and fixer, Michael D. Cohen, made of a conversation he had with a central figure in the inaugural planning, Stephanie Winston Wolkoff, shortly after Mrs. Trump ended Ms. Winston Wolkoff’s role as an unpaid adviser to the first lady. Ms. Winston Wolkoff was dismissed after initial reports about the amount of money taken in by the entity she formed to help produce the inaugural. There is no indication of any investigation into the inaugural committee’s spending. For the most part, inaugural committees are free to spend the money they raise from private donations as they wish. The bulk of the money for the inaugural committee came from big corporations, like AT&T, Bank of America and Pfizer, and wealthy Republicans donors, like Sheldon G. Adelson and Andrew Beal. Given the short time frame between Election Day and Inauguration Day, inaugural committees cannot always seek out the lowest bidder. In the case of Mr. Trump’s inaugural, some staff members and major vendors were veterans of previous inaugurations. Much of the spending, while outsize, was mundane. Documents reviewed by The Times accounted for the entire $107 million raised for the inaugural, with most of the money going to payroll expenses and roughly 40 entities, the bulk of which were hotel chains and other vendors. Roughly $5 million went to charity, which organizers have noted is the most ever for an inaugural committee. But millions were written off in lost revenue. That included $6.4 million for blocks of hotel rooms booked for guests who ended up arranging their own accommodations. The Republican National Committee booked the excess hotel rooms before the inaugural staff was even formed, but the committee had to pony up when only half as many rooms were used as the party organization had expected. Another $1.2 million in revenue that the committee expected to recoup for a media center never materialized. Other arrangements by the inaugural committee also proved unusual. Ms. Winston Wolkoff, then a close friend of Mrs. Trump’s, was initially signed to a $1.6 million contract. Along with a friend, Jonathan Reynaga, she formed WIS Media Partners, a firm that oversaw broadcast rights for the inaugural events and worked on the documentary project featuring interviews with top inaugural committee officials. The idea was to sell the rights to a major distributor. The project was later abandoned, although the interview footage still exists, as do copies, according to three people familiar with the effort. WIS Media Partners became the inaugural committee’s top vendor, acting as a kind of general contractor and overseeing a series of events. It received nearly $26 million, much of which was paid out to other vendors. Steve Kerrigan, who was chief of staff for Mr. Obama’s first inaugural committee, said that the firm’s $1.6 million “supervisory fee” was the equivalent of “roughly one-fourth of what we paid our entire 450-person staff” in 2009. Even if Ms. Winston Wolkoff shared the fee among more than a dozen other top managers, as she and others say she did, the charge itself, Mr. Kerrigan said, was “outrageous.” Greg Jenkins, the executive director of Mr. Bush’s second inaugural, said, “I have never heard anybody getting that kind of fee associated with any inaugural, ever.” Ms. Winston Wolkoff often fought with other top aides, according to people with direct knowledge of events. She was known to threaten to have senior officials fired, at times brandishing a cellphone and saying she would text Mrs. Trump or Ivanka Trump, the president’s elder daughter, conveying a sense of authority that people later came to realize she did not have, three people with direct knowledge of the events said. A lawyer for Ms. Winston Wolkoff declined to comment. A spokesman for WIS Media Partners said all of the firm’s charges “were vetted, authorized and signed off on” by the committee’s top officials, including Thomas J. Barrack Jr., the committee’s chairman; Rick Gates, the deputy chairman; and Sara Armstrong, the chief executive. He said the firm’s fees were “significantly below” the customary charges “for equivalent productions,” and that officials provided the inaugural committee with “all its audited records and receipts.” He said the company could not reveal more because it is legally barred by the inaugural committee from discussing its work on the inaugural events. In a statement, Mr. Barrack said he continues “to be proud of the incredible work of all those that were part of the committee” and that it “complied with all laws and regulations, and its finances were fully audited internally and independently. The donors were fully vetted and disclosed to the Federal Election Commission as required.” Mr. Trump’s inaugural committee has come under scrutiny in the past for its high administrative and logistical costs. The new details help flesh out how the inaugural spent the money. Among the payments was more than $2 million spent on the firm of the Trump campaign official Brad Parscale for online advertisements to drum up inaugural crowds. Another $2.7 million was spent on flying in a performance group working with Steve Wynn, the casino magnate and friend of Mr. Trump. The Trump International Hotel was paid more than $1.5 million for services including the use of a ballroom, an “annex” and a space called the townhouse, according to records and people familiar with the payments. While two other hotels, the Willard and the Fairmont, collected as much or more, Mr. Trump’s hotel was also favored by vendors who billed their expenses directly to the committee. Over all, the Trump team’s spending appears “astronomical,” said Emmett S. Beliveau, who was chief executive of Mr. Obama’s first inaugural committee. Mr. Jenkins, who handled the Bush inaugural, said the scale of the Trump team’s spending “blows me away.” Ms. Winston Wolkoff and Mr. Reynaga brought in nearly three dozen staff members, some of whom flew in from Los Angeles or other cities and remained on the East Coast for weeks. WIS also helped bring in a New York-based party planner named David Monn, who refused to sign a contract, according to two people familiar with the arrangement. Mr. Monn charged the committee a total of $3.7 million, from which he paid subcontractors. Among other tasks, Ms. Winston Wolkoff and colleagues managed the 500-person black-tie dinner hosted by Mr. Barrack at the neo-Classical Andrew W. Mellon Auditorium and a 1,500-person “candlelight” dinner at Union Station. They decided the decorations were not elegant enough and needed to be enhanced. Mr. Monn spent $924,000 on seven-foot-high wreaths, moss-covered obelisks, flowers and other decorations to dress up Union Station. Makeup was provided for 20 staff members at a cost of $500 per person. For the dinner at the auditorium, table menus, table numbers and place cards, including an on-site calligrapher to correct last-minute mistakes, amounted to $91 per guest. Mr. Monn did not respond to repeated requests for comment on Monday. The handling of expenses for contractors like WIS Media Partners was also unusual. Mr. Kerrigan, who also served as chief executive of Mr. Obama’s second inaugural committee, said officials negotiated fixed-price contracts that limited how much vendors could charge for expenses. If a vendor’s staff member ran up a big room service bill, “that was on them,” said David Cusack, who was the executive director of the second committee. “They had a per diem, and they were supposed to eat on that.” For Mr. Bush’s second inaugural, too, vendors were required to build their expenses into their contracts, Mr. Jenkins said. He said his committee did not even hire vendors from outside the Washington area because “there was no need to.” The Trump inaugural committee covered not only a fixed per diem for the people brought in by WIS Media, but picked up expenses including room service, cab rides for assistants who dropped off laundry and an order of McDonald’s. All told, those expenses came to $227,511. In less than two months, WIS billed $31,000 for hotel rooms described as Mr. Reynaga’s, including nearly $18,000 for rooms at the Trump International Hotel, according to detailed expense documents reviewed by The Times. He also billed thousands of dollars for meals, room service and travel. On one day, he charged a $560 Amtrak train ticket from New York to Washington, plus a $251 first-class upgrade to meet with Mr. Barrack. That was followed by a $100 Uber ride the next day to “get to Tom’s plane,” the records show. The spokesman for WIS said WIS expenses were paid through business cards tied to a few senior officials of the firm, including Mr. Reynaga, meaning that Mr. Reynaga could have been paying for other employees’ costs. He also said staff members stayed at the Trump International Hotel “at the explicit direction” of inaugural committee officials. A former official of the inaugural committee denied that the WIS employees were required to stay at the Trump hotel.",
      "date": "Jan. 14, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "null",
      "url": "https://www.nytimes.com/interactive/2019/03/31/us/politics/trump-investigations-that-grew-out-of-mueller.html?searchResultPosition=23",
      "subtitle": "null",
      "author": "LARRY BUCHANAN",
      "content": "  ",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Melania Trump Leaves New York Behind for the White House",
      "url": "https://www.nytimes.com/2017/06/12/us/melania-trump-white-house.html?searchResultPosition=22",
      "subtitle": "null",
      "author": "Maggie Haberman",
      "content": " Melania Trump will attend a congressional picnic in the final days of June. She will start filling out her roster of aides. She will get her son settled into his new home and, then, in the fall, a new school. And she will turn attention to the range of issues that a first lady has the ability to affect. For the first time since President Trump was inaugurated, his wife is living full time in the White House. She and the couple’s 11-year-old son, Barron, left Trump Tower in Manhattan behind over the weekend, a transition that the first lady announced on her husband’s favorite medium, Twitter, after it was completed. “Looking forward to the memories we’ll make in our new home! #Movingday,” Mrs. Trump wrote in her 8:30 p.m. post on Sunday, accompanied by a photo of the view of the South Lawn from the White House’s second-floor residence. Mrs. Trump’s stealth approach to leaving New York for Washington reflected the fiercely guarded privacy that she has tried to maintain since Mr. Trump formally became a presidential candidate in June 2015. What her presence portends for her life in the White House is unclear. Mrs. Trump, 47, has not carved out a distinct area of interest yet, and people close to her say she is still considering how she wants to use what has traditionally been a public platform that Michelle Obama used to highlight an anti-obesity initiative and that Laura Bush used to prioritize children’s literacy. But Mrs. Trump’s immediate focus is likely to be inside the White House, where her husband has become increasingly isolated from his party and even his own staff since his abrupt firing of James B. Comey, the director of the F.B.I. “She is the president’s never-ending barometer of reality, and she delivers candor and honesty blended with selfless love for him and his family in equal doses,” said Thomas J. Barrack Jr., a close friend of the Trumps who has known the first lady since 1998. For those new to Mr. Trump’s world, the impeccably dressed former model who became his third wife in 2003 has become a ray of hope as the person who will finally be the one to tame the untamable president. But those expectations are unrealistic, unfairly raise expectations and are unlikely to be met, people close to Mrs. Trump point out. Mrs. Trump, in the few interviews she gave during the campaign, made her feelings about her husband’s tweeting clear. “Sometimes I say I have two teenage boys at home — my young son and my husband,” Mrs. Trump told the CNN host Anderson Cooper about a week after the existence of the infamous “Access Hollywood” tape became known. But on Sunday, Mrs. Trump’s first publicly revealed night in the White House, Mr. Trump again fired off a round of tweets. Mrs. Trump was photographed over the weekend with her hand wrapped around her husband’s as they walked across the White House grounds. It stood in contrast to the swat she gave the president as he reached for her hand on the first leg of his foreign trip, a moment that went viral. So did another moment, in April, when the first lady gently reminded the president to put his hand over his heart during the national anthem at the White House Easter egg hunt. Uninterested in the spotlight and meticulously careful in choosing her areas of interest, Mrs. Trump’s main concern is how her husband is doing. She remained in New York caring for Barron and taking him to school herself each day, but relying on her instincts, she advised Mr. Trump throughout his campaign. When Mr. Trump first considered saying he was exploring whether to run, it was his wife who told him that people would not take him seriously unless he actually became a candidate. And when Reince Priebus, now the White House chief of staff, told Mr. Trump to consider dropping out of the race when the offensive “Access Hollywood” tape became public, Mrs. Trump told him not to consider it for a moment. “She is the immovable rudder to an ever-changing sea,” Mr. Barrack said. Mrs. Trump’s other immediate worry is Barron’s privacy, which she has guarded to the exclusion of almost all else, as many political spouses do. Kellyanne Conway, the White House counselor, said Mrs. Trump’s “intelligence, instincts and commitment to family should inspire women.” Any news article about Barron has left her uncomfortable at best, friends of the family say. That included a story characterizing her son’s reaction to a violent bit of performance art by the comedian Kathy Griffin that acted out the beheading of Mr. Trump. Mrs. Trump’s statement on the matter did not refer to her son at all. Mr. Trump and his wife spoke several times a day while she was in New York awaiting Barron’s final days of school. He sought her counsel on staff appointments, and her general reassurance as he navigated his new office and living alone for the first time in more than a decade. But the transition to the role of first lady has not been easy, made trickier by her physical distance from the White House and the lack of a full complement of staff members to carry out basic functions — and with no relationship with Mrs. Obama to help guide her. Like Mrs. Obama, who bristled at the traditional confines of the first lady role, Mrs. Trump has quietly rebelled against some of the staples of the position. Until recently, she has not been a public presence at many White House events, and when she has appeared, her uninterest in being in the news was apparent. She had declined to make public comments or travel with a press pool. But on Mr. Trump’s recent trip to the Middle East and Europe, Mrs. Trump embraced the role, maintaining her own schedule to favorable review. Even then, she rarely made unscripted remarks.",
      "date": "June 12, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Trump’s Inaugural Committee Paid $26 Million to Firm of First Lady’s Adviser",
      "url": "https://www.nytimes.com/2018/02/15/us/politics/trumps-inaugural-committee-paid-26-million-to-first-ladys-friend.html?searchResultPosition=21",
      "subtitle": "null",
      "author": "Maggie Haberman",
      "content": "  WASHINGTON — President Trump’s inaugural committee paid nearly $26 million to an event planning firm started by an adviser to the first lady, Melania Trump, while donating $5 million — less than expected — to charity, according to tax filings released on Thursday. The nonprofit group that oversaw Mr. Trump’s inauguration and surrounding events in January 2017, the 58th Presidential Inaugural Committee, had been under pressure from liberal government watchdog groups to reveal how it spent the record $107 million it had raised largely from wealthy donors and corporations. Its chairman, Thomas J. Barrack Jr., a longtime friend of Mr. Trump’s, had pledged that the committee would be thrifty with its spending, and would donate leftover funds to charity. In a statement released by the committee, he praised it for carrying out the inauguration and more than 20 related events with “elegance and seamless excellence without incident or interruption, befitting the legacy and tradition that has preceded us.” But the mandatory tax return it filed with the Internal Revenue Service revealed heavy spending on administrative and logistical expenses associated with planning and executing several days’ worth of events for donors and supporters around Mr. Trump’s inaugural ceremonies. By contrast, the return showed that the group’s charitable donations included only a previously publicized $3 million for hurricane relief, as well as a total of $1.75 million to groups involved in decorating and maintaining the White House and the vice president’s residence, and $250,000 for the Smithsonian Institution. The 116-page filing indicates that the majority of the funds — more than $57 million — went to four event-planning companies. The company that received the biggest payment — $26 million — was WIS Media Partners of Marina del Rey, Calif. Records show that the firm was created in December 2016, about six weeks before the inauguration, and its founder, according to a person familiar with the firm, was Stephanie Winston Wolkoff, a longtime friend of Mrs. Trump’s. Otherwise there is very little information available about the company. Ms. Winston Wolkoff made her name planning Manhattan society galas. An associate of the Vogue editor Anna Wintour, Ms. Winston Wolkoff traveled in the same circles as Mrs. Trump, who attended Ms. Winston Wolkoff’s 40th birthday party in 2010. Ms. Winston Wolkoff has subsequently been brought on as a senior adviser to the first lady’s official government office. Two people with direct knowledge of Ms. Winston Wolkoff’s role, who asked to remain anonymous, said she often invoked Mrs. Trump’s name with transition officials as she delivered instructions for the inauguration. But Stephanie Grisham, a spokeswoman for Mrs. Trump, said the first lady “had no involvement” with the inaugural committee “and had no knowledge of how funds were spent.” Ms. Winston Wolkoff is not paid for her work in the first lady’s office, according to Ms. Grisham, who said Ms. Winston Wolkoff is classified as “a special government employee” and “has specified duties as outlined in her contract.” Special government employees are a category of federal worker created to allow the government the flexibility to hire specialists to fill discrete roles, usually on a temporary basis. Ms. Grisham did not respond to follow-up questions about the particulars of Ms. Winston Wolkoff’s work in the first lady’s office, or her relationship with Mrs. Trump. Ms. Winston Wolkoff could not be reached for comment. Mr. Barrack praised Ms. Winston Wolkoff, saying she “executed her duties well.” But Craig Holman, an official with the government watchdog group Public Citizen, which had called on the inaugural committee to release more details about its finances sooner, described the payments to Ms. Winston Wolkoff’s firm and other expenditures as “fiscal mismanagement at its worst.” Much of the money paid to Ms. Winston Wolkoff’s firm and other event production companies was probably passed through to other vendors that provided goods or services on a subcontractor basis. An operative who worked with the inaugural committee, who was not authorized to speak for attribution about its spending, said Ms. Winston Wolkoff’s firm handled everything from securing venues and table settings to arranging Instagram filters and satellite feeds, as well as the transportation of heavy equipment. The operative said Ms. Winston Wolkoff personally received $1.62 million for her work through her consulting firm, although committee officials said she used that money to help pay other inaugural workers who reported to her. An inaugural committee official, who spoke on the condition of anonymity because the official was not authorized to discuss the details publicly, said Ms. Winston Wolkoff’s firm also paid the team used by Mark Burnett, the creator of “The Apprentice,” whose involvement in the inaugural festivities was requested by Mr. Trump. Also reaping payments for event production services was Hargrove Inc., of Lanham, Md., a company that plans trade shows and other events, which was paid $25 million. David Monn of New York, who also is known for orchestrating society events and planned a state dinner for former President Barack Obama, was paid $3.7 million, which the operative said was primarily to plan two events, one of which was billed as a “candlelight dinner” attended by Mr. and Mrs. Trump, and Vice President Mike Pence and his wife, Karen Pence. The committee spent heavily on administrative expenses, including $9.4 million on travel, $500,000 on legal fees, $237,000 on fund-raising and $4.6 million on salaries and benefits for its 208 employees. That included $100,000 paid to Rick Gates, the former Trump campaign aide, who has since been indicted on a host of charges by the special counsel investigating Russian meddling in the 2016 presidential election, according to the operative who worked with the inaugural committee. Mr. Barrack, a California real estate investor, picked Mr. Gates to help lead the committee’s efforts. But many people with long experience in Republican politics remained wary of Mr. Trump as the inauguration approached and did not get involved with the committee. The inaugural committee official said wrap-up costs were more significant than had been anticipated, and indicated that the committee’s finances were affected by its lack of a large deal for broadcast rights to the inaugural balls. But its brisk fund-raising — the $107 million it raised was about twice as much as Mr. Obama’s inaugural committee raised for the festivities around his 2009 swearing-in — allowed it to cover all its costs. The inaugural committee closed out October with $2.8 million in the bank, according to the tax filing. It indicated in the release that the remaining funds also would be donated to charity once remaining expenses were paid. The tax return indicated that the committee already donated to six nonprofit groups, and inaugural officials pointed out that the $5 million in total charitable donations to those groups was more than Mr. Obama’s committee donated. Among the recipients of charitable donations, the White House Historical Association received $1 million, while the Vice President’s Residence Foundation, which is devoted to decorating and furnishing the vice president’s residence on the grounds of the Naval Observatory in Washington, received $750,000. The American Red Cross, the Salvation Army and Samaritan’s Purse, an evangelical group, received $1 million each. All three groups were involved in relief efforts after a string of hurricanes that ravaged the Gulf Coast, Florida and the Caribbean. As questions mounted last summer about the inaugural committee’s finances and pledged charitable donations, Mr. Barrack released a statement promising that “millions of dollars of reserve funds will be allocated to various charities, institutions and foundations in an amount that surely will exceed any previous inauguration.” The inaugural committee split the costs of staging a range of festivities with the taxpayer-funded Joint Congressional Committee on Inaugural Ceremonies and various federal, state and local government agencies. Security costs alone were predicted to  surpass $100 million, which will eventually be paid for by the federal government. Among the top donors to Mr. Trump’s inaugural committee was the Las Vegas casino mogul Sheldon G. Adelson, who donated $5 million, and corporations including Chevron, Boeing and AT&T. The committee had previously filed a mandatory report with the Federal Election Commission listing its donors, and the donor names were omitted from the I.R.S. filing released Thursday. The bulk of the report — about 90 pages — comprised a list of donation amounts without the identities of the donors.",
      "date": "Feb. 15, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Melania Trump Parts Ways With Adviser Amid Backlash Over Inaugural Contract",
      "url": "https://www.nytimes.com/2018/02/26/us/politics/melania-trump-inauguration-adviser.html?searchResultPosition=20",
      "subtitle": "null",
      "author": "Kenneth P. Vogel",
      "content": "  WASHINGTON — The first lady, Melania Trump, has parted ways with an adviser after news about the adviser’s firm reaping $26 million in payments to help plan President Trump’s inauguration. Stephanie Winston Wolkoff, who has been friends with Mrs. Trump for years, had been working on a contract basis as an unpaid senior adviser to the office of the first lady. Stephanie Grisham, Mrs. Trump’s spokeswoman, said the office had “severed the gratuitous services contract with Ms. Wolkoff,” who Ms. Grisham said had been employed as “a special government employee” to work on specific projects. “We thank her for her hard work and wish her all the best.” The contract was terminated last week, according to two people with direct knowledge of the situation. They said the move was prompted by displeasure from the Trumps over the news, first reported by The New York Times, that a firm created by Ms. Winston Wolkoff was paid nearly $26 million for event planning by a nonprofit group that oversaw Mr. Trump’s inauguration and surrounding events in January 2017. Mr. Trump, who is notoriously tight with money, was also enraged to learn that Ms. Winston Wolkoff brought on an associate, David Monn, to help plan inaugural events, according to people who spoke to him. Mr. Monn’s firm was paid $3.7 million, according to a tax filing by the nonprofit group, the 58th Presidential Inaugural Committee. Ms. Grisham said that the first lady “had no involvement” with the inaugural committee and that she “had no knowledge of how funds were spent.” Ms. Winston Wolkoff, in an email, defended her work on the inauguration, denounced news coverage of it and challenged the characterization that her contract with Mrs. Trump’s office was terminated as a result of the news about payments from the inaugural committee. “I was informed by the White House counsel’s office that all gratuitous volunteer contracts were ended,” she said. She asserted that the development would not affect her relationship with Mrs. Trump, who attended Ms. Winston Wolkoff’s 40th birthday party in 2010 and has traveled in the same circles for years. “I expect to remain a trusted source for advice and support on an informal basis,” she wrote. In another email, Ms. Winston Wolkoff said, “I am proud of the work that we did to support the inauguration.” She said her firm, WIS Media Partners, spent the overwhelming majority of the money it was paid by the inaugural committee on services to subcontractors, including for satellite feeds to be provided to broadcasters worldwide. The firm “retained a total of $1.62 million for all of its consulting and creative services, which was divided among our staff of 15 members (including myself),” she said in the email. She added that the firm, which had been created only weeks before the inauguration, “submitted all of our records fully audited to the inauguration committee nearly one full year ago in March 2017.” Ms. Winston Wolkoff said news coverage of her work was “completely unfair,” but she did not specify any errors. In a series of emails, she copied a lawyer from the New York-based law firm Paul, Weiss, Rifkind, Wharton & Garrison and wrote, “There have been a number of unfair and untrue statements about me and I am reserving all rights.” Ms. Winston Wolkoff made her name planning society galas in New York, including the Costume Institute Gala, also known as the Met Gala, at the Metropolitan Museum of Art. Over the years, she worked closely on the gala with the Vogue editor Anna Wintour. Mr. Monn also worked on the gala, which embodies an exclusive vibe that is in many ways incongruous with the messaging to blue-collar voters that Mr. Trump projected during the 2016 presidential campaign. That discordance attracted notice when Ms. Winston Wolkoff was retained by the inaugural committee, which was led by the California real estate investor Thomas J. Barrack Jr., a longtime friend of Mr. Trump’s. Mrs. Trump had introduced Ms. Winston Wolkoff to Mr. Barrack, according to a person familiar with the connection. But the decision to hire Ms. Winston Wolkoff was Mr. Barrack’s, said an operative who worked with the inaugural committee. Ms. Winston Wolkoff often invoked her friendship with Mrs. Trump when talking with officials on the Trump transition team and then in the East Wing, according to three people with direct knowledge of her interactions. The inaugural committee promised that the swearing-in ceremonies and events would be “workmanlike,” even as it raised a record-shattering $107 million — about twice as much as former President Barack Obama’s inaugural committee raised for the festivities around his 2009 swearing-in — largely from wealthy donors and corporations. The majority of those funds — more than $57 million — went to four event-planning companies. The company that received the biggest payment was Ms. Winston Wolkoff’s firm, which was incorporated in California in December 2016 — about six weeks before the inauguration. The operative who worked with the inaugural committee said that Ms. Winston Wolkoff’s firm handled everything from securing venues and table settings to arranging Instagram filters and satellite feeds, as well as the transportation of heavy equipment. An inaugural committee official, who spoke on the condition of anonymity because the official was not authorized to discuss the details publicly, said Ms. Winston Wolkoff’s firm also paid the team used by Mark Burnett, the creator of “The Apprentice,” whose involvement in the inaugural festivities was requested by Mr. Trump. Mr. Barrack had praised Ms. Winston Wolkoff, saying that she “executed her duties well.” Mr. Monn’s $3.7 million payment from the inaugural committee was primarily to plan two events, one of which was billed as a “candlelight dinner” attended by Mr. and Mrs. Trump and Vice President Mike Pence and his wife, Karen, according to the operative who worked with the committee. Mr. Monn, who had planned a state dinner for Mr. Obama’s White House, said he was “flattered” and “honored” when Ms. Winston Wolkoff asked him to help with the inauguration. He said he “received some very unpleasant comments” from people when his work on the inauguration was made public, but he said: “I actually consider myself a patriot. I am not a politician.” Ms. Winston Wolkoff said Mr. Monn “is an exceptional event planner who is universally respected for his design and décor expertise.”",
      "date": "Feb. 26, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "CNBC reporter under scrutiny for \"Tea Party\" remarks",
      "url": "https://www.nytimes.com/2009/03/03/technology/03iht-cnbc.4.20567603.html?searchResultPosition=19",
      "subtitle": "null",
      "author": "Brian Stelter",
      "content": " NEW YORK — Rick Santelli, the CNBC reporter whose on-air suggestion of a \"Chicago Tea Party\" to protest President Barrack Obama's housing plan sparked an Internet sensation and a smattering of actual protests across the country, has found himself on the defensive. Santelli published a long blog post Monday evening on the Web site of CNBC, a cable financial news network, denying any affiliation with the \"tea party movements that have popped up\" since his comments were broadcast. A number of blogs had questioned whether Santelli had coordinated his on-camera commentary with the right-wing groups behind those movements. On Feb. 19, during one of his regular live reports from the Chicago Board of Trade, Santelli mentioned the tea party idea as part of a larger screed about the homeowner assistance plan. At one point, as the traders around him booed the president's housing proposals, he asked: \"President Obama, are you listening?\" The president's press secretary, Robert Gibbs, was, and responded the next day by saying that Santelli \"doesn't know what he's talking about.\" Since the commentary, which was viewed millions of times on CNBC.com and YouTube, dozens of \"tea party\" protests have taken place in cities across the country, and some conservative groups are planning a Tax Day Tea Party for April 15. Santelli's televised commentary appeared spontaneous to viewers. But the Internet domain name ChicagoTeaParty.com was registered in August 2008 - well before his commentary aired - but not used until afterwards. The registration was first reported by two bloggers for Playboy's Web site, who said it was evidence that Santelli's remarks were a \"carefully-planned trigger\" for the protests. The blog post was removed without explanation Monday. Zack Christenson, a producer for a conservative radio talk show host, confirmed by telephone Monday that he registered the domain, but called it a \"pure coincidence.\" He had intended to use it to start a roving cocktail party for conservatives and libertarians in Chicago, he said, and only heard about Santelli's commentary when a person offered to buy the domain from him. In his blog post Monday, Santelli, who voted for Senator John McCain in the last presidential election, wrote that his comments were spontaneous and that he had \"no affiliation or association\" with any of the Web sites or protests. The attention around Santelli's views appears to be a distraction at CNBC. Santelli refused interview requests on Monday and the network canceled his appearance on \"The Daily Show with Jon Stewart\" on Wednesday. \"It was time to move on to the next big story,\" a CNBC spokesman said.",
      "date": "March 3, 2009",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Trump Inaugural Drew Big Dollars From Donors With Vested Interests",
      "url": "https://www.nytimes.com/2017/04/19/us/politics/trump-inauguration-sheldon-adelson-fundraising.html?searchResultPosition=18",
      "subtitle": "null",
      "author": "Nicholas Confessore",
      "content": "   The casino magnate and philanthropist Sheldon G. Adelson wants some big things from the Trump administration: banning the online poker sites that compete with his luxury casinos, for example, and moving the United States Embassy in Israel to Jerusalem. And while President Trump was not Mr. Adelson’s first choice during the Republican primary season last year, he has been generous since: The billionaire donated $5 million to the committee organizing Mr. Trump’s inauguration festivities — the largest single contribution given to any president’s inaugural committee. Some of the country’s wealthiest Republicans and its largest corporations had similar impulses. Documents released this week by Mr. Trump’s inaugural organizers provide a glimpse of the big-dollar frenzy of influence-seeking and peacemaking surrounding Mr. Trump’s swearing-in, which raised $107 million, twice as much money as any other inauguration. The stream of money is a striking contrast to the way Mr. Trump funded his campaign, chiefly with small donations and his own fortune. While some big checks for the inauguration came from longtime Trump friends and associates, much of the money came from the industries that have traditionally excelled at wielding Washington influence: telecommunications, tobacco and pharmaceutical giants, which have bankrolled presidential inaugurations for Republicans and Democrats alike. And a generous amount came from people who had been hostile to his candidacy. If the crowds at Mr. Trump’s swearing-in celebrations were relatively small, the checks paying for all the nonofficial festivities were not: Freed of many of the voluntary restrictions adopted by Mr. Trump’s predecessors, 48 people or corporations gave $1 million or more, according to the disclosures filed with the Federal Election Commission. Besides Mr. Adelson, they included a trust controlled by the coal industry billionaire Joseph W. Craft III; the parent company of R. J. Reynolds Tobacco Company; and Robert Mercer, the billionaire investor and close ally of Stephen K. Bannon, a White House adviser. The donor rolls also included a host of blue-chip American companies, like Coca-Cola, Microsoft, Intel, Google and Bank of America, which contribute significant sums regardless of the incoming president’s political party. Many of the companies and donors have major interests at stake in Washington in the coming months. At least $10 million — about one out of every $10 raised — came from coal, oil, and gas companies or their executives. They are the chief beneficiaries of Mr. Trump’s aggressive efforts to weaken federal rules aimed at limiting pollution in streams and wetlands, cutting back on greenhouse gases and closing coal-burning power plants. The inauguration received $500,000 from Citgo Petroleum, a Houston-based United States affiliate of Venezuela’s state oil company. The donation came in December as Venezuela’s president, Nicolás Maduro, grappled with food and medicine shortages and a cratering economy. The Trump administration has been critical of Mr. Maduro’s government. “During the campaign, he attacked over and over again precisely these kinds of huge contributions,” said Fred Wertheimer, the president of the watchdog group Democracy 21 and a longtime advocate of tighter campaign finance rules. “He also said he knew from personal experience that you can buy influence with politicians by making these kinds of contributions. That didn’t seem to bother him in raising ridiculous amounts of money to pay for the inauguration.” Boeing, the country’s biggest exporter, made a million-dollar contribution in January. This month, Boeing won a major victory when Mr. Trump abandoned his campaign pledge to eliminate the Export-Import Bank, which has provided billions in loan guarantees to help Boeing’s overseas customers finance plane purchases. The country’s biggest cable and wireless companies, Verizon, Comcast and AT&T, donated more than $2 million combined. In the weeks since, Mr. Trump’s pick for chairman of the Federal Communications Commission, Ajit Pai, has moved quickly to nullify or curtail consumer protection measures, such as “net neutrality” rules, that were established under President Obama over the industry’s objections. Central to the money-raising effort was Thomas Barrack Jr., a private equity investor who is one of Mr. Trump’s closest and oldest friends. It was Mr. Barrack who hosted one of Mr. Trump’s first major fund-raisers at his home in Santa Monica, Calif., last May, and who spoke in Cleveland the night Mr. Trump accepted the Republican nomination. As inaugural chairman, Mr. Barrack was one of Mr. Trump’s chief liaisons to those business executives who had kept him at arm’s length. Contributions to the festivities were not intended to accrue favor with the new president, Mr. Barrack said in a text message, but were made “in support of the coming together of our country and its people to commemorate the cornerstone of our American democratic process.” But the democratic process moves along more quickly for some than for others. While Mr. Trump promised during the campaign to give Medicare and Medicaid the power to negotiate prices they pay for prescription drugs, two of the biggest drugmakers, Pfizer and Amgen, gave a combined $1.5 million in December. Amgen’s chief executive was among the industry executives who attended a February meeting with Mr. Trump. After entering the meeting promising to do something “to get prices down,” Mr. Trump exited with a more industry-friendly line, saying he would oppose “price-fixing by the biggest dog in the market, Medicare.” (A White House spokesman later said Mr. Trump remained in favor of negotiating prices.) Few industries have stood to gain as much under Mr. Trump as private prison operators, and they gave generously to his inauguration. Two of the largest such companies, the Corrections Corporation of America, now known as CoreCivic, and the GEO Group, each contributed $250,000. Since then, the outlook for both companies has greatly improved. In February, Attorney General Jeff Sessions rescinded an Obama-era order that would have phased out the use of such prisons by the Justice Department. And Mr. Trump  directed his administration to prioritize the detention and deportation of unauthorized immigrants, proposing hundreds of millions of dollars for a vast new network of detention facilities like the ones the companies already operate for Immigration and Customs Enforcement. Neither company responded to requests for comment on Wednesday. For many Washington interests and for large donors — particularly those who had not anticipated a Trump victory or had no relationship with his insurgent campaign, or had actively opposed him — Mr. Trump’s inaugural was an easy way to make inroads with the president-elect. The Ansary family, prominent Iranian-Americans in Dallas who are longtime allies of the Bushes, gave $2 million to Mr. Trump’s inauguration. Paul Singer, the billionaire Republican investor who opposed Mr. Trump and once predicted that his policies were “close to a guarantee of a global depression,” donated $1 million on Dec. 6. The two have mended fences recently. In February, Mr. Singer visited Mr. Trump in the Oval Office, and Mr. Trump declared afterward that “now he’s a very strong ally and I appreciate that.” A $900,000 donation came in December from Avenue Ventures, a California-based boutique money management firm founded by the entrepreneur Imaad Zuberi. Mr. Zuberi was a top fund-raiser for President Barack Obama and for Hillary Clinton’s 2016 presidential campaign. Mr. Zuberi was also paid millions of dollars to work in Washington on behalf of the scandal-plagued government of Sri Lanka and its central bank, work he did not initially disclose to the Justice Department as required by federal law, according to a report in Foreign Policy magazine. Mr. Zuberi is now making inroads in Mr. Trump’s circle. After making the donation, he earned a coveted spot at the Chairman’s Global Dinner, a pre-inauguration, black-tie gathering intended to introduce the incoming president to the foreign diplomatic corps. A photo from the event shows Mr. Zuberi in conversation with Mr. Trump and other guests. Mr. Zuberi did not return a phone call seeking comment. Because inaugural committees face few of the regulations that limit campaign fund-raising, each administration sets its own restrictions. George W. Bush, for example, capped gifts at $100,000 for his first inaugural and at $250,000 for his second. Mr. Obama accepted gifts up to only $50,000 in 2009, while banning all gifts from lobbyists and corporations altogether. He loosened those restrictions in 2013, accepting corporate gifts up to $1 million and individual gifts up to $250,000. Mr. Trump set comparatively loose restrictions. He did not limit how much individuals could give, and his team said it would not solicit corporate donations over $1 million Perhaps no donors were granted greater access than the Adelson family. Mr. Trump singled out Mr. Adelson and his wife to thank them for their support during a luncheon honoring congressional Republicans on inauguration eve. The next morning, the pair sat along the aisle just a few rows back from Mr. Trump on the inaugural platform as he took the oath of office. (Mr. Mercer and his daughter, Rebekah, sat some rows farther back.) A representative of Mr. Adelson had no comment. Just what other perks and souvenirs their donations helped pay for will probably remain a mystery. While donations must be reported, the Federal Election Commission does not require inaugural committees to account for what they spend or how much is left in their coffers when the revelers head home. Mr. Trump’s committee said it was still identifying charities toward which it would direct leftover money.",
      "date": "April 19, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "null",
      "url": "https://opinionator.blogs.nytimes.com/2009/10/09/tough-room/?searchResultPosition=17",
      "subtitle": "null",
      "author": "The New York Times Company",
      "content": "",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "null",
      "url": "https://www.nytimes.com/2008/10/29/opinion/29iht-edcohen.3.17346167.html?searchResultPosition=15",
      "subtitle": "null",
      "author": "ROGER COHEN",
      "content": " ",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "null",
      "url": "https://www.nytimes.com/2009/03/21/us/politics/21bailout.html?searchResultPosition=14",
      "subtitle": "null",
      "author": "DAVID M. HERSZENHORN",
      "content": " ",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "null",
      "url": "https://dealbook.nytimes.com/2009/03/23/obama-uneasy-about-tax-on-bonuses/?searchResultPosition=13",
      "subtitle": "null",
      "author": "The New York Times Company",
      "content": "",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Concert for Trump Misses an Opportunity",
      "url": "https://www.nytimes.com/2017/01/19/arts/music/trump-make-america-great-again-concert-review.html?searchResultPosition=12",
      "subtitle": "null",
      "author": "Jon Caramanica",
      "content": " In an interview with CNN on Wednesday night, Thomas Barrack Jr., who heads the Presidential Inaugural Committee, was asked whether Kanye West, who vocally supported Donald J. Trump’s candidacy last year, and who visited him in Trump Tower in December following his victory, would be performing at any of the inaugural events. “We haven’t asked him,” Mr. Barrack replied. Rather than stop there, he continued: “It’s not the venue. The venue we have for entertainment is filled out. It’s perfect. It’s going to be typically and traditionally American.” Following a political season in which quarrels over inclusion and exclusion in the United States — in senses literal, metaphorical and philosophical — were central and heated, the “Make America Great Again! Welcome Celebration” was an opportunity to make a loud case. The stage was a potent one: the National Mall in Washington, just beneath the Lincoln Memorial. The concert was broadcast live on CNN and online. What was presented as “typically and traditionally American,” however, veered between jingoism and vaudevillian fluff and largely ignored the contribution of African-Americans to popular music (which is to say, almost all of popular music). Instead it focused heavily on country and rock by white Southerners, including the country superstar Toby Keith, who has been the nation’s loudest musical cheerleader for a decade and a half; the Mississippi hard-rock band 3 Doors Down, which was a favorite in the early-to-mid 2000s; and the Frontmen of Country, an amalgam of lite-country singers made famous in other bands. It was a spotty lineup, though not a wholly ineffective one. 3 Doors Down’s songs remain sturdy, and the frontman Brad Arnold’s voice was strong, though denuded of its sleazy edges. And Mr. Keith, the headliner, in a heavy overcoat and a scruffy beard, delivered potent patriotism via strong narratives. Mr. Keith isn’t as uncomplicated a choice as he might appear from a distance. In the past, he’s been a registered Democrat, and here, he thanked President Obama for his service before offering a salute to Mr. Trump. Mr. Keith’s career soared after 9/11, when his music took an aggressive turn. At this show, he played the pugnacious and proud “Courtesy of the Red, White and Blue (The Angry American),” and also “American Soldier,” a meditative embrace of patriotic dedication. He also played “Beer for My Horses,” with its not-very-ambivalent endorsement of old-time vigilante justice: “Take all the rope in Texas, find a tall oak tree/Round up all them bad boys, hang them high in the street/For all the people to see.” Mr. Keith’s songs about America are very conscious of place, and at this show, that proved an effective strategy. The Frontmen of Country leaned heavily on songs that mentioned bucolic Southern settings: “God Blessed Texas,” “Amy’s Back in Austin,” “Walking in Memphis.” And Lee Greenwood joined them for “God Bless the U.S.A.,” a dour march of national pride. In total, the concert’s message was that America is a defined geographical and ideological space, with borders worth defending, even at the price of excluding those who could make the place immeasurably more fun. This concert ended up being as notable for who did not show up as for who did. The only featured nonwhite performers were Sam Moore (of the 1960s soul duo Sam & Dave), who sang a restrained “America the Beautiful” backed by an all-black choir, and DJ Ravidrums, who delivered his dim, caffeinated percussive interstitials from inside a spherical theme-park drum kit. But both of those acts got just a couple of minutes. The United States Army Old Guard Fife and Drum Corps got much more time for their two-centuries-old songs. When Mr. Trump first appeared onstage at the show, accompanied by his wife, Melania, it was to the Rolling Stones’s “Heart of Stone,” a song about a man who can’t be swayed. At the end of the concert, Mr. Trump addressed the crowd briefly, thanked the performers, and suggested that hosting this event in front of the Lincoln Memorial might have been an unprecedented choice. That was not true. In 2009, Mr. Obama held a pre-inauguration concert here, “We Are One: The Obama Inaugural Celebration at the Lincoln Memorial.” It included athletes, actors and musicians from across genres — Mary J. Blige singing Bill Withers’s “Lean on Me,” Pete Seeger and Bruce Springsteen singing “This Land Is Your Land,” a song of acceptance and respect for the nation. It was a show of cosmopolitanism and inclusion that portrayed America not as a fixed idea, but as an ever-changing sum.",
      "date": "Jan. 19, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "The danger of an attractive America",
      "url": "https://www.nytimes.com/2009/02/02/opinion/02iht-edlee.1.19863592.html?searchResultPosition=11",
      "subtitle": "null",
      "author": "John Lee",
      "content": " In contrast to the general rush in most parts of the world to congratulate Barack Obama and hail a new era of American leadership, an initially muted response from Beijing followed by an outburst in the state-run China Daily immediately after the inauguration is significant. It suggests that he enthusiasm with which Obama was received in Europe will not be replicated in China, at least not in the Communist leadership. On the contrary, the new president may well fan old Chinese fears, pointing to difficult times ahead in the most important bilateral relationship for the world. The editorial on Jan. 22 in the China Daily, the official English-language newspaper frequently used by Beijing to voice its views to the rest of the world, was extraordinary in its harshness, given the Chinese Communist Party's usual prudence in refraining from public criticism of America. The article began by criticizing President Bush for taking a \"wrecking-ball\" to world affairs. Then, turning to Obama and his vision for America, the paper said \"U.S. leaders have never been shy about talking about their country's ambition. For them, it is a divinely granted destiny no matter what other nations think.\" Obama's \"defense of U.S. interests,\" the article said, \"will inevitably clash with those of other nations.\" Tough editorials in the China Daily, especially about America, are not issued lightly. In many ways, Chinese rulers and policy experts are obsessed with America. In a study of 100 recent articles by leading academics at the Chinese Academy of Social Sciences (CASS), I found that about four in every five were about the United States - understanding the American system and political values, or how to limit, circumvent, bind or reduce American power and influence. Within these themes, several emerged that help better understand the thinking behind articles such as the one in the China Daily. One was that Beijing views international politics in broadly neorealist terms - the distribution of power in the world will determine tomorrow's conflicts. In particular, China clearly sees building competition between itself and America as the defining big-picture strategic play. Beijing believes that tension can be managed, but never resolved, between the established power and the emerging one. Tension is a structural inevitability. Beijing believes that America is currently distracted by its two wars and a weak economy, but that Washington's strategic attention will soon turn eastwards. As one prominent CASS analyst puts it, the \"spearhead will soon be pointed at Beijing.\" Second, the Chinese experts view America as a unique superpower which relentlessly seeks not only to build and maintain its power, but also to spread its democratic values. This is of grave concern to the authoritarian Chinese leaders, because they believes that America will have difficulty accepting a greater leadership role for Beijing so long as Communist Party remains exclusively in power. Senator John McCain's \"League of Democracies\" might never become a formal reality, but Beijing believes that it already exists de facto in U.S. military alliances with Asian countries. Third, Beijing fears the American democratic process. While the West views democracy as an advantage since it can offer United States an institutional and bloodless process for renewal, Beijing views it as a source of irrationality and unpredictability. Many in Beijing believe that the democratic process can cause uncomfortable shifts in policy that might disrupt the best laid plans. This brings us to why Beijing fears Barrack Obama. In Beijing's eyes, President Bush followed an ambitious but reckless foreign policy. In the attempt to extend American power, he sacrificed American influence; his broad \"war on terror\" opened up huge strategic opportunities for China. As America became distracted by war, China made tremendous gains in Asia - undermining America's relationship with allies and partners in the region while putting itself forward as a uniquely \"Asian power.\" In contrast, President Obama could present a difficult challenge for Beijing. Like all presidents since World War II, Obama seeks to continue protecting and extending America's leadership role in the world - which Beijing believes to be to its detriment. But unlike Bush, Beijing believes that Obama better understands the facets of American power and influence - hard power versus soft and \"smart\" power, coercion versus legitimacy, inducements versus persuasion, and the power of example. Scholars at CASS have spent considerable effort trying to analyze understand the advantage the United States gains whenever it produces charismatic leaders such as John Kennedy and Ronald Reagan - and now Obama. In short, Beijing is wary of attractive presidents who may replenish the reserves of U.S. leadership and influence in the world. Moreover, Obama spoke in his inaugural address about defending freedom against authoritarian \"isms,\" whom he relegated to \"the wrong side of history.\" Once that meant the Soviet Union; this time it was China. This is not the message Beijing wants to hear from a new American president. John Lee is a visiting fellow at the Center for Independent Studies in Sydney and the author of \"Will China Fail?\"",
      "date": "Feb. 2, 2009",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "null",
      "url": "https://www.nytimes.com/2009/01/19/us/politics/19talkshow.html?searchResultPosition=10",
      "subtitle": "null",
      "author": "NEIL A. LEWIS",
      "content": " ",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "At Lincoln memorial, uplifting music and a talk of challenges",
      "url": "https://www.nytimes.com/2009/01/19/world/americas/19iht-19talkshow.19473150.html?searchResultPosition=9",
      "subtitle": "null",
      "author": "Neil A. Lewis",
      "content": " WASHINGTON — Framed by the Lincoln Memorial's austere marble and facing a crowd of hundreds of thousands, President-elect Barack Obama on Sunday offered words of high inspiration about his forthcoming presidency that were interlaced with cautions about unrealistic expectations for quick remedies. Two days before he is to take the oath of office at the Capitol, Obama addressed a crowd that began at his feet below Lincoln's statue and stretched far down the Mall to the World War II memorial. The sea of people — scarf-wrapped and stocking-capped, shivering under gray skies and 35-degree temperatures — had poured onto the National Mall on Sunday afternoon to kick off three days of festivities to celebrate the inauguration. \"Only a handful of generations have been asked to confront challenges as serious as the ones we face right now,\" Obama said to the crowd, which had assembled not only to hear him but also such musical stars as Bruce Springsteen, Beyoncé, Garth Brooks and U2. \"Our nation is at war, our economy is in crisis,\" Obama said near the conclusion of the \"We Are One\" concert. \"Millions of Americans are losing their jobs and their homes. They're worried about how they'll afford college for their kids or pay the stack of bills on their kitchen tables. And most of all, they are anxious and uncertain about the future, about whether this generation of Americans will be able to pass on what's best about this country to our children and their children. \"I won't pretend that meeting any one of these challenges will be easy. It will take more than a month or a year, and it will likely take many. Along the way there will be setbacks and false starts and days that test our resolve as a nation.\" Despite the size of those challenges, he declared himself \"as hopeful as ever\" that the nation will thrive. The concert, shown live on HBO, featured a litany of musicians who sang their more inspirational hits, like Stevie Wonder's performance of \"Higher Ground\" with Usher and Shakira. Before singing \"Pride (In the Name of Love),\" U2's tribute to Martin Luther King Jr., the lead singer Bono referred to King's speech during the 1963 March on Washington at the same spot \"43 years ago,\" which he quickly corrected to \"46.\" The Dublin-born singer said Obama's election was an American and Irish dream as well as \"a European dream, an African dream, an Israeli dream.\" After a pause, he added: \"And also a Palestinian dream.\" Obama, sitting off to the side with his family, nodded in time to the music and sang along as the country singer Garth Brooks belted out Don McLean's \"American Pie.\" Springsteen performed \"The Rising\" with a gospel choir, and later returned to sing \"This Land Is Your Land\" with Pete Seeger, the folk singer who is now 89. Other performers included Mary J. Blige, James Taylor, John Legend, John Mellencamp, Josh Groban and Renée Fleming. In addition, such notables as Tom Hanks, Tiger Woods and Latifah paid tribute to former presidents, the military and everyday Americans. Obama's three-day inaugural celebration in the capital began on a somber note Sunday morning at Arlington National Cemetery. Obama, accompanied by Biden, laid a wreath at the Tomb of the Unknowns. Obama laid his hand on his heart as a military bugler's rendition of \"Taps\" played across the Virginia acreage that had once been the family estate of Confederate General Robert Lee. Obama's wife, Michelle, and Biden's wife, Jill, stood nearby. The Biden and Obama families then went their separate ways for Sunday morning church services. At the Nineteenth Street Baptist Church in Washington, the congregation erupted in applause when Barack and Michelle Obama, accompanied by their daughters, Sasha and Malia, walked in and took seats set aside in the second row, the Association Press reported. \"Understand that God has prepared you and God has placed you,\" the pastor, Derrick Harkins, said in his sermon. \"And God will not forsake you.\" On the day before the nation commemorates Martin Luther King Jr., children at the service delivered lines recalling the slain civil rights leader. \"Martin Luther King walked so that Barrack Obama could run,\" said one boy, who was followed by another proclaiming: \"Barack Obama ran so that all children could fly.\" Biden and his family worshipped and received communion at Holy Trinity Roman Catholic Church, the same church President Kennedy attended the morning of Jan. 20, 1961, hours before his inauguration. The congregants on Sunday included Senator Patrick Leahy, a Vermont Democrat who is both a longtime parishioner and Senate colleague of Biden. The priest, the Rev. Larry Madden S.J. did not take explicit note of Biden's presence but when the congregation was asked to welcome visitors, the audience applauded Biden, who stood in acknowledgement, the Associated Press reported.",
      "date": "Jan. 19, 2009",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "null",
      "url": "https://www.nytimes.com/2008/04/01/world/americas/01iht-campaign.4.11593081.html?searchResultPosition=8",
      "subtitle": "null",
      "author": "BRIAN KNOWLTON",
      "content": " ",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Grandiose Ideas for Donald Trump Inaugural Give Way to Traditional",
      "url": "https://www.nytimes.com/2016/12/07/us/politics/trump-inauguration.html?searchResultPosition=7",
      "subtitle": "null",
      "author": "Maggie Haberman",
      "content": "  President-elect Donald J. Trump kicked around ideas for his inauguration in his office at Trump Tower on Tuesday with two of his oldest friends, Mark Burnett and Thomas Barrack Jr. The ideas spilled out from Mr. Burnett, a well-regarded showman best known for producing “The Apprentice”: a parade up Fifth Avenue, a helicopter ride to Washington from New York that could hold the attention of millions of people expected to watch from around the world. Mr. Trump recalled the conversation Wednesday morning to an audience of donors, lobbyists and supporters at Cipriani 42nd Street during a fund-raiser to help support his transition operation. The details offered a brief glimmer of a sprawling inauguration, full of the kind of showmanship for which Mr. Trump is famous, that could shake up what has become a relatively predictable affair for recent presidents. According to some of the people overseeing the events surrounding Mr. Trump’s swearing-in as the 45th president, they also bore little resemblance to reality. In fact, they said, Mr. Trump’s celebration would be a relatively subdued affair — marked by Mr. Trump’s own touches, to be sure, but in the mold of past affairs. “It’s going the opposite way,” Mr. Barrack, the private equity investor who is leading the presidential inaugural committee, said in an interview. “The president-elect wants this to be simple. He wants this to be about the people.” “It’s not about putting on the most expensive talent and spending that kind of money to ingratiate himself,” Mr. Barrack added. In many ways, the discussion between the three men in Mr. Trump’s office tower encapsulates the dueling impulses of the president-elect, a man who enjoys being at the center of attention, but who is also aware that he was elected on a strong populist message of “draining the swamp” of Washington cronyism and extravagance. In reality, Mr. Trump’s festivities are constrained by security concerns surrounding the modern presidency, making some gaudier displays impossible and other far-flung ones unrealistic. Each event under consideration must be vetted by the overlapping agencies responsible for securing the transfer of power, including the Secret Service, responsible for a president’s security, and the National Park Service, which controls the Mall in Washington. “You have five gigantic security groups that dictate what can and can’t be done,” Mr. Barrack said. For example, Mr. Barrack said that hopes to open the White House to visitors, as Andrew Jackson did during his 1829 “People’s Inauguration” (and as other presidents did afterward), had simply proven unrealistic. “Unfortunately, security concerns are different than they were in 1829,” he said. Despite the modest nature of the events under consideration, Mr. Barrack said Mr. Burnett was actively involved in producing the inauguration week festivities. He will have a large team to work with, as the committee’s staff in Washington is expected to swell to more than 300 people by Inauguration Day. “Mark is a genius, and the president-elect loves him,” Mr. Barrack said. Referring to the Tuesday meeting, he said, “This was about throwing stuff out if you are thinking in the frame of mind of what a global audience would see.” A schedule of inaugural festivities is expected to be completed by Monday. But after the committee rolled out a series of donor packages last week aimed at enticing wealthy contributors and corporations to open their checkbooks, a rough outline of the week has begun to emerge. It will include an opening “victory reception” for donors, as well as a series of more personal events with the incoming first family, Vice President-elect Mike Pence and members of Mr. Trump’s cabinet. Donors will be invited to candlelight dinners on the eve of the inauguration, and some will be able to attend one of two official balls planned for inauguration night. Whatever Mr. Trump and the committee ultimately decide, there likely will be plenty of resources at their disposal. Mr. Trump’s fund-raising team has already secured roughly $50 million in pledged donations since it began soliciting money in earnest last week, according to two people involved in the effort. The early success puts Mr. Trump in line to easily surpass President Obama’s 2009 inauguration, when his finance team raised a record $53 million to pay for the festivities. He should also easily meet or surpass the $65 million to $75 million fund-raising goal set by the committee. The event at Cipriani on Wednesday was a sold-out affair, featuring some donors who had vehemently rejected Mr. Trump’s candidacy, such as the hedge fund billionaire Paul Singer, according to an attendee. Those raising money to support the inauguration said they have seen a similar pattern, securing early pledges from prominent Republican donors who did not support Mr. Trump during the campaign. Corporations, they said, have also been forthcoming. Yet, if Mr. Trump is looking forward to his presidency, he has not yet left the past behind, as was clear Wednesday morning. Another person at the fund-raiser said Mr. Trump delivered a kind of greatest-hits recollection of winning the primaries and his grim odds for the White House. Mr. Trump said that heading into Election Day, he and his wife, Melania, had planned a vacation in the expectation that they would be seeing an early night. He recalled Mr. Obama telling him privately that the president’s advisers had told him on election night, as the numbers looked grim, that North Carolina would be a firewall for Hillary Clinton, the Democratic nominee. The attendance at the fund-raiser spoke to Mr. Trump’s change of fortune since becoming president-elect. There were at least 850 people in the restaurant. Mr. Trump singled out those in attendance who had been part of the “Never Trump” movement, drawing a large laugh.",
      "date": "Dec. 7, 2016",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Trump to Accept Inauguration Funds From Corporations and Big Donors",
      "url": "https://www.nytimes.com/2016/11/23/us/politics/trump-inaugural-donors.html?searchResultPosition=6",
      "subtitle": "null",
      "author": "Nicholas Fandos",
      "content": " WASHINGTON — President-elect Donald J. Trump will allow corporations and wealthy individuals to make large donations to fund the activities surrounding his inauguration, complicating his promise to eliminate special interests from influencing his government. Mr. Trump plans to ban money from registered lobbyists, whom he has purged from his transition team and barred from working for his administration. But the restrictions will be lighter on corporations and individuals — the groups that have traditionally provided a vast majority of funding for the festivities surrounding the transfer of power. The restrictions, which members of the Presidential Inaugural Committee cautioned have yet to be finalized, represent a continued march back from standards set in 2009, when President-elect Barack Obama banned gifts from lobbyists, political action committees and corporations, and put a cap of $50,000 on individuals. Mr. Obama relaxed his own rules in 2012, after what was then the most expensive presidential campaign in history had depleted his donor base, lifting the ban on corporate gifts and restrictions on the size of those from individuals. Mr. Trump, who like Mr. Obama campaigned on reducing the influence of money in politics, appears poised to relax them further. Officials planning the inauguration said Mr. Trump would solicit corporate donations up to $1 million and allow money to be transferred from political action committees on a case-by-case basis. The inaugural committee has not reached a decision on where to cap gifts from individuals, if at all. All told, Mr. Trump hopes to raise roughly $65 million to $75 million to fund the parade, balls and other festivities surrounding his swearing-in as president, according to several people involved in the planning efforts. Such a fund-raising total, if it materializes, would easily surpass the $43 million Mr. Obama’s team raised for his 2013 inauguration and the $53 million, a record, that it raised for his first inauguration in 2009. Thomas Barrack Jr., a private equity investor who is heading the committee responsible for planning the events surrounding Mr. Trump’s inauguration on Jan. 20, said the decision to limit donations from certain groups was “in line with the president-elect’s thoughts on ethics reform.” But campaign finance experts said the restrictions left much to be desired, targeting groups that traditionally provide little funding for the occasion while seemingly letting bigger donors — including corporate interests that Mr. Trump took aim at on the campaign trail — off the hook. “For the most part, they are illusory, because they are restricting money that doesn’t really play any significant role in funding the inauguration,” said Fred Wertheimer, a longtime advocate of campaign finance overhaul, referring to the restrictions on lobbyists and foreign interests. The corporate and individual money that does traditionally play a significant role, he added, would be allowed to flow more or less unabated, leaving the potential of undue influence in place. “You can’t have a more ideal opportunity to buy influence and ingratiate yourself with a new administration than by giving a huge contribution to pay for their inauguration,” Mr. Wertheimer said. Bob Biersack, a senior fellow at the Center for Responsive Politics, was more forgiving toward Mr. Trump, but he said it would take a fundamental change in the way inaugurations were funded to meaningfully root out special interests. “I don’t find it fundamentally inconsistent with what he is saying,” he said. “I just think the rhetoric and the reality are different.” Presidential transition committees, which coordinate and finance most of the festivities that surround the federally funded swearing-in ceremony, face few of the fund-raising restrictions campaigns do, and their practices vary from president to president. President George W. Bush did not restrict who could support his inaugural festivities, but he put caps on gifts. The committee is still in the early stages of assembling what will be an operation employing hundreds of people responsible for planning dozens of events. As of Wednesday morning, the fund-raising packages that are typically used to solicit donations were still being vetted by lawyers, and subcommittees were still taking shape to handle issues like security and entertainment. “It’s like putting on the Olympics in 61 days,” Mr. Barrack said, adding that the committee was racing to finalize plans by the end of the week. Two people working with the committee said it planned to roll out tiered giving packages next week, most likely ranging from $25,000 to $1 million, that will reward donors with progressively more access to more intimate events with Mr. Trump and his team. The committee is planning to hold two official balls, according to two people involved in the planning. By comparison, Mr. Obama attended 10 official balls in 2009. Mr. Trump is not expected to donate to the festivities himself, as he did to the campaign, according to members of the committee, who spoke on the condition of anonymity to discuss plans that had not been finalized. Sara Armstrong, a longtime Republican National Committee official who helped plan the Republican National Convention in Cleveland this summer, has been appointed chief executive and is leading the team that Mr. Barrack said would eventually total 350 people out of an office building just off the National Mall. As of Wednesday, the committee had hired about 100 people, he said. The committee includes generous donors to Mr. Trump’s campaign, like Woody Johnson, the owner of the New York Jets; Gail Icahn, the wife of the investor Carl Icahn; and the casino magnate Sheldon Adelson and his wife, Miriam. Several stalwart backers of Republican causes, like Stephen A. Wynn and Lewis M. Eisenberg, are on the committee, as is Brian Ballard, Mr. Trump’s longtime Florida lobbyist. The overall cost of the inauguration and related festivities is likely to run to as much as $200 million. Most of that burden will fall on taxpayers, though, who fund everything from security to the swearing-in ceremony and inaugural luncheon organized by a joint committee of Congress. Mr. Trump’s team said it was expecting two million to three million people to flood Washington for the ceremony, a crowd that could surpass the 1.8 million estimated to have been on hand for Mr. Obama’s first inauguration, which was a record. Planners are also expecting more protesters than usual around the event. Mr. Barrack said Mr. Trump had instructed him to plan events tailored to the political moment. “It’s one of the greatest opportunities that this president has to put his fingerprints on bridging the divide,” Mr. Barrack said on Wednesday. Mike Litterst, a spokesman for the National Park Service, which controls the Mall and other public spaces where the inauguration will take place, said on Monday that the Park Service did not expect to meet with officials from the group until after Thanksgiving. But across Washington, the physical preparations for Jan. 20 are well underway, even as the city’s political establishment is struggling to come to terms with the election outcome. Capitol architects have been hammering away since September on the more than 10,000-square-foot inaugural platform overlooking the Mall. And outside the White House, Park Service staff members are at work on the presidential reviewing stand where Mr. Trump will review his inaugural parade.",
      "date": "Nov. 23, 2016",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Obama Awards His Last Presidential Medals of Freedom",
      "url": "https://www.nytimes.com/2016/11/22/us/politics/presidential-medal-freedom-springsteen-jordan-degeneres.html?searchResultPosition=5",
      "subtitle": "null",
      "author": "Gardiner Harris",
      "content": " WASHINGTON — President Obama gave the Presidential Medal of Freedom, the nation’s highest civilian honor, to 21 artists, sports figures, scientists and philanthropists on Tuesday in a bravura performance that had the East Wing, stuffed to capacity, laughing and whooping with appreciation. “Everyone on this stage has touched me in a powerful personal way,” Mr. Obama said at the ceremony’s end. “These are folks who have helped make me who I am and think about my presidency.” Mr. Obama has given more Presidential Medals of Freedom than any previous president, and the surprising announcement last week that he would induct one last class — he held a similar ceremony two months ago — reflected his obvious joy in lauding his personal heroes, and the awareness that many of them would probably never receive such an honor from his successor. Many of the awardees have praised Democrats or been sharply critical of President-elect Donald J. Trump. Among the honorees were Robert Redford, Bill and Melinda Gates, Tom Hanks and Diana Ross. When he put the medal around the neck of Michael Jordan, Mr. Obama, an avid basketball fan, beamed like a 10-year-old. “It’s useful, when you think about this incredible collection of people, to realize this is what makes us the greatest nation on earth,” he said in a not-so-subtle dig at Mr. Trump’s promise to “make America great again.” “Not because of our differences, but because in our differences we find something in common to share. And what a glorious gift that is.” The president’s opening speech was poignant, revealing and at times hilarious. In a tribute to Ellen DeGeneres, for instance, he spoke with emotion about the courage Ms. DeGeneres had needed to tell a national audience that she is gay. “But it’s like Ellen says, ‘We all want a tortilla chip to support the weight of guacamole,’” Mr. Obama said, seemingly out of nowhere, as Ms. DeGeneres nodded behind him and the audience laughed. “Which really makes no sense to me. But I wanted to break the mood, because I was getting choked up.” He took a dig at Mr. Jordan, the basketball star, by calling him “the guy from ‘Space Jam,’” a 1996 film with Bugs Bunny. A tall man, Mr. Obama had such trouble reaching up to put the award around the towering Kareem Abdul-Jabbar’s neck that the basketball great leaned back to help. Pardons, commutations, Medals of Honor and other presidential gifts usually have a formalized process, with layers of staff review before the final list of grantees is chosen. But the Presidential Medal of Freedom has often been bestowed via a quirky and haphazard review that reflects the personality of the president. And that has been particularly true in this administration. The recipients paraded up to the podium area Tuesday after they were announced by a White House aide who managed to mispronounce the names of Mr. Redford, Bruce Springsteen and Cicely Tyson. When he spoke, Mr. Obama began his list of awardees with the world’s richest couple, Bill and Melinda Gates. “First, we came close to missing out on Bill and Melinda Gates’s incredible partnership,” he said, deadpan. “Because apparently Bill’s opening line was, ‘Do you want to go out two weeks from this coming Saturday?’ I mean, he’s good with computers, you know?” he said to laughter. “Fortunately, Melinda believes in second chances, and the world is better for it.” Mr. Gates has donated nearly $40 billion to charity and, with a similar donation from Warren Buffett, now runs by far the world’s largest charitable endeavor, which spends hundreds of millions of dollars in India and Africa to save children’s lives. The couple have also invested in and shared some of the Obama administration’s most important priorities, including its education and climate initiatives. When he turned to the actor Robert De Niro, Mr. Obama said his “characters are iconic.” “A Sicilian father turned New York mobster. A mobster who runs a casino. A mobster who needs therapy. A father-in-law who’s scarier than a mobster. Al Capone, a mobster,” he said to growing laughter as Mr. De Niro gave his characteristic tough-guy frown behind him. Mr. Obama’s tribute to Vin Scully, the legendary play-by-play baseball broadcaster, noted that Mr. Scully’s career started at the same time as Jackie Robinson’s. “In fact, I thought about him doing all these citations, which would have been very cool,” Mr. Obama said. “But I thought we shouldn’t make him sing for his supper like that.” “Up next …,” Mr. Obama said, mimicking Mr. Scully. In the case of Mr. Jordan, Mr. Obama overcame some testy exchanges. In 2014, Mr. Jordan criticized the president’s golf game and called him a “hack” on the green. Mr. Obama responded that Mr. Jordan, a golfer himself, should focus his attention on the perennially struggling Charlotte Hornets, which he co-owns. Then there was the incident involving a basketball poster that Mr. Jordan signed “To Barrack,” misspelling the president’s name. But Mr. Obama was in Chicago when Mr. Jordan was making magic on a basketball court there, and the president has never forgotten it. “There’s a reason you call somebody ‘the Michael Jordan of,’” he said. “The Michael Jordan of neurosurgery, or the Michael Jordan of rabbis, or the Michael Jordan of outrigger canoeing. They know what you’re talking about.” Mr. Springsteen has been a frequent presence in the Obama White House, hosting fund-raisers and even traveling on Air Force One during Mr. Obama’s re-election campaign in 2012, wowing star-struck staff members. Lorne Michaels, the creator and longtime producer of “Saturday Night Live,” was also a recipient, an honor he would be unlikely to get in a Trump administration. On Sunday, Mr. Trump said on Twitter that he had watched “Saturday Night Live” the evening before and wrote: “It is a totally one-sided, biased show — nothing funny at all. Equal time for us?” Mr. Hanks and his wife are large donors to Mr. Obama and other Democrats, and he took part in a dinner discussion in February about the future of Mr. Obama’s foundation and library. And Mr. Abdul-Jabbar spoke at the Democratic National Convention, when he slammed Mr. Trump for his proposals to bar Muslim immigrants and introduced himself as Michael Jordan, “because I know that Donald Trump couldn’t tell the difference.”",
      "date": "Nov. 22, 2016",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "null",
      "url": "https://schott.blogs.nytimes.com/2009/01/28/oaf-of-office/?searchResultPosition=4",
      "subtitle": "null",
      "author": "The New York Times Company",
      "content": "",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "null",
      "url": "https://thecaucus.blogs.nytimes.com/2006/11/29/obama-drafters-need-spell-check/?searchResultPosition=1",
      "subtitle": "null",
      "author": "The New York Times Company",
      "content": "",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    }
  ]
}