{
  "articles": [
    {
      "title": "Donald Trump Jr. Tells Senate Panel He Hasn’t Lied",
      "url": "https://www.nytimes.com/2019/06/12/us/politics/donald-trump-jr-russia-senate.html?searchResultPosition=30",
      "subtitle": "null",
      "author": "Nicholas Fandos",
      "content": "  WASHINGTON — Donald Trump Jr. told Senate investigators on Wednesday that he did not inform his father at the time about a June 2016 meeting with a Russian lawyer promising “dirt” on Hillary Clinton and that he was not kept abreast of negotiations over a proposed real estate project in Moscow, a person familiar with his testimony said. The younger Mr. Trump, in roughly three hours of closed-door questioning in front of the Senate Intelligence Committee, said that he had nothing to correct from past statements that he had given that panel and other congressional bodies — despite claims by former Trump aides to the contrary. Questioning appeared to focus on two of the most scrutinized issues of the 2016 presidential campaign: a meeting in Trump Tower in Manhattan between top Trump campaign officials and a Russian emissary, and the extensive efforts of the Trump Organization to secure a major development in Moscow even as Donald J. Trump was running for president. “I don’t think I changed anything of what I said because there was nothing to change,” Donald Trump Jr. told reporters as he emerged from the session. In the hearing room, where senators have been studying the Trump campaign’s ties to Russia’s election influence efforts, the younger Mr. Trump tried to undermine the two witnesses who had questioned his account, according to the person familiar with his remarks, who spoke on the condition of anonymity to discuss the private session. He said that those witnesses — Michael D. Cohen, his father’s former personal lawyer, and Rick Gates, a deputy campaign chairman — had both been indicted by the special counsel, Robert S. Mueller III. Details of the testimony were first reported by CNN. Mr. Cohen told lawmakers in a public hearing this year that he believed that he had seen the younger Mr. Trump quietly alert his father to the meeting with the Russian lawyer, Natalia V. Veselnitskaya, in 2016 — an action that would have undercut the president’s claims to ignorance of the meeting. Mr. Cohen told investigators that he personally briefed members of the Trump family on the Moscow project “approximately 10” times during the campaign. And Mr. Gates told Mr. Mueller’s investigators that he remembered a campaign meeting in which the younger Mr. Trump mentioned the offer of Russian assistance against Mrs. Clinton. On the other side of the Capitol, the Democrat-led House Intelligence Committee was trying to get its investigation off the ground, as members grappled with what actions — including possible impeachment — ought to follow the release of the special counsel’s report. Democrats used their first hearing on the Russian interference detailed in Mr. Mueller’s 448-page report to publicize details of what the special counsel called Russia’s “multiple, systematic efforts to interfere in our election.” Mr. Mueller concluded there was not enough evidence to charge anyone on the Trump campaign with conspiring with the Russians, but his investigation suggested that Mr. Trump was elected with the assistance of a foreign power and noted more than 100 meetings between his advisers and Russians. “Of all the questions that Mueller helped resolve, he left many critical questions unanswered,” said Representative Adam B. Schiff of California, the committee’s chairman. Mr. Schiff said that the committee, which oversees American intelligence agencies, had not been briefed on the status of a counterintelligence inquiry into whether Russia has compromised Mr. Trump or his associates, despite repeated requests. Mr. Schiff said later he was “running out of patience” and could soon issue a subpoena to force law enforcement officials to brief lawmakers. Committee Republicans, dismissing Mr. Mueller’s report as a “shoddy political hit piece,” said the Russian threat had little to do with Mr. Trump and charged anew that biased officials within the F.B.I., State Department and other government agencies had conspired with Democrats to tarnish Mr. Trump’s candidacy and presidency. “The entire scheme has now imploded and the collusion accusation has been exposed as a hoax,” said Representative Devin Nunes of California, the panel’s top Republican. The contrast highlighted the Democrats’ dilemma as they searched for ways to engage the public with Mr. Mueller’s findings. The House Judiciary Committee held a similar hearing on Monday that focused on Mr. Mueller’s obstruction of justice investigation but lacked testimony from anyone involved in the case. With the White House blocking key witnesses and government officials who may have aided Mr. Mueller’s investigators, Democrats were left to question three former government officials who could only speculate on the investigation. “Understand that I have no access to supporting information or investigative detail other than what is provided in the special counsel’s report,” said Stephanie Douglas, a former high-level national security official at the F.B.I. Ms. Douglas and Robert Anderson, a former F.B.I. official with experience in spying cases, said the report had clearly found troubling and potentially compromising behavior by the younger Mr. Trump; Paul Manafort, the former campaign chairman; Michael T. Flynn, a former national security adviser; and others. “If you are a foreign power and you have a campaign or individuals who are willing to entertain receiving information that you are collecting for their benefit,” Ms. Douglas said, “I think that is a tacit approval of that action.” Mr. Anderson said Mr. Mueller’s report showed “absolute classic tradecraft of Russia and Russian intelligence services.”",
      "date": "June 12, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Why Andrew Yang Matters",
      "url": "https://www.nytimes.com/2019/06/13/opinion/andrew-yang-2020.html?searchResultPosition=29",
      "subtitle": "An interview with the policy-focused dark horse candidate.",
      "author": "David Leonhardt",
      "content": " This article is part of David Leonhardt’s newsletter. You can sign up here to receive it each weekday. In the 2008 Democratic presidential primary, the three leading candidates — Hillary Clinton, John Edwards and Barack Obama — spent months fighting over health care policy. That long debate helped to educate voters. It also helped the candidates and their aides better understand the thorny politics of health care, which in turn made it easier for Obama and Congress to pass a sweeping health care law after he became president. In the 2016 Democratic primary, Bernie Sanders laid out a highly progressive set of policies, including a $15 minimum wage and Medicare for All. He didn’t win the nomination, but he did shape the Democratic Party’s agenda.  The 2020 campaign is now only a couple of weeks away from its first Democratic debates, on June 26 and 27, in Miami. So it’s the right time for candidates to begin rolling out their policy platforms. And none of them, not even the famously substantive Elizabeth Warren, has released more plans than Andrew Yang. Yang is a former technology entrepreneur who has attracted more than 100,000 individual donors — enough to qualify him for inclusion in the first debates — in large part because of his detailed platform. His website includes more than 100 proposals. Many of them revolve around Yang’s view that the American economy no longer works for the majority of people. He has proposed a universal basic income — $1,000 monthly checks for all adults — as well as more affordable college, a financial-transaction tax and rebuilding infrastructure. He has dozens of smaller ideas, too: free marriage counseling; more funding for autism; a ban on airlines removing passengers when they overbook flights; the return of congressional earmarks; and the extension of Daylight Saving Time to the entire year. He’s also come out in favor of several ideas that regular newsletter readers will recognize: Supreme Court term limits, ranked-choice voting and statehood for Washington and Puerto Rico. Obviously, Yang is not likely to win the Democratic nomination. He’s never held any elective office. But I’m glad his substance-laden campaign has gotten some attention, and I hope the rest of the Democratic field — beyond him and Warren — start to release more meaty plans. Policy ideas may not determine the winner of a presidential campaign, but they can end up mattering a great deal in the long run. For more on Yang, listen to this week’s episode of “The Argument” podcast. My colleague Ross Douthat interviews Yang, and Ross, Michelle Goldberg and I talk about what we like and don’t like about the Yang agenda. Elsewhere Bloomberg’s Jonathan Bernstein on President Trump’s comments welcoming foreign interference in American elections: “He’s the country’s commander in chief and top diplomat, and as such responsible for making clear to all foreign nations and other groups that messing with the internal affairs of the United States will have serious consequences. Instead, he’s basically inviting everyone in.” It was, Bernstein wrote, “a helpful reminder … that he’s entirely unfit for the office he holds.” ",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Hillary Clinton, in Graduation Speech, Calls for Renewed Focus on Russian Interference",
      "url": "https://www.nytimes.com/2019/05/29/us/politics/hillary-clinton-graduation-speech.html?searchResultPosition=28",
      "subtitle": "null",
      "author": "Matt Stevens",
      "content": " Hours after Robert S. Mueller III, the special counsel, broke his silence and said that Russia had sought to damage Hillary Clinton’s presidential campaign, Mrs. Clinton said that the “systemic efforts to interfere” in the 2016 election “deserves the attention of every American.” Mrs. Clinton made the remarks as part of a commencement address on Wednesday afternoon to more than 2,400 Hunter College students inside New York City’s Madison Square Garden. Amid a sea of purple caps and gowns, she also leveled fresh criticism at the Trump administration for what she said was its “complete refusal to condemn a foreign power who attacked our democracy” and its failure to protect the country’s voting systems against future attacks. “It seems absolutely clear that we’ve got to deal with what has been investigated and reported,” she said. Earlier in the day, Mr. Mueller held a 10-minute news conference — his first public characterization of the investigation since it began more than two years ago — in which he discussed central elements of his report, including the decision to not explicitly clear President Trump of obstruction of justice. He reiterated allegations previously laid out in an indictment that Russian intelligence officers had “used sophisticated cybertechniques to hack into computers and networks used by the Clinton campaign,” and that their release of that information was “designed and timed to interfere with our election” and to “damage” Mrs. Clinton. Mrs. Clinton also used part of her 30-minute commencement speech to criticize what she called “the big social media platforms,” which she said “know their systems are being manipulated by foreign and domestic actors to sow division, promote extremism and spread misinformation.” “But they won’t get serious about cleaning up their platforms unless consumers demand it,” she told the graduates. She specifically rebuked Facebook for its refusal to remove altered videos of Speaker Nancy Pelosi, which first appeared online last week and spread widely. In one of the edited videos, Ms. Pelosi’s speech was slowed down and slurred, making her appear drunk. Ms. Pelosi herself sharply criticized Facebook earlier on Wednesday, telling a public radio station in Northern California that the company’s refusal to take down altered videos of her demonstrated how the social network contributed to misinformation. “It wasn’t even a close call,” Mrs. Clinton said of Facebook’s decision not to remove the content. “The video is sexist trash.” Mrs. Clinton’s comments come four weeks after she sharply criticized Attorney General William P. Barr, President Trump, members of the Republican Party and some findings of the Mueller report in a wide-ranging interview on “The Rachel Maddow Show.” She has also recently appeared in a comedy sketch in which she performed a dramatic reading of the Mueller report, and has spoken out on Twitter about the recent state abortion bans. On Wednesday, she continued to obliquely attack the Trump administration, saying, “We are witnessing an assault on the rule of law and the foundations of our democracy,” and that democracy “feels far from secure.” But she sought to keep the mood mostly uplifting and occasionally light. Mrs. Clinton opened her remarks by thanking the Hunter College president, Jennifer J. Raab. “Madam President — that has a nice ring to it,” she said, to laughs and cheers. Then she mentioned that last year’s commencement speaker was the actor Vin Diesel. “We’re going to star in a movie together,” she said. “It’s called ‘The Fast and the Still Really Furious.’”",
      "date": "May 29, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "What We Learned From Trump’s Orlando Rally",
      "url": "https://www.nytimes.com/2019/06/18/us/politics/trump-rally.html?searchResultPosition=27",
      "subtitle": "null",
      "author": "Maggie Haberman",
      "content": "  ORLANDO, Fla. — President Trump kicked off his 2020 re-election campaign on Tuesday night in Orlando. Here are eight takeaways. Despite weeks of hype from the president and his campaign, the official kickoff rally for a re-election campaign that he has been running since the day he took office was, in the end, just another rally. Mr. Trump had no new campaign message to unveil. He had no new theory of the case to mount against any of his potential opponents. He instead spent much of his time relitigating his outrage against Hillary Clinton’s email server, promising that he would build a wall that was “stronger, bigger, better and cheaper” and talking about the “Russia hoax.” When Mr. Trump seemed to sense that the crowd’s energy was sagging, he quickly started polling attendees about what campaign slogan he should use. Mr. Trump’s portrait of the state of the country was bleak. Democrats, he said, are trying to undo his election and “rip” the Constitution apart. The infamous “swamp” of Washington that he promised to drain is still there, he said, seeping back into the foundations of the capital. And socialism is a threat at the gates. Fear is a powerful motivator in all things, but particularly politics, and the president has deployed it with abandon over the last four years. This rally was no exception as he spoke of immigrants pouring over the border, the danger of gangs and jobs under threat from competition overseas. The Trump campaign rented buses across Florida to bring in supporters. The result was a packed 20,000-seat arena, with an overflow audience outside. The president’s aides pointed out that the numbers were a contrast with those of most Democrats in the field. A campaign spokesman, Tim Murtaugh, said the campaign didn’t rent buses other than shuttles for donors from a hotel to the arena. Numbers have been Mr. Trump’s calling card throughout his career, and his rallies in 2016 put him on the map as a contender in a packed Republican primary race. He proved on Tuesday night that he can still draw a Beyoncé-size crowd in a state he won three years ago. But the crowd began to thin out before Mr. Trump was finished speaking, leaving patches of blue seats in the sea of red caps. Mr. Trump’s campaign is building for him a traditional apparatus when it comes to its fund-raising and digital operations. But when it comes to the message of the re-election campaign, his aides are leaving it all up to him. The question is whether he can still set the agenda the way he did in 2016, when every candidate felt compelled to respond to his outlandish remarks. It was not clear whether he still can do that. He said little new in his remarks Tuesday night, and CNN broke away from him shortly after he began. Mr. Trump has always thrived on an ability to shock, but he might have fewer tricks this time around. Mr. Trump turned to familiar turns of phrase by telling his supporters that he was fighting on their behalf, giving them a sense of ownership over his election. He described them as part of a movement that helped sweep him into office and helped “restore” power to voters in 2016. But he was at his most specific when he described efforts to investigate him as a way to undermine his voters. “They are really going after you,” Mr. Trump said of efforts in the Democrat-led House to investigate his finances and allegations of malfeasance in his administration. In one of his most poignant moments, he said that when he walked into the White House for the first time, “I have never forgotten who sent me there.” And he told attendees that their collective “political opponents” looked on their values “with hatred.” The president has a front-runner in former Vice President Joseph R. Biden Jr. and more than 20 other candidates in the Democratic primary race whom he could target as foils. But he made clear in the first 11 minutes of his kickoff rally that the news media would be his main target for the next 17 months. “The fake news” was a phrase that he uttered at least four times in those minutes, pointing to journalists and egging on the boos and jeers of his supporters. The news media, in Mr. Trump’s telling, is denying him credit he is due. The news media, in Mr. Trump’s telling, is helping spread the “Russian hoax,” which is what he has called the investigation by the special counsel, Robert S. Mueller III, into Russian interference in the election and whether the Trump campaign was involved. The overarching theme? Mr. Trump has been mistreated. Mr. Trump’s victory in Florida in November 2016 was a piece of the puzzle in beating Mrs. Clinton, and his campaign is aware of the need for a show of strength in the state. So is Mr. Trump, who in his remarks described it as his “second home” where he owns a private resort, Mar-a-Lago, and a golf club. The state is notoriously hard to poll and elections in Florida are always close, as anyone who recalls the 2000 presidential race can confirm. Mr. Trump is mindful that he needs to be in the state early and often. For now he’ll take Hillary. He mentioned Mrs. Clinton by name more than half a dozen times before at least one mention each of two leading Democratic contenders in this cycle, Mr. Biden and Senator Bernie Sanders of Vermont. Mr. Trump has been telling aides he wants to run against Mr. Biden because it is a race he recognizes. He views Mr. Biden as a male version of Mrs. Clinton — a centrist candidate who will allow him to run again as an outsider. But if his opponent is Mr. Sanders or Senator Elizabeth Warren, the president’s aides expect the race to play out along ideological lines, with Mr. Trump railing against socialism. But without a clear opponent, Mr. Trump seemed content on Tuesday to hold up the specter of Mrs. Clinton. He talked about her deleted emails from the private server she used while she was the secretary of state. He suggested he would have been sent to the “electric chair” had he done the same thing. And he recalled how she denigrated his supporters as “deplorables.”",
      "date": "June 18, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "To Back Warren Is to Treat Politics as a Matter of Substance",
      "url": "https://www.nytimes.com/2019/06/27/opinion/elizabeth-warren-democratic-debate.html?searchResultPosition=26",
      "subtitle": "Detailed plans can tell a candidate’s story about what kind of person she is — and what kind of president she would be.",
      "author": "Mark Schmitt",
      "content": " There are plenty of good arguments against running a presidential campaign the way Senator Elizabeth Warren is doing it, with a heavy emphasis on detailed policy proposals. It’s not just that most voters can’t absorb all the details, though we probably can’t, and may not even really care about them. It’s also hard work, and in the frenzy of a campaign there are dozens more pressing demands for staff time and money. And it’s all too easy to make a small mistake in a policy detail that offends a key constituency or potential ally. But so far, Ms. Warren’s “I’ve got a plan for that” campaign seems to have been worth it — at least in the sense that it has elevated her into the top tier of candidates in very early polls and nudged other candidates to get more serious and ambitious about their own policy proposals. For Ms. Warren’s supporters, it’s a point of pride: To back her is to treat politics as a matter of substance, to see beyond the shiny personal story and youthful charisma of candidates such as Pete Buttigieg or Beto O’Rourke, whom even a supporter recently described as “a blank slate that is waiting to be filled by our dreams and aspirations.” But Ms. Warren is of course a personality, too, not just the human face on a binder of policy papers. The policy documents are the personality. What’s in them matters less than the fact that she cares enough to produce them, and the story they tell about who she is, how she made her way from Oklahoma, the University of Houston and early parenthood to Harvard Law School, the creation of the Consumer Financial Protection Agency and the Senate — and how she would operate as president. The story her proposals tell is not just one of diligence, but also an ability to identify forces that don’t get much attention, don’t appear on polls and don’t have well-organized constituencies, but matter in people’s lives. In the mid-2000s, as a law professor, she sounded the alarm about proposed changes to bankruptcy rules, an issue on which there was almost no organized opposition to the interests of banks and credit card companies. That methodology is central to her identity. And that’s appropriate. We don’t elect presidents just to execute plans; we elect human beings, expecting them to deal with global crises and economic twists we can’t yet foresee. For some, like Barack Obama, it’s inspiring, inclusive rhetoric that convinces us to trust them in that position; for others, it’s a personal story, such as military service. In the case of Donald Trump, to reach beyond his angriest core of supporters, it was the idea that he’d been so successful in business that he could do better than the “very stupid people” in Washington. But policy plans and positions can serve the same purpose, showing that a candidate is prepared for challenges, able to absorb a huge amount of information and opposing views, and make decisive choices — the very thing a president does in a crisis. There are other good examples of candidates using plans and issue positions to tell a story about themselves: When John McCain made campaign-finance reform a centerpiece of his 2000 and 2008 campaigns, it wasn’t because voters, particularly Republican primary voters, cared so much about the issue, in that pre-Citizens United era. The issue told the right story about Mr. McCain: a maverick willing to challenge leadership and lobbyists of his own party. Someone, furthermore, who had learned from his entanglement in the late-1980s Keating Five scandal (in which a group of senators were exposed for interceding with bank regulators on behalf of a donor). And someone willing to form cross-partisan alliances to get things done. For others, especially in a wide-open field like the current Democrats, the policy positions they take are really markers of their political positioning: Will they be confrontational, proposing ambitious policies that no Republicans will support, or accommodating, as with some of the less controversial ideas in Senator Amy Klobuchar’s 137-point plan for her first hundred days? There are still risks to a policy-heavy candidacy. Every detail is a choice, and every choice is a potential vulnerability. In 2007, for example, Mr. Obama chose not to include an individual mandate to purchase health insurance in his health reform proposal, arguing that people wanted to be insured and so didn’t need to be compelled. Hillary Clinton assailed him for weeks over the 15 million people she said his plan would leave out as a result. Too many plans can also hinder a campaign’s effort to send a clear and coherent message, as was probably the case for Mrs. Clinton’ in 2016. Candidates can avoid that by embracing an ideological label that unites all their plans, as Senator Bernie Sanders has done with democratic socialism. Ms. Warren, who calls herself a capitalist who wants to make markets work, has so far been able to avoid the risk of incoherence because most of her proposals reflect that theme. Finally, off in the distance, there’s a risk that policy plans will be seen as a false promise. The next president won’t simply be able to carry out those plans, and probably shouldn’t try. If the Office of Management and Budget and key federal agencies can be restored to full capacity, and with external organizations providing more help than they can to a candidate, the next White House can probably produce better plans, spotting more potential problems, than a handful of policy analysts on a campaign. And aside from a few things that can be achieved by executive order or appointment, it’s Congress that has to follow through. Even if a Democratic president wins in a wave and brings along a Democratic Senate, those senators will need to be willing to scrap the filibuster or otherwise overcome obstruction from the other party. And even if all that happens, each member of Congress will have his or her own demands or local interests that will require bargaining on key points. But for now, detailed policy plans can serve an essential purpose, which is to tell voters what kind of person each candidate is.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Republicans Revel in Biden’s Debate Troubles, but See a New Threat in Harris",
      "url": "https://www.nytimes.com/2019/06/28/us/politics/trump-kamala-harris-debate.html?searchResultPosition=25",
      "subtitle": "null",
      "author": "Annie Karni",
      "content": "  WASHINGTON — He would relish a run against Senator Elizabeth Warren and has dismissed Senator Bernie Sanders as “crazy.” He has worried about Joseph R. Biden Jr.’s standing in the polls, at the same time telling advisers that the former vice president is a male version of Hillary Clinton and that a matchup in 2020 is a race he knows how to run. But President Trump has been less sure-footed about how he would take on Senator Kamala Harris if she were to be his rival. And after her breakout performance in the Democratic presidential primary debate on Thursday night, Trump campaign aides and allies acknowledged that Ms. Harris, a black former prosecutor from the donor-laden state of California, could prove to be a vexing adversary. “I would be more worried about Kamala Harris than Joe Biden as the nominee,” Matt Schlapp, the chairman of the American Conservative Union, said after watching the debate. “The Joe Biden of last night is a candidate I would dream to run against. But she can put together the Obama coalition. She’s also a first, and Democrats like the tingles up the leg.” In one lacerating rebuke of Mr. Biden on Thursday night, a man two decades her senior who has held some of the most powerful posts in American government, Ms. Harris altered two perceptions about the 2020 election. She gave an audience of millions a preview of how she could be a nimble opponent in a televised face-off with Mr. Trump. And she chipped away at some of Mr. Biden’s aura of dominance in the Democratic field. Many Republicans said even before Thursday’s debate in Miami that Mr. Biden’s presumed strengths were overstated — a sentiment the president shares. They described him as “old” and “tired” as well as someone they believed Mr. Trump knew how to spar with and rattle in a head-to-head contest. “If this is a window into how Biden would perform against Trump, it cannot give Democrats confidence,” said Ralph Reed, the founder of the Faith and Freedom Coalition, who is in frequent contact with the White House. Mr. Reed’s organization is one of a host of social conservative groups that will be spending tens of millions of dollars to identify and turn out voters for Mr. Trump in 2020. At a minimum, what some Republicans assumed would be a straightforward contest with Mr. Biden has suddenly become more unpredictable because of the Democratic debates. Ronna McDaniel, the chairwoman of the Republican National Committee, said in an interview that Mr. Biden had fallen “flat on his face.” That, she said, pointed to a more protracted and contentious battle for the Democratic nomination than many Democrats — and Republicans — had hoped for. “You’re not going to have one set front-runner throughout,” Ms. McDaniel said. “There were two schools of thought. Is Biden going to carry the lead all the way to the end? Or are we going to have a lot of competitive candidates fighting this out?” What became clear, she said, was that “there’s the potential for many different candidates to take the lead.” Privately, people close to the White House said they viewed Ms. Harris as “very dangerous” and the hands-down winner of the debate on Thursday. Others said they hoped the debate would serve as a warning for Republicans — including those in the president’s inner circle — who have been too dismissive of Mr. Biden’s less seasoned rivals. Still, they said the debate did not change the fundamental assumption that campaign officials and allies of the president’s have made about the dynamics of the race. And they cautioned that underestimating Mr. Biden’s strength as a formidable force in the Democratic primary and as a serious threat to Mr. Trump in the general election would be a mistake. Until now, the Trump campaign and Republican Party strategists have lumped in Ms. Harris with the rest of the Democratic field, planning to pigeonhole her as a far-left radical in the mold of Mr. Sanders. They noted that like Ms. Warren and Mr. Sanders, she raised her hand in the debate to signal support for abolishing private health insurance — an issue the Trump campaign expects to be the easiest way to explain what the Democratic version of “socialism” looks like. (On Friday morning, Ms. Harris walked back her position, saying she misunderstood the question and does not support abolishing private health insurance.) Trump aides and allies were equally pleased when she put Mr. Biden on his back foot, confronting him over his defense of Southern senators and support of antibusing policies decades ago. But even as they took pleasure in Mr. Biden’s bad night, they conceded that her strong performance made it clear that Ms. Harris, too, could pose a real threat. Ms. Harris, who has demonstrated the natural political skills closer to those of President Barack Obama than those of Mrs. Clinton, would present Mr. Trump with an unfamiliar rival, and one whose race and gender are potential land mines for him in terms of his attacks. So far, he has struggled to land on a quick-hit way to undermine Ms. Harris’s candidacy. Aides said that was because her poll numbers had not been high enough to register with him. After Ms. Harris’s kickoff rally in January, he complimented her crowd size, describing it as “the best opening so far.” In an interview with the Fox News host Sean Hannity, the president said that “she’s got a little bit of a nasty wit.” But Mr. Trump has focused most of his energy on Mr. Biden, whom internal polls have shown beating him in critical states like Pennsylvania, Michigan and Ohio. Some Republicans would welcome a Trump-Harris race because it would allow them to frame the election exactly as they hope to: a battle of ideologies that will excite their conservative base with dire warnings of a socialist future. “This is a bit of a ‘Braveheart’ election, where everybody’s painted their faces blue and they’re all running at each other, and there’s no quarter taken or given,” Mr. Reed said. “The center is hollowed out. The unaffiliated voter has not disappeared but they’re statistically insubstantial. So what you’re looking for in that kind of election is a thing that increases intensity, enthusiasm and a feeling that something is really on the line.” The effort to paint the Democratic Party in a radical light is expected to be well coordinated and led by a coalition of some of the biggest groups in Republican politics. “This lurch to the left and full throttled assault on the free enterprise system will be wrapped around the neck of the eventual Democratic nominee by the G.O.P.,” said Scott W. Reed, the chief political strategist for the U.S. Chamber of Commerce. “No socialismo, no comunismo, somos capitalista,” read a large banner hanging between two palm trees at a demonstration of Trump supporters on Wednesday outside the debate hall in Miami.",
      "date": "June 28, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Democrats Grapple With a Sprawling Primary Field, and No One to Shape It",
      "url": "https://www.nytimes.com/2019/07/04/us/politics/democratic-candidates-president-2020.html?searchResultPosition=24",
      "subtitle": "null",
      "author": "Reid J. Epstein",
      "content": " WASHINGTON — John Deeth is the sort of Iowa activist who keeps up with every new twist in the Democratic presidential primary, but there was no way he was going to devote two evenings to watching the first round of debates last week. Instead Mr. Deeth, a 55-year-old from Iowa City who has volunteered for every Democratic caucus since 1992, spent one debate night watching “Goodfellas” and the other at the grocery store. “Until this field is narrowed down to serious people, I’m not going to spend four hours watching them,” Mr. Deeth said. “I’m not going to suffer through Andrew Yang.” Mr. Deeth’s frustration highlights a central challenge the Democratic Party faces as it tries to identify the strongest candidate to take on President Trump: The slate of 24 contenders is too unwieldy for a constructive debate, many activists and strategists say, and too large for most voters to follow. And with a leadership vacuum at the top of the party, there is no one to elevate candidates with an endorsement, or help steer third-tier candidates out of the race when they’ve reached their plausible expiration date. [Which Democrats are leading the 2020 presidential race this week?] Former President Barack Obama, an influential voice among many Democrats, is sitting out the primary. The Clintons, a once-dominant party presence, are largely unwelcome this time around. In Washington, Speaker Nancy Pelosi is focused on keeping the House in order, and Chuck Schumer, the Senate minority leader, has failed to recruit  presidential candidates like Gov. Steve Bullock of Montana and former Representative Beto O’Rourke of Texas into potentially winnable Senate races. The only kingmaker willing to crown candidates so far has been Oprah Winfrey. The media mogul did a glowing interview with Mr. O’Rourke when the Texan was at the near-peak of his popularity in February. Since then she has moved on to Pete Buttigieg, the mayor of South Bend, Ind., telling  the Hollywood Reporter that she instructed the director Steven Spielberg to “look him up.” (She hasn’t yet touted Marianne Williamson, her onetime spiritual adviser.) Of the party’s living former presidential nominees, just Walter Mondale and Michael Dukakis have weighed in on the race. Mr. Mondale endorsed a fellow Minnesotan, Senator Amy Klobuchar, and Mr. Dukakis backed Senator Elizabeth Warren, who like him hails from Massachusetts. The rest are keeping their distance from the messy primary, which post-debate polling shows has bifurcated between a top tier of five candidates and everyone else vying just to qualify for the party’s fall debates. Only Mr. Obama has the stature within the party to influence the primary scramble, former Gov. Ed Rendell of Pennsylvania said. “If Barack Obama stood up and said, ‘You other Democrats, stop going after Joe Biden for his record from 30 years ago, I knew all this stuff and I picked him to be vice president of the United States,’ that might do it,” he said. “But I don’t think the president feels it would be right for him.” [Sign up for our politics newsletter and join the conversation around the 2020 presidential race.] Mr. Obama has held private conversations with most of the Democrats running and speaks regularly with former Vice President Joseph R. Biden Jr. He is not likely to engage in a public way until late in the primary process. The Clintons’ connection to the primary is more complicated. Former President Bill Clinton, his legacy tarnished by sexual indiscretions and allegations of sexual assault (which he denies), is persona non grata on the campaign trail in the #MeToo era. Hillary Clinton is still popular with many Democrats, including women, but her Electoral College loss to Mr. Trump limits her influence over party politics and on shaping the 2020 Democratic field; she has met or talked with several of the candidates, but they generally do not see her as someone who could call shots in the race. Former Senator Barbara Boxer of California said the calls to cull the field are a symptom of tension between a right-now society and a nominating process designed to take 18 months or more. “Everybody wants instant answers,” Ms. Boxer said. “Who is going to be left, who is going to win. We don’t know any of that. If you’re getting squeezed out of the debates, do something fabulous and figure it out to get attention.” The debate format itself, created by the Democratic National Committee, has added to the sprawling nature of the primary. The relatively low thresholds for the first two debates have provided an incentive for low-polling candidates to stay in at least through the end of July. [Here Are the Democrats at Risk of Not Making the July Debates] While NBC’s high ratings for the first set of debates suggest high interest in the presidential campaign, party leaders in early voting states like Iowa — which have had the most exposure to the 24 Democrats in the race — say the oversaturation is counterproductive. “Ten of them should drop out now,” said Claire Celsi, an Iowa state senator. “It’s not really fair to the other people. The debates are just unmanageable.” After last week’s debates, Ms. Celsi posted to Facebook a list of 10 Democratic candidates who she said should consider dropping out. Of Ms. Williamson, Ms. Celsi wrote, “Love can’t pay the bills.” And she said Senator Michael Bennet of Colorado suffers from “white guy can be president if he wants syndrome.” [Justin Amash, the only Republican in Congress to call for impeaching President Trump, is leaving the party.] Other Democrats rebutted the idea that candidates should be persuaded to end their campaigns. Deval Patrick, the former Massachusetts governor who considered a 2020 presidential run, said the decision to drop out can only belong to the candidate. “In a successful democracy, the candidate or the voters, and only they, should determine when it’s appropriate for a candidate to drop out,” Mr. Patrick said. The field, he said, “is not too big.” Veterans of the bitter 2016 primary between Mrs. Clinton and Senator Bernie Sanders of Vermont recall Mr. Sanders’s complaints that the Democratic machinery was rigged against him, and wince at the possibility that claims of favoritism or disputes over viability could again prove divisive. For that crowd, the party’s debate thresholds — due to rise to 130,000 unique donors and 2 percent in at least four polls by September, double the requirements for the first two debates — is a recipe for producing grievances from candidates who don’t qualify. “It is crazy dangerous for the D.N.C. to take on the role of limiting the field,” said Jennifer Palmieri, who was communications director for Mrs. Clinton’s campaign. “Even if you have good intentions, the unintended consequences of that could be pretty devastating.” Donna Brazile, who became chairwoman of the D.N.C. after revelations that her predecessor, Debbie Wasserman Schultz, had favored Mrs. Clinton, said people should remind themselves the second-tier candidates won’t be around much longer. “The biggest part is going to be dominated by the top four or the top two,” she said. “It’s like the N.F.L., we don’t complain about the number of teams we see during the season, we want to know who has the best players to get to the playoffs.” The Democratic Party chairman, Tom Perez, said he considered the debates a roaring success, marked by high TV ratings and a focus on policy issues, while avoiding the attack-driven fireworks that characterized the 2016 Republican debates. The D.N.C. has been squeezed between those who think there are too many candidates and others who say the more stringent criteria for future debates is too limiting. Mr. Perez has said over and over again that the party’s rules have been set for months and that he is not going to change them. “You can’t set rules and then make new rules that would violate our commitment to fairness, transparency and consistency,” Mr. Perez said. “We explained all of the rules to the candidates back in February. Everybody nodded, understood and agreed.” All three 2020 candidates Mr. Schumer failed to convince to run for the Senate are now mired among the race’s also-rans. Former Gov. John Hickenlooper of Colorado purged his top campaign staff this week. Mr. O’Rourke registered less than 1 percent in the latest Suffolk University poll of Iowa Democrats. Mr. Bullock, the Montana governor, didn’t even qualify for the first round of debates. For any candidate who is considering leaving the race, the comedian Samantha Bee offered a prominent platform: her late-night show on TBS. She invited candidates to announce they are leaving the race on her show, and promised to throw them a dropout party with balloons, music and a cake of the candidate’s choosing.",
      "date": "July 4, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "These Are the Mistakes Democrats Don’t Want to Repeat in 2020",
      "url": "https://www.nytimes.com/2019/07/18/us/politics/2020-candidates-election-2016.html?searchResultPosition=23",
      "subtitle": "null",
      "author": "Lisa Lerer",
      "content": "  WASHINGTON — Democrats still don’t agree on why they lost the White House in 2016. But they have absolutely no intention of repeating their mistakes. Whatever they were, exactly. Was it the loss of working-class white voters or urban black voters? Too much talk of Donald J. Trump or not enough? And what about those Russians? If Hillary Clinton’s decision to skip campaigning in Wisconsin was a problem, the party has that one covered. Democrats selected Milwaukee as the site of their national convention a year from now. In Michigan and Pennsylvania, states where Hillary Clinton lost after polling ahead for months, Democratic candidates pop up at coffee shops and farmers’ markets, field questions from audiences in packed high school auditoriums and clog up cellphone voice mail boxes. “You’re making me confess to a secret,” said Representative Mark Pocan of Wisconsin, a liberal who represents the area around Madison. He explained that his voice mail was full and no one could leave new messages. It’s been that way since the beginning of the year, and he said has no plans to clear it out. “That way I don’t have to deal with the candidates,” he said. “We have a few calling, obviously.” [Sign up for our politics newsletter and join the conversation around the 2020 presidential race.] From former Vice President Joseph R. Biden Jr., who kicked off his 2020 campaign in a Pittsburgh union hall, to Senator Kirsten Gillibrand’s effort to energize her campaign with a Rust Belt bus tour last week, the presidential candidates are eager to show Democratic voters, officials and activists that they’re fighting the next war — by way of the last one. Wisconsin, Michigan and Pennsylvania have become an electoral Bermuda triangle for Democrats, with a pull so strong that they’re frequently mentioned at campaign events in Iowa and New Hampshire, where voters will set the course for the 2020 primary race. “We’ve got to put someone at the top of the ticket who can win in places like Iowa and Wisconsin and Michigan and Pennsylvania, right? We all know that,” Senator Amy Klobuchar told voters during a Saturday campaign stop in Waterloo, Iowa. Two days later Mr. Biden said his candidacy relies on winning the same set of states. “I’m accustomed to winning places like Pennsylvania and Ohio, Michigan and Wisconsin,” he told 200 people gathered on the driveway at the home of former Gov. Tom Vilsack of Iowa. “There’s no way a Democrat can get elected president without winning Pennsylvania, you just can’t do it.” The Rust Belt bus tours and campaign cattle calls are far more about lingering post-traumatic stress from the Democrats’ 2016 loss than any current electoral strategy. While the traditionally blue states are likely to be crucial to Democrats in a general election, none of the three are scheduled to hold their primary vote before Super Tuesday, the dozen-state primary that’s widely expected to winnow the field in early March. Of course, the 2020 race bears little resemblance to the last race — or any other primary in modern electoral history. The crowded Democratic field is four times as big as it was at its largest point in 2016, historically diverse and features the widest age gap ever seen in a primary contest. Democrats may have new opportunities in states where demographics are shifting like Georgia, Arizona and Texas. And the nominee will face a sitting president, who has shown some eagerness to intervene in the opposing party primary contest. [President Trump’s re-election strategy involves stoking cultural and racial resentments, just as he did in 2016.] The field of 2020 candidates is eager to reassure voters that if they win, they won’t take anything for granted, even as they handle the previous Democratic nominee with extreme care. Earlier this year, Ms. Klobuchar quickly called Mrs. Clinton to apologize, after she launched her bid with promises to win in Wisconsin that were seen as a jab at the former Secretary of State. Still, the implicit critique rings clear to Democratic voters and donors. “I was one of Hillary Clinton’s finance chairs and unfortunately she didn’t come into Michigan enough. They’re not ignoring us now,” said Barry Goodman, a Democratic donor in the Detroit suburbs who is raising money for Mr. Biden. In town hall meetings and diner meet-and-greets, Democrats frequently bring up the 2016 defeat, often as an origin story for how they became more engaged in national politics. “People continue to come up to me to tell me the story of where they were on the evening of Nov. 8, 2016, how it impacted them, how they’ve since become engaged,” said Representative Chrissy Houlahan, a freshman from the Philadelphia suburbs who’s being wooed by multiple presidential candidates for an endorsement. “It’s seared in the collective memory.” For others, the shock of that loss transformed them into cable news pundits, eager to project what white Rust Belt voters may — or may not — want in a candidate over what they personally might prefer. “We have created an electorate full of pundits and strategists, and the result is that we’re puzzling through not who we like but who we imagine someone else will like,” said Senator Brian Schatz, Democrat of Hawaii. “It’s a fool’s errand to imagine who will be appealing to someone else.” The armchair punditry is only exacerbated by a steady drumbeat of polling on the race. After a period of soul searching, pollsters are once again up and running. A 2017 report by the American Association for Public Opinion Research, an industry group, recommended some changes to polling, notably improving accounting for voters’ education levels, surveying people closer to Election Day and pressing those who say they are undecided on which way they might be leaning. But mostly, the report blamed the “large, problematic errors” in state polls on a single culprit: Money. “It is a persistent frustration within polling and the larger survey research community that the profession is judged based on how these often under-budgeted state polls perform relative to the election outcome,” the report noted. But Charles Franklin, the director of the Marquette Law School poll in Milwaukee, who helped craft the report, says while it identified some problems and suggested solutions, none were a “magic bullet.” He’s back in business for the 2020 election, with some tweaks to how he surveys voters who say they’re undecided. “At least, we have to be self-aware of what we are doing,” he said. “You look at all your data and everything you do and you make some adjustments, but in the end you have to trust your data, recognizing that the data can be wrong.” That’s certainly a lesson President Trump remembers. His campaign is trying to recapture the magic by running on the same message of cracking down on immigration, race-baiting and skepticism toward conventional political wisdom — starting with ignoring what he calls “phony polling.” “I’m going to do it the same way I did it the first time,” he said in an interview with ABC News last month. Democrats remain far more divided over what lessons their party should draw from the last race. “There’s something fundamental about the fact that Trump presented himself as a noxious human and still won that is disconcerting and unsettling about America,” said Adam Jentleson, a Democratic strategist working for a group focused on suing Mr. Trump. “But the why, we don’t know. It depends who you talk to.” Senator Elizabeth Warren rarely mentions Mr. Trump in her stump speech, focusing instead on her plans for transforming the country’s economy. Mr. Biden takes nearly the exact opposite tack, weaving his opposition to the current president into nearly all parts of his argument. His supporters argue that the race will be won by convincing moderates that the Democratic nominee is a safer choice than Mr. Trump. “We’ve got to get moderate working-class Democrats back,” said former Gov. Ed Rendell of Pennsylvania, who’s backing Mr. Biden. “We’ve got to get candidates that they can relate to.” Senator Kamala Harris, meanwhile, argues that the path to victory for Democrats runs through energizing the women, people of color, and younger voters that make up the backbone of the party. Her campaign, along with others in the party, believes that mobilizing these voters in cities like Detroit, Milwaukee and Philadelphia could make the difference in the three states in question. “There are things we all understand about what happened in 2016 aside from Russian interference,” said Adrianne Shropshire, who runs BlackPAC, an African-American political organizing group. “What is clear is that there were key segments of the Democratic base that stayed home.” Others think that Democrats should spend less time and money in traditional swing states like Ohio and Iowa and instead focus on shifting their map into the rapidly changing Sun Belt, where they found success during the 2018 midterms. All the uncertainty has left some Democrats urging voters to take a truly radical stance: Just vote for who you believe in. “Put your money on someone who energizes and excites you,” said Mr. Jentleson, “rather than someone who appeals to a voter in a diner in rural Michigan who you invited in your head.”",
      "date": "July 18, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Who Still Calls It a ‘Glass Ceiling?’ Not the 6 Women Running for President",
      "url": "https://www.nytimes.com/2019/07/23/us/politics/glass-ceiling-female-candidates-2020.html?searchResultPosition=22",
      "subtitle": "“Shake the table.” “Break things.” “Persist.” These are the metaphors of a new generation of political candidates.",
      "author": "Jessica Bennett",
      "content": " Kamala Harris is prepared to “break things.” Elizabeth Warren said she would “persist.” Amy Klobuchar has challenged voters to discount women “at your own peril,” while Tulsi Gabbard insisted that a presidential race with six women is not an anomaly but “what an election should look like.” The women running for president are promising many things as they make their pitches to voters. They are being asked repeatedly how being women may affect their chances. But so far, none of them are emphasizing the “glass ceiling.” In fact, the phrase “glass ceiling” was trending recently not because of anything the candidates had said, but because of Nike. In an ad celebrating the World Cup-winning United States women’s soccer team, a narrator intones, over black-and-white imagery of the players, the “I believe” chant — completing it to say that women will “conquer more than just the soccer field, like breaking every single glass ceiling.” The symbol remains intact. In politics, the phrase became associated with the aspirations of Hillary Clinton, who spoke at key moments of success and defeat about cracking the glass ceiling. But in this barrier-breaking field of female candidates, it is noticeably absent. [Sign up for In Her Words, a newsletter where women rule the headlines] “Words have their moments, especially colloquialisms,” said the linguist Robin Lakoff, professor emerita at the University of California, Berkeley, whose 1975 book, “Language and Woman’s Place,” helped create the field of gender linguistics. “Often, after a word or phrase gets a lot of use, people simply stop using it — because we like to sound original and this one seems tired.” Which is not to say it is entirely verboten — or that metaphorical ceilings are not actually being shattered. Kirsten Gillibrand tweeted the term this month as part of a pledge for gender parity in national security, while Marianne Williamson notes on her campaign website that the “proverbial glass ceiling” is one of the things holding women back. Aside from the record-breaking number of female candidates for president — along with those serving in Congress — there are more female chief executives in the Fortune 500 than ever before (though, of course, that number is still just 33), and a recent study published in the journal American Psychologist found that a majority of Americans believe that women are just as competent as men — if not more. “It’s a pretty dramatic shift,” said Alice Eagly, a social psychologist at Northwestern University who led the work, analyzing public perceptions over 70 years. As a term, the “glass ceiling” dates to around 1978, when it was discussed by female workers at Hewlett-Packard and used onstage at a panel discussion about women’s aspirations by an employee of the New York Telephone Co. Each used it to describe the inability of white-collar women to rise beyond the mid-manager level in their jobs, and the often invisible barriers preventing that rise. The phrase gained traction in the mid-1980s, when it appeared in an article in Adweek (quoting the outgoing editor of Working Woman magazine) and then a headline in The Wall Street Journal (“The Glass Ceiling: Why Women Can’t Seem to Break the Invisible Barrier That Blocks Them From the Top Jobs”). The New York Times ran an article in 1986 — the same year it proclaimed that, architecturally speaking, buildings made of see-through glass were “getting good reviews”— about the glass ceiling for female politicians, quoting Betty Friedan, co-founder of the National Organization for Women. “Our women tried to go higher and I wonder whether they ran into a glass ceiling,” Ms. Friedan said then, recalling the unsuccessful campaigns of Carol Bellamy for mayor of New York, Elizabeth Holtzman for the Senate and Geraldine Ferraro for vice president. “In corporations, women get to a middle level and then there’s a glass ceiling — not overt discrimination, just a feeling that you can go this high and no higher.” In the years following, the term continued to go mainstream — a kind of linguistic shorthand for a problem that could be difficult to pinpoint or describe. By the 1990s it had been used to describe the experiences of Navy women, female lawyers, women in banking, older women, black professionals (women and men), women who worked on the campaign of George Bush and the plight of female journalists — as explained by The Washington Post’s board chair at the time, Katharine Graham. More recently, it has been uttered by the likes of Priyanka Chopra, the actor Brie Larson (who this year played Captain Marvel in a rare female-led superhero film) and Madeleine Albright, who wore a glass-ceiling brooch to the Democratic National Convention in 2016. Still, nobody has used the allegory quite like Mrs. Clinton, who has for years talked about the “highest, hardest glass ceiling” she was determined to crack. She spoke of it movingly in her 2008 concession speech, saying that while she was not able to shatter it, the ceiling now had “about 18 million cracks.” Eight years later, when she became the first female nominee of a major party’s ticket, she leaned into the metaphor even harder. When she spoke by video to the Democratic National Convention a virtual glass ceiling broke onscreen; she accepted the nomination later in the week while saying, “When there are no ceilings, the sky’s the limit.” And then, of course, there was the fateful night at the Javits Center in Manhattan, under a literal glass ceiling where confetti shaped like glass shards was supposed to rain from above as Mrs. Clinton acknowledged victory. “I remember thinking that the symbolism was going to feel so satisfying,” said Emma Gray, 31, who reports on women’s issues for HuffPost and remembers staring upward during a quiet moment at the Javits Center on election night. “We were under a literal glass ceiling and that ceiling was going to metaphorically shatter. And then it did not.” The next morning, Mrs. Clinton gave a concession speech and Google Search results for “glass ceiling” peaked, higher even than their previous peak during the Democratic National Convention that summer. She noted somberly that while “we have still not shattered that highest and hardest glass ceiling,” someone would, eventually. With six women in the 2020 race, perhaps the phrase seems “almost a little bit embarrassing, or maybe just irrelevant,” said Ms. Lakoff, the linguist, adding that “of course it’s not.” Which is not to say that the candidates are thinking about gender any less. To the contrary, the less they talk about it the more it might indicate they’re actually thinking about it more. “There’s a worry that if you draw too much attention to these biases, to your womanhood, that it reinforces people’s doubts about it,” said Adam Grant, an organizational psychologist at the Wharton School of Business, pointing to research from the corporate world that illustrated that point. “So if I were a female candidate in this cycle, which I realize is a strange sentence to say, I would be afraid that talking about the glass ceiling would only reinforce it.” And, anyway, there are other terms to play around with these days — such as “glass cliff,” to describe the phenomenon of women and minorities being tasked with leadership during periods of crisis, which was recently added to Dictionary.com. (The “cliff” part is the idea that they’re being set up to fail.) Or “motherhood penalty” to describe bias specifically against working mothers and “likability trap” to refer to the challenge female leaders face by having to prove they are tough and likable at once. Alexandria Ocasio-Cortez, the 29-year-old congresswoman from New York, has opted for “shake the table” and “build our own house” to describe breaking barriers, while Ayanna S. Pressley, the first black woman elected to Congress from Massachusetts, has noted that, “When it comes to women of color candidates, folks don’t just talk about a glass ceiling. What they describe is a concrete one.” This time around, Ms. Klobuchar noted that the term itself isn’t just about winning the White House — it’s about running in the first place. The number of women in the race is “a testament to the progress we have made,” she said. “There are still barriers, but the highest and hardest glass ceiling has so many cracks in it, it is well on its way to becoming an outdated standard.”",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Trump Says Mueller Was ‘Horrible’ and Republicans ‘Had a Good Day’",
      "url": "https://www.nytimes.com/2019/07/24/us/politics/trump-mueller.html?searchResultPosition=21",
      "subtitle": "null",
      "author": "Michael D. Shear",
      "content": "  WASHINGTON — President Trump declared himself vindicated by Wednesday’s congressional appearance of Robert S. Mueller III, the special counsel, calling it a “devastating” day for Democrats that exposed the Russia investigation as a “hoax” and a yearslong “phony cloud” over his head. Speaking to reporters as he boarded Marine One for a brief trip to West Virginia to host a fund-raiser, the president said that Mr. Mueller was “horrible” during his testimony before two House committees and in his handling of the investigation. “We had a good day today,” Mr. Trump said, echoing a sense of jubilation inside the White House that Democrats had failed in their bid to use Mr. Mueller to build a case for impeachment against the president. “This was a devastating day for the Democrats,” Mr. Trump said, adding: “The Democrats had nothing. And now they have less than nothing. And I think they are going to lose the 2020 election very big, including congressional elections.” “Today proved a lot to everybody,” he said. Mr. Trump spent the morning in the White House residence, where he watched portions of the first hearing, according to people familiar with his activities. He went down to the Oval Office by the time the second hearing had begun, but he was not in front of a television for longer than 15 minutes at a time, according to one adviser. He moved back and forth from the small dining room adjacent to the Oval Office to the Resolute Desk for a number of meetings, including one about prescription drug prices with two Republican representatives, Kevin McCarthy of California, the minority leader, and Mark Meadows of North Carolina. Mr. Trump’s comments in the afternoon reflected the growing excitement inside the West Wing that Mr. Mueller had fallen flat in his performance. One person who spoke with Mr. Trump said he took note of Mr. Mueller’s physical appearance and halting response to some questions. “I think Robert Mueller did a horrible job, both today and with respect to the investigation,” Mr. Trump said, adding: “Obviously he did very poorly today. I don’t think there’s anybody — even among the fakers — I don’t think there’s anybody that would say he did well.” Mr. Trump also panned Mr. Mueller’s performance during the nearly seven hours of testimony, including retweeting critics of the special counsel’s appearance to 62 million followers throughout the morning hearing of the House Judiciary Committee. “I would like to thank the Democrats for holding this morning’s hearing,” Mr. Trump wrote after Mr. Mueller testified in front of the Judiciary Committee and as the special counsel prepared to testify in front of the House Intelligence Committee, led by Representative Adam B. Schiff of California. “Now, after 3 hours, Robert Mueller has to subject himself to #ShiftySchiff - an Embarrassment to our Country!” Mr. Trump tweeted. The president had already given his online stamp of approval to a series of tweets critical of Mr. Mueller’s appearance. “This has been a disaster for the Democrats and a disaster for the reputation of Robert Mueller,” Mr. Trump tweeted about 90 minutes after the first hearing began, attributing the comment to Chris Wallace, the host of “Fox News Sunday.” A few minutes later, Mr. Trump retweeted Tom Fitton, the president of Judicial Watch, a conservative organization: “No collusion. No obstruction, No impeachment. Shut the coup cabal down!” The series of posts suggested that Mr. Trump was glued to the television as Mr. Mueller was grilled by lawmakers. And they appeared to confirm that the president was relieved by Mr. Mueller’s halting performance. That was certainly the message from some of the president’s top aides, who also began tweeting about Mr. Mueller. In response to a tweet quoting Mr. Mueller as saying that his investigation did not establish that the Trump campaign conspired with the Russian government, Kellyanne Conway, the president’s counselor, wrote three words: “Drop the Mic!” Mr. Trump started shouting on Twitter before 7 a.m., venting about what he called the “Greatest Witch Hunt in U.S. history” even as Mr. Mueller was headed to Capitol Hill. By 8:10, the president had posted seven more times, delivering a kind of Twitter greatest hits — punctuated by capital letters and exclamation points — in which he portrayed himself as the innocent victim of an illegal crusade by Mr. Mueller, Democrats and the country’s intelligence community. He said that his accusers were part of an “illegal and treasonous attack on our Country.” He complained again about the “18 angry Democrats” he asserted were on the Mueller team and asked why the special counsel did not investigate “Lyin’ & Leakin’ James Comey,” the former F.B.I. director whom Mr. Trump fired, and others. The president attacked Mr. Mueller’s credibility, repeating his unsubstantiated claim that the special counsel was “highly conflicted.” He then said: “NO COLLUSION, NO OBSTRUCTION!” and “KEEP AMERICA GREAT!” On Tuesday, Mr. Trump had shrugged off the impending testimony, telling reporters that he would not watch the hearings on Wednesday, then admitting that “maybe I’ll see a little bit of it.” But the president’s early-morning online activities betrayed his real intentions, indicating once again that Mr. Trump appeared consumed by the investigation that had dominated much of his presidency. During a private fund-raiser in Wheeling, W.Va., however, Mr. Trump’s focus shifted. “He spoke very little of the Mueller report,” said Alice Frankovitch, a Republican who lives in Weirton, W.Va. “He was mainly talking about all of the accomplishments he’s done so far in his presidency: the economy, the jobs, increasing the military. He covered a lot of coal.” But Mr. Trump’s feelings about Mr. Mueller’s testimony were mirrored by some of his supporters. “He submitted his report,” Ms. Frankovitch said. “I think that should have been enough.” Interviews with residents of Wheeling during the hearings largely broke down along partisan lines, with supporters of the president scoffing at Mr. Mueller’s testimony and Democrats saying that the special counsel had highlighted misdeeds by Mr. Trump. At DiCarlo’s Pizza, about 500 feet from the Trump fund-raiser, the TV was tuned to NBC’s airing of Mr. Mueller’s testimony. Diners watched it between bites of pizza and hoagies. “I thought they already came out with the whole report and didn’t really find any collusion or whatever Trump was talking about, so I’m not sure what they’re doing now again,” said Patrick Hynes, a mechanic from Chicago who said Congress had nothing better to do. “They don’t want to do anything about the immigration crisis they’ve got a problem with and all this other stuff,” Mr. Hynes added. Scott Jackson, a registered Republican who considers himself more of an independent, called the Mueller investigation a “scam” and “a total witch hunt.” Mr. Jackson, a lifelong Wheeling resident who collects unemployment benefits after having lost his job in the gas and oil industry in December, said: “I don’t think that anything that Mueller has done has had any positive effect for the nation. I believe that it’s lies.” But Cheryl Prichard, a Democrat and retired college professor of speech pathology, said Mr. Mueller helped make clear that “laws were broken and that it’s up to Congress to do their constitutional duty and institute an impeachment hearing.” “I thought the Democrats were asking questions to gather information,” Ms. Prichard said, “and I thought the Republicans were making comments and asking questions to get Trump re-elected.”",
      "date": "July 24, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "The 2018 Campaign Worked",
      "url": "https://www.nytimes.com/2019/07/29/opinion/democrats-2020-trump-2018-midterms.html?searchResultPosition=20",
      "subtitle": "Have Democrats forgotten?",
      "author": "David Leonhardt",
      "content": " This article is part of David Leonhardt’s newsletter. You can sign up here to receive it each weekday. In last year’s midterm elections, Democrats won 31 congressional districts that President Trump had carried in 2016 — including in the suburbs of Atlanta, Chicago, Des Moines, Detroit, Oklahoma City, Phoenix, Pittsburgh and Richmond, Va., as well as in more rural parts of Maine, Minnesota, New Mexico and Wisconsin. How did the Democrats do it? By running a smart, populist campaign that focused above all on pocketbook issues like affordable health care and good jobs. The Democrats who won in these swing districts didn’t talk much about Trump, the Russia scandals, immigration or progressive dreams like single-payer health care. They focused on issues that affect most voters’ daily lives. Theda Skocpol — the Harvard social scientist who has studied the Tea Party and the anti-Trump resistance, among many other things — has a new op-ed in USA Today that argues that the 2020 Democratic presidential candidates are ignoring the lesson of 2018. By doing so, Skocpol says, they are increasing the chances that Trump will win re-election. As Democrats prepare for their second round of debates this week, I think Skocpol’s message is worth hearing. [Listen to “The Argument” podcast every Thursday morning, with Ross Douthat, Michelle Goldberg and David Leonhardt.] “The first 2020 primary debates were a case in point,” she writes. “Thrilling as it was to see female contenders do well, the debates were chaotic and dominated by simplistic questions about topics of little concern to most Americans. The ostensible winners embraced ultra-left issue stands — like calls to abolish private insurance and give free health care to migrants — that would sink them in the general election.” These stances may help Democrats run up even larger margins in blue states like California and New York. But the presidency isn’t decided by the popular vote. And two of the smartest election analysts — Nate Cohn of The Times and Dave Wasserman of the Cook Political Report — have both written pieces recently that explain how Trump could lose the popular vote by an even wider margin than he did in 2016, and still win re-election. Skocpol writes: “U.S. politics is not a national contest. Victories in Congress, state politics and the Electoral College all depend on winning majorities or hefty pluralities in heartland states and areas that are not big cities. Hillary Clinton lost in 2016 mainly because she was whomped in non-urban areas where Obama had lost by far smaller margins.” A final point she makes is that Republicans — like the Koch brothers and their network — are more ruthlessly disciplined about advancing their interests and more focused on winning state and local campaigns. Too many Democrats, by contrast, give in to wishful thinking, imagining that they can control government policy by running campaigns that mostly excite people who live in deep blue areas. The 2018 midterms showed a clear playbook for Democratic victory. The question is whether the party will follow it.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Democrats Can Win by Running Against Trump’s Racism",
      "url": "https://www.nytimes.com/2019/07/30/opinion/trumps-racist-attacks-democrats-2020.html?searchResultPosition=19",
      "subtitle": "It’s the right thing to do — both morally and electorally.",
      "author": "Steve Phillips",
      "content": " President Trump’s tweet attacks on members of Congress of color, from “the squad” to Representative Elijah Cummings, have made it clear that fanning the flames of white racial resentment is central to his politics and re-election strategy. For decades, some left-leaning strategists stifled their candidates’ response to dog whistles for fear of alienating whites who they thought might otherwise support Democrats. Today, there is still great ambivalence about making the fight against racism a defining issue in the 2020 election. But the cold hard truth is that our elections are already racialized — and have been ever since Congress codified the concept of racial equality in the 1960s by passing the 1964 Civil Rights Act and the 1965 Voting Rights Act. With every attack, Democrats are now speaking out. And decades of election data on voter behavior show that Democrats are on firm ground in making the president’s overt racism a prominent campaign issue. That data shows that there are enough white voters for Democrats to defeat a president stirring racial resentment. It might, in a tight race, be barely enough — but enough. And the math gets more promising in 2020 when the electorate will be more racially diverse than at any previous time in United States history. In every presidential election for the past 50 years, a majority of white voters have voted against the Democratic nominee, and the overwhelming majority of people of color have sided with the Democrats. But there is a determined and consistent core of whites who always vote Democratic. Since the advent of exit polling of racial groups in 1976, no Democrat has received less than 34 percent of the white vote (that was Walter Mondale in 1984, losing 49 states in a landslide to Ronald Reagan). The historical average of white support for Democrats is almost 40 percent, and Hillary Clinton, up against Mr. Trump’s thinly disguised call to Make America White Again, garnered the support of 37 percent of white voters. What we learned in the 2016 election is that 37 percent of the white vote is enough to win the popular vote by nearly three million people. Obviously something went wrong in three critical states — Michigan, Wisconsin and Pennsylvania — where Mr. Trump prevailed by nearly 80,000 votes, tipping the Electoral College in his favor. But many progressives are drawing the wrong conclusions about what happened in those states. It’s true that the requisite amount of white support for a Democrat to win in those three states is approximately 3 percent higher than the number necessary to win the national popular vote. The exit poll data from 2016 shows two major realities that are important for current political analysis and strategy. Mrs. Clinton came exceedingly close to winning those states. Had she secured just 0.5 percent more of the white vote, she would be president. But perhaps even more important, Mrs. Clinton’s diminished white support was not primarily a result of Democratic defections to Mr. Trump (the now near-mythical “Obama-Trump voter”). The increase in white support for the third- and fourth-party candidates — from 2012 to 2016 — was greater than the increase for Mr. Trump. In fact, in Wisconsin, he got fewer votes than Mitt Romney received four years earlier, disproving the notion that waves of disaffected Democratic voters swelled the Republican ranks. If everything else holds steady in 2020, and Democrats win back just the Obama-Jill Stein voters, they will take Michigan and Wisconsin. Which raises the obvious and clearest point — there are not only white people in those states. The number of voters who stayed home in 2016 in Detroit, Milwaukee and Philadelphia was far larger than the margin of Democratic defeat in those states. As people of color become a bigger portion of the voting population, the number of white votes required to win steadily shrinks. In fact, a group of think tanks released a report last year showing that if all of the country’s racial groups replicate in 2020 their voter turnout and partisan preferences of 2016 — essentially a “do-over” — the Democrats would win Michigan, Wisconsin and Pennsylvania, just because of the demographic changes over the past four years. By doubling down on racial diversity and standing strong against racism, Democrats would align with population changes and be able to expand the electoral map by credibly contesting the key Southern and Southwestern states of North Carolina, Georgia and Arizona, among others. (Mrs. Clinton lost Arizona by 91,000 votes; 500,000 eligible Latinos in that state didn’t vote.) America is getting browner by the hour, given that every single day, as of 2016 data, the United States population increases by 8,000 people and 90 percent of that growth comes from people of color. Moreover, an additional seven million teenagers of color will have turned 18 since the 2016 election. With this demographic revolution transforming the country, Democrats do not actually have to increase their level of white support — they just need to hold it steady, as the core of whites who vote Democratic have done for 40 years. Beyond the morality of the matter, the mathematical reality means that standing strong against racism is a good electoral calculus for Democrats.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Joe Biden Won Last Night’s Democratic Debate",
      "url": "https://www.nytimes.com/2019/07/31/opinion/democratic-debate-joe-biden-marianne-williamson.html?searchResultPosition=18",
      "subtitle": "The real victor in the moderates-versus-progressives battle was the moderate who wasn’t there.",
      "author": "Ross Douthat",
      "content": " Marianne Williamson won last night’s debate if you judge exclusively in terms of charisma, rhetoric and the effective use of television. Bernie Sanders and Elizabeth Warren won last night’s debate — Sanders slightly more so, in my view — if you judge based on whether the two most important candidates onstage did what they needed to remain important. John Delaney won last night’s debate, despite earning the everlasting ire of left-wing Twitter, if you want to know which also-ran candidate made the most of his chances in the spotlight. But the big winner wasn’t on the stage: It was Joseph Robinette Biden, currently warming up for his turn tonight, who must have been smiling all the way through the evening’s fierce moderates-versus-revolutionaries debate. Right now, Biden is the only moderate candidate who matters. He’s climbed back to 30 percent in the polls after his stumbles at the last Democratic debate, and none of the umpteen would-be moderates in the field took advantage of that stumble even temporarily — there was no Klobuchar surge, no Hickenlooper hiccup, no Bennet bounce. This is all good news for the front-runner, but with one important caveat: It would be very useful to Biden if what happened last night kept happening, which would require at least one other would-be moderate to hang around, qualify for the fall debates and poll at 4 or 8 percent instead of sinking perpetually back toward zero. That person could do what Delaney and to a lesser extent Hickenlooper, Klobuchar, Ryan and Bullock did last night: They could make a direct and pointed and unapologetic case against the major leftward candidates, their plans and policies and political vision, so that Biden doesn’t have to do it. Every front-runner can benefit from having an attack dog on his side, savaging his rivals while he stays a little more above the fray. In 2008, John McCain slipped through to the Republican nomination in no small part because Mike Huckabee just hated Mitt Romney, and stuck knives in Romney every chance he got. In 2016, Donald Trump won the New Hampshire primary easily because Chris Christie, an also-ran by then but also Trump’s de facto ally in the “Tri-State-Area bully” lane, savaged Marco Rubio so thoroughly that the usually smooth Floridian essentially glitched onstage during a debate, seemingly confirming every anti-Rubio critique. In the same way, Biden benefits from the moderates-versus-Sanders and moderates-versus-Warren scenes that played out repeatedly on last night’s stage, because they help him escape the essential dilemma of his candidacy: That he can probably win if he consolidates and holds the moderate wing of the party — but that the work of consolidation, to the extent that it requires frontal attacks on the woke and neo-socialist styles of liberal politics, could threaten party unity even more than the Sanders-versus-Hillary Clinton conflict four years ago. Imagine Biden fighting Warren and Sanders and (depending on her positioning) Kamala Harris the way Delaney did last night, on the way to a narrow victory at a contested convention. Team Biden would surely take the victory, but it’s not at all the scenario that his campaign (or any Democrat) should want. And that scenario assumes that Biden is even capable of taking the fight to the more left-wing candidates in a sustained and compelling way. On the evidence of his first debate performance, he might need an attack dog because he himself simply isn’t quick or supple enough for onstage combat anymore. We’ll know more after tonight’s debate, which will probably test him not only with whatever Harris has prepared, but also in the same way that Warren and Sanders were tested, with Bill de Blasio filling the John Delaney role and attacking Biden from the furthest left at every opportunity. In which case Biden’s tricky task, unless he gets unexpected backup, will be to prove he can counterpunch without seeming to be too anti-left, too ready for ideological civil war. But having emphasized all the pitfalls ahead for him, it’s worth returning to where we started: With Biden having a good night while his leftward rivals fought the moderates. Yes, come the fall he won’t have Delaney or Hickenlooper to fight his battles for him. Yes, he has to prove that he can marry toughness and finesse. Yes, his obvious path to the nomination involves a lot of intraparty strife. But he’s holding 30 percent of the primary electorate when nobody else has much more than half that, his core constituency is precisely the sort of voter who doesn’t give a rip who left-wing or media Twitter thinks is winning the debates, and three weeks after Harris supposedly demolished him, their whole encounter barely even registers in polls. Which means that all of last night’s fireworks were just a prelude. Biden is the most important figure in the two-night spectacle — and he enters CNN’s arena tonight as still, and perhaps enduringly, the candidate to beat.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Peter Strzok Sues F.B.I., Saying His Firing Was Politically Motivated",
      "url": "https://www.nytimes.com/2019/08/06/us/politics/peter-strzok-lawsuit.html?searchResultPosition=17",
      "subtitle": "null",
      "author": "Katie Benner",
      "content": " WASHINGTON — Peter Strzok, the F.B.I. senior counterintelligence agent in the Hillary Clinton email and Russia investigations who made inflammatory comments about President Trump in text messages, sued the Justice Department and the F.B.I. on Tuesday for firing him. The F.B.I. said last summer that it had terminated Mr. Strzok for violating bureau policies, but he said in his lawsuit that he was fired because of political pressure from Mr. Trump, who has made a frequent target of Mr. Strzok in his public statements. “The F.B.I. fired Special Agent Strzok because of his protected political speech in violation of his rights under the First Amendment to the Constitution of the United States,” the lawsuit said. Mr. Strzok said his termination also violated his due process rights. The Justice Department declined to comment, and the F.B.I. said it does not comment on pending litigation. Mr. Strzok, who is seeking reinstatement to his job and a monetary award, was removed from the Russia investigation after it emerged that he had sent disparaging text messages about Mr. Trump to Lisa Page, an F.B.I. lawyer at the time who also worked on both investigations. Those messages, sent during the heat of the 2016 presidential election as the F.B.I. was investigating both candidates, were uncovered during an inquiry by the Justice Department inspector general into the handling of the Clinton email investigation. In their messages to each other, Ms. Page and Mr. Strzok said they did not want Mr. Trump to become president. In one exchange, Ms. Page asks: Mr. Trump is “not ever going to become president, right? Right?!” Mr. Strzok responds: “No. No he won’t. We’ll stop it.” Mr. Trump and his allies seized on the messages as evidence that the investigation into potential ties between his campaign and Russia was politically biased. The president discussed Mr. Strzok on Twitter dozens of times last year, criticizing his conduct. Mr. Strzok testified before Congress last summer that he had not let his political opinions interfere with the Clinton and Russia investigations. The inspector general, Michael E. Horowitz, said the messages were “not only indicative of a biased state of mind but, even more seriously, implies a willingness to take official action to impact the presidential candidate’s electoral prospects.” Nevertheless, Mr. Horowitz also said he had found no evidence that Mr. Strzok’s political views had influenced his investigative decisions. In response to the investigation’s critical findings, the F.B.I. moved to discipline Mr. Strzok, who had worked at the bureau for 20 years and become one of its most experienced counterintelligence agents. The bureau recommended firing Mr. Strzok in June 2018, but the Office of Professional Responsibility recommended that August that he be demoted and suspended for 60 days without pay, according to Mr. Strzok’s lawsuit. Mr. Strzok said in his filing that he agreed to that recommendation. But the next day, the bureau fired Mr. Strzok, effective immediately. Days before Mr. Strzok was fired, Mr. Trump said on Twitter that Mr. Strzok “should have recused himself on day one,” and that he had improperly tried to influence the election. Mr. Strzok contends in his lawsuit that the firing “was the result of unrelenting pressure from President Trump and his political allies in Congress and the media.” He said the campaign to fire him included “constant tweets and other disparaging statements by the president,” as well as direct appeals by Mr. Trump to Jeff Sessions, the attorney general at the time, and the F.B.I. director, Christopher A. Wray. Mr. Strzok also said in his complaint that the Justice Department’s decision to disclose his private text messages to the news media violated his rights under the Privacy Act, which governs federal records and protects against unwarranted disclosure of personal information. “While many in law enforcement have faced attacks by this president, Pete Strzok has been a constant target for two years,” Aitan D. Goelman, a partner with Zuckerman Spaeder and one of Mr. Strzok’s lawyers, said in a statement. “The lawsuit shows that, in bowing to the president’s desires, F.B.I. leaders trampled Pete’s free speech and due process rights in ways that should be deeply troubling to all in government, and indeed, to all Americans,” Mr. Goelman said. In addition to reinstatement, Mr. Strzok is asking for back pay and damages for violations of the Privacy Act.",
      "date": "Aug. 6, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Team Players in Politics and Love",
      "url": "https://www.nytimes.com/2019/07/27/fashion/weddings/team-players-in-politics-and-love.html?searchResultPosition=16",
      "subtitle": "null",
      "author": "Rosalie R. Radomsky",
      "content": " Alessandra Rose Biaggi and Nathaniel Smith Koloc were married July 22 at Blue Hill at Stone Barns in Tarrytown, N.Y. Yuh-Line Niou, a friend of the couple who is a New York State assemblywoman, officiated, with Hillary Clinton leading the couple in their vows. Ms. Biaggi, 33, is a first-term New York State senator, a Democrat representing District 34 including parts of the Bronx and Westchester County. Until 2018 she was a lawyer in Gov. Andrew M. Cuomo’s executive chamber in New York. She graduated summa cum laude from N.Y.U., and received a law degree from Fordham. The bride is a daughter of Toni Biaggi and Richard Biaggi of Pelham, N.Y. She is a paternal granddaughter of United States Representative Mario Biaggi, who was a 10-term Democrat representing the Bronx, now part of the area she serves. Mr. Koloc, 32, runs Formidable, a management consultancy based in Pelham, N.Y. He graduated from the University of Vermont, and received a master’s degree in strategic leadership toward sustainability from Blekinge Technical Institute in Karlskrona, Sweden. He is the son of Brenda L. Smith of Pittsburgh and the late Fred J. Koloc. The couple met in January 2015 when both were New York City New Leaders Council fellows. They gathered in Manhattan to learn about progressive politics, entrepreneurship and campaigns one weekend a month for five months. “In the first session we didn’t talk to each other,” Ms. Biaggi said, “but without saying anything there was an energy.” Mr. Koloc could also sense her intensity and seriousness. “We were two of the people in the group who were asking speakers the hardest questions,’’ he said. At the February meeting, after Mr. Koloc was offered the role of the director of talent acquisition and development on Mrs. Clinton’s presidential campaign-in-waiting team, he asked Ms. Biaggi about her job and her next move. “I’m going to work in the White House,’’ said Ms. Biaggi without skipping a beat. Mr. Koloc, taken by her moxie, asked if she would work on a campaign, which she quickly took to mean a local one. “How about a presidential race,’’ he countered, and his calm audacity stunned her. “Who is this person,’’ she recalled thinking. At the March meeting Mr. Koloc, more sure-footed in his job, asked Ms. Biaggi to send her résumé to the campaign, and by May she was on its vetting team. “Everything was urgent in the moment,’’ said Ms. Biaggi, who vetted anything that touched Mrs. Clinton, including staff, volunteers, individuals, locations and social media influencers. “It was total chaos and I loved it.” After a few weeks of sitting six desks from each other, they began grabbing coffee together or walking along the Brooklyn Heights Promenade during breaks. In June, as they left a Lady Gaga and Tony Bennett benefit at the Plaza, Ms. Biaggi’s mother called to tell her that her grandfather, Mario Biaggi, died, and was touched when Mr. Koloc then showed up at her grandfather’s wake. “It was a meaningful and hard moment,” she said. In September, after they knew they were serious, using what Mr. Koloc called “comm strategy” (communications strategy), within the same hour they told colleagues about the relationship. On election night at the Javits center “the energy was hopeful and exciting,” said Ms. Biaggi, who then was deputy national operations director managing state logistics and state operations teams, but by the end of the night they knew they had lost. “We played very hard, and it was very hard to lose,’’ she said. Before Christmas they broke up as they each tried to get to a better place personally, and got back together by June. “We were crushed into a million pieces, but the love we had and have for each other triumphed,’’ she said. “Our relationship had a bigger purpose and continued, and it passed the test.” On Monday following the ceremony Mr. Koloc said: “For some cinematic flare, lightning struck the Blue Hill property about five minutes after our vows. It was fantastic.”",
      "date": "July 27, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "In Epstein Tweets, Trump Revisits a Favored Conspiracy Genre: Murder",
      "url": "https://www.nytimes.com/2019/08/12/us/politics/trump-epstein-conspiracy-theories.html?searchResultPosition=15",
      "subtitle": "null",
      "author": "Maggie Haberman",
      "content": "  President Trump has long used his fame and platform to amplify conspiracy theories and undermine his political enemies by muddying the waters when it comes to facts. For years, he has helped to erode voter faith in institutions by invoking the idea of a sinister force — such as the “deep state” or a rigged electoral system — that is thwarting the will of the people in an attempt to undermine him. But a macabre subgenre of Mr. Trump’s fondness for conspiracy theories has been to accuse, directly or indirectly, his political enemies of murder. In the heat of the 2016 Republican primary, Mr. Trump elevated an unsubstantiated rumor, published by the Trump-friendly National Enquirer, insinuating that the father of one of his rivals, Senator Ted Cruz of Texas, had been involved in the assassination of President John F. Kennedy. Earlier that year, he fed into the idea that Antonin Scalia, a Supreme Court justice who died in his sleep in 2016, could have actually been murdered in his bed. On Saturday, two and a half years into his presidency and hours after Jeffrey Epstein, the financier accused of sex trafficking, was found dead in a federal jail cell in Manhattan, Mr. Trump once again weighed in by elevating an online conspiracy theory that the Clintons were linked to his death. Mr. Epstein “had information on Bill Clinton & now he’s dead,” Terrence Williams, a comedian and Trump supporter, wrote on Twitter on Saturday. Mr. Williams also noted that “for some odd reason, people that have information on the Clintons end up dead.” Mr. Trump promptly shared the baseless insinuation online by retweeting it to his 63 million followers. Mr. Trump, who is entering the thick of election season, has yet to find any candidate in the crowded Democratic field whom he delights in invoking as much as his forever foils, Bill and Hillary Clinton, the onetime reigning couple of Democratic politics who have been the subject of conspiracy mongering on the right for decades. Even though the Clintons have retreated from politics, “it’s one of those things that continue to live on,” said Douglas Brinkley, the historian. Mr. Trump’s decision to weigh in on the case of Mr. Epstein’s apparent suicide, even while his own Justice Department is investigating, also had a political imperative behind it, Mr. Brinkley said. “The first thing Trump wanted to do was put Bill Clinton into the mix,” he added. “Make it about Bubba, not about the Donald.” Mr. Clinton and Mr. Epstein were first linked in 2002, when it was reported that the former president took his first of four trips aboard Mr. Epstein’s private jet, for a trip related to Mr. Clinton’s work on his foundation, according to a Clinton spokesman, and Mr. Clinton has stressed that he has not been in touch with Mr. Epstein in over a decade. But Mr. Trump has his own long history with Mr. Epstein, one he has been playing down since before he began his presidential campaign. The two New Yorkers were friends through the 1990s, and into the 2000s, and in at least one instance, were even caught on camera ogling women together at Mar-a-Lago, Mr. Trump’s Palm Beach, Fla., estate. The source of their eventual falling out — which Mr. Trump has highlighted more than the friendship itself — has been in dispute. Whether he believes the theories he promotes or not, Mr. Trump knows that many people will latch onto them, lured by the idea that a hidden force is controlling fate. “He revels in conspiracy theories because he knows it gives him quick and easy traction with the masses — they’re easily swayed by the notion that there is an organized group getting over on them,” said Timothy L. O’Brien, a journalist and one of Mr. Trump’s biographers. “Because he never feels remorse or guilt about peddling these fables, he dives right in even when he knows better.” On Saturday, when the news of Mr. Epstein’s death broke, Mr. Trump was at his New Jersey golf club, where he plans to spend his vacation and where, accompanied by few aides, he often uses Twitter more freely than when he is at the White House. “It’s another example of something where he should stop and think about the fact that he’s the president of the United States, and stop his thumbs, but he never does,” said Rich Lowry, a columnist and editor of the conservative National Review. In the murky story of Mr. Epstein’s death, Mr. Trump found particularly fertile soil: the demise of an accused pedophile with powerful friends, whose apparent suicide in a federal Manhattan jail has raised questions about “serious irregularities” and has many people — not just Mr. Trump — speculating in public about what might have really taken place. “Something stinks to high heaven,” Claire McCaskill, a Democratic former senator from Missouri, wrote on Twitter. By Monday, however, some of Mr. Trump’s closest advisers sought to tamp down the talk of a conspiracy now that the Justice Department is involved in the investigation. Mr. Trump’s personal lawyer, Rudolph W. Giuliani, had suggested on Saturday that he found Mr. Epstein’s death suspicious. But on Monday, he said: “It is best to wait for some key facts like the findings of the autopsy. Withholding judgment is the wisest course to follow. D.O.J. is very motivated to get to the bottom of it.” Waiting for facts to settle, however, has never been Mr. Trump’s preferred style. Mr. Trump has repeatedly used conspiracies to bond with his supporters since promoting the false story that President Barack Obama was born in Kenya, rather than Hawaii, which helped him rise in the polls in 2011 when he first considered a run for president. “Conspiracy theories are a perfect tool to emotionally connect with voters and supporters,” said Sam Nunberg, a former campaign aide. Last year, Mr. Trump promoted accusations that a “criminal deep state” element within the government had planted a spy inside his presidential campaign to try to help Mrs. Clinton win the presidency — a scheme he branded “Spygate.” And during the 2016 campaign, he promoted the idea of foul play as a reason for Justice Scalia’s death. “I’m hearing it’s a big topic,” he said then. “It’s a horrible topic but they’re saying they found the pillow on his face, which is a pretty unusual place to find a pillow,” Mr. Trump told the radio host Michael Savage.",
      "date": "Aug. 12, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Fact-Checking Trump’s Claim That Google ‘Manipulated’ Millions of Votes for Clinton",
      "url": "https://www.nytimes.com/2019/08/19/us/politics/google-votes-election-trump.html?searchResultPosition=14",
      "subtitle": "After making baseless claims of voter fraud, the president has turned to a new way of explaining his loss of the popular vote in 2016.",
      "author": "Linda Qiu",
      "content": " Mr. Trump lost the popular vote by almost 2.9 million in the 2016 election and has long attributed this loss to baseless claims of voter fraud. Now Mr. Trump suggests that he would have lost the popular vote by a much smaller margin, or even won it, were it not for Google’s machinations. He appears to be referring to a disputed estimate given by Robert Epstein, a psychologist and former editor in chief at Psychology Today who says he supported and voted for Hillary Clinton. In a 2017 white paper, Mr. Epstein examined how Google Search might have influenced undecided voters in the 2016 election by providing more positive results for one candidate than the other. He estimated that the search results may have swayed “at least 2.6 million votes to Clinton.” When he testified to Congress this summer, Mr. Epstein added that the estimate was a “rock bottom minimum” and that up to 10.4 million votes could have been shifted to Mrs. Clinton. In an interview, Mr. Epstein took issue with Mr. Trump’s characterization of his work. “I’ve never said Google manipulated the 2016 elections,” he said. “The range of numbers he listed in the tweet is also incorrect.” Panagiotis Metaxas, a computer science professor at Wellesley College, emphasized that the white paper showed a possibility — “what such an influence could have been if Google was manipulating its electoral search results” — not a conclusive fact. “I and other researchers who have been auditing search results for years know that this did not happen,” Mr. Metaxas said. “I think that, in his congressional hearing, Dr. Epstein is misrepresenting the situation.” He noted that Google does “sanitize” its search results, prioritizing more trusted sources while devaluing low-quality information sources. (Here’s a more detailed explanation of how Google Search works.) The white paper also came with huge caveats. First, it was not peer-reviewed or rigorously evaluated by other researchers. It was based on the daily online searches of just 95 participants, 21 of whom were self-described undecided voters — a small sample size to extrapolate to millions of voters, experts said. (Mr. Epstein says that the statistical significance of his findings was high.) Their election-related search results were then given to another group of people who evaluated whether the results were biased toward Mr. Trump or Mrs. Clinton, and concluded that most favored Mrs. Clinton. Searches conducted on other websites like Yahoo and Bing did not display the same bias, according to the paper. Then, Mr. Epstein applied his previous research demonstrating that biased search results could shift voting preferences by 20 percent or more to reach his baseline estimate of 2.6 million people affected. But it takes “a leap of faith” to connect Mr. Epstein’s experimental results to actual election outcomes, said Nicholas Diakopoulos, an assistant professor in communication studies at Northwestern University. (Mr. Diakopoulos’s own research does show that Google Search results favor Democrats.) “There’s a substantial shift in context, and a difference in asking someone in an experiment about likely voting behavior and how they might actually act during an election,” Mr. Diakopoulos said. A more meticulous scientific analysis measuring the impact of Google Search on election outcomes could, for example, take into account voter history or other sources of election information. Given the difficulties in disaggregating the impact of Google and the paper’s lack of methodological detail, Mr. Diakopoulos said, “I am skeptical of the validity of the estimates.” Curious about the accuracy of a claim? Email factcheck@nytimes.com.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Amy Chozick, ‘Chasing Hillary’ Author, on Writing Rituals and the Women Running for President",
      "url": "https://www.nytimes.com/2019/08/23/us/amy-chozick-chasing-hillary-author-on-writing-rituals-and-the-women-running-for-president.html?searchResultPosition=13",
      "subtitle": "Plus: her evening ritual, which involves “Bachelor in Paradise” and CBD gummies.",
      "author": "The New York Times",
      "content": " You’re reading In Her Words, where women rule the headlines. Sign up here to get it delivered to your inbox. Let us know what you think at inherwords@nytimes.com. “We don’t all have to be sorority sisters or wear pink on Wednesdays. Women can be large and contain multitudes, too.” — Amy Chozick, on what it means to have multiple female candidates for president Welcome to the In Her Words Elevator Interview — a summer series showcasing the voices of Times writers and editors, which we attempted to conduct inside our (very slow) corporate elevators, but then the elevator broke, and actually that wasn’t really enough time to ask what we wanted to ask anyway, so now we conduct them over email. This week we spoke with Amy Chozick, a Times writer-at-large and best-selling author of “Chasing Hillary,” which documents her decade covering Hillary Clinton’s pursuit of the presidency. IHW: Tell us about your routine. What do you do to start your day and how do you wind down at night? I used to think that I would spend my mornings rocking my baby while listening to Otis Redding, and it’s more like picking up thrown cereal while listening to “Baby Shark.” We’ve usually already gone to Trader Joe’s (pro tip: Trader Joe’s is bliss at 8 a.m. on a weekday) and Target and, depending on the weather, a swing set, by the time the caregiver arrives at 9 a.m. I always walk to get my coffee. This is totally unnecessary as the train is across the street from my house, but the 30-minute walk is my daily ritual, my time to put the chaos of the morning behind me, listen to an audiobook or podcast, and get in the mind-set for work. I get to the office by 9:45 or 10 a.m. After work, on an ideal day, I make it to a cardio dance workout class in my neighborhood. (I have zero rhythm, but five minutes in I feel like the Jewish J-Lo.) I also like boxing because sometimes you need to punch something. I get home by 7 p.m., and start cooking dinner. I could burn toast if left to my own devices, so it’s usually a HelloFresh meal kit. Our son has gotten into the habit of turning off the oven while I’m cooking. This cracks him up. It also adds at least 15 minutes to the process. My husband changes him and puts him to sleep around 8 and we eat dinner. We watch some TV (usually some combination of “True Detective” and “Bachelor in Paradise”). We talk a little and stare at our phones a lot. Around 10 p.m. I’ll take a CBD gummy bear. People say it’s a placebo or snake oil, but don’t knock those little suckers until you’ve tried them. Do you have any writing rituals? Pre-baby, when I was writing my book, I had this whole ritual that involved an iced red eye (cold brew with a shot of espresso), leggings and some real ergonomic jujitsu at my dining room table. That’s impossible now, so I come to the office and listen to jazz. I still need to be heavily caffeinated, but sadly can’t wear leggings. I wish I could write more in the mornings because that’s when I’m the most creative and productive, but, well, “Baby Shark.” The great thing about being a beat reporter for so many years is that you can’t have writer’s block or be picky about creating the perfect environment. You have to just do it … writing on my lap on a campaign bus in rural Iowa really helped me realize that. In moments of self-doubt, how do you build yourself back up? I am constantly doubting myself. We learn as journalists that we’re only as good as our last byline so now that I write features that can take months, I have these long periods when I feel like I have disappeared and will never write another story. I am a failure, a nobody, I will die alone under a pile of tawny newspaper clippings. This is when my editor, Ellen Pollock, says, “Amy, you had a story last week.” Your book documents your time covering Hillary Clinton, and you recently wrote a piece for Vogue about the current cohort of women candidates. What difference do you see in how this new generation of women are rolling out their campaigns? I don’t think we can underestimate how meaningful it is that so many women of so many different backgrounds and beliefs are competing for the Democratic nomination. Think about it — before 2020, we’d never seen multiple women on the presidential debate stage. They have permanently changed our perception of what a presidential campaign looks like and taught us (hopefully once and for all) that women can disagree with each other without it being a catfight. Amy Klobuchar and Elizabeth Warren and Kamala Harris and Tulsi Gabbard all have vastly different visions for the country and guess what? That is fine. Healthy, even. We don’t all have to be sorority sisters or wear pink on Wednesdays. Women can be large and contain multitudes, too. ______ Here are five articles from The Times you might have missed. [Sign up here to get future installments of In Her Words delivered to your inbox.] ______ Three pieces by Amy Chozick you might want to reread. In July 2013, Jill Abramson, the former executive editor of The Times, put Amy Chozick on the “Hillary beat” ahead of the 2016 election. It was 649 days before Mrs. Clinton would announce she was running for president again; 1,226 days before she would lose to Donald Trump. Every major life decision in her 20s and 30s, Ms. Chozick writes in her book — when to get married, where to buy an apartment, whether to freeze her eggs until after the election — had revolved around a single looming question: What about Hillary Clinton? You probably remember the story. How in 1993, Lorena Bobbitt cut off her husband’s penis with a kitchen knife as he slept. How she then disposed of the detached penis out the driver’s side window. How she later told the police where it was, they found it, put it on ice and rushed it to the hospital, where in a nine-hour surgery it was reattached and restored to (almost) full function. In January, Lorena Bobbitt opened up about how that one night changed her life. In the swirl of #MeToo, perhaps no woman has found herself at the center of the storm quite like Gayle King. Millions of viewers have watched, again and again, as she and her co-host Norah O’Donnell of “CBS This Morning” have had to explain — live on air — the alleged misdeeds of executives at their very own network, like Charlie Rose and Leslie Moonves. Last fall, Ms. Chozick interviewed Ms. King about her decades long career in broadcast news.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Caucuses in Iowa Won’t Include Absentee Participation, D.N.C. Says",
      "url": "https://www.nytimes.com/2019/08/30/us/politics/dnc-iowa-virtual-caucus.html?searchResultPosition=12",
      "subtitle": "Iowa Democrats wanted to allow some caucusgoers to vote by phone next year, but committee leaders concluded that such a system would not be secure. They plan to give the state, and Nevada, waivers from new party rules.",
      "author": "Reid J. Epstein",
      "content": " WASHINGTON — The Democratic National Committee said Friday it would recommend exemptions to Iowa and Nevada that would allow them to avoid new guidelines requiring caucus states to allow remote participation without attending a caucus event. The waivers avert, for now, a showdown over voting rules between the committee and early caucus states. The proposed waivers, which are expected to be approved by the party’s powerful rules and bylaws committee, come after D.N.C. leadership signaled it would block plans to allow some caucusgoers in Iowa and Nevada to vote by phone next year, bowing to security concerns about the process being hacked, according to four people with knowledge of the decision. The committee’s announcement serves as a major setback to Democrats who have long hoped to expand the caucus-state electorate beyond those voters able to attend a winter-night gathering for several hours. “People who believe in democracy and believe that people who are working or physically challenged should be able to participate are screwed by this decision,” said Larry Cohen, a D.N.C. member from Maryland who has long advocated allowing absentee participation in caucuses. Mr. Cohen, who was a senior official on the 2016 Bernie Sanders campaign, said Friday that Iowa and Nevada still have time to create a system to participate in caucuses by mail. With five months to go before Iowa’s first-in-the-nation caucuses, it was not clear what alternatives the state’s Democrats have to allow absentee participation. Troy Price, the Iowa Democratic Party chairman, said he would “explore what alternatives may exist to securely increase accessibility from previous years given the time allowed.” “Regardless of today’s news, we remain confident the 2020 Iowa Caucuses will be our best yet, and set the standard for years to come,” Mr. Price said. In August 2018, D.N.C. members voted to adopt new rules for the 2020 presidential primary that encouraged states that held caucuses to switch to primaries and required caucus states to allow for a form of participation that did not require attending an event. Other reforms included reducing the power of the party’s superdelegates. The D.N.C. rules preserved Iowa’s place at the front of the presidential nominating calendar, but in New Hampshire, whose state constitution requires it to hold the first presidential primary, officials are highly sensitive to Iowa’s moves to alter its caucus in ways that make it appear more like a primary. Iowa Democrats said Friday that they feared mailing absentee paper ballots for their caucus would lead the New Hampshire secretary of state, Bill Gardner, to jump his state ahead of Iowa on the presidential calendar. Mr. Gardner has sole authority to set the date of New Hampshire’s primary. The presidential campaigns had spent months training their Iowa volunteers to recruit supporters to participate in the phone caucuses. Now they must revert to how Iowa caucus campaigns have been run for generations, persuading people to attend in-person events on a cold February night. Julian Castro, the former secretary of housing and urban development, called the decision to abandon phone caucuses “an affront to the principles of our democracy.” “As I’ve campaigned in every corner of Iowa, I’ve heard from teachers, home care workers, nurses, single parents, shift workers, and senior citizens who tell me the same thing: One night of caucusing is not enough,” Mr. Castro said Friday. Iowa Democrats, along with party officials in other states, face a Sept. 13 deadline for the D.N.C. to approve plans for their presidential primaries and caucuses. Iowa’s caucuses are scheduled to be held Feb. 3. The Iowa Democrats were proposing a plan that would have allowed voters not attending a traditional caucus to register their preference during one of six “virtual caucuses” over the phone. But D.N.C. security officials told the rules committee at a closed-door session in San Francisco last week that they had “no confidence” such a system could remain safe from hostile hackers. The D.N.C.’s leadership concluded that the technology that exists is not secure and poses too large a risk of interference from a foreign adversary, according to officials with knowledge of the deliberations. Several presidential campaigns expressed concern to top party officials that Iowa’s results could be compromised, people familiar with the discussions said Thursday. The rules and bylaws committee has the power to approve state plans for primaries and caucuses. [Sign up for our politics newsletter and join the conversation around the 2020 presidential race.] The Democratic caucuses in Iowa can be hourslong affairs on often snowy winter nights. The state’s caucus rules require a candidate to receive support from at least 15 percent of the voters in the room; backers of candidates who fail to meet the 15 percent threshold are then freed to choose a different candidate. This leads to haggling and horse-trading between campaigns and places a premium on being a caucusgoer’s second or even third choice. Party forces allied with Hillary Clinton have argued for years that states should shift from caucuses to primaries — or at least make the caucus process more accessible to people who cannot attend in person. Nine states that held Democratic presidential caucuses in 2016 — Alaska, Colorado, Hawaii, Idaho, Maine, Minnesota, Nebraska, Utah and Washington — have switched to primaries for 2020 at the urging of the D.N.C. Six other states, including early-voting Iowa and Nevada, will continue to hold caucuses in 2020. Mrs. Clinton, whose 2008 presidential bid was upended by her third-place finish in Iowa, and who nearly lost the state to Senator Bernie Sanders of Vermont in 2016, had long been a public skeptic of Iowa’s show-up-to-caucus system. “You know, there were a lot of people who couldn’t caucus tonight, despite the very large turnout,” Mrs. Clinton said the night she lost the 2008 Iowa caucuses to Barack Obama. “There are a lot of people who work at night, people who are on their feet, people who are taking care of patients in a hospital, or waiting on a table in a restaurant, or maybe in a patrol car keeping our streets safe.” A February poll from The Des Moines Register found that a virtual caucus could increase participation by a third. The Monmouth University Polling Institute found earlier this month that former Vice President Joseph R. Biden Jr. increased his polling advantage in the state when the survey included Iowa Democrats who planned to participate in the virtual caucus. Democrats of all stripes remain shellshocked by Russian hacking that colored the 2016 election, which included the wide release of Clinton campaign emails and D.N.C. documents.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Dare We Dream of the End of the G.O.P.?",
      "url": "https://www.nytimes.com/2019/09/06/opinion/trump-democrats-2020.html?searchResultPosition=11",
      "subtitle": "In a new book, the pollster Stanley Greenberg predicts a blue tidal wave in 2020.",
      "author": "Michelle Goldberg",
      "content": " Toward the end of his new book, “R.I.P. G.O.P.,” the renowned Democratic pollster Stanley Greenberg makes a thrilling prediction, delivered with the certainty of prophecy. “The year 2020 will produce a second blue wave on at least the scale of the first in 2018 and finally will crash and shatter the Republican Party that was consumed by the ill-begotten battle to stop the New America from governing,” he writes. It sounds almost messianic: the Republican Party, that foul agglomeration of bigotry and avarice that has turned American politics into a dystopian farce, not just defeated but destroyed. The inexorable force of demography bringing us a new, enlightened political dispensation. Greenberg foresees “the death of the Republican Party as we’ve known it,” and a Democratic Party “liberated from the nation’s suffocating polarization to use government to advance the public good.” I’d like to believe it, and maybe you would too. But should we? This is not the first time that experts have predicted the inevitable triumph of progressive politics. Seventeen years ago, John Judis and Ruy Teixeira published “The Emerging Democratic Majority,” which argued that the country was on the cusp of a liberal political realignment driven by growing diversity, urbanization and gender equality. In sheer numerical terms they were right; between then and now the Republican Party won the presidential popular vote only once, in 2004. But Republicans still have more power than Democrats, and in 2017, Judis disavowed his book’s thesis, arguing that only populist economics could deliver Democratic victories. As it happens, Greenberg, who became famous as Bill Clinton’s pollster in 1992 and consulted for Hillary Clinton in 2016, told me he used to “shudder” at the “Emerging Democratic Majority” analysis. “I’m used to campaigns in which you impact what’s going to happen,” he said. “The idea that it’s just going to happen because of trends is dangerous. And it was dangerous with Hillary.” There’s a fascinating tension in “R.I.P. G.O.P.” Greenberg is scathing about the failures of the Hillary Clinton campaign, accusing it of “malpractice.” Yet he believes that at least some of the political assumptions that were mistaken in 2016 will be sound in 2020. Greenberg suggests that Clinton erred by focusing too much on multiculturalism at the expense of class, and by trying to discredit Donald Trump as a vulgarian rather than a plutocrat. As Clinton wrote in “What Happened,” her post mortem of her shattering loss, Greenberg “thought my campaign was too upbeat on the economy, too liberal on immigration, and not vocal enough about trade.” Yet going into 2020, Greenberg believes that what he calls the “rising American electorate” — including millennials, people of color and single women — will ensure Democratic victory, almost regardless of whom the party nominates. “We’re dealing with demographic and cultural trends, but we’re also dealing with people that are organizing and talking to one and another and becoming much more conscious of their values,” he said. In his polling and focus groups, he’s seeing that the reaction to Trump is changing people. “The Trump presidency so invaded the public’s consciousness that it was hard to talk to previously disengaged and unregistered unmarried women, people of color and millennials without them going right to Trump,” he writes. A few months after the election, he realized he could no longer put Clinton and Trump voters in focus groups together because indignant Clinton voters, particularly women, so dominated the conversations. “This turned out to be an unintended test of the strength of their views and resolve to resist,” he wrote. [Listen to “The Argument” podcast every Thursday morning, with Ross Douthat, Michelle Goldberg and David Leonhardt.] That resolve to resist has led many voters to define their own beliefs in opposition to Trump’s. On immigration, for example, “every Trump outrage increased the proportion of Americans who said, ‘We are an immigrant country,’” writes Greenberg. Indeed, according to recent Pew data, 62 percent of Americans say that immigrants strengthen the country, while 28 percent, a near record low, see them as a burden. Yet rather than modulating their anti-immigrant politics in response, Republicans have little choice but to double down, because so many of their voters are driven by nativism. In this way, Greenberg sees an omen for the Republican Party in California. It’s hard to remember now, but the state was once the heartland of conservatism, nurturing the political careers of Richard Nixon and Ronald Reagan. From 1968 to 1988, it voted Republican in every presidential election, and regularly elected Republican governors. But in 1994, California Republicans, fearful of changing demography, campaigned for Proposition 187, a ballot initiative meant to make life miserable for undocumented immigrants. It won — though courts blocked its implementation — but it also turned expanding constituencies in California against Republicans. Today the party has been reduced to an irrelevant rump faction in state politics. The specter of California haunts the modern right; many conservatives see it as a portent of what demographic change will do to Republican power nationally. But California can just as easily be seen as a sign of how a political party can drive itself to ruin by making a cruel, doomed stand against the coming generation. If Greenberg is right, national Republicans, fearful of going the way of those in California, may have ensured precisely that fate. But is he right? Unlike in California, you can’t win power in the United States just by getting the most votes. The political analyst David Wasserman has argued that Trump could lose the popular vote by as much as five million and still prevail in the Electoral College. Greenberg, however, is convinced that the 2018 midterms prove that mass turnout can overcome the Democrats’ structural disadvantages. “Every piece of data I have, the trends have moved to be more Democratic since 2018,” he said. His confidence will not be enough to lessen the insomnia that has plagued me since the cursed night when Trump was elected. But his book should be a corrective to the media’s overweening focus on the mulish devotion of Trump voters. Trump hatred is a much more potent force in this country than Trump love. There is one way, and one way only, that Trump may surpass Barack Obama. Though Obama was a community organizer, Trump could turn out to be much better at mobilizing progressives.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Amid Diplomatic Strain, House Opens Inquiry Into Trump’s Dealings With Ukraine",
      "url": "https://www.nytimes.com/2019/09/09/us/politics/trump-ukraine-house-investigation.html?searchResultPosition=10",
      "subtitle": "null",
      "author": "Kenneth P. Vogel",
      "content": " WASHINGTON — The White House delayed a package of military assistance to the new government in Ukraine, and has yet to schedule a White House meeting for its new president. After abruptly pulling the previous American ambassador out of Kiev when conservatives questioned her political loyalty, President Trump has yet to nominate a successor. Behind the scenes, Mr. Trump has told aides that he sees Ukraine as corrupt and suggested that he harbored a grudge from what he saw as that nation’s support for Hillary Clinton in 2016. At a time when foreign policy experts and Mr. Trump’s aides say strong support from the United States is especially important to Ukraine in its effort to fight corruption and stop further encroachment by Russia, Mr. Trump has left Ukrainians and some of his own allies uncertain about the degree of his commitment to the government of the newly elected president, Volodymyr Zelensky, according to interviews with people in both countries. The diplomatic strains come on top of concerns about efforts by Mr. Trump’s personal lawyer, Rudolph W. Giuliani, to press Mr. Zelensky’s government to pursue investigations into two matters that date from the previous government and could be politically beneficial to Mr. Trump. One relates to involvement in Ukraine by former Vice President Joseph R. Biden Jr. and his family. The other relates to accusations that Ukrainian government officials improperly aided Mrs. Clinton by seeking to sabotage Mr. Trump’s 2016 campaign. On Monday, three House committees announced that they were opening a wide-ranging investigation into whether Mr. Trump and Mr. Giuliani were misappropriating the American foreign policy apparatus for political ends. In letters to the State Department and the White House, the chairmen of the House Foreign Affairs, Intelligence and Oversight Committees asserted that it would be “a staggering abuse of power, a boon to Moscow and a betrayal of the public trust” if Mr. Trump was withholding the military assistance to “improperly pressure the Ukrainian government to assist the president’s bid for re-election.” Across Washington’s foreign policy community, there is broad optimism that Mr. Zelensky’s government has a chance to finally put an end to twin scourges that have plagued Ukraine, a close American ally — corruption from inside and Russian incursions from the east. Publicly, Mr. Trump’s administration has suggested that the hiccups in Ukrainian relations are more related to bureaucracy and logistics than to politics. In private, though, the president has been more adversarial, declaring in May that all Ukrainian politicians are “corrupt,” and that the Ukrainian government “tried to take me down,” according to people familiar with an Oval Office briefing delivered by a United States government delegation that had recently returned from attending Mr. Zelensky’s inauguration in Kiev. The delegation had been impressed by Mr. Zelensky, and had encouraged Mr. Trump to assist the new government. The White House did not respond to questions about the meeting. Vice President Mike Pence denied last week that the delay in releasing military assistance was in any way related to Mr. Giuliani’s efforts to convince the Ukrainians to investigate matters related to the family of Mr. Biden, who is the early front-runner for the Democratic presidential nomination. But, after a meeting with Mr. Zelensky on the sidelines of a commemoration of the outbreak of World War II, Mr. Pence said he and Mr. Trump “have great concerns about issues of corruption.” Without detailing those concerns, Mr. Pence linked them to the military assistance, telling reporters “to invest additional taxpayer in Ukraine, the president wants to be assured that those resources are truly making their way to the kind of investments that will contribute to security and stability in Ukraine.” Mr. Zelensky’s office did not immediately respond to questions emailed after business hours in Kiev. But Senator Christopher S. Murphy, a Connecticut Democrat who serves on the Foreign Relations Committee and met with Mr. Zelensky last week, said the Ukrainian president, a political neophyte who had been a comedian before winning the presidency, seemed confused about why the assistance was being withheld. “The first question President Zelensky asked us was whether we knew anything about the security aid,” Mr. Murphy said. “There seems to be very little understanding from anyone in the government as to why the aid has been withheld or what they need to do in order to get it released.” Mr. Murphy said he urged Mr. Zelensky not to heed the requests from Mr. Giuliani, warning that to do so could threaten bipartisan support for Ukraine in Washington, which Mr. Murphy called Ukraine’s “most important asset.” It would be “disastrous for long-term U.S.-Ukraine relations,” Mr. Murphy said, if Mr. Zelensky were seen as basing prosecutorial decisions on pressure from Mr. Trump’s political allies. Mr. Murphy rejected the suggestion that his advice to Mr. Zelensky constituted meddling in Ukrainian affairs similar to Mr. Giuliani’s efforts, which he had previously called “private foreign policy engagement” and into which he had sought an investigation. “If there are investigations that influence American politics one way or another, but the foundations of those investigations are based upon facts rather than political requests, I think that’s legitimate,” Mr. Murphy said. Mr. Giuliani on Monday welcomed the congressional investigation, asserting that he was acting “at the request of the State Department and with the assistance of the State Department” — a reference to communications with an aide to Mr. Zelensky that were brokered partly by Kurt D. Volker, the United States envoy to settlement talks in Ukraine’s war with Russia. The Ukrainian aide, Andriy Yermak, a close ally of Mr. Zelensky, has said that it was not clear to him whether Mr. Giuliani was representing Mr. Trump in their talks. But Mr. Giuliani said he was acting only as Mr. Trump’s private lawyer in those talks, during which he urged Mr. Yermak to pursue investigations. “If I didn’t do it, I wouldn’t be a good lawyer, I wouldn’t be defending him,” Mr. Giuliani said. “The Ukrainian government is uniquely situated to dig up facts that would vindicate my client.” Mr. Giuliani has requested an inquiry into documents released during the 2016 campaign reflecting payments earmarked to Paul Manafort for earlier work in Ukraine. Mr. Manafort went on to become Mr. Trump’s campaign chairman, but when The New York Times published a report including excerpts from the documents, it led to Mr. Manafort’s resignation from the campaign. He has since pleaded guilty to charges brought by the special counsel related to his work in Ukraine, and is serving a seven-and-a-half-year prison sentence. Mr. Giuliani has questioned the authenticity of the documents, and suggested that an investigation into them could undermine the special counsel’s investigation. He has also called for an investigation into the overlap between Mr. Biden’s diplomacy in Ukraine and his son’s involvement in a gas company owned by a Ukrainian oligarch. Mr. Trump has suggested that he would like Attorney General William P. Barr to look into both matters. In their letters to the White House and the State Department, the chairmen of the three House committees sought records related to the Biden and Manafort matters, and warned against linking the military assistance to the push for investigations of the matters. Representative Adam B. Schiff, a California Democrat who is the chairman of the Intelligence Committee, said in a statement that “whether or not this improper pressure is made explicitly, it cannot be lost on a country desperate for American military assistance that the president of the United States wants its government’s help in his re-election campaign in the form of damaging information on his political opponent.”",
      "date": "Sept. 9, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "United We Stan",
      "url": "https://www.nytimes.com/2019/09/11/arts/united-we-stan.html?searchResultPosition=9",
      "subtitle": "null",
      "author": "Amanda Hess",
      "content": " Whatever persona Elizabeth Warren hopes to project in her presidential campaign, it is probably not that of a child witch. But that is the persona that some of her biggest fans have chosen for her. Images of Hermione Granger, played in the “Harry Potter” films by a young Emma Watson, materialize at Warren’s every move. Warren steps onto the debate stage, and her fans craft tweets where Hermione stands in as her, rolling her eyes at the boys in wizarding class. Warren reads the whole Mueller report, and Hermione smugly wags her wand. In one extremely cursed tweet with zero likes, Warren’s face is transplanted onto Hermione’s frame, posed alongside Beto O’Rourke as Harry and Pete Buttigieg as Ron Weasley. What is this strange chimera of presidential campaigning: a candidate’s head on pop culture’s body? It is the product of a great convergence between politics and culture, citizenship and commerce, ideology and aesthetics. Civic participation has been converted seamlessly into consumer practice. It is democracy reimagined as fandom, and it is now a dominant mode of experiencing politics. You can see it in the efforts to sort the candidates into “Harry Potter” houses, converting the election to a personality quiz in a children’s book, and in the mash-up video that distills the 2020 candidates into quotes from Michael Scott, the buffoonish boss of “The Office.”  A photograph of three Congresswomen of color is published and instantly compared to a Whitney Houston GIF, as if women interrogating Michael Cohen are analogous to Houston confronting her cheating boyfriend. Politicos of all stripes are styled as saints and stamped onto novelty devotional prayer candles. Here, political engagement slips easily into the habits of consumption. President Trump’s fans follow him around the country like groupies, and Nancy Pelosi’s boosters fetishize her funnel-neck coat as a symbol of the #resistance. Candidates’ supporters now identify as stans — a term derived from the 2000 Eminem song about a fan who becomes so obsessed, he kills. Political stanning has a way of remapping the landscape of mainstream politics — maybe even overwriting physical reality itself. Frantic online cultural production swarms around Justice Ruth Bader Ginsburg whenever she experiences a health scare, as if memes alone could sustain the octogenarian’s life. Trump’s fans imbue him with improbable prowess when they edit him into pro-wrestling videos showing him smacking down CNN. But perhaps the most explicit riff on the trend was the infamous Beto O’Rourke sex tweet, which translated his political positions into sexual ones. On its surface, stuff like the spiriting of Warren’s image into the world of Harry Potter is an innocent internet parlor game. But the fan-fictioning of political candidates can be a dark art, too. The power to viscerally manipulate Warren’s image can be used to undermine her ideas rather than boost them. Take the “Elizabeth Warren always” meme that swept Twitter this summer: Though it warmly characterizes her as a relatably decent person (“Elizabeth Warren always replaces the toilet paper” and “Elizabeth Warren always boards with her correct boarding group”), it has a way of obscuring her political message. As Warren advocates progressive reforms, the meme is fundamentally conservative in its valorization of the polite competency of the individual. The Hermione comparison also flattens Warren’s pitch into just two facets of her persona — her gender and her smarts. It also traps Warren in the same pop cultural avatar that Hillary Clinton’s fans bestowed on her in 2016, which has a way of eliding the substantial ideological gulf between the two women. When politicians are converted into culture, often the first thing that’s lost is the politics. As one critic wrote in response to a 30-GIF thread offering “proof” that Warren “is Hermione Granger”: “Delete this immediately we are going to lose.” HOW DID WE GET HERE? You could spot the roots of political fandom in the sarcastic sign-waving crowd of the “Rally to Restore Sanity and/or Fear,” Jon Stewart and Stephen Colbert’s 2010 effort to convene Comedy Central viewers for an exercise in preaching political moderation. Or in Barack Obama is Your New Bicycle, the 2008 single-serve website that surfaced pleasing fictions about the candidate, including “BARACK OBAMA FOLDED YOUR LAUNDRY.” But before that, the phenomenon was a little harder to spot. There has long been a political valence to pop culture, and, separately, a fan participation that bordered on grass-roots activism. Fifty years ago, the original “Star Trek” series exemplified the former, and viewers’ efforts to keep it on the air the latter. But before the rise of crowdsourced platforms, politics and pop-culture converged only when media and campaign gatekeepers wanted them to: when a political cartoonist drew Dick Cheney as Darth Vader, or when a teenager asked Bill Clinton about his underwear at an MTV town hall, or when Frank Sinatra reworked a hit for John F. Kennedy’s campaign. Now, just about anyone can mash the two together. Fan culture’s political takeover is obviously accelerated by the internet, but it does not represent a replacement of corporate media or political machines. It’s more in negotiation with them. It isolates moments from the mainstream — like this week’s Democratic primary debate — and shoots them off in new directions, layered with additional meanings. Andrew Slack, the creator of the Harry Potter Alliance — a real nonprofit dedicated to making social change inspired by a fake hero — calls such practices “cultural acupuncture.” They’re fantasy worlds poking holes in society’s skin. Even as our politics is translated into the language and aesthetics of pop culture, the opposite is happening, too: Cultural products are being weighted with great political significance. Comedians like John Oliver and Trevor Noah deliver the news. Fans of television shows crib from activist playbooks: A Los Angeles woman recently staged a hunger strike to protest Netflix’s cancellation of the sci-fi series “The OA.” Meanwhile, some liberals are protesting Trump and his allies not by taking to the streets but by skipping SoulCycle. And when the reality television personality Kylie Jenner threw a birthday party themed around a friend’s favorite show, “The Handmaid’s Tale” — with guests dressed in red cloaks and white bonnets, sipping themed cocktails like “Praise Be Vodka” — the internet threw a fit. Before Jenner tied on the bonnet, the costume had been co-opted by abortion rights activists. The subtext of the outrage was this: A pre-existing political connotation automatically subsumes a frivolous but harmless one. A TV show is serious politics now, not entertainment. THERE IS GREAT OPPORTUNITY to be found in the fanning of politics — for candidates, corporations, and sometimes, even for us. When civics is converted into a pop culture product and set loose online, it is capable of engaging people who might not otherwise participate. And networks of fans aren’t just used to generate content; they can also mobilize when news breaks or polls open. Enthusiastically memeing Elizabeth Warren into a treasured fantasy world drums up attention and energy that theoretically align with grass-roots campaigning. The media scholar Henry Jenkins has likened photoshopping a meme to writing a letter to the editor: just another mold for citizenship, cracked open to new groups. Besides, experiencing politics as fandom is not necessarily more harmful to our self-rule than, say, the horse race analogy sometimes favored by the traditional political media, which promotes campaigns’ competitive acumen at the expense of the likely consequences of the outcomes. Memes do carry values across the culture, even if subtly or strangely. Styles of humor vary markedly between political perspectives. A pop cultural alliance can open a window on a candidate’s priorities, or so we have come to think. Aesthetics have become the shorthand for ideas. It’s not that a politician’s actual politics have become unimportant in these fandoms, but they have become sublimated into spectacle. A candidate’s political reputation — as a centrist or a radical, a liberal or a conservative, independent or corporate — helps inform the online personality that is built up around her, and from there it is inflated or distorted by cultural clues. All this can make people feel like they have a great deal of control over the political process. But this feeling can be deceptive. Citizens may be the ones creating material about the candidates, but they are also helping to build cults of personality around politicians that erode their accountability. Fandoms are fundamentally about promoting their central celebrity, not holding them to account. Our political representatives are supposed to work for the people, but fandoms reverse that proposition: They make us work for them. And this is questionable work that we are doing. The point of translating politics into pop culture may be to make it more accessible, but it can also make politics feel oddly remote — as if it is all just a television show to watch, or a fantasy novel to read, or a game to play. And while presidential candidates need to pitch a wide tent, swaying other people — people who are not like them — to their cause, stans are intrinsically agents of exclusion, posturing above those who don’t already agree with them or just don’t get the jokes. Though political stans ostensibly exist to promote their favorite candidates, you get the sense that they are also looking to build micro-fandoms around their own online personalities. This is a time when social activity — talking with friends, creating media and offering commentary — can be styled as political in and of itself. Activism slips easily into discourse; our idea of what it means to “do something” has become almost indistinguishable from talking about it. The stanning of the presidency is a fresh form of civic engagement, but it is an agent of disengagement, too. It is a new way of seeing democracy, and of obscuring it. In 2019, the democratic nature of online creation masquerades as democracy itself.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "null",
      "url": "https://www.nytimes.com/interactive/2019/09/11/arts/how-fan-culture-is-swallowing-democracy.html?searchResultPosition=8",
      "subtitle": "null",
      "author": "Amanda Hess",
      "content": "",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "‘The New Berlin Wall’: Why Ukraine Is Central to the Scandal",
      "url": "https://www.nytimes.com/2019/09/27/world/europe/ukraine-zelensky-cold-war-trump-giuliani.html?searchResultPosition=7",
      "subtitle": "null",
      "author": "Andrew Higgins",
      "content": " IVANO-FRANKIVSK, Ukraine — His voice crackling over what he complained was a “terrible” sound system, Donald J. Trump in September 2015 heaped praise on the oligarch who had invited him to speak by video link from New York to a conference in Kiev, the capital of Ukraine. The Ukrainian oligarch, Victor Pinchuk, had secured 20 minutes of Mr. Trump’s time — and a heap of flattery from the future president, who described him as “a very, very special man” — with a donation of $150,000 to Mr. Trump’s now defunct foundation. Mr. Pinchuk, a steel magnate long enmeshed with Ukraine’s business and political elite, had earlier donated more than $10 million to the Clinton Foundation and been invited to dine at the Washington home of Hillary and Bill Clinton. The equal opportunity largess of powerful Ukrainians like Mr. Pinchuk helps explain why so many of the most dimly lit and hazardous roads of American politics keep leading back to Ukraine, a poor, dysfunctional country on Europe’s eastern fringe. [Read more about how Ukraine landed in the middle of an American political drama.] Caught between the clashing geopolitical ambitions of Russia and the West, Ukraine has for years had to balance competing outside interests and worked hard to cultivate all sides, and also rival groups on the same side — no matter how incompatible their agendas — with offers of money, favors and prospects for career advancement. Paul Manafort, Rudolph Giuliani, former Vice President Joseph R. Biden Jr.’s son Hunter and Hillary Clinton have all, at one time or another, found their way there, escorted by Ukrainian guides with deep pockets and a keen sense of how to appeal to their vanities, ambitions and greed. “The fact is Ukraine is an amazing place,” Mr. Trump told Mr. Pinchuk’s conference in 2015. “I’ve known so many people over so many years in the Ukraine.” He told Ukraine’s new president, Volodomyr Zelensky, much the same thing this week when they met in New York, though the only specific person from Ukraine he wanted to tell Mr. Zelensky about was a former Miss Universe contestant. Ukraine, said Serhii Plokhy, a Harvard historian whose books include “The Gates of Europe: A History of Ukraine,” has for centuries been tugged in different directions by rival suitors, and became a “battlefield” between Russia and the West when it declared its independence from the Soviet Union in 1991. “The front lines are always places that attract both heroes and villains who go there from world capitals to make a name, advance a career, make a fortune, etc. — and then carry back home legacies, memories and skeletons for their closets,” Mr. Plokhy said. Ukraine’s allure for American carpetbaggers, political consultants and adventurers has put it at the center of not just one but now two presidential elections in the United States and a host of second-tier scandals. Before becoming Mr. Trump’s campaign manager before the 2016 election, Mr. Manafort made millions of dollars in Ukraine, working as an adviser to the country’s leadership out of an office in Kiev. Mr. Giuliani — who has also wound up working with opposing sides in internal Ukrainian battles — has repeatedly looked to the same city and a new set of Ukrainian leaders for dirt on Mr. Trump’s political foes ahead of the 2020 election. Yevhen Hlibovytskyi, a lecturer in philosophy at the Ukrainian Catholic University, said Ukraine’s pivotal position in geopolitical struggles had made Kiev, a picturesque capital of cobblestoned streets on the Dnepr River, into the 21st century’s equivalent of Cold War dens of intrigue like Vienna and Berlin, or Casablanca during World War II. “Ukraine is the country that hosts the Berlin Wall at the moment,” he said. “Ukraine is the country where the clash between the free and unfree world takes place. It’s only natural that some players will be seeking protection in the West,” sometimes by crossing palms with silver. Put upon over the centuries by more powerful neighbors claiming their land, notably Russia, Poland and the Austro-Hungarian Empire, Ukrainians have rarely had firm allies or even their own functioning state, a situation that has encouraged a highly transactional approach to foreign and also domestic affairs. Unlike Russia, ruled since the time of Ivan the Terrible in the 16th century by a single, strong leader, usually a tyrant, Ukraine has always been a land of competing power centers. This has made it a fertile ground for democracy but also left it a highly fractured nation with an ever shifting constellation of feuding power-brokers who often look to foreigners for help in their internal struggles. The whistle-blower’s complaint released on Thursday revealed how Mr. Giuliani, Mr. Trump’s personal lawyer, played into this dynamic, focusing his efforts to get Mr. Biden and his son investigated on a group of senior law-enforcement officials in Ukraine who had been locked for months in a bitter turf war with rival factions within the same state structure. The officials Mr. Giuliani sought out in the name of fighting corruption were engaged in a long feud with Ukraine’s National Anti-Corruption Bureau. The bureau, which has worked closely with the F.B.I. and was set up in 2014 with strong support from the Obama administration, is one of the few government agencies in Ukraine that Western diplomats in Kiev view as reasonably honest and competent. Mr. Giuliani has his own business history in the country as well. More than two years ago, his company, Giuliani Security and Safety, signed a contract with a wealthy Ukrainian, Pavel Fuks, to consult on emergency planning in Mr. Fuks’s hometown, Kharkiv. At the time, Mr. Fuks and others had become entangled in a complicated $1.5 billion deal to buy Ukrainian government bonds. In an investigation, Al Jazeera reported that the real sellers were sanctioned former insiders in the government of the disgraced former president of Ukraine, Viktor F. Yanukovych. Political survival in Ukraine has for centuries often hinged on finding a strong patron abroad. This sometimes led to disaster, most famously in the case of Ivan Mazepa, the Cossack leader of an embryonic state in eastern Ukraine in the 17th century. Initially an ally of Peter the Great of Russia, Mazepa, worried by the rise of powerful Cossack rivals, switched sides to ally with Russia’s great enemy at the time, Sweden, which he thought would offer protection. Instead, it led him to crushing defeat by Russia at the Battle of Poltava in 1709. “Ukrainians all the time tried to form an alliance with the stronger side,” said Volodymyr Yermolenko, editor in chief at Ukraine World, an online magazine. Mazepa, despite his defeat, is revered as a national hero in Ukraine for trying, albeit with catastrophic consequences, to hold Russia at bay by finding a powerful patron in the West. Mr. Manafort, Mr. Trump’s former campaign manager and now a convicted fraudster, made a fortune in Ukraine by convincing its since toppled pro-Russian president, Viktor F. Yanukovych, that he could, for a hefty fee, help woo Europe and blacken the reputation of his main political rival, Yulia Timochenko, who had been thrown in jail. Mr. Biden’s son Hunter earned at least $850,000 for serving on the board of a Cyprus-registered Ukrainian gas company that needed help in cleaning up its image after falling foul of anticorruption investigators in Ukraine. The company insisted it was the victim of internal score-settling. Yevhen Mahda, director of the Institute of World Policy, a research group, compared Ukraine’s recruitment of people like Mr. Manafort to the medieval practice of paying the Catholic Church for “indulgences,” which were supposed to reduce God’s punishment for sinful behavior. “A lot of Ukrainian politicians have this stereotype that you pay an influential figure in the West, from Europe or America, and they will cleanse you of your sins,” he said. The pursuit of foreign protectors and patrons has been a common feature of Ukraine’s political and business elite, no matter what their own political leanings. Ukraine’s former president Petro O. Poroshenko, elected after street protests toppled his pro-Russian predecessor in February 2014, made good relations with the Obama administration his top foreign relations priority and then invested heavily in wooing the Trump administration, despite having favored Mrs. Clinton in the 2016 election. Mr. Poroshenko’s eagerness to win over Mr. Trump and his growing fears that political rivals would thwart his re-election opened the way for Mr. Giuliani to press Ukraine’s prosecutor general, Yuri Lutsenko, who has since been fired, to help Mr. Trump’s own re-election by investigating Mr. Biden and his son. How Mr. Poroshenko expected the Trump administration to help lift his sagging fortunes ahead of Ukraine’s presidential election, held in two rounds in March and April this year, is unclear. He got trounced anyway, losing emphatically to Mr. Zelensky, whose own officials quickly became the Trump team’s new targets in its drive to damage Mr. Biden. While Democrats want Mr. Trump impeached over his dealings with Ukraine, the president and his allies have counterattacked with their own Ukraine-focused scandals. They have revived a debunked theory that the country colluded with the Clinton campaign to hurt Mr. Trump’s chances in 2016 and asserted, with little evidence, that Mr. Biden used his position as vice president to prevent Ukraine from investigating his son. Ukrainians, jaded after years of watching their own leaders trade the power and privileges of office for personal financial or political gain, have mostly shrugged off what, for Mr. Trump, is possibly the most serious scandal to buffet the White House since Watergate toppled President Richard Nixon in 1974. That a country few Americans paid much attention to in the past now commands center stage in Washington has stirred mostly bemusement in Ukraine. Those feelings are also tinged with a touch of pride that, after centuries in the shadow of Russia, its giant neighbor to the east, the nation is no longer seen as a backwater but a pivot around which the fate of the world’s most powerful country implausibly turns. Pavlo Klimkin, Ukraine’s foreign minister under Mr. Poroshenko, said in a wry Twitter message this week that going down in history “as the country that led to the impeachment of the U.S. president” was “not a very fun prospect.” But, he added, “Now everyone understands what we are capable of.”",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "The Shark-Infested Waters of Trump’s Tweet-Filled Weekend",
      "url": "https://www.nytimes.com/2019/10/01/arts/television/late-night-trump-australia-impeach-twitter.html?searchResultPosition=6",
      "subtitle": "null",
      "author": "Trish Bendix",
      "content": " Welcome to Best of Late Night, a rundown of the previous night’s highlights that lets you sleep — and lets us get paid to watch comedy. If you’re interested in hearing from The Times regularly about great TV, sign up for our Watching newsletter and get recommendations straight to your inbox. As the House moves forward with the impeachment inquiry into President Trump, a report published Monday detailed Trump’s asking the Australian prime minister to help discredit the Mueller investigation. Hillary Clinton weighed in on Mike Pompeo’s participation in Trump’s call to Ukraine while appearing on “The Late Show” with her daughter Chelsea. Rachel Maddow will chat with Colbert about her new book, “Blowout,” on Tuesday’s “Late Show.” That DreamWorks’ new animated film, “Abominable,” centers on a Chinese-American family is still somewhat unorthodox. But even rarer: The studio hired a cast of Asian-American actors to voice its Asian characters.",
      "date": "Oct. 1, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Biden’s Strategy for Managing the Ukraine Story",
      "url": "https://www.nytimes.com/2019/09/25/us/politics/joe-hunter-biden-ukraine.html?searchResultPosition=5",
      "subtitle": "Wary of the way Republicans and President Trump attacked Hillary Clinton in 2016, the Biden camp is looking for ways to control the story line.",
      "author": "Lisa Lerer",
      "content": "  WASHINGTON — When a reporter asked former Vice President Joseph R. Biden Jr. on Saturday if he had spoken to his son Hunter about his work in Ukraine, Mr. Biden jabbed his finger repeatedly at the reporter and shot back: “Ask the right questions.” A few hours later, when coverage of President Trump’s phone call to Ukraine’s president about Mr. Biden and his son had reached a fever pitch, the Biden campaign emailed the news media to declare — in bold underlined words — that any story would be “misleading” if it did not state upfront that Mr. Trump’s claims were unsubstantiated. On Sunday night, the Biden campaign released a fund-raising appeal on Twitter asking, “Will media see through Trump’s sleazy playbook? Or fall for it again?” And by Tuesday, the drumbeat of warnings to the press had grown so intense that even Lanny Davis, a longtime Democratic operative, weighed in, attacking “innuendo journalism.” For the past three years, every Democratic campaign, politician and activist has operated in the shadow of Hillary Clinton’s 2016 loss, caught in a cycle of self-recrimination and soul-searching about how to defend themselves against Mr. Trump and his Republican allies in 2020. It’s a conversation that began in the hours after Mrs. Clinton’s unexpected loss, as aides reckoned with their inability to defend her from Mr. Trump’s conspiratorial accusations, and has continued ever since, with Mrs. Clinton herself dispensing advice in private conversations with Democratic primary candidates as they prepared to begin their campaigns. Now, Mr. Biden and his team think they have the answers. Among their conclusions: There are no guardrails. No one else will fight your battles. Responding to accusations from Mr. Trump and his allies — even to deny them — only gives them oxygen. And haranguing the referees in the media is a must. Former Senator Bill Nelson of Florida, who has endorsed Mr. Biden, has advanced the campaign’s argument that the news media has a unique responsibility to provide the proper context for accusations being tossed around in the political arena — a duty he and other Biden backers say they failed to do in 2016. “In the old days when the truth was something that was respected and the press could be a source of the truth, that was one thing,” said Mr. Nelson. “Now when you have a player on the political stage that will say anything and has been shown to not tell the truth over and over and over, freedom of the press means that there is a new responsibility of the press.” Former Gov. Terry McAuliffe of Virginia, a Democrat who is unaligned in the primary, was even blunter: “The coverage of the emails was ridiculous,” he said. “It gave Biden license to come out and say, ‘Are you kidding me? We’re not going through this again.’” Frank Sesno, a former broadcast journalist and the director of the School of Media and Public Affairs at George Washington University, said ignoring questions about Hunter Biden altogether would be irresponsible journalism. “I have not seen egregious, irresponsible reporting at all,” he said, adding, “When the president of the United States says something publicly, you can’t make that go away and no responsible news organization is going to ignore it.” Senior aides on the Biden campaign argue that the Clinton campaign was not forceful enough in responding to the long drip of stories about her use of a private email server and the Clintons’ family foundation. Those news reports, they argue, only helped to feed Mr. Trump’s narrative that his rival was an untrustworthy creature of Washington. Rather than litigate the specifics in public, Biden aides and allies argue that Mrs. Clinton and her team should have focused more on privately shaming the media out of investigating allegations, while leaving Mrs. Clinton focused on attacking Mr. Trump and delivering her own message to voters. The allies spoke on condition of anonymity to disclose conversations about campaign strategy. “Democrats are very wary of a candidate being Hillary-ed going into 2020,” said Zac Petkanas, the director of rapid response for Clinton’s 2016 campaign. Karen Finney, a former Clinton campaign spokeswoman who is unaligned in the 2020 race, said Democrats “spent a lot more time talking about Hillary Clinton’s emails than we should have, given some of the more glaringly troubling actions of Trump.” Unlike Mrs. Clinton, Mr. Biden is unlikely to ever spend time diving into the details of the allegations, aides say, fearing that doing so would allow Mr. Trump’s allegations to further hijack the national political conversation. Former Iowa Gov. Tom Vilsack, who hosted a Biden campaign in his front yard but has yet to endorse any candidate for president, said, “He understands that you can’t let something like this go.” “But you have to be thoughtful about how you respond to it so that you don’t let the president, with all of his capacity to impact folks like you to write what he says every day, to control the complete narrative,” he added. Throughout the 2020 race, Mr. Biden has pitched himself as the strongest candidate to combat Mr. Trump’s attacks. Whether combating Mr. Trump through the mainstream media proves correct will provide voters with a critical, real-time test of his strength, as allegations that Mr. Trump pressured the president of Ukraine to open a corruption investigation of Mr. Biden and his son Hunter are at the heart of a political firestorm that prompted Democrats on Tuesday to begin impeachment proceedings. Mr. Biden’s rivals, too, are watching closely: While they have responded to the developments on Ukraine by denouncing Mr. Trump’s actions, several camps are privately gaming out how they would handle a similar onslaught from the president and his allies. “We’ve got to remember that they’ll either find a vulnerability or they’ll invent one for everybody,” Mayor Pete Buttigieg of South Bend, Ind., told reporters traveling on his campaign bus. But even some opponents privately worry that this moment could elevate Mr. Biden’s campaign if he handles it deftly, putting the former vice president on equal footing with the president and making it hard for his rivals to get their share of attention. “Trump’s lost it and he’s terrified of Biden, and Biden’s not going to take any of his guff at all,” said Mr. McAuliffe. “This is actually good for Joe Biden. It puts him right at the forefront.” There is no evidence so far to support Mr. Trump’s claim that Mr. Biden improperly intervened to help his son’s business in Ukraine. But that hasn’t stopped the Trump campaign from pushing the allegations, giving Mr. Biden the nickname “Quid Pro Joe.” (Mr. Trump himself seems to be sticking with “Sleepy Joe.”) During a fund-raiser in Baltimore on Tuesday night, Mr. Biden fired back with a moniker of his own: “He loves nicknames. I’d like to give him a new nickname — former President Trump.” Keeping the focus on beating Mr. Trump is an approach Mr. Biden has held since the final weeks of the 2016 campaign, when he urged the Clinton team during his weekly meetings with her staff to avoid debating topics like the “Access Hollywood” tape. “I said, ‘I respectfully recommend she stand there and say, everybody knows who Donald Trump is, let me tell you what I’m going to do for the country,’ and not get into the debate, because it just drags it down,” Mr. Biden told voters in New Hampshire earlier this month. The stories about Mrs. Clinton’s email server and family foundation fed into an already existing narrative of corruption that Republicans had been pushing for decades; that is a challenge Mr. Biden does not face. For decades, he was consistently ranked one of the least wealthy members of the Senate. The allegations against Mr. Trump — that he used the power of his office to influence a foreign government to help him politically — are also far more serious than during the 2016 race. “Biden doesn’t have to answer for nothing,” said James Carville, the Democratic strategist and longtime adviser to the Clintons. “There’s one story here. The president of the United States tried to sic a foreign government on a political opponent.”",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez and the Political Cost of Hair",
      "url": "https://www.nytimes.com/2019/10/11/style/alexandria-ocasio-cortez-hair-cost.html?searchResultPosition=4",
      "subtitle": "Why are we so obsessed?",
      "author": "Vanessa Friedman",
      "content": " Hair has once again caused a political tempest in a blow dryer. This week, the Washington Times published a story saying that Representative Alexandria Ocasio-Cortez had spent $80 on a haircut and $180 on color at a Washington, D.C. salon, a styling choice the newspaper presented as hypocritical, given she “regularly rails against the rich and complains about the cost of living inside the Beltway.” Almost immediately, charges of sexism and superficiality began to fly online (also, a debate about the average price of a woman’s haircut, and how little men seem to understand the cost of certain aspects of life). Ms. Ocasio-Cortez herself tweeted out a statement, saying that Vice President Mike Pence “used *taxpayer funds* — not personal ones — to spend several thousand haircuts’ worth of public money on a visit to Trump golf courses.” It would be easy to dismiss this as mere distraction, except it is also the latest in a long line of hair-related controversies in the corridors of power that have surrounded both men and women. Hair is, it seems, a particularly — well, tangled, subject. Not to mention an equal-opportunity target. Hillary Clinton acknowledged it in 2014, when she joked that the subtitle of her memoir, “Hard Choices,” should be “The Scrunchie Chronicles: 112 Countries and It’s Still All About My Hair.” Though Mrs. Clinton is probably the most famous hair lightning rod, whether it was her chopping and changing while in the White House as first lady (seen as reflecting the opportunism of her husband’s policies), her I-don’t-care-I’m-getting-down-to-work scrunchies as secretary of state, her John Barrett styling trip while on the campaign trail (average price per cut: $600) or her postelection lank and limp blues, she is far from the only politician scrutinized. Her husband was also mocked as far back as 1993 for having a plane wait on the tarmac in Los Angeles while he received a trim from Cristophe of Beverly Hills. The New York Times reported: “Questions about Mr. Clinton’s runway razor cut dominated the White House news briefing today, with the communications director, George Stephanopoulos, scrambling to explain why the populist President tied up one of the country’s busiest airports to have his hair trimmed.” John Edwards, of course, became something of a poster boy for follicular faux pas during the 2007 presidential campaign when it was revealed he had indulged in two haircuts totaling approximately $800 at a time when he was attempting to sell himself as a champion for working class Americans. It’s not just an American obsession. In 2016, François Hollande, then the president of France, came under fire for a reported $10,000 a month styling bill, which was seen as inappropriate for a socialist (it even got its own hashtag: #Coiffuregate). During the 2015 Canadian election, Justin Trudeau’s hair, which, in its lushness, seemed to represent his youth and privilege, had its own Twitter account — @TrudeausHair. The Economist referred to him as the “hair apparent” (a reference to his father, former Prime Minister Pierre-Elliott Trudeau). And he wasn’t the only one under a follicular microscope: the hair of all the (all-male) candidates played a fairly public role in that election. And British Prime Minister Boris Johnson’s singular flyaway blondness has inspired RTE, the Irish broadcaster, to write that his hair is “key” to his “political brand,” “symbolizing the chaotic and gaffe-prone style that charms his supporters and appals his critics.” It’s fair to say hair is not just some stringy stuff on the top of our heads. According to Grant McCracken, an anthropologist and author of “Big Hair,” our hair is “our court of deliberation, the place where we contemplate who and what we are.” It is visible, accessible, gender-freighted. It has associations with sex, punishment, class and power. It is probably not happenstance that the United States has not elected a bald president since Dwight D. Eisenhower left office in 1961. When it comes to politics, to care too much about hair, to spend too much on it, makes one seen as superficial and vain; focused on yourself at the expense (literally sometimes) of taxpayers. Ignore it and you are sloppy and lack attention to detail. Men have traditionally used their ability to get inexpensive barber-trims as bragging rights and something of a badge of honor. In the Washington Times story, former Attorney General Jeff Sessions is lauded for the fact he got his cuts at the Senate Hair Care Services in the basement of the Russell Senate Office Building for a mere $20 — though it is acknowledged that “men’s haircuts there and everywhere else are cheaper than women’s.” In turn, women have often complained about a double standard in price and scrutiny. This has only become more true in the age of Instagram, and during a White House administration where hair has played an outsize symbolic role, from the glossy, blow-dried locks of pretty much all the women in the Trump orbit (the first lady, Tiffany Trump, Vanessa Trump, Kimberly Guilfoyle, Hope Hicks — and Ivanka before the bob) to the orange-hued and complicated comb-over worn by the president himself. People joke about it, but no one forgets it. Fact is, we’re talking about hair more than ever these days, not less. All of which suggests that, whether we like it or not, when it comes to politics (as when it comes to a lot of life), a trim is rarely just a trim. It’s a weapon, and a tool. If we don’t admit that and wield it ourselves — with humor, ideally — then someone else will.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "‘Faithless Electors’ Could Tip the 2020 Election. Will the Supreme Court Stop Them?",
      "url": "https://www.nytimes.com/2019/10/14/us/politics/supreme-court-faithless-electors-2020.html?searchResultPosition=3",
      "subtitle": "null",
      "author": "Adam Liptak",
      "content": " WASHINGTON — On Dec. 19, 2016, a little more than a month after the presidential election, members of the Electoral College gathered around the nation to cast their votes. Ten of them went rogue. A swing by that number of electors would have been enough to change the outcomes in five of the previous 58 presidential elections, according to a petition filed last week in the Supreme Court. In the 2000 election, after an assist from the Supreme Court, George W. Bush beat Al Gore by just five electoral votes. The petition asked the justices to decide whether “faithless electors” were free to disregard pledges they made to vote for their own parties’ candidates. It urged the court to act quickly. “This case permits the court to issue a decision outside of the white-hot scrutiny of a contested presidential election,” the petition said. Deciding the issue in the context of an actual election could do lasting damage to the Supreme Court, said Lawrence Lessig, a law professor at Harvard who filed the petition on behalf of three Democratic electors from Washington State who were fined $1,000 each for casting their electoral votes for Colin L. Powell rather than for Hillary Clinton. A ruling that tipped an election to one or another candidate could not but look political, Professor Lessig said. “It would be disastrous for the institution,” he said of the court, “if they had to decide it in the middle of a presidential election.” The Washington State Supreme Court upheld the fines in May, saying that the Constitution allows states to insist that electors vote for their parties’ candidates. In dissent, Justice Steven C. Gonzalez disagreed. “The Constitution provides the state only with the power to appoint,” he wrote, “leaving the electors with the discretion to vote their conscience.” Three months later, the United States Court of Appeals for the Tenth Circuit, in Denver, rejected the Washington State Supreme Court’s reasoning. It said that Colorado had been wrong to discard a vote from a Democratic elector who had wanted to cast a ballot for Gov. John Kasich of Ohio. “Electors, once appointed, are free to vote as they choose,” Judge Carolyn B. McHugh wrote for the majority of a divided three-judge panel. “While the Constitution grants the states plenary power to appoint their electors, it does not provide the states the power to interfere once voting begins, to remove an elector, to direct the other electors to disregard the removed elector’s vote or to appoint a new elector to cast a replacement vote.” Such sharp disagreements in the lower courts make Supreme Court review more likely. So does the importance of the issue: It is hardly far-fetched that the next presidential election could turn on the votes of faithless electors. Two things are reasonably clear. The first is that the framers of the Constitution and the language they used seemed to contemplate that electors would use independent judgment. The second is that over time people have come to assume that electors are meant to vote for their parties’ candidates. An 1892 Supreme Court decision captured this tension. “Doubtless it was supposed that the electors would exercise a reasonable independence and fair judgment in the selection of the chief executive,” Chief Justice Melville Fuller wrote. Over time, he added, “the original expectation may be said to have been frustrated.” Alexander Hamilton described that original expectation in the Federalist Papers. “Men chosen by the people for the special purpose” of selecting the president, he wrote, “will be most likely to possess the information and discernment requisite to such complicated investigations.” The Supreme Court these days is generally inclined to honor the original meaning of the Constitution, and the Tenth Circuit made a strong case that its language supports elector independence. The words of the relevant provisions, including “elector,” “vote” and “ballot,” Judge McHugh wrote, “have a common theme: They all imply the right to make a choice or voice an individual opinion.” On election night in 2016, the electoral vote was expected to be 306 for Donald J. Trump and 232 for Mrs. Clinton. In the end, though, it was 304 to 227. Seven electors succeeded in voting for other candidates. A fourth Democratic elector in Washington voted for Faith Spotted Eagle, and a Democratic elector in Hawaii voted for Senator Bernie Sanders of Vermont. Republican electors in Texas voted for Mr. Kasich and Ron Paul, a former representative of Texas. Three more Democratic electors, in Colorado, Maine and Minnesota, tried to vote for candidates other than Mrs. Clinton. Two were replaced, and a third eventually came around. The number of faithless votes was the largest in history, but the phenomenon was not particularly unusual. “Congress has accepted the vote of every vote contrary to a pledge or expectation in the nation’s history that has been transmitted to it — a total of more than 150 votes across 20 different elections from 1796 to 2016,” the petition filed last week said, citing data from FairVote, a nonpartisan voting rights advocacy group. Congress has only once debated the question, when some lawmakers objected in 1969 to counting a Republican elector’s vote for George C. Wallace after Richard M. Nixon won the popular vote in the elector’s state. Both houses rejected the objection, and the vote stood. Professor Lessig, the lawyer for the Washington State electors, said a decision in their favor could help focus public attention on the shortcomings of the Electoral College in reflecting the popular will. One response, he said, is the National Popular Vote plan, under which states agree to grant their electoral votes to the candidate who gets the most votes nationwide. “It could also convince both sides that it is finally time to step up and modify the Constitution to address this underlying problem,” he said. One possibility, he said, is a constitutional amendment requiring a proportional allocation of electoral votes at the state level. The key point for now, Professor Lessig said, is to have a definitive answer on elector independence before the justices can know which candidate might benefit from their ruling. “Whatever way you resolve it,” he said, “it should be resolved.”",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Hillary Clinton Reads Her Emails at Venice Art Show",
      "url": "https://www.nytimes.com/2019/09/12/us/politics/hillary-clinton-emails-art.html?searchResultPosition=2",
      "subtitle": "The former presidential candidate dropped in on an exhibition of the emails that fed a controversy which dogged her 2016 campaign.",
      "author": "Christine Hauser",
      "content": " In a moment that combined political theater and performance art, Hillary Clinton was reunited with her emails at an exhibition in Italy this week. And she wants Republicans to know it. “Someone alert the House G.O.P.,” she wrote on Twitter on Thursday, captioning a picture of her seated with reams of paper that were part of “Hillary: The Hillary Clinton Emails,” a work on display in the Despar Teatro Italia in Venice. On a replica of the desk in the Oval Office, which eluded her in 2016, were copies of some of the roughly 60,000 pages of emails that formed a central controversy during her presidential campaign. During her visit, Mrs. Clinton took a seat and started to thumb through the papers, said Kenneth Goldsmith, the American poet and artist behind the exhibition. In promotional materials, he called the emails “the most important political documents of our times.” The email controversy followed Mrs. Clinton through much of the campaign, and was seized on particularly by her opponent, Donald J. Trump, and other Republicans. It centered on how she set up a private email account while she was secretary of state under President Barack Obama, and on her decision to destroy entries that she deemed to be personal. Classified information was found in a small number of the messages from her account. Mrs. Clinton, who left the State Department in 2013, was not charged based on the recommendation of James B. Comey, then the F.B.I. director, and she did not face disciplinary action. But the issue lingered until the end of the campaign, including an explosive revelation days before the election that new emails had been discovered, and Mr. Trump continued to insist that Mrs. Clinton’s actions were “bigger than Watergate” and enough to put her in jail. (President Trump’s daughter Ivanka and son-in-law, Jared Kushner, both White House aides, have since faced scrutiny over their handling of private communications.) After Mrs. Clinton’s appearance at the exhibition, which was built into a balcony jutting out over a supermarket, she called the email episode one of the “strangest” and most “absurd” events in American political history. “Anyone can go in and look at them,” she said during remarks to the Italian news media. “There is nothing there.” “There is nothing that should have been so controversial,” she added. The exhibition opened on May 9 and runs through November 24 as part of the 58th Biennale of Visual Arts, which has served as a bellwether for the international art community since its establishment in 1895. It was put together by a team of curators called Francesco Urbano Ragazzi, which said in an emailed statement on Thursday that Mrs. Clinton’s visit had been a surprise. “We were approached very informally by one of the closest friends of Hillary Clinton a few days before her visit,” the curators said. The friend was planning a trip to the Biennale with Mrs. Clinton after she spoke at the Ambrosetti forum in Cernobbio. “We thought it was just a joke until Tuesday 9 a.m.,” the curators said, “when we saw the security services inside the exhibition space.” In the exhibition, Mr. Goldsmith “makes public for the first time in printed format all the emails which, according to WikiLeaks, were sent from the domain clintonemail.com between 2009 and 2013,” according to the promotional materials. “The pile of papers is rather unimpressive, rebutting Trump’s efforts to make them monumental,” the materials say. “In this way, Goldsmith creates the greatest poem of the 21st century, an anti-monument to the folly of Trump’s heinous smear campaign against Clinton.”",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "State Dept. Investigating Email Practices of Hillary Clinton’s Former Staff",
      "url": "https://www.nytimes.com/2019/09/29/us/politics/hillary-clinton-email-server-state-department.html?searchResultPosition=1",
      "subtitle": "The inquiry is examining whether the employees used secure channels and the proper classification designations for what appeared to be routine emails at the time.",
      "author": "Edward Wong",
      "content": "  The State Department is continuing an investigation of email use among employees who worked for Hillary Clinton, the former secretary of state, asking scores of current and former officials to submit to questioning by the bureau overseeing diplomatic security, former officials said on Sunday. The investigation is examining whether the employees used secure channels and the proper classification designations for what appeared to be routine emails at the time, the former officials said. The emails were on subjects that were not considered classified at the time, but that have been or are being retroactively marked as classified. The inquiry potentially pushes back into the spotlight a deeply political issue that President Trump used as a weapon in his 2016 presidential campaign, and has repeatedly returned to during his time in office, despite the F.B.I. closing a previous investigation without finding wrongdoing by Mrs. Clinton. Mr. Trump’s insistence on raising the issue reflects a pattern in which the president pushes his own narrative even if an investigation or an analysis by an agency in his own administration has concluded otherwise. The emails were sent to Mrs. Clinton while she was secretary of state from 2009 to 2013, in President Barack Obama’s administration. They appear to have come to the attention of the diplomatic security bureau during the earlier inquiries conducted by the State Department, Congress and the F.B.I. into Mrs. Clinton’s use of a private email server. Those earlier investigations threw a long shadow over the 2016 presidential campaign and are considered by Mrs. Clinton and many analysts to be a factor in Mr. Trump’s victory. The renewed focus on the emails was reported on Saturday by The Washington Post, which said as many as 130 officials had been contacted in recent weeks. Sometime soon after Mr. Trump took office and appointed Rex W. Tillerson as his first secretary of state, the department’s diplomatic security bureau carried out the first stages of an investigation into email use by employees under Mrs. Clinton, the former officials said. Most of the people being investigated were political appointees who were leaving or had already left the department. The inquiry focused on the years when Mrs. Clinton was leading the State Department, even though many of the employees continued to work under her successor, John Kerry, the former officials said. The investigators appeared to want to finish the inquiry quickly and move on, the former officials said. At some point during Mr. Tillerson’s tenure, people who had heard of the investigation thought it had ended because the diplomatic security bureau no longer appeared to be actively pursuing the question, the officials said. Mike Pompeo took over as secretary of state in April 2018, and in recent months the diplomatic security bureau has been interviewing current and former employees again about their email use under Mrs. Clinton, the former officials said. Before joining the Trump administration, Mr. Pompeo was a Republican member of the House, and served on the committee investigating the deadly raid on the American diplomatic compound in Benghazi, Libya. Mr. Pompeo was among those who aggressively questioned Mrs. Clinton. The Justice Department inquiry into her use of a private email server had its roots in that congressional investigation, which brought to light Mrs. Clinton’s email practices. The former officials who described the current inquiry on Sunday did so on the condition of anonymity, given the sensitivity of the matter. The State Department did not reply to a request for comment on the current investigation. Looking to future prospects of the inquiry, the diplomatic security bureau could decide to make a formal note in a person’s file saying he or she had mishandled classified information, according to the former officials. That could lead to that person being unable to get proper security clearances in the future, or the applicant might have to wait a long time for those clearances to be approved. The former officials said scrutinizing the employees over their handling of information that was not classified at the time, and only retroactively classified, was unusual. Also, many of those emails summarize conversations with foreign officials who themselves have no security clearance in the United States government, yet are engaged in discussions about topics of interest to American counterparts. Moreover, the former officials said, the State Department does not have much in the way of secure devices that employees can use to send material from the field, so employees often send emails that need to be urgently read by the secretary of state or other officials over unsecure lines. For example, a diplomat might be dashing off to catch a flight after a meeting and unable to get back to the embassy to send an email over secure equipment. In many cases, the emails that went to Mrs. Clinton were part of a long email chain created by officials forwarding emails to one another. In the Trump White House, at least seven senior officials, including the president’s daughter Ivanka Trump and son-in-law, Jared Kushner, have used personal emails or chat apps to conduct official business. And congressional committees led by Democrats are now investigating the White House’s handling of transcripts of Mr. Trump’s calls with foreign leaders, including a particularly sensitive one in July with President Volodymyr Zelensky of Ukraine, as part of an impeachment inquiry.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    }
  ]
}