{
  "articles": [
    {
      "title": "Cindy McCain: GOP Lacks ‘Voice of Reason’ Since My Husband’s Death",
      "url": "https://www.breitbart.com/politics/2019/08/21/cindy-mccain-gop-lacks-voice-of-reason-since-my-husbands-death/",
      "subtitle": "Cindy McCain, the widow of the late Sen. John McCain (R-AZ.), believes the Republican Party is without a “voice of reason” since the death of her husband last year.",
      "author": "Joshua Caplan",
      "content": " In an ABC News interview slated to air Wednesday, McCain lamented today’s congressional bipartisanship, saying her late husband stood up to Democrats and Republicans for the sake of breaking gridlock. “That was a tough torch to carry and, as John said, there were many lonely days because he always said what was on his mind,” McCain recounted. “I don’t see anybody carrying that mantle at all, I don’t see anyone carrying the voice — the voice of reason,” she added. Of Sen. Lindsey Graham (R-SC), a longtime ally of Sen. McCain who has closely aligned himself with President Trump since the Arizona Republicans passing, McCain refused to speak out against him. “Lindsey’s a part of my family,” she said. “He’s a good friend and I cannot, [and] will not, be critical of Lindsey.” “Lindsey has his own political career to worry about and his own political life,” she added. “I would just hope that in the long run, everyone would begin to move in the right direction, including Lindsey or anybody else.” McCain’s comments come as The McCain Institute readies a social media campaign promoting civility to commemorate Sen. McCain’s August 25th death from glioblastoma, an aggressive form of brain cancer. On Wednesday, McCain previewed the “#ActsofCivility” initiative in the video asking others to “reach across the aisle” and “come together for civil engagement.”",
      "date": "21 Aug 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "John McCain Rips Trump-Putin Presser: ‘Pathetic,’ ‘Disgraceful,’ ‘Erratic,’ ‘Painful’",
      "url": "https://www.breitbart.com/national-security/2018/07/16/john-mccain-rips-trump-putin-presser-pathetic-disgraceful-erratic-painful/",
      "subtitle": "Sen. John McCain (R-AZ) lambasted President Donald Trump’s joint press conference with Russian President Vladimir in Helsinki, Finland on Monday.",
      "author": "Joshua Caplan",
      "content": " The Arizona senator released a statement describing President Trump’s remarks during the press conference as “pathetic,” disgraceful,” and “painful” to observe — “a recent low point in the history of the American Presidency.”  “Today’s press conference in Helsinki was one of the most disgraceful performances by an American president in memory. The damage inflicted by President Trump’s naiveté, egotism, false equivalence, and sympathy for autocrats is difficult to calculate. But it is clear that the summit in Helsinki was a tragic mistake,” Sen. McCain’s statement begins. “President Trump proved not only unable, but unwilling to stand up to Putin. He and Putin seemed to be speaking from the same script as the president made a conscious choice to defend a tyrant against the fair questions of a free press, and to grant Putin an uncontested platform to spew propaganda and lies to the world.” It is tempting to describe the press conference as a pathetic rout – as an illustration of the perils of under-preparation and inexperience. But these were not the errant tweets of a novice politician. These were the deliberate choices of a president who seems determined to realize his delusions of a warm relationship with Putin’s regime without any regard for the true nature of his rule, his violent disregard for the sovereignty of his neighbors, his complicity in the slaughter of the Syrian people, his violation of international treaties, and his assault on democratic institutions throughout the world. McCain highlighted the coziness between President Trump and his Russian counterpoint in contrast to his tough talk towards the United States’ European allies. Last Wednesday, President Trump scolded Germany during a breakfast with NATO officials in Brussel over Berlin’s support of a Baltic Sea gas pipeline deal with the Kremlin, describing Europe’s largest economy as a “captive of Russians.” In an interview with British tabloid The Sun, President  Trump predicted the British government’s proposed watered down Brexit strategy “will probably kill” hopes of a bilateral trade agreement with the United States. Ahead of his high-stakes meeting with Putin, President Trump branded the European Union a “foe” in respect to trade. “Coming close on the heels of President Trump’s bombastic and erratic conduct towards our closest friends and allies in Brussels and Britain, today’s press conference marks a recent low point in the history of the American Presidency,” the statement continues.” That the president was attended in Helsinki by a team of competent and patriotic advisors makes his blunders and capitulations all the more painful and inexplicable.” McCain concluded his blistering statement by accusing Trump of failing to uphold American values abroad, something he claims the president has failed to do since winning the White House. “No prior president has ever abased himself more abjectly before a tyrant. Not only did President Trump fail to speak the truth about an adversary; but speaking for America to the world, our president failed to defend all that makes us who we are—a republic of free people dedicated to the cause of liberty at home and abroad. American presidents must be the champions of that cause if it is to succeed,” McCain said. “Americans are waiting and hoping for President Trump to embrace that sacred responsibility. One can only hope they are not waiting totally in vain.” Presidents Trump and Putin vowed a fresh start to troubled relations between the world’s greatest nuclear powers at their summit, as the American leader rejected a chance to condemn Moscow’s alleged manipulation of U.S. elections. Standing alongside Putin at a joint news conference, President Trump said he had “spent a great deal of time talking about” election meddling, without going into detail or explicitly condemning any interference after 12 Russian agents were indicted in the United States. When pressed about alleged meddling, President Trump stressed that Putin had delivered a “powerful” denial of any Russian vote meddling and said the investigation by special counsel Robert Mueller had been a “disaster” for the United States. President Trump again denied any collusion between his campaign and the Kremlin, while Putin insisted: “The Russian state has never interfered and is not planning to interfere in the USA’s internal affairs.” The Agence France-Presse contributed to this report.",
      "date": "16 Jul 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Promise Broken: Sens. McCain, Murkowski, and Collins Tank Obamacare Repeal Bill",
      "url": "https://www.breitbart.com/politics/2017/07/27/promise-broken-sens-mccain-murkowski-and-collins-tank-obamacare-repeal-bill/",
      "subtitle": "Senate Majority Leader Mitch McConnell’s Health Care Freedom Act, known as the “skinny repeal” bill, failed to pass through the Senate.",
      "author": "Sean Moran",
      "content": " The Health Care Freedom Act failed 49-51. Sens. John McCain (R-AZ), Susan Collins (R-ME), and Lisa Murkowski (R-AK) voted against the bill. Sens. McCain and Murkowski pledged repeatedly to repeal Obamacare, whereas Sen. Collins consistently voted against any Obamacare repeal proposed by the Senate. Not only have these Sens. McCain and Murkowski voted to repeal Obamacare, they publicly pledged to do so on the campaign trail and in the halls of the Senate. Here are two instances when these senators promised to repeal Obamacare: The Health Care Freedom Act would have repealed Obamacare’s individual and employer mandate, provided states flexibility on Obamacare insurance regulations through waivers, increased Health Savings Account (HSA) contribution limits, repealed Obamacare’s medical device tax, and defunded Planned Parenthood for one year. The Senate healthcare reform process already traversed a rocky path. The Senate’s motion to start debating healthcare legislation barely passed through the upper chamber at 51-50. Vice President Mike Pence had to break the tie after Sens. Susan Collins (R-ME) and Lisa Murkowski (R-AK) voted against starting the debate in Congress. The Senate leadership failed to pass its healthcare bill, the Better Care Reconciliation Act (BCRA), and Senator Rand Paul’s (R-KY) clean repeal bill failed in the Senate after moderate Republicans shot down the legislation. Vice President Mike Pence arrived shortly before the Senate voted on the Health Care Freedom Act.  Vice President Mike Pence was present at the Senate for the vote. The Senate shot down Sen. Patty Murray’s (D-WA) motion to recommit the bill to the Senate Health, Labor, Education, and Pensions (HELP) committee, where Democrats argue that they can negotiate a bipartisan deal on health care with Republicans. The Senate failed to pass the Health Care Freedom Act. Senate Republicans needed at least 50 votes and Vice President Mike Pence to pass the bill through the upper chamber. Congressional leaders sought to send the Health Care Freedom Act to the House and the Senate, where both chambers could compromise on a unified bill through a conference committee. After which, both houses would have to pass the unified bill and then send the bill to President Donald Trump to sign. President Donald Trump cheered on the Senate Republicans before the vote, urging them to finally pass a health care reform bill after seven years.  Senate Majority Leader Mitch McConnell addressed the Senate Friday morning. McConnell regretfully said: Mr. President this is clearly a disappointing moment. From skyrocketing costs, to plummeting choices, and collapsing markets, our constituents have suffered an awful lot under Obamacare. We thought they deserved better, it’s why I and many of my colleagues did as we promised and voted to repeal this failed law. We told our constituents we would vote that way, but when the moment came most of us did. We kept our commitments, we worked hard, and everyone on this side can attest to the fact that we worked really hard. We tried to develop a consensus for a way forward and I want to thank everyone in our conference for the endless amount of time that they spent trying to achieve a consensus to go forward. I also want to thank the President and the Vice President, both of them could not have been more involved and more helpful. So yes, this is a disappointment. A disappointment indeed. McConnell then challenged the Democrats to come up with a solution to the nation’s health care crisis brought on by Obamacare. McConnell asked, “Now I think it is appropriate to ask what are their ideas?” “Now it’s time for the other side to put their ideas forward and we’ll see how the American people feel about their ideas,” the Majority Leader added. McConnell concluded, “My only regret, our only regret tonight, that we didn’t achieve what we had hoped to accomplish. I think the American people are going to regret that we couldn’t find a better way forward.”  ",
      "date": "27 Jul 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Donald Trump: ‘I Was Never a Fan of John McCain and I Never Will Be’",
      "url": "https://www.breitbart.com/politics/2019/03/19/donald-trump-i-was-never-a-fan-of-john-mccain-and-i-never-will-be/",
      "subtitle": "President Donald Trump continued criticizing the late Senator John McCain on Tuesday, as reporters questioned him at the White House.",
      "author": "Charlie Spiering",
      "content": " “I was never a fan of John McCain and I never will be,” he said at the White House. Trump reminded reporters that McCain essentially killed the vote to repeal Obamacare. “I’m very unhappy that he didn’t repeal and replace Obamacare as you know, he campaigned on repealing and replacing Obamacare for years,” Trump said. “And then he got to a vote and he said thumbs down.” Trump said that McCain indicated that he supported the bill but surprised Republicans by changing his mind at the last minute. “I think that’s disgraceful, plus there were other things,” Trump said. The president commented on McCain during a visit with Brazil President Jair Bolsonaro on Tuesday in the Oval Office.",
      "date": "19 Mar 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "John McCain Funds Afghan Immigration With Veterans’ Paychecks",
      "url": "https://www.breitbart.com/politics/2016/06/07/john-mccain-takes-cash-from-veterans-to-flood-america-with-more-special-immigrant-visas-from-afghanistan/",
      "subtitle": "Arizona Republican Sen. John McCain has backed a visa program for Afghani interpreters and their relatives that’s funded by imposing higher costs on U.S. military veterans’ health care costs, according to an immigration reduction group.",
      "author": "Katie McHugh",
      "content": " The amendment proposed by New Hampshire Democratic Sen. Jeanne Shaheen — and supported by McCain — will increase the number of Afghan Special Immigrant Visas for people who have aided U.S. soldiers as interpreters or translators. The number of visas will rise from 7,000 to 11,000, and each visa holder can bring spouses and their children to the United States. “It is time for the Senate to stop treating U.S. immigration policy like a Christmas tree that they can simply add more baubles to on a whim,” a press release from NumbersUSA sent to Senate offices Monday read. “Americans have to pay for each of those baubles — through higher taxes, fewer jobs, lower wages, and, tragically, higher health care costs for soldiers and their families.” McCain’s office declined to respond to queries from Breitbart News. Congress cut healthcare benefits to veterans in the 2016 budget by increasing pharmacy co-pays — using some of those savings to fund an expansion of the Afghan Special Immigrant Visas program, according to The Daily Caller News Foundation. The money could have been taken from other spending accounts, such as programs at the State Department. Backers of the amendment plan to do more of the same, says NumbersUSA: “Once again, shamefully, the proposed pay-for apparently will be on the backs of our soldiers and their families in higher-priced health care.” The war in violent, tribal, Third World Afghanistan has cost American taxpayers $1.6 trillion since 9/11, according to a 2014 Congressional Research Office estimate. It has taken the lives of over 2,300 U.S. soldiers, on top of over 20,000 U.S. soldiers wounded or maimed. But Republicans and Democrats have united to pile more costs onto taxpayers and military families. NumbersUSA explained the wide range of taxpayer-funded programs the Afghanis are eligible to receive. “Recipients are entitled to every benefit to which refugees are entitled, including travel loans, eight months of refugee cash and medical assistance, social services, up to five years of job training, job placement, and English classes,” along with employment authorization and a Social Security number. The SSN allows them to claim Earned Income Tax Credits and Additional Child Tax Credits. Every child born on U.S. soil is automatically awarded U.S. citizenship, thanks to liberal Supreme Court Justice William Brennan’s 1982 footnote in Plyler v. Doe. They, in turn, can sponsor “relatives” to join them in the U.S., whether or not American communities prefer to have impoverished, tribal, devout Muslims resettled en-masse into their neighborhoods. This is thanks to the 51-year long chain migration tradition of giving migrants control over U.S. immigration policy, successfully advocated by Democratic Sen. Ted Kennedy and his Immigration and Nationality Act of 1965. In addition, they are eligible for federal entitlement programs and other benefits, including but not limited to: It’s a remarkable bargain for interpreters who aided the U.S. in their native country. The Afghan Special Immigrant Visas program was created in 2009 and continued to grow as modifications were made. Despite its expansion, thousands of visas still remain unclaimed, NumbersUSA says: As of April 7 of this year, the Department of State still had 3,635 visas available to issue. Notably, the visa cap applies only to principal alien applicants — with an uncapped number going to each applicant’s spouse and unmarried children under the age of 21. So in FY 2014, while 3,441 visas were issued to principal aliens, 5,666 were issued to their dependents. In FY 2015, 2,301 were issued to principals, and 4,411 to dependents. As of December 31 of 2015, 1,367 had been issued to principals and 2,942 to their dependents. But there’s still years left to apply: The McCain-backed amendment requires a report “detailing a strategy for bringing the program to a responsible end” should be written by December 31, 2019 — or “soon thereafter,” depending on continued U.S. military involvement. President Obama announced in October 2015 that he would keep U.S. troops in Afghanistan until the end of his term in 2017. ",
      "date": "7 Jun 2016",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Arizona Sports Teams, Players Pay Tribute to Sen. John McCain",
      "url": "https://www.breitbart.com/sports/2018/08/26/arizona-sports-teams-players-pay-tribute-to-sen-john-mccain/",
      "subtitle": "With the passing of Arizona Sen. John McCain, the Arizona Diamondbacks played a special tribute to his life during the fifth inning at Chase Field on Saturday night and many other Arizona players and teams chimed in with their own tributes.",
      "author": "Warner Todd Huston",
      "content": " Watch:  “John McCain has always been a member of the D-backs’ family and was one of this team’s biggest fans since day one,” Diamondbacks President and CEO Derrick Hall said in a statement according to AZCentral. “He was in attendance at the expansion draft, the World Series and countless other games, remaining a fan through thick and thin. I am honored to consider him a friend and we will miss seeing his smiling face in the stands and our heartfelt thoughts go out to his entire family.” McCain was a big supporter of the Diamondbacks and even as the end of his life neared, he took time to attend a game.  The team also took to Twitter to celebrate the Senator’s life:  The Arizona Cardinals joined the Diamondbacks and posted a tweet about the Senator’s passing:  Cardinals wide receiver Larry Fitzgerald also mourned the loss:  Several other Arizona sports venues observed a moment of silence for the soldier-politician’s life and others posted tributes:        Follow Warner Todd Huston on Twitter @warnerthuston.",
      "date": "26 Aug 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "John McCain Chooses to End Brain Cancer Treatment",
      "url": "https://www.breitbart.com/politics/2018/08/24/john-mccain-chooses-to-end-brain-cancer-treatment/",
      "subtitle": "Sen. John McCain (R-AZ) will cease receiving medical treatment for Glioblastoma, an aggressive type of brain cancer, according to a statement issued Friday by the McCain family.",
      "author": "Joshua Caplan",
      "content": "  “Last summer, Senator John McCain shared with Americans the news our family already knew: He had been diagnosed with an aggressive glioblastoma, and the prognosis was serious,” the announcement reads. “In the year since, John has surpassed expectations for his survival. But the progress of disease and the inexorable advance of age render their verdict,” the family said in a statement. “With his usual strength of will, he has now chosen to discontinue medical treatment.” The longtime Republican lawmaker, who has remained away from Capitol Hill since December, began medical treatment for this cancer in July of 2017. “Mr. McCain’s family has gathered in Arizona, and people close to him say his death is imminent,” a source told the New York Times. McCain has been one of President Donald Trump’s most vocal Republican critics, given Trump’s infamous campaign-trail insult of his Vietnam War captivity. The senator wrote in his book Restless Wave that today’s GOP is on the wrong side of the immigration debate. “Right now, Republicans are on the wrong side of that progress,” he wrote. “And if we want to retain our competitiveness in the fastest-growing communities in the country we’ll stop letting the zealots drive the debate, and fix the problems that [give] them their soapbox.” McCain, who has said America-First conservatives make up a mere sliver of the Party, also wrote the faction must be “confronted before their noxious views spread further and damage for generations the reputation of the Republican Party.” “They’re still a small fraction in the Republican Party. But they’re the ones getting all the attention right now. They need to be confronted, not ignored or winked at or quietly dismissed as kooks,” the former presidential candidate wrote. “They need to be confronted before their noxious views spread further and damage for generations the reputation of the Republican Party.” McCain infamously voted twice to protect the Patient Protection and Affordable Care Act, commonly referred to as Obamacare. Last July, he helped defeat a “skinny” repeal bill 49 to 51 in a dramatic, late-night vote. McCain then went on to vote against the Graham-Cassidy Obamacare repeal bill in September. The ailing Senator’s daughter, Meghan McCain, thanked supporters for their “love and generosity,” over the course of the year. “My family is deeply appreciative of all the love and generosity you have shown us during this past year McCain tweeted. Thank you for all your continued support and prayers. We could not have made it this far without you – you’ve given us strength to carry on.”",
      "date": "24 Aug 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "John McCain: FISA Memo Serves no American Interests, Only Putin’s",
      "url": "https://www.breitbart.com/politics/2018/02/02/john-mccain-fisa-memo-serves-no-american-interests-putins/",
      "subtitle": "Sen. John McCain (R-AZ), chairman of the Senate Armed Services Committee, attacked the release of the FISA memo, arguing that it does not serve the interests of America, “only Putin’s.”",
      "author": "Sean Moran",
      "content": " McCain said in a statement: In 2016, the Russian government engaged in an elaborate plot to interfere in an American election and undermine our democracy. Russia employed the same tactics it has used to influence elections around the world, from France and Germany to Ukraine, Montenegro, and beyond. Putin’s regime launched cyberattacks and spread disinformation with the goal of sowing chaos and weakening faith in our institutions. And while we have no evidence that these efforts affected the outcome of our election, I fear they succeeded in fueling political discord and dividing us from one another. The latest attacks on the FBI and Department of Justice serve no American interests – no party’s, no president’s, only Putin’s. The American people deserve to know all of the facts surrounding Russia’s ongoing efforts to subvert our democracy, which is why Special Counsel Mueller’s investigation must proceed unimpeded. Our nation’s elected officials, including the president, must stop looking at this investigation through the warped lens of politics and manufacturing partisan sideshows. If we continue to undermine our own rule of law, we are doing Putin’s job for him. The White House and the House Intelligence Committee released the FISA memo on Friday. Last December it was revealed that it McCain who passed the Steele dossier to former FBI Director James Comey. McCain met with Andrew Wood in Halifax, Canada at the Halifax Security Forum in Canada in November 2016, and they discussed the dossier. McCain had his associate David Kramer travel to London to meet with Steele and get briefed on the dossier. They arranged to get a hard copy of the dossier to McCain, and he gave it to Comey. The memo describes how senior Department of Justice (DOJ) and Federal Bureau of Investigation (FBI) officials used the unverified Trump dossier to obtain a surveillance warrant on Trump campaign staffer Carter Page. The memo also details how those senior officials in the DOJ and the FBI misled the Foreign Intelligence Surveillance Court on how the Trump dossier was actually opposition research funded by the Hillary Clinton campaign and the Democratic National Committee (DNC).",
      "date": "2 Feb 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Alleged ISIS Photo Controversy Engulfs Sen. John McCain",
      "url": "https://www.breitbart.com/politics/2014/09/18/alleged-isis-photo-controversy-engulfs-sen-john-mccain/",
      "subtitle": "Sen. John McCain (R-AZ) and his aides swear the Syrian “rebels” he was pictured last year with weren’t ISIS members or supporters, and the mainstream media is by and large buying the 2008 GOP presidential nominee’s story.",
      "author": "Matthew Boyle",
      "content": "  Sen. Rand Paul (R-KY) has endured brutal criticism–media fact checkers, reporters, and political figures have shredded him–for questioning just who McCain posed with. But a closer look at the situation tells perhaps a different story than McCain’s office or the mainstream media have pushed. The criticism of McCain centers around how the Arizona senator met with Syrian rebel leaders in May 2013 when he visited the country. McCain posed for photographs with those people, and since then rumors have sprouted up across the Internet that he met with ISIS or some other terrorist kidnappers or nefarious forces. “The people in the pictures with Senator McCain in Syria included General Salim Idris, then-Chief of Staff of the Supreme Military Command of the Free Syrian Army (FSA), Mouaz Moustafa, the Executive Director of the DC-based Syrian Emergency Task Force (which supports the moderate opposition and helped arrange some of the trip), and fighters and commanders from the Northern Storm Brigade, a FSA-aligned group,” McCain’s spokesman Brian Rogers told Breitbart News. Rogers said that the senator and his team aren’t naming the “fighters and commanders from the Northern Storm Brigade, a FSA-aligned group,” because “ISIS actually threatened to kill them all, and we don’t want to put their lives at risk.” Rogers provided Breitbart News with a link to the ISIS threat to those fighters. “ISIS targeted the Northern Storm because ISIS considers them apostates and because Northern Storm met with Sen. McCain,” Rogers said. “ISIS actually wrote out a statement that accused Northern Storm of treachery for reasons including: ‘Meeting with U.S. Senator John McCain in the hangar and making a contract with him against the Islamists.’ The statement goes on to demand that Northern Storm surrender and repent to ISIS or be killed.” “ISIS actually killed many Northern Storm members, and we’re not going to put them at any further risk by naming them,” Rogers added. But there’s just one problem with McCain’s office’s story. Now, McCain’s team says the senator didn’t meet with any bad figures but declines to name them, for what seems to be a legitimate reason–although those who are publicly leading combat against ISIS and against Bashar Al-Assad’s regime are probably publicly known figures there. Just last year, however, McCain’s office had no clue who the senator met. When allegations surfaced that the senator may have met with terrorists who kidnapped someone, Rogers–McCain’s communications director–went on the record to multiple media outlets to say he didn’t know who he was meeting with, and if he did meet with kidnapper terrorists, that would be regrettable. “None of the individuals the senator planned to meet with was named Mohamad Nour or Abu Ibrahim,” Rogers told CNN in late May 2013, right after the trip. “A number of other Syrian commanders joined the meeting, but none of them identified himself as Mohamad Nour or Abu Ibrahim.” Rogers added later in his statement to CNN that he and the senator did not know who he was meeting with. “A number of the Syrians who greeted Senator McCain upon his arrival in Syria asked to take pictures with him, and, as always, the senator complied,” Rogers said. “If the individual photographed with Senator McCain is in fact Mohamed Nour, that is regrettable. But it would be ludicrous to suggest that the Senator in any way condones the kidnapping of Lebanese Shia pilgrims or has any communication with those responsible. Senator McCain condemns such heinous actions in the strongest possible terms.” Of course it’s ludicrous to suggest that McCain would condone the act of kidnapping, and nobody serious is suggesting that. The point many critics of McCain’s policies–including Sen. Rand Paul (R-KY)–are making is that Americans have no way of knowing which team any one of these figures is on. “Here’s the problem,” Paul said in an interview with The Daily Beast this week. “He [McCain] did meet with ISIS, and had his picture taken, and didn’t know it was happening at the time. That really shows you the quandary of determining who are the moderates and who aren’t. If you don’t speak Arabic, and you don’t understand that some people will lie to you–I really think that we don’t have a good handle on who are the moderates and who aren’t, and I think the objective evidence is that the ones doing most of the fighting and most of the battles among the rebels in Syria are the radical Islamists.” Paul has been roundly criticized for the remarks, starting with the publication he made them to. The Daily Beast’s Olivia Nuzzi wrote that Paul’s statement means he “repeated a thoroughly debunked rumor.” The Washington Post’s fact-checker Glenn Kessler gave Paul “Four Pinocchios,” its highest rating of dishonesty, for the statement. Kessler wrote that this story is one where he regrets “we are limited to just Four Pinocchios,” because there is “zero evidence that any of the men that McCain met with in Syria are linked to the Islamic State.” Despite this pile-on by the media and political establishment, Paul has a serious point here, though. McCain really didn’t know who he was meeting with, and even if they were the supposedly “moderate” Free Syrian Army, who’s to know that they aren’t elements of the Free Syrian Army working alongside ISIS? Patrick Poole, an esteemed national security reporter and expert on radical Islam for PJ Media, has reported that the Free Syrian Army’s commanders have admitted in public to working alongside ISIS. “As President Obama laid out his ‘strategy’ last night for dealing with the Islamic State of Iraq and Syria (ISIS), and as bipartisan leadership in Congress pushes to approve as much as $4 billion to arm Syrian ‘rebels,’ it should be noted that the keystone to his anti-Assad policy — the ‘vetted moderate’ Free Syrian Army (FSA) — is now admitting that they, too, are working with the Islamic State,” Poole wrote on Sept. 10. Poole cites the Lebanese newspaper Daily Star, which quotes a Free Syrian Army brigade commander as saying he is working with the “Islamic State and Jabhat al-Nusra, al-Qaeda’s official Syrian affiliate — both U.S.-designated terrorist organizations.” Specifically, the quotes Poole pulls are: “We are collaborating with the Islamic State and the Nusra Front by attacking the Syrian Army’s gatherings in… Qalamoun,” said Bassel Idriss, the commander of an FSA-aligned rebel brigade. “We have reached a point where we have to collaborate with anyone against unfairness and injustice,” confirmed Abu Khaled, another FSA commander who lives in Arsal. “Let’s face it: The Nusra Front is the biggest power present right now in Qalamoun and we as FSA would collaborate on any mission they launch as long as it coincides with our values,” he added. In a lengthy floor speech on Thursday, Paul ripped the foreign policy establishment in Washington for assuming that FSA and ISIS are really distinct entities. “According to a New York Times report, over a year ago, the CIA began training Syrian rebels in nearby Jordan, thousands of them, along with delivering arms and ammunition,” Paul said, according to a transcript of the speech provided to Breitbart News by his office. “New York Times reports also detailed the huge arms and financial transfers from Quatar to the Syrian rebels, beginning as early as 2011. No one really knows where that all ended up: Jane’s Terrorism Center noted, the transfer of Quatari arms to targeted groups has the same practical effect as shipping them to Al Nusra, a violent jihadist force. The New York Times further detailed that Sudan has provided anti-tank missiles and other arms.” Shortly after those comments, Paul said that America can’t be sure–since supposedly “vetted moderates” are working alongside ISIS–who any of them are. He added that even if some might be loyal now, they could change their allegiances in a heartbeat–saying that some officials estimate that more than half of FSA forces have defected to ISIS. “So the idea that these rebels haven’t been armed before is ludicrous on it’s face. It is also ludicrous to believe that we know where all of the money, arms and ammunition will end up, or who will end up benefiting from these shipments. Why? Because we don’t know for sure who the groups all are,” Paul said. “Even when we think we do, loyalties shift and groups become amorphous, with alleged moderates lining up with jihadists. And finally, moderate groups have often sold their weapons or had them seized by the jihadist elements led by ISIS.” McCain’s office, however, fiercely defends the notion that FSA is not working alongside ISIS. “Also, these reports of some kind of ‘truce’ between the FSA and ISIS have also been debunked,” Rogers, McCain’s spokesman, told Breitbart News–citing a piece from the Daily Beast to back up his claims. “While there have been brief cease-fires between the groups to collect bodies of those killed during fighting, as this Josh Rogin article makes clear, there’s no ‘truce’ between FSA and ISIS.” And maybe there is no formal “truce” between FSA and ISIS, but the reports of mass defections and quotes from FSA leaders and brigade commanders on record saying they are working with ISIS makes this much more complicated than the clear cut-and-dry issue the mainstream media have made it so as to rip Paul. When McCain’s office won’t name who exactly he met with, who exactly he’s photographed with–after last year admitting in public they didn’t know who he greeted in Syria–are we supposed to just take his word for it that some of those FSA leaders aren’t now working with ISIS–or maybe have outright joined ISIS, like that other FSA commander Poole and the Daily Star quote?    ",
      "date": "18 Sep 2014",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Donald Trump: Attempt to Hide USS John S. McCain ‘Well-Meaning,’ but ‘I Couldn’t Care Less’",
      "url": "https://www.breitbart.com/politics/2019/05/30/donald-trump-attempt-to-hide-uss-john-s-mccain-well-meaning-but-i-couldnt-care-less/",
      "subtitle": "President Donald Trump denied knowledge of any attempt to hide the guided-missile destroyer USS John S. McCain during his visit to the Pacific, but said the attempt to do so was “well-meaning.”",
      "author": "Charlie Spiering",
      "content": " “I would never do a thing like that,” he said “Now, somebody did it because they thought I didn’t like him. Okay? They were well-meaning, I will say. I didn’t know anything about it. I would never have done that.” The president commented on the story as he left the White House for a commencement speech at the Air Force Academy. Trump again confirmed that he never liked McCain, citing his vote to kill the Republican effort to repeal Obamacare and his effort to get America to go to war in Iraq. “I wasn’t a fan of John McCain. I never will be, but certainly, I couldn’t care less if there is a boat named after his father,” Trump said. The Wall Street Journal reported an email from White House Military Office to the U.S. Navy Seventh Fleet directing the guided-missile destroyer to be out of sight during Trump’s visit. Trump did not deny the story. “I don’t know who did it. We will probably be able to find out who did it,” he said. “They thought they were doing me a favor because they know I am not a fan of John McCain.”",
      "date": "30 May 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "McCain’s Family, McCain Institute to Start #ActsofCivility Campaign",
      "url": "https://www.breitbart.com/politics/2019/08/20/mccains-family-mccain-institute-start-actsofcivility-campaign/",
      "subtitle": "The family of the late Sen. John McCain (R-AZ) and the McCain Institute are teaming up to start a social media campaign called #ActsofCivility to honor the first anniversary of the Arizona senator’s passing.",
      "author": "Katherine Rodriguez",
      "content": " Organizers of the campaign say they want to encourage opening up dialogue with a competitor, working with colleagues who have differing views, and open up a conversation with family members who may disagree with each other, Axios reported. Luke Knittig, a spokesperson for the McCain Institute, told the Hill that staffers at the organization were told to read news from different sources to get a sense of how different people think. “My family and I are going out of our way to properly meet our (not so) new neighbors, who on the face of it we have little in common with,” Knittng told the Hill in an email. “Many other staffers have committed to reading news and commentary from sources they normally try to ignore. McCain died at age 81 on August 25, 2018, of a brain tumor after serving decades as Arizona’s senator, running for president as the GOP nominee in 2008, and surviving as a prisoner of war in Vietnam during his naval career before entering political office.",
      "date": "20 Aug 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Donald Trump: John McCain Peddled Fake Dossier ‘Garbage’ to Media and FBI",
      "url": "https://www.breitbart.com/politics/2019/03/17/donald-trump-john-mccain-peddled-fake-dossier-garbage-media-fbi/",
      "subtitle": "President Donald Trump ripped the late Senator John McCain on Sunday for passing on the bogus opposition dossier to the FBI and the media.",
      "author": "Charlie Spiering",
      "content": " Trump mocked McCain for being “last in his class” after reading reports that the deceased senator and his associate David Kramer helped spread the dossier compiled by Christopher Steel to reporters and government officials. “So it was indeed (just proven in court papers) ‘last in his class’ (Annapolis) John McCain that sent the Fake Dossier to the FBI and Media hoping to have it printed BEFORE the Election,” he wrote on Twitter. “He & the Dems, working together, failed (as usual). Trump recalled that media outlets in 2016 did not publish details from the unverified dossier until after the election. “Even the Fake News refused this garbage!” he wrote.  ",
      "date": "17 Mar 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Celebs Trash Trump in Response to John McCain’s Death: ‘F*ck You’",
      "url": "https://www.breitbart.com/entertainment/2018/08/25/celebs-trash-trump-john-mccains-death/",
      "subtitle": "While the world is reacting to Sen. John McCain’s passing Saturday, praising him for his status as a war hero and long public service to the United States, some celebrities are using it as an excuse to bash President Trump.",
      "author": "Justin Caruso",
      "content": " John McCain was 81-years-old when he passed away due to brain cancer. He was the recipient of a Purple Heart Medal and a Prisoner of War Medal.  Many stars apparently couldn’t help but use McCain’s passing to whip up more anti-Trump hatred.\n\n“John McCain: American patriot, war hero. Donald Trump: Draft-dodging weasel,” wrote author Stephen King. “Take his name out of your mouth you piece of shit. You maligned his military service while you did everything to avoid serving. You attacked him repeatedly while you knew he was dying. And you cozied up to Putin while he did everything he could to oppose him. Fuck You,” wrote Kathy Griffin.   Actor and regular Trump hater Ron Perlman wrote, “May God Bless Senator John McCain……..,” later adding, “…and to the current holder of the title potus, you’re not good enough to utter John McCain’s name. Not good enough. And definitely not American enough.”   Reaction from Hollywood figures was largely worshipful, with many celebrities taking to social media to shower the late Arizona lawmaker with praise for his proclivity to forsake conservatives and side with liberals in the Senate. Below is a roundup of Hollywood’s reaction to Sen. John McCain’s passing.                https://twitter.com/cher/status/1033520523857129472         ",
      "date": "25 Aug 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Navy Denies Acting on an Alleged White House Military Office Request to Hide USS John McCain",
      "url": "https://www.breitbart.com/politics/2019/05/30/navy-denies-white-house-military-office-request-uss-john-mccain/",
      "subtitle": "The Navy on Thursday denied ever acting on an alleged White House Military Office staffer’s request to obscure the USS John S. McCain destroyer during President Trump’s visit to a U.S. naval base in Yokosuka, Japan, where it is docked.",
      "author": "Kristina Wong",
      "content": " “When brought to senior Navy leaders’ attention, direct guidance was given to keep the ships in normal configurations,” a Navy official said. The Wall Street Journal first reported that the White House Military Office had asked that the ship be hidden during Trump’s visit and that a tarp and a barge were placed to obscure the ship’s name. The story sparked outrage from Trump’s critics, including from the late senator’s daughter, that the president would make such a request. Shortly after, Trump said he was not informed about “anything” having to do with the McCain. The Navy also put out a statement stating that the McCain was not obscured during Trump’s visit to Yokosuka: The name of USS John S. McCain was not obscured during the POTUS visit to Yokosuka on Memorial Day. The Navy is proud of that ship, its crew, its namesake and its heritage. — Navy Chief of Information (@chinfo) May 30, 2019  The WSJ report also said that Acting Defense Secretary Pat Shanahan was “aware of the concern about the presence of the USS John McCain in Japan and approved measures to ensure it didn’t interfere with the president’s visit.” Hours later, Army Lt. Col. Joe Buccino, a spokesman for Shanahan, said in a statement, “Secretary Shanahan was not aware of the directive to move the USS John S McCain nor was he aware of the concern precipitating the directive.” CNBC published alleged email correspondence by a U.S. Indo-Pacific Command official reflecting a conversation between the White House Military Office and the Navy’s 7th Fleet in advance of the president’s trip. It said, “USS John McCain needs to be out of sight.” A Navy spokesman for 7th Fleet, Cmdr. Clayton Doss, later said in a statement, “All ships remained in their normal configuration during the President’s visit.” Two Navy officials, speaking to Breitbart News on background on Thursday, denied that the tarp or the barge was related to the alleged White House Military Office request. The officials said a white tarp was put on the McCain‘s stern from late Friday, May 24, to Saturday morning, May 25, as part of “preservation and maintenance.” During that time, a photo was taken of the ship covered by a tarp, one official said. That photo ran along with the WSJ story. The official said the tarp was only there temporarily and that when the commander of the ship, Navy Cmdr. Micah Murphy, left on Friday there was no tarp, and when he arrived back to the ship on Saturday morning it was gone. The officials did not say exactly who put the tarp up or took it down, but suggested it was part of ongoing maintenance on the ship. The McCain has been under repair since it collided with another ship in August 2017. The Navy officials also denied that a paint barge was used to cover up the ship’s name. The second official said the McCain was being painted ahead of Trump’s visit and the paint barge was moved away on Sunday, May 26. Trump did not arrive until Monday, May 27. “The ship wasn’t moved nor was anything put in place that would obstruct the name,” the first official said. “The 7th Fleet wouldn’t accept anything that would obscure the name of the ship on the day of the visit.” “The paint barge comes and goes,” the second official said. “It was there to paint and do hull preservation and then it was gone.” The official added that it is very common for ships to be painted ahead of high-level visits like the president’s. “A lot of the other ships did that very same thing. I know the Wasp did. I know they were out there painting, and sweeping and getting ready,” the official said. The first official added it would have been difficult for Trump to even see the name of the McCain, due to the way the ships are lined up. The WSJ also reported that the McCain‘s sailors were given the day off during the visit. A Washington Post report said the crew was released from duty for the long holiday weekend, along with sailors from another ship, the USS Stethem. The second Navy official said the McCain and Stethem sailors did not participate in the president’s visit because they were not among commands selected. Those selected included both afloat and ashore units, and were “broad representation,” the official said. The official confirmed that the McCain sailors were on a 96-hour Memorial Day weekend liberty, which concluded Tuesday after the visit. The official also batted down reports that had the McCain sailors participated in the event, they would have worn hats with “McCain” on them. “Participating commands were directed to wear 8-point covers (hats) and Type IIIs for uniformity the day of POTUS’ visit,” the official said, referring to sailors’ green utility uniform and hat. The official said sailors would have not been wearing their ball caps with ship names on them. “If anyone was turned away, it was because they were not in the right uniform,” the official said. Trump again told reporters Thursday morning that he did not have anything to do with the White House Military Office request. “I don’t know what happened. I wasn’t involved. I would not have done that. I was very angry with John McCain because he killed health care. I was not a big fan of John McCain in any way shape or form,” he said. “I wasn’t a fan but I would never do a thing like that. Now somebody did it because they thought I didn’t like him, OK? And they were well-meaning, I will say, I didn’t know anything about it. I would have never done that.” “I don’t know who did it. We’ll probably be able to find out who did it. They thought they were doing me a favor because they know I am not a fan of John McCain,” he added. Later on Thursday, he tweeted: “The Navy put out a disclaimer on the McCain story. Looks like the story was an exaggeration, or even Fake News – but why not, everything else is!” The Navy put out a disclaimer on the McCain story. Looks like the story was an exaggeration, or even Fake News – but why not, everything else is! — Donald J. Trump (@realDonaldTrump) May 30, 2019  Breitbart News asked the White House whether it was looking into who made the request and why, but has not received an immediate response.",
      "date": "30 May 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "John McCain: Comey Leaks ‘of Watergate Size and Scale’",
      "url": "https://www.breitbart.com/politics/2017/05/17/john-mccain-comey-leaks-watergate-size-scale/",
      "subtitle": "Longtime Trump opponent Sen. John McCain (R-AZ) added his voice to the chorus of alarm Tuesday in the wake of a New York Times report on an alleged memo from ex-FBI Director James Comey.",
      "author": "Ian Mason",
      "content": " “We’ve seen this movie before,” McCain told CBS News’s Bob Schieffer. “I think it’s reaching the point where it’s of Watergate size and scale… it’s a centipede that the shoe continues to drop.”  “Every couple of days, there’s a new aspect of this really unhappy situation… None of us, no matter what our political leanings are, no matter how we feel about Trump, feel this is not good for America,” McCain added. The comments are the harshest yet from the GOP side of the aisle and come as some Democrats are openly calling for President Donald Trump impeachment over the “Comey Memo.” Rep. Al Green (D-TX) did so on the House floor Tuesday morning. McCain’s comments add to rumblings among certain other Republicans on Capitol Hill who have signaled their willingness to abandon Trump over the allegations in Comey’s memo and reports of discussion of classified information with Russian diplomats. The Hill reported Wednesday that the Comey Memo was causing more GOPers to try and detach their legislative agenda from the president. McCain has been a proponent of the Russian election-influence narrative, and a central figure in Senate hearings on the issue. He expressed his dismay over President Trump’s decision to dismiss Comey last week. The six-term senator and 2008 GOP nominee for president has been a pillar of anti-Trump Republicans since shortly after Trump’s announcement in 2015 when the two became embroiled in a controversy over Trump’s comment on McCain’s time as a Vietnam POW. “Never Trump” commentator Bill Kristol even called for McCain to intervene as an independent candidate on the eve of the 2016 Republican National Convention. McCain’s opposition to Russia’s foreign policy ambitions, dating back to the Cold War era, has played a central role in his political career. In his 2008 bid for the presidency, McCain famously wrote that “we are all Georgians” in advocating a stronger American response to the contemporaneous Russian military intervention in the small Caucasian state. He similarly called for the United States to provide military aid to Ukraine in 2014. Although he stopped well short of calling for impeachment or resignation, the ultimate fate of President Richard Nixon in the 1970s scandal he referenced, McCain’s appraisal of the situation fits neatly into an emerging mainstream media narrative that Trump’s actions rise to an equivalent level.",
      "date": "17 May 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Nolte: McCain Family’s #ActsOfCivility Campaign Is Stupid",
      "url": "https://www.breitbart.com/politics/2019/08/21/mccain-familys-actsofcivility-campaign-stupid/",
      "subtitle": "John McCain’s family intends to honor the first anniversary of the U.S. senator’s death with something stupid called the  #ActsOfCivility campaign.",
      "author": "John Nolte",
      "content": " According to the far-left Axios, “Examples from organizers include opening a dialogue with a competitor, committing to working with a colleague or peer with a different perspective and calling a family member you disagree with — and pledging to listen.” A spokesman for the McCain Institute told the Hill, “My family and I are going out of our way to properly meet our (not so) new neighbors, who on the face of it we have little in common with.” This is the dumbest thing ever, not to mention wildly hypocritical. Do we really need a lecture about civility from John McCain’s widow, Cindy, who racially profiled a family, accused them of being human traffickers, and then lied and said they were guilty, all to self-aggrandize? Do we really need a lecture about civility from The Great White View Screecher? Do we really need a lecture about civility from a family that is so small and bitter they turned a national funeral into a disgusting and divisive campaign rally against the sitting U.S. president and his supporters? And this is just typical of the McCains, to pervert a virtue, in this case “civility,” into an ego trip, into an effort to feel superior to us slobs, to get on TV, to speak down to everyone else because they are just so above it all. John McCain perfected this, the art of weaponizing virtues. His cynical ability to twist words like “honor” into an imperious spear that would win him and his insatiable ego a positive mention in the left-wing media was always his go-to move. And look at what most of this lame campaign centers on: imposing ourselves on others to make ourselves feel better about ourselves. How about just leaving these people the hell alone? We’re supposed to honor the anniversary of McCain’s death by being a pain in someone’s ass? Where is the virtue in imposing yourself on others just to make yourself feel good? And why does it always work this way with establishment Republicans who adore the establishment media…? Have you noticed that? Their idea of virtue, of nobility, is always a peacocking act of public surrender. How about if we honor John McCain with a day where we agree to stick by our principles, hold tight to our beliefs and what we believe is right, no matter how much pressure is brought down on us, no matter how many friends we lose, no matter how angry the fake news media get…? How about a day like that? You know, like repealing Obamacare… Oh, wait:  Or a day where we agree to stop grinding axes, holding grudges, and move on for the good for the country…? Oh, wait:  Or a day where we don’t snub those who have been unfailingly loyal, just to appease the elite. Oh, wait. Or a day where we pledge not to allow our envy and jealousy to push us to a point where we spread vicious lies about each other…? Oh, wait. Or a day where we don’t leak smears about black men who dare to have minds of their own…? Oh, wait. The horrible McCain family needs to sit down. Follow John Nolte on Twitter @NolteNC. Follow his Facebook Page here.",
      "date": "21 Aug 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Donald Trump Denies Knowledge of Military Effort to Hide USS John McCain During Japan Visit",
      "url": "https://www.breitbart.com/politics/2019/05/29/donald-trump-denies-knowledge-of-military-effort-to-hide-uss-john-mccain-during-japan-visit/",
      "subtitle": "President Donald Trump denied knowing of a White House effort to keep the USS John McCain out of sight during his visit to Japan and a trip to visit Armed Forces in the Pacific.",
      "author": "Charlie Spiering",
      "content": " “I was not informed about anything having to do with the Navy Ship USS John S. McCain during my recent visit to Japan,” Trump wrote on Twitter. “Nevertheless, the first lady and I loved being with our great Military Men and Women – what a spectacular job they do!” he wrote. Leaked emails between the White House Military Office and the Navy Seventh Fleet showed the White House working to make sure that the ship did not interfere with the president’s visit, according to the Wall Street Journal. A source identified as a “U.S. official” claimed that  Acting Defence Secretary Patrick Shanahan knew about the effort to hide the ship, but the Pentagon denied the story in a statement. “Secretary Shanahan was not aware of the directive to move the USS John S McCain nor was he aware of the concern precipitating the directive,” a spokesman told reporters. Sailors aboard the ship reportedly received the day off while sailors on some of the other ships attended Trump’s speech aboard the USS Wasp. The USS John S. McCain is named after John McCain Sr., not John McCain Jr. – the senator who deeply vexed President Donald Trump before McCain’s death in August 2018. The Navy reportedly covered the ship with a tarp and moved a barge in front of the ship to hide it, while it was being repaired. The Wall Street Journal reviewed photos of the ship. But a spokesperson for the U.S. Pacific Fleet told NBC News that the photo in the Wall Street Journal article was from Friday and the tarp was taken down on Saturday. The President visited the troops on Monday. The ship is currently under repair after crashing into a merchant ship in 2017, killing 10 sailors. The Navy also clarified the report on Twitter.  McCain’s daughter Meghan voiced her criticism of the president on Twitter. “Trump is a child who will always be deeply threatened by the greatness of my dad’s incredible life. There is a lot of criticism of how much I speak about my dad, but nine months since he passed, Trump won’t let him RIP. So I have to stand up for him,” she wrote. “It makes my grief unbearable.”  ",
      "date": "29 May 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Senator John McCain Pushed Trump Dossier to the Intel Community",
      "url": "https://www.breitbart.com/politics/2017/01/11/senator-john-mccain-pushed-trump-dossier-intel-community/",
      "subtitle": "The UK Daily Mail on Wednesday reported that Senator John McCain (R-AZ) pushed the dossier full of unverified claims about Donald Trump to the FBI:",
      "author": "John Hayward",
      "content": " Sworn Donald Trump enemy John McCain admitted Wednesday that he passed the dossier of claims of a Russian blackmail plot against the president-elect. The Arizona senator issued a public statement amid mounting questions of his exact role in the affair – and how a document riddled with errors and unverifiable claims came to be published. ‘Late last year, I received sensitive information that has since been made public,’ he said. ‘Upon examination of the contents, and unable to make a judgment about their accuracy, I delivered the information to the Director of the FBI. ‘That has been the extent of my contact with the FBI or any other government agency regarding this issue.’ But the Daily Mail – which, it should be noted, seems to like McCain about as much as McCain likes Trump – argues that the “2008 Republican loser” might have been “far more intimately involved than that.” Watergate legend Carl Bernstein is quoted telling CNN that McCain got the dossier from the former British ambassador to Moscow, who in turn got it from that mysterious “former British MI6 agent who was hired from a political opposition research firm in Washington” that we’ve been hearing so much about lately. Isn’t this precisely the kind of political influence operation our media spent the past few weeks freaking out about, when they thought Russia ran one against Hillary Clinton? It’s also a perfect example of what the establishment media really means when it complains about “fake news.” They’re very protective of their ability to shut down stories. They hate it when people who aren’t credentialed journalists use the Internet and talk radio to generate interest in something the media earlier deemed a non-story. If that interest grows intense enough, establishment media can find itself dragged back into covering something it didn’t want to cover. That’s what happened here: against its political interests, the establishment media didn’t think this bundle of opposition research was solid enough to merit coverage, but now it’s been pushed into the spotlight and they’re all talking about it. The new White House Chief of Staff, Reince Priebus, denigrated the source of what he called “phony-baloney garbage” perfectly on Wednesday morning: “I’ve read most of it. But what I can tell you is that even the New York Times last night refused to publish this document, which is not an intelligence document. Keep in mind, this is some retired guy somewhere out in the world acting like Ian Fleming, apparently trying to maybe write a fiction novel.” On Wednesday morning, we learned that a key figure in the dirty dossier, Trump counsel Michael Cohen, has produced convincing documentary evidence that he did not travel to Prague to meet with Kremlin officials, as the anti-Trump oppo dump alleges. We’re now told that it was some other Michael Cohen in Prague. It’s all starting to sound like a script written by the Coen Brothers. Also on Wednesday, NBC News revealed that the dossier, which contains “obvious errors,” was not actually presented to Trump by the intelligence community, as early reporting breathlessly asserted. Instead, Trump was given an oral briefing based on a two-page summary… as an example of what “disinformation” looks like. “Intel and law enforcement officials agree that none of the investigations have found any conclusive or direct link between Trump and the Russian government period,” the senior official said. According to the official, the two-page summary about the unsubstantiated material made available to the briefers was to provide context, should they need it, to draw the distinction for Trump between analyzed intelligence and unvetted “disinformation.” The briefers also had available to them unvetted “disinformation” about the Clinton Foundation, although that was not shared with Trump. (Emphasis mine, but NBC really should have emphasized it, or made it the lede for their story.) But Buzzfeed threw the full contents of that dossier out the public and said, Top media organizations and intelligence agencies couldn’t verify any of this stuff after months of hard work, but you folks can decide for yourselves! No doubt local Rotary clubs are putting together top-shelf intelligence bureaus and developing contacts in Moscow at this very moment. In his press conference on Wednesday morning, Trump thanked news organizations which refused to publish the salacious material when it was shopped to them during the campaign. “I do have to say that, and I must say that I want to thank a lot of the news organizations here today because they looked at that nonsense that was released by maybe the intelligence agencies, who knows, but maybe the intelligence agencies, which would be a tremendous blot on their record if they in fact did that, a tremendous blot. Because a thing like that should have never been written, and it should certainly never have been released,” he said. Senator McCain has absolutely no excuse for pushing this tripe to the FBI. He’s a senior senator with intelligence experience. He knew the sources for the most explosive “revelations” were extremely dodgy. He has always been very chummy with the press, so he would have known they didn’t think this material was solid enough to even allude to it during the election, no matter how badly they wanted Hillary Clinton to win – not even when they believed the FBI investigation of Clinton was severely damaging her image. To borrow a phrase from President-elect Trump, there are plenty of tremendous blots to go around today.",
      "date": "11 Jan 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Mark Levin: John McCain Funeral Coverage ‘Seems a Little Over the Top’",
      "url": "https://www.breitbart.com/the-media/2018/08/31/mark-levin-john-mccain-funeral-coverage-seems-a-little-over-the-top/",
      "subtitle": "Conservative talker Mark Levin told listeners of his nationally syndicated radio show Thursday that media coverage of the late Sen. John McCain’s memorial services “has gone on a little too long,” and “seems a little over the top.”",
      "author": "Joshua Caplan",
      "content": "  Transcript is as follows: And I say this with the deepest of sincerity – and I don’t want calls on this, by the way: Am I the only person in America who thinks the passing of McCain and the news coverage has gone on a little too long and it’s a little too much? Really, you can honor somebody, but this is going on day after day after day after day after day. And I don’t say this out of any animus whatsoever, period. Why do some public officials get this kind of treatment – Kennedy, McCain, so forth – and others get no treatment whatsoever. You’ve probably never even heard of them, probably weren’t on TV as much as say McCain or Lindsey Graham and so forth. To me the heroic part of John McCain has nothing to do with his service in the Senate and everything to do with his service in the United States military, and that’s why he’s a hero to the American people – what he did in the United States military and what was done to him, and his bravery. And we have a gentleman – I just told you – he’s still a member of the House of Representatives, by the name of Sam Johnson. Outside of Dallas, Texas, the vast majority of the American people have never heard of him. I have had him on the program in the past. And he won’t get a send away like this. So, why? And again, I don’t want calls on this. Is it because of his votes against Republicans, whether it was on immigration or Obamacare or tax cuts under Bush or things of that sort? I’m quite serious about this. In the election of 2008, most of the same voices we’re hearing today in the media and in the Democratic Party condemned McCain. Some even accused him of being racist – surprise, surprise, that’s what they do – and strongly supported Obama and pushed Obama. You had nasty editorials written about McCain. They would talk about his temper. They would talk about potential—they just went on and on and on. You and I, we’re the ones that voted for McCain, and we lost badly. The main reason is we wanted to stop Obama. But is it because McCain didn’t have fidelity to conservatism or Republicanism, or what is it? It’s incredible. We had this, for two days, these attacks on the president for being cheap, for being low, for being worse, because of the flag not being at half-mast throughout the mourning period. The mourning period, I think, goes through Sunday. Okay, fine. I understand that – that is, the criticism. But you don’t see the same kind of criticism applied to John McCain or the people who planned his goodbye in slighting Sarah Palin, which really is a mean thing to do. She never said a nasty word about John McCain, even when conservatives were raising questions about what he did and so forth. She never did. When I had her on a couple months ago, on Life, Liberty & Levin, wouldn’t say a negative thing about him. Never did. She was his vice presidential running mate. He picked her. That seems to be a little bit more relevant to me than the flag flying at half-mast through Sunday, and yet you’ll see almost no criticism of this by the same so-called news outlets, the same so-called voices , you know, the same crowd who can’t wait to attack Trump. But I’m just saying, it seems a little over the top to me, what’s going on, and they’re not done. Today is Thursday, right, Rich? So, we got Friday, Saturday, Sunday. So that’s really a full week. And I want to make abundantly clear—I want to say it again, because people like to twist my words and try to destroy our program—this has nothing to do with animus. It’s an observation. Was it because he was a presidential candidate? Is that what Mitt Romney will get? I don’t know. But I suspect the media attention is more a result of him breaking with orthodox conservatism or traditional conservatism at key points, at which he was very, very helpful to the Democrat Party and the left, which, of course, we know the media embrace. Just one man’s observation. [HT CNS/Michael Morris]",
      "date": "31 Aug 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "John McCain: Pro-Trump Republicans on ‘Wrong Side’ of Immigration Debate",
      "url": "https://www.breitbart.com/politics/2018/05/09/john-mccain-pro-trump-republicans-wrong-side-immigration-debate/",
      "subtitle": "Sen. John McCain (R-AZ) reportedly slams America-first Republicans for being on the “wrong side” of the immigration debate in his new book, rehashing the same establishment talking points on the issue that President Donald Trump debunked in 2016.",
      "author": "Tony Lee",
      "content": " “Right now, Republicans are on the wrong side of that progress,” McCain reportedly writes in his new book, Restless Wave, according to a Wednesday report in the Guardian. “And if we want to retain our competitiveness in the fastest-growing communities in the country we’ll stop letting the zealots drive the debate, and fix the problems that [give] them their soapbox.” McCain also urges Republicans to reject those who think America is being “contaminated by the customs of non-European immigrants.” With the help of his establishment collaborator Mark Salter, McCain repeats the same GOP establishment talking points about how Republicans cannot win elections, minorities, and swing voters without supporting amnesty for nearly all illegal immigrants in a comprehensive immigration package. After the 2012 election, the Republican National Committee produced its infamous and incompetent “autopsy” report in which the only policy solution was amnesty for illegal immigrants. In 2016, though, Trump made illegal immigration a centerpiece of his economic nationalist campaign. Trump not only won the presidency, but he did so while getting more support among people of color than establishment darling Willard “Mitt” Romney received four years before. McCain also claimed that America-first Republicans only make up a “small fraction in the Republican Party.” Perhaps McCain was confusing establishment Republicans in the permanent political class with actual voters that they have shown to have absolutely nothing but contempt and disdain for, especially when it comes to immigration and strong borders. “They’re still a small fraction in the Republican Party. But they’re the ones getting all the attention right now. They need to be confronted, not ignored or winked at or quietly dismissed as kooks,” McCain writes. “They need to be confronted before their noxious views spread further and damage for generations the reputation of the Republican Party.” As Breitbart’s John Binder has noted, polling has shown that immigration is one of the most important issue for GOP primary voters, a vast majority of whom also want to also cut legal immigration. Immigration has always been one of the most powerful issues for the GOP base. McCain found that out during his 2008 presidential run when his primary campaign nearly went bankrupt after he teamed up with the late Sen. Ted Kennedy (D-MA) to push comprehensive amnesty legislation, which then-President George W. Bush also backed. At one point, McCain had to carry his own bags and fly in coach class to New Hampshire. His campaign’s dire financial situation ultimately resulted in McCain being burdened with incompetent advisers who were in over their heads—like Nicolle Wallace and Steve Schmidt—managing his campaign, which was unable to rebut the barrage of ads the Obama campaign unleashed on McCain in key swing states like Virginia. McCain, though, has been insistent that Congress try again to pass a “Gang of Eight” amnesty bill, telling the Arizona Republic last year it is one of the main issues he would like to see resolved.",
      "date": "9 May 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "John McCain (1936-2018): Conservative Frenemy, American Hero",
      "url": "https://www.breitbart.com/politics/2018/08/25/john-mccain-1936-2018-conservative-frenemy-american-hero/",
      "subtitle": "Sen. John McCain (R-AZ) passed away Saturday, 4:28 p.m., at the age of 81 after a months-long battle with brain cancer.",
      "author": "Joel B. Pollak",
      "content": " McCain was born on a U.S. Navy base in Panama in 1936, the son and grandson of career Navy officers. He graduated from the U.S. Naval Academy and served as a Navy pilot in the Vietnam War. He was shot down over Hanoi in 1967 and was a prisoner of war for five and a half years. McCain was tortured by the North Vietnamese, leaving him permanently disabled. He famously refused to be released ahead of POWs who had been captured first — denying the enemy a propaganda coup, since his father was then the commander of all U.S. forces in Vietnam. Upon his release in 1973, McCain studied at the Naval War College in Washington, DC, where he puzzled over the question of America’s struggles in Vietnam, ultimately concluding that lack of political commitment to victory had led to defeat. It was a lesson that would guide his later approach, in Congress, to America’s foreign interventions. McCain was assigned to be the Navy’s liaison to the Senate in 1977, which served as his introduction to politics. He retired in 1981 and ran for Congress in Arizona’s first congressional district in 1982, and won. He opposed U.S. intervention in Lebanon, defying President Ronald Reagan, warning that there was no clear strategy for victory. He was proved correct, tragically, when a terrorist drove a truck bomb into the U.S. Marine barracks in Beirut later that year, killing hundreds of American and French peacekeeping troops and leading to an American withdrawal. In 1986, McCain won his first term in the U.S. Senate. He soon found himself embroiled in scandal as one of the Keating Five, accused of intervening in a federal investigation of the Lincoln Savings and Loan, run by McCain donor Charles H. Keating, Jr. McCain was cleared of any wrongdoing beyond poor judgment, but the experience had scarred him deeply, and he committed the rest of his Senate career to fighting against corruption and waste. McCain soon developed a reputation as a “maverick,” defying his party whenever he thought it was veering too far to the right (or, critics said, whenever it suited his own ambitions). In 2000, McCain ran for President, mounting a strong primary campaign against Texas governor George W. Bush and winning New Hampshire, where his brand of centrist politics found traction. He lost a bitter South Carolina primary race, however, and soon ran out of steam. In the Senate, McCain continued to build a profile as a reformer. His major achievement was the McCain-Feingold campaign finance reform law, officially known as the Bipartisan Campaign Reform Act (BCRA), which passed in 2002. Many Republicans were deeply critical of BCRA, which they saw as a form of unilateral disarmament and a limit on free speech. Parts of the law were ruled unconstitutional in the controversial Citizens United case in 2010. McCain also joined the “Gang of 14,” a bipartisan group of Senators that fought to preserve the filibuster after the Republicans threatened to end it in response to Democrats repeatedly blocking President Bush’s judicial nominees. And McCain continued to work with Democrats, notably Sen. Ted Kennedy (D-MA), in proposing immigration reform bills that were backed by the administration but ultimately collapsed due to opposition within both parties. In 2003, McCain joined a bipartisan majority in the Senate in supporting the Iraq War. But unlike many others, who abandoned the war as a terrorist insurgency grew, McCain remained committed to victory. Drawing from his ideas on Vietnam, he argued that the U.S. needed additional troops to secure Iraqi cities, defeat local Al-Qaeda cells, and prevent new terrorists from infiltrating. As the war grew more unpopular, he was virtually alone in his position. However, President George W. Bush agreed with him, and launched the “surge” in 2007, in defiance of the opinions of the top military brass and the Iraq Study Group, a bipartisan panel that recommended reducing U.S. commitment to the war. McCain put aside his old rivalry with Bush and became the best surrogate for the White House’s policy. In 2007, McCain launched a second presidential campaign. He was seen as a long-shot candidate, especially after his campaign lost several key staff members in mid-2007. But his steadfast commitment to the surge helped him to stand out among the other candidates on the debate stage, and voters were moved by the force of his convictions. In addition, it was clear that the electorate was ready for change, and McCain made the case that he alone among Republicans had a record of fighting for reforms. He won New Hampshire again, and eventually the nomination. In the general election, McCain faced then-Sen. Barack Obama (D-IL), who had just won a spectacular, if brutal, victory over then-Sen. Hillary Clinton (D-NY) in the Democratic primary. McCain made the controversial decision not to attack Obama for his deep ties to the racist Chicago preacher Jeremiah Wright — perhaps out of a sense of guilt for his own early opposition to naming a pubic holiday for Dr. Martin Luther King, Jr., which he regretted. McCain trailed Obama for most of the summer of 2008. But he bested Obama at a religious forum hosted by pastor Rick Warren, and then upended the entire race by naming Alaska Gov. Sarah Palin as his running mate, the first time a woman had been named to a Republican presidential ticket. Palin, a corruption-busting fellow “maverick,” captured the public imagination and briefly attracted the interest of women voters disappointed by Clinton’s loss. But the McCain-Palin lead was short-lived. The media targeted Palin with hostile, even condescending, coverage. And then, in mid-September, the global financial crisis struck as Wall Street giant Lehman Brothers collapsed. Obama, who had criticized the Bush administration’s economic performance for months, seemed prescient. McCain decided to show leadership by suspending his campaign and returning to Washington, DC, where he backed a $700 billion bailout in the form of the Troubled Assets Relief Program (TARP), which was decried by conservatives and liberals alike. Obama, too, voted for TARP, but by the time they arrived at the first presidential debate a few days later, there was no longer any real difference between the candidates. Obama went on to win the election easily. Conventional wisdom in party establishment circles partly blamed Palin for McCain’s loss, but she helped turn out the conservative vote in areas where the moderate McCain had struggled to connect. Recently, McCain said that he regretted choosing Palin instead of Democrat-turned-independent Sen. Joe Lieberman of Connecticut, a fellow foreign policy hawk and the man who nearly became vice president on the Democratic ticket with Al Gore in 2000. Back in the Senate, McCain remained deeply critical of Obama’s foreign policies, as the new administration backed away from the country’s previous commitments to Iraq, creating a vacuum for the Iranian regime and new terrorist groups like the so-called Islamic State. But McCain remained a maverick, and joined the bipartisan “Gang of Eight” in proposing a new immigration reform bill — despite having run for re-election in 2010 on a promise to “build the danged fence” along the U.S.-Mexico border. The bill ultimately died due to conservative opposition in the House. In 2015, McCain was deeply critical of Donald Trump, who had entered the race for president on a platform of strong opposition to illegal immigration. In response, Trump aimed a pointed insult at McCain’s war record: “I like people who weren’t captured.” That ignited a feud that never ended. McCain’s decisive, dramatic “thumbs-down” vote to defeat an effort to repeal Obamacare in July 2017 was widely perceived as motivated by personal revenge. McCain announced that he had brain cancer last July, but continued to work in the Senate as he received treatment. His condition worsened in recent months, and he returned to Arizona to convalesce at home, surrounded by friends and family. His family announced on Aug. 24 that he was ending medical treatment. He is survived by his wife, Cindy McCain (née Hensley), his first wife, Carol Shepp McCain; seven children, many grandchildren, and his redoubtable mother, Roberta, still alive at the ripe old age of 106. Associates of the ailing Senator made it clear in the closing days of his life that he did not want President Trump to attend his funeral. John McCain will be remembered for many things — his heroic endurance in Vietnam, his passion for reform, his battles with his own party, and his support for the military. But perhaps the most memorable tribute came from the conservative columnist Charles Krauthammer, who wrote after McCain’s tough loss in the 2008 election: “He will be — he should be — remembered as the most worthy presidential nominee ever to be denied the prize.” Joel B. Pollak is Senior Editor-at-Large at Breitbart News. He was named one of the “most influential” people in news media in 2016. He is the co-author of How Trump Won: The Inside Story of a Revolution, is available from Regnery. Follow him on Twitter at @joelpollak.",
      "date": "25 Aug 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "John McCain in Last-Minute Attempt to Avert Gorsuch Constitutional Option",
      "url": "https://www.breitbart.com/politics/2017/03/30/john-mccain-in-last-minute-attempt-to-avert-gorsuch-constitutional-option/",
      "subtitle": "Sen. John McCain (R-AZ) is in talks with his Democratic counterparts Thursday, as the battle lines over Judge Neil Gorsuch’s Supreme Court nomination solidify around him.",
      "author": "Ian Mason",
      "content": " Earlier Thursday, Sen. Maria Cantwell (D-WA) issued a press release stating she will be the latest Democrat to join the effort to block Gorsuch from receiving a vote on the Senate Floor. By Breitbart’s count, the majority of the Senate Democratic Caucus have now pledged their support for a filibuster, called for initially by Senate Minority Leader Chuck Schumer (D-NY). At most, twelve remain undecided. An NBC News/SurveyMonkey poll released Thursday put the American public at 54% for giving Gorsuch an up-or-down vote, while 37% are opposed. A growing number of Republican senators, in light the increasing indication Democrats will reach the fourty-one votes needed for a successful filibuster, have expressed their willingness to invoke the “Constitutional Option” and extend the Democrats’ elimination of filibusters to Supreme Court nominees once and for all. McCain, one of the longest-serving Republicans in the Senate, is attempting to reach some kind of deal to put Gorsuch on the Supreme Court and yet save the traditional sixty-vote cloture rule. For any such deal, he would need six additional Democrats to join the upper chamber’s fifty-two Republicans and two Democrats, Sen. Joe Manchin (D-WV) and Sen. Heidi Heitkamp (D-ND), who each issued statements Thursday indicating they would support Gorsuch’s confirmation. “There’s always hope, because maybe we’ll recognize the damage that’s been done to the institution and the American people,” McCain told Bloomberg Politics. “I’ll have conversations, but I’m not optimistic.” Sen. Jeff Flake (R-AZ) engaged in negotiations across the aisle of his own. “While he has been urging Democratic colleagues not to filibuster, he has been clear that he will do whatever is necessary to confirm Judge Gorsuch to the Supreme Court,” his spokesman Jason Samuels told Breitbart. Neither Flake nor McCain expressed a great deal of hope the looming showdown between the two rapidly entrenching blocs over the future of Senate rules could be averted before the vote on Gorsuch’s nomination, now set for April 7.",
      "date": "30 Mar 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Ana Navarro on Trump’s McCain Attacks: ‘You Pathological President Liar’",
      "url": "https://www.breitbart.com/clips/2019/03/21/ana-navarro-on-trumps-mccain-attacks-you-pathological-president-liar/",
      "subtitle": "null",
      "author": "Pam Key",
      "content": " Thursday on ABC’s “The View,” guest co-host Ana Navarro got visibly angry during the panel discussion about President Donald Trump‘s latest attacks on late Sen. John McCain (R-AZ). After playing a clip of the president saying, “I gave him the kind of funeral that he wanted. I didn’t get a thank you, but that’s OK,” Navarro said, “First of all, John McCain didn’t get the funeral that he wanted. He got the funeral that he deserved. He got the funeral that he earned through more than 60 years of service and sacrifice and pain for this country, something that Donald Trump would know nothing about because for more than 70 years it’s been all about Trump for him.” She continued, “Number two, he didn’t approve anything other than the plane which they could have gotten themselves. It was Congress who allowed John McCain to lay in state. It was the National Cathedral that allowed John McCain’s mass to be held there. Number three, he also said that John McCain had not done anything for veterans, that John McCain had — you know, that they had failed in getting choice and accountability for many decades. Lie! You pathological president, liar, liar, liar! John McCain and Bernie Sanders passed the Choice and Accountability Act in 2014. It was signed by Barack Obama while you were calling into question his citizenship.” She added, “I add, every time he talks about it, we need to call it out. It’s awkward for you. It’s painful for you. It might be exhausting. We cannot get exhausted. We cannot get tired of being outraged by what this man is doing to the presidency of the United States.” Follow Pam Key on Twitter @pamkeyNEN",
      "date": "21 Mar 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Ex-Biden Chief of Staff: Trump ‘Subhuman’ for Attacking John McCain",
      "url": "https://www.breitbart.com/the-media/2019/03/19/ex-biden-chief-of-staff-trump-subhuman-for-attacking-john-mccain/",
      "subtitle": "Ron Klain, former chief of staff to Vice President Joe Biden and Al Gore, said on MSNBC Tuesday that President Donald Trump’s criticism of the late Sen. John McCain (R-AZ) shows the president is “subhuman.”",
      "author": "Joshua Caplan",
      "content": "  A partial transcript is as follows: NICOLLE WALLACE: I’ve got a few theories, but take me through the relapse into McCain Derangement Syndrome from the man in the Oval Office. PHILIP RUCKER: Well, I’ll see if I can do that, Nicole. I mean, Trump has been nursing a grudge about John McCain for more than three years now. Go all the way back to the first big controversy of Trump’s presidential campaign in August of 2015 in Iowa, where Trump made a really flippant remark about McCain saying “I like heroes who weren’t captured” and he got tremendous heat and blowback on that, including from the Republican National Committee and throughout the party establishment, and Trump, instead of apologizing to McCain and commending his war service, just dug in. Every since then, McCain has been sort of a ghost in Trump’s mind, somebody he can’t shake. He was really bothered by that healthcare vote, obviously, but it’s been other things. … RON KLAIN: I think there’s a personal element and a political element. On the personal side, you know, Meghan McCain says that Donald Trump is not a great man. I would say what we saw this weekend shows that Donald Trump is barely human. I mean, to go after and attack John McCain, a national hero, months after his death, is just, it’s subhuman. It’s not only not befitting a president, it’s not befitting basic common norms of decency, that’s the human aspect of it. From a political aspect, if Donald Trump really wants to relitigate the vote on Obamacare over and over again, my party won a national election in 2018 when the issue was health care, when the issue was whether or not Donald Trump was going to take away people’s coverage for pre-existing condition. Every time Donald Trump wants to sit in the Oval Office and say, “I wish I’d taken away people’s coverage for pre-existing conditions,” that’s a videotape my party would love to see on T.V. every day of the week.",
      "date": "19 Mar 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Nolte: Of Transsexuals, Obese Models, John McCain, and Thoughtcrime",
      "url": "https://www.breitbart.com/politics/2019/03/21/nolte-of-transsexuals-obese-models-john-mccain-and-thoughtcrime/",
      "subtitle": "One of the more enjoyable facets of getting older — I just turned 53 — is becoming less and less concerned about the future. Hopefully I got another 30 years in me, but the truth is that the future no longer belongs to me and as more time passes I feel less and less responsible for whatever happens next. I put in my time, fought the good fight for freedom and now it’s up to younger people to fight for theirs … or not.",
      "author": "John Nolte",
      "content": " Let me put it this way, had social media banned me 10 years ago, I would have been mortified. If social media bans me today, I’ll hardly miss it. If social media bans me in five years, why would an old guy counting the seconds to retirement, to the moment he can drive a  pickup truck over his iPhone, give even half a damn? So it is with more amusement than concern that I watch as fascist social media corporations, the Democrat Party, and most especially the corporate media go the full-Orwell when it comes to throughtcrimes. My use of Orwell’s “thoughtcrime” is not for affect or hyperbole. Without question, there is a serious, organized, and intense campaign at work here, a campaign backed by billions of corporate dollars, to abuse the public into believing things that are simply not true. And the punishment for committing the crime of holding “unacceptable” thoughts and/or ideas is real: public shaming, bullying, banishment from the public square (social media), and economic sanctions — job losses, advertising boycotts, etc. Here are three of the most absurd thoughtcrimes: Gender is Fluid No, not it’s not. Biologically, gender is imprinted on every strand of your DNA and is more pronounced than skin color. That is scientific fact. But this is how absurd things have become: if I ran around pretending to be a black woman, even though I have more science on my side to back up my claim of being black, the anti-science fascists would condemn my cultural appropriation while celebrating my gender dysphoria. It’s pure madness, and it goes like this… Caitlyn Jenner is a woman. No, he’s not. She is because she says she is. Science, biology, and his schlong says he’s not. You’re a bigot. Because I don’t want mentally ill men allowed in public restrooms with young girls? How dare you call her mentally ill. It is what it is. So androgynous rock stars are mentally ill — David Bowie and Annie Lennox? Gender non-conformity is not the same as gender dysphoria. One is rebellion, self expression. The other is something tragic. People should be allowed to live their lives in whatever way they choose. That’s rich coming from a pronoun Nazi. You’re a monster. Trans people deserve our compassion and support. Agreed. My uncle identified as a TV antennae. We didn’t patronize him. We got him help. We could have exploited him. Put him in the circus or on the roof. But because we care about him, he got treatment. You’re exploiting people in desperate need of psychological help for political reasons. That makes you the monster. Call Caitlyn a “she” and believe it or you’re blacklisted. Oh, and these trans folks are going to destroy women’s sports. They’re women because they say they’re women. Call me Napoleon. Obese Swimsuit Models are Beautiful No, no they’re not. They’re the opposite of attractive. Sure, some people find naked obese women (and men) attractive, but that’s what we call a fetish. Today, however, we are being ordered to find a 300 pound woman in a string bikini sexy — or at least to pretend we do convincingly enough to avoid punishment. Hey, I’m not trying to be an asshole about this; no one wants to see me in a speedo, but I’m not the fascist who’s bullying everyone into pretending otherwise. And it goes like this… Naked, fat women are beautiful. Do you believe in evolution? Of course I do. Scientifically it makes no sense for our species to find obese women attractive, which is why we don’t. It is a biological fact that men are hard-wired to look for healthy mates as a means to propagate the species, which is why —  whether it is someone who’s ill, someone very old, or an obese someone — unhealthy people are unattractive to us. Nature has programmed us to not be sexually turned on by the unhealthy, and that includes fat people. You’re a bigot. How can my personal tastes and preferences make me a bigot? Am I a bigot because I don’t like Lord of the Rings or Jerry Lewis movies or watching two guys kiss? So you’re a homophobe! My stash of lesbian porn says different, and I’m not discriminating against fat people, saying we should not hire them or give them housing. I just don’t want to see them in underwear catalogs. People should be allowed to live their lives however they wish. You keep saying that even as you bully me over my personal beliefs. You’re a monster for not lying about this. Fat women need your support. What they need is a treadmill. John McCain Was an Honorable, Patriotic, Super-Duper American This is my favorite thoughtcrime. Maybe my all-time favorite. Why? Because I’m old enough to remember when the media told me McCain was an old, white, racist, womanizing, corrupt war criminal. But that was back in ’08 when he was the only thing between a Democrat and the White House. Today, however, he is St. John McCain. Alexandria Ocasio-Crazy can trash the late Ronald Reagan all she wants with no repercussions, but President Trump criticizing McCain’s dishonorable role in a number of dishonorable acts — why you’d think Trump was hiring Russian hookers to pee on a bed Obama slept in, or something. And it goes like this… John McCain was one of the greatest and most honorable Americans who ever lived. Ten years ago you told me he was a racist war criminal. Ten years ago you voted for him. Because my only other choice was socialist who hung out with domestic terrorists. Shame on you. John McCain was a war hero. Yes, he was a war hero, but even war heroes can grow into bitter, dishonest, and petty old men — and that is what happened to John McCain. You’re only saying that to side with Trump. I’ve despised John McCain since the aughts, since he constantly undermined President George W. Bush as payback for losing the 2000 primary and as a means to seek favor with the establishment media because he knew he would run for president again in 2008. John McCain was a preening, narcissistic peacock 15 years before he launched this feud with Trump. And yes, he did launch this feud with Trump. McCain started it. John McCain was honorable to the end. He wasn’t all bad, but he was one of the Keating Five and his fascist attempt to protect incumbency by criminalizing political speech through the McCain-Feingold Act is the most un-American pieces of legislation passed in the last 50 years. What’s more, his neurotic and narcissistic need to be seen as “honorable” resulted in him suspending his presidential campaign — the single most dumbest thing I have ever witnessed. How dare you speak the truth about an honorable man! Tell me what’s honorable about giving your word to voters over the course of a decade about repealing Obamacare and then breaking your word so you can bathe in a news-cycle? What’s honorable about attacking the powerless or planning your own never-ending funeral, a funeral longer than a presidential funeral, and premising it on your own spite? What’s honorable about never letting go of grudges? What’s honorable about trying to make Hillary Clinton president by spreading a dossier filled with lies to your pals in the media? McCain is dead, yes, but he died a petty, grasping, dishonest, backstabbing old man. As if Trump is perfect. As if you freaks demand I say he is. You shouldn’t speak ill of the dead. Don’t force me to by demanding I swallow your lies. We should end this debate on common ground. Meghan McCain is a horrible person. I’ll drink to that. — You see what’s happening? Corporate power is not arguing with us, is not debating us… which would be fine. Rather, these fascist corporations are creating actual “thoughtcrimes,” not only by criminalizing certain beliefs and opinions, but the belief in something scientifically true. Men cannot become women. Lena Dunham’s naked body is disgusting. John McCain was not a good man. Sorry, he just wasn’t. I don’t like saying that about a dead man, but I won’t be bullied into silence in the face of all these revisionist lies. Trump has every right to be furious with McCain. Yes, he may be dead, but as Michelle Malkin put it so well, his dishonorable legacy lives through the victims of Obamacare and the phony Russia dossier. And if the media don’t want to see McCain criticized, they should stop asking Trump about McCain. But the media do keep asking because they know Trump is guilty of thoughtcrime, of not holding the “approved” opinion of McCain, and asking about McCain allows the media to keep punishing that particular thoughtcrime. It is sick and un-American, to say the least. Follow John Nolte on Twitter @NolteNC. Follow his Facebook Page here.",
      "date": "21 Mar 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "McCain Saves Obamacare Again, Tanks Graham-Cassidy Obamacare Repeal Bill",
      "url": "https://www.breitbart.com/politics/2017/09/22/mccain-saves-obamacare-again-tanks-graham-cassidy-obamacare-repeal-bill/",
      "subtitle": "Sen. John McCain (R-AZ) said in a statement on Friday that he will oppose the Graham-Cassidy Obamacare repeal bill. McCain’s vote against Graham-Cassidy effectively tanks renewed efforts to repeal Obamacare.",
      "author": "Sean Moran",
      "content": " McCain said in a statement: I cannot in good conscience vote for the Graham-Cassidy proposal. I believe we could do better working together, Republicans and Democrats, and have not yet really tried. Nor could I support it without knowing how much it will cost, how it will effect insurance premiums, and how many people will be helped or hurt by it. Without a full CBO score, which won’t be available by the end of the month, we won’t have reliable answers to any of those questions. This is the second time McCain saved Obamacare from repeal in the Senate. He first tanked Obamacare in August when he and Sens. Lisa Murkowski (R-AK) and Susan Collins (R-ME) voted against the “skinny” Obamacare repeal bill. The measure failed by one vote. McCain added that he takes no pleasure in derailing legislation sponsored by his friends Sens. Lindsey Graham and Bill Cassidy and hopes that Congress can strike a bipartisan deal on the future of health care. McCain concluded his statement by saying, “I hope that in the months ahead, we can join with colleagues on both sides of the aisle to arrive at a compromise solution that is acceptable to most of us, and serves the interests of Americans as best we can.”",
      "date": "22 Sep 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "John McCain: ‘Go to Hell’ If You Don’t Like that I Passed Pee Dossier to FBI",
      "url": "https://www.breitbart.com/politics/2018/05/24/john-mccain-go-to-hell-if-you-dont-like-that-i-passed-pee-dossier-to-fbi/",
      "subtitle": "NEW YORK — In his newly released book, Sen. John McCain admits he knew the anti-Trump dossier that he infamously passed to the FBI contained “unproven accusations,” “mostly raw, unverified intelligence” and allegations about which the senator “had no idea” if “any were true.”",
      "author": "Aaron Klein",
      "content": " Yet McCain maintains he had an “obligation” to pass the wild charges against Donald Trump to FBI Director James Comey and he would even do it again. “Anyone who doesn’t like it can go to hell,” McCain exclaimed. In the book The Restless Wave, McCain provides an inside account of how he says he came across the dossier. He writes that he was told about the claims in the document at a security conference in Canada in November 2016, where he was approached by Sir Andrew Wood, a former British ambassador to Moscow and friend of ex-British spy Christopher Steele, the author of the dossier. McCain wrote that Wood told him Steele “had been commissioned to investigate connections between the Trump campaign and Russian agents as well as potentially compromising information about the President-elect that Putin allegedly possessed.” McCain, however, did not address the obvious question of whether he was told exactly who “commissioned” Steele to “investigate” the alleged Russian ties. The dossier was commissioned by the controversial Fusion GPS opposition research firm, which was paid for its anti-Trump work by Trump’s primary political opponents, namely Hillary Clinton’s 2016 presidential campaign and the Democratic National Committee (DNC) via the Perkins Coie law firm. McCain goes on to describe Wood as telling him Steele’s work “was mostly raw, unverified intelligence, but that the author strongly believed merited a thorough examination by counterintelligence experts.” The politician says the dossier claims described to him were “too strange a scenario to believe, something out of a le Carré novel, not the kind of thing anyone has ever actually had to worry about with a new President, no matter what other concerns.” Still, McCain says he reasoned that “even a remote risk that the President of the United States might be vulnerable to Russian extortion had to be investigated.” McCain concedes Wood told him he had not actually read the dossier himself, and writes that he wasn’t sure if he ever met Wood before and couldn’t recall previously having a conversation with Wood. Still, McCain took Wood’s word for it when Wood vouched for Steele’s credibility. “Steele was a respected professional, Wood assured us, who had good Russian contacts and long experience collecting and analyzing intelligence on the Kremlin,” McCain wrote. Present at the meeting with Wood and McCain was David J. Kramer, a former State Department official and longtime McCain associate who agreed to “go to London to meet Steele, confirm his credibility and report back to me.” McCain doesn’t detail Kramer’s visit to London beyond simply writing, “When David returned, and shared his impression that the former spy was, as Sir Andrew had vouched, a respected professional, and not to outward appearances given to hyperbole or hysteria, I agreed to receive a copy of what is now referred to as ‘the dossier.’’’ McCain leaves out exactly where Kramer obtained his dossier copy. The Washington Post reported in February that Kramer received the dossier directly from Fusion GPS after McCain expressed interest in it. Those details marked the clearest indication that McCain may have known that the dossier originated with Fusion GPS, meaning that he may have knowingly passed on political material to the FBI. Also, in a New York Times oped in January, GPS co-founders Glenn Simpson and Peter Fritch wrote that they helped McCain share their anti-Trump dossier with the Obama-era intelligence community via an unnamed “emissary.” Without mentioning Fusion GPS, McCain goes on to briefly describe turning over the dossier to Comey: The allegations were disturbing, but I had no idea which if any were true. I could not independently verify any of it, and so I did what any American who cares about our nation’s security should have done. I put the dossier in my office safe, called the office of the Director of the FBI Jim Comey and asked for a meeting. I went to see him at his earliest convenience, handed him the dossier, explained how it had come into my possession. I said I didn’t know what to make of it, and I trusted the FBI would examine it carefully and investigate its claims. With that, I thanked the director and left. The entire meeting had probably not lasted longer than ten minutes. I did what duty demanded I do. I don’t know what is true, partially true or not true in the dossier. I gave it to the people best equipped to answer those questions. Had I done any more, I would have exceeded my capability. Had I done any less I would be ashamed of myself. And if any of my colleagues in Congress had been in my situation and not done what I did, I would be ashamed of them. McCain implies he was essentially targeted as an appropriate venue to deliver the dossier to the FBI due to his hawkish views on Putin and Russia: Why had I been given the dossier? That’s the first accusatory question in every budding conspiracy theory about my minor role in the controversy. The answer is too obvious for the paranoid to credit. I am known internationally to be a persistent critic of Vladimir Putin’s regime, and I have been for a long while. Wood and Steele likely assumed that my animosity toward Putin, which I unapologetically acknowledge, ensured that I would take their concerns seriously. They assumed correctly. A few weeks after McCain gave Steele’s dossier to Comey on Dec. 9, 2016, the FBI chief updated then President-Elect Trump and President Obama on the dossier in a classified briefing. As Breitbart News documented, Comey’s dossier briefing to Trump was subsequently leaked to the news media, setting in motion a flurry of news media attention on the dossier, including the release of the document to the public. The briefing also may have provided the veneer of respectability to a document that had been circulating for months within the news media but widely considered too unverified to publicize. Aaron Klein is Breitbart’s Jerusalem bureau chief and senior investigative reporter. He is a New York Times bestselling author and hosts the popular weekend talk radio program, “Aaron Klein Investigative Radio.” Follow him on Twitter @AaronKleinShow. Follow him on Facebook. Written with research by Joshua Klein.",
      "date": "24 May 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Sarah Palin on John McCain: ‘Today We Lost an American Original’",
      "url": "https://www.breitbart.com/politics/2018/08/25/sarah-palin-on-john-mccain-today-we-lost-an-american-original/",
      "subtitle": "Sarah Palin, former Alaska governor and 2008 vice presidential candidate, called her former running mate Sen. John McCain (R-AZ) a “maverick and a fighter” in a statement after his death Saturday afternoon.",
      "author": "Kristina Wong",
      "content": " “Today we lost an American original. Sen. John McCain was a maverick and a fighter, never afraid to stand for his beliefs. John never took the easy path in life — and through sacrifice and suffering he inspired others to serve something greater than self,” she said. “John McCain was my friend. I will remember the good times. My family and I send prayers for Cindy and the McCain family.” After McCain became the GOP nominee in 2008, he chose Palin as his running mate, an unconventional pick that underscored his “maverick” streak. She tweeted out a picture of the two of them on the 2008 campaign trail:  McCain died Saturday afternoon, after a long fight with brain cancer. His family announced Friday morning that he was ending treatment.",
      "date": "25 Aug 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Pollak: Donna Brazile Trashed John McCain While He Was Alive; Now She’s His Biggest Fan",
      "url": "https://www.breitbart.com/the-media/2019/03/20/pollak-donna-brazile-trashed-john-mccain-while-he-was-alive-now-shes-his-biggest-fan/",
      "subtitle": "Former interim Democratic National Committee chair Donna Brazile was full of posthumous praise for the late Sen. John McCain (R-AZ) on Wednesday’s edition of Fox News’ Special Report with Bret Baier.",
      "author": "Joel B. Pollak",
      "content": " The context was President Trump’s renewed criticism of McCain after a newly-released deposition showed how deeply McCain was involved in the fraudulent “Russia dossier” that has been used to attack the administration and divide the nation. Brazile, who Fox News recently hired as a contributor, began by criticizing the president for speaking ill of the dead. She then continued: “John McCain leaves a legacy. He leaves a legacy of sacrifice. … John McCain should be honored for his service.” It is heart-warming to read tributes to McCain from people who ignored his heroism and sacrifice and smeared his character when he ran against Barack Obama and, later, criticized him as president. In 2014, for example, Brazile tweeted a hit piece on McCain, “The Vacant Soul of Senator John McCain.” She added: “Interesting article.”   The article was a response to McCain’s criticism of Obama for the Bowe Berghdal prisoner swap, in which the U.S. freed five major Taliban terrorists from Guantanamo Bay. McCain, a prisoner-of-war himself in Vietnam for five-and-a-half years, nevertheless criticized the deal. (Berghdal was later convicted of desertion.) What Brazile called an “interesting article” was a mean-spirited personal attack, with lines such as: “McCain had so much sunshine blown up his ass that his colon must have looked like Cabo San Lucas.” It referred to the war hero as a “small boy,” and accused him of handing U.S. foreign policy to corrupt “spooks and crooks.” When McCain was alive, and — as it happens — in the right, Brazile said he had a “vacant soul.” Now she is his number-one fan. The media do not love McCain for his service, which many did their best to ignore. No — the media love him as a foil to other Republicans — a role he has relished playing from the time he was the maverick alternative to George W. Bush during the 2000 Republican primary. They hated him when he was an effective critic of Obama’s foreign policy. They loved him again when he feuded with Trump in the 2015-6 election. McCain made sure the feud would continue beyond his death. The media loved it, too: “Mr. McCain had carefully stage-managed a four-day celebration of his life — but what was also an unmistakable rebuke to President Trump and his agenda,” the New York Times wrote. At the time, Trump swallowed his pride. Now that he is talking about McCain again, the last people to criticize the president should be those, like Donna Brazile, who trashed him while he was living, and when it mattered. Joel B. Pollak is Senior Editor-at-Large at Breitbart News. He is a winner of the 2018 Robert Novak Journalism Alumni Fellowship. He is also the co-author of How Trump Won: The Inside Story of a Revolution, which is available from Regnery. Follow him on Twitter at @joelpollak.",
      "date": "20 Mar 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Joe Biden: Donald Trump ‘Beneath’ John McCain, a ‘War Hero’",
      "url": "https://www.breitbart.com/politics/2019/05/30/joe-biden-donald-trump-beneath-john-mccain-war-hero/",
      "subtitle": "Former Vice President Joe Biden criticized President Donald Trump on Thursday in response to reports that someone in the White House tried to hide the USS John McCain during the president’s trip to the Pacific.",
      "author": "Charlie Spiering",
      "content": " “John McCain was a war hero, should be treated as a war hero. Anything less than that is beneath anyone who doesn’t treat him that way,” Biden said to reporters. NEW: BIDEN reacts to reports of USS McCain being covered while POTUS was in Japan: McCain was a war hero, Should be treated like a war hero, anything less than that is below anyone who doesn’t treat him that way @CBSNews pic.twitter.com/GRqFgdGXpa — Bo Erickson (@BoKnowsNews) May 30, 2019  Biden skipped public events on Memorial Day on Monday but attended a Memorial Day service on Thursday in Delaware. He responded to Trump, who described the White House request to hide the ship as “well-meaning,” but denied having any knowledge about the request. “I wasn’t a fan of John McCain. I never will be, but certainly, I couldn’t care less if there is a boat named after his father,” Trump said on Thursday. Biden defended McCain as a “friend” after attending a Memorial Day service in Delaware on Thursday. “We loved each other, but we argued like the devil,” he said. “But we still abided by the same values system, and that’s why I love John McCain, and that’s why I think we need a lot more John McCain.” Biden declined to weigh in on if Congress should impeach McCain, noting that he would not talk politics after a Memorial Day service.",
      "date": "30 May 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Sarah Palin, Loyal Running Mate, Excluded from John McCain’s Funeral",
      "url": "https://www.breitbart.com/politics/2018/08/29/sarah-palin-loyal-running-mate-excluded-from-john-mccains-funeral/",
      "subtitle": "Former Alaska Gov. Sarah Palin, who was Sen. John McCain’s (R-AZ) running mate in the 2008 presidential election, has been excluded from his funeral.",
      "author": "Joel B. Pollak",
      "content": " Breitbart News has independently confirmed an earlier report in People magazine, which reported that Palin was not sent an invitation and was told through intermediaries to stay away from the ceremony. McCain fundraiser Carla Eudy confirmed to People that Palin had not been invited — possibly, People speculated, at the behest of the McCain family. The news comes on the tenth anniversary of the date in 2008 when Palin was announced as McCain’s pick for vice president. Palin now joins President Donald Trump on the list of those barred from the funeral. But unlike Trump, Palin never feuded with McCain and never criticized him. When news broke on Saturday of McCain’s passing, Palin said, “Today we lost an American original. Sen. John McCain was a maverick and a fighter, never afraid to stand for his beliefs. John never took the easy path in life — and through sacrifice and suffering he inspired others to serve something greater than self. “John McCain was my friend. I will remember the good times. My family and I send prayers for Cindy and the McCain family.” Last year, when McCain was reported to have said that he regretted choosing Palin instead of Sen. Joe Lieberman (I-CT), Palin described the news as a “gut punch” but refused to blame McCain personally, telling the UK Daily Mail that she blamed his “ghostwriters” for such reports. When McCain selected Palin as his running mate, the two had both built reputations as corruption-busting “maverick” leaders who were not afraid to buck their own parties. After the 2008 election, they moved in separate political directions. Palin became an inspirational figure for the Tea Party and for grassroots conservatives in general. McCain campaigned as a conservative border hawk in his 2010 re-election race but became a harsh critic of the Tea Party, calling Sens. Ted Cruz (R-TX) and Rand Paul (R-KY) “wacko birds.” Many in the Beltway blamed Palin for McCain’s loss in 2008 — even though Barack Obama had benefited from a sudden financial crisis and a biased press corps. That view seemed to have seeped into McCain’s own thinking. Still, Palin never took offense and always honored McCain. Even after being excluded from the funeral, she declined to criticize him. People quoted a source close to the Palin family: “[O]ut of respect for Sen. McCain and his family we have nothing to add at this point. The Palin family will always cherish their friendship with the McCains and hold those memories dear.” McCain will be laid to rest on Sunday in Annapolis, following several days of memorial events and ceremonies. Joel B. Pollak is Senior Editor-at-Large at Breitbart News. He is a winner of the 2018 Robert Novak Journalism Alumni Fellowship. He is also the co-author of How Trump Won: The Inside Story of a Revolution, which is available from Regnery. Follow him on Twitter at @joelpollak.",
      "date": "29 Aug 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Here’s Why Donald Trump Still Does Not Like John McCain",
      "url": "https://www.breitbart.com/politics/2019/03/20/heres-why-donald-trump-still-does-not-like-john-mccain/",
      "subtitle": "President Donald Trump explained why he did not like the late Senator John McCain, listing reasons why on Wednesday after taking the stage at an Ohio battle tank factory.",
      "author": "Charlie Spiering",
      "content": " Trump asked the hundreds of gathered employees if he should talk about his ongoing feud with the deceased senator. After several of the employees shouted “Yes!” Trump continued, “I have to be honest. I never liked him much. Hasn’t been for me. I really probably never will.” Here is Trump’s list of grievances: 1) McCain helped distribute the phony Russia dossier to the FBI and the media Trump said: John McCain received the fake and phony dossier, it was paid for by Crooked Hillary Clinton. And John McCain got it. He got it And what did he do? He didn’t call me, he turned it over to the FBI hoping to put me in jeopardy and that’s not the nicest thing to do … because I’m a very loyal person. 2) McCain cratered attempt to repeal Obamacare by voting “No.” Trump said: John McCain campaigned for years to repeal Obamacare in Arizona … when he finally had the chance to do it, he voted against repeal and replace. He voted against at 2:00 in the morning, remember thumbs down? We said ‘What the hell happened?’ He said two hours before he was voting to heal and replace. Then he went thumbs down, badly hurting the Republican party badly hurting our nation and hurting many sick people who desperately wanted good, affordable health care. 3) McCain failed to help veterans Trump said: McCain didn’t get the job done for our great vets in the VA. And they knew it, that’s why when I had my dispute with him, I had such incredible support from the vets and from the military. The vets were on my side because I got the job done. I got choice and I got accountability. 4) McCain pushed for America to get into the Iraq War and the Middle East Trump said: The other thing is we’re in a war in the middle east that McCain pushed so hard. He was calling Bush, President Bush all the time. ‘Get into the Middle East. Get into the Middle East,’ So now we’re into that war for $7 trillion, thousands and thousands of our people have been killed, millions of people overall. And frankly, we’re straightening it out now, but it has been a disaster for our country. We’ve have spent tremendous wealth, and tremendous lives in that war. And what do we have? It is worse than 19 years ago. I called them ‘The Endless Wars’ … John McCain loved it. 5) McCain Betrayed Him Even Though Donald Trump Endorsed Him “I endorsed him at his request,” Trump recalled. 6) Trump Never got thanked by the McCain family for giving them the “funeral that he wanted.” Trump said: I gave him the kind of funeral that he wanted, which as president I had to approve. I don’t care about this. I didn’t get thank you. That’s okay. We sent him on the way, but I wasn’t a fan of John McCain. Trump tried to put the issue to rest, telling the group of workers that he was “saving time with the press” later as the issue continued to fascinate reporters in the establishment media. “So now what we can say, now we’re all set I don’t think I have to answer that question but the press keeps [asking], ‘What do you think of McCain, what do you think?'” Trump concluded. “Not my kind of guy, but some people like him and I think that’s great.”",
      "date": "20 Mar 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Fusion GPS Admits They Used John McCain to Pass Anti-Trump Dossier to Obama-Era Intel Agencies",
      "url": "https://www.breitbart.com/middle-east/2018/01/10/fusion-gps-admits-used-john-mccain-pass-anti-trump-dossier-obama-era-intel-agencies/",
      "subtitle": "EILAT, Israel — The founders of the controversial opposition research firm Fusion GPS admitted that they helped the researcher hired to compile the infamous, largely discredited 35-page dossier on President Donald Trump to share the document with Sen. John McCain.",
      "author": "Aaron Klein",
      "content": " The goal of providing the dossier to McCain, the Fusion GPS founders explained, was to pass the information contained in the questionable document to the U.S. intelligence community under the Obama administration. The disclosure raises questions about whether McCain knew that the information he delivered to the intelligence community was actually an opposition document reportedly funded by the Hillary Clinton campaign and the Democratic National Committee. McCain’s office did not reply yesterday to a Breitbart News request for comment on the matter. Last December, it was revealed that it was McCain who notoriously passed the controversial dossier documents produced by the Washington opposition research firm Fusion GPS to then FBI Director James Comey, whose agency reportedly utilized the dossier as a basis for its probe into alleged Russian interference in the 2016 presidential election. Writing in a New York Times oped last Tuesday, Fusion GPS founders Glenn R. Simpson and Peter Fritch relate that they helped McCain share their anti-Trump dossier with the intelligence community via an “emissary.” “After the election, Mr. Steele decided to share his intelligence with Senator John McCain via an emissary,” the Fusion GPS founders related. “We helped him do that. The goal was to alert the United States national security community to an attack on our country by a hostile foreign power.” It was not clear from their statement whether McCain knew Fusion GPS was behind the dossier. Fusion GPS paid former intelligence agent Christopher Steele to do the purported research for the document. Steele later conceded in court documents that part of his work still needed to be verified. Breitbart News sent the following questions to McCain’s office but did not receive a reply before press time: “Given that Fusion GPS is openly an opposition research firm, did Sen. McCain know that he was sharing political opposition research on Trump with the intel community? Did he know the dossier was partially funded by the DNC and Hillary Clinton’s campaign?” In October, the Washington Post reported that in April 2016, attorney Marc E. Elias and his law firm, Perkins Coie retained Fusion GPS to conduct the questionable anti-Trump work on behalf of both the Clinton campaign and the DNC. Through Perkins Coie, Clinton’s campaign and the DNC continued to fund Fusion GPS until October 2016, days before Election Day, the Post reported. On January 10, CNN was first to report, based on leaked information, that the contents of the dossier were presented during classified briefings one week earlier to then-president Obama and president-elect Trump. Just after CNN’s January 10 report on the classified briefings about the dossier, BuzzFeed published its full unverified contents. In October, McCain denied providing the dossier to BuzzFeed and said that he only gave the material to the FBI. “I gave it to no one except for the director of the FBI. I don’t know why you’re digging this up now,” McCain told the Daily Caller during what the news website described as a testy exchange. While the Fusion GPS oped sheds some light on the manner in which McCain obtained the dossier, the Fusion founders did not name the “emissary” who delivered the document to McCain. A January 11 statement from McCain attempted to explain why he provided the documents to the FBI but did not mention how he came to possess the dossier or whether he knew who funded it. “Upon examination of the contents, and unable to make a judgment about their accuracy, I delivered the information to the director of the FBI,” McCain said at the time. “That has been the extent of my contact with the FBI or any other government agency regarding this issue.” Sir Andrew Wood, a former British ambassador to Moscow, said McCain first consulted him about the claims inside the dossier at a security conference in Canada shortly after last November’s presidential election. Wood stated that McCain had obtained the documents from the senator’s own sources. “I told him I was aware of what was in the report but I had not read it myself, that it might be true, it might be untrue. I had no means of judging really,” Wood further told BBC Radio 4 in January. Last Month, Wood related that he served as a “go-between” to inform McCain about the dossier contents. “My mission was essentially to be a go-between and a messenger, to tell the senator and assistants that such a dossier existed,” Wood told Fox News. In March, Vanity Fair raised questions about the alleged involvement of David J. Kramer, a former State Department official, in helping to obtain the dossier directly from Steele. The issue was also raised in a lawsuit filed against Steele by one of the individuals named in the dossier. The dossier contains wild and unproven claims that the Russians had information regarding Trump and sordid sexual acts, including the widely mocked claim that Trump hired prostitutes and had them urinate on a hotel room bed.  It also claimed there was an exchange of information between Trump surrogates and intermediaries for the Russian government. Those allegations remain unsubstantiated following numerous public hearings. Indeed, former CIA Director John Brennan made clear in testimony last May that after viewing all of the evidence that was available to him on the Russia probe he is not aware of any collusion between Russia and members of Trump’s 2016 presidential campaign. Dossier was reportedly basis for Obama administration moves According to the BBC, the dossier served as a “roadmap” for the FBI’s investigation into claims of coordination between Moscow and members of Trump’s presidential campaign during the Obama administration. In April, CNN reported that the dossier served as part of the FBI’s justification for seeking the FISA court’s reported approval to clandestinely monitor the communications of Carter Page, the American oil industry investor who was tangentially and briefly associated with Trump’s presidential campaign. Senior Republican members of the Senate Judiciary Committee have reportedly requested that the FBI and Department of Justice turn over applications for any warrants to monitor the communications of U.S. citizens associated with the investigation into alleged Russia interference in the 2016 presidential election. In testimony last May, former FBI Director James Comey repeatedly refused to answer questions about his agency’s ties to the dossier. In further testimony to the U.S. Senate Select Committee on Intelligence, Comey admitted he pushed back against a request from President Donald Trump to possibly investigate the origins of “salacious material” that the agency possessed in the course of its investigation into alleged Russian interference. Dossier discredited Major questions have been raised as to the veracity of the dossier, large sections of which have been discredited. Citing a “Kremlin insider,” the dossier, which misspelled the name of a Russian diplomat, claimed that Trump lawyer Michael Cohen held “secret meetings” with Kremlin officials in Prague in August 2016. That charge unraveled after Cohen revealed he had never traveled to Prague, calling the story “totally fake, totally inaccurate.” The Atlantic confirmed Cohen’s whereabouts in New York and California during the period the dossier claimed that Cohen was in Prague. Cohen reportedly produced his passport showing he had not traveled to Prague. In testimony in May, the FBI’s Comey confirmed that the basis for the intelligence community’s assessment that Russia allegedly wanted Trump in office was not because the billionaire was, as Sen. Al Franken (D-MN) claimed during a hearing, “ensnared in” Russia’s “web of patronage” – just as the dossier alleged. Instead, the FBI chief provided two primary reasons for Russia’s alleged favoring of Trump over Clinton during the 2016 presidential race. One reason, according to Comey, was that Putin “hated” Clinton and would have favored any Republican opponent. The second reason, Comey explained, was that Putin made an assessment that it would be easier to make a deal with a businessman than someone from the political class. Comey’s statements are a far cry from the conspiracies fueled by the dossier alleging Putin held blackmail information on Trump. Citing current and former government officials, the New Yorker reported the dossier prompted skepticism among intelligence community members, with the publication quoting one member saying it was a “nutty” piece of evidence to submit to a U.S. president. Steele’s work has been questioned by former acting CIA Director Michael Morell, who currently works at the Hillary Clinton-tied Beacon Global Strategies LLC. NBC News reported on Morell’s questions about Steele’s credibility: Morell, who was in line to become CIA director if Clinton won, said he had seen no evidence that Trump associates cooperated with Russians. He also raised questions about the dossier written by a former British intelligence officer, which alleged a conspiracy between the Trump campaign and Russia. … Morell pointed out that former Director of National Intelligence James Clapper said on Meet the Press on March 5 that he had seen no evidence of a conspiracy when he left office January 20. “That’s a pretty strong statement by General Clapper,” Morell said. Regarding Steele’s dossier, Morell stated, “Unless you know the sources, and unless you know how a particular source acquired a particular piece of information, you can’t judge the information — you just can’t.” Morell charged the dossier “doesn’t take you anywhere, I don’t think.” “I had two questions when I first read it. One was, how did Chris talk to these sources? I have subsequently learned that he used intermediaries.” Morell continued: And then I asked myself, why did these guys provide this information, what was their motivation? And I subsequently learned that he paid them. That the intermediaries paid the sources and the intermediaries got the money from Chris. And that kind of worries me a little bit because if you’re paying somebody, particularly former FSB [Russian intelligence] officers, they are going to tell you truth and innuendo and rumor, and they’re going to call you up and say, “Hey, let’s have another meeting, I have more information for you,” because they want to get paid some more. I think you’ve got to take all that into consideration when you consider the dossier. Aaron Klein is Breitbart’s Jerusalem bureau chief and senior investigative reporter. He is a New York Times bestselling author and hosts the popular weekend talk radio program, “Aaron Klein Investigative Radio.” Follow him on Twitter @AaronKleinShow. Follow him on Facebook. Written with additional research by Joshua Klein.",
      "date": "10 Jan 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Cindy McCain: Trump’s GOP ‘Not the Party My Husband and I Belonged To’",
      "url": "https://www.breitbart.com/politics/2019/09/27/cindy-mccain-trumps-gop-not-the-party-my-husband-and-i-belonged-to/",
      "subtitle": "The widow of former Sen. John McCain, Cindy McCain, says President Trump’s nationalist-populist Republican Party is “not the party” she and her husband “belonged to.”",
      "author": "John Binder",
      "content": " During an interview with Politico‘s Women Rule podcast, McCain said the party of Trump — centered around a pro-U.S. worker agenda — is not what she and her late husband were a part of. “We have, on my side of the aisle, on the Republican side, we see a local party in Arizona that’s not functioning well,” McCain said. “And it’s excluding people. And it’s excluding people for the wrong reasons.” “If you’re not walking the line, then you’re out,” she continued. “That’s just not right. That’s not the party that my husband and I belonged to.” McCain also seemed to take subtle jabs at Trump’s way of communicating with his supporters, bypassing the establishment media and pundit class. “I think we’ve seen the end of men like my husband. At least for right now,” McCain said. “The inability to even discuss issues — differing issues — it’s degenerated into name-calling and Twitter responses, and all of these things that not only do they not help the argument, but they don’t help foster good relationships with people,” McCain said. While McCain’s husband lost the 2008 presidential election running on the decades-long Republican establishment platform of neoconservative foreign interventionism, extending the Bush-era tax cuts, and amnesty for illegal aliens, Trump swept to victory in 2016 with his “America First” agenda of a travel ban from terrorist-sponsored countries, a promise to bring U.S. troops home, and a commitment to pulling out of multilateral free trade deals and global agreements like TPP and the Paris Climate Accord. Trump’s economic nationalist platform won him majorities in Wisconsin, Michigan, and Pennsylvania — states not won by Republicans in years. In a March 2019 poll by Harvard/Harris, about three-in-four U.S. voters said they support a nationalist-populist approach to trade, immigration, and foreign policy — that is, tariffs on foreign imports to protect American industries, less immigration, and less foreign intervention overseas. Last year, former presidential candidate and columnist Pat Buchanan said McCain’s preferred part of former President George W. Bush’s party had “become a Trump party” on all the defining issues of the time. “The Bush party has become a Trump party,” Buchanan said. “… On the new issues, the populist conservative issues—control of the border, immigration, economic nationalism versus free trade, staying out of foreign wars that get us entangled and bleeding and accomplish nothing, ‘America First’—[the GOP] has become the Trump party now.” John Binder is a reporter for Breitbart News. Follow him on Twitter at @JxhnBinder.",
      "date": "27 Sep 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "John McCain Associate Provided Dossier to Obama National Security Council",
      "url": "https://www.breitbart.com/politics/2019/03/20/john-mccain-associate-provided-dossier-to-obama-national-security-council/",
      "subtitle": "TEL AVIV — David Kramer, a long-time advisor to late Senator John McCain, revealed that he met with two Obama administration officials to inquire about whether the anti-Trump dossier authored by former British spy Christopher Steele was being taken seriously.",
      "author": "Aaron Klein",
      "content": " In one case, Kramer said that he personally provided a copy of the dossier to Obama National Security Council official Celeste Wallander. In a deposition on Dec. 13, 2017 that was recently posted online, Kramer said that McCain specifically asked him in early December 2016 to meet about the dossier with Wallander and Victoria Nuland, a senior official in John Kerry’s State Department. “Senator McCain asked me to meet with both of them to see if this was being taken seriously in the government,” Kramer said. “And Senator McCain asked you to meet with them?” Kramer was asked to clarify. “Yes, just to see if this was being taken seriously. I think he wanted to do — this was his kind of due diligence before he went to Director Comey.” Kramer testified that in his conversations with Nuland and Wallander he was told by both of them that each were aware of the dossier and that Nuland “thought Steele was a serious person.” Kramer revealed that he gave a copy of the dossier to Wallander, who was familiar with the contents but did not have a copy. “I had a subsequent conversation with Ms. Wallander in which I gave her a copy of the document. That was probably around New Year’s,” he said. “She had not seen it herself until I had shown it to her,” Kramer added. “She had heard about it. And she didn’t know the status of it.” In the same testimony, the McCain associate revealed that he held a meeting about the dossier with a reporter from BuzzFeed News who he says snapped photos of the controversial document without Kramer’s permission when he left the room to go to the bathroom. That meeting was held at the McCain Institute office in Washington, Kramer stated. BuzzFeed infamously published Steele’s full dossier on January 10, 2017 setting off a firestorm of news media coverage about the document. Prior to his death, McCain admitted to personally handing the dossier to then-FBI Director James Comey but he refused repeated requests for comment about whether he had a role in providing the dossier to BuzzFeed, including numerous inquiries sent to his office by this reporter. In his book published last year, McCain maintained he had an “obligation” to pass the dossier charges against Trump to Comey and he would even do it again. “Anyone who doesn’t like it can go to hell,” McCain exclaimed. Kramer, meanwhile, also said that he briefed others reporters on the dossier contents, including CNN’s Carl Bernstein, in an effort to have the anti-Trump charges verified. The same day BuzzFeed released the full dossier, CNN  first reported the leaked information that the controversial contents of the dossier were presented during classified briefings inside classified documents presented one week earlier to then-President Obama and President-elect Trump. Kramer said that he believed McCain was sought out in order to provide credibility to the dossier claims. “I think they felt a senior Republican was better to be the recipient of this rather than a Democrat because if it were a Democrat, I think that the view was that it would have been dismissed as a political attack,” Kramer stated. The controversial Fusion GPS firm hired Steele to do the anti-Trump work that resulted in the compilation of the dossier.  Fusion GPS was paid for its anti-Trump work by Hillary Clinton’s 2016 campaign and the Democratic National Committee via the Perkins Coie law firm. Kramer’s testimony sheds a new light on the role of the Obama administration in disseminating the largely-discredited dossier that was reportedly involved in the FBI’s initial investigation into the Trump campaign and unsubstantiated claims of Russian collusion. Also Comey cited the dossier as evidence in a successful FISA application to obtain a warrant to conduct surveillance on Carter Page, a former adviser to President Trump’s 2016 campaign. The testimony also revealed how McCain was utilized to give the wild dossier charges a credibility boost. Nuland and dossier Nuland’s specific role in the dossier episode has been the subject of some controversy for her. In their book, “Russian Roulette: The Inside Story of Putin’s War on America and the Election of Donald Trump,” authors and reporters by Michael Isikoff and David Corn write that Nuland gave the green light for the FBI to first meet with Steele regarding his dossier’s claims. It was at that meeting that Steele initially reported his dossier charges to the FBI, the book relates. Steele sought out Rome-based FBI Special Agent Michael Gaeta, with whom he had worked on a previous case. Before Gaeta met with Steele on July 5, 2016, the book relates that the FBI first secured the support of Nuland, who at the time was assistant Secretary of State for European and Eurasian Affairs specializing in Russia. Regarding the arrangements for Steele’s initial meeting with the FBI about the dossier claims, Isikoff and Corn report: There were a few hoops Gaeta had to jump through. He was assigned to the U.S. embassy in Rome. The FBI checked with Victoria Nuland’s office at the State Department : Do you support this meeting ? Nuland, having found Steele’s reports on Ukraine to have been generally credible, gave the green light. Within a few days, on July 5, Gaeta arrived and headed to Steele’s office near Victoria station . Steele handed him a copy of the report. Gaeta, a seasoned FBI agent, started to read . He turned white. For a while, Gaeta said nothing . Then he remarked, “I have to report this to headquarters.” The book documents that Nuland previously received Steele’s reports on the Ukrainian crisis and had been familiar with Steele’s general work. Nuland faced confirmation questions prior to her appointment as assistant secretary of state over her reported role in revising controversial Obama administration talking points about the 2012 Benghazi terrorist attacks. Her reported changes sought to protect Clinton’s State Department from accusations that it failed to adequately secure the woefully unprotected U.S. Special Mission in Benghazi. Nuland’s name surfaced in a flurry of news media reports last year about the dossier and Kerry’s State Department. Sidney Blumenthal An extensive New Yorker profile of Steele named another former official from Kerry’s State Department for alleged involvement in circulating the dossier. The magazine reported that Kerry’s chief of staff at the State Department, John Finer, obtained the contents of a two-page summary of the dossier and eventually decided to share the questionable document with Kerry. Finer received the dossier summary from Jonathan M. Winer, the Obama State Department official who acknowledged regularly interfacing and exchanging information with Steele, according to the report. Winer previously conceded that he shared the dossier summary with Nuland. After his name surfaced in news media reports related to probes by House Republicans into the dossier, Winer authored a Washington Post oped in which he conceded that while he was working at the State Department he exchanged documents and information with Steele. Winer further acknowledged that while at the State Department, he shared anti-Trump material with Steele passed to him by longtime Clinton confidant Sidney Blumenthal, whom Winer described as an “old friend.” Winer wrote that the material from Blumenthal – which Winer in turn gave to Steele – originated with Cody Shearer, who is a controversial figure long tied to various Clinton scandals. Nuland, Winer Give Conflicting Accounts There are seeming discrepancies between Winer and Nuland about actions taken involving the dossier. Nuland described in a Politico podcast interview what she claimed was her reaction when she was presented with Steele’s dossier information at the State Department. She said that she offered advice to “those who were interfacing with” Steele, immediately telling the intermediary or intermediaries that Steele “should get this information to the FBI.” She further explained that a career employee at the State Department could not get involved with the dossier charges since such actions could violate the Hatch Act, which prevents employees in the executive branch of the federal government from engaging in certain kinds of political activities. In a second interview, this one with CBS’s Face The Nation, Nuland also stated that her “immediate” reaction was to refer Steele to the FBI. Here is a transcript of the relevant section of her February 5 interview with Susan B. Glasser, who described Nuland as “my friend” and referred to her by her nickname “Toria”: Glasser: When did you first hear about his dossier? Nuland: I first heard — and I didn’t know who his client was until much later, until 2017, I think, when it came out. I first heard that he had done work for a client asserting these linkages — I think it was late July, something like that. Glasser: That’s very interesting. And you would have taken him seriously just because you knew that he knew what he was talking about on Russia? Nuland: What I did was say that this is about U.S. politics, and not the work of — not the business of the State Department, and certainly not the business of a career employee who is subject to the Hatch Act, which requires that you stay out of politics. So, my advice to those who were interfacing with him was that he should get this information to the FBI, and that they could evaluate whether they thought it was credible. Glasser: Did you ever talk about it with anyone else higher up at the department? With Secretary Kerry or anybody else? Nuland: Secretary Kerry was also aware. I think he’s on the record and he had the same advice. Nuland stated that Kerry “was also aware” of the dossier, but she did not describe how he was made aware. She made clear that she told “those who were interfacing” with Steele to go to the FBI since any State Department involvement could violate the Hatch Act. Her Politico podcast interview was not the only time she claimed that her reaction was to refer Steele to the FBI. On Face The Nation on February 4, Nuland engaged in the following exchange in which she stated her “immediate” reaction was to refer Steele to the FBI (emphasis added): MARGARET BRENNAN: The dossier. VICTORIA NULAND: The dossier, he passed two to four pages of short points of what he was finding, and our immediate reaction to that was, “This is not in our purview. This needs to go to the FBI, if there is any concern here that one candidate or the election as a whole might be influenced by the Russian federation. That’s something for the FBI to investigate.” And that was our reaction when we saw this. It’s not our — we can’t evaluate this. And frankly, if every member of the campaign who the Russians tried to approach and tried to influence had gone to the FBI as well in real time, we might not be in the mess we’re in today. Nuland gave the two interviews after her name started surfacing in news media reports involving Kerry’s State Department and the dossier. Her name also came up in relation to a criminal referral of Steele to the Justice Department in the form of a  letter authored last year by Sen. Chuck Grassley, who at the time chaired the Senate Judiciary Committee, and Lindsey Graham (R-SC). The Grassley-Graham criminal referral contains redacted information that Steele received information from someone in the State Department, who in turn had been in contact with a “foreign sub-source” who was in touch with a redacted name described as a “friend of the Clintons.” Numerous media reports have since stated that the source of information provided to the State Department that was in turn passed on to Steele was Cody Shearer, a controversial figure tied to the Clintons who is also an associate of longtime Clinton friend Sidney Blumenthal. According to sources who spoke to CNN, Shearer’s information was passed from Blumenthal to Winer, who at the time was a special State Department envoy for Libya working under Kerry. Winer says that Kerry personally recruited him to work at the State Department. It is Winer’s version of events that seems to conflict with Nuland’s. In an oped published in the Washington Post, Winer identified Nuland as the State Department official with whom he shared Steele’s information. Winer writes that Nuland’s reaction was that “she felt that the secretary of state needed to be made aware of this material.” He does not relate any further reaction from Nuland. Winer wrote in the Washington Post (emphasis added): In the summer of 2016, Steele told me that he had learned of disturbing information regarding possible ties between Donald Trump, his campaign and senior Russian officials. He did not provide details but made clear the information involved “active measures,” a Soviet intelligence term for propaganda and related activities to influence events in other countries. In September 2016, Steele and I met in Washington and discussed the information now known as the “dossier.” Steele’s sources suggested that the Kremlin not only had been behind the hacking of the Democratic National Committee and the Hillary Clinton campaign but also had compromised Trump and developed ties with his associates and campaign. I was allowed to review, but not to keep, a copy of these reports to enable me to alert the State Department. I prepared a two-page summary and shared it with Nuland, who indicated that, like me, she felt that the secretary of state needed to be made aware of this material. That was the extent of Winer’s description of Nuland’s reaction upon being presented with Steele’s dossier claims. Nuland’s public claim that her “immediate” response was to refer Steele to the FBI since State involvement could violate the Hatch Act seems to conflict with the only reaction that Winer relates from Nuland – that she felt Kerry should be made aware of the dossier information. In Winer’s Washington Post oped, he writes that Steele had a larger relationship with the State Department, passing over 100 reports relating to Russia to the U.S. government agency through Winer. Winer wrote that Nuland found Steele’s reports to be “useful” and asked Winer to “continue to send them.” He wrote: In 2013, I returned to the State Department at the request of Secretary of State John F. Kerry, whom I had previously served as Senate counsel. Over the years, Steele and I had discussed many matters relating to Russia. He asked me whether the State Department would like copies of new information as he developed it. I contacted Victoria Nuland, a career diplomat who was then assistant secretary of state for European and Eurasian affairs, and shared with her several of Steele’s reports. She told me they were useful and asked me to continue to send them. Over the next two years, I shared more than 100 of Steele’s reports with the Russia experts at the State Department, who continued to find them useful. None of the reports related to U.S. politics or domestic U.S. matters, and the reports constituted a very small portion of the data set reviewed by State Department experts trying to make sense of events in Russia. Kramer and the dossier In his book, “The Restless Wave,” McCain provided an inside account of how he says he came across the dossier. He wrote that he was told about the claims in the document at a security conference in Canada in November 2016, where he was approached by Sir Andrew Wood, a former British ambassador to Moscow and friend of ex-British spy Christopher Steele, the author of the dossier. McCain wrote that Wood told him Steele “had been commissioned to investigate connections between the Trump campaign and Russian agents as well as potentially compromising information about the President-elect that Putin allegedly possessed.” McCain, however, did not address the obvious question of whether he was told exactly who “commissioned” Steele to “investigate” the alleged Russian ties.  The dossier was paid for by Clinton’s campaign and the DNC. McCain goes on to describe Wood as telling him Steele’s work “was mostly raw, unverified intelligence, but that the author strongly believed merited a thorough examination by counterintelligence experts.” The politician says the dossier claims described to him were “too strange a scenario to believe, something out of a le Carré novel, not the kind of thing anyone has ever actually had to worry about with a new President, no matter what other concerns.” Still, McCain says he reasoned that “even a remote risk that the President of the United States might be vulnerable to Russian extortion had to be investigated.” McCain concedes Wood told him he had not actually read the dossier himself, and writes that he wasn’t sure if he ever met Wood before and couldn’t recall previously having a conversation with Wood. Still, McCain took Wood’s word for it when Wood vouched for Steele’s credibility. “Steele was a respected professional, Wood assured us, who had good Russian contacts and long experience collecting and analyzing intelligence on the Kremlin,” McCain wrote. Present at the meeting with Wood and McCain was Kramer, who McCain writes agreed to “go to London to meet Steele, confirm his credibility and report back to me.” McCain doesn’t detail Kramer’s visit to London beyond simply writing, “When David returned, and shared his impression that the former spy was, as Sir Andrew had vouched, a respected professional, and not to outward appearances given to hyperbole or hysteria, I agreed to receive a copy of what is now referred to as ‘the dossier.’’’ McCain leaves out exactly where Kramer obtained his dossier copy. The Washington Post reported last February that Kramer received the dossier directly from Fusion GPS after McCain expressed interest in it. Those details marked the clearest indication that McCain may have known that the dossier originated with Fusion GPS, meaning that he may have knowingly passed on political material to the FBI. Also, in a New York Times oped in January, GPS co-founders Glenn Simpson and Peter Fritch wrote that they helped McCain share their anti-Trump dossier with the Obama-era intelligence community via an unnamed “emissary.” In his own testimony, Kramer relates conversations with Simpson about the dossier. Aaron Klein is Breitbart’s Jerusalem bureau chief and senior investigative reporter. He is a New York Times bestselling author and hosts the popular weekend talk radio program, “Aaron Klein Investigative Radio.” Follow him on Twitter @AaronKleinShow. Follow him on Facebook. Joshua Klein contributed research to this article.",
      "date": "20 Mar 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Democrats Gush Over John McCain at Debate when Asked to Name ‘Surprise’ Friend",
      "url": "https://www.breitbart.com/2020-election/2019/10/15/democrats-gush-over-john-mccain-at-debate-when-asked-to-name-surprise-friend/",
      "subtitle": "Democrats cited Sen. John McCain as one of their “unlikely” friends when asked to name someone by CNN during the 2020 presidential debate on Tuesday.",
      "author": "Charlie Spiering",
      "content": " “For me, it’s John McCain, and I miss him every day,” Sen. Amy Klobuchar said. “I traveled all over the world with him.” Klobuchar recalled McCain standing up for her chance to speak when they were in groups of world leaders. Bernie Sanders also cited McCain, recalling his time working with the Republican senator on Veterans Affairs. “I worked with John McCain, and I certainly did not get in that legislation, working with John McCain all that I wanted, but it turned out we were able to pass a very, very significant piece of legislation,” Sanders said. Former Vice President Joe Biden said that McCain was a dear friend. “John McCain worked for me,” Biden said, noting that he was a close friend who frequently visited him and his family at his home. “On his death bed, he asked me to give his eulogy,” Biden continued. “He was a great man of principle, he was honorable.”",
      "date": "15 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "John McCain",
      "url": "https://www.breitbart.com/tag/john-mccain/",
      "subtitle": "null",
      "author": "Charlie Spiering",
      "content": "                             ",
      "date": "15 Oct 2019, 8:35 PM PDT",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "McCain Concedes Immigration Reform Bill Won't Gain GOP 'A Single Hispanic Voter'",
      "url": "http://www.breitbart.com/Big-Government/2013/07/31/McCain-Concedes-Immigration-Reform-Bill-Won-t-Gain-GOP-a-Single-Hispanic-Voter",
      "subtitle": "Sen. John McCain (R-AZ) conceded on Monday that Republicans will not win one new Hispanic voter over by passing a comprehensive immigration reform bill.",
      "author": "Tony Lee",
      "content": "  “Let’s say we enact it, comprehensive immigration reform, I don’t think it gains a single Hispanic voter,” McCain said in an interview with PBS’s Gwen Ifill. “But what it does, it puts us on a playing field where we can compete for the Hispanic voter.” McCain has made comments indicating comprehensive immigration reform will not win over Hispanics, but he has also suggested that comprehensive immigration reform is a type of “gateway issue” that Republicans need to pass for Hispanics to consider voting for Republicans. McCain continued, “If we don’t do that, frankly… I see further polarization of the Hispanic voter and the demographics are clear that the Republican Party cannot win a national election. That’s just a fact.” ",
      "date": "31 Jul 2013",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "POLITICO",
      "url": "https://www.breitbart.com/politics/2017/10/23/politico-bannon-calls-bush-mccain-speeches-pablum/",
      "subtitle": "null",
      "author": "",
      "content": "",
      "date": "10/23/2017 06:00 PM EDT",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "HBO Receives Special Access as John McCain Documentary Production Begins",
      "url": "https://www.breitbart.com/entertainment/2018/04/17/hbo-gets-special-access-john-mccain-documentary/",
      "subtitle": "Senator John McCain agreed after being diagnosed with brain cancer, to give HBO special access for a documentary on his life. Work has now begun on the television film, HBO announced on Monday.",
      "author": "Michelle Moons",
      "content": "  Six-time Emmy award-winner Peter Kunhardt is set to produce and direct the documentary and is working with his Emmy-winning sons George and Teddy Kunhardt, according to Deadline.com. The film, as of press time, is untitled and no premiere date has been set. Filmmakers are being given an exclusive look into McCain’s life both in Washington, D.C. and back home in Sedona, Arizona. The report listed family, friends, and political figures as those who will appear in interviews for the film. McCain was diagnosed with a brain tumor, a glioblastoma last year. News broke of the tumor and its removal last July. HBO revealed that McCain agreed to the documentary shortly after the diagnosis. He has been resting at his home in Arizona for months while still holding his Senate seat and directing other Senators back in Washington. On Tuesday, McCain’s office revealed that he underwent surgery for an intestinal infection at the Mayo Clinic in Phoenix, Arizona. Filmmaker Peter Kunhardt described McCain as an “American hero” and an example of “what government can and should look like.” McCain has spent over three decades in Washington, D.C. between the U.S. Senate and House of Representatives and was the GOP Presidential nominee in 2008 alongside running mate and Alaska Governor Sarah Palin. His personal account of his time as a prisoner of war in North Vietnam was printed in U.S. News and World Report in May 1973. The longtime elected Republican official from Arizona has faced criticism over his record in office. He has maintained close relationships with officials on the other side of the aisle and repeatedly involved himself in foreign affairs. One of his most recent votes created upheaval when he walked down the Senate floor and gestured a disapproving thumbs-down vote against a “skinny” version of Obama-care repeal and huddled up with Democrats on the Senate floor. McCain’s was the deciding vote to kill the bill. The upcoming film will also feature home movies and photographs that have never been seen publicly before. Based on comments from the filmmakers, the documentary is likely to provide a favorable view of the controversial figure. Follow Michelle Moons on Twitter @MichelleDiana",
      "date": "17 Apr 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    }
  ]
}