{
  "articles": [
    {
      "title": "China Says It Won’t Investigate Joe Biden: ‘No Intention of Intervening’ in U.S. Affairs",
      "url": "https://www.breitbart.com/politics/2019/10/08/china-says-it-wont-investigate-joe-biden-no-intention-of-intervening-in-u-s-affairs/",
      "subtitle": "China announced Tuesday that it will not investigate accusations of corruption against former Vice President Joe Biden and his son, Hunter Biden, after President Donald Trump suggested the communist government should look into the pair’s questionable dealings in the country.",
      "author": "Joshua Caplan",
      "content": " “China has long pursued the principle of non-interference in the internal affairs of other countries,” foreign ministry spokesperson Geng Shuang said in a statement, according to the South China Morning Post. “We have no intention of intervening in the domestic affairs of the United States. Our position is consistent and clear.” Speaking to reporters outside the White House last week, President Trump floated the idea that China and Ukraine should probe the Biden family. “China should start an investigation into the Bidens, because what happened in China is just about as bad as Ukraine,” the president said ahead of a visit to Florida to deliver remarks on Medicare. As Breitbart News reported, Hunter Biden’s investment company secured a $1.5 billion investment deal with the Bank of China after traveling with his father on Air Force Two to the country in 2013. Asked if Ukraine should follow suit with its own inquiry into the Bidens, President Trump replied: “I would think that if they were honest about it, they would start a major investigation,” before adding: “Nobody has any doubt that they weren’t crooked; that was a crooked deal, 100 percent.” As Breitbart News reported earlier this year: Biden forced out former Ukrainian prosecutor Viktor Shokin as he was investigating an energy company called Burisma Holdings, which was paying Biden [$83,000 monthly] as a member of its board. The former vice president even boasted to the Council of Foreign Relations last year that he had threatened to withhold $1 billion in U.S. aid unless the prosecutor was fired. (He did not tell the audience about his son’s role.) While Democrats and establishment media figures were enraged by President Trump’s suggestion for China and Ukraine to probe the Biden, leading Republicans, including Vice President Mike Pence, voiced support for the move. “In 2016, the American people elected President Trump and I for many reasons: get the economy moving again, to rebuild our military, but they also elected us to drain the swamp,” Pence told the Arizona Republic.“I think the American people have a right to know if someone who held the second-highest office in the land was involved in corrupt activities, either in China or in Ukraine.”",
      "date": "8 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Delaware 2017: Joe Biden Recounts Nearly Wrapping a Chain Around a Gang Leader Named Corn Pop’s Head",
      "url": "https://www.breitbart.com/politics/2019/09/15/delaware-2017-joe-biden-recounts-wrapping-chain-gang-leader-corn-pop/",
      "subtitle": "Joe Biden told a harrowing story during an event in 2017 about facing down a razor-wielding gang leader named Corn Pop in his youth by threatening to “wrap” a chain around the man’s head. The incident came back into the spotlight over the weekend when footage of Biden’s remarks began circulating social media.",
      "author": "Haris Alic",
      "content": " The former vice president, who has come under scrutiny in recent weeks for embellishing portions of his personal and political life, told the story when being honored with having a community pool named after him in a Wilmington, Delaware, historically black neighborhood. Biden had reportedly been the only white lifeguard at the pool during the early 1960s when segregation was still in effect. The event started with Biden discussing how his time as a lifeguard had opened his eyes about racial injustice and privilege. It, however, quickly took a strange turn when Biden, flanked by children from the local community, decided to recount a nearly violent altercation he had at the pool with a misbehaving swimmer. “Corn Pop was a bad dude, and he ran a bunch of bad boys. Back in those days, to show how things have changed … if you used pomade in your hair, you had to wear a bathing cap,” Biden said. “He was up on the board and wouldn’t listen to me, so I said ‘Hey, Esther, you, off the board or I’ll come up and drag you off.'” Corn Pop, according to the former vice president, did not take kindly to being called “Esther” — an “emasculating” reference to the 1950s swimmer Esther Williams, as the Washington Post noted — and promised to “meet” him outside. Biden realized he had to take Corn Pop seriously when he purportedly saw the gang leader waiting around for him with three other guys carrying straight razors.  In his 2007 autobiography, Promises to Keep: On Life and Politics, Biden admitted that he specifically signaled out Corn Pop for violating the pool’s rules to show he “wasn’t an easy mark.” The former vice president also wrote that his first instinct was to call the police, but he was convinced by the pool’s mechanic, a white former Navy sailor named Bill Wright, that doing so would ensure he would never be trusted by the neighborhood’s black community. Instead, Wright suggested Biden confront Corn Pop and the others with “a six-foot length of chain.” Biden, as he described in his autobiography, took the advice, walked outside, and said, “You might cut me, Corn Pop, but I’m going to wrap this chain around your head before you do.” “I looked at him, but I was smart then,” Biden told the audience in 2017. He said he told Corn Pop, “first of all, when I tell you to get off the board, you get off the board, and I’ll kick you out again, but I shouldn’t have called you Esther Williams. I apologize for that. … I apologize for what I said.” The apology seemed to diffuse the situation, much to Biden’s relief. “He said ‘okay,’ closed his straight razor, and my heart began to beat again,” the former vice president said. The story came back into the spotlight on Saturday after numerous individuals shared clips from the 2017 pool dedication on social media. Many of those seeing the clip for the first time immediately accused the former vice president of fabricating the story. Most notably, Michael Harriot, a senior writer for The Root, took to social media to blast the story as “alien-like.”     Although Biden’s retelling of the altercation was corroborated at the dedication ceremony by a former chairman of the Delaware NAACP, those unaware of the fact agreed with Harriot that the story seemed comically embellished if not totally concocted. Biden, himself, has not done his credibility any favors in recent weeks by downplaying his fabrication of an emotional story about the war in Afghanistan, even after the Post debunked nearly every detail.",
      "date": "15 Sep 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Gaffe: Joe Biden Gestures at Bernie Sanders When Referring to Vladimir Putin",
      "url": "https://www.breitbart.com/politics/2019/10/15/gaffe-joe-biden-gestures-bernie-sanders-when-referring-vladimir-putin/",
      "subtitle": "Former Vice President Joe Biden on Tuesday mistakenly gestured at Sen. Bernie Sanders when referring to Vladimir Putin, sparking laughter from the audience.",
      "author": "Charlie Spiering",
      "content": " “The fact of the matter is, you have Russia influencing and trying to break up NATO, what does the president do, he says ‘I believe Vladimir Putin,'” Biden said, gesturing to Bernie Sanders. “Excuse me,” Bernie Sanders asked as the audience laughed, “Vladimir Putin, here?” “No, no, no,” Biden stammered, giving Sanders a side-hug to express his affection for the veteran senator from Vermont.",
      "date": "15 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Joe Biden Accuses Trump of Taking Orders from China, then Fundraises in Hollywood",
      "url": "https://www.breitbart.com/entertainment/2019/10/10/joe-biden-accuses-trump-of-taking-orders-from-china-then-fundraises-in-hollywood/",
      "subtitle": "Hollywood elites are opening up their wallets for Democratic presidential candidates, including Joe Biden, ahead of a televised CNN town hall in Los Angeles focusing on LGBTQ issues.",
      "author": "David Ng",
      "content": " Deadline reported that former Vice President Biden will attend two Hollywood fundraisers on Thursday — one in the afternoon hosted by former HBO executive Michael Lombardo, and one in the evening at the home of Paramount Pictures chairman and CEO Jim Gianopulos. CNN’s town hall, titled Equality in America, is set to air Thursday evening, from 7:30 p.m. to 12 a.m. ET, and will feature nine Democratic presidential candidates. The event is co-organized by the Human Rights Campaign Foundation, a non-profit focused on LGBTQ issues. The town hall comes amidst increased U.S.-China tensions — a subject that hits close to home in the entertainment industry,  which depends heavily on Chinese consumers to buy movie tickets and visit theme parks. Hollywood executives have remained conspicuously quiet about U.S.-China relations in the wake of democracy protests in Hong Kong that have put global businesses including the NBA to Apple in a difficult spot. President Donald Trump has publicly hammered Biden over his close ties with China, accusing the former Vice President and his son, Hunter,  of being “paid off” by foreign interests. Moderators of Thursday’s town hall include CNN’s Dana Bash, Anderson Cooper, Chris Cuomo, Don Lemon and Nia-Malika Henderson. Sen. Harris (D-CA) reportedly attended a reception at The Abbey in West Hollywood on Wednesday, while Buttigieg is set to attend a fundraiser at the Belasco Theater in downtown L.A. Deadline reported earlier this week that Buttigieg attended a separate L.A. fundraiser on Tuesday at the home of former CAA agent Michael Kives, who is now head of the investment advisory firm K5 Global. Celebrities who were reportedly in attendance include Leonardo DiCaprio, Glenn Close, Ashton Kutcher and Paris Hilton. Hollywood is a reliable fundraising pitstop for Democratic candidates. Hillary Clinton made numerous L.A. visits in her failed 2016 bid for the White House, including events with mega donor and billionaire Haim Saban, the founder of Saban Entertainment. CNN’s town hall is set to take place at the Novo, at the L.A. Live complex in downtown L.A. Other Democratic presidential hopefuls scheduled to appear include Sen. Elizabeth Warren (D-MA), Beto O’Rourke, Sen. Amy Klobuchar (D-MN), former Housing and Urban Development Secretary Julián Castro, Tom Steyer and Sen. Cory Booker (D-NJ). Follow David Ng on Twitter @HeyItsDavidNg. Have a tip? Contact me at dng@breitbart.com",
      "date": "10 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "‘SNL’ Promotes ‘Breitbart Poll’ on Joe Biden Corruption Scandal",
      "url": "https://www.breitbart.com/entertainment/2019/10/06/saturday-night-live-promotes-breitbart-poll-on-joe-biden-corruption-scandal/",
      "subtitle": "Saturday Night Live promoted a parody “Breitbart Office Poll” in which 121 percent of respondents wanted former Vice President Joe Biden impeached over his and his son, Hunter Biden’s, dealings with Ukraine.",
      "author": "Ben Kew",
      "content": " The sketch sees Vice President Mike Pence (Beck Bennett), Trump’s attorney Rudy Guiliani (Kate McKinnon), Attorney General Bill Barr (Aidy Bryant), and Secretary of State Mike Pompeo (Matthew Broderick) discussing how to deal with recent moves by Democrats in Congress attempting to impeach the President Donald Trump after he supposedly “abused his power by pushing Ukraine to investigate his political rival” Joe Biden. “Listen, I’ve been asking around, and I think that this whole impeachment thing could be really bad,”  Pompeo declares. “Not according to this ‘Breitbart Office Poll’ that says 121 percent of people want Biden impeached,” responds Guiliani, holding up a copy of the results.  The Saturday Night Live scene was a reference to two recent polls Breitbart tweeted about by Trump. The first poll asked Breitbart readers whether they “stand with President Trump,” 97.83 percent of whom said they did, while 2.17 percent said they did not.  The second poll asked whether House Intelligence Committee Chairman Adam Schiff (D-CA) should “resign and be investigated,” to which a whopping 98.4 said he should, while just 1.6 percent said he should not.  It is not the first time that the NBC show has gone after Breitbart News. In February, actor Don Cheadle appeared on the show donning a hat with a logo for Sleeping Giants, a far-left political activist organization that has launched harassment, blacklist, and boycott campaigns against Breitbart News and other conservative media. Follow Ben Kew on Facebook, Twitter at @ben_kew, or email him at bkew@breitbart.com.",
      "date": "6 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Anderson Cooper White-Knights for Joe Biden, Says Trump ‘Falsely’ Accused Hunter Biden of Corruption",
      "url": "https://www.breitbart.com/politics/2019/10/15/anderson-cooper-white-knights-for-joe-biden-says-trump-falsely-accused-hunter-biden-of-corruption/",
      "subtitle": "CNN anchor Anderson Cooper said during the fourth Democrat debate on Tuesday that President Trump “falsely” accused former Vice President Joe Biden’s son Hunter Biden of corruption.",
      "author": "Kristina Wong",
      "content": " “Vice President, President Trump has falsely accused your son of doing something wrong while serving on a company board in Ukraine,” Cooper said in the lead-up to a question to Biden about his son. He went further, adding, “I want to point out there’s no evidence of wrongdoing by either one of you.” Cooper’s comments prompted discussion on Twitter from many who pointed out that Hunter Biden has admitted to making more than $50,000 per month while sitting on the board of a Ukrainian gas company while his father worked on Ukraine issues as vice president. Biden’s son said in an interview that he did nothing wrong but admitted it was “poor judgment” on his part, and that he was in the middle of “a swamp.” “In retrospect, look, I think that it was poor judgment on my part. Is that I think that it was poor judgment because I don’t believe now, when I look back on it — I know that there was — did nothing wrong at all,” he told ABC News in an exclusive interview. “However, was it poor judgment to be in the middle of something that is … a swamp in — in — in many ways? Yeah.” CNN’s Anderson Cooper runs interference for the Democrats, claims that Trump “falsely” accused Biden of corruption Biden responds by lying, falsely claims that he never talk to his son about business. Even his son said that he did. pic.twitter.com/jxeVoHTSIU — Ryan Saavedra (@RealSaavedra) October 16, 2019  “Falsely accused of doing something wrong” journo Anderson Cooper says to Joe Biden about Hunter Biden This after every Democrat on stage asserts that Trump has clearly and unambiguously committed enough crimes to go to prison for life, and no usage of “alleged” Seems fair — Buck Sexton (@BuckSexton) October 16, 2019  Anderson Cooper really just said Trump FALSELY accused Hunter Biden of wrongdoing. Cooper, your bias is showing. #DemDebate — Jessica Fletcher (@heckyessica) October 16, 2019  Anderson Cooper and Joe Biden both falsely state that Hunter Biden did nothing wrong. Taking $50k/month from a Ukrainian company that is paying you only for access to the Vice President (your dad), is wrong. — Tim Carney (@TPCarney) October 16, 2019  Poor Anderson Cooper \"pooted in public\" when he asserted that Biden was \"falsely\" accused…I'm surprised Cooper didn't start crying as to how much he loved Biden and hated @realDonaldTrump .  He validated the @JamesOKeefeIII and @Project_Veritas revelation! — Gov. Mike Huckabee (@GovMikeHuckabee) October 16, 2019  Anderson Cooper prefaces his question: \"VP Biden, you have been falsely accused by Trump of Ukrainian corruption…\" EYEROLL. Biased, much?? #DemDebate — Liz Wheeler (@Liz_Wheeler) October 16, 2019   Follow Breitbart News’s @Kristina_Wong. ",
      "date": "15 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Exclusive — Peter Schweizer: Joe Biden ‘Steered $1.8 Billion’ to Ukraine While His Son Bagged ‘Sweetheart Deal’ from Their Government",
      "url": "https://www.breitbart.com/politics/2019/04/03/exclusive-peter-schweizer-joe-biden-steered-1-8-billion-to-ukraine-while-his-son-bagged-sweetheart-deal-from-their-government/",
      "subtitle": "Peter Schweizer, president of the Government Accountability Institute and senior editor-at-large at Breitbart News, recalled how Hunter Biden, Joe Biden’s second son, received millions of dollars from Ukrainian energy company Burisma Holdings while his father directed $1.8 billion in aid money to Ukraine as vice president during the Obama administration.",
      "author": "Robert Kraychik",
      "content": " Schweizer joined Tuesday’s edition of SiriusXM’s Breitbart News Tonight with hosts Rebecca Mansour and Joel Pollak. Schweizer said, “I think a deeper problem that [Joe Biden] faces is — as has been reported on Breitbart and reported at the Hill, today — which I think is far deeper is the fact that his family, particularly his son, cashed in while he was vice president of the United States.” LISTEN:  John Solomon reported on Hunter Biden’s receiving millions of dollars from Burisma Holdings after being installed on the company’s board during his father’s vice presidential tenure: U.S. banking records show Hunter Biden’s American-based firm, Rosemont Seneca Partners LLC, received regular transfers into one of its accounts – usually more than $166,000 a month – from Burisma from spring 2014 through fall 2015, during a period when Vice President Biden was the main U.S. official dealing with Ukraine and its tense relations with Russia.” The general prosecutor’s official file for the Burisma probe – shared with me by senior Ukrainian officials – shows prosecutors identified Hunter Biden, business partner Devon Archer and their firm, Rosemont Seneca, as potential recipients of money. Shokin told me in written answers to questions that, before he was fired as general prosecutor, he had made “specific plans” for the investigation that “included interrogations and other crime-investigation procedures into all members of the executive board, including Hunter Biden.” “We’ve talked before about the deals he procured with the government for China,” remembered Schweizer. “The other place [Joe Biden’s] son, Hunter Biden, procured a big deal was in Ukraine. In Ukraine, it involved an energy company called Burisma, which is a very corrupt organization headed by an oligarch named Mykola Zlochevsky who is very close to ViktorYanukovich, the pro-Russian leader.” Schweizer asked, “There’s all kinds of questions and implications. Is there a Russian component to this, because Burisma is such a corrupt company?” “The bottom line is Joe Biden was the Obama administration’s point-person on policy towards Ukraine,” noted Schweizer. “He steered $1.8 billion in aid to that government and while he was doing so, his son got a sweetheart deal with this energy company – that we’ve been able to trace over just a 14-month period – paid $3.1 million into an account where Hunter Biden was getting paid.” Schweizer highlighted Hunter Biden’s lack of professional or experiential bona fides in terms of his board position at Burisma Holdings. “Suffice to say, Hunter Biden has no background in Ukraine,” stated Schweizer. “He has no background in energy policy. There’s really no legitimate explanation as to why he got this deal with this energy company, other than the fact his father was responsible for doling out money in Ukraine itself.” Schweizer went on, “It’s a huge problem, and it goes to this question of corruption and potential payoffs and bribes that these foreign entities were making to the Bidens in exchange for hopefully getting favorable treatment.” Despite the Robert Mueller-led operation’s ostensible pursuit of “collusion” between President Donald Trump and the Russian state, Schweizer noted actual financial dealings between the Biden family and foreign interests. Schweizer said, “One of the phrases that has been tossed around as it relates to the Russian collusion hoax was ‘obstruction of justice’ by Trump, and there’s been no — at least in my mind — evidence that that ever happened, and it doesn’t seem that Mueller felt any charges should be brought on that count. But in this case, you would have a pretty clear-cut case of obstruction of justice, where Joe Biden is saying to Ukrainian officials, ‘We are not going to give you this billion-dollar loan guarantee unless you fire this guy.'” Schweizer added, “There is far more evidence of collusion involving Joe Biden — or even involving the Clintons — of collusion with these foreign powers than there was with Donald Trump, because you actually have the transaction of money, you have very favorable policies that were carried out. I think ‘collusion’ is not too strong a word. I think it’s a pretty accurate word.” Schweizer added, “There’s no question. The Bidens got a lot of money — millions of dollars — from these foreign powers. Hunter Biden had no legitimate reasons to get the deal. He simply wasn’t qualified.” Schweizer warned of politicians and officials monetizing their political influence. “So what [Joe Biden] is doing is using U.S. taxpayer government resources for the personal benefit of his family, and by the way, all of this absolutely rings true,” remarked Schweizer. “Joe Biden was the Obama administration’s person on Ukraine, he traveled to that country something like 17 times during his tenure as vice president, which is pretty amazing.” Schweizer went on, “What’s remarkable is when, a couple of days before Donald Trump was inaugurated in Washington, D.C., Joe Biden was actually in Ukraine. It’s pretty remarkable for a vice president of the United States to be overseas that late in the game, but he was in Ukraine. [Joe Biden’s] sway and influence there was enormous, and it raises all kinds of questions about the way that he used or abused government power, and of course it raises questions about what potentially did Ukrainians have on Hunter Biden.” “What kind of evidence and information do we have?” asked Schweizer of corruption concerns regarding Joe Biden. “We know that millions of dollars flowed into Hunter Biden’s accounts. We know that he was not qualified for the job, and the question is, what did he get for Ukrainians in return? I think that’s all the sort of thing that needs to be investigated and looked into by a grand jury.” Schweizer added, “You have a pattern with Hunter Biden. Of a couple of cases that we know of and others that are lingering out there. We know in the case of China he flies with his dad on Air Force Two in December of 2013 and ten days later, his firm gets a $1 billion private equity deal with the Chinese government.” Schweizer continued, “Again, [Hunter Biden’s] firm has no background in China. Hunter Biden has no background in China. It’s just odd. About four months later, he gets this deal with the Ukrainians, particularly with Burisma. What we also know is, based on financial account records that came out [from] Morgan Stanley that was managed by Hunter Biden’s business partner, a guy named Devon Archer, he handled an account for Morgan Stanley and that account sent huge sums of money to Hunter Biden.” Schweizer went on, “Not only does that account show money coming in from the Chinese and Ukrainians. There’s also $1.2 million that comes from this LLC that we can’t trace. it comes from a boutique Swiss bank account that’s been implicated in money-laundering in ten countries. There’s $145,000 from the son of the former prime minister of Kazakhstan, which is of course a highly corrupt country with all sorts of interesting implications. The point is, Ukraine is not an isolated case. China is not an isolated case.” Joe Biden seems to have monetized his vice presidential powers, speculated Schweizer. Schweizer stated, “It’s pretty clear you have a pattern that the for-sale sign was open with the Biden family, and that a lot of foreign powers — including foreign governments — basically took them up on the offer and gave money to Hunter Biden. That, in and of itself, I think demands investigation in the United States.” “These financial records by Morgan Stanley [are] very, very clear,” declared Schweizer. “It shows line after line after line of money going into an account that is marked ‘Robert H. Biden,’ which is Hunter Biden’s legal name, and it shows huge sums of money coming in from Ukrainians, Chinese, Kazakhs, and anonymous LLCs. It’s all there in black and white.” Hunter Biden sat on the board of Bohai Harvest RST — an obscure private equity firm — which secured a $1.5 billion investment from the Chinese government, noted Schweizer. “The deal with China that he had was the first financial deal with the Chinese government that allowed moving assets to the Shanghai Free Trade Zone. So, J.P. Morgan didn’t have this kind of deal, Goldman Sachs didn’t have this kind of deal, Bank of America, Deutsche Bank, the only firm that had this deal was this small boutique firm that had been started a couple of years ago by the vice president’s son.” In March 2018, an aide of Joe Biden’s dismissed Schweizer’s investigations and research given Schweizer’s relationship with Breitbart News: “We aren’t going to engage on a politically motivated hit pieces based on a series of demonstrable, factual errors from a Breitbart-affiliated author and his financial backers.” Schweizer said, “So he can huff and puff and attack me personally all he wants. In part, he attacked me because of my role as an editor at Breitbart, but that doesn’t erase the facts.” On March 12, Joe Biden said he could not “think of any reason” he would not run for president. In December 2018,  he said “anybody can beat” Donald Trump in 2020’s forthcoming presidential election. Breitbart News Tonight broadcasts live on SiriusXM Patriot channel 125 weeknights from 9:00 p.m. to midnight Eastern or 6:00 p.m. to 9:00 p.m. Pacific. Follow Robert Kraychik on Twitter @rkraychik.",
      "date": "3 Apr 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "2020: Joe Biden Makes at Least 7 Gaffes at His Second Debate",
      "url": "https://www.breitbart.com/politics/2019/08/01/list-top-7-joe-biden-gaffes-at-the-democrat-debate/",
      "subtitle": "Former Vice President Joe Biden added to his long list of gaffes at Wednesday evening’s Democrat presidential primary debate in Detroit, botching everything from the price tag of his opponents’ health care plans to his own closing statement.",
      "author": "Joshua Caplan",
      "content": " Here are seven moments where Biden — now 76-years-old — misspoke, lost his train of thought, or blurted out actual nonsense during the late-night debate. 1.) Biden tells Sen. Kamala Harris (D-CA) ahead of the debate: “Go easy on me, kid.” While it may have been his intended word choice, the disrespect to a sitting senator started his debate performance on the wrong foot and distracted from whatever positive message he may have offered. The hot-mic moment was further undermined when Biden went negative on Harris without provocation. 2.) Biden misstates the cost of Harris’s health care plan. On the topic of health care, Biden stated the California Democrat’s “Medicare for All” proposal would cost a staggering $30 trillion — but he first mistakenly pegged its price tag at only $3 trillion. The 2020 frontrunner later repeated the $30 trillion figure, claiming Sen. Bernie Sanders (I-VT) “acknowledges it,” asserting “Thirty trillion dollars has to ultimately be paid.” An analysis estimates Sanders’ “Medicare for all” plan would cost the federal government $32.6 trillion over a decade, rendering Biden’s $3 trillion wildly inaccurate. Biden also grossly understated the Obama administration’s 10-year stimulus package of roughly $800 billion, saying it was $87 billion. 3.) Biden loses his train of thought on health care. “We immediately are able to cover everybody who wants to get off of their insurance plan they don’t like, no matter what one it is, and buy into a Medicare option,” Biden said. “And they can buy the gold plan, and they’re not going to have to pay.” At this moment, rather than complete his explanation of his plan, he offered a verbal pause — “anyway” — and trailed off. 4.) Calls Sen. Cory Booker (D-NJ) “the future president.” During a contentious exchange on crime legislation, Biden inadvertently predicted a Booker victory in 2020 before correcting himself, saying: “The fact is that the bills that the president, excuse me, the future president, that the senator is talking about are bills that were passed years ago and they were passed overwhelmingly.” Biden still appeared to have trouble with his words coming out of the gaffe, which drew a big laugh. His continued statement had several awkward phrases: “[The bills] that the senator is talking about are bills that were passed years ago and they were passed overwhelmingly. Since 2007, I, for example, tried to get the crack-powder-cocaine totally — disparity totally eliminated” (emphasis added). 5.) Appears to have misunderstood question about coal. CNN debate moderator Dana Bash asked Biden to clarify his comments on coal, fossil fuels, and fracking. She asks him about the continued existence of those industries, and he appears to agree –but then limits the scope of his answer to subsidies. DANA BASH: thank you, vice president. just to clarify, would there be any place for fossil fuels including coal and fracking in a biden administration? JOE BIDEN: No. We would work it out. We would make sure it’s eliminated, and no more subsidies for either one of those, any fossil fuel. Biden’s climate change policy makes no mention of eliminating coal as a resource, though it calls for helping coal industry-dependent communities transition to other jobs. 6.) Calls the Trans-Pacific Partnership (TPP) the “TTP.” Biden said he opposes the Trans-Pacific Partnership, a 12-nation trade agreement headed up by Obama administration, saying: “I would not rejoin the TTP [sic] as it was initially put forward. I would insist that we renegotiate pieces of that with the Pacific nations… so that we could bring them together to hold China accountable.” 7.) Joe’s botched closing statement goes viral. Biden made the debate’s biggest gaffe by screwing up the contact information for his campaign’s text message service. “If you agree with me, Go to Joe 3-0-3-3-0, thank you very much,” Biden said. A cyber-squatter quickly purchased “joe30330.com” after the flub, directing the URL to an unrelated page. Biden also messed by arguing that the United States can not handle another “eight years” of a Trump presidency. Trump can only serve for five more years after 2019. Ezra Dulis contributed to this report.",
      "date": "1 Aug 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "NY Post Editorial Board: Joe Biden Dismisses China Threat as His Son Profits from It",
      "url": "https://www.breitbart.com/2020-election/2019/05/07/ny-post-editorial-board-joe-biden-dismisses-china-threat-as-his-son-profits-from-it/",
      "subtitle": "While Joe Biden dismisses the economic and national security threat posed by China, his son has profited from financial ties to the communist regime, the New York Post editorial board argues in a Monday op-ed.",
      "author": "Rebecca Mansour",
      "content": " The Post’s editors highlight comments the former vice president and 2020 Democratic contender made at a campaign rally in Iowa last week dismissing the notion that “China is going to eat out lunch.” “Come on, man,” Biden scoffed, adding that “they’re not bad people” and “they’re not competition for us.” The Post op-ed counters Biden’s assertion with the fact that China is the world’s second-largest economy, and its mercantilist state-run economic system seeks to “dominate global markets” by “stealing intellectual property wherever it can and bribing and bullying other nations with its Belt and Road program to lock up markets across the globe, among other cheats.” As for Biden’s “not bad people” claim, the Post points to the Beijing regime’s flagrant and ruthless oppression of its own people, including the forced internment of one million Uighur Muslims into re-education camps. The Post then notes the close financial ties that the private equity firm of Biden’s son, Hunter Biden, has with China’s regime, as documented in Peter Schweizer’s bestselling book, Secret Empires. Beijing is also busy making Big Brother a 21st century reality. Biden should know that, since his son Hunter is an investor in a firm, Bohai Harvest RST, that’s deeply involved in Face++ — a mobile phone app that Beijing built to spy on its own public. Indeed, the younger Biden has long been in deep with China’s “not bad” elite, as Peter Schweizer revealed in his book “Secret Empires.” Notably, Hunter’s private equity firm, Rosemont Seneca Partners LLC, swung a $1.5 billion investment deal with the state-owned Bank of China even as his then-vice president dad was engaged in high-end diplomacy with Beijing. Hmm. Maybe Joe Biden just doesn’t dare think about just what “bad folks” China’s rulers really are. Hunter Biden’s Chinese investment firm, Bohai Harvest RST, obtains its financing from a subsidiary of the Communist government-owned Bank of China. As Breitbart’s John Hayward reported, Face++, the tech company Bohai Harvest RST invested in, “provided the facial-recognition software integrated into the smartphone app used by Chinese security forces to monitor the Uighur Muslims of Xinjiang province. The app plugs into a massive central database that collects an incredible amount of information about Xinjiang citizens, ranging from how much electricity they use to their DNA.” In a March interview with Fox News Channel’s Laura Ingraham, Schweizer explained the troubling circumstances surrounding Hunter Biden’s lucrative bank deal with the Chinese government at a time when his father was negotiating U.S. policy with the regime. “In December of 2013, Hunter Biden flies on Air Force 2 to Beijing, China, with his father,” Schweizer said. “His father meets with Chinese officials, he’s very soft on Beijing. The most important thing that happens [is] ten days after they return. And that’s when Hunter Biden’s small, private equity firm called Rosemont Seneca Partners gets a $1 billion private equity deal with the Chinese government, not with the Chinese corporation, with the government. And what people need to realize is Hunter Biden has no background in China. He has no background in private equity. The deal he got in the Shanghai free-trade zone, nobody else had — Goldman Sachs, Bank of America, Blackstone, nobody had this deal.” “There’s no question when you chart what Joe Biden is doing with China — the meetings he’s having and the deals that his son is procuring at the same time — that they are buying off Biden through his son. I think it’s crystal clear,” Schweizer added. In an interview last year with SiriusXM’s Breitbart News Tonight, Schweizer explained China’s foreign influence peddling tactic to get favorable treatment from American politicians. “The Chinese government has figured out that the way to get favorable treatment from policymakers in Washington, DC, is by, basically, signing sweetheart deals with the children of politicians because they think by doing so, they’ll get better policy positions from our government,” Schweizer said. “And the history indicates in the Obama administration that that’s exactly what happens.” Schweizer, the president of the nonpartisan Government Accountability Institute and a senior editor-at-large for Breitbart News, wrote the bestselling 2015 exposé Clinton Cash, which is widely credited for its instrumental impact on Hillary Clinton’s failed 2016 presidential campaign due to Schweizer’s copious documentation of the former secretary of state’s history of amassing wealth from donors seeking favorable actions from her State Department. Schweizer’s research on Hunter Biden has already triggered Democratic strategists worried that Joe Biden’s 2020 campaign could suffer the same fate as Clinton’s. The similarities between the two candidates are hard to dismiss: both are establishment favorites, both are Obama administration alums, and both are tainted by accusations that they used their authority as government officials to benefit their family to the potential detriment of U.S. foreign policy. Biden currently leads in the polls among the Democratic 2020 contenders. A Hill-HarrisX poll released Monday shows Biden with a commanding 32-point lead over his closest competitor, Vermont Sen. Bernie Sanders. The former vice president led the poll at 46 percent, followed by Sanders at 17 percent; South Bend, Indiana, mayor Peter Buttigieg at 8 percent; and Massachusetts Sen. Elizabeth Warren at 7 percent.  Rebecca Mansour is Senior Editor-at-Large for Breitbart News and the host of Breitbart News Tonight on SiriusXM Patriot channel 125, which broadcasts live weeknights from 9:00 p.m. to midnight Eastern (6-9:00 p.m. Pacific). Follow her on Twitter at @RAMansour.",
      "date": "7 May 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Joe Biden Campaign Demands Media Censor Rudy Giuliani",
      "url": "https://www.breitbart.com/the-media/2019/09/29/joe-biden-campaign-demands-media-censor-rudy-giuliani/",
      "subtitle": "The presidential campaign of former Vice President Joe Biden sent a letter to every major television network, demanding that they keep former New York City mayor Rudy Giuliani off the air.",
      "author": "Joel B. Pollak",
      "content": " The letter was reported by New York Times media reporter Michael Grynbaum:  The letter states, in part (original emphasis): We are writing today with grave concern that you continue to book Rudy Giuliani on your air to spread false, debunked conspiracy theories on behalf of Donald Trump. While you often fat check his statements in real time during your discussions, that is no longer enough. By giving him your air time, you are allowing him to introduce increasingly unhinged, unfounded and desperate lies into the national conversation. We write to demand that in service to the fact, you no longer book Rudy Giuliani, a surrogate for Donald Trump who has demonstrated that he will knowingly and willingly lie in order to advance his own narrative. (The Biden campaign itself has been known to lie: the former vice president continues to repeat the Charlottesville “very fine people” hoax after being confronted about it at the Iowa State Fair by Breitbart News, for example.) The statement goes on to claim that Giuliani’s claims about potential corruption by Hunter Biden in Ukraine are “completely baseless.” Giuliani serves as a personal lawyer for President Donald Trump, and has been involved in investigating Hunter Biden’s overseas business interests, which he developed while his father was in office. The former vice president pressured Ukraine to fire a prosecutor who was investigating Burma Holdings, an oil and gas company on whose board Hunter Biden sat at the time — a clear conflict of interest that Joe Biden has never explained. Biden’s attempt to silence the opposition — and the media — is virtually unprecedented in the history of American politics. Joel B. Pollak is Senior Editor-at-Large at Breitbart News. He earned an A.B. in Social Studies and Environmental Science and Public Policy from Harvard College, and a J.D. from Harvard Law School. He is a winner of the 2018 Robert Novak Journalism Alumni Fellowship. He is also the co-author of How Trump Won: The Inside Story of a Revolution, which is available from Regnery. Follow him on Twitter at @joelpollak.",
      "date": "29 Sep 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Joe Biden: Trump Judges Have ‘No Interest … in the Traditional Reading of the Constitution’",
      "url": "https://www.breitbart.com/2020-election/2019/08/29/joe-biden-trump-judges-constitution/",
      "subtitle": "GREENVILLE, South Carolina — Former vice president Joe Biden told a town hall meeting Thursday evening that President Donald Trump’s judicial appointees have “no interest whatsoever in the traditional reading of the Constitution.”",
      "author": "Joel B. Pollak",
      "content": " He then caught himself and said: “I shouldn’t say ‘whatsoever.’ Don’t add that in there.” Trump has prided himself on nominating constitutional originalists, who interpret the Constitution and the law through the original text as understood when written. Biden favors a “living Constitution” approach that interprets the Constitution and the law through a “penumbra” of rights beyond those actually provided in the text. Biden was addressing an audience of about 400 in a local gymnasium to close out his two-day swing through the Palmetto State. He began with his usual stump speech, claiming that President Trump had called neo-Nazis “very fine people” in “Charlotte” (he meant Charlottesville). In reality, Trump said the neo-Nazis should be “condemned totally.” Biden added that there was a “direct line” between Trump’s rhetoric on immigration and the mass shooting in El Paso, Texas, earlier this month. He cited the shooter’s manifesto — without noting that the shooter said he was not inspired by Trump. Among other attacks, Biden also claimed that President Trump was abusing executive power, and pledged to restore constitutional checks and balances. Biden did not mention that all of President Barack Obama’s major achievements after Obamacare were undertaken through executive actions — such as Deferred Action for Childhood Arrivals (DACA), the Iran deal, and the Paris Climate Accords — often circumventing Congress and directly contravening congressional will. At one point in Biden’s attack on the president’s immigration policies, a pro-Trump heckler shouted from the back: “Best president we’ve ever had!” He and a woman he was with were confronted by security, and escorted out. One Biden supporter tore off the heckler’s hat, though he later retrieved it from the floor. Reporters later shouted questions at Biden about a Washington Post story Thursday that accused him of telling a “moving but false war story” on the campaign trail. He ignored the media and left the venue. The former vice president is leading the state polls by a wide margin, thanks partly to his overwhelming support in the African-American community. He focused his attention on the Upstate area, speaking in Greenville, Spartanburg, Rock Hill, and Gaffney. Joel B. Pollak is Senior Editor-at-Large at Breitbart News. He earned an A.B. in Social Studies and Environmental Science and Public Policy from Harvard College, and a J.D. from Harvard Law School. He is a winner of the 2018 Robert Novak Journalism Alumni Fellowship. He is also the co-author of How Trump Won: The Inside Story of a Revolution, which is available from Regnery. Follow him on Twitter at @joelpollak.",
      "date": "29 Aug 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Report: Joe Biden Fabricated Emotional Story About Afghanistan War",
      "url": "https://www.breitbart.com/politics/2019/08/29/report-joe-biden-fabricated-emotional-story-about-afghanistan-war/",
      "subtitle": "Former Vice President Joe Biden is under fire for fabricating an emotional story about the war in Afghanistan while campaigning in New Hampshire last week.",
      "author": "Haris Alic",
      "content": " Biden, whose penchant for confusing times and places has drawn worried whispers from even the staunchest of allies, told a heart wrenching story last Friday about being asked to pin a medal on a reluctant Navy officer. The story, which Biden told to more than 400 voters in Hanover, New Hampshire, quickly made an impact upon everyone in the room. “A four-star general had asked the then-vice president to travel to Kunar province in Afghanistan, a dangerous foray into ‘godforsaken country’ to recognize the remarkable heroism of a Navy captain,” the Washington Post reported on Thursday. “Some told him it was too risky, but Biden said he brushed off their concerns.” “We can lose a vice president,” Biden claimed to have said when asked to make the trip. “We can’t lose many more of these kids. Not a joke.” As Biden recollected, the Navy captain “rappelled down a 60-foot ravine under fire and retrieved the body of an American comrade, carrying him on his back.” When the captain’s superiors wanted to honor his bravery with a “Silver Star,” the officer refused as it “felt like a failure” because his comrade had died. “He said, ‘Sir, I don’t want the damn thing!’” said Biden, his “jaw clenched” and “voice rising to a shout,” according to the Post. “’Do not pin it on me, Sir! Please, Sir. Do not do that! He died. He died!’” The raw emotion Biden exhibited when telling the harrowing story of bravery and loss left those in attendance “silent.” “This is the God’s truth,” the former vice president added. “My word as a Biden.” The only problem, as the Post reported, was that “almost every detail in the story appears to be incorrect.”: Biden visited Kunar province in 2008 as a U.S. senator, not as vice president. The service member who performed the celebrated rescue that Biden described was a 20-year-old Army specialist, not a much older Navy captain. And that soldier, Kyle J. White, never had a Silver Star, or any other medal, pinned on him by Biden. At a White House ceremony six years after Biden’s visit, White stood at attention as President Barack Obama placed a Medal of Honor, the nation’s highest award for valor, around his neck. Upon further investigation, the paper concluded that Biden had conflated three separate stories, including one in which he actually “did pin a medal on a heartbroken soldier, Army Staff Sgt. Chad Workman, who didn’t believe he deserved the award.” “In the space of three minutes, Biden got the time period, the location, the heroic act, the type of medal, the military branch and the rank of the recipient wrong, as well as his own role in the ceremony,” the Post elaborated. The story and its inaccuracies come to light as Biden’s campaign is besieged by doubts over his fitness for the presidency after a string of perplexing gaffes. In particular, the former vice president has shown difficulty remembering specific events, locations, and individuals during public appearances. When campaigning in South Carolina on Wednesday, Biden appeared to forget the name of his former runningmate, President Barack Obama. “They invaded a significant portion of another country and annexed a significant portion of it called Crimea,” Biden said when discussing Russia’s invasion of Ukraine. “He’s saying it was President — my boss — it was his fault.” Such lapses have become more frequent in recent weeks, with Biden at one point even claiming he was vice president during the mass shooting at Marjory Stoneman Douglas High School in Parkland Florida. “Those kids in Parkland came up to see me when I was vice president,” Biden said earlier this month, before claiming that when the survivors visited Congress, lawmakers were “basically cowering, not wanting to see them. They did not want to face it on camera.” Many were quick to point out that the tragic shooting, which resulted in 17 fatalities and over a dozen injuries, actually occurred on February 14, 2018 — more than a year after Biden left office. In response to such questionable conduct, an increasing number of individuals on the left have begun raising concerns over Biden’s capacity to serve as commander in chief. “Biden and his team owe it to voters to put him on a real, rigorous public campaign schedule, like everyone else,” Adam Jentleson, a one time top aide to former Senate Minority Leader Harry Reid (D-NV), said recently. “If he can hack it, great. If not, better to know sooner rather than later,” Jentleson added. “Keeping him under wraps except for big events while trying to skate by is just sketchy.”",
      "date": "29 Aug 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Watch–Trump: Joe Biden ‘Was Only a Good Vice President Because He Understood How to Kiss Obama’s Ass’",
      "url": "https://www.breitbart.com/politics/2019/10/10/watch-trump-joe-biden-was-only-a-good-vice-president-because-he-understood-how-to-kiss-obamas-ass/",
      "subtitle": "President Trump said Democrat Joe Biden was “only a good Vice President because he understood how to kiss” former President Obama’s “ass” in Minneapolis, Minnesota on Thursday.",
      "author": "John Binder",
      "content": " During his rally in Minneapolis, Trump called out Biden for his alleged corruption schemes in Ukraine and China, where his son Hunter Biden was paid up to $83,000 a month to sit on a Ukrainian energy company’s board while his father was Vice President. Trump said: Two months after President Obama put Joe in charge of Ukraine policy … and the press will not write it. They say, ‘In totally unsubstantiated charges’ every time they talk about him, ‘President Trump has said that his son walked away with a fortune, now you know that’s a totally unsubstantiated charge.’ Really? It’s not unsubstantiated, it’s a fact.” “Joe’s son Hunter got thrown out of the Navy and then he became a genius on Wall Street in about two days,” Trump said. “By the way, whatever happened to Hunter? Where the hell is he … Where’s Hunter?” Speaking directly to Hunter Biden, Trump said Biden was only a good Vice President because he sucked up to Obama. “And your father was never considered smart, he was never considered a good Senator, he was only a good Vice President because he understood how to kiss Barack Obama’s ass,” Trump said to a roaring crowd. Trump noted Hunter Biden’s deal with the Bank of China that provided him with a $1.5 billion check for his own private business dealings. “And then they go to China … and Hunter, who’s not too smart … he goes in, he has a meeting and walks out with $1.5 billion, billion with a B, $1.5 billion,” Trump said. “Now think of it, where’s Hunter?” “Hunter, you know nothing about energy, you know nothing about China, you know nothing about anything really. Hunter, you’re a loser,” Trump said. “Why did you get $1.5 billion, Hunter?” As Breitbart News’s Haris Alic has reported, questions about why Hunter Biden was appointed to serve on the board of Ukrainian oil company Burisma in April 2014 have plagued the former vice president’s 2020 Democrat presidential primary bid. Breitbart News’s Senior Contributor Peter Schweizer has detailed in his book, Secret Empires: How the American Political Class Hides Corruption and Enriches Family and Friends, how Hunter Biden had no experience with the oil and gas industry or the nation of Ukraine before joining Burisma while his father was vice president. John Binder is a reporter for Breitbart News. Follow him on Twitter at @JxhnBinder.",
      "date": "10 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Joe Biden: ‘Not a Single Bit of Evidence’ Son Asked Me to Help Him in Ukraine",
      "url": "https://www.breitbart.com/politics/2019/05/14/joe-biden-not-a-single-bit-of-evidence-son-asked-me-to-help-him-in-ukraine/",
      "subtitle": "Former Vice President Joe Biden denied Monday that his son Hunter Biden asked him for a favor in Ukraine while serving on the energy board of a Ukrainian energy company.",
      "author": "Charlie Spiering",
      "content": " “We never once discussed it when he was there,” Biden told the Associated Press. “There’s not a single bit of evidence that’s been shown in any reporting that’s been done that he ever talked about it with me or asked any government official for a favor.” When he was vice president, Joe Biden threatened to withhold $1 billion in loan guarantees for Ukraine if officials did not fire the country’s top prosecutor, who was pursuing a corruption investigation of an energy company while his son Hunter was serving on the board. The connection was revealed in author Peter Schweizer’s best-selling book Secret Empires, and the reporting was confirmed in the New York Times. Hunter Biden was paid as much as $50,000 per month while serving on the board, as his father led the Obama administration’s policy with Ukraine. Biden’s “not a single bit of evidence” defense echoes former Secretary of State Hillary Clinton’s repeated assertion that there was no evidence of improper paybacks after she approved the Uranium One deal — despite receiving $145 million in pledges and donations for the Clinton Foundation. Biden’s Ukraine connection made recent headlines after President Donald Trump’s personal attorney suggested he would travel to Ukraine to investigate the issue before ultimately deciding against it. Biden criticized Giuliani for even considering the idea. “I can’t remember any lawyer representing the president, conferring with the president, deciding to go overseas, where a government relies on U.S. largesse to try to get them to do something that everybody knows never happened,” Biden said during an interview with WMUR. In the same interview, he also pointed to the reporting surrounding the conflict of interest. “All the reports indicated that not a single, solitary thing was inappropriate about what my son did. He never talked to me. He never talked to anybody in the administration,” Biden said. In his interview with the Associated Press, Biden defended his son’s role on the board. “I have great confidence in my son,” he said. “He’s a man of great integrity.”",
      "date": "14 May 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Senator Who Employed Chinese Spy Endorses Joe Biden for President",
      "url": "https://www.breitbart.com/2020-election/2019/10/09/senator-who-employed-chinese-spy-endorses-joe-biden-for-president/",
      "subtitle": "A high-profile U.S. senator with professional and personal ties to China — including once employing one of its spies — is backing former Vice President Joe Biden amid mounting questions over his son’s business dealings with the communist regime.",
      "author": "Haris Alic",
      "content": " Sen. Dianne Feinstein (D-CA), a former chairwoman of the Senate Intelligence Committee, announced her endorsement of the former vice president on Tuesday, claiming to have witnessed Biden’s “fortitude” and leadership during their overlapping tenures in Congress. Feinstein said in a statement: I’ve worked closely with Vice President Biden and I’ve seen firsthand his legislative ability, his statesmanship, and most importantly his moral fortitud. During his time in Congress and in the White House, Joe Biden has been a tireless fighter for hard working American families. The endorsement comes as Biden’s presidential campaign is besieged by scandal regarding the lucrative business dealings his youngest son, Hunter, had with foreign governments. Only hours before Feinstein’s endorsement, the Chinese government announced it would not investigate how Hunter Biden ended up at the center of one its top private equity firms. The Chinese foreign ministry made the decision after President Donald Trump publicly called for a probe of Hunter Biden’s dealings with Bohai Harvest RST (BHR). In particular, Trump has noted that the circumstances surrounding BHR’s creation could have posed a conflict of interest for Joe Biden. As Peter Schweizer, senior contributor at Breitbart News, revealed in his bestselling book Secret Empires: How the American Political Class Hides Corruption and Enriches Family and Friends, Hunter Biden inked the multibillion-dollar deal that created BHR with a subsidiary of the state-owned Bank of China in 2013. The timing of the lucrative deal has been brought into question as it came only 12 days after Hunter visited China with his father aboard Air Force Two. Officially, the then-vice president was visiting the country amid escalating tensions over islands in the South China Sea and decided to bring his granddaughter and son along. In a March 2018 interview with Breitbart News Tonight, however, Schweizer detailed the political machinations that preceded Hunter Biden’s $1.5 billion venture with China: In December of 2013, Vice President Joe Biden flies to Asia for a trip, and the centerpiece for that trip is a visit to Beijing, China. To put this into context, in 2013, the Chinese have just exerted air rights over the South Pacific, the South China Sea. They basically have said, ‘If you want to fly in this area, you have to get Chinese approval. We are claiming sovereignty over this territory.’ Highly controversial in Japan, in the Philippines, and in other countries. Joe Biden is supposed to be going there to confront the Chinese. Well, he gets widely criticized on that trip for going soft on China. For basically not challenging them, and Japan and other countries are quite upset about this. Since its creation, BHR has invested heavily in energy and defense projects across the globe. As of June, Hunter Biden was still involved with BHR, sitting on its board of directors and owning a minority stake of the fund estimated to be worth more than $430,000. Such dealings at the center of politics and business, while perhaps not illegal, are not exclusive to the Biden family alone. As a few noted at the time of Feinstein’s endorsement, the senator and her husband have their own close ties to the communist country. During her tenure as mayor of San Francisco in the late-1970s and early-1980s, Feinstein took advantage of the newly normalized diplomatic relations between the U.S. and China by establishing one of the first sister city partnership between San Francisco and Shanghai. Through that partnership, Feinstein led trade delegations to China in which she and her husband, Richard Blum, became acquainted with some of the country’s most prominent political leaders. As the Federalist noted in August 2018, Feinstein and her husband leveraged those relationships to boost their own wealth. In 1986, Feinstein and Jiang Zemin — the then-mayor of Shanghai, who would later ascend to the presidency of the People’s Republic of China — “designated several corporate entities for fostering commercial relations.” One of those firms was Shanghai Pacific Partners, which employed Blum as a director. Blum reportedly had an interest of upwards of $500,000 in a project backed by Shanghai Pacific Partners. After Feinstein was elected to the Senate in 1992, Blum continued profiting off their ties to China. A the same time, the freshman lawmaker was pitching herself as a “China hand” to colleagues, even once claiming “that in my last life maybe I was Chinese.” Through her seat on the Senate Foreign Relations Committee, Feinstein led the fight on a number of initiatives seen as being favorable to China, including granting the country permanent most-favored-nation trading status in 2000. Despite Feinstein and her husband having a close relationship with Jiang, the Chinese government targeted the senator as part of its espionage operations. In the early 2000s, the Chinese Ministry of State Security (MSS) recruited a longtime employee of the senator to gather information about the inner workings of her congressional and district offices. Feinstein only learned of the staffer’s duplicity in 2013, after he’d already been on her payroll for more than 20 years. “While this person, who was a liaison to the local Chinese community, was fired, charges were never filed against him,” Politico reported in 2018, speculating that because “the staffer was providing political intelligence and not classified information—making prosecution far more difficult.” Apart from the convoluted history of the senator’s ties to China, the political timing of Feinstein’s endorsement also caught many off guard. The California Democrat, who hosted a fundraiser on Biden’s behalf last week alongside House Speaker Nancy Pelosi’s (D-CA) daughter, is only the most recent figure from the Democrat establishment to openly pledge support for the former vice president. Feinstein’s endorsement, however, was not totally expected, especially since her seamate, Sen. Kamala Harris (D-CA), is mounting a bid of her own for the Democrat nomination. In fact, earlier this year, Feinsten flirted with the notion of remaining neutral in the 2020 contest out of respect for Harris. Compounding the political picture is that most polls show Biden no longer the favorite to win California, having fallen behind Sen. Elizabeth Warren (D-MA). Feinstein, however, did not address any of that when endorsing the former vice president on Tuesday. Instead, the senator offered platitudes about Biden’s work to enhance gun control and how his campaign was a “fight to restore the soul of the nation.”",
      "date": "9 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Watch: Joe Biden Vows Flood of Immigration If Elected",
      "url": "https://www.breitbart.com/politics/2019/08/09/biden-flood-of-immigration/",
      "subtitle": "Former Vice President and leading 2020 Democrat presidential candidate Joe Biden is vowing to greatly increase the number of legal immigrants admitted to the United States every year.",
      "author": "John Binder",
      "content": " In a speech to the Asian and Latino Coalition PAC, Biden promised to increase the level of legal immigration to the country beyond the roughly 1.2 million legal immigrants that are admitted every year, booming the foreign-born population to an unprecedented 45 million — a 108-year record high. Specifically, Biden said the U.S. can “in a heartbeat” import another two million immigrants today. Biden said: We could afford to take in a heartbeat another two million people. The idea that a country of 330 million people is cannot absorb people who are in desperate need … is absolutely bizarre … I would also move to increase the total number of immigrants able to come to the United States. [Emphasis added] In addition to an increase in legal immigration levels, Biden said his national immigration plan would ensure that all 11 to 22 million illegal aliens living across the U.S. receive amnesty and a pathway to American citizenship. Likewise, Biden said it is “immigration” that has “built this country,” reiterating the claim that the U.S. is a “nation of immigrants,” calling it “a fact.” Biden’s comments come after the latest Harvard/Harris Poll finds that swing voters by a majority, as well as nearly every other demographic group, say they are less likely to support a 2020 presidential candidate who wants more illegal and legal immigration to the U.S. Currently, the nation’s Washington, DC-imposed mass legal and illegal immigration policy — whereby at least 1.5 million unskilled foreign nationals are admitted to the U.S. every year — is a boon to corporate executives, Wall Street, big business, and multinational corporations, as America’s working and middle class have their wealth redistributed to the country’s top earners through wage stagnation. Research by the National Academies of Sciences, Engineering, and Medicine has discovered that immigration to the country shifts about $500 billion in wages away from working and middle-class Americans toward new arrivals and economic elites. Similarly, research by Steven Camarotta has found that every one percent increase in the immigrant composition of an occupation’s labor force reduces Americans’ hourly wages by 0.4 percent. Every one percent increase in the immigrant workforce reduces Americans’ overall wages by 0.8 percent. In the last decade alone, the U.S. has admitted ten million legal immigrants, forcing American workers to compete against a growing population of low-wage foreign workers. Meanwhile, if legal immigration continues, there will be 69 million foreign-born residents living in the U.S. by 2060 and a total population of more than 404 million residents. John Binder is a reporter for Breitbart News. Follow him on Twitter at @JxhnBinder.",
      "date": "9 Aug 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Joe Biden Explodes Over Question About Son’s Ties to Ukraine: ‘I’m Not Going to Respond to That’",
      "url": "https://www.breitbart.com/2020-election/2019/10/04/joe-biden-explodes-over-question-about-sons-ties-to-ukraine-im-not-going-to-respond-to-that/",
      "subtitle": "Former Vice President Joe Biden exploded at the media on Friday when asked about his youngest son’s shadowy business dealings in Ukraine.",
      "author": "Haris Alic",
      "content": " The tense altercation occurred during a campaign stop in Los Angeles, California, where the former vice president was asked if Hunter Biden’s service on the board of directors of Burisma Holdings, a Ukrainian oil and gas giant, had posed a conflict of interest during his time in the White House. Biden, who in the past had refused to discuss his son’s business dealings with foreign governments, appeared perturbed by the question. “It’s not a conflict of interest,” the former vice president said. “There’s been no indication of any conflict of interest, from Ukraine or anywhere else, period. I’m not going to respond to that.”  The question regarding the potential conflict of interest came only hours after the newly appointed Ukrainian Prosecutor General  announced he was reviewing allegations of criminal conduct against Burisma. Hunter Biden joined the company’s board of directors in April 2014, despitehaving no prior background in either the energy industry or Ukraine. As Peter Schweizer, senior contributor at Breitbart News, detailed in his book  Secret Empires: How the American Political Class Hides Corruption and Enriches Family and Friend, Hunter Biden secured the position, which paid as much as $83,000 per month, around the same time his father was tapped to lead the Obama administration’s policy in Ukraine. The timing of Hunter Biden’s ascension to Burisma’s board immediately raised questions from ethics watchdogs in both the U.S. and Europe concerning conflicts of interest. Adding to the ethical cloud over that appointment was that Mykola Zlochevsky, Burisma’s founder, had his assets seized in the United Kingdom for suspicion of money laundering. Many have speculated Hunter Biden’s position on Burisma’s board was an attempt by Zlochevsky to curry favor with western leaders to prevent further scrutiny of his business dealings. Such a brazen attempt would not be totally ill-suited for Zlochevsky. The Burisma founder is rumored to be one of eastern Europe’s top oligarchs, a position obtained while serving in the Ukrainian government under former President Viktor Yanukovych — a staunch ally of Russian President Vladimir Putin. It was during his tenure in government as Ukraine’s minister of natural resources that Burisma received its oil and gas licenses. It is in the context of Burisma and Zlochevsky’s legal troubles that Joe Biden’s political influence has raised the most red flags. The former vice president has particularly drawn questions over his conduct in demanding the Ukrainian government fire its top prosecutor, Viktor Shokin, in 2016. Biden, who has publicly bragged about the firing, reportedly threatened to withhold more than one billion dollars in U.S. aid if the Ukrainian government did not remove Shokin. He has claimed the demand came from then-President Barack Obama, who had allegedly lost faith in the prosecutor’s ability to tackle corruption. Unofficially, though, it was well known Shokin was investigating both Burisma and Zlochevsky for public corruption. It is uncertain if the probe extended to Hunter Biden, although Shokin has recently admitted that prior to his ouster, he was warned to back off of the matter. Regardless of what occurred, Shokin’s successor dropped the investigation into Burisma and Zlochevsky Since President Donald Trump suggested the matter be looked into by Ukraine, an action that launched an impeachment inquiry by the Democrat-controlled House of Representatives, Biden has worked to minimize his role in the entire proceeding. Part of that strategy has been to pivot the conversation away from Hunter Biden and Burisma by accusing Trump of abusing his power in suggesting Ukraine probe the issue. “Let’s focus on the problem, focus on this man, what he’s doing, that no president has ever done,” Biden told the media on Friday.",
      "date": "4 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Joe Biden Claims ‘There Are at Least Three’ Genders, Cannot Name Them",
      "url": "https://www.breitbart.com/politics/2019/08/09/joe-biden-claims-there-are-at-least-three-genders-cannot-name-them/",
      "subtitle": "Former Vice President Joe Biden claimed there were “at least three” genders while campaigning on Thursday, but he could not name them.",
      "author": "Haris Alic",
      "content": " Biden, who has made a string of high-profile gaffes this week, continued the trend during a visit to the Iowa State Fair, where he was asked by a student “how many genders” exist. “There are at least three,” the 76-year-old Biden responded, according to video of the encounter captured by Turning Point USA. When pushed to name all three genders by the student, Biden retorted by saying, “Don’t play games with me, kid.” “By the way, the first one to come out for marriage was me,” he added before moving on to greet more individuals.  Biden’s comments come as Democrats have increasingly moved towards accepting and promoting gender identities outside of the traditional male and female sexes. Some advocates even claim there are more than 50 “genders,” including agender, gender fluid, intersex, and two-spirit, among many others. Despite the embrace by Democrats, polls show that while Americans have sympathy for individuals identifying as transgender, they do not support the notion an individual’s legal sex is determined by “gender identity.”",
      "date": "9 Aug 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Joe Biden: Trump Supporters Are ‘Virulent,’ ‘Dregs of Society’",
      "url": "https://www.breitbart.com/politics/2018/09/17/joe-biden-trump-supporters-virulent-dregs-society/",
      "subtitle": "Former Vice President Joe Biden echoed Hillary Clinton’s “basket of deplorables” moment during a Saturday evening speech at the Human Rights Campaign’s annual dinner in Washington, DC, calling President Donald Trump’s supporters “virulent people” and “dregs of society.”",
      "author": "Katherine Rodriguez",
      "content": "  “Despite losing in the courts, and in the court of opinion, these forces of intolerance remain determined to undermine and roll back the progress you all have made,” Biden told dinner attendees Saturday evening. “This time they—not you—have an ally in the White House. This time they have an ally. They’re a small percentage of the American people—virulent people, some of them the dregs of society,” Biden continued. Biden then urged the crowd to do what they could to oppose Trump and his administration for promoting “prejudice” under the guise of culture. “Those who try to excuse this kind of prejudice in the name of culture, I say, ‘Prejudice is prejudice, and humanity is humanity. It is a crime,'” he said. “Our work is not yet done–by any stretch of the imagination. The stakes are much too high.” Biden’s comments come two years after Clinton called Trump’s followers “a basket of deplorables” at a fundraiser in New York packed with liberal donors. Donald Trump Jr. immediately called out Biden, tweeting Sunday evening that the comments went “too far even for him.”  Biden’s remarks come as he mulls a possible third run for the presidency. If the former vice president decides to run, he may have to answer to explosive revelations that he and his son Hunter struck a $1.5 billion deal with the Chinese government-backed Bank of China just ten days after the vice president and his son returned from a trip to China aboard Air Force Two. Breitbart News Senior Editor-at-Large Peter Schweizer, in his book Secret Empires: How the American Political Class Hides Corruption and Enriches Family and Friends, detailed how Biden may have helped Hunter secure the $1.5 billion deal with a China-based investment firm that had ties to a Chinese atomic energy company indicted for “nuclear power conspiracy against the United States.” “The FBI arrests and charges senior officials in this company with stealing nuclear secrets in the United States. Specifically, they’re trying to get access to something called the AP-1000 nuclear reactor that is very similar to the ones that we put on U.S. submarines,” Schweizer wrote. “So again, you have the son of the vice president, a close aide to the secretary of state who are investing in a company that is trying to steal nuclear secrets in the United States. It’s a stunning story, and here’s the thing: none of this is required to be disclosed because they’ve figured out a way to get around these disclosure laws,” Schweizer continued.",
      "date": "17 Sep 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Report: Whistleblower Worked with Joe Biden at Obama White House",
      "url": "https://www.breitbart.com/politics/2019/10/10/report-whistleblower-worked-with-joe-biden-at-obama-white-house/",
      "subtitle": "Democrat presidential hopeful and former Vice President Joe Biden had a “professional” tie to the CIA Whistleblower, according to a report from the Washington Examiner, which includes statements from intelligence officers and former White House officials.",
      "author": "Kyle Morris",
      "content": " After two separate reports from the New York Times, the Washington Examiner has established the whistleblower “is a career CIA analyst who was detailed to the National Security Council at the White House and has since left.” A now-retired CIA officer told the Washington Examiner, “From everything we know about the whistleblower and his work in the executive branch then, there is absolutely no doubt he would have been working with Biden when he was vice president.” The Washington Examiner noted: As an experienced CIA official on the NSC with the deep knowledge of Ukraine that he demonstrated in his complaint, it is probable that the whistleblower briefed Biden and likely that he accompanied him on Air Force Two during at least one of the six visits the 2020 candidate made to the country. A former Trump administration official also spoke with the Washington Examiner and claimed Biden’s work on foreign affairs put him in the whistleblower’s circle either at the CIA or at the White House. “This person, after working with Biden, may feel defensive towards him because he feels [Biden] is being falsely attacked. Maybe he is even talking to Biden’s staff,” the former Trump administration official stated. “Maybe it is innocent, maybe not.” “The Whistleblower’s facts have been so incorrect about my ‘no pressure’ conversation with the Ukrainian President, and now the conflict of interest and involvement with a Democrat Candidate, that he or she should be exposed and questioned properly,” President Donald Trump wrote Wednesday on Twitter.  In a statement to members of Congress, Michael Atkinson, the Intelligence Community’s inspector general, said the whistleblower had a “professional” tie to a 2020 Democrat presidential hopeful. Atkinson also said the whistleblower’s complaint shows “some indicia of an arguable political bias … in favor of a rival political candidate.” Follow Kyle on Twitter @RealKyleMorris and Facebook.",
      "date": "10 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Nolte: Don’t Forget Joe Biden Exposed Himself to Female Secret Service Agents",
      "url": "https://www.breitbart.com/politics/2019/04/02/nolte-dont-forget-joe-biden-exposed-himself-female-secret-service-agents/",
      "subtitle": "It’s not okay that Harvey Weinstein did it. It’s not okay that Charlie Rose did it. But when we learned in 2014 that then-Vice President Joe Biden exposed his naked body to women in the Secret Service, the media didn’t care. And the media still don’t care because Orange Man Bad.",
      "author": "John Nolte",
      "content": " In his New York Times best-seller, The First Family Detail, award-winning investigative reporter Ronald Kessler revealed that “Biden has a habit of swimming in his pool nude. Female Secret Service agents find that offensive.” He added, “Because of Biden’s lack of consideration as evidenced by that habit and his refusal to give agents advance notice of his trips back home, being assigned to his detail is considered the second worst assignment in the Secret Service after being assigned to protect Hillary Clinton.” One agent told Kessler, “Biden likes to be revered as everyday Joe, and that’s his thing. But the reality is no agents want to go on his detail because Biden makes agents’ lives so tough.” Kessler elaborated further in a television interview. “Biden likes to swim nude both at his Vice President’s residence in Washington and also at his home in Wilmington which he goes back to several times a week … and this offends female Secret Service agents,” he told Fox News’s Sean Hannity. “They signed up to take a bullet for the President as you said but they didn’t sign up to — they certainly didn’t sign up to see Biden naked. It is offensive, it’s abusive.” Who would do such a thing? This is like hiring a maid and walking around the house nude because that’s what you did before you hired the maid. There is nothing wrong with skinny-dipping … in private, and I can sympathize with those who lose their privacy when security is necessary. But no one forced Joe Biden to accept the role of vice president. He knew the deal going in, and to expose his naked body to female Secret Service agents is not only disrespectful and arrogant, it reeks of a perverse exploitation and abuse of power. Naturally, the fake establishment media ignored the story at the time, just as they are now ignoring and even excusing Biden’s well-documented and very creepy predilection for inappropriately touching young women and children. Two women have already come forward to accuse Biden of inappropriately touching them, and there are countless photos and video clips of Biden creeping out women and children with unwanted touching, nuzzling, and kissing. But media elitists such as Meghan McCain, Mika Brzezinski, and Alyssa Milano still defend him. But this has nothing to do with principle on their part. We all know that if even one video existed of President Trump, Clarence Thomas, or Brett Kavanaugh doing this…  …or this…  or any of this… …it would be all over and everyone knows it. Hey, if the media want to fly cover for Creepy Joe now, that’s fine with me. I would much rather this be litigated during the general election.  Follow John Nolte on Twitter @NolteNC. Follow his Facebook Page here.",
      "date": "2 Apr 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Fact Check — Joe Biden: U.S. Forces in ‘Iraq’ Are ‘Being Fired On’ by ‘Assad’s People’",
      "url": "https://www.breitbart.com/politics/2019/10/16/joe-biden-us-forces-iraq-fired-assads-people/",
      "subtitle": "Former Vice President Joe Biden claimed Wednesday night during the fourth Democrat debate that U.S. troops in “Iraq” are “being fired on” by Syrian regime forces.",
      "author": "Kristina Wong",
      "content": " He said, “I would not have withdrawn the troops, and I would not have withdrawn the additional thousand troops who are in Iraq, which are in retreat now, being fired on by Assad’s people.” His comment contained two errors: approximately 1,000 U.S. troops are being withdrawn from Syria, not Iraq, and they are not “being fired on” by Syrian President Bashar al-Assad’s “people.” Biden may have been referring to a recent incident in which Turkish government forces fired artillery that came near a northern Syrian outpost where U.S. forces were located. Biden also claimed that President Trump’s withdrawing most U.S. forces in Syria in the advance of a Turkish offensive is “the most shameful thing that any president has done in modern history” in terms of foreign policy — glossing over the 2003 Iraq War and his own support for it. The Iraq War led to more than 4,500 U.S. forces dead and tens of thousands more wounded. Also, it was executed by President George W. Bush and supported by Biden. Biden later claimed he was immediately against the Iraq War after voting to authorize it in 2002, but FactCheck.org showed that it was three years before he began opposing it. While he was vice president in 2011, the Obama administration also withdrew all U.S. forces from Iraq, which created a vacuum for the rise of the Islamic State in Iraq and Syria (ISIS). The Obama administration also did not support moderate Syrian protesters before the Syrian civil war began, which prompted some to turn to Islamist groups for help, fueling the civil war and ISIS’s numbers in Syria. The Syrian civil war has led to hundreds of thousands of Syrians killed, about eight million Syrians displaced from their homes, a refugee crisis, and terrorist attacks in Europe. Despite this, Biden touted his foreign policy record, stating that “our commanders across the board, former and present, are ashamed.” Actually, only retired commanders — some of whom worked for the Obama administration — have expressed shame. He said, “And the fact of the matter is, I’ve never seen a time — and I’ve spent thousands of hours in the Situation Room, I’ve spent many hours on the ground in those very places, in Syria and in Iraq, and guess what? Our commanders across the board, former and present, are ashamed of what’s happening here.” Furthermore, he stated that he would make it clear to Assad that “he’s going to have a problem” with Turkey and tell Turkey it will pay a “heavy price” for invading Syria. (Trump has already threatened to tank Turkey’s economy and imposed sanctions.) Biden also said he would want U.S. troops to be protected by air cover (which they are as they withdraw from Syria) but said he would “make it clear that they’re not going anywhere.” “I would want those thousand troops to be protected by air cover, those thousand troops that are being — having to withdraw under fire, make it clear that they’re not going anywhere and have them protected and work my way back toward what, in fact, needs to be done, protecting those Kurds. They lost their lives. This is shameful, shameful what this man has done,” he said. Follow Breitbart News’ @Kristina_Wong.",
      "date": "16 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Joe Biden Donors Gather for Emergency Closed-Door Meeting as Campaign Loses Steam",
      "url": "https://www.breitbart.com/2020-election/2019/10/06/biden-donors-gather-for-emergency-closed-door-meeting-as-campaign-loses-steam/",
      "subtitle": "Joe Biden’s top political donors gathered for an emergency closed-door meeting this weekend in Philadelphia, Pennsylvania, as his campaign falls behind rivals in both funds and polling.",
      "author": "Haris Alic",
      "content": " The New York Times was first to report the meeting on Sunday, noting the financiers were treated to a behind-the-scenes view of the campaign’s headquarters and strategy, including a private address by the former vice president. “In a sign of the attendees’ significant financial firepower, Mr. Biden himself addressed the several dozen donors who came to the retreat on Saturday, rallying them for 45 minutes about the months ahead, people there said,” the Times reported. “The campaign kept the session with Mr. Biden behind closed doors, despite pledging to open them to the press.” The meeting comes as the campaign is besieged by questions over Hunter Biden’s business dealings in Ukraine as well as polls showing the former vice president is no longer the frontrunner among 2020 Democrats. Biden, who once led the field by as much 26 percentage points, now trails Sen. Elizabeth Warren (D-MA) in the early states of Iowa and New Hampshire. Adding to the campaign’s trouble is the fact that their fundraising numbers were eclipsed this quarter not only by Warren but also Sen. Bernie Sanders (D-VT) and South Bend Mayor Pete Buttigieg — who polled significantly below the former vice president. Biden’s mounting problems and the emergence of Warren as the most direct threat was not far from the minds of those gathered in attendance in Philadelphia. “We need him to get the nomination because he’s the one who can win,” Denise Bauer, a Biden bundler and former ambassador to Belgium, told the Times. To stress the point, she added that the former vice president’s donors were “going to try to raise every single dollar we can.” It is unclear if such efforts will be successful enough to save the 76-year-old Biden’s third White House bid. Unlike Warren or Sanders, the former vice president’s fundraising has failed to diversify past the top-dollar level. According to the Center for Responsive Politics, more than 2,800 donors have already maxed out to Biden’s campaign since his announcement in late April. Top-dollar donors make up a far higher percentage of Biden’s campaign’s coffers than those of his competitors. In comparison, only 38 percent of the campaign’s funds to date have come from individuals donating less than $200. Such a ratio poses an issue for the former vice president, especially now that his top contributors are prohibited by law from donating again until after he’s secured the nomination. David Kochel, the former chief strategist for Jeb Bush’s failed 2016 presidential bid, explained the problem to Politico on Friday. If you don’t have that perpetual, low-dollar fundraising machine, you can’t compete,” Kochel said. “Biden looks like he can’t compete with Warren, Bernie and Buttigieg. How’s he going to compete with Trump?” Despite Biden’s money woes, the former vice president is also facing scrutiny over his son’s shadowy ties to foreign governments, which have taken center stage in the battle to impeach President Donald Trump. The controversy started last month when Trump suggested the Ukrainian government probe Hunter Biden’s role with Burisma Holdings. The younger Biden joined the Ukrainian oil and gas giant in 2014 around the same time his father was appointed to oversee Obama administration policy in the region. As Peter Schweizer, senior contributor at Breitbart News, detailed in his book Secret Empires: How the American Political Class Hides Corruption and Enriches Family and Friends, Hunter Biden secured the position, which paid as much as $83,000 per month despite having no background in the energy industry or Ukraine. Hunter Biden’s lack of experience, coupled with his father’s influence over Ukraine, immediately raised questions from ethics watchdogs in both the U.S. and Europe about a conflict of interest. Furthering the ethical cloud over the appointment is that it came during the same month that Mykola Zlochevsky, Burisma’s founder, had his assets seized in the United Kingdom for suspicion of money laundering. Some have speculated Hunter Biden’s ascension to Burisma’s board was an attempt by Zlochevsky to curry favor with western leaders to prevent further scrutiny of his business dealings. A brazen attempt would not be totally ill-suited for Zlochevsky. The Burisma founder is rumored to be one of eastern Europe’s top oligarchs, a position obtained while serving in the Ukrainian government under former President Viktor Yanukovych — a staunch ally of Russian President Vladimir Putin. It was during his tenure in government as Ukraine’s minister of natural resources that Burisma received its oil and gas licenses. It is in the context of Burisma and Zlochevsky’s legal troubles that Joe Biden’s political influence has raised the most red flags. The former vice president has particularly drawn questions over his conduct in demanding the Ukrainian government fire its top prosecutor, Viktor Shokin, in 2016. Biden, who has publicly bragged about the firing, reportedly threatened to withhold more than one billion dollars in U.S. aid if the Ukrainian government did not remove Shokin. He has claimed the demand came from then-President Barack Obama, who had allegedly lost faith in the prosecutor’s ability to tackle corruption. Unofficially, though, it was known that Shokin was investigating both Burisma and Zlochevsky for public corruption. It is uncertain if the probe extended to Hunter Biden, although Shokin has recently admitted that prior to his ouster he was warned to back off the matter. Regardless of what occurred, Shokin’s successor dropped the investigation into Burisma and Zlochevsky, allowing the oligarch to return to the country after having fled in 2014. Biden, for his part, has refused to discuss the matter, even lashing out at the media for asking if his son’s work with Burisma posed a conflict of interest during his tenure in the vice presidency. The tactic, however, does not seem to be doing Biden or his campaign any favors. A new poll released on Friday indicates that 57 percent of Americans support the Department of Justice opening an investigation into Hunter Biden’s work abroad. Some of the donors gathered in Philadelphia this weekend, though, saw the issues surrounding Hunter Biden and Ukraine in a different light. Sheila Nix, who once served as chief of staff to Dr. Jill Biden, told the Times the former vice president’s struggles were the result of him having to run two campaigns at once. “He’s running a primary campaign and a general at the same time and I think he’s doing a great job,” Nix said. “It’s a little unprecedented having to do both at the same time.”",
      "date": "6 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Nolte: Report Shows Joe Biden Has Big Vietnam Draft Evasion Problem",
      "url": "https://www.breitbart.com/politics/2019/06/07/nolte-report-shows-joe-biden-has-big-vietnam-draft-evasion-problem/",
      "subtitle": "On top of his old, white plagiarism and serial young-girl-touching problems, Creepy Joe Biden also has a draft evasion problem, according to an InsideSources report.",
      "author": "John Nolte",
      "content": " Naturally, the outlet also attacks President Trump over his own Vietnam-era deferment, but comparing Trump to Biden in this regard, as you will see, is like comparing a gun to a tomato. According the report, after he graduated college in 1968, Biden became eligible for the draft, which could have landed him in combat in Vietnam. What saved him, what earned him a 1-Y draft deferment, was asthma… Asthma, y’all. Asthma. Don’t get me wrong, asthma can be debilitating. Chronic asthma is the worst; it can disable a person. If Biden legitimately suffered a serious asthma problem, his draft deferment is perfectly legitimate. Here’s the problem, though… While Biden was scoring a deferment for “asthma as a teenager,” he was — get this — also scoring touchdowns as a teenager. Biden played football in high school and once went so far as to lie about playing football for the University of Delaware — even though he didn’t, but Biden is the kind of liar who lies about such things. What’s more, InsideSources points out that in his autobiography, Biden makes no mention of asthma, but brags about being “active in intramural sports” while in college, and “recounts an active childhood [and] football exploits in high school.” Worse still, during one summer home from college, as Biden himself has admitted, he worked as a lifeguard, which requires vigorous health in order to pass that test, including a very healthy set of lungs. And then there’s this: One incident from that summer stands out: How Biden had to wrap a six-foot length of metal chain around his arm to face off against a knife-wielding local tough who went by the name “Corn Pop.” “You might cut me, Corn Pop, but I’m going to wrap this chain around your head before you do,” Biden told him. Strong words, but he was a healthy, high school football player who could back them up. Biden and Corn Pop resolved their differences without violence and, according to Biden, became poolside friends. Just six years later, at the height of the fighting in Vietnam, that same poolside athlete avoided mandatory military service due to “asthma as a teenager.” …”asthma as a teenager.” Yep, healthy enough to play football and qualify as a lifeguard, which is no easy task, but still 1-Y when swimming is one of the most strenuous exercises around. Trump haters can laugh all they want at Trump’s “bone spurs,” the reason behind his 1-Y classification, but snickers and cheap shots don’t contradict a bone spur diagnosis. It’s not like Trump was out running marathons at the time. But there was Slow Joe playing football in high school, playing even more sports in college, and qualifying as a lifeguard, all while claiming to suffer the debilitating asthma that meant someone else would have to take his place in Vietnam. Back in 2008, while he was running for vice president, it was reported that Biden received a total of five deferments for asthma. Naturally, the same media that crucified then-Vice President Dick Cheney for his five deferments didn’t care about Biden’s deferments. And we all know why: The media were desperate to make Obama president. After all, why would a media that didn’t care about Obama’s 20 years in a racist church, his associations with domestic terrorists and Louis Farrakhan, care about Biden’s asthma? This time will be different. Biden is running for president, the establishment media see a whole bunch of extreme left-wingers they would like to see beat Biden, and since the dark days of 2008 when the fake news media still held all the levers of information, a whole new media infrastructure has been erected. In other words, we have not heard the last of this, not by a long shot.  Follow John Nolte on Twitter @NolteNC. Follow his Facebook Page here.",
      "date": "7 Jun 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Elizabeth Warren Overtakes Joe Biden in Real Clear Politics Average",
      "url": "https://www.breitbart.com/politics/2019/10/08/elizabeth-warren-overtakes-joe-biden-in-real-clear-politics-average/",
      "subtitle": "Sen. Elizabeth Warren (D-MA) has surpassed Joe Biden (D) in the current Real Clear Politics average, marking the first time Biden has lost his lead since announcing his presidential bid.",
      "author": "Hannah Bleau",
      "content": " The current Real Clear Politics average shows Warren narrowly edging out Biden with 26.6 percent support to Biden’s 26.4 percent support. The change follows weeks of Warren slowly gaining on Biden in both national and early primary state polls. Both candidates hold a double-digit lead over Sen. Bernie Sanders (I-VT), who is currently averaging 14.6 percent. The RCP average also reflects Sen. Kamala Harris’s (D-CA) continued fall, showing Mayor Pete Buttigieg (D) taking her formerly held fourth place position with 5.6 percent support to the California senator’s 4.4 percent. The average shows Andrew Yang (D) in sixth place with 2.8 percent support, followed by Beto O’Rourke (D) with two percent support. The remaining candidates are averaging less than two percent:  Twelve candidates will participate in the Democrat debate in Westerville, Ohio, on October 15.",
      "date": "8 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Joe Biden: ‘Poor Kids Are Just as Bright and Just as Talented as White Kids’",
      "url": "https://www.breitbart.com/2020-election/2019/08/08/joe-biden-poor-kids-are-just-as-bright-and-just-as-talented-as-white-kids/",
      "subtitle": "Former Vice President Joe Biden claimed that “poor kids are just as bright and just as talented as white kids,” while addressing the Asian and Latino Coalition in Des Moines, Iowa, on Thursday.",
      "author": "Haris Alic",
      "content": " “We should challenge these students, we should challenge students in these schools to have advanced placement programs in these schools,” the former vice president said when discussing the need to improve America’s education system. “We have this notion that somehow if you’re poor you cannot do it, poor kids are just as bright and just as talented as white kids.” Biden quickly attempted to clarify his remarks by adding “wealthy kids, black kids, Asian kids” to the end of his previous sentence.  The gaffe comes just as Biden was moving past the recent controversy surrounding his praise of two segregationist Democrats, the late Sens. James Eastland (D-MS) and Herman Talmadge (D-GA). Biden invoked the men, who dedicated their careers to halting the progress of civil rights, at a fundraiser in New York City in June while touting his ability to get “things done” in Congress. The remarks, which were controversial in their own right, only served to underscore his 40-year record of opposing busing to desegregate public schools. Sen. Kamala Harris (D-CA) was quick to rebuke the former vice president over the issue at the first Democrat presidential debate, noting that both men had been allies in his campaign against busing. “It was not only that, but you also worked with them to oppose busing,” Harris said at the debate. “There was a little girl in California who was part of the second class to integrate her public schools and she was bussed to school every day. That little girl was me. So I will tell you that on this subject, it cannot be an intellectual debate. … We have to take it seriously.”",
      "date": "8 Aug 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Donald Trump Trolls Joe Biden on Corruption During His ‘Impeach’ Speech",
      "url": "https://www.breitbart.com/politics/2019/10/09/donald-trump-trolls-joe-biden-on-corruption-during-his-impeach-speech/",
      "subtitle": "President Donald Trump on Wednesday ridiculed Joe Biden for delivering a major speech revealing his support for the impeachment of the president.",
      "author": "Charlie Spiering",
      "content": " “So pathetic to see Sleepy Joe Biden, who with his son, Hunter, and to the detriment of the American Taxpayer, has ripped off at least two countries for millions of dollars, calling for my impeachment – and I did nothing wrong,” Trump wrote on Twitter. The Biden campaign made a big splash of a speech delivered in New Hampshire on Wednesday. “To preserve our Constitution, our democracy, our basic integrity, he should be impeached,” Biden said, accusing Trump of “shooting holes in the Constitution.” Biden’s speech immediately drew mockery from the president as politically calculated. “Joe’s Failing Campaign gave him no other choice!” Trump wrote.  The president also shared a video on Twitter highlighting Biden and his son Hunter Biden’s alleged corruption in Ukraine.  Sen. Elizabeth Warren continues to rise in the polls as Biden’s big polling lead in the Democrat field continues to fall. Biden’s campaign responded to Trump’s comment with a tweet of their own from the former vice president’s account. “Thanks for watching. Stop stonewalling the Congress. Honor your oath. Respect the Constitution,” Biden’s account wrote, adding a taunt about Trump’s tax returns. “And speaking of taxpayers, I’ve released 21 years of my tax returns. You?” ",
      "date": "9 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Joe Biden: Owners Should Be Liable if Guns ‘Not Under Lock and Key’",
      "url": "https://www.breitbart.com/politics/2019/10/02/joe-biden-owners-should-liable-guns-not-under-lock-key/",
      "subtitle": "Democrat presidential hopeful Joe Biden used the October 2, MSNBC / Gabby Giffords / March for Our Lives gun control forum to suggest gun owners ought to be liable if they do not keep their firearms “under lock and key.”",
      "author": "AWR Hawkins",
      "content": " Biden said, “If you left you keys in a car out here and some kid picks that car…and kills somebody driving around the parking lot, you’re liable. Why in God’s name, if you have a weapon at home and it’s not under lock and key, should you not be held liable?” He added, “We should have a federal law making that the case,” as the crowd of gun controllers applauded. Biden also pushed to allow gun manufacturers to be sued, and to outfit firearms with biometric readers. He said, “Right now, we have the technology to go out and make sure no one can fire a pistol, a rifle, any weapon, without their biometric marker on it. That exists, that technology exists.” He did not say whether Secret Service agents should be limited to only using firearms with biometric readers on them. Down Range with AWR Hawkins.  Sign up today! AWR Hawkins is an award-winning Second Amendment columnist for Breitbart News and the writer/curator of Down Range with AWR Hawkins, a weekly newsletter focused on all things Second Amendment, also for Breitbart News. He is the political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com. Sign up to get Down Range at breitbart.com/downrange.",
      "date": "2 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "All Eyes on Michael Bloomberg as Joe Biden Flops in Debate",
      "url": "https://www.breitbart.com/politics/2019/10/16/all-eyes-on-michael-bloomberg-as-joe-biden-flops-in-debate/",
      "subtitle": "Billionaire Michael Bloomberg has signaled he would consider jumping into the presidential race if Joe Biden (D) – who lost his status as the solid frontrunner in recent weeks – falters in the primary.",
      "author": "Hannah Bleau",
      "content": " He cautioned ahead of Tuesday evening’s debate that Democrat candidates need to tell voters how they will practically implement their lofty policy proposals. Bloomberg wrote an op-ed for the Washington Post urging Democrat candidates to explain how they would make their grandiose proposals a reality. The former mayor said it is likely the next president will face a “closely divided Congress.” Because of that, candidates need to explain how they would implement their ideas – such as Medicare for All and their multi-trillion-dollar Green New Deal proposals. “Rarely are the candidates asked, and more rarely still do they talk about, how they would go about achieving their goals,” Bloomberg wrote. “The fact is: A legislative proposal is only as good as the execution plan that accompanies it. And even the best plans must be flexible enough to accommodate necessary changes, to prevent the perfect from being the enemy of the good,” he continued. He added: The presidential aspirants are not short on big ideas. But voters must demand they explain how they intend to move from proposing plans to actually implementing them, including passing them through Congress. Those who dodge the question by speaking of revolution and the bully pulpit aren’t up to the job. The op-ed follows reports of Bloomberg’s rumored reconsideration of a presidential bid. While he announced his intention of staying out of the presidential race due to the “difficulty of winning the Democratic nomination in such a crowded field” in March, Biden’s slow and steady fall has the former mayor rethinking his decision. Bloomberg has told associates that he is considering throwing his hat in the presidential ring of Biden drops out. “Bloomberg is in if Biden is out,” a source, described as a “New York billionaire with ties to Bloomberg,” told CNBC. As CNBC reported: Bloomberg has signaled he’s “still looking at” running for president, but people close him say that the only way he could even go down that path is if Biden’s fortunes suffer so much that he drops out before or during the early stages of the primary. Bloomberg could then enter the race as one of the rare moderates with enough name recognition and campaign funding to make a run. Forbes estimates his net worth at $51 billion, and he was planning to spend over $100 million on a campaign for president if he ran. While Biden has not signaled any intention to drop out of the race, his lackluster debate performance is not expected to elevate his position in the polls. The former vice president failed to have a breakout moment during the three-hour debate and experienced at least seven gaffes, mistakenly pronouncing exponentially as “expodentially,” mentioning Roe. v Wade before correcting himself to the subject of gun sales, and claiming that people are “clipping coupons in the stock market” during a discussion on the economy:  If Bloomberg does, in fact, jump into the presidential ring in coming months, he would likely face questions surrounding his recent praise of China– particularly that Chinese Communist Party chairman Xi Jinping is “not a dictator”:  ",
      "date": "16 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Watch: Trevor Noah Mocks Joe Biden’s Debate Night Defense of Hunter Biden",
      "url": "https://www.breitbart.com/entertainment/2019/10/16/watch-trevor-noah-mocks-joe-bidens-debate-night-defense-of-hunter-biden/",
      "subtitle": "Daily Show host Trevor Noah mocked former Vice President and Democratic presidential candidate Joe Biden over his long-winded response to allegations about his son Hunter’s shady dealings in Ukraine.",
      "author": "Ben Kew",
      "content": " The segment began when CNN host Anderson Cooper asked Biden about an interview that Hunter Biden gave to ABC on Tuesday where he admitted he “made a mistake and showed poor judgment” by accepting a position on the board of a Ukrainian gas company. “My son did nothing wrong,” Biden declared. “I did nothing wrong.” He explained: “Look, the fact that George Washington on the first time he spoke after being elected, that we had to worry about is foreign interference in our elections, it was the greatest threat to America. This president on three occasions, three occasions, has invited foreign governments and heads of government to get engaged in trying to alter our elections. The fact is that it is outrageous. Rudy Giuliani, the president and his thugs have already proven that they, in fact, are flat lying. What we have to do now is focus on Donald Trump. He doesn’t want me to be the candidate. He is going after me because he knows if I get the nomination, I will beat him like a drum.” In his attempt to recap Biden’s meandering answer, Noah said that he understood what Biden meant but that it “took a while for him to get there.” “OK, one minute he’s talking about his son, then George Washington, then something about the seventeenth?” the Comedy Central host remarked. “Joe Biden is the only candidate who remixes his speech while he’s giving it.”  After mocking the number of candidates on the debate stage,  Noah also described the “weirdest part of the night”  as when Kamala Harris (D-CA) “started a real-life Twitter beef” with Elizabeth Warren (D-MA) over Twitter’s refusal to ban Trump from its platform. “I’ll be honest, I kind of understand Warren’s point here,” he explained. “We need Trump on Twitter. It’s the only way we can monitor what he’s up to. Otherwise, he’s doing that shit in secret. You’ve got to think of Twitter as a presidential baby monitor. The whole time you’re looking, you’re like, ‘Hold on, he’s awake and wants to nuke a hurricane, I gotta go!’” Follow Ben Kew on Facebook, Twitter at @ben_kew, or email him at bkew@breitbart.com.",
      "date": "16 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Nolte: Ukraine Fallout Turns Tough Guy Joe Biden into Big Crybaby",
      "url": "https://www.breitbart.com/2020-election/2019/10/10/nolte-ukraine-fallout-turns-tough-guy-joe-biden-into-big-crybaby/",
      "subtitle": "Because he has no good answers for why his ne’er-do-well son Hunter was paid a sweet $50,000 a month — a month! — by a Ukrainian energy company, former-tough guy Joe Biden is going the full-crybaby to kill the story.",
      "author": "John Nolte",
      "content": " So, uhm, what happened to the badass who took on Corn Pop? What happened to the tough guy who was going to beat President Trump like a drum? What happened to the sunglasses and swagger? I’ll tell you what happened… Joe Biden got old. And I don’t mean number-wise. While Clint Eastwood is still knocking them out of the park at age 89, Joe Biden’s eye is exploding, his dentures are falling out, and now he’s ranting and raving at the refs because he’s losing the game. On Thursday, the far-left New York Times published an op-ed written by Breitbart’s own Peter Schweizer, author of the recent bestseller Secret Empires. In the piece, Schweizer uses Biden and Sen. Majority Leader Mitch McConnell (R-KY) as an example of why Congress must pass reforms closing the “glaring loophole [that] provide political families with an opportunity to effectively ‘offshore’ corruption and cronyism.” About Biden, Schweizer lays out the devastating facts: As vice president, Joe Biden served as point person on American policy toward China and Ukraine. In both instances, his son Hunter, a businessman, landed deals he was apparently unqualified to score save for one thing: his father. In December 2013, Joe and Hunter Biden flew aboard Air Force Two to China; less than two weeks after the trip, Hunter’s firm, Rosemont Seneca Partners, which he founded with two other businessmen in June 2013, finalized a deal to open a fund, BHR Partners, whose largest shareholder is the government-run Bank of China, even though he had scant background in private equity. (Representatives of the fund claim that the timing of the deal and the Bidens’ trip to China was coincidental.) Thus far, the firm has invested about $2.1 billion, according to its website. … With the Russian invasion of Crimea in 2014, Joe Biden became point person in Ukraine as well. That same year, Hunter Biden landed a board position with the Ukrainian energy giant Burisma Holdings. Despite having no background in energy or Ukraine, the vice president’s son was paid as much as $50,000 a month, according to financial records. (He left the board in early 2019.) Why would someone with so little experience be able to command such enormous payments? Joe Biden recently claimed, “I have never spoken to my son about his overseas business dealings.” But Hunter Biden admitted to The New Yorker that on one occasion, they had in fact discussed his work for Burisma[.] Biden’s response…? He ran out on his front lawn, shook his fist at the sky, and started yelling at the Times. In a letter addressed to Times executive editor Dean Baquet, Biden’s deputy campaign manager and comms director Kate Bedingfield freaked out. Here’s a taste: What was especially troubling about the Times’s active participation in this smear campaign is that prior to its reporting on the subject by Ken Vogel, this conspiracy had been relegated to the likes of Breitbart, Russian propaganda, and another conspiracy theorist, regular Hannity guest John Solomon. … Despite voluminous work done by the independent press and fact-checkers — including some by The Times — to refute the heinous conspiracy theory that Donald Trump attempted to bully Ukraine into propping-up for him, the paper ran an op-ed by none other than Peter Schweizer, making more malicious claims about the Biden family. This leaves us with a critical question: are you truly blind to what you got wrong in 2016, or are you deliberately continuing policies that distort reality for the sake of controversy and the clicks that accompany it? How sad is that? Biden tried to do the same with Facebook and Twitter after the Trump campaign started running ads about Biden and Ukraine. Twitter has so far said nothing. Facebook told Biden to go pound sand, as did the Times, which released a statement defending the Schweizer op-ed. But is this the behavior of a tough guy? Is this the behavior of a man or a mouse — a mouse with something to hide? If Biden was an actual tough guy, if he still had The Stuff to be president, he wouldn’t be crybabying to the refs to stop the fight and declare him the winner.  If Biden were the swaggering badass he claims to be, he would be out there fighting, he’d be sticking it right back to Trump. Most importantly, he would come out of hiding to address this scandal head on — you know, like a man. Nothing proves this Ukraine scandal is the real deal more than Biden’s cowardice when it comes to addressing it. Even if a reporter is able to ask him a question about the ridiculous amount of money his son was paid by a Ukrainian energy company, Biden just freaks out. Instead of answering the question, he acts like the reporter just skipped in front of him in line at the Blue Plate Special — he starts screaming and crybabying about how the question isn’t fair. Listen, if there were a legitimate reason Hunter Biden was paid $50,000 a month —a month! — by this company, Biden would have already sat down for an extensive interview to lay it all out, or he would have called a press conference to answer all questions. Instead, he is hiding his son in some undisclosed location, when he should have Hunter doing the interview rounds in defense of his own business practices and honor. But Biden can’t do that because there are no good answers, so the old man has been reduced to a big whiner, and like a spoiled child caught red-handed, he only has one option: temper tantrums where he screams, “No, you shut up!” Follow John Nolte on Twitter @NolteNC. Follow his Facebook Page here. ",
      "date": "10 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Joe Biden Launches Campaign Based on Charlottesville ‘Very Fine People’ Hoax",
      "url": "https://www.breitbart.com/politics/2019/04/25/joe-biden-launches-campaign-based-on-charlottesville-very-fine-people-hoax/",
      "subtitle": "Former Vice Preisdent Joe Biden launched his third presidential campaign on Thursday by referring to a debunked claim that President Donald Trump referred to neo-Nazis in Charlottesville, Virginia, in 2017 as “very fine people.”",
      "author": "Joel B. Pollak",
      "content": " In a three-and-a-half minute YouTube video, Biden cited the August 2017 riots as his primary motivation for running against Trump, presenting a version of events that even a CNN contributor has declared to be fraudulent. After referring to the town’s historic role — including Thomas Jefferson, a slave owner — he added, “Charlottesville is also home to a defining moment for this nation in the last few years,” followed by footage of a neo-Nazi procession.  Biden noted that the neo-Nazis in Charlottesville were “chanting the same antisemitic bile heard in the ’30s.” He then added that they were “met by a courageous group of Americans, and a violent clash ensured.” (Among that “courageous group of Americans” were left-wing Antifa extremists who specifically came to Charlottesville to cause violence, and whom even Nancy Pelosi later condemned after they caused another riot.) Biden then cited the debunked “very fine people” claim: And that’s when we heard the words of the President of the United States that stunned the world and shocked the conscience of this nation. He said there were, quote, some “very fine people on both sides.” Very fine people on both sides? With those words, the president of the United States assigned a moral equivalence between those spreading hate, and those with the courage to stand against it. And in that moment, I knew that the threat to this nation was unlike any I had every seen in my lifetime. What Biden said is completely untrue, as the transcript of Trump’s press conference about Charlottesville shows. Trump was referring to protesters against the removal of a statue of Confederate general Robert E. Lee, as well as to non-violent left-wing protesters against racism, and specifically excluded the neo-Nazis from “very fine people” (emphasis added): REPORTER: The neo-Nazis started this thing. They showed up in Charlottesville. TRUMP: Excuse me, they didn’t put themselves down as neo-Nazis, and you had some very bad people in that group. But you also had people that were very fine people on both sides. You had people in that group – excuse me, excuse me. I saw the same pictures as you did. You had people in that group that were there to protest the taking down, of to them, a very, very important statue and the renaming of a park from Robert E. Lee to another name. REPORTER: George Washington and Robert E. Lee are not the same. TRUMP: Oh no, George Washington was a slave owner. Was George Washington a slave owner? So will George Washington now lose his status? Are we going to take down – excuse me. Are we going to take down, are we going to take down statues to George Washington? How about Thomas Jefferson? What do you think of Thomas Jefferson? You like him? Okay, good. Are we going to take down his statue? He was a major slave owner. Are we going to take down his statue? You know what? It’s fine, you’re changing history, you’re changing culture, and you had people – and I’m not talking about the neo-Nazis and the white nationalists, because they should be condemned totally – but you had many people in that group other than neo-Nazis and white nationalists, okay? And the press has treated them absolutely unfairly. Now, in the other group also, you had some fine people, but you also had troublemakers and you see them come with the black outfits and with the helmets and with the baseball bats – you had a lot of bad people in the other group too. Ironically, Biden has his own record of racism to confront. CNN recently exposed how Biden courted the support of segregationists in the 1970s in a campaign to resist “busing,” the mandatory radical integration of schools. In 2007, Biden infamously called Barack Obama “the first mainstream African-American who is articulate and bright and clean and a nice-looking guy” when commenting on his candidacy (long before being invited to join the ticket). In 2012, on the campaign trail, he told a largely black audience that Republicans wanted “to put y’all back in chains.” And since then, Biden has joined other Democrats in courting the support of racist and antisemite Al Sharpton. Biden continued his video by declaring: “If we give Donald Trump eight years in the White House, he will forever and fundamentally alter the character of this nation, who we are, and I cannot stand by and watch that happen.” He also said Trump threatened “our very democracy,” an apparent reference to another recently-debunked hoax — namely, the false claim that Trump colluded with Russian efforts to interfere with the 2016 presidential election. The former vice president apparently planned to launch his campaign directly in Charlottesville this week, but local leaders objected because “some residents [were] unhappy about the scene a tragedy the city would prefer to forget being used as a campaign launch backdrop,” the Washington Examiner reported. Some also “viewed the move as disrespectful and capitalizing on the death of activist Heather Heyer, 32,” who was murdered by a neo-Nazi there. It is unclear why Biden chose to run on a divisive racial hoax, even one that remains dogma among many on the left. Biden may feel vulnerable in a Democratic Party now dominated by identity politics. Indeed, the Associated Press reported Thursday that some “women of color” were “frustrated” by his candidacy. Nevertheless, the fact that Biden is running on an inflammatory, fearful hoax invites questions about who is really trying to divide Americans. Joel B. Pollak is Senior Editor-at-Large at Breitbart News. He is a winner of the 2018 Robert Novak Journalism Alumni Fellowship. He is also the co-author of How Trump Won: The Inside Story of a Revolution, which is available from Regnery. Follow him on Twitter at @joelpollak.",
      "date": "25 Apr 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Official Records Undercut Joe Biden’s Claim of Rallying Support for CFPB",
      "url": "https://www.breitbart.com/2020-election/2019/10/18/official-records-undercut-joe-bidens-claim-rallying-support-cfpb/",
      "subtitle": "Official White House records undercut a claim Joe Biden made during the fourth Democrat presidential primary debate of whipping votes for legislation that created the Consumer Financial Protection Bureau (CFPB).",
      "author": "Haris Alic",
      "content": " During the Democrat debate on Tuesday, Biden and his two main competitors, Sens. Elizabeth Warren (D-MA) and Bernie Sanders (D-VT), traded barbs about who was best prepared to be commander in chief and what sort of vision was required to defeat President Donald Trump. Warren, in particular, cited her tenure, pushing for creation of the CFPB as proof she knew how to use “executive authority” to further her political agenda. Biden, who earlier in the debate claimed to be the “only one on this stage that has gotten anything really big done,” attempted to counter the argument by highlighting his own role in the creation of the CFPB. “I agreed with the great job she did, and I went on the floor and got you votes. I got votes for that bill. I convinced people to vote for it,” the former vice president said. “So let’s get those things straight, too.” Despite the rhetoric, however, official scheduling records from the Obama-era White House dispute Biden’s claims of having rallied support for the legislation. In fact, as the Intercept has reported, on the day of the passage of the Dodd-Frank Wall Street Reform and Consumer Protection Act—which created the CFPB—the former vice president’s schedule notes he was not on the floor of the U.S. Senate. Records show that on the day the bill passed by a vote of 60-39, Biden only had one meeting with a member of Congress’s upper chamber, Sen. Lindsey Graham (R-SC). It is unlikely, though, that Biden was attempting to sway Graham’s vote on the bill because, at the time, the senator was one of the bill’s leading opponents. Biden’s schedule for the rest of the day shows meetings regarding issues such as Iraq and the then-stimulus spending program, but nothing about Dodd-Frank:  As the Intercept noted, not only is there scant evidence to back up Biden’s claim of going to the “floor,” but several of those involved in Dodd-Frank’s passage also have no recollection of the former vice president playing a role. Former Rep. Brad Miller (D-NC), who helped author the bill, even went so far as to say he “cannot recall ever hearing” Biden’s name mentioned as Dodd-Frank moved through Congress:  This is not the first time the former vice president has inflated his role in a particular event for political gain. As Breitbart News reported in August, Biden has repeatedly inflated his role in the civil rights movement of the 1960s.",
      "date": "18 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Maher: Doesn’t Biden Have to ‘Go Away’ to Avoid Hurting Party Like Franken Did?",
      "url": "https://www.breitbart.com/clips/2019/10/18/maher-doesnt-biden-have-to-go-away-to-avoid-hurting-party-like-franken-did/",
      "subtitle": "null",
      "author": "Ian Hanchett",
      "content": " On Friday’s broadcast of HBO’s “Real Time,” host Bill Maher stated that 2020 Democratic presidential candidate former Vice President Joe Biden does have a “Ukraine problem” and didn’t answer the question on that matter in the debate very well. Maher then wondered if Biden has to “go away” to avoid tainting the Democratic Party like former Senator Al Franken (D-MN) did. Maher said, “Joe Biden has a little Ukraine problem too. He didn’t answer that question too well, I thought, in the debate. He didn’t own it. His son was getting 50 grand a month to do nothing in a field he knew nothing about. It’s very swampy. My question is this: Al Franken had to go away for the Democrats. Because they said, well, we have to be like Caesar’s wife on the #MeToo issue. We can’t have any tainting on that, so that the Republicans can’t say, oh, you guys are bad on that too. Doesn’t the same apply to Ukraine and Joe Biden?” Follow Ian Hanchett on Twitter @IanHanchett",
      "date": "18 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Corn Pop’s Revenge: Leftists Move for the End of Joe Biden",
      "url": "https://www.breitbart.com/politics/2019/10/16/corn-pops-revenge-leftists-move-for-the-end-of-joe-biden/",
      "subtitle": "Many pundits joked that when former Vice President Joe Biden gave his final answer in the Democrat debate on Tuesday night in Westerville, Ohio, he missed an opportunity to tell the story of “Corn Pop” again.",
      "author": "Matthew Boyle",
      "content": " So the story from Biden goes, gangster “Corn Pop” represented a serious threat to Biden when he was a lifeguard at a community pool. Corn Pop, who actually was real, supposedly carried a straight razor and after an altercation with young lifeguard Biden threatened to meet him in the parking lot later—so young Biden claims he threatened to wrap a chain around Corn Pop’s head. The whole blowup was over Biden allegedly calling Corn Pop “Esther,” a derisive insult drawn from the swimmer Esther Williams that apparently was akin to calling the gangster a girl. But before things devolved into a razor-versus-chain race war in the parking lot later, Biden says he apologized to Corn Pop for the insult, which defused the situation—and the incident has become part of Biden’s political folklore storyline of being a grand negotiator who can calmly lead in tense political situations, especially those involving race. Though it seems an incredible story, Biden included it in his 2007 autobiography and it was a central part of a dedication ceremony at a Delaware public pool at which Biden spoke in 2017. The NAACP even confirmed the details of Corn Pop and his existence for those questioning it. So when moderator Anderson Cooper at the end of the CNN-New York Times debate on Tuesday night closed down the debate with a question about a unique and different friendship that has shaped their lives, one would have thought the moderators were teeing Biden up for a perfect Corn Pop moment. Cooper said: Last week, Ellen DeGeneres was criticized after she and former President George W. Bush were seen laughing together at a football game. Ellen defended their friendship, saying, we’re all different and I think that we’ve forgotten that that’s OK that we’re all different. So in that spirit, we’d like you to tell us about a friendship that you’ve had that would surprise us and what impact it’s had on you and your beliefs. Cooper went to all 11 other candidates before getting to Biden, who closed it down at the end, giving Biden plenty of time to think about what he was going to say. Instead of telling the story of Corn Pop, Biden opted for a more conventional and boring answer, and one already used by several of the other candidates: He talked about his friendship with the late Sen. John McCain (R-AZ): This is reassuring in the fact that we’re all acknowledging that we have to reach across the aisle, get things done. No other way to get anything done in this country. The two people maybe would surprise you the most were — he’s been mentioned twice, but John McCain. John McCain worked for me when he worked in the Navy, and he was — he was my assigned to me to travel around the world. We became close friends. He became very close friends with my wife, Jill. Visited our home. He was there with his children. And on his death bed, he asked me to do his eulogy. John, I would say to John, ‘John, you didn’t see a war you never wanted to fight.’ And he’d say, ‘You didn’t see a problem you never wanted to solve.’ But he was a great man of principle. He was honorable. He was honorable. Biden finished with typical talking points from his stump speech about why he’s running for president—nothing remarkable, nothing outstanding, and nothing memorable. Some pundits and observers on Twitter laughed about Biden leaving Corn Pop hanging in favor of the safer McCain story, mocking Biden for being unable to read the room.      While this is more of a lighthearted ribbing of Biden, in an unserious and comedic manner—Corn Pop probably was not the right story anyway for the question—it does illustrate a larger problem with the sliding campaign of the former Vice President. He again had no major memorable positive moments on a crowded debate stage for the fourth month in a row. Donald Trump, Jr., President Donald Trump’s eldest son, mocked Biden’s lackluster performance in a tweet by noting that, at least this time in the Ohio debate, Biden’s teeth didn’t nearly fall out—as they almost did in the previous debate.  It seems cruel, but Biden’s teeth did slip and nearly fall out of his mouth in a previous debate, and in a forum his eye exploded, bleeding on live television. Another candidate, Sen. Bernie Sanders (I-VT), suffered a heart attack less than two weeks before this debate, pushing health questions–like whether any of these Democrats are actually healthy enough to run for and serve as president–to the forefront of Americans’ minds heading into Tuesday night. Moderators even asked several of the candidates about these concerns in Ohio’s debate. This all comes as it has been revealed by just-released Federal Election Commission (FEC) campaign finance reports that Biden’s campaign spent more than he raised in funds last quarter, and he keeps slipping in polls behind rivals Sens. Elizabeth Warren (D-MA) and Bernie Sanders (I-VT) and now lags in the fundraising race as well. The bigger story that broke during the debate news cycle in its immediate aftermath is Biden spent nearly $2 million more than he raised last quarter—he raised $15.7 million and spent $17.6 million—while he had less than $9 million cash on hand at the end of September. That puts him at less than Sanders’ $33.7 million, less than Warren’s $25.7 million, less than Mayor Pete Buttigieg’s $23.4 million, and even less than the $10.5 million that the flaming-out Sen. Kamala Harris (D-CA) had.  At a burn rate like Biden’s running, with not much gas in the tank, the former Vice President could be in some serious trouble in attempting to remain near the front of the pack. He’s already lost his frontrunner status, as Warren has pulled ahead of him in most national polling and in almost every early and battleground state except in the South. CNN’s Chris Cillizza called Biden’s funding lapses a “bombshell” revelation multiple times in a post about the matter, writing that it represents a “SIREN” for Biden’s campaign. Factor that together with burgeoning attacks on his son Hunter Biden’s business dealings from the White House and President Donald Trump, as well as a media beginning to be receptive to the criticisms, and Joe Biden has a tougher-than-ever road ahead. Hunter Biden’s interview earlier on Tuesday on ABC did his father no favors by most accounts, and even CNN and JournoList founder Ezra Klein of Vox are now saying there is something to all the questions swirling around him and that Democrats need to be prepared to deal with this. CNN published a fact check after the debate contrasting Biden’s claims he never discussed Hunter’s business dealings with his son with Hunter’s claims he did discuss them with his father.  Klein, meanwhile, laid out in a Vox article how Democrats are woefully unprepared on the Hunter Biden issue should Joe Biden win the nomination, urging Democrats to learn how to talk about it, even if they don’t want to discuss the problems. Klein wrote: A few things are true about the Hunter Biden story. One is that there’s no evidence Joe Biden did what Donald Trump has accused him of doing: pressuring Ukraine to fire a prosecutor to protect his son from investigation. But another is that Hunter Biden poses real problems for Joe Biden’s campaign, and if Democrats pretend otherwise, they’re making a mistake. Many Democrats consider raising the Hunter Biden question unfair to Joe Biden. Why should he have to answer for the legal actions of his adult son? But no one said politics was fair. And if Democrats avoid the issue, they can be certain Trump will not. Biden’s vulnerability here needs to be tested in the primary, when Democrats have other choices, rather than in the general, when they won’t. The debate moderators and other candidates barely touched on Hunter Biden during the debate, and only to brush it aside as a non-concern. But Hunter Biden is hardly the only of Joe Biden’s problems after the debate on Tuesday. There was a particularly memorable moment where, towards the end of the night, both Sanders and Warren  extracted a pound of flesh from Biden from the left—significantly undermining his standing with Democrats. Cooper asked Biden to respond to the broad visions of big, bold change that Warren and Sanders respectively have been laying out: Vice President Biden, just on either side of you, Senator Warren is calling for big structural change. Senator Sanders is calling for a political revolution. Will their visions attract the kind of voters that the Democrats need to beat Donald Trump? Biden replied with a claim he is the only one who has gotten anything substantive actually “done” in Washington: Well, I think their vision is attracting a lot of people, and I think a lot of what they have to say is really important. But, you know, Senator Warren said we can’t be running any vague campaigns. We’ve got to level with people. We’ve got to level with people and tell them exactly what we’re going to do, how we’re going to get it done, and if you can get it done. I’m going to say something that is probably going to offend some people here, but I’m the only one on this stage that has gotten anything really big done, from the Violence Against Women Act to making sure that we pass the Affordable Care Act to being in a position where we, in fact, took almost a $90 billion act that kept us from going into a depression, making us — putting us in a position where I was able to end roe — excuse me, able to end the issue of gun sales in terms of assault weapons. And so the question is, who is best prepared? We all have good ideas. The question is, who is going to be able to get it done? How can you get it done? And I’m not suggesting they can’t, but I’m suggesting that that’s what we should look at. And part of that requires you not being vague. Tell people what it’s going to cost, how you’re going to do it, and why you’re going to do it. That’s the way to get it done. Presidents are supposed to be able to persuade. After a follow-up question from Cooper asking Biden to further specify exactly whom he said was being “vague,” he took a not-so-veiled shot at the Medicare-for-All vision put forward by Warren and Sanders. Biden said: Well, the senator said — she’s being vague on the issue of — actually, both are being vague on the issue of Medicare for all. No, look, here’s the deal. Come on. It costs $30 trillion. Guess what? That’s over $3 trillion — it’s more than the entire federal budget… If you eliminated the entire Pentagon, every single thing, plane, ship, troop, the buildings, everything, satellites, it would get you — it would pay for a total of four months. Four months. Where do you get the rest? Where does it come from? That opened Sanders up to decimate Biden for “working with Republicans” to back endless wars in the Middle East and trade policies that hurt America’s working class: Joe, you talked about working with Republicans and getting things done. But you know what you also got done? And I say this as a good friend. You got the disastrous war in Iraq done. You got a bankruptcy bill, which is hurting middle-class families all over this country. You got trade agreements, like NAFTA and PNTR, with China done, which have cost us 4 million jobs. Now, let’s get to Medicare for all. Let’s be honest. We spend twice as much per person as do the people of any other major country on Earth. And the answer is, if we have the guts that I would like to see the Democratic Party have that guts, to stand up to the drug companies and the insurance companies and tell them that the function of health care is to guarantee care to all people, not to make $100 billion in profit. After back-and-forth between Biden and Sanders in response to Sanders’ smack-down, Warren delivered another brutal blow to Biden. Warren’s reply focused on the creation of the Consumer Financial Protection Bureau (CFPB) in the wake of the 2008 financial crisis, with which she was intricately involved and for which she receives enormous credit among Democrats: So you started this question with how you got something done. You know, following the financial crash of 2008, I had an idea for a consumer agency that would keep giant banks from cheating people. And all of the Washington insiders and strategic geniuses said, don’t even try, because you will never get it passed. And sure enough, the big banks fought us. The Republicans fought us. Some of the Democrats fought us. But we got that agency passed into law. It has now forced big banks to return more than $12 billion directly to people they cheated. I served in the Obama administration. I know what we can do by executive authority, and I will use it. In Congress, on the first day, I will pass my anti-corruption bill, which will beat back the influence of money and repeal the filibuster. And the third, we want to get something done in America, we have to get out there and fight for the things that touch people’s lives. Buttigieg, who had sparred all night with Warren, seemed to sense what was coming next for Biden and attempted to interrupt to spare the former vice president any more pain from the socialists on either side of him. But Biden didn’t take the life raft from South Bend’s mayor, opting instead to further engage with Warren on the 2008 financial crisis. Biden, after fighting the moderators to respond to Warren, attempted to take credit for whipping U.S. Senate votes for the legislation that created the CFPB. “I agreed with the great job she did, and I went on the floor and got you votes,” Biden said. “I got votes for that bill. I convinced people to vote for it. So let’s get those things straight, too.” Big mistake for Biden, as evidenced by the leftists on Twitter ripping him for “yelling” at Warren, lecturing the former college professor on her subject of expertise and claiming she couldn’t have done it without his work whipping votes for her project.     That set Warren up for the line of the night, when Cooper gave the spotlight back to her to reply to Biden. “I am deeply grateful to President Obama, who fought so hard to make sure that agency was passed into law, and I am deeply grateful to every single person who fought for it and who helped pass it into law,” Warren said.  Warren thanking former President Barack Obama, but not Biden, was brutal to Biden. Obama has not endorsed his former vice president in the 2020 Democrat presidential primary, deliberately not supporting his one-time wingman. That void for Biden and lack of support from the Democrats’ most popular star, the former president—despite Biden’s best efforts to closely associate himself with Obama at every turn—cuts like a dagger into his support. It raises all sorts of questions among Democrats, including most importantly about Biden’s electability, about why they should vote for Biden if Obama won’t even endorse and campaign with him. Making matters worse for Biden is that, the morning after this debate, Obama turned around and endorsed Canadian Prime Minister Justin Trudeau’s re-election north of the border—but still refuses to back his own former right-hand guy.  “You did a hell of a job in your job,” Biden interrupted Warren’s answer. “Thank you,” Warren coolly replied to laughter from the audience. She continued: But understand this. It was a dream big, fight hard. People told me, go for something little, go for something small, go for something that the big corporations will be able to accept. I said, no, let’s go for an agency that will make structural change in our economy. “And President Obama said, I will fight for that, and he sometimes had to fight against people in his own administration,” Warren continued before Biden interrupted her again. “Not me!” Biden protested, as Warren refused to credit him with any involvement in the response to the financial crisis. Warren kept plowing through her answer, ignoring Biden’s protests. “We have to be willing to make good, big, structural change,” she said. By Wednesday, Biden seems to have realized just how bad Tuesday’s debate was for his campaign, as before he even left Ohio he was out ripping Sanders and Warren to anyone in the press who would listen, accusing them of “playing Trump’s game and trying to con the American people.” He ripped Sanders and Warren for not being able to explain how they would pay for their mass increases in government benefits and claimed both were disingenuous. Meanwhile, the establishment media keeps playing up Buttigieg and Sen. Amy Klobuchar (D-MN) as candidates they say had big nights, as Democrats desperately look for someone to be able to effectively counter Warren’s and Sanders’ socialist vision—all while establishment-favorite blasts from the past like former New York City Mayor Michael Bloomberg and the 2016 Democrat nominee Hillary Rodham Clinton are discussed as potential Democrat saviors from the leftist socialist abyss.",
      "date": "16 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Gaffe Check: Seven Joe Biden Gaffes During the Fourth Democrat Debate",
      "url": "https://www.breitbart.com/politics/2019/10/15/gaffe-check-joe-biden-flubs-democrat-debategaffe-check-joe-biden-flubs-democrat-debate/",
      "subtitle": "Former Vice President Joe Biden frequently became tongue-tied during the Democrat debate on Tuesday night, continuing his gaffe-ridden campaign for president.",
      "author": "Charlie Spiering",
      "content": " 1: “Expodentially” At one point, Biden mistakenly pronounced exponentially as “expodentially.” At another point, Biden appeared confused when he talked about people “clipping coupons in the stock market” when talking about the capital gains tax. 2. Bernie Sanders as Putin? Biden also unexpectedly gestured at Bernie Sanders when referring to Vladimir Putin. “Excuse me,” Bernie Sanders interupted, “Vladimir Putin, here?” 3. Which son? Biden defended his son Hunter Biden serving on the board of a Ukrainian energy company but failed to differentiate him from his deceased son Beau Biden, who was the Attorney General of Delaware. “Even when my son was the attorney general of the state of Delaware, we never discussed anything so that there would be no potential conflict,” he said, without naming Beau. 4. He chokes! Twitter users also flagged a moment when Biden choked on his spit or coughed during a response.  5. Ending Roe vs. Wade? Biden also stumbled when saying he was “put in the position of ending Roe vs. Wade” before correcting himself to talk about gun sales. 6. Biden vague on the issue of being vague Biden criticized his Democrat rival Elizabeth Warren for being vague, but ended up sounding more vague in the process. “Part of that requires you not being vague,” Biden said. When asked to explain what he meant, he meandered on for several seconds talking about the different costs of healthcare. 7. Age is wisdom When asked about his age, Biden said that his advanced age gave him “wisdom” to be president. “One of the reasons I’m running is because of my age and my experience,” he said. “With it comes wisdom. We need someone to take office this time around who on day one can stand on the world stage, command the respect of world leaders.” Biden struggled throughout the night to demonstrate that his advanced age made him more qualified to be president than any of the younger candidates.",
      "date": "15 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Joe Biden Campaign Selling ‘Beat Him Like a Drum’ T-Shirt",
      "url": "https://www.breitbart.com/politics/2019/10/18/biden-campaign-introduces-beat-him-like-a-drum-t-shirt/",
      "subtitle": "Former Vice President Joe Biden’s 2020 presidential campaign is now selling t-shirts with the phrase “beat him like a drum” — something the Democrat White House contender has vowed to do to President Donald Trump in the general election.",
      "author": "Joshua Caplan",
      "content": " The t-shirt is offered in Unisex & Women’s apparel styles in colors grey or blue with sizes ranging from extra-small to triple extra-large. Priced at $30.00, the t-shirt is available for pre-order to begin shipping on October 29th.  Biden first used the phrase in late September when he snapped at a reporter who asked about President Donald Trump suggesting Ukraine look into allegations of corruption against him and his son, Hunter Biden. “I know Trump deserves to be investigated. He’s violating every basic norm of a president,” Biden told Fox News Channel correspondent Peter Doocy. “You should be asking him the question, why is he on the phone with a foreign leader trying to intimidate a foreign leader,” the former vice president continued. “Trump is doing this because he knows I will beat him like a drum. He’s using abuse of power and every element of the presidency to try to do something to smear me.” “Ask the right questions,” he then demanded of Doocy. During Tuesday evening’s Democrat presidential debate, Biden once again made the pledge to beat President Trump “like a drum” while defending Hunter against accusations of nepotism and corruption related to his son’s work in Ukraine and China. “My son did nothing wrong. I did nothing wrong. I carried out the policy of the United States government in rooting out corruption in Ukraine,” Biden said. “The president and his thugs are lying. He doesn’t want me to be the candidate. If I’m the candidate, he knows I will beat him like a drum.” While the t-shirt demonstrates the Biden campaign is confident it will win the Democrat party, it still has to fend off the insurgent campaign of Sen. Elizabeth Warren (D-MA), who is leading the former vice president in several statewide polls. Although the Biden has latched onto the phrase, it appears Sen. Lindsey Graham (R-SC) used it in 2016 when (erroneously) predicting what then-Democrat nominee Hillary Clinton would do to then-candidate Trump in the general election. “I’d hold my nose and vote for him but we’d get killed. Hillary Clinton would beat him like a drum,” he told CNN.",
      "date": "18 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Joe Biden",
      "url": "https://www.breitbart.com/tag/joe-biden/",
      "subtitle": "null",
      "author": "Haris Alic",
      "content": "                             ",
      "date": "19 Oct 2019, 9:06 AM PDT",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    }
  ]
}