{
  "articles": [
    {
      "title": "Sacha Baron Cohen’s ‘Who Is America’ Season Ends Without Airing Sarah Palin Segment",
      "url": "https://www.breitbart.com/entertainment/2018/08/27/sacha-baron-cohens-who-is-america-sarah-palin-segment/",
      "subtitle": "Sacha Baron Cohen’s Showtime series Who is America ended without airing his interview with Sarah Palin after the comedian purportedly posed as a disabled veteran to gain access to the former Alaska governor and vice presidential candidate.",
      "author": "Ben Kew",
      "content": " According to The Hollywood Reporter, Palin’s interview did not make the final cut of the show, which also features segments with O.J. Simpson and former Democratic congressman Barney Frank. Such a decision was hinted at by Showtime president of programming Gary Levine earlier this month after he said that Cohen has a “very high bar” for what makes the final cut. “All I can say about that is that there are several people who have thrown themselves in front of buses that may not be heading their way,” he told reporters at the time. News that Palin may be involved in the show emerged last month after she revealed that Cohen had duped her by posing as a disabled veteran eager to discuss issues facing the country. “Cohen pretended to be a disabled veteran from Kentucky who was a big fan of Governor Palin,” a source close to Palin told Breitbart News at the time. “He was wearing a necklace made of bullets and had a laptop covered in InfoWars stickers.” “His disguise was basically a caricature of a conservative middle-class Trump voter,” they continued. “He was asking her absurd, racist, homophobic, and sexist questions that were all meant to mock Trump voters as a bunch of ignorant and offensive kooks.” Eventually, Sarah Palin walked away from the interview after Cohen asked her a “horrible” question about whether Chelsea Clinton had been subject to a government-funded sex change. She has since called on CBS and Showtime to “donate all proceeds to a charitable group that actually respects and supports American Vets.” Since its debut last month, Who is America has received generally mixed reviews from critics. Other prominent figures duped by the 46-year-old British prankster include former vice-president Dick Cheney, Alabama Senatorial candidate Roy Moore, and former presidential candidate Bernie Sanders. Follow Ben Kew on Facebook, Twitter at @ben_kew, or email him at bkew@breitbart.com.",
      "date": "27 Aug 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Very Fake News: New York Times Revives ‘Blood Libel’ Against Sarah Palin",
      "url": "https://www.breitbart.com/the-media/2017/06/14/very-very-fake-news-new-york-times-revives-blood-libel-against-sarah-palin/",
      "subtitle": "The New York Times published an editorial Wednesday evening about the attack on Republicans earlier that day in which it claimed falsely that Sarah Palin incited the 2011 Tucson shooting, and that the killer had political motives.",
      "author": "Joel B. Pollak",
      "content": " The Times‘ editorial, “America’s Lethal Politics,” will appear in the print edition of Thursday’s newspaper. It argues that political violence will continue unless President Donald Trump and the Republicans stop opposing gun control. Along the way, the Times claims [original link]: Was this attack evidence of how vicious American politics has become? Probably. In 2011, when Jared Lee Loughner opened fire in a supermarket parking lot, grievously wounding Representative Gabby Giffords and killing six people, including a 9-year-old girl, the link to political incitement was clear. Before the shooting, Sarah Palin’s political action committee circulated a map of targeted electoral districts that put Ms. Giffords and 19 other Democrats under stylized cross hairs. However, there was no evidence of political “incitement.” First of all, the Tucson killer, Jared Loughner, was mentally disturbed and had no political motivations. As even the left-wing HuffPost reiterated Wednesday: “People said Jared Lee Loughner was motivated by politics. Reporting proved them wrong.” Second, Sarah Palin’s map was virtually identical to those used by Democrats for years, depicting targets atop contested congressional districts. At the time, Palin called the false accusations against her a “blood libel,” and for good reason: it was a slander imputing responsibility to her for the deaths of innocents, with the sole purpose of punishing her for her beliefs. The Times goes on to argue that “there’s no sign of incitement as direct as in the Giffords attack” in Wednesday’s shooting. That statement is so completely false that it calls to mind George Orwell’s observation about journalism during the Spanish Civil War: “I saw newspaper reports which did not bear any relation to the facts, not even the relationship which is implied in an ordinary lie.” There is no evidence whatsoever of political incitement in the Giffords case, while there is overwhelming evidence that James T. Hodgkinson, the now-deceased attacker at the baseball diamond, nurtured a vicious hatred of Trump and Republicans and was a fan of left-wing media. And according to eyewitnesses, he asked whether the players were Republicans or Democrats before attacking. That is not conclusive evidence of incitement — at least, not yet — but it is more persuasive than in any other recent case. The Times‘ false equivalence between the two shootings provides a sick excuse for what Hodgkinson did by making it appear to be partially Republicans’ fault. That is worse than “fake news.” It is an effort to exploit a horrific act of violence for the purpose of stoking political divisions, reinforcing the hysteria in which Hodgkinson was steeped. Joel B. Pollak is Senior Editor-at-Large at Breitbart News. He was named one of the “most influential” people in news media in 2016. He is the co-author of How Trump Won: The Inside Story of a Revolution, is available from Regnery. Follow him on Twitter at @joelpollak.",
      "date": "14 Jun 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Documents Appear to Show Todd Palin Filing for Divorce",
      "url": "https://www.breitbart.com/politics/2019/09/09/documents-appear-to-show-todd-palin-filing-for-divorce/",
      "subtitle": "ANCHORAGE, Alaska (AP) — Court documents appear to show that the husband of former Alaska governor and 2008 Republican vice presidential nominee Sarah Palin is seeking a divorce.",
      "author": "Breitbart News",
      "content": " The papers, which provide only initials, were filed Friday by T.M.P. against S.L.P. Todd Palin’s middle name is Mitchell and Sarah Palin’s middle name is Louise. The documents say the couple married Aug. 29, 1988 — the same as the Palins. Birthdates for the two also correspond. The documents say the couple has a minor child identified as T.P.V.P. who was born April 18, 2008. The Palins’ youngest child, Trig Paxson Van Palin, was born that day. Anchorage attorney Kimberlee Colbo is representing T.M.P. and also has represented Dakota Meyer in his divorce from the Palins’ eldest daughter, Bristol. Colbo didn’t immediately respond with comment.",
      "date": "9 Sep 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Exclusive — Sarah Palin: Administration Lies, Soldiers Die. Yes, Hillary, at Every Point ‘It Matters’",
      "url": "https://www.breitbart.com/politics/2016/06/28/exclusive-sarah-palin-administration-lies-soldiers-die-yes-hillary-every-point-matters/",
      "subtitle": "Listening to the Benghazi Committee reveal what we knew — the Obama Administration’s devastating lies cost lives, and at any point it just doesn’t matter to them. Thank you to Congressional investigators for their report.",
      "author": "Sarah Palin",
      "content": " The Administration’s deception is beyond shameful. They sat back and allowed our peacekeepers to die during what they witnessed becoming a suicide mission. In command of the greatest military in the world, yet officials sat back in Washington’s comfort, not allowing our troops to do their job to protect fellow Americans. Hillary left our men behind. Hillary is disqualified from serving as Commander in Chief. The Administration lies and denies in places like Benghazi, which cost innocent American lives. Much like today’s refusal to believe real threats — denying Islam put the “I” in ISIS — they are wrapping America’s children in a suicide vest.",
      "date": "28 Jun 2016",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Exclusive: Sarah Palin on Donald Trump’s First 100 Days",
      "url": "https://www.breitbart.com/radio/2017/04/27/exclusive-sarah-palin-trumps-first-100-days/",
      "subtitle": "Sarah Palin, former Alaska governor and Republican vice presidential candidate, looked at the first one hundred days of President Trump’s administration on Thursday’s Breitbart News Daily with SiriusXM host Alex Marlow.",
      "author": "John Hayward",
      "content": " “I’m extremely pleased, of course, that our new president is in there building the team that he believes he needs in order to fulfill promises to the American electorate, to make America great again, and I’m very, very happy that he’s there,” said Palin. LISTEN:  She said she found the idea of giving a simplistic letter grade to the Trump administration annoying, preferring to say President Trump is doing “very well.” “Remember, those of you who maybe still aren’t aboard the Trump Train but know that the Trump movement had to be ushered in, in order to get rid of the status quo that was harming America, keep doing your ABCs and remember what that was: it was Anybody but Clinton,” she said. “So stick with your little alphabet analogy there. Those who are asking for a grade of this administration, just keep remembering it could have been Clinton.” Palin applauded Marlow’s point that arguing over the fine points of Trump’s policy, and even dealing with some disappointments, should be vastly preferable for conservatives over fighting for their political lives – and even basic constitutional freedoms, like free speech – under a Clinton presidency. She suggested imagining what sort of Supreme Court justice would currently be taking the late Antonin Scalia’s place under President Hillary Clinton. Marlow noted that Palin has been “quite critical in recent days” of President Trump’s pick for Secretary of Education Betsy DeVos. “She said, ‘Common Core now doesn’t exist’ or something, and you went buck wild on her,” Marlow recalled. “I sure did!” Palin cheerfully agreed. “She said that, in fact, Common Core hasn’t really existed for the past couple of years. I would ask, do these politicians, do these elitist bureaucrats, do they even send their children or grandchildren, are they in public schools? When our kids and our grandkids come home and we sit down with them each night, still to this day, and we work with them on their homework, the Common Core curriculum is alive and not well in the classroom.” “If the leader now of the education sector of our country would deny that Common Core is in existence, she needs to try to tell that to our really, really great public school teachers, who still have to explain and kind of apologize to the public school parents – I’m one of them – as to why the curriculum is as confusing and burdensome and less freeing for our teachers, who know what our students need best, as do the parents. Good schoolteachers still have to explain to us that under Common Core, these requirements are quite burdensome and nonsensical,” she said. She accused DeVos of being “really out of touch” for denying all of this was happening. Palin followed up with some of the highlights of Trump’s first hundred days, beginning with the confirmation of Judge Neil Gorsuch to the Supreme Court. “I’m extremely thankful – we all should be – that he’s in there now,” she said. She also praised Trump’s commitment to change President Barack Obama’s “lead from behind” foreign policy, “which made the world a less safe place to be.” “Trump quashed that. He said no more leading from behind. America is that ‘beacon of hope.’ We are a country … of just this perfect storm, if you will, with the natural resources to be developed, with the manpower, and with the intellect, and with the patriotism, the unity that a country needs in order to be so successful, to be great and to be a leader that other countries would wish to emulate. America has all that, and we can put it into play for the greater good of the world by leading, and not leading from behind, which is kind of Orwellian-speak,” said Palin. “Leading again on the global stage and the Supreme Court pick, those are two specifics – but Alex, we need to make sure to remind our friends, our supporters, people who are really tuned in to what’s going on today and get frustrated under any administration. Maybe they’re frustrated with what Trump does, some of the wrinkles that are certainly part of the agenda that we’ve witnessed,” she suggested. “We can never put our faith and our hope in man, in any one man, certainly not a politician,” Palin counseled. “Man is fallible. We’re going to be disappointed if we put all of our hope and faith in one man – a politician, a government that cannot make us happy, healthy, wealthy, and wise. We need to look at the bigger picture here, as you suggested in your opening.” Another highlight of the first hundred days for Palin was the “quote-unquote massive tax cut proposals that will come from the White House.” “I’m extremely happy about that. That’s another promise fulfilled,” she said. “We know that to allow us to be solvent and sovereign, we need to see jobs created. The way that jobs are going to be created and people will be productive again in this country is for tax cuts that will really benefit the middle class, especially the working class. More jobs will be created with tax cuts, so I’m excited about that coming down the pike.” “We have to cut taxes,” she stressed. “Look at that corporate tax rate we have that is, what, second highest in the developed world? Our corporate tax rate certainly is one of the job creation prohibiters that we’re suffering under. So that has to be done, and certainly people with our income taxes, we realize it’s taxation without representation. The government is taking from us the fruits of our labor, and we’re not receiving the services in return that are on par with the amount that they’re taking from us. It’s a given: taxes must be cut in this country, and I would think that everybody knows that.” “But as for it then contributing to an accumulation of debt – you’re right: it’s semantics, and it’s bogus,” Palin said to Marlow’s point that the left controls the language of tax reform and treats tax cuts as an expensive indulgence that must be “paid for” somehow. “It doesn’t have to result in accumulation of debt,” she argued. “We can’t just hand that over to those in government who hold the purse strings and keep spending more and more money that we do not have. We need to ratchet down the size of government. This government overreach in every area of our life that’s getting more and more expensive, we can’t just swallow that and say, ‘Oh, well, that’s just the way it is, and wow, we’re going to have to take more money from the people in order to pay for growing government.’” “It always killed me when I was a city council member, I was a mayor, I was a city manager, I was a governor, and I would watch every 12 months when the government’s budget was due. I’d either help craft it, or it would come across my desk. I would always ask the bureaucrats and the politicians creating these budgets, ‘What’s going on here? Just because 365 days have passed, you just automatically inherently believe that the budget amount has to increase? Why? Are people getting more for the money that you’re taking from them? Has the population grown that much?’” she recalled. “In each level of government, it’s just so inherent that oh, you know, government grows; that’s just the way it is. It doesn’t have to,” Palin contended. Marlow asked Palin about the “war on free speech” conducted by masked thugs at universities, prominently including Berkeley, where he was once a student. “Well, first, it blows me away that you’re from Berkeley. Talk about not drinking the Kool-Aid!” Palin said with a laugh. “These Berkeley students, bless their hearts, they’re hypocrites on steroids,” she said on a more serious note. “It is amazing to me and anybody else with just an ounce of common sense in their veins to ever be able to believe that those who preach tolerance and diversity, and we’re gonna embrace diversity – but Heaven forbid you say something that might hurt our little snowflakey feelings. You know, we’ll melt there down in Berkeley if you say something that we can’t agree with!” “In the end, they’re the most intolerant people if they are going to protest someone who is a bastion of free speech. Ann Coulter is on their side! When they are spewing the free speech rhetoric, she’s saying, ‘Exactly! And here, let’s exercise it! Let me prove to you, you guys prove with me, that we’re all for free speech!’ And yet, they’re so blinded by their hatred for anybody who does not agree just down the line with them on everything that they will not tolerate Ann Coulter speaking her mind,” said Palin. Marlow advised President Trump to resist advice about “moderating” his positions to secure the approval of left-wingers who will never stop hating him – something Palin is well positioned to understand, as the target of an unprecedented campaign of left-wing vilification in 2008. “Amen. Preach it, brother,” Palin agreed. “President Trump needs to realize he can’t win them over. You cannot. He can learn from our mistakes, those of us who have been in that position on a much smaller scale. We have tried to win them over, and it doesn’t work. It bites you in the butt, and it harms those who you have promised to serve.” “Right on, too, in talking about the big tent,” she said to Marlow’s defense of an ideologically diverse Republican Party. “You know, most of us, we come from big-tent families. Our social circles even, and our communities, they’re big tents, and really, we’re better off for it. Talk about diversity and learning from other people’s perspectives that are shared and all that – that’s all great.” “But no, when you are leading an agenda that people have put blood, sweat, and tears forth, to make sure that agenda finally is given an opportunity to be made manifest so that our lives can be made better, you have to surround yourself with people who are obviously going to help the cause and not hurt the cause,” she added. “You cannot surround yourself, one, with a bunch of yes-men. That certainly harms the cause. You will never grow as a leader. You have to be growing as a leader as your constituents will be growing along with you. So you can’t have a bunch of yes-men. Those of us who have been in business and been in politics certainly recognize that,” said Palin. “But also, you have to have those who at least will share your vision. Maybe some of the idiosyncrasies, maybe some of the details in how you’re going to get there, you can argue some of the ways to do that, but the vision has got to be the same,” she emphasized. “Now, do globalists, do big government professional politicians who are in it for a season, not a reason – they’re in politics for a job, for a career, for the money, for the power – do they share the vision of average, hard-working, patriotic Americans who want government out of our lives so that we can be trusted as individuals to run our businesses the way that we know best and to raise our families the way that is best for our families?” Palin asked. “Government, faceless bureaucrats, they don’t know how to do that. They keep screwing it up. Well, globalists and big government people, some in office today under Trump, they believe in that garbage of big government knowing best. That is the antithesis of the vision that those on the Trump Train have, and that Trump Train roared through this country so powerfully, so loudly and adamantly, that there was no stopping it. That’s why I wasn’t surprised when Trump won,” she contended. “So those who don’t share that vision, who are there, quote-unquote, serving our president and the vision, the mission that he is on, that is shared by the majority of the voters – it’s frustrating to us because we do want to sound that warning bell that you can’t win them over. They’re certainly stuck in their ways, and if they give you lip service that they’re there with you – those are the yes-men that we don’t need around our president,” Palin advised. In parting, Palin suggested a mission for Marlow: “I wish you would take the opportunity to get down to Berkeley and speak with your alumni. Go down there and talk to the folks down there about what tolerance really is and how healthy diverse opinions really can be. Talk about the Second Amendment. You would be one, Alex – well, they’d probably get really wee-weed up about it – but you could be a great spokesperson for the cause.” Breitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a.m. to 9:00 a.m. Eastern. Listen to the full audio of the interview above.",
      "date": "27 Apr 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin: Impeachment Threat Making Obama 'Nervous'",
      "url": "https://www.breitbart.com/politics/2014/07/19/sarah-palin-impeachment-threat-making-obama-nervous/",
      "subtitle": "On Saturday, former Alaska Governor Sarah Palin said the impeachment threat is making a lawless President Barack Obama a bit “nervous.”",
      "author": "Tony Lee",
      "content": " A week after Palin called for Obama to be impeached over his lawlessness on immigration on the pages of Breitbart News, two-thirds of Republicans believed that impeachment is justified while a majority of independents felt that Obama has overstepped his Constitutional authority. Speaking at the Western Conservative Summit in Colorado, Palin said “considering articles of impeachment is the check” against a lawless executive branch. Citing Obama’s “dereliction of duty” in enforcing the country’s immigration laws and securing the border, Palin said, “if that’s not impeachable, then nothing is. And if he’s not impeachable, no one is.” “It takes guts to hold them accountable,” she said. “It takes political will.” Palin told Republicans to “don’t be afraid to raise” the impeachment issue because Obama is making “himself a ruler and not a president.” Palin said America had a revolution because “we don’t do kings.” She observed that “these days you hear a lot of politicians denouncing Barack Obama,” saying he’s a lawless and imperial president who ignores court orders, changes laws by executive fiat, and refuses to enforce laws that he just doesn’t like. Palin asked the politicians who are complaining, “what are ya gonna do about it? “Let’s call their bluff,” Palin said. “I’m calling their bluff because we need a little less talk and a lot more action.” Declaring that Obama’s lawlessness is “rocking us to our core,” Palin said that “no serious person can deny that team Obama has not violated and abused the public trust and the Constitution.” Palin listed Benghazi, Fast and Furious, NSA spying scandals, Obamacare lies, the IRS’s targeting of conservatives, the administration’s violation of religious rights, and the Department of Justice’s wiretapping of reporters. “The list of abuses goes on and on,” she said. Palin also mentioned that “high crimes and misdemeanors” does not refer to today’s ordinary criminal charges. She reiterated that the Framers referred to “a dereliction of duty,” and “the first duty of the president is to enforce our laws and preserve and protect and defend our Constitution.” She said Alexander Hamilton said impeachable offenses refer to “the abuse or violation of some public trust.” Hamilton called them “political offenses” because they relate “chiefly to injuries done immediately to the society itself,” Palin said, noting that impeachment is a check against a lawless executive. Palin announced in an op-ed on Breitbart.com that Obama’s “many impeachable offenses” can no longer be ignored. “It’s time to impeach; and on behalf of American workers and legal immigrants of all backgrounds, we should vehemently oppose any politician on the left or right who would hesitate in voting for articles of impeachment,” Palin wrote. As Breitbart News noted, “Palin specifically said Obama’s lawlessness on illegal immigration was the tipping point because it impacted Americans — native-born and legal immigrants — of all backgrounds”: The federal government is trillions of dollars in debt; many cities are on the verge of insolvency; our overrun healthcare system, police forces, social services, schools, and our unsustainably generous welfare-state programs are stretched to the max. We average Americans know that. So why has this issue been allowed to be turned upside down with our “leader” creating such unsafe conditions while at the same time obstructing any economic recovery by creating more dependents than he allows producers? His friendly wealthy bipartisan elite, who want cheap foreign labor and can afford for themselves the best “border security” money can buy in their own exclusive communities, do not care that Obama tapped us out. Have faith that average American workers – native-born and wonderful legal immigrants of all races, backgrounds, and political parties – do care because we’re the ones getting screwed as we’re forced to follow all our government’s rules while others are not required to do so. Many now feel like strangers in their own land. It’s the American worker who is forced to deal with Obama’s latest crisis with our hard-earned tax dollars while middle class wages decrease, sustainable jobs get more scarce, and communities become unrecognizable and bankrupted due to Obama’s flood of illegal immigration. Who’s looking out for the American workers? Who has their backs? Who fights for them? We should. Obama has also been reportedly concerned that his executive actions on immigration can lead to impeachment. He reportedly, in a half-joking manner, told pro-amnesty activists at the White House, “You’re not going to get me impeached, are you?”",
      "date": "19 Jul 2014",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin Endorses Chris McDaniel for Senate in Mississippi",
      "url": "https://www.breitbart.com/politics/2014/03/13/sarah-palin-endorses-chris-mcdaniel-for-senate-in-mississippi/",
      "subtitle": "Framing the Mississippi Senate primary as a “clear fight for the future of the Republican Party against the entrenched interests of the permanent political class in D.C.,” former Alaska Gov. Sarah Palin endorsed conservative Mississippi state Senator Chris McDaniel on Thursday in his upstart bid against six-term incumbent Mississippi Senator Thad Cochran, who admitted that he was unfamiliar with the Tea Party movement that has put the Washington establishment on alert.",
      "author": "Tony Lee",
      "content": "  “The Mississippi Senate race is a clear fight for the future of the Republican Party against the entrenched interests of the permanent political class in D.C. We desperately need new conservative leaders in the U.S. Senate who will serve with passion, intelligence, and integrity.” UPDATE: McDaniel told Breitbart News that Palin’s endorsement will help him and his campaign “end the rule of the permanent political class in Washington, D.C.”: “Governor Sarah Palin’s endorsement is very important in the state of Mississippi. We Mississippians are conservatives, and we share Sarah Palin’s passion for limited government, lower taxes, traditional values, and constitutional liberties. This is a grassroots movement driven by the people of Mississippi, so there’s no question Gov. Palin’s endorsement will help motivate people to get behind this campaign to end the rule of the permanent political class in Washington, D.C.” Palin wrote that McDaniel was “just such a leader” who is “in this race not for career, but for conservative change.” She said he “has a proven record of fighting for conservative principles in the Mississippi State Senate” and “been a champion of limited government, free enterprise, civic participation, reduced tax rates, a strong national defense, and a return to the original checks and balances of the Constitution.” “He’s a proven fighter for the rights of We the People. For example, he’s taken on special interests in defense of our private property rights against the abuse of eminent domain, and he’s introduced legislation to protect our 2nd Amendment rights against federal government overreach,” Palin wrote. McDaniel said that he was “truly humbled that Governor Palin has honored my request for her to join my campaign in this fight for liberty in Mississippi.” “Governor Palin is a true champion of conservative self-reliance that so many Americans and Mississippians identify with and admire,” he said. “We knew we’d need help in this uphill battle against entrenched incumbency in Washington, D.C. and we could not be more thrilled to have the governor’s support.” Cochran has said he was unfamiliar with the Tea Party movement, and he may now realize what that movement is about as Palin, considered the North Star for the conservative grassroots, can galvanize and boost candidates like no other, especially in what is expected to be a low-turnout primary on June 3. “The Tea Party is something I don’t really know a lot about,” Cochran recently told Mississippi television stations. “It’s a free country. We have open opportunities for people to participate in the election process.” Former South Carolina Senator and Heritage Foundation President Jim DeMint has said that Palin’s endorsement has the most impact in GOP primaries. Sen. Ted Cruz (R-TX) has said that he would not be in the Senate were it not for Palin’s endorsement, for instance. Palin urged conservatives to learn more about McDaniel on his website, www.mcdaniel2014.com, and her endorsement is likely to rally conservatives against Cochran, who has been assailed as an appropriator who has not stood up Washington’s fiscal irresponsibility. As Breitbart News has reported, Cochran “has voted on at least 11 occasions to raise the debt ceiling by at least $7.7 trillion over the past 24 years.” Cochran, who has been described by mainstream outlets as a “seasoned appropriator” who is a “spitting image of the Republican establishment,” reportedly planned on retiring after his term but was convinced to run for another because he would gain control of the powerful Senate Appropriations Committee should the GOP pick up six seats in the fall to take back control of the Senate. Even before an establishment PAC associated with former Mississippi Governor and lobbyist Haley Barbour had formed to try to save Cochran’s candidacy by running attack ads against McDaniel statewide, Palin had indicated that she would be looking closely at the Mississippi GOP Senate primary. McDaniel has also been endorsed by Heritage Action, the Senate Conservative Fund, the Club for Growth, and Freedomworks. Palin, after promising to start rolling out endorsements for candidates this week who would go to Washington to fight for conservative values, has endorsed T.W. Shannon for Senate in Oklahoma and Ben Sasse for Senate in Nebraska in addition to McDaniel.",
      "date": "13 Mar 2014",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin: Trump Is ‘Trying to Win’ a Trade War ‘We’ve Been Fighting for Decades’",
      "url": "https://www.breitbart.com/politics/2018/03/05/sarah-palin-trump-is-trying-to-win-a-trade-war-weve-been-fighting-for-decades/",
      "subtitle": "President Donald Trump is responding to a trade war — not starting one — he inherited by pursuing a “level playing field” via tariffs, wrote former Alaska Gov. Sarah Palin on Monday.",
      "author": "Robert Kraychik",
      "content": " Palin pointed to comments made by Breitbart News’s Senior Editor-at-Large Rebecca Mansour last Thursday about Trump’s proposals to combat “economic warfare” waged by China to destroy America’s steel and aluminum manufacturers. China’s predatory pricing of steel and aluminum exports is designed to destroy the financial viability of America’s domestic manufacturers of the metals, said Mansour: What China is doing, they are willing to take a loss on steel and dump steel below the price of what it costs them to make it simply because they want to destroy our industry for a strategic reason. They want the world to be dependent on them. They want to take the market; that’s why they’re dumping steel. This is an act of war. This is economic warfare. “POTUS isn’t starting any trade war… it’s been raging for decades and we keep losing,” wrote Palin. “People MUST understand our nation’s solvency and sovereignty are at stake here.”  The “Trump Doctrine” illustrates the president’s wisdom via his “private sector experience,” wrote Palin: President Trump inherited this trade war, and he’s an atypical politician determined to actually do something to fix the problem. The Trump Doctrine involves finally enforcing rules and standards to level the playing field — which proves the wisdom of private sector perspective brought to the White House. President Trump is consistent on tariffs. He’s preached about fair competition via tariffs for decades, so why all this feigned shock at his recent proposal? No matter though, because middle class Americans concerned about our industrial demise “get it.” And we see the heads exploding over this issue sit atop career bureaucrats, globalists and typical politicians who’ve done nothing to fix trade imbalances… which pretty much says it all. Mansour has praised President Donald Trump’s intention to go “full economic nationalist” by levying tariffs on China to “protect American industry” from China’s dumping of steel and aluminum. Follow Robert Kraychik on Twitter @rkraychik.",
      "date": "5 Mar 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "9 Ways Sarah Palin Was a Trailblazer for Donald Trump",
      "url": "https://www.breitbart.com/politics/2017/07/15/9-ways-palin-trailblazer-for-donald-trump-rise/",
      "subtitle": "President Donald Trump may not be in the White House had former Alaska Governor Sarah Palin not blazed the trail for him.",
      "author": "Tony Lee",
      "content": " This week, Bernie Quigley observed that Palin “was prelude and harbinger” to Trump’s arrival. He wrote in The Hill that he was reading William Strauss and Neil Howe’s The Fourth Turning when Palin appeared on the national stage. And he said then that “it was possible to see the rise of new political archetypes and forms and they are now upon us.” “It was not President Donald Trump that brought the age, although he turned the key. It was Palin. And it was she who brought the reawakened spirit of Andrew Jackson, today associated with the rise of Trump,” Quigley wrote. In 2010, Quigley wrote that the “change that is rising now with Palin” and the Tea Party movement “resembles the rise of Andrew Jackson and the free people of the western regions demanding their place and coming into the country politically.” “No wonder the New York press was afraid of her then. No wonder they are still,” Quigley wrote while discussing Palin’s defamation lawsuit against the New York Times. While others have foolishly and inaccurately written about how New Jersey Governor Chris Christie, who never appealed to conservatives, was “Trump before Trump,” it was actually Palin who paved Trump’s road to the GOP presidential nomination and 1600 Pennsylvania Avenue. As someone who has followed Palin’s political career as closely as anyone, I immediately saw in Trump’s campaign many similarities to Palin. They shared the same enemies who loathed them because Palin and Trump did not need political hacks in the permanent political class to get their message to the voters. In 2016, it was indeed quite telling that Trump made the same enemies Palin did on the right while the legacy media underestimated him like they did Palin while, at the same time, doing all they could to destroy him just like they attempted to do with the former Alaska governor. Here are the top nine ways Palin was a prelude to Trump: On April 29, 2009, Alaska Governor Palin joined Twitter and promptly called out a distorted story—in today’s parlance, a “fake news” story—in the establishment press about her administration. The politician I dubbed “The Great CommuniTweeter” would be immediately mocked and ridiculed by the legacy media and the political establishment for communicating with voters on Twitter and Facebook instead of on their networks and with the help of overpriced consultants. Years later, the same media figures and establishment operatives, who are always light years behind the curve and initially mocked Palin, would be addicted to Twitter and Facebook and use those platforms on a daily basis just like Palin the pioneer had in 2009. During the 2016 election, Trump, like Palin had figured out years before, used Twitter to influence the news cycle, create headlines, and, most importantly, go around the mainstream media’s and the political establishment’s filters to get information and opinions directly to voters. And as Trump has demonstrated with his CNN-WWE Tweet that went around the world, he is more than willing to use Twitter to get his message directly to the people, challenge and distract the “fake news” media, and make the establishment media look foolish and out of touch when they inevitably overreact and make the story all about them. In fact, Trump has said that his use of “social media” is “MODERN DAY PRESIDENTIAL.” He recently told the New York Times’ Mark Leibovich that he will not stop communicating to voters via Twitter. “It’s my voice. They want to take away my voice,’’ Trump told the reporter. ‘‘They’re not going to take away my social media.’’  When Fox News and other outlets released unfavorable polls about Palin leading up the 2012 election cycle, Palin famously dismissed them, saying that “polls are for strippers and cross-country skiers.” She was right. What inside-the-box consultants and equally incurious legacy media dunces have never realized is the importance of “social desirability bias” when unconventional, controversial, or historical candidates are polled. To put it simply, voters may be reluctant to tell pollsters that they actually support someone like Palin or Trump when they actually do because they think such support will render them socially undesirable. Breitbart News—based on interviews with voters around the country and this writer’s personal “focus group” of sorts of working-class friends and their family members whose opinions and impressions of candidates have been over the years uncannily representative of the Reagan Democrat swing voters who voted for Obama and then switched to Trump—wrote extensively about the potential for a “reverse-Bradley effect” during the 2016 election cycle when national polls had Hillary Clinton out in front. Trump even alluded to Breitbart News’ stories on the reverse-Bradley effect multiple times on the stump. Thomas Edsall actually wrote about social desirability bias— “the desire of respondents to avoid embarrassment and project a favorable image to others”—in the New York Times last year as well, concluding that “the simple fact that Trump has beaten the odds so far means that it is not beyond the realm of possibility that he could beat them again.” “If he does take the White House, much, if not all, of his margin of victory will come from voters too ashamed to acknowledge publicly how they intend to cast their vote,” Edsall wrote. And that is exactly what happened. Polls have underestimated the actual support for politicians like Barack Obama, Palin, and Trump, and it seems like their spouses were actually among the few who understood the importance of social desirability bias in polling. Michelle Obama, for instance, knew that black voters who may not have felt comfortable telling pollsters they supported his candidacy would come home to Obama even when polls had him massively trailing Hillary Clinton in South Carolina in the early stages of the 2008 election cycle. Todd Palin also knew that if Palin had run, voters who did not want to tell properly-sounding pollsters that they supported Palin for fear that they would get ridiculed and ostracized would also swarm voting booths to support her. And Melania Trump also knew that Trump’s low poll numbers with the GOP base would rocket up as soon as he actually announced his candidacy. While the mainstream media were mocking Palin, she delivered two of the most important and substantive speeches of the 2012 election cycle that pushed the GOP away from the cronyism and foreign policy interventionism associated with the Bush era. In Iowa, Palin threw down against the corporatism and cronyism associated with the likes of Tom DeLay, Dennis Hastert, and the infamous “K-Street” project that contributed significantly to the GOP losing control of all three branches of government last decade. Palin injected ideas like “crony capitalism” and fighting the “permanent political class” into the political bloodstream in a way other reformers who lacked her wattage and star power could never do. In Indianola, Iowa, in August of 2011, Palin, explaining the important difference between being pro-free markets and pro-big business, said: This is not the capitalism of free men and free markets, of innovation and hard work and ethics, of sacrifice and of risk. No, this is the capitalism of connections and government bailouts and handouts, of waste and influence peddling and corporate welfare. This is the crony capitalism that destroyed Europe’s economies. It’s the collusion of big government and big business and big finance to the detriment of all the rest – to the little guys. It’s a slap in the face to our small business owners – the true entrepreneurs, the job creators accounting for 70% of the jobs in America, it’s you who own these small businesses, you’re the economic engine, but you don’t grease the wheels of government power. So, do you want to know why the permanent political class doesn’t really want to cut any spending? Do you want to know why nothing ever really gets done? It’s because there’s nothing in it for them. They’ve got a lot of mouths to feed – a lot of corporate lobbyists and a lot of special interests that are counting on them to keep the good times and the money rolling along. Three months before, in May of 2011, Palin went to Colorado Christian University in Lakewood, Colorado, and moved the GOP away from neoconservatism to realism. In Colorado, Palin outlined her five-point plan that included: committing forces only when “vital American interests” are at stake; fighting to win with overwhelming force if America has to go to war; having clearly defined goals and objectives before sending troops into war zones; making sure American soldiers are never put under foreign command; and ensuring that sending Americans soldiers is always the last resort. “We are not indifferent to the cause of human rights or the desire for freedom. We are always on the side of both,” Palin said after laying out her doctrine. “But we can’t fight every war. We can’t undo every injustice around the world. But with strength and clarity in those five points, we’ll make for a safer, more prosperous, more peaceful world because as the U.S. leads by example, as we support freedom across the globe, we’re going to prove that free and healthy countries don’t wage war on other free and healthy countries. The stronger we are, the stronger and more peaceful the world will be under our example.” In 2016, Trump ran as a candidate who opposed George W. Bush’s Iraq war and nonsensical interventions abroad. Even Foreign Policy acknowledged Trump’s coherent realism: Trump has little time for either neoconservatives or liberal interventionists; he thinks they allow their belief in American virtue to blind them to both America’s core interests and the limits of American power. He has even less time for multilateralist diplomats: They’re too willing to compromise, trading away American interests in exchange for platitudes about friendship and cooperation. And he has no time at all for those who consider long-standing U.S. alliances sacrosanct. To Trump, U.S. alliances, like potential business partners in a real-estate transaction, should always be asked: “What have you done for me lately?” In his inimitable way, Trump is offering a powerful challenge to many of the core assumptions of Washington’s bipartisan foreign-policy elite. And if mainstream Democrats and Republicans want to counter Trump’s appeal, they need to get serious about explaining why his vision of the world isn’t appropriate — and they need to do so without merely falling back on tired clichés. Trump also self-funded his campaign during the primary to show voters that he would not be beholden to lobbyists and big-money influencers who got the better of many GOP lawmakers in the Bush era when Washington, D.C. officially became the country’s “Boomtown.” Americans who were fed up with cronyism in D.C. and ill-advised adventures abroad that cost too many American lives gave Trump the benefit of the doubt and gave the outsider businessman a chance in 2016. But had the legacy media been paying attention to how much Palin’s words were resonating, they would not have been so surprised and blindsided by Trump’s popularity. Before Trump ran against the D.C. “swamp,” Palin eviscerated the permanent political class and politicians who came to D.C. looking to change it and instead saw the “cesspool of corruption” as a big “hot tub.” Speaking at the Conservative Political Action Conference (CPAC) in 2012, Palin said: Yeah, the permanent political class – they’re doing just fine. Ever notice how so many of them arrive in Washington, D.C. of modest means and then miraculously throughout the years they end up becoming very, very wealthy? Well, it’s because they derive power and their wealth from their access to our money – to taxpayer dollars. They use it to bail out their friends on Wall Street and their corporate cronies, and to reward campaign contributors, and to buy votes via earmarks. There is so much waste. And there is a name for this: It’s called corporate crony capitalism. John Hayward wrote at the time that after “denouncing the cesspool of corruption” in D.C., Palin said it becomes “more like a hot tub” for elected officials after a year or two. “And they’re hopping in and enjoying the Jacuzzi!,” Palin said, adding that it was “time we drain the jacuzzi and throw the bums out with the bath water.” Trump’s promise to “drain the swamp” was one of his most effective catchphrases during the 2016 election cycle that earned him the trust of voters who for decades have distrusted establishment politicians from both political parties.  Establishment Republicans immediately saw Palin as a threat right after Sen. John McCain (R-AZ) lost the 2008 presidential election to Barack Obama. Here’s video of a jealous and threatened then-Texas Governor Rick Perry cutting off Palin’s press conference at a November 2008 Republican Governors Association event when it was obvious Palin was outshining all of them. It took the “professional conservatives” a bit longer (May, 2010) to know that Palin was a threat to them and their ability to influence elections. For months, Erick Erickson and Red State plodded along to help Nikki Haley win South Carolina’s GOP gubernatorial primary in 2010. But Haley was stuck in third until Palin endorsed her in May of 2010. Haley then rocketed to the top of the field, won the nomination, and went on to be South Carolina’s governor.  A Republican operative who worked on a rival campaign told Peter Hamby, who was then at CNN and is now directing news for Snapchat, that Palin’s event alone generated “over a million dollars” in media coverage and “there was absolutely no way when that endorsement came down to break through the news cycle.” “It was an earned media blowtorch,” the GOP operative later had to admit to Hamby. And just like that, the professional conservatives were both jealous and threatened and started to undermine Palin going forward. Palin needed neither them nor the establishment to influence primary elections and raise money. As establishment Republican Haley Barbour told Hamby, Palin could have raised enough money to “burn a wet mule” without the help of consultants had she chosen to enter the 2012 presidential contest. Of course, as always, the GOP establishment and the legacy media were more than thrilled, just like they would be when nearly the exact same group of people who hated Palin became the “Never Trump” movement, when professional “conservatives” who, for various self-serving reasons, wanted Rick Perry to win the 2012 GOP presidential nomination did all they could to needlessly trash Palin and her supporters. When Trump entered the presidential field, the very same establishment Republicans and professional conservatives, proving how clueless they were about GOP voters they demeaned as “low-information” rubes because they were not versed in obscure D.C. minutiae, said Trump would not even get enough support to make the main debate stage. When Trump started to lead in every poll, they collectively lost their minds. Erickson and many of his “Red State” allies in the “professional conservative industrial complex,” many of whom apparently had no issues shilling for Malaysia while not disclosing the payments they received to their readers until they were caught red-handed, joined Glenn Beck and his minions to oppose Trump. Establishment Republican hacks like Ana Navarro and Rick Wilson made common cause with them to form the “Never Trump” movement. The “Never Trump” movement was more about the “Never Trumpers” scratching and clawing to find excuses to get on television and be quoted in legacy media outlets in order for the legacy media to use them as their useful idiots against Trump and his  working-class supporters, whom these professional so-called “influencers” have treated with nothing but disdain. It is fitting that National Review, which was essentially the outlet of choice for Paul Ryan’s and Eric Cantor’s brand of establishment Republicanism, published its foolish “Never Trump” issue, which diminished whatever influence the publication had left with working-class voters after Trump got elected. For many of these professional operatives and “influencers,” many of whom try to relive their junior-high and high-school years in the political world among other dweebs and pipsqueaks, Trump’s rise meant they would not matter as much anymore. And they were not going to lose whatever influence they may have had without a fight. Trump, like Palin, did not need overpriced lemmings and “grundoons” to help him get “liked” by voters. He did not need them to help him get on television or get his message to voters. All Trump had to was hit the “send” button on Twitter. Trump did not even need them for attack ads since Trump neutered his rivals all by himself by naming them “Low-energy Jeb,” “Little Marco” and “Lyin’ Ted.” The Hoover Institution’s Alvin Rabushka explained why the professional “influencers” and operatives detested Trump so much. To put it simply, Trump’s rise to the top of the polls without much campaign spending represented an “existential threat” to the “political election industry.” “You see, it’s not so much that he is running as a Republican that frightens the political establishment,” Rabuska wrote. “It fears that if he wins, others could seek office in the same way. A Trump victory threatens to put the political industry out of business as it is now.” As Breitbart News noted at the time, Rabushka pointed out that “the political election industry is a multibillion dollar enterprise” and “its ranks include the following”: Consultants.\n\nCoaches.\n\nHandlers.\n\nAd Producers.\n\nFocus Groups.\n\nMedia Pundits.\n\nDonors.\n\nLobbyists. He added that “the industry is used to dominating presidential elections” and “it is the go-to crowd that determines who deserves to be a candidate, win each party’s nomination and ultimately secure the presidency. The industry regards itself as uniquely qualified to determine who is qualified to participate in the political process.” Rabushka said they were particularly livid at Trump because he bypassed this exclusive “club”: How dare he intrude in the “club?” How dare he campaign for the presidency without the blessing of the “club?”…How dare he expose his critics? How dare he use social media to bypass the political industry? How dare he draw large, enthusiastic crowds? How dare he speak the language of the American people instead of the prepped, canned language of the political class? Rabushka continued: How did Claudius become emperor of Rome? After the assassination of Caligula, the Praetorian Guard anointed Claudius emperor. “Why,” asked Claudius? “Because,” said the head of the Guard,” without an emperor, there is no need for the Praetorian Guard. Without traditional candidates like Clinton, Bush, Kasich, Huckabee, Christie, Santorum, Pataki and others, there is no need for the Political Establishment’s Praetorian Guard. Trump threatens to undermine the political establishment order of things. To show that “Never Trumpers” are hardly oh-so-principled, it is worth noting that the disastrous vehicle they used (the milquetoast Evan McMullin) to get on television, consultant fees, and quotes in legacy media outlets during the 2016 general election is still in debt. As of May of 2017, McMullin’s campaign owed nearly $700,000 to various political professionals. Before Trump started attacking the “fake news” media, Palin effectively branded the legacy media as the “lamestream media.” The “lamestream media” tried to blame Palin for the assassination attempt on then-Rep. Gabby Giffords (D-AZ), mock her supporters, delegitimize her, harass her family, and work with the usual band of usual idiots in the GOP establishment to falsely try to create a narrative that she was losing her influence. Never mind that every Republican who wanted to run for office was begging for her endorsement behind the scenes while Republicans in elected officer were pleading with her camp behind the scenes to not criticize them. No wonder working-class Americans who supported Palin– the most “box office” figure on the right before Trump–began to see the media as even more of a joke as purportedly “objective” hosts and anchors could not even pretend to hold back the disdain they had for Palin and her supporters. As mentioned above, Palin even used one of her first tweets in 2009 to correct a story in the legacy media that mischaracterized her administration in Alaska. And she ramped up her criticisms against the media as they became more vicious. Palin gave Trump the baton, and Trump has taken it to another level. “The media should be embarrassed and humiliated and keep its mouth shut and just listen for a while,” Trump’s chief strategist Steve Bannon told the New York Times earlier this year. “I want you to quote this. The media here is the opposition party. They don’t understand this country. They still do not understand why Donald Trump is the president of the United States.” Trump, in addition to tweeting the WWE-CNN meme that went around the world, has routinely called out the “fake and fraudulent” media who nitpick at everything and try to find anything they can to delegitimize him. “Their agenda is not your agenda,” Trump recently said of the “fake news” media. “The fake media is trying to silence us but we will not let them. The people know the truth. The fake media tried to stop us from going to the White House, but I’m president and they’re not.”    Before Trump waged his war against Fox News and Megyn Kelly, Palin clashed with the late Roger Ailes and “Bush’s Brain” Karl Rove. Though Palin was a Fox News contributor, Ailes, who favored candidates like New Jersey Governor Chris Christie and Mitt Romney in the 2012 election cycle, strangely went out of his way to undercut his network’s own star while Palin was deciding whether to enter the 2012 presidential contest. Ailes tried to diminish Palin, publicly saying that he hired her solely because Palin was “hot and got ratings.” And according to New York magazine’s Gabriel Sherman, Ailes reportedly said behind the scenes that Palin was an “idiot” and “stupid” and did nothing to “elevate” the conservative movement even though she had been actively moving the movement away from the corporatism and neoconservatism associated with the Bush dynasty. When Palin decided not to run for president, she returned the favor to Ailes, effectively giving him the middle finger and making her much-anticipated announcement in October of 2011 on Mark Levin’s radio show, royally pissing off Ailes in the process. During the 2016 election cycle, Ailes was just as threatened by Trump. Ailes, according to Sherman, thought Trump was “unelectable” and felt as if he had a duty to “save the country” from Trump. When Megyn Kelly, the talent whom Ailes had inexplicably tried to promote as the network’s face, tried to sandbag Trump during the first GOP presidential debate, all hell broke loose. And it was as if Fox News’ viewers who reluctantly gave the network the benefit of the doubt when it attacked Palin, supported amnesty, and hired CNN retreads said, “ENOUGH!” As Sherman reported, “virtually 100 percent of the emails were against Megyn Kelly” after the debate, and Ailes was “not happy” that “most of the Fox viewers were taking Trump’s side.” Fox News’ battle with Trump showed how out of touch the network’s complacent executives were with their core viewers, many of whom watched the network because it was simply the least offensive channel on television where they could get news. As some have semi-jested, Fox News viewers even kept their televisions on after Bill O’Reilly’s show and before Sean Hannity’s while they were doing laundry, dishes, housework, or taking out the trash. And in an age when more Americans were getting news from online outlets, Trump showed that Fox News was nowhere near as influential as it had been during the last decade before new and social media gave voters more ways to get their news In 2010, when the GOP establishment feared Palin would run away with the nomination without having to kowtow to any of them, Barbara Bush threw shade at Palin when she said she hoped Palin would stay in Alaska. “I sat next to her once, thought she was beautiful and I think she’s very happy in Alaska — and I hope she’ll stay there,” Barbara Bush said. Palin, never afraid to take on the party’s sacred cows, slammed the Bushes for being “blue bloods who want to pick and chose their winners instead of allowing competition to pick and choose the winners.” Radio host Laura Ingraham pointed out then that the “elites” like the Bushes were trying to kneecap Palin. Palin also immediately clashed with “Bush’s Brain” Karl Rove, Bushism’s top public advocate who reportedly had not “been very nice” to Palin “from day one” at Fox News, according to Sherman. Make no mistake about it. The Bushes saw Palin as a threat because they knew she would do exactly what Trump ended up doing–eviscerating Bushism.  In 2016, “low energy” and pro-amnesty Jeb Bush’s $100 million war chest could not get him any traction against Trump, who symbolically pummeled him while eviscerating any notion that Bushism would be the future of the GOP. While some “Never Trumpers” who never understood Ronald Reagan’s true appeal want to convince people that Trump moved the GOP away from Reaganism, what Trump’s 2016 GOP primary victory and White House victory effectively did was finish what Palin started by driving a stake straight through the heart of Bushism.   After Mitt Romney lost the 2012 election because Reagan Democrats who voted for Obama in 2008 but were disillusioned with Obama four years later could not get themselves to even vote for Romney while holding their noses, the geniuses at Reince Priebus’ and Sean Spicer’s Republican National Committee commissioned a terribly-named “autopsy” report in which the only policy recommendation was amnesty for illegal immigrants. Palin, like Breitbart News, fiercely opposed this nonsense. And she slammed the Gang of Eight’s efforts to pass comprehensive amnesty legislation. She was fiercely critical of Obama’s executive amnesties as well. Palin was so lived that she penned an exclusive column for Breitbart News in July of 2014 in which she called for Obama’s impeachment. “No mas,” she said of Obama’s executive amnesties. On the pages of Breitbart News, Palin blasted Obama’s friendly wealthy bipartisan elite, who she said want “cheap foreign labor and can afford for themselves the best ‘border security’ money can buy in their own exclusive communities,” for not caring about working-class Americans. “It’s time to impeach; and on behalf of American workers and legal immigrants of all backgrounds, we should vehemently oppose any politician on the left or right who would hesitate in voting for articles of impeachment,” Palin declared. Palin also said in that Breitbart News column that “without borders, there is no nation” and mentioned that many in America now “feel like strangers in their own land.” As Breitbart News Editor-at-Large Joel Pollak has pointed out, not only did Trump highlight illegal immigration during his presidential launch, Trump rocketed to the top of the GOP field nearly a week after Trump met with the victims of illegal immigrant families after an illegal immigrant murdered Kate Steinle in San Francisco, a city the murderer sought out because it was a sanctuary city. Trump never looked back and his promise to build the wall helped him win over working-class voters in the Rust Belt. In 2015, Breitbart News reported on polling that found that a majority of Americans felt like “strangers in their own country.” And a post-election study published in the Atlantic magazine found that nearly half of white working-class voters feel like “strangers in their own land.” Repeatedly on the stump, Trump says that America will not be a country if it does not have borders. Trump won the election while not compromising on illegal immigration, and he even did better among minorities than Romney. In addition, he galvanized working-class white voters, many of whom had either voted for Obama or had not voted in a long time. In fact, a post-election Atlantic/Public Religion Research Institute study found that that these voters who felt like “strangers in their own land,” who also felt the “U.S. needs protecting against foreign influence,” were 3.5 times more likely to favor Trump than those who did not share these concerns.  Trump’s celebrity made him a much more powerful candidate than Palin and allowed him to get his message across more effectively and to a wider audience than Palin could have had. It also insulated him better from attacks and criticism while allowing him to more ruthlessly attack the legacy media. But make no mistake about it, opposing illegal immigration allowed Palin and Trump to galvanize voters who wanted to send a loud and clear message about the importance of melting-pot Americanism (instead of salad-bowl separatism). By supporting Palin and voting for Trump, they were loudly–or silently–voting for E Pluribus Unum (“Out of many, one) instead of Al Gore’s Ex Uno Plures (“Out of one, many”).",
      "date": "15 Jul 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "7.0 Quake Damages Sarah Palin’s Home: ‘Family Is Intact’",
      "url": "https://www.breitbart.com/politics/2018/11/30/7-0-quake-damages-sarah-palin-home-family-intact/",
      "subtitle": "Former Alaska Gov. Sarah Palin’s family survived Friday’s 7.0 earthquake, but their home did not, Palin said after the quake.",
      "author": "Michelle Moons",
      "content": " Palin asked for prayers for Alaska following Friday’s massive 7.0 earthquake. “Our family is intact – house is not…” Palin tweeted. “I imagine that’s the case for many, many others. So thankful to be safe; praying for our state following the earthquake:  The Palin family lives in Wasilla, Alaska. The quake was measured at a 6.6 magnitude early on but soon thereafter was updated to a 7.0 magnitude event. Pictures and video of massive damage began streaming out showing trashed newsrooms and crumbled roads.   Video of a courtroom taken during the event showed some of the massive and prolonged shaking:  The National Tsunami Warning Center issued a warning for coastal southern Alaska that was later lifted. Michelle Moons is a White House Correspondent for Breitbart News — follow on Twitter @MichelleDiana and Facebook.",
      "date": "30 Nov 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Exclusive—Sarah Palin Condemns ‘Sick Audacity’ of Kathy Griffin’s Trump Beheading Photo",
      "url": "https://www.breitbart.com/entertainment/2017/05/30/exclusive-sarah-palin-condemns-sick-audacity-of-kathy-griffins-trump-beheading-photo/",
      "subtitle": "Former Alaska Gov. Sarah Palin condemned comedian Kathy Griffin for photographing herself holding up President Donald Trump’s severed head on Tuesday, saying Griffin is “sick.”",
      "author": "Katie McHugh",
      "content": " “No one should be shocked at the sick audacity of sick characters. Kathy is a hurting individual. She needs help,” Palin told Breitbart News. “Can you imagine if the subject of such an outrageous visual was a liberal? Obviously, media would be unhinged and uncontained in response.” Griffin told a left-leaning blogger she had herself photographed holding the president’s blood-soaked and severed head because she was upset about comments he made during the GOP primary season. “She said they were putting together a Trump mask and that led her to think of Trump’s infamous statement early on in the primary,” blogger Yashar Ali tweeted Tuesday. “The ‘blood coming out of her eyes, blood coming out of her ears, blood coming out of her wherever’ statement.” After the attempted assassination of Arizona Democratic Rep. Gabrielle Giffords in 2011 in a shooting that left six dead, the Left launched a full-out assault on Palin, trying to blame her for “inspiring” the severely mentally-ill shooter’s actions.  A political action committee supporting Palin had released a Facebook graphic displaying crosshairs on congressional districts where Tea Party candidates could compete in the 2010 midterm elections. “We never imagined, it never occurred to us that anybody would consider it violent. We never ever, ever intended it to be gun sights,” SarahPac spokeswoman Rebecca Mansour, now senior West Coast editor at Breitbart News, told ABC News at the time. Palin blasted the media and the Left for trying to smear her as an enabler of a mass-murderer. “If you don’t like a person’s vision for the country, you’re free to debate that vision. If you don’t like their ideas, you’re free to propose better ideas. But, especially within hours of a tragedy unfolding, journalists and pundits should not manufacture a blood libel that serves only to incite the very hatred and violence they purport to condemn. That is reprehensible,” Palin said. Despite further Democratic backlash against Palin’s use of the term “blood libel,” then-Harvard Law Professor Alan Dershowitz said Palin’s comments were not at all “improper.” “There is nothing improper and certainly nothing anti-Semitic in Sarah Palin using the term [blood libel] to characterize what she reasonably believes are false accusations that her words or images may have caused a mentally disturbed individual to kill and maim,” Dershowitz told Breitbart News’ Big Government. “The fact that two of the victims are Jewish is utterly irrelevant to the propriety of using this widely-used term.” Griffin said she does “not condone” violence Tuesday while joking about displaying the president’s severed, bloodied head. “I caption this ‘there was blood coming out of his eyes, blood coming out of his… wherever’ Also @tylershields great Photog/film maker,” Griffin tweeted Tuesday.",
      "date": "30 May 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Breitbart",
      "url": "https://www.breitbart.com/",
      "subtitle": "null",
      "author": "Hannah Bleau",
      "content": "                                 ",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin: Big Luther Got His Senate Seat from Corrupt ‘Quid Pro Quo’ – ‘an Old Eskimo Term for That Which Fertilizes the Swamp’",
      "url": "https://www.breitbart.com/politics/2017/09/22/sarah-palin-big-luther-got-senate-seat-corrupt-quid-pro-quo-old-eskimo-term-fertilizes-swamp/",
      "subtitle": "Former Alaska Governor Sarah Palin blasted U.S. Senator Luther Strange for his appointment to his temporary Senate seat by former Alabama Governor Robert Bentley. The appointment by Bentley, who later resigned over an ethics scandal, has been under scrutiny since Strange, then-state attorney general, oversaw the Bentley investigation.",
      "author": "Breitbart News",
      "content": " From AL.com‘s Howard Koplowitz: [Palin] also said Strange’s appointment by then-Gov. Robert Bentley amounted to “quid pro quo,” referring to the then-attorney general office’s investigation of Bentley involving the potential use of state resources to cover up an affair. “Getting the job of the temporary Senate seat, being handed the job by the politician who’s now gone because corruption, whatever,” Palin said, trailing off. “I don’t know what you guys call it, but up in Alaska we call it quid pro quo, which I think is an old Eskimo term for that which fertilizes the swamp.” Palin drew connections between Strange and Senate Majority Leader Mitch McConnell, who is backing the incumbent in next week’s Republican runoff and whose aligned super PAC has spent millions of dollars attacking Moore. “Make no mistake: Big Luther is Mitch McConnell’s guy,” she said. “On Tuesday, you get to tell [the establishment], ‘Hey, our movement isn’t over and it’s not slowing down.” Read the rest of the article, here. ",
      "date": "22 Sep 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin: President Trump Should ‘Call for the Unshackling of the Political Bands Tying Us to the UN’",
      "url": "https://www.breitbart.com/radio/2016/12/29/palin-trump-call-unshackling-political-bands-tying-us-u-n/",
      "subtitle": "On Thursday’s Breitbart News Daily on SiriusXM, former Alaska Governor and 2008 vice presidential candidate Sarah Palin talked with Breitbart London Editor-in-Chief Raheem Kassam about the return of national sovereignty that began with Brexit and might lead to a United States withdrawal from the United Nations in the wake of its anti-Israel vote.",
      "author": "John Hayward",
      "content": " “I think many of us have called for America to really step up and consider what it is that we are funding and supporting via the UN, and how it works so hard really against U.S. interests, and just saying – look what the U.K. just did,” Palin said, referring to the Brexit vote. “This is such an encouraging time, where it’s not just us, but those across the pond, too, are understanding that their nation’s sovereignty and security are on the line here, with the ties that bind us to interests that really don’t further our agendas,” she declared. “So when the U.K. made its move, it was just another reason to call yet again for the U.S. to get the heck out of the UN and get the UN out of the U.S. Let’s get going on putting America first so that we can sweep our own porch before telling other nations how to sweep theirs,” she advised. Palin said it was unnecessary for the United States to import the dysfunctional bureaucracy of the United Nations since homegrown bureaucracy is already doing such a good job of messing up American life. “They can spy from anywhere, so they don’t need to be right underfoot, the UN, for us to spy on them. We’ll know what they’re doing,” she jovially assured Kassam. “Unfortunately, the UN’s presence even, in the U.S. – all that has done is said to people like John Kerry and his desire to essentially cave to other countries, he essentially is inviting other countries to exercise veto power over us, over U.S. national security measures,” Palin continued on a more serious note. “He said during a debate some years ago, he said that our security measures must pass a ‘global test.’ So the presence of the UN here, unfortunately, just creates more fertile ground for leftist globalists like John Kerry to grow in their desire to make the U.S. continue to fund the lion’s share of this globalist circus – where bad players, including dictators, they’re going to keep griping, and complaining, and whining, and attacking us for not bending over backwards enough for their liking. Unfortunately, that’s what the UN presence here has been doing,” she said. “What does it say about the United States in 2016, at the tail end of 2016, that you have an administration not just willing to stab one of its most important global allies, Israel, in the front, but is being led, supposedly – listen, I’m going by what they’re saying; they said they didn’t lead, so they have to have been led – by countries like Venezuela?” Kassam asked. “That’s a great point,” Palin replied. “I don’t think people have been understanding that – that either our leaders, unfortunately, are caught lying in regards to orchestrating this non-supportive measure – to say the least – of Israel, or yeah, we’ve been led by bad characters that certainly do not have America’s nor Israel’s interests at heart.” “Speaking of Israel, it’s almost laughable, if it weren’t so dangerous, that the Left now is so obsessed with national borders, obsessed with Israel’s borders,” she pointed out. “Their defense of what they have just done, in stabbing Israel, is based on their supposed desire to see borders enforced. Since when? They never have seemed to understand the concern that we have, nor the purpose of a nation’s borders. They don’t care about America’s porous borders continuing as is.” Palin said there were two ways to look at how the incoming Trump administration should handle the United Nations. “One is, I called for our next president, Donald Trump, to call for the unshackling of the political bands tying us to the UN,” she said. “By exiting the UN, where injustice is actually rewarded, we then will be able to uphold America’s reputation as the leader, and as the kind and compassionate and generous nation that we are – as the nation sharing values that, when emulated by any other nation, can bring justice and equal rights to any other nation.” “So I call upon President-elect Trump to lead that charge. But the other way to look at this is, is it really going to be one person, one leader’s responsibility to do so? Or is this going to be part of the revolution that we have just seen, that did elect Trump?” she continued. “It’s We the People needing to step up and do it. It’s our government. It’s our money funding the lion’s share of the globalist circus. It’s We the People needing to rise up and make this a part of the revolution that we have just so benefited from.” Palin said this urgent need for the people to regain control of national affairs was her most important message at the close of 2016. “Our government, our bureaucrats and our elected leaders, work for us,” she stressed. “We are the ones that need to call for this, that the UN shackles be next on the chopping block.” “Things that have really resonated with me and I’m sure so many other Americans – remember back some years ago, when our troops were required to wear the UN insignia on our U.S. uniforms in the military, how really appalling that was?” she recalled. “Because we know what it is that our troops and our vets have sacrificed for, in order to put America first, so that we can be that bright shining light – all the good things that America is for the world.” “To have symbolically an insignia even on our uniforms required, sends that message or paints that picture that we are underneath globalist rule,” Palin argued. “Things like that resonate with me, and I think other average everyday Americans. Things like that are really coming to the forefront now. We’re remembering those things. We’re understanding that there is something we can do about this, in directing our government to get out of an organization that would require such a thing.” Breitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a.m. to 9:00 a.m. Eastern. LISTEN: ",
      "date": "29 Dec 2016",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin: ‘Grateful to See the Church Step Up’ for Donald Trump Because ‘Eight Years Ago, I Felt They Didn’t’",
      "url": "https://www.breitbart.com/radio/2016/11/25/sarah-palin-grateful-see-church-step-donald-trump-eight-years-ago-felt-didnt/",
      "subtitle": "During her special appearance on the holiday edition of Breitbart News Daily, former Alaska governor and 2008 vice presidential candidate Sarah Palin talked about her sense of “divine providence” in the 2016 election, and for the first time shared her feelings of disappointment that the religious community didn’t stand up more forcefully for her when she came under sustained attack from the Left in ‘08.",
      "author": "John Hayward",
      "content": " SirusXM host Alex Marlow asked Palin if she thought divine providence played a role in the election outcome. “No doubt, divine providence played a huge role in this election,” she replied. “I will boldly proclaim that. I saw it first-hand. I was there on the campaign trail. I saw how things were changing. I saw more and more people’s eyes open, and I think so much of that was based on the church in general, those people of faith who were praying to God that people would wake up.” LISTEN:  “Remember, our Founders dedicated this land, this new country that would be America, this idea of America, dedicated it to God,” she pointed out. “If I were President, I’d re-dedicate us to God. When I was governor I proclaimed that, the state of Alaska, this is yours, Lord. May your will be done here. We need to do that again in America.” “Prayer warriors across the country, people who perhaps had never expressed their faith in a higher being before, knew that Jeez, we got to be on our knees asking for a change here, because we’re going down the wrong road. I was so grateful to see so many people step up in that realm,” Palin said. She added a personal note, something she said she’s never talked about in public before: “I was very grateful to see that the church stepped up, because eight years ago, I felt that they didn’t. Besides the attacks on my family and supporters, the most hurtful thing about the election, the vilification, the marginalization, the ridicule that hit us – my family and me, eight years ago – was that I didn’t feel that the church did circle the wagons and step up boldly and say, ‘What? No, that’s not what she’s saying,’ or ‘That’s not what she represents.’ Because some of them knew me.” “A lot of these famous pastors, and people all over the country, right after the election were sending me their secret confidential little love notes about, ‘Oh, you know, my heart was with ya, and you know if there’s ever anything I can do for you, just let me know, because I believe in you, and I believed in you during the election, I’m so sorry what you went through.’ And would sit there reading this stuff, saying, ‘Well, where were you? Why didn’t you step up? You’re going to have to step up next time, or that next person is going to go down too,” she remembered sadly. “So yes, thank God. Literally, I’m thanking God that this go-around, enough pastors, enough congregations, enough people who don’t even ever get in the four walls of a church, but know there is greater purpose in our lives and there is a greater being who has everything in His hands — more of the Church stepped up, prayed about this very hard (and they need to keep praying about it). They did their job,” Palin concluded. She thought it was fair to ask if there should be career consequences for pundits and analysts who got everything wrong in the long prelude to the 2016 election, especially given their enthusiasm to “crucify those who get it right.” “Let’s just accept that it’s going to go on, and allow then our strength to be made manifest when we realize, okay, they’re going to keep getting it wrong, and they’re going to keep trying to crucify us,” she recommended. “So what? Life’s not fair. There are more of us than there are of them. There really are.” “They are very vocal, those who want to transform America and take away your freedom of speech. They’re not the majority. The majority of Americans are right on target in where we want to go with liberty and all of our freedoms. So let’s hang on to that, knowing that good, that’s a tool for empowerment right there, is knowing what the numbers are,” she urged. Breitbart News Daily airs on SiriusXM Patriot 125 weekdays from 6:00 a.m. to 9:00 a.m. Eastern. Listen to the complete audio of Palin’s interview above.",
      "date": "25 Nov 2016",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin on Florida School Shooting: ‘We Need to Discuss the Failure of the FBI,’ Not Second Amendment",
      "url": "https://www.breitbart.com/radio/2018/02/17/palin-florida-school-shooting-we-need-discuss-failure-fbi-not-second-amendment/",
      "subtitle": "Former Alaska Gov. Sarah Palin offered comments about Wednesday’s mass murder at a Florida high school when she spoke with Breitbart News’s Senior Editor-at-Large Rebecca Mansour on SiriusXM’s Breitbart News Tonight on Friday. “It’s not a Second Amendment gun issue at all,” Palin said, adding, “What needs to be discussed is the failure of the FBI.”",
      "author": "Robert Kraychik",
      "content": " Incompetence at the FBI — not agitation against the Second Amendment — should be a national focus related to the mass shooting in Florida, said Palin. Adding to that assertion, Palin stated, “What needs to be discussed is the failure of the FBI. This kid who murdered all these innocent people could not have waved more red flags in front of law enforcement’s face – all those things that he did with posts, with his threats. Law enforcement called 39 times in the last number of years at his family’s home. There were so many red flags. I’m embarrassed for the FBI. The rank and file guys and gals, they work so hard. It’s the top brass. It’s a matter of priorities in the FBI, and that’s where I think the discussion needs to go.” Since 2010, local law enforcement had been called to the family home of shooter Nikolas Cruz, according to CNN: Broward sheriff’s deputies were called to the Cruz family home 39 times since 2010, according to documents obtained by CNN. The sheriff’s office received a range of emergency calls that included reports of a mentally ill person, child/elderly abuse, a domestic disturbance and a missing person. Broward County Sheriff Scott Israel said Friday there were 20 calls for service over the past “few years” pertaining to Nikolas Cruz. Cruz regularly expressed his interest in violence and mass murder, both online and in person. One acquaintance who knew Cruz from elementary school spoke with Miami’s CBS affiliate: “He recalled Cruz stealing peoples’ [sic] mail, throwing rocks at cars and tormenting animals. He described one incident in which he said Cruz “cornered a squirrel and was trying to throw rocks at it and kill it.” Cruz also regularly introduced himself to people as “a school shooter.” His online comments include, “I wanna shoot people with my AR-15” and “Im going to be a professional school shooter.” Florida Gov. Rick Scott called on FBI Director Christopher Wray to resign for “failure to take action” to prevent Cruz’s mass murder, issuing a statement: The FBI’s failure to take action against this killer is unacceptable. The FBI has admitted that they were contacted last month by a person who called to inform them of Cruz’s “desire to kill people,” and “the potential of him conducting a school shooting.” Seventeen innocent people are dead and acknowledging a mistake isn’t going to cut it. An apology will never bring these 17 Floridians back to life or comfort the families who are in pain. The families will spend a lifetime wondering how this could happen, and an apology will never give them the answers they desperately need. We constantly promote “see something, say something,” and a courageous person did just that to the FBI. And the FBI failed to act. “See something, say something” is an incredibly important tool and people must have confidence in the follow through from law enforcement. The FBI director needs to resign. “This is such a failure. There are 17 people dead, and it could have been prevented,” said Mansour. Breitbart News Tonight airs Monday through Friday on SiriusXM’s Patriot channel 125 from 9:00 p.m. to midnight Eastern (6:00 p.m. to 9:00 p.m. Pacific). LISTEN: Follow Robert Kraychik on Twitter @rkraychik.",
      "date": "17 Feb 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Palin Mocked in 2008 for Warning Putin May Invade Ukraine if Obama Elected",
      "url": "https://www.breitbart.com/national-security/2014/02/28/flashback-palin-mocked-in-2008-for-warning-putin-may-invade-ukraine-if-obama-elected-president/",
      "subtitle": "During the 2008 presidential campaign, Republican vice presidential nominee Sarah Palin warned that if Senator Barack Obama were elected president, his “indecision” and “moral equivalence” may encourage Russia’s Vladimir Putin to invade Ukraine.",
      "author": "Tony Lee",
      "content": "  Palin said then: After the Russian Army invaded the nation of Georgia, Senator Obama’s reaction was one of indecision and moral equivalence, the kind of response that would only encourage Russia’s Putin to invade Ukraine next. For those comments, she was mocked by the high-brow Foreign Policy magazine and its editor Blake Hounshell, who now is one of the editors of Politico magazine. In light of recent events in Ukraine and concerns that Russia is getting its troops ready to cross the border into the neighboring nation, nobody seems to be laughing at or dismissing those comments now. Hounshell wrote then that Palin’s comments were “strange” and “this is an extremely far-fetched scenario.” “And given how Russia has been able to unsettle Ukraine’s pro-Western government without firing a shot, I don’t see why violence would be necessary to bring Kiev to heel,” Hounshell dismissively wrote. Palin made her remarks on the stump after Obama’s running mate Joe Biden warned Obama supporters to “gird  your loins” if Obama is elected because international leaders may test or try to take advantage of him. ",
      "date": "28 Feb 2014",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin Fires Warning Shot at Lisa Murkowski: ‘I Can See 2022 from My House’",
      "url": "https://www.breitbart.com/politics/2018/10/05/sarah-palin-fires-warning-shot-at-lisa-murkowski-i-can-see-2022-from-my-house/",
      "subtitle": "Former Republican Alaska Gov. Sarah Palin fired a warning shot at Sen. Lisa Murkowski (R-AK) after the senator voted against the cloture motion to end debate on Judge Brett Kavanaugh’s confirmation, hinting she may run to unseat the longtime lawmaker in 2022 or endorse a challenger.",
      "author": "Joshua Caplan",
      "content": " “Hey @LisaMurkowski – I can see 2022 from my house…,” Palin tweeted.  In one of the most stunning upsets in Alaska political history, Palin defeated the senator’s father Frank Murkowski to become the state’s governor in 2006. Frank Murkowski, a former two-term senator who was elected governor of Alaska, served one term before Palin defeated him in the Republican gubernatorial primary. Palin, who had been appointed to Alaska’s powerful oil and gas commission board by Frank Murkowski, won broad public support from Alaskans due to her record as a reformer and whistleblower who called out the corruption in the Murkowski administration for cronyism with the big oil companies, an action which led to the largest ethics fine in Alaska history. Frank Murkowski also faced criticism for nepotism when he appointed his daughter, Lisa Murkowski, to his vacant U.S. Senate seat. In 2010, Palin, then the former Republican vice-presidential candidate, backed Tea Party Senate challenger Joe Miller over Sen. Lisa Murkowski. Prior to voting against advancing Kavanaugh, Murkowski suggested that she will oppose President Donald Trump’s Supreme Court nominee this weekend. “I believe that Brett Kavanaugh is a good man. It just may be that in my view he’s not the right man for the court at this time,” Murkowski told reporters on Capitol Hill. She said she respected her colleagues’ support for Kavanaugh, adding, “I also think we’re at a place where we need to think about the credibility and integrity of our institutions.” After remaining undecided on whether Kavanaugh’s nomination should move forward, Murkowski rendered her decision Friday in dramatic fashion. As the clerk read the names in alphabetical order, all eyes were on Murkowski. Senators stood up in their chairs and voted, some of them loudly. But when it came to Murkowski, she stood up, paused, and whispered “no,” her voice barely audible. Then she took her seat, looking down with a stone-faced expression. As the end of the vote neared, Maine Sen. Susan Collins, who sits next to Murkowski, leaned over and put her hand on the arm of Murkowski’s chair. The two huddled in deep conversation. A spokeswoman for Murkowski could not immediately confirm that the senator will oppose Kavanaugh on the final vote expected Saturday, but indicated it appeared that way. Kavanaugh could still win confirmation if Murkowski is the only Republican to oppose him. Murkowski claimed she agonized over her vote, telling reporters she didn’t make up her mind until she walked into the Senate chamber. “This has truly been the most difficult evaluation of a decision that I’ve ever had to make, and I’ve made some interesting ones in my political career,” she said. Breitbart News’ Senior Editor-at-Large Rebecca Mansour and the Associated Press contributed to this report.",
      "date": "5 Oct 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin: Andrew Breitbart Helped Me Defend Myself When Fox News Wouldn’t Let Me on Air After Giffords Shooting",
      "url": "https://www.breitbart.com/radio/2018/02/18/sarah-palin-andrew-breitbart-helped-me-defend-myself-when-fox-news-wouldnt-let-me-on-air-after-the-giffords-shooting/",
      "subtitle": "The late Andrew Breitbart helped Sarah Palin defend herself when Fox News Channel’s former Chairman Roger Ailes denied her the opportunity to respond on air to the media’s false accusations framing her for inciting the attempted assassination of former Congresswoman Gabrielle “Gabby” Giffords (D-AZ) in the days immediately following the 2011 Tucson mass shooting incident.",
      "author": "Robert Kraychik",
      "content": " “If it weren’t for Breitbart, so much of our commonsense defense wouldn’t have gotten out there, because I was working for Fox News at the time, and I was not allowed to go on the air to defend myself for days,” Palin said, speaking publicly about this for the first time, during a Friday interview on SiriusXM’s Breitbart News Tonight with Breitbart’s Senior Editor-at-Large Rebecca Mansour. The media firestorm surrounding the 2011 Giffords shooting actually began during the 2010 midterm elections, when Democrats accused Palin of inciting violence because her political action committee (PAC), SarahPAC, circulated a map with crosshairs over congressional districts that the Republican Party hoped to win that year. Palin’s graphic highlighted 20 specific swing districts that she and Sen. John McCain (R-AZ) carried in the 2008 presidential race but were represented by a Democrat in Congress. With Palin’s help, Republican candidates successfully won 19 of those 20 districts in the 2010 midterms. The one seat that did not swing to Republicans was held by Gabby Giffords, who was shot on January 8, 2011, a few months after winning her re-election bid, when a mentally ill gunman, Jared Loughner, opened fire at a Tucson, Arizona, constituent gathering, wounding Giffords and killing six others. Democrats and their establishment media allies cast blame on Palin for the mass shooting. However, as Breitbart Senior Editor-at-Large Joel Pollak reported, the public eventually learned that Giffords’ shooter “was mentally disturbed and had no political motivations,” and Palin’s map graphic “was virtually identical to those used by Democrats for years, depicting targets atop contested congressional districts.” “There is no evidence whatsoever of political incitement in the Giffords case,” concluded Pollak. Fox News’s management denied Palin’s requests to defend herself on the cable network against the aforementioned slander. And Palin, a Fox News contributor at the time, was also prevented by her strictly enforced employment contract from doing any rival media appearances without prior authorization from Fox management. “I think that that time was our toughest time in this last decade of being out there on a public platform, [with] false accusations that we were to blame for the Gabby Giffords shooting,” said Palin. “If it weren’t for Breitbart, so much of our commonsense defense wouldn’t have gotten out there, because I was working for Fox News at the time, and I was not allowed to go on the air to defend myself for days, and finally I bucked management of Fox News—I never even talked about this publicly—I bucked management and said, ‘I’ll do my own video, and I’ll post it, and I’ll explain to people that, no, we are not to blame.’ My relationship with Fox was never the same after that.” Palin noted Ailes’ repeated refusal to allow her a platform to defend herself from a barrage of media attacks falsely accusing her of inciting mass murder. “I had asked [Roger Ailes], ‘How many days do we have to go listening to this with no defense articulated at all? May I please go on the air?’ And he wouldn’t let me,” said Palin. “So that was a tough time.” Mansour, who worked as a senior aide and speechwriter for Palin at the time, reflected on how Democrats and their news media allies sought to lay blame for the mass murder and attempted assassination of Giffords at the feet of Palin and her staff. “That whole Gabby Giffords thing,” said Mansour. “It was one of the worst moments, and we felt like we were besieged by people accusing us falsely, and your heart was just broken, too, because you’re a mom, and you’re watching the people suffering. I know this hits you really hard at home, because you have a big heart. What was interesting, when you look back, is that you have had instances like this again and again with the media, with a vicious media that just targets you and your family and just goes after you for these things.” “And I look at President Trump, right now, and the stuff that he faces—and believe me, it’s just awful, the fake news crap—but here is my take,” Mansour continued. “[Trump] always had connections with other media figures, he had a lot of money, and an organization defending him. But when you came on the scene, you were just an ordinary American, your family was very middle-class, just ordinary folks, you had risen up from the grassroots as a corruption-buster who was elected governor of Alaska, and you did not have a giant megaphone of people in the establishment media back east [defending you]. So when these people just came at you, it was really very scary, it was like being surrounded. Till this day, I still hear people repeat lies about you, and I’m like, ‘You have no idea that that’s completely bogus.’ How do feel about this now and what were the lessons learned?” “I don’t live by the praise of man so I know I’m not going to die by their criticisms,” said Palin. “So whatever they say, I don’t care what the critics say.” Palin described the period as trying for her and her family, noting that the intensity and hostility of biased media attacks take a toll on even the strongest family. “[I wish] people understood what it does to a family, how it potentially could rip apart a family because everybody has a different idea of how to react to the circumstances around you, and that causes some stress,” said Palin. “I thank God every day that I have a strong family, and we’re doing great. Hopefully our story could inspire people to know that whatever they’re facing, the sun will come out tomorrow and things can get better. It’s just a matter of how you react to sometimes horrible circumstances around you.” “Still to this day, the New York Times has still alluded to [the Giffords shoot] and placed blame,” Palin noted, alluding to a New York Times op-ed in June of 2017 that again blamed Palin for the 2011 mass shooting in Arizona. Palin then filed a defamation lawsuit against the Times for falsely accusing her of inciting Loughner to shoot Giffords. Mansour recounted how she met Andrew Breitbart and a person the Breitbart News founder described as “one of his really smart friends” for the first time in 2011 when they offered to help Palin and her team. “That was the first time I met Andrew Breitbart,” said Mansour. “It was during that time. It was a very troubled time. Our PAC was being falsely implicated in something that had absolutely nothing to do with us … and it was Andrew Breitbart who offered to help us. He basically came to me and said, ‘Hey, how can I help? And I want to introduce you to one of my really smart friends who’s going to help you, too, and by the way, his name is Joel Pollak.’ And that was how I first met Joel Pollak.” Seven years later, Pollak would become Mansour’s co-host on SiriusXM’s Breitbart News Tonight. Breitbart News Tonight airs Monday through Friday on SiriusXM’s Patriot channel 125 from 9:00 p.m. to midnight Eastern (6:00 p.m. to 9:00 p.m. Pacific). LISTEN:  Follow Robert Kraychik on Twitter @rkraychik.",
      "date": "18 Feb 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Exclusive– Sarah Palin on Syria: Why Should We ‘Sacrifice Even One of Our Sons or Daughters?’",
      "url": "https://www.breitbart.com/radio/2018/04/11/exclusive-sarah-palin-on-syria-why-should-we-sacrifice-even-one-of-our-sons-or-daughters/",
      "subtitle": "“Why in the world we would be willing to sacrifice even one of our sons or daughters who will be sent over [to Syria]?” asked Former Alaska Governor Sarah Palin during a Tuesday interview with SiriusXM host Rebecca Mansour for Breitbart News Tonight.",
      "author": "Robert Kraychik",
      "content": " “It really makes me nervous that there seems to be some enthusiasm for the U.S. to interject ourselves again in a foreign country’s battles when no one has articulated yet what our interest is there,” Palin said. “We should have learned our lesson with Iraq and Afghanistan. I look at it as the blood, the sweat, the toil that has been spent on our end when you can’t really see what the gain is in a lot of respects. We just can’t allow ourselves get back in that mode with Syria.” LISTEN: Palin warned of advocacy for military operations in Syria rooted in financial self-interest. She stated, “I hate to say it, but a lot of the talk that’s enthusiastic about war, unfortunately, comes from people with strong ties to defense contractors and have strong ties to those who ultimately can make money on the operations. So often you got to follow the money and that leads you to what the root is of some of these arguments.” Palin called for an articulation of the American national interest in Syria prior to any military operations within the Levantine state: So those making this point that we need to insert our power and get in there and get rid of Assad, I’m not comfortable with it and American citizens should not be comfortable with this until there is very focused articulated reasons provided to us and Congress — and Congress need to be a part of this, too, not just the administration — until we find out what the heck we would be doing there. There has to be avoidance of the short-sighted decision-making. Palin continued, “Until we are given the reasons why it’s in America’s best interests, why in the world we would be willing to sacrifice even one of our sons or daughters who will be sent over there? It’s like that old saying, the old men call war, and they send the young men to go fight them. No. I see what war does to an individual, to a family. I guess there’s a lot of humanity that I’m considering at this point.” Palin added, “Yeah, America is the strongest fighting power on the globe — and we should be — but being prepared with that, being the strongest, should create an environment of peace. That’s what Reagan used to preach.” On Monday, Fox News Channel’s Tucker Carlson similarly questioned the wisdom of calls to oust Syrian President Bashar al-Assad. Also on Monday, Pat Buchanan dubbed Sens. Lindsey Graham (R-SC), John McCain (R-AZ), and Marco Rubio (R-FL) — advocates of toppling Assad — as members of “the war party.” Breitbart News Tonight broadcasts live Monday through Friday on SiriusXM’s Patriot channel 125 from 9:00 p.m. to midnight Eastern (6:00 p.m. to 9:00 p.m. Pacific). Follow Robert Kraychik on Twitter @rkraychik.",
      "date": "11 Apr 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin Sues New York Times for Defamation",
      "url": "https://www.breitbart.com/politics/2017/06/27/sarah-palin-sues-new-york-times-for-defamation/",
      "subtitle": "On Tuesday evening, former Alaska Governor Sarah Palin hired Hulk Hogan’s lawyers and sued the New York Times for defamation for falsely accusing her in a June 14 editorial of inciting Jared Lee Loughner to shoot Rep. Gabby Giffords (D-AZ). The Times’ editorial was published on the day that James Hodgkinson shot House Majority Whip Steve Scalise (R-LA) while he was practicing for the Congressional Baseball Game with his GOP teammates.",
      "author": "Tony Lee",
      "content": " “Today, Sarah Palin took a stand against The New York Times Company by filing a lawsuit which seeks to hold The Times accountable for stating that Governor Palin is part of a ‘sickeningly familiar pattern’ of politically motivated violence and that she incited the horrific 2011 shooting of Representative Gabby Giffords, a tragedy where the gunman seriously wounded numerous people and killed 6, including a federal judge and a 9-year-old girl,” Palin’s lawyers—Ken Turkel, Shane Vogt, and S. Preston Ricardo—said in a statement. The complaint, filed in Manhattan federal court in the Southern District of New York, states that “at the time of publication, The Times knew and had published pieces acknowledging that there was no connection between Mrs. Palin and Loughner’s 2011 shooting.” “In doing so, The Times violated the law and its own policies,” it reads. Messrs. Turkel, Vogt, and Ricardo said Palin “seeks to hold The Times to its November 13, 2016, pledge [‘to rededicate itself to reporting facts honestly and holding power to account’], and to face both journalistic and financial accountability for the false statements that it published about Mrs. Palin.” As Breitbart News previously noted, Palin indicated on Twitter that she was “considering suing the New York Times for libel” the day after the Times published its editorial even though “it has long been established that there has never been any evidence whatsoever linking Palin to the attempted assassination.”   Here is what the Times originally wrote in its editorial: Was this attack evidence of how vicious American politics has become? Probably. In 2011, when Jared Lee Loughner opened fire in a supermarket parking lot, grievously wounding Representative Gabby Giffords and killing six people, including a 9-year-old girl, the link to political incitement was clear. Before the shooting, Sarah Palin’s political action committee circulated a map of targeted electoral districts that put Ms. Giffords and 19 other Democrats under stylized cross hairs. The Times, after much public backlash from even Palin’s harshest critics on the left and right, then issued two subsequent corrections. After adding that “no connection to the shooting was ever established” to its original editorial, the Times issued this correction on June 15: An earlier version of this editorial incorrectly stated that a link existed between political incitement and the 2011 shooting of Representative Gabby Giffords. In fact, no such link was established. But the Times never corrected that it had falsely stated that Palin had put “Giffords and 19 other Democrats under stylized cross hairs” when Palin did no such thing. Later in the day on June 15, the Times edited its editorial again to note that Palin’s map “showed the targeted electoral districts of Ms. Giffords and 19 other Democrats under stylized cross hairs.” It then issued its second correction: The editorial also incorrectly described a map distributed by a political action committee before that shooting. It depicted electoral districts, not individual Democratic lawmakers, beneath stylized cross hairs. Yet, in a statement to CNN, the Times insisted that their errors did not “undercut or weaken the argument of the piece.” Palin’s lawyers pointed out that “despite recognizing that its statements about Mrs. Palin in the June 14, 2017 column ‘America’s Lethal Politics’ are not true, The Times repeatedly failed to meaningfully retract or correct its column and apologize to Mrs. Palin for publishing it. Rather, The Times issued a statement affirming that its ‘error doesn’t undercut or weaken the argument of the piece.’” To prove that the Times had “ample facts available that established that there was no connection between Mrs. Palin and Loughner’s crime,” the lawyers point to an article the Times published on January 15, 2011, that “recognized that no direct or clear link between political rhetoric and Loughner’s actions could be claimed.” In addition, the lawyers point out that New York Times columnist Charles Blow once wrote that “the only problem is that there was no evidence then, and even now, that overheated rhetoric from the right had anything to do with the shooting” of Giffords. The lawyers also refer to Blow’s column, “She Who Must Not Be Named,” that was critical of the left’s and the establishment press’s continued coverage of Palin. In Blow’s column, he asks, “What purpose does it serve other than inflaming passions to drive viewership and Web clicks?” The complaint points out that Blow’s “column acknowledges that there is existing hostility held toward Mrs. Palin, and also recognizes that her name and attacks upon her inflame passions and thereby drive viewership and Web clicks to media companies.” “The Times published the Palin Article with actual knowledge that stories attacking Mrs. Palin inflame passions, which drives viewership and Web clicks,” the complaint further reads. “Thus, The Times knowingly and voluntarily exploited and retained a benefit conferred by Mrs. Palin, in special circumstances particular to this case in which it would be inequitable for The Times to retain that benefit without paying the value thereof to Mrs. Palin.” Palin’s attorneys argue that the Times’ “conduct was committed knowingly, intentionally, willfully, wantonly and maliciously, with the intent to harm Mrs. Palin, or in blatant disregard of the substantial likelihood of causing her harm, thereby entitling Mrs. Palin to an award of punitive damages.” Two of Palin’s lawyers–Messrs. Turkel and Vogt–successfully represented Hulk Hogan in his $140 million invasion of privacy suit against Gawker after Gawker published Hogan’s sex tape. As noted on the firm’s website, they “convinced a Pinellas County jury to award Terry Bollea, professionally known as Hulk Hogan, $55 million in economic damages and another $60 million in damages for emotional distress. The jury awarded an additional $25.1 million in punitive damages, making the verdict one of the largest contested verdicts in Pinellas County history.” 01 – Complaint W-o Exhibits (00125593xBEB76) by Breitbart News on Scribd ",
      "date": "27 Jun 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "EXCLUSIVE – Sarah Palin: Congressional GOP Are Abusers And We’re Their Battered Wife",
      "url": "https://www.breitbart.com/politics/2015/12/19/exclusive-sarah-palin-congressional-gop-are-abusers-and-were-their-battered-wife/",
      "subtitle": "They did it again. But like a battered wife, we keep going back because every four years they bring us flowers, beg our forgiveness, and swear they’ll never hit us again.",
      "author": "Sarah Palin",
      "content": " The GOP establishment in Congress is our abuser. We can’t hide the black eyes any more. The whole neighborhood knows. The Democrats are gloating. Obama thanked Paul Ryan effusively – and why shouldn’t he? Nancy Pelosi couldn’t have given him more. And where was the famed House Freedom Caucus – those stalwart conservatives who spearheaded Boehner’s ouster? They were shrugging and handing us a bag of frozen peas to put on our black eye. If we’re lucky, maybe they’ll call 911 for us when the beating starts up again. This is shameful, and it has to end. No mas! For the last seven years, grassroots conservatives rallied to action under the belief that change starts at the ballot box. As I’ve said many times: there is nothing wrong with this country that a good old-fashioned election can’t fix. People put their own lives on hold to send these Republicans to Congress to take back control of the House and Senate, to get a handle on our bankrupt federal government, and put America on the right track. I think of all the cross-country redeye flights I took away from my young son in order to campaign for Republican candidates, so full of promises, over the years. Others gave up a lot more than I did to elect a “conservative” majority. Together, we grassroots conservatives gave the GOP historic electoral victories because they promised us they would stop Obama’s “fundamental transformation of America.” Instead, they abetted it. They are Obama’s accomplices. With this omnibus bill, they broke every promise they made to us. Every single one. They’ve reached a level of brazen duplicity previously known only to Democrats. Obamacare? It’s fully funded. Planned Parenthood, which was caught red-handed haggling over the sale of dead babies? It’s funded too. Obama’s illegal executive amnesty? Funded. Illegal alien sanctuary cities? Funded. Visas for un-vetted Muslim migrants (“refugees”) to resettle in America? Funded. Obama’s green energy crony capitalism? Funded. Tax credits for illegal aliens? Funded. H-2B visas to replace American workers with cheap unskilled foreign workers? Yep, that’s in there too. What about funds for the fence that we so desperately need on our southern border? Nope, sorry, they couldn’t find any money for that. Basically, everything commonsense conservatives despise – and Republicans promised to put an end to if elected – was funded by this omnibus. They weren’t worried about the promises they made to us. This omnibus was written by lobbyists for lobbyists and passed by corrupted politicians fulfilling promises to these cronies with deep pockets. They campaigned one way, then governed another way. This is why people hate politics and politicians. This is why they tune out and stay home. Reading through chunks of this bloated spending bill that drives us further into bankruptcy I steamed, “That’s it. They can’t be trusted. I’m outta here because they do not stand on the planks of the GOP platform, not one iota.” But you know what, my fellow conservatives – that’s what the GOP establishment wants us to do! They want us to leave the Party or just sit out elections. Without us around, their handpicked puppets can be elected in gerrymandered districts without any pesky conservative primary challengers. The Congressional GOP establishment doesn’t care about winning national elections. As far as they’re concerned, Hillary can have the White House – just so long as they can keep their cushy jobs on Capitol Hill. In fact, having a Democrat in the White House is probably good for business. They don’t want to have to lead on anything – they’ve had ample opportunity to do so! –  and a Democrat president is a nice foil for them. They can enjoy the status quo, enjoy all the crony capital cash, enjoy the perks of office, and as the country continues to crash and burn, they can tell the folks back home it’s all President Hillary’s fault. Thankfully, not everyone with an “R” after their name is happy with the corrupt status quo. And there are a lot more good guys in Congress now thanks to the Tea Party. So, no, it’s not time to leave the GOP. We’re going to make our abusers leave. We’re not going to let them hit us again. It’s time to kick our abusers out of the House, change the locks, and keep a loaded shotgun next to the bed.",
      "date": "19 Dec 2015",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "EXCLUSIVE — Sarah Palin: Finally, the ‘End of an Error’",
      "url": "https://www.breitbart.com/politics/2017/01/17/exclusive-sarah-palin-finally-end-error/",
      "subtitle": "Like everyone’s saying, it’s the end of an error. Obama is gone.",
      "author": "Sarah Palin",
      "content": " Time to undo what the Community Organizer organized for America: astronomically increased debt, a disrespected law enforcement and military community, numerous ticked off allies, newly empowered enemies, erasure of borders, and demographic divisions aplenty. Obama is free now to stammer on about fulfilling his promises, like he’ll “negotiate healthcare reform in public sessions, televised on C-SPAN… Everyone gets a seat at the table.” [emphasis added] There’s a new sheriff in town. Here’s hoping he’s got a posse of deputies who understand why we elected Donald J. Trump and won’t undermine our movement. The mandate: drain the swamp — those hell-bent on obstruction included. It’s RINO season. We will recover from Obama. The question is, how soon can we recover from the people who voted for him. Twice.",
      "date": "17 Jan 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Exclusive — Sarah Palin: Media Hysteria over Trump’s ‘Immigration Ban’ Is Fake News on Steroids",
      "url": "https://www.breitbart.com/the-media/2017/01/29/exclusive-sarah-palin-media-hysteria-over-trumps-immigration-ban-is-fake-news-on-steroids/",
      "subtitle": "A blanket “immigration ban”? No, it is not. That is a fake news headline.",
      "author": "Sarah Palin",
      "content": " Even so-called conservative websites groveling for clicks are making more out of President Trump’s action to fully vet foreigners’ intentions upon U.S. entrance than it obviously is. Trump is doing what the majority recognized was necessary to secure our borders. Voters asked for it, he promised it, and thus he was elected. Now he’s doing it. This isn’t inhumane. It’s exercising common-sense compassion to keep human beings safe. It’s about fully vetting foreigners and merely following the laws the people–through our representative form of government within our republic–agreed upon. The misinformed are ballistically knee-jerking because they aren’t used to candidates fulfilling campaign promises. Perhaps it’s shocking because we’re used to swamp dwellers murkying up the waters once typical politicians get elected, but that’s exactly why a typical politician wasn’t elected. The status quo has got to go. Many of us have demanded we regroup and get a handle on security issues. What next preventable tragedy must happen before we finally do so? Trump’s executive action is a step in the right direction towards welcoming safe, loving, law-abiding, hardworking, patriotic people into our nation that was built on the backs of safe, loving, law-abiding, hardworking, patriotic people willing to assimilate into America’s exceptional melting pot.",
      "date": "29 Jan 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "EXCLUSIVE – Sarah Palin: Marion Maréchal-Le Pen and 16 Centuries of Christian France",
      "url": "https://www.breitbart.com/politics/2015/12/13/exclusive-sarah-palin-marion-marechal-le-pen-and-16-centuries-of-christian-france/",
      "subtitle": "I have a political crush, but one I couldn’t vote for today – because she ran for office in France.",
      "author": "Sarah Palin",
      "content": " Marion Maréchal-Le Pen is the new deserved “It Girl” of French politics and a clear voice of courage and common sense in a country and continent in need of both. In 2012, she earned the distinction of being France’s youngest elected Member of Parliament. Last week she handily won the first round of a race for the leadership of a large important region in southeastern France that’s home to the beautiful port city of Marseilles. Unfortunately, she lost the run-off election today because the two establishment Parties joined forces to defeat her. But despite today’s tough losses, Marion and her aunt Marine Le Pen, the leader of the National Front (FN) Party, have established themselves and their supporters as a force to be reckoned with in France’s 2017 presidential race, in which Marine is sure to be a contender with her talented niece right behind her. For some time now, I’ve admired the bold style of Marine Le Pen, who wrestled control of the leadership of her populist party in order to purge it of any trace of anti-Semitism, which it had unfortunately been tainted with in the past. But I’m especially impressed with the courage of her young niece who is a devout Catholic and unapologetically pro-life – not an easy thing for a politician to be in a country that’s aggressively secular. More importantly, young Marion Maréchal-Le Pen is unashamed to champion France’s Judeo-Christian identity and heritage as something worth preserving and fighting for. She publicly proclaims it, setting an example for even American politicians to be so bold. With France (and indeed all of Europe) caught up in an existential crisis against radical Islam, these are the sentiments they need in their leadership. The Charlie Hebdo attacks last January and the Paris attacks last month were a tragic wake up call for France. The forces of civilization are engaged in a great war against the Death Cult that is radical Islam. This year the conflict reached the shores of France, which has become the Western Front of this Great War, thanks in part to the migrant crisis overwhelming the European Union. Was anyone surprised that the mastermind of the Paris attacks entered the country by posing as a Syrian “refugee”? The Islamic State bragged that they were going to exploit Europe’s open borders! Is this not the clearest warning to politically correct pundits and politicians in our own homeland who think we can filter the nefarious out from the future flood of young, strong, able-bodied immigrants claiming “refugee” status? It’s common sense to encourage these young men to stay and fight for their countries and families during this time made tumultuous in part by our utter lack of border security and vetting processes. The migrant crisis has made a mockery of any idea of national sovereignty. The EU’s open border policy means that all of Europe is now forced to bear the burden of Germany’s insane decision to welcome in those untold millions of mostly fighting age young Muslim men who have zero interest in assimilating to secular western values, as heretofore mentioned. To this, Marion Maréchal-Le Pen declares that France is not an Islamic land, but Muslims are welcome to become French citizens “only on condition that they bend to the customs and the way of life that Greek, Roman and 16 centuries of Christianity fashioned.” What she’s saying should not be controversial. It’s common sense. The western values enjoyed by every French citizen regardless of their religion are necessarily rooted in those 16 Christian centuries. Our understanding of human rights and human dignity comes from the Judeo-Christian worldview that shaped modern Europe. If you transplant to your shores a foreign population that’s hostile to the very things your country stands for, you won’t have a country for very long. This is the hard truth. You can’t maintain a peaceful liberal democracy with people who want to impose Sharia law on you. But for some reason saying this out loud is considered “hate speech” or xenophobia in Europe. They can even press criminal charges against you for it! We see members of a Death Cult gun down Parisians in a café and concert hall, slaughter cartoonists at their desks, shoot up a Jewish market, sell women and girls into sexual slavery, stone gays to death, crucify and behead Christians, and declare their intention to infiltrate and destroy western countries. But the Left reserves its harshest criticism not for the murderous Death Cult, but for any leader offering commonsense solutions to curtail the terrorists’ ability to wage war on the innocent. The Left wraps itself in political correctness and multiculturalism like a suicide vest. They’d rather blow up the whole country than admit the stupidity of thinking a nation can remain the same after inviting in millions of people who despise its values. I guess it’s not surprising really. The Left in Europe and America has always had a self-destructive hatred for the things that make a country great and worth living in: free markets, free speech, a civil society grounded in Judeo-Christian values, a strong national defense, and sovereign borders. They’re constantly attacking every one of these things. That’s undeniable. But their dangerous ideology is being “mugged by reality.” People are waking up. Young Marion Maréchal-Le Pen built her electoral win last week by going to the rural small business owners – the average French citizens who have been ignored by their elite politicians and have had enough. We see the same thing happening here in America. Call it the rise of the populists. Pundits are already seeing the similarities between Marion and Marine Le Pen, Donald Trump, and Ted Cruz. All are non-establishment candidates taking on corrupt, entrenched, and detached political elites who are more interested in preserving their own power than in defending their countries. It’s time to wake up, America. Nowhere in Europe or America is safe from this Great War against the Death Cult. San Bernardino wasn’t a one-off phenomenon. ISIS is already here. According to a House Homeland Security report, over 250 people in the U.S. have attempted to join ISIS (that we know about), and 82 have been caught in ISIS plots. Meanwhile, the FBI has nearly 1,000 open cases involving ISIS that we know of. We don’t have a handle on this situation now, but our insane politicians want to import more so-called “refugees.” Forgive me if I’m a little skeptical about the refugee part. We just learned that ISIS is forging fake Syrian passports, and we already know that two of the Paris attackers entered Europe posing as refugees. We have no way to vet anyone coming to our country. This is why we need to seal the borders. And we must speak candidly about the need for those coming here to assimilate to our values, as immigrants have always done in the past. Our country isn’t 16 centuries old, but our Founders were under the influence of nearly 18 centuries of Judeo-Christian thought and time-tested truths when they drafted our Constitution. We would do well to remember that our Constitution is incompatible with Sharia, and anyone who wants to live under Sharia should settle elsewhere. When Marion Maréchal-Le Pen speaks of France’s 16 centuries of Judeo-Christian history and heritage, her rhetoric isn’t about “hate” or xenophobia. It’s about love – that deep love of country we call patriotism. Mark Twain believed patriotism was personified in the story of a young French woman who “found a great nation lying in chains, helpless and hopeless” and led it “from victory to victory” until it was free. “With Joan of Arc love of country was more than a sentiment – it was a passion,” Twain wrote. “She was Patriotism embodied.” As Marion faces the political battles ahead, I wouldn’t be surprised if she says a prayer to France’s Patron Saint, for Marion is a reminder of her – Joan of Arc.",
      "date": "13 Dec 2015",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Exclusive – Sarah Palin: Obama Wept",
      "url": "https://www.breitbart.com/politics/2016/01/05/exclusive-sarah-palin-obama-wept/",
      "subtitle": "Obama wept.",
      "author": "Sarah Palin",
      "content": " America is forced to weep over Obama’s release of violent criminals into our communities – like the 121 illegal aliens who committed murders after they were released from custody by the Obama administration instead of being deported. And that doesn’t take into account the others we don’t know about. The whole world weeps waiting for American leadership in these troubled times as Islamic savages commit genocide against the Christians of the Middle East and terrorize innocent people in cities across the globe. Meanwhile, Obama wept as he blamed law-abiding patriots for the nation’s insecurity and sought to strip them of the Constitutional rights that generations of Americans shed blood to protect. Obama wept, while we all continue to weep for our country and the civilized world.    ",
      "date": "5 Jan 2016",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Donald Trump and Sarah Palin Battle Ted Cruz in Wisconsin, as Paul Ryan Lurks",
      "url": "https://www.breitbart.com/politics/2016/04/02/donald-trump-and-sarah-palin-battle-ted-cruz-in-wisconsin-as-paul-ryan-lurks/",
      "subtitle": "WISCONSIN — Donald Trump and Sarah Palin barnstormed Wisconsin Saturday in a last-minute push to cut Ted Cruz’s poll lead in the state.",
      "author": "Patrick Howley",
      "content": " A former Republican congressman tells Breitbart News that top Wisconsin Republican power brokers, including Scott Walker and Reince Preibus, are using Cruz to beat Trump here so that they can broker the convention to pick Wisconsin’s own Paul Ryan as the nominee. With 72 hours to go until Tuesday’s primary, Trump and Palin braved the April snow to speak with urgency about their mission to defeat Cruz, who is backed by conservative movement activists as well as out-of-state Establishment types. The Cruz campaign says that they’ve seen no visible evidence of a Trump ground game or volunteer operation in the state. So Trump is relying on big rallies in front of packed crowds in auditorium halls. “People say, I like Trump and I like Cruz. It’s not even a fair comparison. I’m so much better,” Trump said at a rally in Wausau, mocking Washington lobbyists with “Cruz” tattoos on their foreheads as he stood in front of a group of teenage guys in faux-Pink Floyd T-shirts bearing the slogan “Trump’s Wall.” “Believe me, they have him. They have him, folks,” Trump said of Cruz’s lobbyists. Both Trump and Palin made a fair share of Green Bay Packers references, telling anecdotes about Packers legends Jerry Kramer and Vince Lombardi (and reminding this reporter of Hunter S. Thompson’s classic assessment upon meeting popular Silent Majority president Richard Nixon: “It wasn’t his factual knowledge of football that stunned me; it was his genuine interest in the game.”) Trump also made kids in the audience raise their hands and promise never to do drugs. “I won’t say no alcohol, but take it easy on the alcohol,” he added. “Once you get hooked on the alcohol or the drugs, it makes your life very hard. And if you never start taking it, you won’t get hooked.”  “I hope I have some good years left, and I want to give back to the country. I just want to give something back. That’s all it is…This is an opportunity that is so awe-inspiring, to be president of the United States … If we don’t make the country rich again, you’re going to have your Social Security cut by Cruz and Kasich.” “We have some areas that look like it’s just uniform Trump, and we have others that we’re actually campaigning in a little bit to see if we can get them over,” Trump said. In Racine, Trump stood on stage, reading off numbers from a page of Wisconsin budget and job statistics, and said of himself, rather tellingly, “I don’t think anybody’s self-funded really since Ross Perot.” “Wisconsin has to keep wages very depressed, if you don’t keep wages depressed you’re not going to hold your jobs. Which tells you, you have the wrong kinds of jobs, folks, I hate to tell you. We’ll bring the jobs back that you’re going to want to make a little money with.” “The people get it. The people, the people, the people, really understand. The people really understand.” Palin, meanwhile, took dead aim at Cruz. “These paid political hacks and consultants running these other guys’ campaigns who have a track record of losing and losing and losing. But somebody’s such a sucker, they keep hiring the guys and paying them hundreds of thousands of dollars to advise them on campaigns. Well, it’s not going to do him any good.” Will these rallies help Trump gain on Cruz, who is leading by ten points? Only time will tell. But other signs around the state are pointing to very positive things for Cruz: The Establishment Is Teaming Up With Cruz — At Least For Now Trump is fighting against Wisconsin’s governor Scott Walker, who endorsed Cruz, but the problem for Trump is bigger than Walker. “I think this is a three-corner bank shot. I don’t think there’s that much of a lovefest for Ted Cruz, but they’re just using him to keep Trump below 1,237 delegates so they can broker the convention for Paul Ryan,” former congressman Scott Klug told Breitbart News. “Reince is very close to Ryan, and Walker is very close to Ryan, so I think it starts there. I know Wisconsin politics well and I know the players well and I think this is well orchestrated,” Klug said. “They had the opportunity to volunteer for the Cruz campaign for a long time, but it’s only happened in the last couple days.” The Washington-based Club for Growth PAC is running a TV ad in the state that makes perfectly clear why Ted Cruz is all of a sudden getting the support of Mitt Romney, Lindsey Graham, Jeb Bush, and other people who never would have endorsed him in a million years had Trump not gotten into the race. If people vote for Ted Cruz, then the party can stop Trump from getting 1,237 delegates, and then the Republicans can broker the convention in Cleveland, where Cruz will be on his own on the second ballot. Cruz is already racing to win a second-ballot majority among delegates in order to stave off an Establishment power play that could see Paul Ryan or another candidate step in to take the nomination. https://www.youtube.com/watch?v=OVNOu00vYpM Trump attacked the Club for Growth’s numbers-minded antics. Trump challenged the group’s math.   Cruz Has A Highly Organized Ground Game “Cruz is doing well in the Milwaukee suburbs, where about 40 percent of the raw numbers in Wisconsin come out of,” former Republican congressman Scott Klug told Breitbart News. “The northern towns, the rural part of the state, that’s where Trump’s strength is … I’d be stunned if Cruz doesn’t win the First, which is Ryan’s district.” Milwaukee-area conservative radio hosts like Charlie Sykes are hammering away at Trump, and activists are hitting the ground. Heidi Cruz and Carly Fiorina have teamed up to barnstorm around the state, riling up volunteers at the campaign’s more than thirty makeshift offices in the state. On a snowy day this week in Wausau, Heidi and Carly showed up to greet about fifty people in a crowded rental unit on the outskirts of town. Heidi was professional to a tee, doggedly going from handshake to handshake with the predominately elderly and older middle-aged group. “Ted is so great at standing up for what we believe in,” Heidi said when asked casually if she was getting tired of the campaign trail, adding that Ted’s passion keeps them both energized. Another woman told Heidi that she was praying for Ted. Heidi thanked her. “And thank you for putting action to all these prayers too, because we have packed offices all over the state,” Heidi added, concluding that she believes her husband will win Wisconsin. The people there were perfectly friendly but also symptomatic of the Midwestern distaste for coastal outsiders, mocking among themselves Donald Trump’s orange face. A particularly entrepreneurial 17-year-old volunteer named Bethany Torstenson said that she aspires to one day be a “little like” each of the more constitutionally-inclined Republican candidates, “except for Trump.” She says, “I don’t want to be part of the circus.” Trump’s East Coast Style Does Not Adapt Easily Here Let’s say you’re a reporter from the East Coast (a fiscally conservative one) and you show up to a bar in Madison, Wisconsin wearing a suit sans tie. A guy might look at you and say “I hear the [stock] market is up!” while other people in the bar look away from you. The bartender might not come over to serve you right away. And then you take the hint and leave. No, Wisconsin is not filled to the brim with such mean-spirited hipsters, but people throughout the state — like in Iowa — do have a fundamental distrust for people from the East Coast. Who from the deep Midwest can try to deny it? Fast-talking New Yorkers are viewed with suspicion at best. A candidate talking about his “winning” poll numbers all the time is considered tacky. A lot of people in Wisconsin — from the well-represented Bernie Sanders Left to the pro-Cruz Religious Right — really, really, really don’t like Donald Trump. Consider the states where Trump has won his most significant victories. Trump, the redheaded Scots-Irish candidate, won New Hampshire as well as Alabama, Massachusetts alongside South Carolina. These are East Coast people, and whether they’re in New England or the Deep South, many of them are Catholics or at least rooted in the fiery Scotch-Irish tradition. Trump has consistently led the Republican field among Catholics. Trump leads Hillary Clinton among Catholics, even though a substantial plurality of Catholics are Democrats. The Germanic Protestants of Wisconsin, raised in a modest culture like in Iowa (where Trump only got 24 percent in a loss), are wary of Trump. They don’t like the bombast. They don’t like the ego. They don’t like the circus. And they really don’t like New York. How about Lutherans, whose presence in Wisconsin makes it one of the top Lutheran states alongside Minnesota and North and South Dakota? Forget it. Trump draws Lutheran peace protesters. It’s not his personality type. Also, Wisconsin is a predominately white state that has very few Mexicans in it (as of 2008, Hispanics made up only five percent of the state and were mostly found in clusters). Therefore, the idea of a border wall with Mexico is removed from the experience and concerns of most of these people. Don’t expect immigration to have anywhere near the impact in Wisconsin that it had in Arizona, where Trump won in a landslide. Breitbart News will continue to monitor all of the events leading up to Tuesday’s Wisconsin primary.",
      "date": "2 Apr 2016",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Exclusive — Sarah Palin on Paul Ryan’s ‘RINO-Care’: ‘Socialized Medicine’; President Trump Will ‘Step In and Fix It’",
      "url": "https://www.breitbart.com/politics/2017/03/11/exclusive-palin-paul-ryans-rino-care-socialized-medicine-president-trump-will-step-in-fix/",
      "subtitle": "Former Alaska Gov. Sarah Palin, the 2008 Republican vice presidential nominee and the first major GOP figure to endorse President Donald Trump, is calling out House Speaker Paul Ryan for what she says is “RINO-Care.”",
      "author": "Matthew Boyle",
      "content": " Ryan introduced what he calls the “American Health Care Act,” a bill that does not repeal Obamacare but only amends it. For the last several days, senior Republicans ranging from members of the House Freedom Caucus to other House Republicans to Sens. Tom Cotton (R-AR), Rand Paul (R-KY), Mike Lee (R-UT), and more have raised serious concerns with the bill. Some call it Obamacare 2.0, others call it Obamacare Lite or Ryan-care, and now Palin—in her first interview on the topic, coming on Breitbart News Saturday on SiriusXM 125 the Patriot Channel this weekend—calls it “RINO-Care.” “I do want to speak about this, but I am tempted to say not another word from our fearless leaders about this new form of Obamacare that I’m going to call RINO-care—not another word from them until we are definitively told that there is no provision whatsoever allowing Congress to exempt itself whatsoever with this law,” Palin said. “As with anything else mandated by Congress, every single dotted I and crossed T better apply to them, too, and not just the people who they are lording this thing over because remember this is government-controlled health care, the system that requires enrollment in an unaffordable, unsustainable, unwanted, unconstitutional continuation of government-run medicine, and even in this new quasi-reformed proposal, there is still an aspect of socialism. That’s the whole premise here.” Palin expressed serious concern with the fact that Ryan’s healthcare bill does not eliminate Obamacare’s individual mandate. It just shifts the mandate—which requires all Americans to purchase a health insurance plan even if they do not want one. Under Obamacare, those who do not comply, pay a tax to the federal government. Under Ryan’s plan, those who not comply, pay a fee to the insurance companies. “This 30 percent additional fee will be collected by some in the private sector, which will mean politicians are allowed again to pick the winners and losers, and it makes you wonder who’s lobbying hardest for aspects of this new bill because obviously there are special interests involved. Otherwise, certain private sector segments of our economy wouldn’t be rewarded as they will be with this fee, instead of going to the IRS going to private companies,” Palin said. “It would be really helpful if every single one of these politicians would do like the NASCAR drivers do—and it’s been said before—but let them wear their sponsors plastered all over their three-piece suits when they show up so we know what side they’re on and who they’re actually doing their bidding for.” At this time, House GOP leadership officials are refusing to answer which lobbyists specifically were involved in writing the bill and which lobbyists wrote which parts of the legislation. Palin told Breitbart News that it’s a “great question” for leadership officials that they should answer because the public deserves to know. “That’s a great question. That’s a great question,” Palin said when informed of the fact that House GOP leaders have refused to answer which lobbyists were involved in writing the legislation. “The people want to know with this RINO-Care, we know that it helps Big pharma and big lobbyists who need big government to stay in business. We want to and have the right to know who’s actually putting pen to paper and writing this because we know the politicians don’t write the laws.” Palin also praised Cotton and Paul and Rep. Dave Brat (R-VA), among others, who are standing up and pushing back on this rush from leadership on this bill. She says that they are “right” in pushing to make sure the process is not rushed in the way that Ryan has been rushing it through the House so far. In fact, this past week, the House Energy and Commerce and Ways and Means Committees stayed in session all night to ram the bill down to the next stages, rather than taking input from the American people and slowly deliberating the process of healthcare reform. “Cotton is right. Dr. Rand Paul is right. Dave Brat is right. Some of these public servants are right in saying, ‘Let’s do it right this time’ because, remember, the rush job under Obamacare gave us what we’re having to deal with today, which is the devastating system that is again lorded over us,” Palin said. “They passed it with their rushed-through process of theirs. It’s very important that the people are allowed to see what’s in the bill before its first draft so we know what their thinking is, so we know what the difference is between Obamacare and RINO-Care.” “But we can’t lose sight of the entire premise between the whole pro-Obamacare and the pro-RINO-care arguments,” she continued. “It’s so wrong because it’s still so unconstitutional. It’s still taxation without representation. It still picks winners and losers because some corporations get to opt out of the requirements that hit everyone else. It still infringes on states’ rights, and it still weaponizes the IRS against Americans who just simply seek freedom and choices and sensibility in their families’ health care. The IRS will be taxing aspects of this without representation because we have no choice. We’re shackled to politicians’ whims and special interests’ bullying interests, which does violate the Constitution, and it actually allows government to have a lien on our health.” “People need to know it’s the foundation, it’s the premise,” Palin said. “I don’t know why we’re still even giving an inch on aspects of socialized medicine via this new RINO-care proposal. Is that okay with conservatives, with Republicans in office? They say they want the patient first. They say they want freedom. They say they want a free market to drive the insurance system that we have in America. But no, government is still in control. Government actually has a lien on our health because they lord over us penalties if we want to opt out of a big government mandate.” When asked what she would say to Ryan if he were on Breitbart News Saturday with her this weekend—Ryan has refused to come on the program to discuss these matters and will not answer Breitbart News’s questions about the bill —Palin said she has lots for Ryan to explain here. But she also noted that Republicans party-wide agree that Obamacare is awful and needs to be repealed. “There is much that we agree on,” Palin said. “Thank the Lord, we all agree that Obamacare is devastating one-sixth of our economy. That’s what health care encompasses. Once the government took it over—it obviously is unaffordable, unsustainable and unwanted. So, from the get-go, thank the Lord we all have that in common, and we want to do away with Obamacare. I would ask Paul Ryan’s forgiveness if I come across sounding like I’m just whining and complaining about a problem without proposing a solution. Like Teddy Roosevelt said, that is the definition of whining. So I want to propose solutions, and I want Paul Ryan to listen to the people who are suggesting that, okay, if government is going to be this involved in our healthcare system and choices, then allow the states to take this over. Get it out of big government’s hands. The most responsive level of government is that which is closest to the people. If you’re not going to allow individuals to have the freedoms and the autonomy and the choices provided in their health care, at least let it be a states’ rights issue. So that’s one.” “And then let’s talk about the tort reform that I still don’t see in the new proposal,” Palin continued. “I’d like Paul Ryan to address that more clearly. I’d like him to really talk about how he proposes to tackle the waste and the fraud in the healthcare system. I’d really like him to talk about the interstate commerce allowance now because we know that that has caused a lack of competition, and I really want him to address just that good old American freedom of choice. How can he convince the American people that this isn’t just still big government in bed with big pharma and big Wall Street and sticking it to the people with all its globaloney that was part of Obamacare. How is this RINO-care any different?” Palin concluded the interview by noting that she has the utmost confidence that President Trump will move to scrap Ryan’s bill and fix this whole process before this gets out of hand. “He will step in and fix it,” Palin said. “I have great faith that President Trump is one who will fulfill campaign promises. He already has a track record of doing so well in these first months, I’m just really proud to have been part of the constituency that wanted him in there and worked hard to get him in there. So, yeah, I’m sure that President Trump is going to do the right thing and listen to all sides, of course, but understand, especially, that as a businessman, he’s going to understand whether this makes sense in his vision of how to grow businesses and how to get government off our back and back on our side. How will we create a smaller, smarter government with a proposal like this that basically allows for the continuation of a growth of government? That’s what any aspect of Obamacare or RINO-care does. So asking President Trump specifically about how running a business, not a Wall Street business, but mom-and-pop main street business, how does RINO-care help their business get to grow and drive and survive in this economy?” LISTEN TO FORMER ALASKA GOV. SARAH PALIN ON BREITBART NEWS SATURDAY: ",
      "date": "11 Mar 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin on John McCain: ‘Today We Lost an American Original’",
      "url": "https://www.breitbart.com/politics/2018/08/25/sarah-palin-on-john-mccain-today-we-lost-an-american-original/",
      "subtitle": "Sarah Palin, former Alaska governor and 2008 vice presidential candidate, called her former running mate Sen. John McCain (R-AZ) a “maverick and a fighter” in a statement after his death Saturday afternoon.",
      "author": "Kristina Wong",
      "content": " “Today we lost an American original. Sen. John McCain was a maverick and a fighter, never afraid to stand for his beliefs. John never took the easy path in life — and through sacrifice and suffering he inspired others to serve something greater than self,” she said. “John McCain was my friend. I will remember the good times. My family and I send prayers for Cindy and the McCain family.” After McCain became the GOP nominee in 2008, he chose Palin as his running mate, an unconventional pick that underscored his “maverick” streak. She tweeted out a picture of the two of them on the 2008 campaign trail:  McCain died Saturday afternoon, after a long fight with brain cancer. His family announced Friday morning that he was ending treatment.",
      "date": "25 Aug 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Exclusive — Sarah Palin to Ted Cruz: Delete Your Career",
      "url": "https://www.breitbart.com/politics/2016/07/20/exclusive-sarah-palin-ted-cruz-delete-career/",
      "subtitle": "In an exclusive statement to Breitbart News, former Alaska Governor and 2008 Vice Presidential nominee Sarah Palin weighed in on Senator Ted Cruz’s refusal to honor his pledge and endorse the GOP nominee Donald Trump.",
      "author": "Breitbart News",
      "content": " Palin, whose endorsement of Cruz’s long-shot Senate bid in 2012 was credited by Cruz himself as the reason why he won the race that launched his national political career, gave the following statement to Breitbart after delegates booed Cruz off the stage at the Republican National Convention on Wednesday night: Turns out Ted Cruz’s partner, Carly Fiorina, had a more graceful exit from the political stage than he had. Cruz’s broken pledge to support the will of the people tonight was one of those career-ending “read my lips” moments. I guarantee American voters took notice and felt more unsettling confirmation as to why we don’t much like typical politicians because they campaign one way, but act out another way. That kind of political status quo has got to go because it got us into the mess we’re in with America’s bankrupt budgets and ramped up security threats. It’s commonplace for politicians to disbelieve their word is their bond, as evidenced by Cruz breaking his promise to endorse his party’s nominee, evidently thinking whilst on the convention stage, “At this point, what difference does it make?” We’ve been burned so horribly by that attitude that voters won’t reward politicians pulling that “what difference does it make” stunt again. Politicians will see — it makes all the difference in the world to us. Palin also passed along the following video: ",
      "date": "20 Jul 2016",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Exclusive–Sarah Palin Shreds Liz Warren for Ripping Off Her ‘Fight Like a Girl’ Quote",
      "url": "https://www.breitbart.com/politics/2017/04/18/exclusive-sarah-palin-shreds-liz-warren-for-ripping-off-her-fight-like-a-girl-quote/",
      "subtitle": "Sen. Elizabeth Warren (D-MA) tweeted “fight like a girl” to her followers Tuesday. She later used the same phrase in an interview with National Public Radio promoting her new book.",
      "author": "Ian Mason",
      "content": "  The line may seem familiar. It was a popular catch-phrase of a woman so-called “progressives” have loved to mock and reveled in ridiculing since her explosion onto the national political scene in 2008: former Alaska Governor Sarah Palin. Imitation may be the sincerest form of flattery, but when Governor Palin learned of Warren cribbing her line, she told Breitbart News, “I don’t know. Coming from liberals who urge women to claim victimization, ‘Fight like a girl’ just doesn’t sound the same as when legit fighters for equality say it, mean it, live it, and will never give it up.” Warren delivered the line electronically, standing beside the art installation “Fearless Girl,” a copper figure of a small girl in a pouty pose. The little statue has caused a big stir on the left-wing since it was installed on Wall Street in front of the much more famous 1987 work “Charging Bull” by Italian artist Arturo Di Modica. While supporters of the “Fearless Girl” see it as a symbol of feminist resistance to the greed of institutional finance, they might be surprised to learn the little statue was bankrolled by multinational finance giant State Street Global Advisors, the world’s third largest asset manager with over $2.4 trillion — with a T— under its authority. State Street Global claims their motive in funding the addition was to promote its ongoing “Campaign for Enhancing Gender Diversity in Corporate Leadership Roles.” Professional feminist activists, politicians like Senator Warren, and their friends in the mainstream media were quick to seize on the diminutive statue as an important symbol of female empowerment. Di Modica, for his part, explained to Marketwatch how embarrassing he finds the whole episode. Di Modica spent $350,000 of his own money crafting “Charging Bull” and risked legal sanction by covertly dumping the statute in front of the New York Stock Exchange as a symbol of economic vitality and virility in the aftermath of 1987’s devistating stock-market crash. He compared this corporate addition to his work to someone putting an AR-15 rifle in the hands of Michelangelo’s David. “That is not a symbol! That’s an advertising trick,” he told Marketwatch. As for those who think it’s a symbol of feminine achievement? “They made a mistake,” Di Modica said. Senator Warren, however, seems not to think so. She even channels the “Fearless Girl’s” hands-on-hips stance on the cover of her new book on “the battle to save America’s middle class.” The multi-millionaire Massachusetts senator, however, is far less able to channel governor Palin’s fiery appropriation of the age-old tease “fight like a girl.” In more than a mere tweet, the self-described “hockey mom” belted the phrase out in front of the Wisconsin State Capitol in Madison, Wisconsin after thousands of public sector union members threatened to shut the state down over measures designed to curb their outsized influence in Wisconsin politics. She spoke to ordinary Wisconsinites after their refusal to give in to leftist thuggery yielded a historic victory. Rather than fit in nicely with her party’s latest fad, as Warren has done with feminists’ favorite new statue, when Palin used “fight like a girl” in the “Tea Party Spring” of 2011, she did so to call out her own party’s establishment, drawing contrast between her and the populist-nationalist grassroots’ tenacity and Washington Republicans’ refusal to engage in political combat with the entrenched leftist interests. “Maybe I should ask some of the Badger women’s hockey team, those champions … ” she told the crowd, “If we should be suggesting to GOP leaders they need to learn how to fight like a girl!” Breitbart News’s own founder, the Pioneer of Populist Political Pugilism, the irreplaceable Andrew Breitbart, introduced Palin’s 2011 speech, calling out big labor leader Richard Trumka of the AFL-CIO for siding with cartelized state employees over ordinary private sector taxpayers who make up traditional union membership and have deserted unions in droves. He appealed to the “silent majority” against these forces of division hawking race and class. He hit the left on its constant tone-policing patronization. And he called out the “community organizer in chief,” setting the stage for Palin to deliver her stirring address.  In the lead-up to “fight like a girl,” Palin appealed to traditional union families and other groups commonly forgotten by the Republican establishment. She talked “real solidarity.” She spoke for a “common good” and fair solutions, and against special interests, left and right, teachers’ union and Wall Street. Palin used “fight like a girl” to exhort, from everyone in the Wisconsinite populist grassroots, the stubborn determination to win so characteristic of the middle-American woman and so absent from the “conservative” class in Washington.  By contrast, Warren used the phrase as a cheap piggy-back on an even cheaper corporate ode to gender warfare. The example she cites of the phrase in her National Public Radio interview was even more telling. Warren describes seeing a little girl riding on her father’s shoulders at an anti-Trump so-called “women’s march,” complete with knit pink “pussy hat.” She held a sign emblazoned with that phrase, “fight like a girl,” once so subversive, so apt to unify, but now — in its obviously written-by-her-parents-and-put-in-her-hand guise — so easily dismissed, so calculated to divide, and so utterly unoriginal.",
      "date": "18 Apr 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Exclusive — Sarah Palin: Alabama Lawmaker’s Comments on Abortion ‘Proof that Evil’s Overtaken Some Human Beings’",
      "url": "https://www.breitbart.com/politics/2019/05/03/exclusive-sarah-palin-alabama-lawmakers-comments-on-abortion-proof-that-evils-overtaken-some-human-beings/",
      "subtitle": "Former Republican Alaska Gov. Sarah Palin reacted Thursday to vile abortion comments made by Democratic Alabama State Rep. John Rogers earlier this week, saying they are “proof that evil’s overtaken some human beings.”",
      "author": "Kyle Morris",
      "content": " “[It is] proof that evil’s overtaken some human beings. It’s shocking that these people would be elected to lead,” Palin exclusively told Breitbart News. “I really don’t want to live in a world like this; do others agree with me or am I just really out of touch with what passes as ‘leadership’ today?” While debating a bill that would ban most abortions in the state of Alabama, Rogers stated, “Some kids are unwanted, so you kill them now or you kill them later. You bring them in the world unwanted, unloved, you send them to the electric chair. So, you kill them now or you kill them later.” In opposition to the bill, Rogers also said some children “will be retarded and half-deformed.” “Some parents can’t handle a child with problems,” he said. “It could be retarded. It might have no arms and no legs.” Palin, who has been an outspoken advocate for the special needs community, has a son with Down Syndrome.  After his comments drew immense criticism from politicians and members of the media, including Donald Trump Jr., Rogers said in an interview with WVTM 13 that President Trump’s son is “proof that mothers ought to have the right to have an abortion” and claimed, “He is evidently retarded or crazy.”  In the same interview, Rogers also added, Trump Jr.’s “mother should have aborted him [before] he was born.” Alabama lawmakers in the House voted, 74-3, to approve the legislation that would ban most abortions in the state after most Democrats walked out of the chamber, refusing to vote. “The Human Life Protection Act, HB 314, would make abortion a Class A felony and attempted abortion a Class C felony. The only exceptions are in cases in which ‘abortion is necessary in order to prevent a serious health risk to the unborn child’s mother,'” Breitbart News’ Dr. Susan Berry stated. Berry added, “The measure would make performing an abortion punishable by a minimum of ten years for an abortionist.” Follow Kyle on Twitter @RealKyleMorris and Facebook.",
      "date": "3 May 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Deb Fischer Primary Victory Shocks Political World",
      "url": "https://www.breitbart.com/politics/2012/05/15/deb-fischer-shocks-political-world/",
      "subtitle": "Nebraska state Senator Deb Fischer rocketed out of nowhere to win the GOP senate primary on Tuesday, sending shockwaves across the political world from Nebraska to Washington, D.C.",
      "author": "Tony Lee",
      "content": "  The Republican establishment spent nearly $3 million to support state attorney general Jon Bruning. The Washington conservative establishment spent nearly $3 million to prop up their candidate, Don Stenberg, who never got traction despite all of his endorsements. But it took just 135 words from former Alaska Gov. Sarah Palin to propel Fischer to the head of the pack and give her the momentum, buzz, and name identification to capitalize on some of the groundwork she had diligently laid. The message was clear: the conservative grassroots are fed up and candidates favored by both the Republican and the Washington conservative establishment are not safe. Fisher received 41 percent of the vote to Bruning’s 36 percent and Stenberg’s 19 percent. “I never planned to run for the United States Senate, and most of you are the reason why I jumped in,” Fischer said in her victory speech on Tuesday night. “I wasn’t happy with what was happening in Washington, and I don’t think anyone is.” Until Palin endorsed Fischer by writing her a note, nobody thought Fischer had a chance of entering the general election to become Nebraska’s next Senator. “As recently as a week ago, Deb Fischer was dismissed by the establishment. Why? Because she is not part of the good old boys’ permanent political class,” Palin wrote in a Facebook note. “The message from the people of Nebraska is simple and powerful: America is looking for real change in Washington, and commonsense conservatives like Deb Fischer represent that change. “I applaud Moms like Deb Fischer who are bold enough to step up and run on a conservative platform to restore America and protect our children’s future,” Palin continued. “Congratulations to the people of Nebraska. As the Huskers’ fight song goes: ‘The eyes of the land, upon every hand, are looking at you. Fight on for victory!'” Fischer was also helped when The Ending Spending Action Fund, an independent group focused on electing “common-sense fiscal conservatives who understand the need to fundamentally reform our government,” ran $200,000 worth of ads for Fischer last weekend. Brian Baker, president of the Ending Spending Action Fund, told Breitbart News, “The lesson here is simple: the people are in charge and they are sick of business as usual.” And She-PAC, the new conservative group that was recently formed to help elect more women to Congress, seeded the ground for Fischer. ShePAC was her first national endorsement, and the group made two ads on behalf of Fischer and also promoted the ads with social networking buys that were smartly micro-targeted toward conservative women in Nebraska. Suzie Terrell, a co-chair of She-PAC, told Breitbart News that her organization “learned of the ranching mom from the Nebraska Sandhills” when she was at 2 percent in the polls. Terrell noted that Fischer’s “positive, issue-based grassroots campaign represented the exact type of conservative woman we helped to promote – and we are proud to have been her 1st national endorsement.” “As the other candidates quarreled over trivial issues like who’s following whose teenage daughter on twitter, Deb focused on voters and the issues and won,” Terrell said. “We look forward to continuing to support Deb Fischer and the four other conservative women who will Stop Harry Reid in 2012.” Fischer will now face Democrat Bob Kerrey, who won his party’s primary, in the general election. Kerrey had been Nebraska’s Senator before leaving the state to take on various ventures, such as being president of a liberal university in New York. Fischer alluded to this in her victory speech when she said, “we don’t need the same type of person who supposedly is going to represent Nebraska.” She said she would be a “different,” “tough” and “effective” Nebraskan who represents Nebraska in Congress. Last week, Fischer’s campaign manager Aaron Trost told Breitbart News that because the could not match Bruning and Stenberg dollar for dollar, they laid a grassroots foundation, hoping they could surge in the final weeks of the campaign. Fischer was also helped by former Nebraska Gov. Kay Orr and Congressman Jeff Fortenberry. Her final surge began, though, when Palin single-handedly leveled the playing field with her endorsement and proved her endorsement effectively wipes out the financial advantages and the endorsements other candidates have. To be fair, had Fischer lost, the mainstream media and political establishment would have spun it as a defeat for Palin. And this is why a Fischer victory should be noted as more proof that Palin — and the Tea Party — have not faded, and their influence is only growing. “You can’t quit yet,” Fischer told the audience at her victory party, noting that the general election starts on Wednesday. Like Fischer, Palin and the Tea Party are just getting started.  ",
      "date": "15 May 2012",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Appeals Court Reinstates Sarah Palin Lawsuit Against New York Times",
      "url": "https://www.breitbart.com/politics/2019/08/06/appeals-court-reinstates-sarah-palin-lawsuit-against-new-york-times/",
      "subtitle": "Former vice presidential nominee Gov. Sarah Palin’s (R-AK) lawsuit against the New York Times for defamation can proceed, a federal appeals court ruled on Tuesday.",
      "author": "Ken Klukowski",
      "content": " “This case is ultimately about the First Amendment, but the subject matter implicated in this appeal is far less dramatic: rules of procedure and pleading standards,” began the U.S. Court of Appeals for the Second Circuit. Judge Jed Rakoff of the Southern District of New York, appointed by Bill Clinton, had dismissed Palin’s complaint for failing to state a plausible claim. A three-judge panel of the Second Circuit disagreed, reinstating the lawsuit. The lawsuit arose in the aftermath of depraved Tucson shooter Jared Loughner’s murderous rampage in Tucson in 2011 – killing six people, including a federal judge, John Roll – and seriously wounding Rep. Gabrielle Giffords (D-AZ). Palin’s political committee, SarahPAC, had run ads surrounding Congress’s voting on the Affordable Care Act (aka, “Obamacare”), with “a map that superimposed the image of a crosshairs target over certain Democratic congressional districts.” “In the wake of the Loughner shooting, some speculated that the shooting was connected to the crosshairs map,” the Second Circuit continued. “No evidence ever emerged to establish the link,” Judge John Walker wrote for the panel. “In fact, the criminal investigation of Loughner indicated that his animosity toward Representative Giffords had arisen before SarahPAC published the map.” When left-wing fanatic James Hodgkinson opened fire in 2017 in an effort to assassinate Republican congressmen, severely wounding conservative Steve Scalise (R-LA), the New York Times ran an editorial citing SarahPAC’s ad from 2011, commented that the “link to political incitement was clear” to the Loughner shooting, then went on to discuss Hodgkinson’s act of domestic terrorism. “The Times faced an immediate backlash for publishing the editorial,” Walker continued, noting that the paper later published a correction which admitted that in fact, “no such link was established.” Palin sued the Times for defamation in federal court 12 days after the editorial ran, and the Times filed a motion to dismiss the case. The case then “took an unusual procedural turn,” the New York City-based appeals court observed, when the judge “held an evidentiary hearing on the motion to dismiss.” Under the Federal Rules of Civil Procedure, a district court must generally accept the facts alleged by a plaintiff as true, and cannot dismiss a case for failing to make a claim unless, even if all the claimed facts are true, the law would still be on the side of the defendant. “On August 29, 2017, the district court, relying on evidence adduced at the hearing, granted the Times’ motion to dismiss,” the panel recounted. The appellate court noted that a district court cannot consider evidence outside a plaintiff’s complaint in a motion to dismiss, and instead must convert that motion to one for summary judgment if the judge wants to decide the case at that stage. However, once a court moves into summary-judgment territory, both sides must have the opportunity to present their evidence and argument. “Even if the plaintiff had been given notice and the court had explicitly converted the motion to one for summary judgment,” the Second Circuit reasoned, “we would still have to vacate because the district court’s opinion relied on credibility determinations not permissible at any stage before trial.” The Second Circuit concluded that Palin stated a plausible claim of defamation, and must now be given an opportunity to present evidence to make her case. The panel in question was comprised of two Republican-appointed judges and one judge appointed by Barack Obama. The decision in Palin’s favor was unanimous. “This is – and always has been – a case about media accountability,” Palin’s lawyer Libby Locke told Breitbart News. “We are pleased with the court’s decision, and look forward to starting discovery and ultimately proceeding to trial.” The case is Palin v. New York Times Co., No. 17-3801-cv in the U.S. Court of Appeals for the Second Circuit, and No. 17-cv-4853 in the U.S. District Court for the Southern District of New York. Ken Klukowski is senior legal analyst for Breitbart News. Follow him on Twitter @kenklukowski.",
      "date": "6 Aug 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin, Loyal Running Mate, Excluded from John McCain’s Funeral",
      "url": "https://www.breitbart.com/politics/2018/08/29/sarah-palin-loyal-running-mate-excluded-from-john-mccains-funeral/",
      "subtitle": "Former Alaska Gov. Sarah Palin, who was Sen. John McCain’s (R-AZ) running mate in the 2008 presidential election, has been excluded from his funeral.",
      "author": "Joel B. Pollak",
      "content": " Breitbart News has independently confirmed an earlier report in People magazine, which reported that Palin was not sent an invitation and was told through intermediaries to stay away from the ceremony. McCain fundraiser Carla Eudy confirmed to People that Palin had not been invited — possibly, People speculated, at the behest of the McCain family. The news comes on the tenth anniversary of the date in 2008 when Palin was announced as McCain’s pick for vice president. Palin now joins President Donald Trump on the list of those barred from the funeral. But unlike Trump, Palin never feuded with McCain and never criticized him. When news broke on Saturday of McCain’s passing, Palin said, “Today we lost an American original. Sen. John McCain was a maverick and a fighter, never afraid to stand for his beliefs. John never took the easy path in life — and through sacrifice and suffering he inspired others to serve something greater than self. “John McCain was my friend. I will remember the good times. My family and I send prayers for Cindy and the McCain family.” Last year, when McCain was reported to have said that he regretted choosing Palin instead of Sen. Joe Lieberman (I-CT), Palin described the news as a “gut punch” but refused to blame McCain personally, telling the UK Daily Mail that she blamed his “ghostwriters” for such reports. When McCain selected Palin as his running mate, the two had both built reputations as corruption-busting “maverick” leaders who were not afraid to buck their own parties. After the 2008 election, they moved in separate political directions. Palin became an inspirational figure for the Tea Party and for grassroots conservatives in general. McCain campaigned as a conservative border hawk in his 2010 re-election race but became a harsh critic of the Tea Party, calling Sens. Ted Cruz (R-TX) and Rand Paul (R-KY) “wacko birds.” Many in the Beltway blamed Palin for McCain’s loss in 2008 — even though Barack Obama had benefited from a sudden financial crisis and a biased press corps. That view seemed to have seeped into McCain’s own thinking. Still, Palin never took offense and always honored McCain. Even after being excluded from the funeral, she declined to criticize him. People quoted a source close to the Palin family: “[O]ut of respect for Sen. McCain and his family we have nothing to add at this point. The Palin family will always cherish their friendship with the McCains and hold those memories dear.” McCain will be laid to rest on Sunday in Annapolis, following several days of memorial events and ceremonies. Joel B. Pollak is Senior Editor-at-Large at Breitbart News. He is a winner of the 2018 Robert Novak Journalism Alumni Fellowship. He is also the co-author of How Trump Won: The Inside Story of a Revolution, which is available from Regnery. Follow him on Twitter at @joelpollak.",
      "date": "29 Aug 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin Tells Joy Behar ‘Suck It Up, Cupcake’ After Kid Rock Jab",
      "url": "https://www.breitbart.com/entertainment/2018/12/02/sarah-palin-tells-joy-behar-suck-it-up-cupcake-after-kid-rock-jab/",
      "subtitle": "Former Alaska Gov. Sarah Palin scoffed at ABC Host Joy Behar’s “crocodile tears” and told her to “suck it up, cupcake,” while citing a Breitbart News article reporting on the removal of Kid Rock as grand marshal of the Nashville Christmas Parade.",
      "author": "Warner Todd Huston",
      "content": " The former GOP vice presidential hopeful jumped to her Facebook page to ridicule ABC’s The View host, who reacted with outrage after rock singer Kid Rock called her a “bitch” on live TV during a Friday interview with Fox & Friends. Palin was incredulous at Behar’s mock outrage over being called a bitch especially considering all the names she has called others. “Buckle up,” Palin wrote on her Facebook page. “Save the crocodile tears @joyvbehar – if you can dish it out you sure as heck better be ready to take it in.” Palin went on saying, “You sat idly by, downright giddy, as guests on YOUR show called my daughter a hooker? You’ve said worse about me (and other women), but I’ve got other things to do than spend precious time googling it all.” “Joyless B – suck it up, cupcake,” Palin jabbed before adding a link to a report citing the time her daughter was called a “hooker” on The View.  Palin’s comments were sparked by a Friday interview where Rock made to criticize political correctness and brought Behar into the conversation. On Live TV, Rock told Fox & Friends host Steve Doocy, “God forbid you say something a little bit wrong you’re racist, homophobic, Islamophobic… people need to calm down, a get a little less politically correct, and, I would say love everybody. Except I’d say screw that Joy Behar bitch, everybody but that.” Rock later apologized for using the curse word but did not apologize for the sentiment he was trying to relay to viewers. “Behar has been an outspoken critic of President Donald Trump, and when myself, Sarah Palin and Ted Nugent visited the White House last year, Behar called it ‘the saddest day in the history of the White House since the British burned it to the ground in 1814,'” Rock said in a statement released later on Friday. “Today I said ‘Screw that Joy Behar b—h.’ Mess with the bull, you get the horns. End of story. I apologized for cursing on live TV, I will not for my sentiment nor do I expect an apology from her or anyone else who has choice words for me or doesn’t like me. God Bless America.” Follow Warner Todd Huston on Twitter @warnerthuston.",
      "date": "2 Dec 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin",
      "url": "https://www.breitbart.com/tag/sarah-palin/",
      "subtitle": "null",
      "author": "Breitbart News",
      "content": "                             ",
      "date": "9 Sep 2019, 2:07 PM PDT",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Exclusive—Sarah Palin: Trump Can See Greenland from His House",
      "url": "https://www.breitbart.com/politics/2019/08/22/exclusive-sarah-palin-trump-can-see-greenland-from-his-house/",
      "subtitle": "The President of the United States wants to buy an icy northern territory from a foreign country. Critics hate the idea and mock it as absurd and wasteful. But the President makes the deal, and the purchase proves to be one of the most brilliant geopolitical deals in history—a huge boon to American strength and prosperity.",
      "author": "Sarah Palin",
      "content": " Am I describing the 45th President’s effort to buy Greenland from Denmark? Nope, I’m describing the 17th President’s successful effort to buy Alaska from Russia in 1867. It was one of the best bargains America ever struck. If President Trump can pull off another deal like that, I say God bless him! Greenland’s vast arctic expanse—which, at over 800,000 square miles, is more than a quarter the size of the U.S. Lower 48—is surely another Alaska in terms of untapped wealth. The media would do well to chill with mocking President Trump and instead learn some U.S. history. Our country’s desire to purchase Greenland predates the purchase of Alaska. Back in 1867, the effort to buy Alaska was the brainchild of then-Secretary of State William Seward, who had originally been appointed to the post by Abraham Lincoln. Under President Lincoln, Seward steered America’s diplomacy during the Civil War, and that experience gave him a deep appreciation of the importance of territory as a source of both wealth and security.  He understood that the possession of a given piece of land can be used as a forward military base for the United States, and therefore not as launching pad for a potential foe. Those were the days, after all, when the great powers of the era—Britain, France, Russia, and soon Germany and Japan—were sending their gunboats around the world looking to snap up colonies.  So as a simple matter of self-defense, the United States had little choice but to muscle up geographically. With that in mind, Seward’s first idea was to purchase … Greenland. That’s right, he pursued Greenland first. But the Danes wouldn’t sell. Seward also wanted to buy islands in the Caribbean from, again, Denmark. And once again, the Danes wouldn’t sell, although in that instance the sale finally did go through in 1917, and that’s how Uncle Sam came to own the U.S. Virgin Islands. In the meantime, Seward kept searching. Seeking the most strategic location and vast natural resources, he cast his eye on the beautiful territory that would become our Last Frontier, Alaska. The Russians had been here—where I stand today—for centuries, easily hopping across the 50-mile-wide Bering Strait from Siberia to “Russian America.” (And, yes, that body of water is so narrow you really can stand in Alaska and actually see Russia. So Tina Fey can suck it.) The Russians weren’t smart enough to do much with Alaska beyond over-whaling and over-hunting.  So when Seward offered the Tsar two-cents an acre—$7.2 million for the whole kit and caboodle—the art of this deal created a bigger, better, safer, and richer America. Of course, then as now, the critics did what they always do—huddle up, sit on their heinies, and criticize.  The Alaska purchase was lampooned as “Seward’s Folly” and “Seward’s Ice Box.” But Alaska wasn’t an “ice box”—it was an absolute gold mine … literally. The critics stopped laughing in 1896 when gold was discovered in the Yukon, and soon the Klondike Gold Rush established Alaska as a major magnet. The rich veins even attracted a young German immigrant named Frederick Trump—President Trump’s grandfather—who struck it rich up north and later settled in New York City. Perhaps the Trumps have always had their eye on valuable “glacierfront” real estate. Today, Alaska is home to more than 700,000 hardy Americans, generating an annual economic output of around $50 billion.  Seward’s “folly” really is Seward’s windfall. Now let’s go back to the place Seward eyed first. Greenland is economically valuable because of its immense natural resources. Aside from yuge oil and gas development possibilities and enormously rich fisheries, Greenland has iron ore, lead, zinc, gold, and uranium. But perhaps most importantly, the arctic region, and Greenland in particular, is full of rare earth elements, a crucial material necessary for manufacturing just about everything from computer chips to fiber optics to missiles to tanks and you name it. We need rare earth elements to sustain our manufacturing sector and equip our military. And, as shocking as it is to say this, our country is currently dangerously dependent on China to supply our rare earth metals. Since when is it a good idea to be totally dependent on your strategic enemy for an essential resource? China knows they have us over a barrel on this. In fact, as Breitbart’s John Carney reported last May, Beijing has threatened to “weaponize” our dependence on their rare earths as leverage against us in their trade fight. So, is it any wonder that China also has eyes on Greenland? In fact, China already has a large commercial presence there, as they’ve been scooping up rare earth mining rights. No doubt they would love to get control over all of its resources. They are quite open about their plans to make Greenland a key part of what they call their “Polar Silk Road.” They’re eagerly offering to build international airports, which, of course, they will control. China understands that Greenland is strategically vital. Up there at the top of the world, it has a commanding position on the Arctic Ocean, not far from Russia.  I, and others, predict the Arctic Ocean will become a key international seaway, with an incalculable advantage going to Greenland. It’s precisely because of Greenland’s strategic location that we put our northernmost military base there. The Thule Air Force base is crucial to our nation’s missile defense system. Again, is it any wonder why China is so eager to get a foothold in Greenland? As William Seward knew when he purchased Alaska from the Russians, controlling a strategic location allows the United States to establish a forward base and prevent our enemies from doing the same. So, as a matter of national security as well as economic prosperity, it makes sense for the United States to have a strong footprint in Greenland. So, go for it, Mr. President. America can help Make Greenland Great Again! And a Trump Tower up there could be very cool. Sarah Palin is the former governor of Alaska and the 2008 Republican vice presidential nominee.",
      "date": "22 Aug 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Exclusive–Sarah Palin: 'It's Time to Impeach' President Obama",
      "url": "https://www.breitbart.com/politics/2014/07/08/exclusive-sarah-palin-time-to-impeach-president-obama/",
      "subtitle": "Enough is enough of the years of abuse from this president. His unsecured border crisis is the last straw that makes the battered wife say, “no mas.”",
      "author": "Sarah Palin",
      "content": " Without borders, there is no nation. Obama knows this. Opening our borders to a flood of illegal immigrants is deliberate. This is his fundamental transformation of America. It’s the only promise he has kept. Discrediting the price paid for America’s exceptionalism over our history, he’s given false hope and taxpayer’s change to millions of foreign nationals who want to sneak into our country illegally. Because of Obama’s purposeful dereliction of duty an untold number of illegal immigrants will kick off their shoes and come on in, competing against Americans for our jobs and limited public services. There is no end in sight as our president prioritizes parties over doing the job he was hired by voters to do. Securing our borders is obviously fundamental here; it goes without saying that it is his job. The federal government is trillions of dollars in debt; many cities are on the verge of insolvency; our overrun healthcare system, police forces, social services, schools, and our unsustainably generous welfare-state programs are stretched to the max. We average Americans know that. So why has this issue been allowed to be turned upside down with our “leader” creating such unsafe conditions while at the same time obstructing any economic recovery by creating more dependents than he allows producers? His friendly wealthy bipartisan elite, who want cheap foreign labor and can afford for themselves the best “border security” money can buy in their own exclusive communities, do not care that Obama tapped us out. Have faith that average American workers – native-born and wonderful legal immigrants of all races, backgrounds, and political parties – do care because we’re the ones getting screwed as we’re forced to follow all our government’s rules while others are not required to do so. Many now feel like strangers in their own land. It’s the American worker who is forced to deal with Obama’s latest crisis with our hard-earned tax dollars while middle class wages decrease, sustainable jobs get more scarce, and communities become unrecognizable and bankrupted due to Obama’s flood of illegal immigration. Who’s looking out for the American workers? Who has their backs? Who fights for them? We should. President Obama’s rewarding of lawlessness, including his own, is the foundational problem here. It’s not going to get better, and in fact irreparable harm can be done in this lame-duck term as he continues to make up his own laws as he goes along, and, mark my words, will next meddle in the U.S. Court System with appointments that will forever change the basic interpretation of our Constitution’s role in protecting our rights. It’s time to impeach; and on behalf of American workers and legal immigrants of all backgrounds, we should vehemently oppose any politician on the left or right who would hesitate in voting for articles of impeachment. The many impeachable offenses of Barack Obama can no longer be ignored. If after all this he’s not impeachable, then no one is.",
      "date": "8 Jul 2014",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin",
      "url": "https://www.breitbart.com/author/sarah-palin/",
      "subtitle": "null",
      "author": "",
      "content": "",
      "date": "22 Aug 2019, 3:00 PM PDT",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    }
  ]
}