{
  "articles": [
    {
      "title": "Steve Harvey Attacks ‘Hillbilly’ Mitch McConnell for Rejecting Reparations",
      "url": "https://www.breitbart.com/entertainment/2019/06/20/steve-harvey-attacks-hillbilly-mitch-mcconnell-for-rejecting-reparations/",
      "subtitle": "Daytime TV star and radio host Steve Harvey ripped Senate Majority Leader Mitch McConnell (R- KY) over his dismissal of reparations Wednesday, calling him a “hillbilly.”",
      "author": "Hannah Bleau",
      "content": " On Wednesday’s The Steve Harvey Morning Show, Harvey responded to McConnell’s dismissal of issuing reparations, calling him a “hillbilly” and asserting that America’s election of a black president meant nothing. “The Civil War broke out because you wanted to keep slavery,” Harvey argued. “Because you 13 southern states wanted to keep slavery.” It is unclear who Harvey is referring to there, as McConnell’s state – Kentucky – did not join the Confederacy. “You weren’t with this message that came from the North to free slaves,” Harvey said. “The second thing, we tried to correct its passage with Civil Rights laws. Y’all fought us on every tooth and nail, you sent guard dogs on us, firehouses, you killed Martin Luther King.” “‘We’ ain’t elect no-damn-body. I promise you, your ass did not vote for him,” Harvey said in response to McConnell’s reminder that America elected a black president – Barack Obama – twice. “You did nothing but try to destroy him,” he continued. “So, what would you expect this hillbilly to say other than what he said?” “You say that you don’t want to be responsible for something that happened I think he said 150 years ago,” Harvey added. “Well, you weren’t there when they wrote this Constitution that you love to throw up in everybody’s face.” On Tuesday, McConnell told reporters on Capitol Hill that paying reparations for “something that happened 150 years ago for whom none of us currently living are responsible” is a bad idea. We’ve tried to deal with our original sin of slavery by fighting a civil war, by passing landmark civil rights legislation. We’ve elected an African-American president. I think we’re always a work in progress in this country, but no one currently alive is responsible for that and I don’t think we should be trying to figure out how to compensate for it. McConnell added that issuing reparations would be logistically impossible. It’s hard to figure out who to compensate,” the Republican leader said. “Waves of immigrants who’ve come to the country as well and experiences dramatic discrimination of one kind or another. So no, I don’t think reparations are a good idea.”  On Wednesday, former Oakland Raider Burgess Owens testified before the House Judiciary Subcommittee and blasted the Democrat Party for its role in slavery, segregation, and the systemic oppression of black Americans. “Let’s pay restitution,” Owens said. “How about the Democratic Party pay for all the misery brought to my race?”",
      "date": "20 Jun 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Whoopi Goldberg Criticizes McConnell for Obstructing Obama: ‘Maybe You Should Pay Reparations for That’",
      "url": "https://www.breitbart.com/clips/2019/06/20/whoopi-goldberg-criticizes-mcconnell-for-obstructing-obama-maybe-you-should-pay-reparations-for-that/",
      "subtitle": "null",
      "author": "Pam Key",
      "content": " Thursday on ABC’s “The View,” co-host Whoopi Goldberg said Senate Majority Leader Mitch McConnell’s (R-KY) should pay reparations for attempting to make former President Barack Obama one-term president. Goldberg said, “Can I point something out? You know, Mitch, you said that you would make him a one-term president. And you did everything you could to not help him in the first four years. Maybe you should pay reparations for that.” Co-host Sunny Hostin said, “I hope people will read this bill, HR 40 because the bill is not actually asking for outright reparations, cash reparations. That’s a very, very small portion of it. It’s asking for a combination of things, but what the bill is about is just a study of the issue. Just a study. It calls for a commission to study the reparations issue. So what I am shocked at is all the backlash to a study.” Co-host Joy Behar said, “Because they know it’s a slippery slope, that’s why.” (h/t Grabien) Follow Pam Key on Twitter @pamkeyNEN",
      "date": "20 Jun 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Warren Teases Master ‘Plan’ to Combat Mitch McConnell, Provides Zero Details",
      "url": "https://www.breitbart.com/politics/2019/06/26/warren-teases-master-plan-to-combat-mitch-mcconnell-provides-zero-details/",
      "subtitle": "Massachusetts Sen. Elizabeth Warren (D) teased a master “plan” to combat Senate Majority Leader Mitch McConnell (R-KY) in the event that Republicans retain the Senate in 2020, but she provided zero details during Wednesday’s Democrat debate.",
      "author": "Hannah Bleau",
      "content": " “Do you have a plan to deal with Mitch McConnell if you don’t beat him in the Senate– if he’s still sitting there as the Senate Majority Leader? It’s very plausible that you could be elected president with a Republican Senate. Do you have a plan to deal with Mitch McConnell?” Chuck Todd asked. “I do,” Warren said to thunderous applause. However, when it came time to elaborate, Warren provided little to no details on her master plan, instead speaking in gross generalizations about Congress reflecting the will of the American people. “We are a democracy, and the way democracy is supposed to work is the will of the people matters,” Warren declared. “Now, we for far too long have had a Congress in Washington that has completely dismissed what people care about across this country.” “They have made this country work much better for those who can make giant contributions, made it work better for those who hire armies of lobbyists and lawyers, and not made it work for the people,” she continued. She said she would, of course, like to see Democrats take the Senate but once again offered no solid plan on how to deal with the plausible scenario of another Republican majority, vaguely declaring that the “fight still goes on” in the event that Democrats fail to take the Senate. “I want to see us get a Democratic majority in the Senate, but short of a Democratic majority in the Senate, you better understand the fight still goes on,” Warren continued. “It starts in the White House,” she said, noting the importance of keeping Democrats energized, even after 2020. “We need to push from the outside, have leadership on the inside, and make this Congress reflect the will of the people,” she added. ",
      "date": "26 Jun 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "McConnell: The Senate’s Border Funding Bill Is ‘The Only Game in Town’",
      "url": "https://www.breitbart.com/clips/2019/06/27/mcconnell-the-senates-border-funding-bill-is-the-only-game-in-town/",
      "subtitle": "null",
      "author": "Ian Hanchett",
      "content": " During a speech on the Senate floor on Thursday, Senate Majority Leader Mitch McConnell (R-KY) stated that the border funding bill passed by the Senate is “the only game in town” and vowed the Senate “is not going to pass a border funding bill that cuts the money for ICE and the Department of Defense.” McConnell said, “I’m glad the speaker and the administration are discussing some of these outstanding issues, but if House Democrats send the Senate back some partisan effort to disrupt our bipartisan progress, we will simply move to table it. The United States Senate is not going to pass a border funding bill that cuts the money for ICE and the Department of Defense. It’s not going to happen. We already have our compromise. The Shelby-Leahy Senate bill is the only game in town. Time to quit playing games. Time to make a law.” (h/t The Hill) Follow Ian Hanchett on Twitter @IanHanchett",
      "date": "27 Jun 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell Wants Nike to Release ‘Betsy Ross’ Sneakers: ‘I’ll Make the First Order’",
      "url": "https://www.breitbart.com/sports/2019/07/03/mitch-mcconnell-wants-nike-to-release-betsy-ross-sneakers-ill-make-the-first-order/",
      "subtitle": "Senate Majority Leader Mitch McConnell (R-KY) is calling on Nike to release its “Betsy Ross Flag” sneakers. Moreover, the Kentucky Republican is also offering to buy the first pair.",
      "author": "Dylan Gwinn",
      "content": " Nike decided to ditch the shoes after former NFL anthem-protester and Nike pitchman Colin Kaepernick raised concerns about the Betsy Ross flag evoking painful memories of a “connection to slavery.” McConnell told the Lexington Herald Leader: If we’re in a political environment where the American flag has become controversial to Americans, I think we’ve got a problem. I hope Nike either releases these shoes or some other shoe maker picks up the flag, puts it on a pair of shoes and starts selling it. I’ll make the first order. Nike has faced tremendous backlash since the Wall Street Journal broke the story that the sportswear giant had decided to scrap the Betsy Ross sneakers at Kaepernick’s request. Though, the backlash hasn’t just come from consumers and Twitter users. Many of the most outspoken critics of the move have come from McConnell’s own caucus. As Breitbart reported on Wednesday, Texas Senator Ted Cruz launched the #WalkAwayFromNike campaign, to boycott the shoemaker until they reverse course. “[U]ntil @Nike ends its contempt for those values I WILL NO LONGER PURCHASE NIKE PRODUCTS. #WalkAwayFromNike RT if you agree.” Missouri Republican Senator Josh Hawley slammed Nike as well for embodying the worst aspects of our “corporate economy,” as well as catering to “Chinese Communists” while refusing to display the American flag.  In a statement to the Hill, Nike claims the decision to pull the shoe was made in an attempt to not “unintentionally offend.” “NIKE made the decision to halt distribution of the Air Max 1 Quick Strike Fourth of July based on concerns that it could unintentionally offend and detract from the nation’s patriotic holiday.” Nike has paid a price for the decision. Republican Governor Doug Ducey of Arizona scrapped an incentives package the state had offered Nike for their manufacturing plant. Follow Dylan Gwinn on Twitter @themightygwinn",
      "date": "3 Jul 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell Trolls Kaepernick, Nike with Betsy Ross Flag on Independence Day",
      "url": "https://www.breitbart.com/sports/2019/07/05/mitch-mcconnell-trolls-kaepernick-nike-with-betsy-ross-flag-on-independence-day/",
      "subtitle": "Senate Majority Leader Mitch McConnell (R-KY) has been known to delight in the teasing, mocking, and trolling, of his political adversaries. It’s also apparent that McConnell’s mockery does not take national holidays off.",
      "author": "Dylan Gwinn",
      "content": " In his Independence Day tweet, the Senate’s top Republican chose to wish Americans a happy 4th of July, while simultaneously trolling Colin Kaepernick and Nike with the Betsy Ross flag.  This isn’t the first time McConnell has sounded off on the Kaepernick/Betsy Ross/Nike saga. Earlier in the week, the Kentucky Republican appealed to Nike to reverse course and release the patriotic sneakers. Moreover, McConnell said that if the shoe giant did put the Betsy Ross sneakers back on the shelves, he’d “make the first order.” “If we’re in a political environment where the American flag has become controversial to Americans, I think we’ve got a problem,” McConnell said. “I hope Nike either releases these shoes or some other shoe maker picks up the flag, puts it on a pair of shoes and starts selling it. I’ll make the first order.” Despite McConnell’s noted trolling abilities, Nike has given no indication of changing their minds on the issue. Follow Dylan Gwinn on Twitter @themightygwinn",
      "date": "5 Jul 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Kentucky Democrat Amy McGrath Launches Bid to Unseat Mitch McConnell",
      "url": "https://www.breitbart.com/politics/2019/07/09/kentucky-democrat-amy-mcgrath-launches-bid-unseat-mitch-mcconnell/",
      "subtitle": "Kentucky Democrat Amy McGrath is launching a bid to unseat Senate Majority Leader Mitch McConnell (R-KY), she announced Tuesday.",
      "author": "Hannah Bleau",
      "content": " “I’m running to replace Mitch McConnell in the U.S. Senate,” the Marine veteran wrote in a tweet accompanied by a three-minute campaign video. “Everything that’s wrong with Washington had to start somewhere—it started with him.”  The challenge of today is inside each of us. How do we reconcile our belief in basic human decency with our anger at this who block progress at all costs? There is a path to resetting our countries moral compass, where each of us is heard and we can become once again the moral and economic leader of a world in disarray.  She is already seeing support from celebrities such as left-wing comedian Chelsea Handler. “Let’s donate and elect people who will take money out of politics, so assholes like Mitch McConnell aren’t making decisions based on donations from the NRA,” Handler tweeted following McGrath’s announcement:   McGrath faces an uphill battle, as McConnell has been a key ally in assisting President Trump to implement his MAGA promises, particularly in the realm of the Supreme Court. Notably, Trump has seen strong support in Kentucky, winning the state in the 2016 general election by nearly 30 percentage points. This would not be McGrath’s first political effort. She ran against Trump-backed incumbent Rep. Andy Barr (R-KY) last year but lost by 3.2 percentage points. McConnell’s team welcomed McGrath to the race Tuesday morning, releasing a video highlighting her extreme positions, such as support for universal health care and abortion.  During a “Meet the Candidates Series” event in November 2017, McGrath described Trump’s 2016 victory as a “sucker punch” and compared it to what she felt after 9/11. “And that morning I woke up like somebody had sucker punched me. I mean, I felt like, ‘what has just happened to my country?’” she said. “The only feeling I can describe that’s any close to it was the feeling I had after 9/11,” she continued. “‘What just happened, where are we going from here?’ And it was that just sinking feeling of sadness, and I didn’t know what to do.”",
      "date": "9 Jul 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Hollywood Goes All In for McConnell Challenger Amy McGrath",
      "url": "https://www.breitbart.com/entertainment/2019/07/09/hollywood-goes-all-in-for-mcconnell-challenger-amy-mcgrath/",
      "subtitle": "A slew of Hollywood’s most far-left figures jumped on social media and applauded Sen. Mitch McConnell’s challenger Amy McGrath on her bid to unseat the longtime Republican leader.",
      "author": "Jerome Hudson",
      "content": " “This is great! A woman who is NOT married to a member of a huge Chinese shipping factory, and who ACTUALLY SERVED IN THE MILITARY, not like #bitchMitch who got out after 5 weeks!” actress-singer Bette Midler said Tuesday.  “Whoopsie, I meant Marine! Let’s donate and elect people who will take money out of politics, so assholes like Mitch McConnell aren’t making decisions based on donations from the NRA,” former Netflix talk show host Chelsea Handler said.  The Kentucky Democrat and Marine veteran Amy McGrath announced her bid to challenge the longtime Majority Leader on Tuesday. “I’m running to replace Mitch McConnell in the U.S. Senate,” McGrath said. “Everything that’s wrong with Washington had to start somewhere — it started with him.” Though for McGrath, unseating the Kentucky Republican will be nothing short of a miracle. McConnell easily defeated his last challenger, Democrat Alison Lundergan Grimes, by more than 16 points in 2014. Still, Hollywood stars feel like Amy McGrath can pull off an upset. Get a load their reactions to her candidacy.       Follow Jerome Hudson on Twitter @jeromeehudson",
      "date": "9 Jul 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell: Obama and I ‘Both Oppose Reparations and… Are the Descendants of Slaveholders’",
      "url": "https://www.breitbart.com/politics/2019/07/10/mitch-mcconnell-quips-hes-like-obama-we-both-oppose-reparations-descendants-slaveholders/",
      "subtitle": "The establishment media took shots at Senate Majority Leader Mitch McConnell (R-KY) over a U.S. census record supposedly detailing his ancestry’s entanglement with slavery, but the Kentucky senator responded by mentioning a shared background with former President Barack Obama.",
      "author": "Hannah Bleau",
      "content": " “You know, I find myself once again in the same position as President Obama,” McConnell told reporters Tuesday. “We both oppose reparations and we both are the descendants of slaveholders”:  An NBC report published Monday cited a U.S. census record, which reportedly indicated that two of McConnell’s great-great-grandfathers – James McConnell and Richard Daley – owned “at least 14 slaves in Limestone County, Alabama.” NBC News reported, “The two great-great-grandfathers, James McConnell and Richard Daley, owned a total of at least 14 slaves in Limestone County, Alabama — all but two of them female, according to the county ‘Slave Schedules’ in the 1850 and 1860 censuses.” NBC used McConnell’s rejection of issuing reparations as a backdrop for the piece, adding that the discovery “came in the wake of recent hearings on reparations before the House Judiciary Subcommittee on the Constitution, Civil Rights and Civil Liberties.” The Senate Majority Leader told media on Capitol Hill last month that reparations are nonsensical because “no one currently alive was responsible for that.” “I don’t think reparations for something that happened 150 years ago for whom none of us currently living are responsible is a good idea,” he told a reporter June 18. He continued: We’ve tried to deal with our original sin of slavery by fighting a civil war, by passing landmark civil rights legislation. We’ve elected an African American president. I think we’re always a work in progress in this country, but no one currently alive is responsible for that, and I don’t think we should be trying to figure out how to compensate for it. First of all, it’s hard to figure out who to compensate. Waves of immigrants who’ve come to the country as well and experiences dramatic discrimination of one kind or another. So no, I don’t think reparations are a good idea:  While the fact remains that McConnell was not complicit in his family’s purported entanglement in slavery, progressive critics argue that he and others like him are benefitting from their ancestor’s actions and should, therefore, be more sympathetic to issuing reparations. Notable figures have rejected McConnell’s stance on reparations. Television star and radio host Steve Harvey went off on McConnell, calling him a “hillbilly” on The Steve Harvey Morning Show last month. “‘We ain’t elect no-damn-body. I promise you, your ass did not vote for him,” Harvey said in response to McConnell’s remark about Barack Obama. “You did nothing but try to destroy him,” he continued. “So what would you expect this hillbilly to say other than what he said?” “You say that you don’t want to be responsible for something that happened, I think he said, 150 years ago,” he added. “Well, you weren’t there when they wrote this Constitution that you love to throw up in everybody’s face.” This appears to be a relatively new attack against McConnell, as NBC noted that “no news articles were found in which McConnell has previously spoken of his ancestors being slave owners.” Obama, as McConnell noted, never truly pursued reparations. The former president told the Atlantic in 2016: I have much more confidence in my ability, or any president or any leader’s ability, to mobilize the American people around a multiyear, multi-billion-dollar investment to help every child in poverty in this country than I am in being able to mobilize the country around providing a benefit specific to African Americans as a consequence of slavery and Jim Crow. Now, we can debate the justness of that. But I feel pretty confident in that assessment politically. As for the other claim, McConnell cited a report rooted in 2008 findings from a genealogist, who claimed that Obama’s great-great-great-grandfather owned slaves in Kentucky. NBC News reported: During the 2008 election, an amateur genealogist found that on his white mother’s side, Obama had a great-great-great-grandfather named George Washington Overall who owned two male slaves in Kentucky. The genealogist, William Reitwiesner, also found that Obama’s great-great-great-great-great-grandmother, Mary Duvall, also owned a pair of slaves. NBC’s main piece came just one day before Kentucky Democrat Amy McGrath announced her bid to unseat McConnell: ",
      "date": "10 Jul 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Trump Criticizes McConnell Challenger Amy McGrath for 9/11 Comment",
      "url": "https://www.breitbart.com/2020-election/2019/07/10/trump-criticizes-mcconnell-challenger-amy-mcgrath-9-11-comment/",
      "subtitle": "President Donald Trump vocally supported Sen. Mitch McConnell (R-KY), while calling out McConnell challenger Amy McGrath (D) for comparing his election to the historic terrorist attack on September 11, 2001.",
      "author": "Nate Church",
      "content": " “Democrats are coming after our great Kentucky Senator, Mitch McConnell, with someone who compared my election to September 11th,” Trump tweeted on Tuesday night, after McGrath announced her campaign against the incumbent Kentucky senator. “We need Mitch in the Senate to Keep America Great!!”  “That morning I woke up like somebody had sucker punched me. I mean, I felt like, ‘What has just happened to my country?’” McGrath said of Trump’s election to the presidency. “The only feeling I can describe that’s any close to it was the feeling I had after 9/11,” she continued. “‘What just happened, where are we going from here,’ and it was that just sinking feeling of sadness, and I didn’t know what to do.” McGrath was also interviewed by CNN on Tuesday, where she was asked about the statement. In response, she hedged the statement by attempting to broaden its application to the state of the country in general. McGrath said: What I was talking about was the fact that nobody really expected President Trump to win and I was also talking about the entire 2016 cycle. Many of us were spurred into action by what happened in 2016, the labeling of each other as ‘They’re all communist,’ or ‘They’re all this,’ or ‘They’re all that,’ and the fake news, the divisiveness of our country, was something I’d never seen before.” My husband is a Republican, I’m a Democrat. We took stock of that after the election and we said ‘Where are we as a country?’ And that way, it was the same thing, for me, was looking at that tragic event and taking stock of where are we as a country. And I can see why folks might be upset about that. The 2001 terrorist attack orchestrated by Osama bin Laden’s al Qaeda slew 2,996 Americans, and injured more than 6,000 others. It has been leveraged for political gain every year since. McGrath called McConnell out for helping to “bit by bit, year by year, [turn] Washington into something we all despise.” “I’m running for Senate because it shouldn’t be like this,” she said.",
      "date": "10 Jul 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Flip Flop: McConnell Challenger Amy McGrath Apologizes After Saying She Would Have Confirmed Kavanaugh",
      "url": "https://www.breitbart.com/politics/2019/07/11/flip-flop-mcconnell-challenger-amy-mcgrath-apologizes-would-confirmed-kavanaugh/",
      "subtitle": "Amy McGrath, the Kentucky Democrat challenging Senate Majority Leader Mitch McConnell (R-KY), is already establishing her status as a potential flip-flopper, swiftly apologizing less than a day after suggesting that she would have confirmed Justice Brett Kavanaugh.",
      "author": "Hannah Bleau",
      "content": " McGrath told The Courier-Journal Wednesday that she would have voted to confirm Brett Kavanaugh, whose confirmation hearing was dominated by baseless accusations from accuser Christine Blasey Ford. McGrath said she was “very concerned” about Kavanaugh and his “far-right” stances but added that there was nothing in his record that she thought would “disqualify” him. While she found Blasey Ford “credible,” she said: “…given the amount of time that lapsed in between and from a judicial standpoint, I don’t think it would really disqualify him.” “I think that with Judge Kavanaugh, yeah, I probably would have voted for him,” she told The Courier-Journal. After a flurry of backlash, McGrath reversed positions less than 24 hours after her original remarks went public.  “I was asked earlier today about Judge Brett Kavanaugh and I answered based upon his qualifications to be on the Supreme Court,” she tweeted Wednesday evening. “But upon further reflection and further understanding of his record, I would have voted no.” “I know I disappointed many today with my initial answer on how I would have voted on Brett Kavanaugh,” she continued. “I will make mistakes and always own up to them. The priority is defeating Mitch McConnell.”   Notable personalities on both sides of the aisle swiftly jumped on her reversal, making a clear note of it on social media and reminding everyone of her position last year. “I echo the concerns over the nomination of Judge Kavanaugh. He’s been against women’s reproductive rights, workers’ rights, consumer protections, and is a hardcore partisan,” she tweeted July 2018. “But we are reminded, again, that elections have consequences, and this will be with us for a generation,” she added.  Reactions were swift:       McGrath announced her bid Tuesday and saw overwhelming support from some of the most notable leftists in Hollywood, like Bette Midler, Chelsea Handler, Patton Oswalt, and Alyssa Milano.",
      "date": "11 Jul 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Dem Rep. Rose Slams ‘Sociopathic’ McConnell for Refusal to Work with Dems",
      "url": "https://www.breitbart.com/clips/2019/07/12/dem-rep-rose-slams-sociopathic-mcconnell-for-refusal-to-work-with-dems/",
      "subtitle": "null",
      "author": "Trent Baker",
      "content": " Friday, Rep. Max Rose (D-NY) turned a question on MSNBC’s “Morning Joe” about the Democratic Party’s infighting into calling Senate Majority Leader Mitch McConnell (R-KY) “sociopathic” for his unwillingness to work with Democrats. Rose brushed off the feud between House Speaker Nancy Pelosi (D-CA) and Rep. Alexandria Ocasio-Cortez as “political TV drama” and said the political fights only lead to people being “ignored” by Washington, D.C. “Just think about this for a second, OK? Donald Trump runs on a series of platforms making our roads and bridges great again, draining the swamp. He proceeds to ignore all those proposals. Mitch McConnell continues to show an unbelievable sociopathic intransigence whenever it comes to legislation that we pass in the House and present to him in the Senate,” Rose advised. “And then you have the Democratic caucus that is always teetering … on the edge of this type of back-and-forth Twitter drama. We have got to refocus our energies in a bipartisan and bicameral way on the bread and butter issues that the American people actually care about.”\n\n“And I assure you that this type of Twitter back and forth, the American people couldn’t give a damn and neither do I,” he concluded. Follow Trent Baker on Twitter @MagnifiTrent",
      "date": "12 Jul 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Kentucky Blues: House’s Outsourcing Bill Threatens McConnell’s Home State, Senate Majority",
      "url": "https://www.breitbart.com/politics/2019/07/12/house-gop-vote-indian-outsourcing-threatens-gops-senate-majority/",
      "subtitle": "House Republicans have created a political headache for Senate Majority Leader Mitch McConnell as he tries to keep GOP control of the Senate.",
      "author": "Neil Munro",
      "content": " On Wednesday, House Republicans allowed the Democrats to pass an outsourcing bill which dangles citizenship in front of hundreds of thousands of Indian graduates if they take more jobs from American graduates. The House bill, HR.1044, passed Wednesday by 365 to 65 after a multi-year, stealthy lobbying campaign by Silicon Valley lobbyists which was fronted by ethnic advocacy groups. The lobbies were led by Mark Zuckerberg’ s network of Silicon Valley investors and other technology companies, including Jeff Bezos’ Amazon, and were aided by a near-total blackout by establishment media outlets, such as Bezos’ Washington Post. The bill now goes to the Senate where the tech lobbyists and investors have already pushed a similar job-outsourcing, salary-cutting, American-replacement bill to the Senate floor. This outsourcing push is very unpopular among the Republicans’ MAGA base who have felt first-hand the painful impact of legal and illegal immigration on their own incomes, families, and status. The HR.1044 bill is not an amnesty, but it and the Democrats’ DACA amnesty are “crucial,” said one of the Zuckerberg lobbyists who pushed HR.1044. The bill is also a threat to the careers and prosperity of the many swing-voting college graduates needed by President Donald Trump and GOP Senators in November 2020. The GOP’s share of those college-graduate voters lurched down in 2018, giving the Democrats control of the House. The bill also extends and deepens the federal government’s implicit policy of rewarding coastal states with imported labor. That regional favoritism discourages investment in the heartland states, including McConnell’s home state of Kentucky and Sen. Susan Collins’ home state of Maine. Democrats are successfully using the graduate-employment crisis to squeeze many votes from American graduates. In effect, Democrats promise direct government fixes to the problems that they impose on graduates, such as college debt, housing costs, and stalled wages. That tactic is being used in Sen. John Cornyn’s Texas where cheap-labor migration has swelled the Democratic-voting cities and has sucked investment and jobs from the state’s GOP-leaning smaller cities and towns. The House’s outsourcing vote leaves McConnell is a political jam: He can take the heat from business lobbyists by blocking the Senate’s bill, or he can let the bill pass and hope that the betrayed blue-collar voters and the nowhere-to-go middle-class voters somehow vote for the small-government side of a unified, pro-outsourcing Congress in 2020. McConnell has “to evaluate this legislation on several different levels,” said Jessica Vaughan, policy director at the Center for Immigration Studies. Vaughan continued: He ought to be considering the [economic] impact on his homestate of Kentucky. As Majority Leader, he has to consider also how damaging it will be to Republicans to allow this through as a victory for [Sen.] Kamala Harris and Democrats in general, but also for the large Republican constituency which is going to be the air beneath the wings of President Donald Trump’s campaign.  Federal Policy The federal government already allows companies to keep a foreign workforce of roughly 1.5 million foreign graduates in the United States. This non-immigrant workforce holds jobs in a wide variety of promising careers such as therapists, professors, doctors, engineers, managers, software programmers, fashion designers, pharmacists, statisticians, Wall Street analysts, and recruiters. Ths resident population of foreign workers arrives via the government’s many border loopholes, including the H-1B, Optional Practical Training, H4EAD, L-1, TN, and J-1 programs. The biggest loophole is the H-1B program for foreign graduates. Roughly 100,000 H-1B workers arrive each year for jobs in every state, and most go home when their six-year visas terminate, ensuring a churning resident H-1B workforce of around 500,000. An additional 350,000 H1Bs are being allowed to stay in jobs long past their departure dates because their employers have nominated them for green cards. In 2015, President Barack Obama ordered work permits be given to 100,000 of their spouses. This resident foreign workforce of 850,000 H-1Bs is larger than the number of Americans who graduate from colleges and universities each year with skilled degrees. This federal decision to flood the college-graduate labor market with H-1Bs and other contract-workers has a huge impact on how company revenue is divided among employees and investors, and among economic classes and geographic regions.  Voters Lose, Investors Gain Most of the imported white-collar workers are Indians, and most are eager to take jobs at wages far below what American graduates need to pay their debts, get married, and buy starter homes. Nearly all foreign graduates will work for less than Americans because work in America is better than work in India’s caste-divided society. Also, many Indians hope to leverage their temporary work permits into hugely valuable green cards and citizenship for themselves, their children, and all of their descendants. This national difference means that U.S. investors and their Indian subcontractors can cut their U.S. payroll costs by hiring imported Indians graduates instead of skilled Americans. The extra labor also means that expanding employers generally do not need to offer extra salaries to lure American graduates away from other companies. It also reduces companies’ incentive to illegally prevent marketplace competition, which they describe as “poaching.” The existence of the H1B program helps outsource large business operations to India, saving more money for U.S. investors. For example, in 2017, CBS’ 60 Minutes showed how Disney transferred one of its computer divisions in Florida to an Indian firm, which then replaced the American workers with Indian H-1B workers and gradually moved the division’s work over to India. Many American graduates say they lose job opportunities to Indians whenever American firms delegate hiring decisions to Indian subcontractors or Indian managers. They lose jobs because nepotism is normal in India’s caste-divided culture, and the payoffs almost are almost impossible to track because they can be made on the Indian side of the U.S.-Indian cultural divide. On July 4, the Times of India reported that a major Indian firm attributed fake claims to Apple Inc. as it tried to smuggle more white-collar workers into the U.S. labor market.  Many middle-class parents spend a fortune educating their few children, yet find their children’s progress blocked by foreign managers, temporary workers, and outsourcing, Vaughan said. “They have been having [their child] go to science camps all her life, and they want her to be an engineer or a medical researcher, yet the jobs are not going to be there for her.” For example, Congress has failed to add funding for the residency training of Americans doctors since 1997. The policy failure means many young Americans cannot become doctors. But the failure is being hidden by visa programs which import doctors from western Africa, the Middle East, and India, often via the H-1B program. The imported doctors in Kentucky, Iowa, and other states are now leading the push for passage of the far-reaching HR.1044 legislation, even though legislators in Congress could vote for a smaller-scale proposal which pairs extra funding for U.S. students with a focused fix for the foreign doctors. Overall, the H-1Bs and the vast supply of legal and illegal migrants in American workplaces force down Americans’ salaries nationwide, even as they also create some extra jobs selling goods and services to migrants. Additional immigrant labor needs to eat and to sleep — so it serves as cheap workers, consumers, and renters for many companies and real-estate investors. The extra sales are doubly useful for Amazon, Wal-Mart, the construction industry, and landlords from Maine to San Diego. But it does little to raise American employees’ average productivity, skills, or wealth. The bottom line is that the flow of all immigrants and visa workers transfers roughly $500 billion a year in employees wages up to CEOs and investors. The $500 billion estimate is based on the formula used by a September 2016 study by the National Academy of Sciences. That huge economic transfer explains why investors and business groups fight so hard for extra immigration — and why so many investors and companies quietly pushed HR.1044 through the House this week. The economic transfer is so large that it helps explain why employees’ share of the new wealth in economy has dropped by 10 percent, or six points, since 2000. The legislation, HR.1044, claims to promote fairness for high-skilled contract-workers, dubbed “immigrants” by the advocates. The bill removes “country caps” which limit Indians’ share of the 120,000 green-cards awarded each year to employees nominated by their companies. That change would allow Indians to get roughly 100,000 green cards each year, up from roughly 23,000. The change would allow the 300,000 Indian workers — and their 300,00 family members — get on a fast track to green cards, citizenship, and the voting booth. The bill would also accelerate the citizenship reward for the next wave of Indians who choose to become a contract-worker. That next wave of Indian outsourcing may be huge because there are no caps for non-profit employers in the H-1B program or in the Optional Practical Training program — and there are many good jobs in the healthcare sector that can be profitably transferred to Indian graduates. The legislation will also create many new political fights once the accelerated Indian migrants push important employees — such as nurses — and other national groups to the back of the line. If the bill become law, the legislators and lobbyists will be back at work the next day trying to win advantage from the policy wreckage.  Kentucky and Heartland States Lose, Coastal States Gain The huge number of immigrants and H-1B workers also shifts wealth and economic growth from the heartland over to the coasts. In 2017, companies in Kentucky asked the federal government for approval to import almost 5,000 foreign H-1B graduates, according to government data. The data suggests Kentucky has a population of roughly 5,500 H-1B workers and that the vast majority are paid less than $70,000 a year. The population saves money for the Kentucky CEOs who hire the 5,000 contract-workers. But if Kentucky graduates had won those jobs, they would have earned more money, spent more money and paid more taxes in the state — and would also have encouraged the next generation of Kentucky students to stay in the state. Moreover, the H-1B population in Kentucky comprises just 5,000 workers out of a national H-1B workforce of at least 800,000. This means very few investors in Kentucky are boosting their profits by using H-1B labor — while thousands of investors in other states are boosting their profits with wage-cutting H-1B workers. While companies in Kentucky asked for almost 5,000 H-1B visa workers in 2017, New York companies asked for 83,000 H-1B contract workers and New Jersey companies asked for 62,000 H-1B contract workers. The skewed distribution of H-1B workers and investors has enormous knock-on economic effects. For example, the huge supply of H-1B workers in California ensures that investors in Silicon Valley never face a labor shortage which would require them to establish operations outside the state where skilled Americans are graduating from college. Instead, they can locate their investments and create jobs close to their homes in California, New York, or Seattle, far from Kentucky. The San Jose Mercury News reported in January 2018: About 71 percent of tech employees in the [Silicon] Valley are foreign born, compared to around 50 percent in the San Francisco-Oakland-Hayward region, according to a new report based on 2016 census data. Immigrant techies tend to go to “the center of the action,” [said] Seattle venture capitalist S. “Soma” Somasegar … FWD.us is one of the leading business groups behind the stealthy HR.1044 push. The group is led by wealthy anti-Republican West Coast investors, including Facebook’s Zuckerberg, Google’s executive chairman, Eric Schmidt and Microsoft’s president, Brad Smith. The H-1B policy is the college-graduate version of the federal government’s immigration policy, which puts a far bigger thumb on the scale. Each year, four million Americans turn 18 and start looking for a job in California, the Dakotas, Colorado, or other states, including Kentucky. But the government inflates each year’s natural labor supply of 4 million young Americans by importing roughly 500,000 working-age immigrants, and by “refreshing” the resident population of 1.5 million white-collar visa workers, 2 million work-permit holders, and 8 million-plus working illegal immigrants, Overall, the resident population of temporary, legal, non-immigrant workers in the United States is at least 4 million, including the white-collar H-1Bs and the blue-collar H-2Bs, the H-2A agricultural workers, J-1 visa workers, plus asylum seekers, and various forms of temporary workers. The 4 million workers in the temporary legal workforce provide roughly one-seventh the size of the overall legal immigrant workforce of 28 million within the larger population of 45 million legal and illegal immigrants. That combined foreign-born population of roughly 45 million has a huge impact on states, and it tends to move a large share of the nation’s growth, income and wealth from low-migration states — such as Kentucky — to high-migration states, such as California, Chicago, and New York. For example, renters pay real-estate owners roughly $1,500 a month for a two-bedroom apartment in Kentucky’s biggest city. In crowded New York, real-estate investors get $6,000 a month for a decent two-bedroom apartment. Ownership of a home boosts personal wealth in Kentucky by roughly $145,000, according to Zillow. But an average home in New York state makes the owner richer by roughly $300,000. People who own homes in California have seen their value spike to $550,000 in the last 20 years. This government-accelerated shift of wealth from rural to urban, from the heartland to the coasts, is being decried by establishment critics as “the next big inequality crisis.” But those critics decline to recognize a huge part of the problem — the government policy of skewing wealth by flooding the U.S. free market with imported labor. Of course, there are other causes for this wealth shift, such as luck, climate, and technological trends. But the government’s immigration policy has shortcircuited the normal economic factors that would help spread the new wealth to Kentucky and other heartland states, including Iowa, Indiana, Tennessee, and Kansas. Those factors —  rising real-estate prices, congested roads, a shortage of local workers, pressure for wage increases — would normally redistribute some investment and wealth back to the low-wage, low-unemployment, low-traffic, low-crime heartland states, such as Kentucky. But the federal government discourages investment in Kentucky and other heartland states by delivering a continual supply of migrant workers — including the H-1B contract-workers — to coastal investors. Federal immigration policy “smothers what would otherwise be a competitive advantage for Kentucky,” said Vaughan. Unfortunately for Sen. Susan Collins and the high-school graduates in Maine, the coastal state lags behind other states in productivity and income growth because investors know they can earn more profits by hiring the migrants who prefer to settle in warmer California or even other New England states. On July 7 the New York Times described the same government-skewed development process within high-immigration Texas, where GOP Sen. Cornyn is up for election in 2020: Nearly all of the net growth in jobs and new businesses in Texas over the last decade, Labor Department data show, has been concentrated in four large metropolitan areas — Austin, Dallas, Houston and San Antonio. Those areas accounted for more than four out of every five jobs created in the state since the recession ended, their populations swelling with surges of young and talented workers. Collectively, the four saw double the rate of job growth as the rest of Texas. A similar geographic inequality is playing out in other places in America, alarming officials at the Federal Reserve. While the latest jobs report showed the economy’s continued strength after 10 years of expansion, the effects have been uneven, with the wealthiest parts of the country reaping a disproportionate share of the gains. The economy has evolved toward more technology and service jobs, favoring areas with highly educated workers and high-end professional service industries — and leaving smaller, traditionally blue-collar towns like Longview at a disadvantage. While the richest neighborhoods in Texas’ most dynamic cities have grown much richer as the recovery wore on, the poorest parts of the state fell even further behind. The Economic Innovation Group, a Washington think tank, sorts ZIP codes across the country on a five-point scale, with “prosperous” at the top and “distressed” at the bottom. Research from the group found that from 2008 to 2016, the most prosperous ZIP codes in Texas — heavily concentrated in those star metro areas — accounted for more than two-thirds of the state’s net growth in jobs and business establishments. … There were only 1,800 more jobs in the Longview area in April than there were 10 years ago, according to the Labor Department, an annual growth rate of less than 0.2 percent. Gregg County, which includes Longview, lost more businesses than it created from 2012 to 2016, the innovation group’s data show. Nationally, the counties that flipped from President Barack Obama in 2012 and 2016 to Donald Trump in 2016 have shown little gain in population or jobs in the last few years, according to the Economic Innovation Group: The country’s political landscape is being changed by economic, demographic, and technological trends that are decades in the making. The national economy continues to enjoy record growth even as “left behind” places fail to see the same gains. The outsized political power of these “left behind” places, embodied in the group of flipped counties, was apparent in the 2016 election. Had voters in counties that switched party allegiances between the Obama and Trump eras hoped for a change in economic trajectory, their hopes have so far been unfulfilled. What, if anything, has changed over the first two years of the Trump administration? Employment growth has continued, albeit at a slower pace. Business establishments have proliferated faster among the rural, exurban, and flipped counties that President Trump carried relative to before the election. But the gaps between left behind places and the rest have not meaningfully narrowed. Places don’t change overnight, and any president has limited power to reorganize local economies. Historic trends like flatlined population growth and shrinking workforces require sustained, meaningful economic growth to see any kind of reversal. However, among voters there is a strong belief in the power of the executive branch. To the extent that flipped counties’ political swing reflected voter dissatisfaction with the status quo, the latest data provide no evidence that their trajectories will have meaningfully changed by 2020. Currently, there is little reason for coastal investors to put their money into these high-unemployment districts. Since November 2016, the federal government has provided them with roughly 2 million legal migrants, roughly 400,000 working-age migrants from Central America, 200,o00 new H-1Bs, and many additional H-2Bs, L-1, OPTs, refugees, H4EADs, etc., plus many illegals who were not deported. The EIG is run by investors, so its proposed fix for those flip districts is a scheme to funnel more migrants into those districts — which would also flip those districts blue.  Politics One political result of this economic skew is growing pessimism among college graduates — and a resulting turn leftwards. The Associated Press reported: A college degree has long been a ticket to the U.S. middle class … a collaborative analysis of the 2018 General Social Survey by The Associated Press-NORC Center for Public Affairs Research and GSS staff … found that 35% of graduates described themselves as working or lower class, up from just 20% who felt that way in 1983. By contrast, only 64% of college grads say they feel they belong to the middle or upper class. This pain among the graduates is reshaping the Democrats’ 2020 pitch. Democrats oppose any fix to migration, so they are eagerly offering to spend taxes ameliorating the damage. The damage includes a wide-scale return by American graduates to their parents’ houses and the widespread use by migrants of cheap tenements close to their l0w-wage jobs which support the winners in the high-tech cores of the nation’s economy.  So Democrats and progressives in New York have imposed their own solution — more rent control. HousingWire reported: “These reforms give New Yorkers the strongest tenant protections in history,” Assembly Speaker Carl Heastie and Senate Majority Leader Andrea Stewart-Cousins said in a joint statement. “For too long, power has been tilted in favor of landlords and these measures finally restore equity and extend protections to tenants across the state.” The Editorial Board of The Wall Street Journal had a different view. In a piece titled, “Albany goes wild,” the newspaper said: “There’s a lot of ruin in New York, but progressives who control the state and city governments are intent on showing how much. Law by law, Gov. Andrew Cuomo and Democrats are chipping away at the policies that made New York City livable after decades of decline and returning to the bad old days.” Similarly, Democrats jostling for the 2020 nomination are promising more housing aid, and a rollback of college loans. For example, Sen. Liz Warren wants to solve the housing problems created by migration with a new tax on suburban homeowners. Democrats are exploiting graduates’ worries and anxiety, Vaughan said: They want to tap into that anxiey, but they have already denied that immigration has any thing to do with these problems and the will not adopt any immigration fixes because that would anger key [pro-migration] constituencie. So the Democrats have to find other issues to talk about  — trade, student loans, jobs, education, equal pay and minimum wages — while they ignore the elephant in the room which is immigration. In the medium term– by 2030 — the GOP will also lose more seats as the Indian migrants become citizens and vote Democratic. The HR.1044 legislation will add roughly 600,000 Indian voters to the rolls during the next 10 years. Indians are highly likely to donate to Democratic causes and to vote Democratic. For example, the chief Senate sponsor of the bill is Sen. Kamala Harris, whose mother is Indian. Roughly 77 percent of Indians supported Democratic candidates in 2016, while only 16 percent said they voted for President Donald Trump, according to a post-election survey funded by the National Science Foundation. A growing population of skilled migrants in a district also tends to pull American-born voters into the Democratic camp, said an April 2018 study. “Our strongest and most significant finding is that an increase in high-skilled immigrants as a share of the local population is associated with a strong and significant decrease in the vote share for the Republican Party,” said the report, authored by pro-migration economist Giovanni Peri, Anna Maria Mayda, a Georgetown University professor now at the U.S. State Department, and Walter Steingress, an economist at the Bank of Canada. “If Republicans get on the wrong side of this issue,” said Vaughan, “and go along with this special interest legislation, unwittingly they will be weaving the rope that will hang them.” ",
      "date": "12 Jul 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Jon Stewart to Mitch McConnell: Pass 9/11 Victim Funding ‘Keep Your Word’",
      "url": "https://www.breitbart.com/clips/2019/07/12/jon-stewart-to-mitch-mcconnell-pass-9-11-victim-funding-keep-your-word/",
      "subtitle": "null",
      "author": "Pam Key",
      "content": " Friday on MSNBC’s “Andrea Mitchell Reports,” former Comedy Central’s “Daily Show” host and 9/11 victims’ advocate Jon Stewart continued his pressure on Senate Majority Leader Mitch McConnell to reauthorize the 9/11 Victims Fund. Stewart said, “We just want to make sure we have a deadline. The Senate majority leader said to them personally this would be done by the August recess. That’s August 2. So we’re going to hold him to that word. It has to be done by August 2. It has to be fully funded. Then everyone can exhale and go home.” Keep your word. Your word was this passes, unattached and as a standalone bill. Fully funded.” First responder John Feal said, “If Mitch McConnell or anybody in the Senate plays games, myself and my team, Jon Stewart, we come back and make their lives miserable. We are not going to apologize for that. They work for us…Mitch McConnell is in charge of 99 people, and the speaker is in charge of 434 people. They’re working for us.” Stewart said, “They should do by August 2 and let’s be done with it. Keep your word.” Follow Pam Key on Twitter @pamkeyNEN",
      "date": "12 Jul 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "McConnell: Everyone Should ‘Tone Down’ Rhetoric, Trump Is ‘Not a Racist’",
      "url": "https://www.breitbart.com/clips/2019/07/16/mcconnell-everyone-should-tone-down-rhetoric-trump-is-not-a-racist/",
      "subtitle": "null",
      "author": "Ian Hanchett",
      "content": " During a press conference on Tuesday, Senate Majority Leader Mitch McConnell (R-KY) argued that everyone needs to “tone down their rhetoric” and denied that President Trump is a racist. McConnell said, “I think everybody ought to tone down their rhetoric.” McConnell added, “The president is not a racist. And I think the tone of all of this is not good for the country, but it’s coming from all different ideological points of view. That’s the point. To single out any segment of this, I think, is a mistake. There’s been this kind of rhetoric from a whole lot of different sources, all across the ideological spectrum in our country.” Follow Ian Hanchett on Twitter @IanHanchett",
      "date": "16 Jul 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "McConnell: Trump ‘Onto Something’ — Dems Want to Turn America into a ‘Socialist Country’",
      "url": "https://www.breitbart.com/clips/2019/07/18/mcconnell-trump-onto-something-dems-want-to-turn-america-into-a-socialist-country/",
      "subtitle": "null",
      "author": "Trent Baker",
      "content": " In a Thursday interview on Fox Business Network’s “Mornings with Maria,” Senate Majority Leader Mitch McConnell (R-KY) commented on the feud between President Donald Trump and the four progressive congresswomen, also known as “The Squad.” McConnell said he agreed with Trump about Reps. Ilhan Omar (D-MN), Alexandria Ocasio-Cortez (D-NY), Ayanna Pressley (D-MA) and Rashida Tlaib (D-MI) wanting to turn the United States into a socialist country, saying he thinks the Democratic Party as a whole is beginning to embrace socialism. He’s right about ‘the squad’ wanting to turn us into a socialist country,” McConnell told host Maria Bartiromo. “What he should have added, however, is that it’s a lot broader than just the four of them.” McConnell then noted how many leaders in the Democratic Party support the “Green New Deal” and Medicare for All, adding, “So, I think the president’s onto something.” On Ocasio-Cortez’s charges of racism when Trump told The Squad to go back to their countries, McConnell said it is time to “lower the rhetoric related to that subject.” “Everybody knows it’s nonsense,” he emphasized. Follow Trent Baker on Twitter @MagnifiTrent",
      "date": "18 Jul 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "McConnell: ‘We’re Not Going to Stand By and Let America Become a Socialist Country’",
      "url": "https://www.breitbart.com/clips/2019/07/23/mcconnell-were-not-going-to-stand-by-and-let-america-become-a-socialist-country/",
      "subtitle": "null",
      "author": "Jeff Poor",
      "content": " In an interview that aired Tuesday on Fox News Channel’s “Fox News @ Night,” Senate Majority Leader Mitch McConnell (R-KY) backed President Donald Trump’s pledge to take on the fight against the spread of socialism in America. The Kentucky Republican said the one thing with which he took issue pertaining to the president’s pledge was that the philosophy of socialism was much more mainstream than the foursome of progressive Democratic Party congresswomen known as “The Squad.” “Let me tell you how to run against [socialism],” McConnell said. “Margaret Thatcher said the problem with socialism is pretty soon you run out of other people’s money. They’re talking about free health care, paying free college tuition. Look, the Green New Deal would take away your job. Medicare for all would take away 180 million Americans’ private health insurance. And if they made any effort to pay for it, they’d have to have such a massive tax increase that it would slow the economy further. That’s what they have in mind. The only place where I think the president is offbase on this is it’s a lot bigger than ‘The Squad.’ That’s just four people. This has become mainstream Democratic policy. If they get the entire government, that’s what we’re going to get. I’ve said as long as I’m the Majority Leader in the Senate, I smilingly said I’m going to be the grim reaper. None of that stuff is going to pass the Senate. We’re not going to stand by let America become a socialist country.”\n\nFollow Jeff Poor on Twitter @jeff_poor",
      "date": "23 Jul 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Donald Trump Defends Mitch McConnell: ‘The Washington Post Is a Russian Asset’",
      "url": "https://www.breitbart.com/politics/2019/07/30/donald-trump-defends-mitch-mcconnell-the-washington-post-is-a-russian-asset/",
      "subtitle": "President Donald Trump ridiculed the Washington Post as a “Russian asset” after a columnist accused Senate Majority Mitch McConnell of being a “Russian asset.”",
      "author": "Charlie Spiering",
      "content": " “I think the Washington Post is a Russian asset by comparison,” Trump said. “Mitch McConnell loves our country. He’s done a great job.” Washington Post columnist Dana Milbank claimed Senate Majority Leader Mitch McConnell was helping Russia in a piece headlined “Mitch McConnell is a Russian Asset.” The president spoke about the controversy as he left the White House for a speech recognizing the 400th anniversary of the founding of Jamestown, Virginia. Trump said the Washington Post was also “fake news,” printed for the benefit of Amazon owner Jeff Bezos. “They actually said that Mitch McConnell is an asset of Russia?” Trump asked. “They oughta’ be ashamed of themselves and they ought to apologize.” On MSNBC, Joe Scarborough claimed McConnell was “aiding and abetting Putin’s ongoing attempts to subvert U.S. democracy” decrying the Senate Majority Leader with the nickname “Moscow Mitch.” McConnell fired back at the pundits in a speech on Monday, defending his record of American patriotism. “I was called unpatriotic, un-American and essentially treasonous by a couple of left-wing pundits on the basis of bold-faced lies,” McConnell said in a speech on the Senate floor, decrying the attacks as “modern-day McCarthyism.” The Wall Street Journal in an editorial also defended McConnell on Tuesday. “The truth is that Mr. McConnell has been far tougher on Vladimir Putin than most Democrats were across the Clinton, George W. Bush and Obama Administrations,” the editorial board wrote.",
      "date": "30 Jul 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Schumer: McConnell Either Wants the Russians to Interfere or He’s Scared of Trump",
      "url": "https://www.breitbart.com/clips/2019/08/01/schumer-mcconnell-either-wants-the-russians-to-interfere-or-hes-scared-of-trump/",
      "subtitle": "null",
      "author": "Pam Key",
      "content": " Thursday on SiriusXM’s “The Joe Madison Show,” Minority Leader Sen. Chuck Schumer (D-NY) said either Majority Leader Sen. Mitch McConnell (R-KY) wants “the Russians to interfere” or he is “scared,” of President Donald Trump. Schumer comments were about McConnell blocking bills on election security. Madison asked, “This issue about protecting the vote particularly from the Russians, I mean, this should be in my opinion, a bipartisan issue. I mean, you had a clarion call from the former special counsel. What is the difficulty?” Schumer said, “There’s no good explanation. I said, it’s not a partisan issue, just what you said, not a partisan issue. This is what Americans have died for through all our wars to protect the right to vote. This is what John Lewis and so many others marched for, the right to vote. So now you’re going to let the Russians bollocks it up and interfere with it?” He added, “Only two reasons I can think of neither of them good. They want the Russians to interfere because they think it’ll help them. It’s clear. Mueller made this clear that the Russians wanted Trump to win. The second is another reason not so good. Donald Trump in his puerile, babyishness, if that’s even a word, is so upset at the fact that the Russians might have interfered, that it delegitimizes his election, and McConnell is so scared of Trump that he goes along.” Follow Pam Key on Twitter @pamkeyNEN",
      "date": "1 Aug 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Singer Ben Folds Targets McConnell with Song ‘Moscow Mitch’",
      "url": "https://www.breitbart.com/entertainment/2019/08/03/ben-folds-targets-mcconnell-with-song-moscow-mitch/",
      "subtitle": "Singer-songwriter Ben Folds went after Senate Majority Leader Mitch McConnell (R-KY), unveiling his song “Moscow Mitch” in New York Thursday in reaction to McConnell’s move to block an election security bill.",
      "author": "Hannah Bleau",
      "content": " “For this song, what I want to do is put a little cool stutter in it, like, you know, ’My-my-my-my-my-my Sharona,’” Folds told the audience Thursday. “So what we’ll do is, we’ll go: Mah-mah-mah-Moscow Mitch.”  Former Special Counsel Robert Mueller’s testimonies last week reignited talk over foreign election interference. “Over the course of my career, I’ve seen a number of challenges to our democracy,” Mueller said last week. “The Russian government’s effort to interfere in our election is among the most serious. As I said on May 29, this deserves the attention of every American. They’re doing it as we sit here.” #MoscowMitch started catching steam after MSNBC’s Joe Scarborough slammed McConnell for blocking an election security bill aimed to address election security concerns. According to reports: Senate Majority leader Mitch McConnell, R-Ky., objected to the bill that would have required paper ballots and funding for the Election Assistance Commission. It passed the House 225-184 with one Republican voting for it. “He is aiding and abetting Putin’s ongoing attempts to subvert U.S. democracy, according to the Republican FBI, CIA, DN,” Scarborough said. “All Republicans are saying Russia is trying to subvert U.S. democracy, and Moscow Mitch won’t even let the Senate take a vote on it,” the Morning Joe host added. “That is un-American.”  Scarborough’s rant seemed to inspire the hashtag as well as Folds’ song.     McConnell argued that it was not a realistic bipartisan bill but rather something crafted by the Democrats who pushed the Trump-Russia collusion “conspiracy theory.” “Clearly this request is not a serious effort to make a law,” McConnell said. “Clearly something so partisan that it only received one single solitary Republican vote in the House is not going to travel through the Senate by unanimous consent.” Additionally, Republicans say they have already taken enough steps to ensure election security. McConnell slammed his critics in a speech Monday. “I was called unpatriotic, ‘un-American’ and essentially treasonous by a couple of left-wing pundits on the basis of boldfaced lies,” McConnell said on the Senate floor. “I was accused of ‘aiding and abetting’ the very man I’ve singled out as our adversary and opposed for nearly 20 years: Vladimir Putin.” “This modern-day McCarthyism was pushed by big-time outlets. The smear that I am, quote, a ‘Russian asset’ ran in the opinion pages of The Washington Post,” he added. McConnell’s team reacted to hashtag with a snarky tweet of its own Tuesday. ",
      "date": "3 Aug 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Tim Ryan: McConnell, GOP Need to ‘Get Their Sh*t Together,’ Stop Pandering to NRA",
      "url": "https://www.breitbart.com/clips/2019/08/04/tim-ryan-mcconnell-gop-need-to-get-their-sht-together-stop-pandering-to-nra/",
      "subtitle": "null",
      "author": "Pam Key",
      "content": " Sunday on MSNBC, in the aftermath of two mass shootings, 2020 Democratic presidential candidate Rep. Tim Ryan (D-OH) called on Senate Majority Leader Mitch McConnell’s (R-KY) and Republican lawmakers to “get their shit together and stop pandering to the NRA.” Ryan said, “It’s time to put public pressure on Mitch McConnell. I’m suspending my campaign for the presidency. I’m going to head back to Ohio, and we need leadership right now. Enough is enough is enough. You watch videos and see Dillard’s in the background, and you see Walmart in the background or a church in the background, and no one feels safe anymore. And there is a bottleneck in the United States Senate with Mitch McConnell. We passed in the House of Representatives a few weeks back, background checks. A basic step 90% of the American people support, and the Republicans need to quite frankly get their shit together and stop pandering to the NRA.” Follow Pam Key on Twitter @pamkeyNEN",
      "date": "4 Aug 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell Falls, Fractures Shoulder at Kentucky Home",
      "url": "https://www.breitbart.com/politics/2019/08/04/mitch-mcconnell-falls-fractures-shoulder-at-kentucky-home/",
      "subtitle": "Senate Majority Leader Mitch McConnell (R-KY) was treated and released after he tripped on his patio at his Kentucky home on Sunday.",
      "author": "Kyle Morris",
      "content": " “This morning, Leader McConnell tripped at home on his outside patio and suffered a fractured shoulder,” said David Popp, Communications Director for Mitch McConnell in a statement. “He has been treated, released, and is working from home in Louisville.” Popp added, “The leader will continue to work from home.” The statement also affirmed that McConnell offered “his deepest sympathies for the people of El Paso and Dayton and discuss the senseless tragedies of this weekend.” A total of 29 people died in two shootings that occurred in El Paso, Texas, on Saturday and another in Dayton, Ohio, overnight. Follow Kyle on Twitter @RealKyleMorris and Facebook.",
      "date": "4 Aug 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Cory Booker Calls out Mitch McConnell: Demands Gun Control Vote",
      "url": "https://www.breitbart.com/politics/2019/08/05/cory-booker-calls-out-mitch-mcconnell-demands-gun-control-vote/",
      "subtitle": "Democrat presidential hopeful Cory Booker blasted Sen. Majority Leader Mitch McConnell (R-KY) after the Texas and Ohio shootings, demanding the Senate be convened for a gun control vote.",
      "author": "AWR Hawkins",
      "content": " Booker tweeted:  USA Today reports universal background check legislation has been sitting in the Senate since being passed by the Democrat-controlled House in February of this year. Demands for Senate passage of the checks has been made again and again following high profile, firearm-based crimes. Breitbart News reported Hollywood calls for “universal background checks” following the July 29, 2019, Gilroy Garlic Festival shooting in California. But the majority of shooters–like the Gilroy Garlic Shooter–acquire their guns at retail, which means they are already passing background checks to get their guns. Universal checks would not change that. Sen. Minority Leader Chuck Schumer (D-NY) is specifically calling for universal checks following the Texas and Ohio shootings. USA Today quoted Schumer demanding, “McConnell must call the Senate back for an emergency session to put the House-passed universal background checks legislation on the Senate floor for debate and a vote immediately.” On August 4, 2019, Breitbart News reported that the Dayton, Ohio, shooter acquired his gun “legally.” Dayton Police Chief Richard Biehl made clear the attacker had no criminal history to prevent the purchase of a gun. AWR Hawkins is an award-winning Second Amendment columnist for Breitbart News and the writer/curator of Down Range with AWR Hawkins, a weekly newsletter focused on all things Second Amendment, also for Breitbart News. He is the political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com. Sign up to get Down Range at breitbart.com/downrange.",
      "date": "5 Aug 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Lawmakers Urge McConnell to Cancel August Recess for Vote on Gun Legislation",
      "url": "https://www.breitbart.com/politics/2019/08/05/lawmakers-urge-mcconnell-to-cancel-august-recess-for-vote-on-gun-legislation/",
      "subtitle": "Lawmakers are urging Senate Majority Leader Mitch McConnell (R-KY) to cancel the chamber’s August recess in order to respond to the two deadly shootings that took the lives of at least 29 people and injured dozens more over the weekend.",
      "author": "Hannah Bleau",
      "content": " Senate Minority Leader Chuck Schumer (D-NY) called for McConnell to bring the Senate back to vote for the House-approved Bipartisan Background Checks Act of 2019, which would “create new background check requirements for gun transfers between unlicensed individuals, “NBC News reports:  Schumer released a statement over the weekend and lambasted the president for not denouncing, “right-wing extremists who often traffic in hate and white nationalism” enough. “When President Trump spends more time and energy denouncing Rep. Elijah Cummings and Baltimore than he does denouncing right-wing extremists who often traffic in hate and white nationalism, it shows his priorities are un-American and way off balance,” Schumer stated. He added: Leader McConnell, do the right thing. Call an emergency session. Wherever the senators are. Put the House bill on the floor, and it will pass. And the president, my guess is, will have no choice but to sign it. And maybe we can do something to begin dealing with gun laws in a rational way. And not just quaking when the [National Rifle Association] and other extreme groups tell Congress to sit on its hands. Sen. Bernie Sanders (I-VT) also called for McConnell to take action. “Mitch McConnell should bring the Senate back into session immediately to pass HR 8, the gun safety bill that has already passed the House,” he tweeted. “That’s a first step to addressing our serious gun violence epidemic.”:  “We must treat this like the public health crisis that it is. @SenMajLdr: Bring the Senate back from recess to vote on legislation to address the gun violence epidemic,” Sen. Elizabeth Warren (D-MA) wrote.  “Mitch McConnell needs to bring the Senate back from recess right now and hold votes on legislation to protect Americans from gun violence. Enough. We need to end this carnage now,” Sen. Cory Booker (D-NJ) added.  Hillary Clinton jumped into the fray as well, demanding Senate action: “The House has sent common-sense gun safety legislation to the Senate. Demand that @senatemajldr and your Republican elected officials join Democrats to pass it,” she wrote in part:  Republican Sen. Tim Scott (R-SC) told Face the Nation Sunday he’d be “happy” to go back to vote on such an important issue. “I’d leave tonight. I’ll go tomorrow, it doesn’t matter to me,” he said. “This is such an important issue.”:  However, it remains unclear if the House-passed background check measure would have done anything to prevent the shootings in El Paso, Texas, and Dayton, Ohio. As Breitbart News’s AWR Hawkins reported: USA Today reports universal background check legislation has been sitting in the Senate since being passed by the Democrat-controlled House in February of this year. Demands for Senate passage of the checks has been made again and again following high profile, firearm-based crimes. Breitbart News reported Hollywood calls for “universal background checks” following the July 29, 2019, Gilroy Garlic Festival shooting in California. But the majority of shooters–like the Gilroy Garlic Shooter–acquire their guns at retail, which means they are already passing background checks to get their guns. Universal checks would not change that. … On August 4, 2019, Breitbart News reported that the Dayton, Ohio, shooter acquired his gun “legally.” Dayton Police Chief Richard Biehl made clear the attacker had no criminal history to prevent the purchase of a gun. On Monday, President Trump proposed tying “strong background checks” to “desperately needed immigration reform.”:  ",
      "date": "5 Aug 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Stephen King: Mitch McConnell ‘Should Be Charged As an Accomplice’ in TX, OH Shootings",
      "url": "https://www.breitbart.com/entertainment/2019/08/05/stephen-king-mitch-mcconnell-should-be-charged-as-an-accomplice-in-tx-oh-shootings/",
      "subtitle": "Author Stephen King reacted to the deadly shootings that ravaged El Paso, Texas, and Dayton, Ohio, over the weekend by lashing out at Senate Majority Leader Mitch McConnell (R-KY), stating that the Kentucky lawmaker “should be charged as an accomplice in these deaths.”",
      "author": "Hannah Bleau",
      "content": " Twenty-one were killed in El Paso and nine in Dayton over the weekend, with several dozen injures between both tragedies. Rather than putting political animosity aside and standing in solidarity with victims and their families, the Pet Sematary writer took aim at McConnell and told his 5 million Twitter followers that the Senate Majority Leader “should be charged as an accomplice in these deaths” following McConnell’s tweet on the carnage in El Paso.  Meanwhile, Senate Democrats are urging McConnell to cancel the August recess in order pass House-approved universal background check legislation. “Leader McConnell, do the right thing. Call an emergency session,” Senate Minority Leader Chuck Scumer (D-NY) said Sunday. ” Wherever the senators are. Put the House bill on the floor, and it will pass. And the president, my guess is, will have no choice but to sign it.” “Maybe we can do something to begin dealing with gun laws in a rational way,” he continued. “And not just quaking when the [National Rifle Association] and other extreme groups tell Congress to sit on its hands.” There is little evidence that the House-backed measure would have prevented either shooting. As Breitbart News’s AWR Hawkins noted, “The majority of shooters–like the Gilroy Garlic Shooter–acquire their guns at retail, which means they are already passing background checks to get their guns. Universal checks would not change that.” Additionally: On August 4, 2019, Breitbart News reported that the Dayton, Ohio, shooter acquired his gun “legally.” Dayton Police Chief Richard Biehl made clear the attacker had no criminal history to prevent the purchase of a gun. The gun the El Paso shooter used was also purchased legally, according to reports. President Trump addressed the nation Monday morning and condemned white supremacy, bigotry, and racism and encouraged mental health-based reforms. “These sinister ideologies must be defeated,” he stated.  “It is too easy today for troubled youth to surround themselves with a culture that celebrates violence,” he continued. “We must stop or substantially reduce this and it has to begin immediately.” This is far from the first time the King has lashed out at notable right-wing figures. Last month, he called the president a “vile, racist, and incompetent bag of guts and waters,” and he called White House staff “bad tempered, arrogant, insensitive, and largely incompetent” last year.  ",
      "date": "5 Aug 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Warriors’ Steve Kerr After Mass Shootings: ‘How Does Mitch McConnell Sleep at Night?’",
      "url": "https://www.breitbart.com/sports/2019/08/05/warriors-steve-kerr-after-mass-shootings-how-does-mitch-mcconnell-sleep-night/",
      "subtitle": "In the wake of two mass shootings in less than a day, outspoken Golden State Warriors coach Steve Kerr jumped to his Twitter account to go on the attack against the Second Amendment and gun violence.",
      "author": "Warner Todd Huston",
      "content": " As news about the shootings emerged, Kerr mostly took to retweeting others. But in some of those re-tweets, the NBA coach added his own comments. For instance, on Saturday he noted that we have a “white supremacist problem” in the U.S.A.  He also uncorked a pair of tweets attacking Republican Senate Majority Leader Mitch McConnell:   But Kerr also retweeted a lot of anti-gun tweets without adding his own comments. Kerr retweeted leftist writer Dave Weigel who suggested that “video games” are responsible for America’s murder rate:  He re-tweeted extremist leftist New York Times writer Charles Blow’s claim that the shootings are not spurred by mental illness:  Kerr also favored a list of other anti-gun and anti-Trump tweets:     Follow Warner Todd Huston on Twitter @warnerthuston.",
      "date": "5 Aug 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Kamala Harris: McConnell Is Failing to Act in Safety, Best Interests of American People",
      "url": "https://www.breitbart.com/clips/2019/08/05/kamala-harris-mcconnell-is-failing-to-act-in-safety-best-interests-of-american-people/",
      "subtitle": "null",
      "author": "Pam Key",
      "content": " Monday on MSNBC’s “Live,” 2020 Democratic presidential hopeful Sen. Kamala Harris (D-CA) said in light of the House of Representatives passing a background check bill five months ago and Senate Majority Leader Mitch McConnell (R-KY) not bringing it up for a Senate vote, McConnell was failing his duty to protect the American public from mass shootings. Harris said, “Hey, Mitch McConnell, put it on the floor for a vote. Bring everyone back and let’s pass this thing. Let’s do this. Let’s do the right thing.” She added, “Let’s have action. And action means doing what Congress has the power and the responsibility to do, which is act in the best interest of the American people and in the best interest of the safety and well-being of the American people. That is the charge of the United States Congress, and it has failed to act.” Follow Pam Key on Twitter @pamkeyNEN",
      "date": "5 Aug 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "CNN, NYT Contributor Wajahat Ali Pushes #MassacreMoscowMitch Hashtag About McConnell",
      "url": "https://www.breitbart.com/the-media/2019/08/06/cnn-nyt-contributor-wajahat-ali-pushes-massacremoscowmitch-hashtag-about-mcconnell/",
      "subtitle": "Wajahat Ali, a New York Times contributing op-ed writer and CNN contributor expressed glee as “#MassacreMoscowMitch” — an apparent reference to mass shootings and Senate Majority Leader Mitch McConnell (R-KY) — trended on Twitter Monday and even tweeted out the hashtag himself.",
      "author": "Joshua Caplan",
      "content": " “#MassacreMoscowMitch is trending. I still have faith in America,” Ali tweeted before deleting the post amid criticism from center-right journalists.  OAN Tipping Point host Liz Wheeler tweeted of Ali’s post: “If you whine about incendiary rhetoric from politicians – especially after TWO mass shootings this weekend – but you also tweet #MassacreMoscowMitch at a politician BECAUSE YOU DON’T LIKE HIM, then you can sit the hell down.”  Newsbusters managing editor Curtis Houck wrote:  The hashtag is a reference to McConnell’s staunch opposition to gun control legislation. In February, the House passed a bill that would have mandated universal background checks for gun purchases. Democrats have called on the Kentucky Republican to cancel the Senate’s August recess in order to respond to the El Paso and Dayton shootings that took the lives of 31 people over the weekend. “El Paso, Dayton, one awful event after another. @SenateMajLdr McConnell must call the Senate back for an emergency session to put the House-passed universal background checks legislation on the Senate floor for debate and a vote immediately,” Senate Minority Leader Chuck Schumer (D-NY) tweeted Sunday. Ali confirmed that he was deleting the tweet Tuesday morning after it sparked backlash, claiming others were spreading it in “bad faith.”  He continued venting, accusing “right wing trolls” of an attempt to “deflect” discussions about gun control and “white supremacist terrorism.” “Don’t let them rattle you. Keep moving forward,” the CNN contributor told his 140,000 followers.  In the wake of the shootings, gun control activists have turned the volume up on their incendiary rhetoric targeting McConnell. On Sunday evening, gun control supporters protested outside the lawmaker home in Kentucky and shouted death threats. “Murder Turtle!” protesters were heard chanting, according to video footage shared to Facebook. “The bitch home — we keep seeing the lights go on and off,” another demonstrator is heard saying. “This hoe really thought he was going to get ready to be at home after he hurt his little punk ass shoulder. Bitch, don’t nobody give a fuck! Fuck your thoughts and prayers, Mitch. Fuck you, fuck your wife, fuck everything you stand for. ”",
      "date": "6 Aug 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "WATCH — Protesters Gather Outside Mitch McConnell’s Home, Shout Death Threats",
      "url": "https://www.breitbart.com/politics/2019/08/06/watch-protesters-gather-outside-mitch-mcconnells-home-shout-death-threats/",
      "subtitle": "A small group of gun-control activists shouted death threats as they gathered outside the Louisville, Kentucky, home of Senate Majority Leader Mitch McConnell (R-KY) on Sunday night.",
      "author": "Kyle Morris",
      "content": " Chants of “No Trump, no KKK, no Fascist USA!” could be heard from the estimated 25 protesters in attendance, who also referred to the senator as “murder turtle.” According to WLKY, police were present at the scene and prevented the protesters, who were dragging shovels on the ground and creating loud noise, from reaching McConnell’s home. In a video shared on Facebook Live, one male protester said he hoped someone had a “voodoo doll for these bitches.” A female protester nearby later said, “Just stab the motherf*cker in the heart, please.” A woman is on Facebook Live, outside of Senator McConnell’s home in Louisville, saying she hopes someone “just stabs the mother f*cker in the heart, please.” #KYSen pic.twitter.com/sHaPWqn32J — Ben Goldey (@BenGoldey) August 6, 2019  “The bitch is home… we keep seeing the lights go on and off,” one protester said. “This hoe really thought he was going to get ready to be at home after he hurt his little punk ass shoulder. Bitch, don’t nobody give a f*ck! F*ck your thoughts and prayers, Mitch. F*ck you, f*ck your wife, f*ck everything you stand for. ”  “We’re out here because he wants thoughts and prayers, when another white man massacres people,” one protester said in regards to McConnell. Protesters also took aim at McConnell’s wife, Secretary of Transportation Elaine Chao. “F*ck Elaine! F*ck Elaine! F*ck Elaine,” one protester shouted.  Unaware of the threats made on Facebook Live, Louisville metro police told the New York Post that those in attendance outside of McConnell’s home were “protesting peacefully.” A spokesman for the Louisville metro police added, “We are assisting Capitol Police.” Earlier this week, 77-year-old McConnell was treated and released at a local hospital after he tripped on his patio and fractured his shoulder at his Kentucky home. Follow Kyle on Twitter @RealKyleMorris and Facebook.",
      "date": "6 Aug 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell Campaign Suspended from Twitter for Highlighting Violent Threats",
      "url": "https://www.breitbart.com/tech/2019/08/07/mitch-mcconnell-campaign-suspended-from-twitter-for-highlighting-violent-threats/",
      "subtitle": "The campaign account for Senate Majority Leader Mitch McConnell (R-KY) was suspended from Twitter after sharing a video of protesters allegedly making violent threats against the Senator, including a protester saying “just stab the motherfucker in the heart.” Twitter had no problem with “Massacre Mitch” trending on the platform.",
      "author": "Allum Bokhari",
      "content": " Sen. McConnell’s team slammed Twitter in a comment to USA Today’s Courier-Journal. “This morning, Twitter locked our account for posting the video of real-world, violent threats made against Mitch McConnell. This is a problem with the speech police in America today,” said campaign manager Kevin Golden. “Twitter will allow the words of ‘Massacre Mitch’ to trend nationally on their platform, but locks our account for posting actual threats against us,” Golden added. “We appealed and Twitter stood by their decision, saying our account will remain locked until we delete the video.” Daily Wire reporter Ryan Saavedra was also locked out of his Twitter account for drawing attention to the threats. “Twitter asked me yesterday to delete this tweet,” said Saavedra. “It showed a person allegedly calling for violence against Mitch McConnell. The person appears to be a BLM activist who has met with Elizabeth Warren.” “I said no and they suspended me *and* McConnell’s re-election campaign.”  A Twitter spokeswoman told Breitbart News that the platform does not allow the sharing of violent threats on the platform regardless of context. This means that even if the person sharing the material intended to criticize the threats, they can still be banned, suspended, or locked out of their account as a result. On Saavedra’s ban, the spokeswoman said: “The user was temporarily locked out of their account for a Tweet that violated our violent threats policy, specifically threats involving physical safety.” Are you an insider at Google, Facebook, Twitter or any other tech company who wants to confidentially reveal wrongdoing or political bias at your company? Reach out to Allum Bokhari at his secure email address allumbokhari@protonmail.com. Allum Bokhari is the senior technology correspondent at Breitbart News.",
      "date": "7 Aug 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Dem Rep. Cleaver: McConnell Doesn’t Care to Listen About Gun Reform — ‘He Plays to an Audience of One’",
      "url": "https://www.breitbart.com/clips/2019/08/08/dem-rep-cleaver-mcconnell-doesnt-care-to-listen-about-gun-reform-he-plays-to-an-audience-of-one/",
      "subtitle": "null",
      "author": "Trent Baker",
      "content": " During a Thursday appearance on CNN’s “New Day,” Rep. Emanuel Cleaver (D-MO) lamented over Senate Majority Leader Mitch McConnell’s (R-KY) lack of response to a letter from over 200 House Democrats urging him to cancel the chamber’s August recess to address the deadly shootings that happened in El Paso, TX, and Dayton, OH. Cleaver said it is “frustrating” that McConnell is refusing to do something about getting “rid of war weapons,” adding he is just playing to “an audience of one.” “I think the Senate majority leader is also listening to the NRA, and I don’t think that he is going to respond to the letter in a positive way at least,” Cleaver stated. “And it’s sad because if you think about this we’re a nation over 300 million people, most of whom support background checks, most of whom support getting rid of war weapons held by citizens, and yet one person is going against almost 300 million people and refusing to do something that is a modest reform of guns. And it’s so tragic because it’s frustrating the public.” He continued, “[I]ndividuals are expressing their frustrations with what is going on … and I don’t think that the majority leader cares. I think he plays to an audience of one.” Follow Trent Baker on Twitter @MagnifiTrent",
      "date": "8 Aug 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell: ‘Assault Weapons’ Ban ‘Front and Center’ in Senate",
      "url": "https://www.breitbart.com/politics/2019/08/08/mitch-mcconnell-assault-weapons-ban-front-and-center-in-senate/",
      "subtitle": "Senate Majority Leader Mitch McConnell (R-KY) indicated an “assault weapons” ban and other gun controls would be “front and center” when the Senate reconvenes in September.",
      "author": "AWR Hawkins",
      "content": " The Courier-Journal reports that McConnell was a guest on the Louisville, KY, Terry Meiners Show where he said, “What we can’t do is fail to pass something,” adding, “The urgency of this is not lost on any of us.” NPR reports that McConnell addressed an “assault weapons” ban, saying: “We had that ban for about a 10-year period. There’s a good deal of dispute about whether it actually had an impact or not. It’s certainly one of the front and center issues. I think … probably background checks and red flags will probably lead the discussion. But a lot of other things will come up as well.” McConnell also stressed background checks would be taken up by the Senate. On August 7, 2019, Breitbart News reported that President Donald Trump pushed for Congressional action for background checks. The Associated Press quoted Trump saying, “There’s a great appetite, and I mean a very strong appetite, for background checks. And I think we can bring up background checks like we’ve never had before.” The U.S. has had background checks on retail gun sales since 1998. AWR Hawkins is an award-winning Second Amendment columnist for Breitbart News and the writer/curator of Down Range with AWR Hawkins, a weekly newsletter focused on all things Second Amendment, also for Breitbart News. He is the political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com. Sign up to get Down Range at breitbart.com/downrange.",
      "date": "8 Aug 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Dem Rep. Ryan on McConnell, Trump Slow-Playing Gun Legislation: ‘Give Me a Freaking Break’",
      "url": "https://www.breitbart.com/clips/2019/08/09/dem-rep-ryan-on-mcconnell-trump-slow-playing-gun-legislation-give-me-a-freaking-break/",
      "subtitle": "null",
      "author": "Trent Baker",
      "content": " On Friday, 2020 Democratic presidential hopeful Rep. Tim Ryan (D-OH) commented on Senate Majority Leader Mitch McConnell and President Donald Trump’s “playbook” when it comes to gun legislation in the wake of mass shootings in Texas and Ohio. Ryan urged McConnell on CNN’s “New Day” to quit “slow-walking” gun legislation and “act immediately.” “Mitch McConnell is sitting on his hands and he wants to talk about it in four or five weeks? Give me a freaking break,” Ryan told host John Berman. “I get so mad when I hear this stuff and then Donald Trump saying, ‘Well, yeah I want to consider. Oh yeah, maybe red flag. Oh yeah, oh yeah. It’s always ‘Oh yeah’ something some other time.” “It’s got to stop, John. The whole country’s on edge. We need the leaders to act,” he added. The representative from Ohio went on to say he will keep the pressure up in his fight for gun legislation. Follow Trent Baker on Twitter @MagnifiTrent",
      "date": "9 Aug 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "‘Victory!’: Twitter Unlocks Mitch McConnell Campaign Account After GOP Boycott",
      "url": "https://www.breitbart.com/tech/2019/08/09/victory-twitter-unlocks-mitch-mcconnell-campaign-account-after-gop-boycott/",
      "subtitle": "Twitter announced Friday that it unlocked Senate Majority Leader Mitch McConnell’s (R-KY) campaign account after many Republican groups threatened to stop advertising on the social media platform.",
      "author": "Sean Moran",
      "content": " Twitter locked McConnell’s campaign account @Team_Mitch Wednesday after the account posted footage of a protester threatening the Senate Majority Leader at his house in Kentucky. The social media company said that the footage featured violent threats, which reportedly violates their social media content policy. Many Republican groups, such as the Republican National Committee (RNC), the Donald Trump campaign, the National Republican Campaign Committee (NRCC), and the National Senate Republican Committee (NRSC) boycotted Twitter, saying that they will no longer purchase ads on the online platform.  The Twitter communications team said Friday that they will unlock McConnell’s campaign account, claiming that they have reviewed this case more closely. The social media platform said that the video featuring leftists making violent threats will feature a “sensitive media” tag. In response to the news, McConnell’s campaign said, “Victory!!!” McConnell’s campaign added, “Thank you to EVERYONE for helping #FreeMitch.”  “After multiple appeals from affected users and Leader McConnell’s team confirming their intent to highlight the threats for public discussion, we have reviewed this case more closely,” Twitter said. “Going forward, the video will be visible on the service with a sensitive media interstitial and only in cases where the Tweet content does not otherwise violate the Twitter Rules,” Twitter added.  Sean Moran is a congressional reporter for Breitbart News. Follow him on Twitter @SeanMoran3.",
      "date": "9 Aug 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "NRA Warns Trump and McConnell Against Gun Control",
      "url": "https://www.breitbart.com/politics/2019/08/09/nra-warns-trump-mcconnell-gun-control/",
      "subtitle": "On August 8, 2019, NRA executive vice president Wayne LaPierre issued a statement taking exception with the gun control push currently emanating from the White House and Senate Majority Leader Mitch McConnell (R-KY).",
      "author": "AWR Hawkins",
      "content": " On Monday, President Donald Trump voiced his support for “strong background checks,” saying, “Republicans and Democrats must come together and get strong background checks, perhaps marrying this legislation with desperately needed immigration reform. We must have something good, if not GREAT, come out of these two tragic events!” On Wednesday, Trump followed up by pushing background checks again. The Associated Press quoted him saying, “There’s a great appetite, and I mean a very strong appetite, for background checks. And I think we can bring up background checks like we’ve never had before.” At the same time, Democrats were pressuring Senate Majority Leader Mitch McConnell (R-KY) to allow a vote on the Democrat-controlled House’s universal background check bill. The U.S. has had background checks on retail sales sine 1998. This means purchases at gun stores, large retailers, pawn shops, etc., are conducted only after the would-be purchaser passes an FBI background check via the National Instant Criminal Background Check System (NICS). Universal background checks expand those point-of-sale checks to cover private sales too. And “assault weapons” ban and numerous other controls are also being considered in the current gun control push. On August 8, 2019, McConnell told the Louisville, Kentucky, Terry Meiners Show that an “assault weapons” ban and other gun controls will be “front and center” when the Senate reconvenes in September. The problem with an “assault weapons” ban is that the very phrase, “assault weapons,” is a politically driven moniker used to ban whole categories of firearms. But the moniker applies to cosmetic features of firearms — heat shield, thumbhole stock, collapsible stock, flash hider, etc. — rather than the firearms themselves. This focus on cosmetics allows proponents of an “assault weapons” ban to cover everything from commonly-owned semiautomatic rifles, to pump shotguns, to pistols with the ability to accept magazines holding more than ten rounds. That same day, the NRA’s LaPierre put forward a statement condemning the gun control push. The statement said: I’m not inclined to discuss private conversations with President Trump or other key leaders on this issue. But I can confirm that the NRA opposes any legislation that unfairly infringes on the rights of law-abiding citizens. The inconvenient truth is this: the proposals being discussed by many would not have prevented the horrific tragedies in El Paso and Dayton. Worse, they would make millions of law-abiding Americans less safe and less able to defend themselves and their loved ones. LaPierre added: “The NRA will work in good faith to pursue real solutions to the epidemic of violence in America. But many proposals are nothing more than ‘soundbite solutions’ — which fail to address the root of the problem, confront criminal behavior, or make our communities safer.” The NRA supported the creation of the National Instant Criminal Background Check System, the heart of the current background check system. The system was designed to prevent felons and other criminals from acquiring guns. The Democrat approach is a broader one intent on making it harder for everyone — particularly law-abiding citizens — to exercise a constitutional right that the Left simply does not like. California has had universal background checks since the mid-1990s and an “assault weapons” ban since 1989. The state continues to witness high-profile public shooting after high-profile public shooting. The U.S. had an “assault weapons” ban at the federal level from 1994-2004. Breitbart News reported a Department of Justice, National Institute of Justice report showing that the ban could not be credited with any reduction in crime. Despite the clear failures of these gun controls, Trump will most likely be criticized by Democrats if such controls are not adopted. NRA board member Ken Blackwell spoke to this, saying: The NRA has had a great relationship with President Trump, and simply made clear to all policymakers—including every congressman and senator—that the NRA supports legislation that makes communities safer for law-abiding Americans, and opposes legislation that does not actually solve problems. The reality is that the Far Left opposes both the Second Amendment and the president, and whatever he might agree to, Democrats will still condemn him for not going far enough. NRA members want safe communities, but know that gun controls from Pelosi and Schumer will not make them safer. The Democrats’ gun-control bill is a trap that would demoralize the president’s supporters while not earning him any support from those on the Left. AWR Hawkins is an award-winning Second Amendment columnist for Breitbart News and the writer/curator of Down Range with AWR Hawkins, a weekly newsletter focused on all things Second Amendment, also for Breitbart News. He is the political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com. Sign up to get Down Range at breitbart.com/downrange.",
      "date": "9 Aug 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Dem Rep. McGovern: McConnell Wants to ‘Keep Taking the NRA’s Blood Money’",
      "url": "https://www.breitbart.com/clips/2019/08/10/dem-rep-mcgovern-mcconnell-wants-to-keep-taking-the-nras-blood-money/",
      "subtitle": "null",
      "author": "Ian Hanchett",
      "content": " During Friday’s Democratic Weekly Address, Representative Jim McGovern (D-MA) criticized Senate Majority Leader Mitch McConnell (R-KY) for not calling the Senate back to vote on gun legislation by saying McConnell would “rather keep taking the NRA’s blood money in exchange for his silence.” McGovern also said Republicans are waiting “for another tweet from the president to distract the American people and change the topic.” Transcript as Follows: “Hi, I’m Congressman Jim McGovern and I’m grateful to represent the people of Massachusetts’ Second Congressional District in Congress. Our country is still reeling from mass shootings in El Paso and Dayton. Our hearts break for the victims, for their families, and everyone who has been impacted by this violence. We’ll learn more about these horrific acts in the days and weeks to come. But here’s what we already know: thoughts and prayers are not enough. It’s time for action. America is the only developed country in the world where massacres like these happen on a regular basis. It seems like any time a family member leaves home, we’re left to wonder if we’ll ever see them again. Whether it’s at a movie theater, a concert, their elementary school, their church, or their synagogue. No place seems safe. It has to stop. Now. President Trump and Republicans can blame video games or mental illness all they want. Other countries play video games and deal with mental illness, but only here, in America, have mass shootings become the new normal. I wish they would just tell the truth: this is about guns. You know, in many states, it’s easier to get a gun than it is to register to vote. And weapons of war can be bought in virtually the blink of an eye – without a background check. This isn’t by accident. The gun lobby has spent millions bankrolling their allies in Congress so they can slash any kind of sensible gun safety laws. Look, I wish this issue wasn’t political – that Democrats and Republicans in Congress could all agree with the overwhelming majority of Americans that want tougher gun laws. But you deserve to know the truth. It has been five months since the Democratic House passed a pair of commonsense bills that would simply close a loophole and ensure comprehensive background checks on gun sales and transfers. Five Months! And what has the Republican Senate done under Mitch McConnell? No hearings. No debates. No votes. Nothing. Mitch McConnell ought to call the Senate back into session right now and pass the Gun Safety bills which have been sitting on his desk for five months. But instead, he’d rather keep taking the NRA’s blood money in exchange for his silence. All the while, Republicans wait for another tweet from the president to distract the American people and change the topic. Well, I’ve got news for Mitch McConnell and the Republican Senate: the American people have been down this road before. What’s different now is that this House Majority is not bought and paid for by the gun lobby. Mitch McConnell may take pride in the Senate being called a legislative graveyard. But mothers are burying their kids. And babies are growing up without their parents. And the days of inaction are over. While Republicans refuse to do any work at all to end gun violence, they seem to be working overtime to undermine and sabotage the Affordable Care Act. Right now, a lawsuit filed by the Trump Administration is working its way through the courts. If it’s successful, the entire Affordable Care Act could be struck down. Think about that. If President Trump gets his way, 2.3 million young people would be kicked off their parents’ plans, insurance companies would be allowed to discriminate against people with pre-existing conditions like diabetes and asthma, and insurance CEOs would be able to use your premiums to pay for their bonuses instead of your health care. It would be catastrophic. That’s why on day 1 of our new majority, we voted to throw the full legal weight of the House of Representatives against this lawsuit. House Democrats have also passed and sent to the Senate strong bills to strengthen protections for people with pre-existing conditions even further. And we’ve passed five bills that confront big pharma’s unfair practices that keep drug prices high and prevent lower-cost generic versions of drugs from getting to the market. You know, for most people, this is just common-sense stuff. I’ve held over a dozen town halls over the last year, and I hear the same stories over and over again. Seniors who can’t afford their medications, so they split pills or skip a dose altogether. Doctors and nurses who are worried about what will happen if they can’t provide their patients the care they need. People with pre-existing conditions like cancer, heart disease, and high blood pressure who have no idea what they would do if they were denied or dropped by their insurance when they need it the most. As Members of Congress, we weren’t elected just to hear people’s problems – we were sent here to solve them. While Mitch McConnell and the Republican Senate continue to sit on their hands, I am proud that House Democrats are taking action on behalf of the American people. From combating gun violence, to protecting people with pre-existing conditions, to lowering the cost of prescription drugs, we will continue working For The People to deliver a safer, healthier future for all Americans.” Follow Ian Hanchett on Twitter @IanHanchett",
      "date": "10 Aug 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Democrats Push More Gun Control After McConnell Caves on Background Checks",
      "url": "https://www.breitbart.com/politics/2019/08/14/democrats-push-more-gun-control-after-mcconnell-caves-on-background-checks/",
      "subtitle": "Democrat lawmaker are already looking beyond universal background checks in hopes of pressuring Sen. Majority Leader Mitch McConnell (R-KY) into banning “assault weapons” too.",
      "author": "AWR Hawkins",
      "content": " McConnell already made clear universal background checks “will probably lead the discussion” when the Senate reconvenes in September, so Democrats are pressing on to their next goal–securing an “assault weapons” ban. The Hill quoted Anthony Brown (D-MD) saying, “Meaningful action doesn’t end with signing a bipartisan background checks bill, which is important. We have to ban high-capacity magazines that allowed the Dayton shooter and so many others to fire off tens of rounds in merely seconds. We have to ban assault weapons to get these weapons of war off our streets.” The gun control group Newtown Action tweeted:  Almost 200 House Democrats have already signed on to “assault weapons” ban legislation that would not only prohibit millions of the most commonly-owned semiautomatic rifles in America but would also ban magazines holding 11 or more rounds of ammunition. The “assault weapons” ban legislation is sponsored by Rep. David N. Cicilline (D-RI). Common Dreams quoted Rep. Steny Hoyer (D-MD) telling reporters that McConnell needs “to look a special interest group in the eye and say enough is enough, it’s time to act.” AWR Hawkins is an award-winning Second Amendment columnist for Breitbart News and the writer/curator of Down Range with AWR Hawkins, a weekly newsletter focused on all things Second Amendment, also for Breitbart News. He is the political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com. Sign up to get Down Range at breitbart.com/downrange.",
      "date": "14 Aug 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Escobar: ‘Un-American’ That McConnell Won’t Allow Debate on Gun Legislation",
      "url": "https://www.breitbart.com/clips/2019/08/17/escobar-un-american-that-mcconnell-wont-allow-debate-on-gun-legislation/",
      "subtitle": "null",
      "author": "Ian Hanchett",
      "content": " While speaking to CNN on Saturday, Representative Veronica Escobar (D-TX) stated that it is “un-American” that Senate Majority Leader Mitch McConnell (R-KY) won’t bring up gun legislation in the Senate. Escobar said, “It is absolutely unreal to me that common sense, bipartisan legislation won’t even hear debate on the Senate side. It is un-American. What Senator McConnell has done is essentially silenced millions of Americans. One man has the power to silence millions. It’s unjust, un-American, unfair, and it’s deadly. For people like those of us who live in El Paso, Texas, these laws are a matter of life and death.” Follow Ian Hanchett on Twitter @IanHanchett",
      "date": "17 Aug 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Scarborough: Mitch McConnell ‘Doing the Bidding of Vladimir Putin’",
      "url": "https://www.breitbart.com/clips/2019/08/29/scarborough-mitch-mcconnell-doing-the-bidding-of-vladimir-putin/",
      "subtitle": "null",
      "author": "Trent Baker",
      "content": " During Thursday’s “Morning Joe” on MSNBC, host Joe Scarborough continued in his criticism of Senate Majority Leader Mitch McConnell (R-KY) in regards to Russia. Scarborough, who has referred to McConnell as “Moscow Mitch,” accused the Senate majority leader “doing the bidding” of Russia President Vladimir Putin in “killing every effort” to protect the United States from attacks on its democracy despite knowing the dangers posed by Russia. “You talk about fatal distractions,” Scarborough said to MSNBC’s Al Sharpton, “it hasn’t just happened the past year or two. Unfortunately, for the past decade or so, you’ve had members coming into the United States Senate, young members, thinking that it was nothing more than a stepping stone to the presidency, not realizing that the power in Washington, D.C. often rests in large part with the United States senators that go, stay and make a difference.” He continued, “What’s in the front of my mind right now is a Senate majority leader who has been told by the FBI and CIA and the United States military that the Russians are interfering with American democracy, and yet this Senate majority leader from Kentucky keeps killing every effort by Republicans and Democrats to protect and defend the United States of America against these attacks on our democracy. Mitch McConnell — if that’s what Americans want in their Senate majority leader, somebody that’s doing the bidding of Vladimir Putin, somebody who refuses to listen to the Republican-nominated FBI director, CIA director, director of national intelligence and U.S. military intel officers, that’s a curious choice for voters to make — very dangerous choice for voters to make as well.” Follow Trent Baker on Twitter @MagnifiTrent",
      "date": "29 Aug 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Dem Rep. Ryan: ‘We Want Mitch McConnell to Get Off His Ass and Do Something in the United States Senate’",
      "url": "https://www.breitbart.com/clips/2019/09/01/dem-rep-ryan-we-want-mitch-mcconnell-to-get-off-his-ass-and-do-something-in-the-united-states-senatedem-rep-ryan-we-want-mitch-mcconnell-to-get-off-his-ass-and-do-something-in-the-united-sta/",
      "subtitle": "null",
      "author": "Jeff Poor",
      "content": " During Sunday’s broadcast of MSNBC’s “Kasie DC,” 2020 Democratic presidential hopeful Rep. Tim Ryan (D-OH) criticized Majority Leader Mitch McConnell (R-KY) for not taking up gun control measures in the wake of incidents of gun violence around the country. Ryan accused McConnell of being a “sycophant” to President Donald Trump and carrying water for the National Rifle Association. “I think it’s absolutely ridiculous, Steve, and it’s infuriating to me and so many thousands and millions of other Americans who are watching this unfold every single day, week in the United States, not just the mass shootings but also the shootings of one or two people through gun violence every single day in communities across the United States,” he said. “We’re sick of this. And we’re infuriated, and we want action. We want Mitch McConnell to get off his ass and do something in the United States Senate. How you can watch the stories of fathers getting killed with two kids, a 17-month-old kid getting damage from shrapnel, 15-year-old high school kid, and do absolutely nothing is infuriating to every American who has common sense and 90 percent with the polling who want something done. And to push this off on mental health — then why the hell is the president’s — both of his health care initiatives, one from the House and one from the Senate last year, kick 20 million people off their health care, that includes mental health coverage? So, he’s completely full of it as well.” “And to push it off on that and then cut people’s health care shows me he’s trying to do the Potomac two-step” Ryan continued. “He’s carrying the water of the NRA. Mitch McConnell is emboldening him and as a sycophant to Donald Trump. And this stuff has got to stop, Steve. We’re tired — the American people are tired of it. And if McConnell wants to go into his election and put the Senate on the line with suburban Atlanta, suburban towns in North Carolina and Charleston and Greenville and Columbia with Lindsey Graham, and Lexington and Louisville, in Des Moines, in Topeka — look, let’s do it. Let’s do the dance. You’re going to lose. And we’re finally going to get gun reform in the United States. That’s how this is going to go down. Thirty thousand more members of Moms Demand Action just in the last couple of weeks. It’s not just the NRA standing out there all by itself. There are alternative groups of moms and parents and reasonable people — Democrats, Republicans, hunters, police officers — who are tired of it and now there’s a counterbalance, and they’re going to lose.” Follow Jeff Poor on Twitter @jeff_poor",
      "date": "1 Sep 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Klobuchar: McConnell Must Explain to Americans Why He Won’t Let the Senate Vote on Background Checks",
      "url": "https://www.breitbart.com/clips/2019/09/02/klobuchar-mcconnell-must-explain-to-americans-why-he-wont-let-the-senate-vote-on-background-checks/",
      "subtitle": "null",
      "author": "Pam Key",
      "content": " Monday on PBS’s “NewsHour,” 2020 Democratic presidential hopeful former Sen. Amy Klobuchar (D-MN) was shown speaking to reporters about gun control. On a universal background check bill, Klobuchar said, “Mitch McConnell is going to have to decide what side he’s on. So he’s going to have to explain to the people of this country why he wouldn’t let that bill that just passed the House come up for a vote.” Follow Pam Key on Twitter @pamkeyNEN",
      "date": "2 Sep 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "McConnell: I Expect Answer on What Gun Bills Trump Will Support Next Week",
      "url": "https://www.breitbart.com/clips/2019/09/03/mcconnell-i-expect-answer-on-what-gun-bills-trump-will-support-next-week/",
      "subtitle": "null",
      "author": "Ian Hanchett",
      "content": " On Tuesday’s “Hugh Hewitt Show,” Senate Majority Leader Mitch McConnell (R-KY) stated that he expects to hear from the White House on what gun legislation, if any, President Trump is willing to support next week. McConnell said, [relevant remarks begin around 4:00] “I said several weeks ago that if the president took a position on a bill so that we knew we would actually be making a law and not just having serial votes, I’d be happy to put it on the floor. And the administration is in the process of studying what they’re prepared to support, if anything, and I expect to get an answer on that next week.” Follow Ian Hanchett on Twitter @IanHanchett",
      "date": "3 Sep 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell Pledges Votes for Any Gun Control Trump Supports",
      "url": "https://www.breitbart.com/politics/2019/09/03/mitch-mcconnell-pledges-votes-gun-control-trump-supports/",
      "subtitle": "During a September 3 appearance on The Hugh Hewitt Show Senate Majority Leader Mitch McConnell (R-KY) pledged votes for any gun control supported by President Trump.",
      "author": "AWR Hawkins",
      "content": " He made clear there will be no votes for gun control without Trump’s support, as that would simply signal votes for legislation that will not become law. McConnell told Hewitt: I said several weeks ago that if the President took a position on a bill so that we knew we would actually be making a law and not just having serial votes, I’d be happy to put it on the floor. And the administration is in the process of studying what they are prepared to support, if anything. And I expect to get an answer to that next week. If the President is in favor of a number of things that he has discussed openly and publicly, and I know that if we pass it it’ll become law, I’ll put it on the floor. On August 8, Breitbart News reported McConnell’s observation that an “assault weapons” ban and universal background checks would hold a key spot in the gun control debate once the Senate reconvenes. NPR quoted McConnell discussing an “assault weapons” ban, saying: We had that ban for about a 10-year period. There’s a good deal of dispute about whether it actually had an impact or not. It’s certainly one of the front and center issues. I think … probably background checks and red flags will probably lead the discussion. But a lot of other things will come up as well. Trump pushed for bipartisan action on background checks on August 5 and August 7, just days after the heinous attacks in El Paso, Texas, and Dayton, Ohio. However, on September 1, Trump told reporters that the recent history of mass public shootings suggests more background checks would not have prevented the attacks. The guns used in the El Paso and Dayton attacks were acquired legally. AWR Hawkins is an award-winning Second Amendment columnist for Breitbart News and the writer/curator of Down Range with AWR Hawkins, a weekly newsletter focused on all things Second Amendment, also for Breitbart News. He is the political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com. Sign up to get Down Range at breitbart.com/downrange.",
      "date": "3 Sep 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "‘Do Something’: Washington Post Shames Mitch McConnell with Full-Page Gun Control Op-Ed",
      "url": "https://www.breitbart.com/politics/2019/09/04/do-something-washington-post-shames-mitch-mcconnell-full-page-gun-control-op-ed/",
      "subtitle": "On Wedneday the Washington Post ran a full-page editorial designed to pressure Sen. Majority Leader Mitch McConnell (R-KY) into passing gun control.",
      "author": "AWR Hawkins",
      "content": " The editorial, titled, “Do Something, Mr. McConnell,” begins by listing the victims of the 1999 Columbine High School attack then weaves its way to today, listing other high profile shootings along the way.  The Post editorial board asked, “What if there was a mass shooting in the United States not once or twice or four or six times monthly, but every single day, a big one, the kind that electrifies social media and squats for days on Page 1 — would that be enough to move Senate Majority Leader Mitch McConnell from his insistent inertia on gun safety?” They continued, “Would any volume of bloodshed convince the Kentucky Republican that Congress faces a moral imperative to act? Thirty-eight people were slain in three such shootings in August — in Dayton, Ohio, and El Paso, as well as West Texas — and still Senate Republicans and President Trump refuse to act.” They then list the names of victims, beginning with those killed in the 1999 Columbine attack and continuing through 28 others, ending with the August 4, 2019, Dayton, Ohio, attack. They do not mention that at least 20 of examples they provided were ones in which the guns used in the attacks were acquired legally and two were attacks attacks in which stolen and/or borrowed guns were used. That means the universal background check bill McConnell is being pressured to pass would have been powerless to stop those 22 attacks. The Post also lists the April 3, 2009, Birmingham, New York, immigration services shooting. Everytown for Gun Safety reports that the crime was carried out by a man with a New York pistol license and that guns he used were “registered” under his license. The bottom line is that the Post is using myriad examples that gun control would not have stopped in hopes of pressuring McConnell into supporting gun control. AWR Hawkins is an award-winning Second Amendment columnist for Breitbart News and the writer/curator of Down Range with AWR Hawkins, a weekly newsletter focused on all things Second Amendment, also for Breitbart News. He is the political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com. Sign up to get Down Range at breitbart.com/downrange.",
      "date": "4 Sep 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Jim Carrey: ‘Osama Bin Laden Doesn’t Hold a Candle to Mitch McConnell’",
      "url": "https://www.breitbart.com/entertainment/2019/09/05/jim-carrey-osama-bin-laden-doesnt-hold-a-candle-to-mitch-mcconnell/",
      "subtitle": "Jim Carrey said that the terror attacks of 9/11, responsible for 3,000 deaths and masterminded by Osama Bin Laden, doesn’t compare to the “gun deaths” the Hollywood actor says Sen. Mitch McConnell (R-KY) is responsible for.",
      "author": "Jerome Hudson",
      "content": " “10,000 gun deaths in 2019 and the year is far from over. What Osama bin Laden did to us was terrible but he doesn’t hold a candle to Mitch McConnell,” Jim Carrey said in a Tweet that included an imagine of a hand holding a $100 bill being dipped in blood.  The Sonic the Hedgehog star’s latest politically charged drawing comes in the wake of the horrific shooting in Midland-Odessa, Texas, that saw and a gunman kill seven people and injured 22 others. It also comes after San Francisco’s Board of Supervisors voting to unanimously declare the National Rifle Association (NRA) a terrorist organization. The NRA — an organization committed to expanding and defending the Constitutional right of law-abiding citizens to arm themselves — constantly finds itself at the center of attacks from the left, from Democratic presidential frontrunner Joe Biden who has vowed to “defeat the National Rifle Association” to left-wing Hollywood to Billionaire Michael Bloomberg’s anti-gun organization Moms Demand Action. Jim Carrey, though has long targeted the NRA. Last March, Carrey called NRA head Wayne LaPierre a “demon from hell.” A month earlier, the Dumb and Dumber star shared a blood-soaked painting of a bullet hole-riddled schoolgirl over an American flag. Jerome Hudson is Breitbart News Entertainment Editor and author of the forthcoming book 50 Things They Don’t Want You to Know, from HarperCollins. Follow Jerome Hudson on Twitter @jeromeehudson.",
      "date": "5 Sep 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Joe Biden: Mitch McConnell, Republicans Must ‘Stand up to the NRA’",
      "url": "https://www.breitbart.com/politics/2019/09/10/joe-biden-mitch-mcconnell-republicans-must-stand-up-to-the-nra/",
      "subtitle": "Democrat presidential hopeful Joe Biden used a Monday night tweet to tell Sen. Majority Leader Mitch McConnell (R-KY) and his Republican colleagues to “stand up to the NRA.”",
      "author": "AWR Hawkins",
      "content": " Biden claimed there is a “gun violence epidemic” which McConnell and the GOP can “take concrete action to end.”  On September 3, 2019, Breitbart News reported McConnell indicating he will support any gun control which President Trump supports. He made clear there will be no votes on other controls, as he does not simply want to vote for the sake of voting. On September 9, 2019, Breitbart News reported Sen. Chuck Schumer (D-NY) asking Trump to provide “political cover” for Republicans, thereby allowing them to support gun control and remain politically viable. Schumer said, “[President Trump] can lead his party to support something that the NRA has prevented Republicans from supporting for years. That is why Speaker Pelosi and I sent the letter to him today, urging him to give his party political cover to pass…background check legislation.” AWR Hawkins is an award-winning Second Amendment columnist for Breitbart News and the writer/curator of Down Range with AWR Hawkins, a weekly newsletter focused on all things Second Amendment, also for Breitbart News. He is the political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com. Sign up to get Down Range at breitbart.com/downrange. ",
      "date": "10 Sep 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Dem Rep. Deutch on Gun Legislation: Mitch McConnell ‘Not Part of Where America Is’",
      "url": "https://www.breitbart.com/clips/2019/09/11/dem-rep-deutch-on-gun-legislation-mitch-mcconnell-not-part-of-where-america-is/",
      "subtitle": "null",
      "author": "Trent Baker",
      "content": " Wednesday, Rep. Ted Deutch (D-FL) criticized Senate Majority Leader Mitch McConnell (R-KY) over his fight against additional gun legislation. Deutch said McConnell is not where the rest of the United States is on the issue of gun control, adding the only way to get something done is either force him to act or vote him out. “It’s a good day to think about what the heroes of 9/11 did for us and the sacrifices that they made to rush into the towers, the first responders. We’re going to be thinking about them and all of the lives lost that day and the way the country came together and stood as one. That’s something for us to think about as Mitch McConnell stands on the outside,” Deutch told host Alisyn Camerota. “He’s not part of where America is on this issue.” He continued, “And it’s great that the American people believe this is the right thing to do, but it’s the pressure that’s going to increase on McConnell that’s either going to force him to act or we’re going to see the same thing in the Senate that we saw in the House which is senators who refuse to stand up and stand up to the gun corporations and try to keep our communities safe, their refusal is going to mean that that come the next election, they’ll be looking at the Senate from the outside and will have a gun safety majority there, too.” Follow Trent Baker on Twitter @MagnifiTrent",
      "date": "11 Sep 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Dem Rep. Jeffries: McConnell Hiding from NRA in a Closet as Innocent Folks Being Massacred on American Streets",
      "url": "https://www.breitbart.com/clips/2019/09/11/dem-rep-jeffries-mcconnell-hiding-from-nra-in-a-closet-as-innocent-folks-being-massacred-on-american-streets/",
      "subtitle": "null",
      "author": "Pam Key",
      "content": " Wednesday on MSNBC’s “Live,” Rep. Hakeem Jeffries (D-NY) said Senate Majority Leader Mitch McConnell (R-KY) will not move legislation on gun control because he is “hiding in the closet afraid of the NRA.” Jeffries said, “Reasonable gun safety measures is something that the American people, we believe, widely support. And this is not a Democratic issue or a Republican issue. This is not a partisan issue. It’s an issue that relates to the well being of the American people. Innocent folks are being massacred, not in Afghanistan, not in Baghdad, but on American streets.” Tur asked, “The voters want it and their constituents, why do you think Mitch McConnell is not acting?” Jeffries said, “That’s a question more appropriately directed at Moscow Mitch. ” He continued, “Many Senate Republicans are behaving as if they are wholly owned subsidiaries of the gun lobby. That’s quite unfortunate. The NRA clearly has indicated nothing is acceptable to them as it relates to reasonable gun safety measures, even though the Supreme Court in the Heller decision and in an opinion authored by Justice Scalia, of all people, has made clear that pursuant to the Constitution, reasonable gun safety measures are lawful.” He added, “The House and Senate are part of a legislative process, and at the end of the day I think we recognize that we should try to find common ground with the other side of the Capitol, but we do need a partner and right now, because Mitch McConnell is obstructing, missing in action, or hiding in the closet afraid of the NRA, take your choice, there is no partner.” Follow Pam Key on Twitter @pamkeyNEN",
      "date": "11 Sep 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "‘Angry’ Nancy Pelosi to Reporter: Ask Mitch McConnell Why He Hasn’t Acted on Guns",
      "url": "https://www.breitbart.com/clips/2019/09/11/angry-nancy-pelosi-to-reporter-ask-mitch-mcconnell-why-he-hasnt-acted-on-guns/",
      "subtitle": "null",
      "author": "Pam Key",
      "content": " Wednesday on Capitol Hill, Speaker of the House Nancy Pelosi (D-CA) got testy with a reporter for asking whether she regretted not calling the House back from summer recess to work on the gun violence issue. Pelosi said, “No, absolutely not. We did our jobs. The Senate was supposed to come back. Why don’t you all get that straight? The Senate did not come back to pass the bill.” She continued, “I’m getting very angry about the silliness of these questions,” an animated Pelosi continued, adding “Lives are at stake. Senator McConnell is standing in the way. We passed our bill in February. Members had events all over the country to ask him to bring up the bill.” She added, “Don’t ask me what we haven’t done. We have done it. If you are annoyed with my impatience, it’s because people are dying because Senator McConnell hasn’t acted. Why don’t you go ask him if he has any regrets for all the people who died because he hasn’t acted?” Follow Pam Key on Twitter @pamkeyNEN",
      "date": "11 Sep 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Dem Rep. Clark Blasts McConnell on Gun Bill — ‘Go Home and Explain Why You’re Willing to Let Blood Run in Our Streets’",
      "url": "https://www.breitbart.com/clips/2019/09/15/dem-rep-clark-blasts-mcconnell-on-gun-bill-go-home-and-explain-why-youre-willing-to-let-blood-run-in-our-streets/",
      "subtitle": "null",
      "author": "Trent Baker",
      "content": " Sunday during MSNBC’s “Kasie DC,” Rep. Katherine Clark (D-MA) sounded off on Senate Majority Leader Mitch McConnell’s refusal to bring gun legislation to a vote in the Senate. Clark said McConnell is “stonewalling” the Democrats’ attempts at new legislation and called on him to put bills like gun legislation to solve gun violence to vote in the Senate. “What have we heard from the Senate?” Clark asked rhetorically. “Nothing but crickets. And it is unacceptable that as we face this public health crisis, we do not have a leader in Mitch McConnell who is willing to put these issues in front of the Senate. If you don’t want to vote for it, don’t vote for it, and you can go home and explain why you are willing to let blood continue to run in our streets.” She continued, “These bills deserve a vote in the Senate, and we’re going to keep the pressure on to do it.” Follow Trent Baker on Twitter @MagnifiTrent",
      "date": "15 Sep 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "MSNBC’s O’Donnell: Did McConnell Allow Release of Whistleblower Complaint So He Could ‘Plan for a Different Nominee if He Has to?’",
      "url": "https://www.breitbart.com/clips/2019/09/24/msnbcs-odonnell-did-mcconnell-allow-release-of-whistleblower-complaint-so-he-could-plan-for-a-different-nominee-if-he-has-to/",
      "subtitle": "null",
      "author": "Ian Hanchett",
      "content": " On Tuesday’s broadcast of MSNBC’s “The Last Word,” host Lawrence O’Donnell wondered if Senate Majority Leader Mitch McConnell (R-KY) agreed to a unanimous consent request to submit the whistleblower complaint to Congressional Intelligence Committees because doing so “gives him time to make a plan for a different nominee if he has to?” O’Donnell asked 2020 presidential candidate Senator Cory Booker (D-NJ), “Could it also be part of the presidential campaign in the following way: Mitch McConnell knows this is eventually coming out. It cannot be stopped. The sooner it comes out for Mitch McConnell, the better. Because a year from now, say, or in the middle of the Republican Convention, he doesn’t want his nominee hit with something like this then. This gives him time to make a plan for a different nominee if he has to?” Follow Ian Hanchett on Twitter @IanHanchett",
      "date": "24 Sep 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell: Senate Has ‘No Choice’ but to Hold Trial if House Impeaches Trump",
      "url": "https://www.breitbart.com/politics/2019/09/30/mitch-mcconnell-senate-has-no-choice-but-to-hold-trial-if-house-impeaches-trump/",
      "subtitle": "Appearing Monday on CNBC’s Squawk Alley, Senate Majority Leader Mitch McConnell (R-KY) said he is constitutionally bound to take up an impeachment trial in the Senate if the House passes articles to remove President Donald Trump. “How long you are on it is a different matter,” he stated.",
      "author": "Joshua Caplan",
      "content": "  A transcript is as follows: MORGAN BRENNAN: I want to [discuss] the rules of impeachment if this is actually something that comes up in the Senate. There’s been some speculation that you might seek to change those rules or have those practices changed. Just to confirm, you would not do that? SEN. MITCH MCCONNELL: No. The Senate impeachment rules are very clear and the Senate would have to take up an impeachment resolution if it came over from the House. BRENNAN: There have also been reports from the Washington Post that you were the person that urged the White House to release that call transcript between Trump and the Ukrainian president. Is that actually the case, and if so, do you feel like that was the right move? … SEN. MCCONNELL: I did say on numerous occasions. I had called the Secretary of State and the Secretary of Defense of what the hang-up was on the aid to Ukraine, which I very much supported, and I was curious about what the delay was. At least it all ended well. Fortunately, the aid was released and I think that was an important step for our Ukrainian friends.",
      "date": "30 Sep 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "McConnell: If House Passes Impeachment ‘I Would Have No Real Choice But to Take It Up’",
      "url": "https://www.breitbart.com/clips/2019/09/30/mcconnell-if-house-passes-impeachment-i-would-have-no-real-choice-but-to-take-it-up/",
      "subtitle": "null",
      "author": "Trent Baker",
      "content": " Monday, Senate Majority Leader Mitch McConnell (R-KY) said that if the House passed articles of impeachment then he “would have no real choice” but to have the Senate vote on impeachment. CNBC “Squawk Alley” host Morgan Brennan asked McConnell if the Senate would actually take a vote on impeachment if the House passed articles. “Yeah. It’s a Senate rule related to impeachment that would take 67 votes to change,” McConnell explained. “So I would have no choice but to take it up. How long you’re on it is a whole different matter. But I would have no choice but to take it up, based on a Senate rule on impeachment.” He later added, “The Senate impeachment rules are very clear. The Senate would have to take up a resolution if it came over from the House.” Follow Trent Baker on Twitter @MagnifiTrent",
      "date": "30 Sep 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "McConnell Vows to Kill Democrat Impeachment Effort in the Senate",
      "url": "https://www.breitbart.com/politics/2019/10/06/mcconnell-vows-kill-democrat-impeachment-effort-senate/",
      "subtitle": "Senate Majority Leader Mitch McConnell (R-KY) has launched an ad on social media with a message that he will end the impeachment effort against President Donald Trump should the House pass Articles of Impeachment and send them to the upper chamber.",
      "author": "Penny Starr",
      "content": " “Nancy Pelosi is in the clutches of a leftwing mob,” McConnell said in a fundraising video on his re-election campaign Facebook page. “They finally convinced her to impeach the president.” “All of you know your Constitution,” McConnell said. “The way that impeachment stops is with a Senate majority with me as majority leader.” This comes after McConnell said he would have to at least initiate an impeachment trail in the Senate, as the Constitution requires. “It’s a Senate rule related to impeachment, it would take 67 votes to change, so I would have no choice but to take it up,” McConnell said in a recent interview on CNBC. “How long you’re on it is a whole different matter.” But in the fundraising ad posted late last week on his campaign Facebook page McConnell made it clear his goal for the impeachment effort in the Senate is to stop it in its tracks. “McConnell is running for reelection next year and regularly plays up his ties to Trump, who easily carried Kentucky in 2016 and remains popular in the state,” AP said in its report on the ad. “McConnell campaign manager Kevin Golden said the impeachment inquiring has fired up the senator’s supporters.” “Few issues energize conservative voters like liberal overreach and the Democrats’ latest outrageous attempt to impeach President Trump has activated our base to new heights,” Golden said in a statement issued on Saturday. Follow Penny Starr on Twitter",
      "date": "6 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Anti-Kavanaugh Protesters March to Sen. Mitch McConnell’s House",
      "url": "https://www.breitbart.com/clips/2019/10/06/anti-kavanaugh-protesters-march-sen-mitch-mcconnells-house/",
      "subtitle": "Several anti-Kavanaugh protesters marched from the Supreme Court to pose in front of Sen. Mitch McConnell’s (R-KY) house and cover his front door with caution tape.",
      "author": "Katherine Rodriguez",
      "content": " The left-wing demonstrators— which included people from the Women’s March, Demand Justice, and Center for Popular Democracy— were marching in Washington, DC, on Sunday to ensure Congress knew that they were watching, and demanding that congressional leaders investigate Kavanaugh. The protesters rallied in front of the Supreme Court and eventually made their way down to what is thought to be McConnell’s D.C. residence. “The police are not going to arrest us here,” one of the demonstrators shouted with a bullhorn. “How do you feel about paying a visit to Mitch McConnell’s house?” The left-wing protesters responded with glee chanting “yes, yes, yes!” Many of the demonstrators repeatedly chanted, “No justice, no peace, we take to the streets,” and “unfit to sit,” referring to what they think is Kavanaugh’s inability to serve on the Supreme Court on the way to McConnell’s house. jwplayer 9qb2vhle-o73dHpYz In one minute-long video clip, one woman could be seen knocking on the front door of the house covered in yellow tape which said, “reclaim the court,” while wearing a shirt that said, “Impeach the MF.” Another protester took her phone out and posed with her middle finger up in front of the door, while a few others held anti-Justice Kavanaugh signs in front of the door. The group of left-wing protesters were out in full force to “celebrate” the anniversary of Justice Brett Kavanaugh’s confirmation by protesting “his inadequate and intentionally incomplete confirmation process.”",
      "date": "6 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell: NBA Shouldn’t Put ‘Profits over Free Speech’ for China",
      "url": "https://www.breitbart.com/politics/2019/10/08/mitch-mcconnell-nba-shouldnt-put-profits-over-free-speech-for-china/",
      "subtitle": "Senate Majority Leader Mitch McConnell (R-KY) on Tuesday joined the chorus of lawmakers condemning the National Basketball League for apologizing to communist China after one of the league’s general managers expressed support for the pro-democracy movement in Hong Kong.",
      "author": "Joshua Caplan",
      "content": " “The people of Hong Kong have risked much more than money to defend their freedom of expression, human rights, and autonomy. I hope the @NBA can learn from that courage and not abandon those values for the sake of their bottom line,” McConnell wrote on Twitter.  McConnell’s condemnation is especially significant not only because he is one of Washington’s most powerful lawmakers, but because his wife, Elaine Chao, who serves as Trump’s Transportation Secretary, is Chinese-American. As senior Breitbart News contributor Peter Schweizer writes in his #1 New York Times bestselling book Secret Empires, McConnell and Chao’s financial ties to China run deep. Notably, the couple has received between $5 million to $25 million from her Chao’s father, James Chao, whose shipping firm, Foremost Group, has done business with the Chinese government. Houston Rockets general manager Daryl Morey set off a firestorm over his deleted tweet in support of pro-democracy protesters in Hong Kong. A short time after Morey posted that statement, the NBA said it was “regrettable” that the deleted tweet offended many in China. And all that followed several companies in China, including some of the NBA’s major business partners there, lashing out over Morey’s original tweet. Morey tweeted an image that read “Fight for Freedom. Stand with Hong Kong.” referring to the four-month-old protests in the semi-autonomous Chinese territory. That led to Houston owner Tilman Fertitta turning to Twitter to say that Morey does not speak for the Rockets, and sparking an outcry that included the Chinese Basketball Association — whose president is Yao Ming, the former Rockets star center — saying it was suspending its relationship with the team. “I did not intend my tweet to cause any offense to Rockets fans and friends of mine in China,” Morey wrote on Twitter Monday.  “I was merely voicing one thought, based on one interpretation, of one complicated event. I have had a lot of opportunity since that tweet to hear and consider other perspectives.  “I have always appreciated the significant support our Chinese fans and sponsors have provided and I would hope that those who are upset will know that offending or misunderstanding them was not my intention. My tweets are my own and in no way represent the Rockets or the NBA,” he added. Sen. Josh Hawley (R-MO) on Monday sent a letter to NBA Commissioner Adam Silver blasting the league’s apology to the Chinese government and demanded it cancels its upcoming exhibition games in the country. “I write today to express my disgust about the position of the National Basketball Association (NBA) with respect to Hong Kong and the freedom of the Chinese people. Doing business in China is one thing, but for the NBA to kowtow to the demands of one of the world’s most brutal regimes in the pursuit of profit is, frankly, revolting. You know better. And the people of this country deserve better,” the senator wrote. The Associated Press contributed to this report.",
      "date": "8 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell Challenger Raises $10.7 Million in Third Quarter",
      "url": "https://www.breitbart.com/politics/2019/10/10/mitch-mcconnell-challenger-raises-10-7-million-in-third-quarter/",
      "subtitle": "Amy McGrath, the top Democrat challenging Senate Majority Leader Mitch McConnell in the 2020 Kentucky Senate race, raised nearly $11 million in the third quarter of 2019.",
      "author": "Kyle Morris",
      "content": " McGrath, who lost a House race in 2018 to an incumbent Republican, launched her campaign in July and raised $2.5 million within the first 24 hours of doing so. According to her campaign, McGrath received 299,000 contributions, with the average donation being $36. McGrath’s third-quarter fundraising total outpaces that of several presidential candidates, such as Sen. Amy Klobuchar (D-MN), who raised $4.8 million in the third quarter, and Sen. Cory Booker (D-NJ), who raised $6 million in the third quarter. In a statement, Mark Nickolas, McGrath’s campaign manager, claimed, “Change is coming.” “Mitch McConnell has never faced an opponent like Amy McGrath. Not only does a new independent poll show the race tied, but more than a quarter-million grassroots donations-from all 120 Kentucky counties-have provided us a record-shattering first quarter of nearly $11 million to take down McConnell and his self-serving special interest allies. Change is coming,” said Mark Nickolas, McGrath’s campaign manager. McConnell, who has represented Kentucky in the United States Senate since 1985, has received an endorsement from President Donald Trump. In 2016, Trump won the state of Kentucky by 30 percentage points. Shortly after announcing her bid to unseat McConnell, McGrath received praise from many of Hollywood’s far-left figures, including Bette Midler, Chelsea Handler, Patton Oswalt, and Stephen King. Follow Kyle on Twitter @RealKyleMorris and Facebook.",
      "date": "10 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell Goes Silent on Impeachment",
      "url": "https://www.breitbart.com/politics/2019/10/12/mitch-mcconnell-goes-silent-on-impeachment/",
      "subtitle": "Senate Majority Leader Mitch McConnell (R-KY) has gone silent on the Democrat-led House impeachment inquiry, largely avoiding public statements on the subject in recent days.",
      "author": "Hannah Bleau",
      "content": " The Republican leader told CNBC’s Squawk Alley last month that the Senate would have no choice but to take up an impeachment resolution if it proceeds in the House. “It’s a Senate rule related to impeachment, it would take 67 votes to change, so I would have no choice but to take it up,” McConnell said. “How long you’re on it is a whole different matter.” However, as the impeachment inquiry continues to heat up, McConnell has become increasingly withdrawn. According to The Hill, the Kentucky senator has largely refrained from making public statements on the subject in recent days: McConnell held an event last week in Kentucky with Defense Secretary Mark Esper, a day after Trump publicly floated that China and Ukraine should investigate Biden and his son, Hunter Biden. But reporters were removed from the event before the audience was allowed to ask questions. The GOP leader also skipped taking questions reporters this week when speaking at a Federalist Society meeting in Kentucky, as well as a separate event with Health and Human Services Secretary Alex Azar touting a grant for the University of Kentucky. Asked about McConnell’s thinking and why he’s decided not to weigh in directly on Trump’s calls for Ukraine and China to investigate former Vice President Joe Biden, a spokesman declined to comment beyond what McConnell has said on the record. It was reportedly McConnell who urged the White House to release the transcripts of Donald Trump’s phone call with Ukrainian President Volodymyr Zelensky. According to reports, McConnell said the release would “bolster the claim that the conversation was not improper because the speculation about what happened was becoming politically untenable,” the Washington Post reported. The transcript of the call does not show any such “pressure” or quid pro quo, as Democrats suggest. The president said McConnell described the conversation as “the most innocent phone call,” and the lawmaker told Politico in September that it is “laughable to think this is anywhere close to an impeachable offense.” “I’ve read the summary of the call. If this is the ‘launching point’ for House Democrats’ impeachment process, they’ve already overplayed their hand,” McConnell told the outlet. “It’s clear there is no quid pro quo that the Democrats were desperately praying for.” McConnell released an ad this month, slamming Democrats for their impeachment efforts and vowing to stop it as majority leader. “Nancy Pelosi is in the clutches of a leftwing mob,” McConnell said in the ad. “They finally convinced her to impeach the president.” “All of you know your Constitution,” he continued. “The way that impeachment stops is with a Senate majority with me as majority leader.” While it remains clear that McConnell disagrees with the impeachment inquiry, his refusal to elaborate on his position has piqued interest. However, GOP strategists do not view his silence as a reason for alarm. “Mitch McConnell has learned there is no point in weighing in on every story,” GOP strategist Ford O’Connell said, according to The Hill. Another GOP strategist, Matt Mackowiak, told The Hill that McConnell does not want to add difficultly for GOP incumbents in at-risk districts. “He doesn’t like to ever get ahead of the conference, and he always wants to be in a place that’s helpful to both ends,” Mackowiak said. “And look he’s obviously very much attuned to the risk that some of those incumbents face and he doesn’t want to make their job harder,” he continued. “On the other hand, he also knows the facts are developing.”",
      "date": "12 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell Warns GOP Senators to Gear Up for Impeachment Trial",
      "url": "https://www.breitbart.com/politics/2019/10/17/mitch-mcconnell-warns-gop-senators-to-gear-up-for-impeachment-trial/",
      "subtitle": "Senate Majority Leader Mitch McConnell (R-KY) on Wednesday urged GOP senators to prepare for an impeachment trial of President Trump, which could heat up as early as Thanksgiving.",
      "author": "Hannah Bleau",
      "content": " McConnell, who has largely refrained from making grandiose public statements on the House impeachment effort in recent days, briefed GOP senators during a luncheon on Wednesday on the impeachment process via a PowerPoint presentation and urged them to gear up for an impeachment trial in the Senate. He expects this process could heat up next month, around Thanksgiving. “There’s sort of a planned expectation that it would be sometime around Thanksgiving, so you’d have basically Thanksgiving to Christmas — which would be wonderful because there’s no deadline in the world like the next break to motivate senators,” Sen. Kevin Cramer (R-ND) said, according to the Washington Post. Judiciary Committee Chairman Lindsey Graham (R-SC) led the meeting alongside McConnell and, according to the Post, urged colleagues to consider penning a letter to House Speaker Nancy Pelosi (D-CA), declaring that Trump’s July 25 phone call with Ukraine President Volodymyr Zelensky — which is serving as a basis for the Democrat-led impeachment inquiry — contains nothing worthy of impeachment. Graham failed to get everyone on board, with some lawmakers expressing concern over Trump’s potential reaction to the members who would opt out of signing the letter. “Some senators, however, pushed back against that idea, arguing that Trump would assume that those who did not sign the document would be persuadable on a vote to oust him,” the Post explained. The meeting followed Tuesday’s Democrat debate, in which every single candidate on stage signaled support for pursuing an impeachment inquiry. Pelosi announced this week that the lower chamber will not yet hold a full House vote on the inquiry despite the White House vowing to refrain from participating in the “illegitimate” inquiry until proper steps are taken. White House counsel Pat Cipollone wrote: Your unprecedented actions have left the president with no choice. In order to fulfill his duties to the American people, the Constitution, the Executive Branch, and all future occupants of the Office of the Presidency, President Trump and his administration cannot participate in your partisan and unconstitutional inquiry under these circumstances. “There’s no requirement that we have a vote, and at this time, we will not have a vote,” Pelosi told reporters on Tuesday. “We’re not here to call bluffs. We’re here to find the truth, to uphold the Constitution of the United States,” she continued. “This is not a game for us; this is deadly serious.” It is not yet fully known what impact late House Oversight Committee Chairman Elijah Cummings’ (D-MD) untimely death will have on the Democrat Party’s continued impeachment effort. He was leading the inquiry charge alongside House Intelligence Committee Chairman Adam Schiff (D-CA) and House Foreign Affairs Committee Chairman Eliot Engel (D-NY). “We are deeply saddened by the passing of Elijah Cummings, a man of great consequence and significance on the Oversight Committee for the last twenty years,” Rep. Jim Jordan (R-OH), ranking member of the House Oversight Committee, said in a statement. “As Ranking Member and then as Chairman, he injected an unyielding passion and purpose into his work on the Committee,” he continued, offering prayers to Cummings’ wife, children, and loved ones. Rep. Carolyn Maloney (D-NY) will replace Cummings as the “acting” House Oversight chair.",
      "date": "17 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Maxine Waters: McConnell Can’t Save Trump from Impeachment — ‘It’s Not Going to Work’",
      "url": "https://www.breitbart.com/clips/2019/10/20/maxine-waters-mcconnell-cant-save-trump-from-impeachment-its-not-going-to-work/",
      "subtitle": "null",
      "author": "Pam Key",
      "content": " Sunday on MSNBC, Rep. Maxine Waters (D-CA) said Senate Majority Leader Mitch McConnell’s (R-KY) would not be able to “sweep” the evidence House Democrats are collecting “under the rug,” against President Donald Trump in their impeachment inquiry. Waters said, “I think we are doing what we need to do, the investigations that goes on, documents are being requested, the six committees that have responsibilities for oversight and investigations are working. I think that we’ll have information that will end up going to the Judiciary Committee in a good period of time. We are moving as well as we possibly can. I don’t care what Mitch McConnell is trying to do.” ”It is going to catch up with him,” she continued. “This is business that someone is speculating about the fact that he’s going to try and basically whitewash it and that really do a real investigation it is not going to work. It is not going to work. The American people want to have the Senate do what the Constitution says they must do a hold a trial. They are acting as the jury, should be acting as the jury. We’ll have information to put before them and they better not try to sweep it under the rug.” Follow Pam Key on Twitter @pamkeyNEN",
      "date": "20 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "McConnell: I Wouldn’t Compare Impeachment Process to a Lynching",
      "url": "https://www.breitbart.com/clips/2019/10/22/mcconnell-i-wouldnt-compare-impeachment-process-to-a-lynching/",
      "subtitle": "null",
      "author": "Ian Hanchett",
      "content": " During a press conference on Tuesday, Senate Majority Leader Mitch McConnell (R-KY) reacted to President Trump’s tweet comparing the impeachment proceedings to a lynching by stating that he wouldn’t compare the process to a lynching. McConnell said, “Given the history in our country, I would not compare this to a lynching. That was an unfortunate choice of words. It is an unfair process, and a better way to characterize it would be to call it an unfair process, and inconsistent with the kinds of procedural safeguards that are routinely provided for people in this kind of situation, either in court or in an impeachment process in our country.” (h/t Grabien) Follow Ian Hanchett on Twitter @IanHanchett",
      "date": "22 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell: Trump ‘Lynching’ Remark Was ‘Unfortunate,’ But Impeachment Probe Is ‘Unfair’",
      "url": "https://www.breitbart.com/politics/2019/10/22/mitch-mcconnell-trump-lynching-remark-was-unfortunate-but-impeachment-probe-is-unfair/",
      "subtitle": "Senate Majority Leader Mitch McConnell (R-KY) on Tuesday said President Donald Trump comparing the House Democrats’ impeachment inquiry to “a lynching” was “unfortunate.”",
      "author": "Joshua Caplan",
      "content": " “Given the history in our country, I would not compare this to a lynching. That was an unfortunate choice of words,” McConnell told reporters during a press conference, but added that he shared the president’s view that the House Democrats’ impeachment probe is deeply flawed. “It is an unfair process,” he added. “A better way to characterize it would be to call it an unfair process and inconsistent with the kinds of procedural safeguards that are routinely provided for people in this situation, either in court or in an impeachment process in our country.”  Earlier Tuesday, President Trump labeled the impeachment inquiry as a “lynching,” stating that the probe has no legal basis. “So some day, if a Democrat becomes President and the Republicans win the House, even by a tiny margin, they can impeach the President, without due process or fairness or any legal rights,” the president tweeted. “All Republicans must remember what they are witnessing here – a lynching. But we will WIN!”  Democrats raced to condemn the president’s remark, branding it “despicable and disgusting,” while accusing him of being a “white supremacist.” “Impeachment is not ‘lynching,’ it is part of our Constitution. Our country has a dark, shameful history with lynching, and to even think about making this comparison is abhorrent,” tweeted former Vice President and 2020 Democrat presidential frontrunner Joe Biden. “It’s despicable.”   Flailing presidential candidate and former Rep. Robert Francis “Beto” O’Rourke tweeted, “The legacy of slavery, segregation, Jim Crow, and suppression is alive and well in every part of this country—including in the White House where the president is a white supremacist.”  “Lynching is an act of terror used to uphold white supremacy. Try again,” added another White House contender Sen. Cory Booker (D-NJ). ",
      "date": "22 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "McConnell to Republicans: Need to Set Up Correct Process to Defend Trump from Impeachment Effort",
      "url": "https://www.breitbart.com/politics/2019/10/23/mcconnell-to-republicans-need-to-set-up-correct-process-to-defend-trump-from-impeachment-effort/",
      "subtitle": "Senate Majority Leader Mitch McConnell (R-KY) told Republicans at a private lunch on Tuesday that in order to properly defend President Donald Trump from the Democrats’ secretive impeachment effort they must concentrate on the “process” that is under way.",
      "author": "Penny Starr",
      "content": " “This is going to be about process,” McConnell said at the lunch, according to an unidentified Republican, who spoke to the Hill. “What is clear and not in dispute, as Sen. [Roy] Blunt (R-MO) has pointed out, is the process in the House to which the president is being subjected is totally unprecedented and totally unfair,” McConnell told reporters after the lunch meeting. McConnell and other lawmakers spoke of the difference between the impeachment process going on under Speaker Nancy Pelosi (D-CA) and Speaker Carl Albert (D-OK), who served during the impeachment of President Richard Nixon. The Hill reported on the contrast: Albert in 1973 and 1974 gave Republicans much more of an opportunity to participate in the process, they said.\n\nMcConnell also said Democrats in the minority were treated better by former Speaker Newt Gingrich (R-Ga.) during the impeachment of President Clinton than today’s Republicans. “Speaker Albert laid out procedural guidelines during the Nixon episode — Speaker Gingrich during the Clinton impeachment episode — all of which included the kind of basic procedural safeguards that one associates in our country with being treated fairly,” McConnell said. [McConnell is] telling his members they have plenty of reason to offer a vigorous defense of Trump, as the president publicly urged them to do Monday, by focusing on Democratic tactics that McConnell and Trump view as unfair. The Hill reported on the secrecy of the Democrats investigation and how difficult that makes it to formulate a way to respond to it on the president’s behalf: Senate Republicans also privately make the point that it’s difficult to defend Trump on the substance of the charges against him because so much remains unknown.\n\nGOP lawmakers don’t know the identity of the whistleblower who filed a complaint against Trump or what exactly House Democrats have discovered in their investigation, which has been conducted largely behind closed doors. “A Republican senator who spoke on condition of anonymity said McConnell gave his colleagues leeway to express opposition to various Trump actions, such as pulling U.S. troops out of northern Syria, but urged them to stick together on process,” the Hill reported. “He feels everybody is free to talk about issues like Ukraine or maybe the Kurds, but to try to conduct an impeachment without any process is very contrary to what happened before,” the lawmaker said. “That pretty much sums it up.” “A second Republican senator said McConnell and Blunt thought it made sense to give the Senate GOP conference a primer on past impeachment proceedings,” the Hill reported. “It was a logical second place to go after the informational hearing on how impeachment will work in the Senate so members will know when they are talking about this process why it’s different than the way this has been done before,” the lawmaker said. “It’s one thing to say it’s unfair. It’s another thing to say here are all the boxes that were checked for Clinton and Nixon, and none of these boxes have been checked for this president.” Follow Penny Starr on Twitter",
      "date": "23 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "VIDEO: Elijah Cummings’ Pallbearer Refuses to Shake Mitch McConnell’s Hand at Memorial Service",
      "url": "https://www.breitbart.com/local/2019/10/25/elijah-cummings-pallbearer-refuses-shake-mitch-mcconnells-hand-memorial-service/",
      "subtitle": "A pallbearer ignored Senate Majority Leader Mitch McConnell (R-KY) during the memorial service for Rep. Elijah Cummings (D-MD) on Capitol Hill Thursday.",
      "author": "Amy Furr",
      "content": " Video footage shows the moment when pallbearer Bobby Rankin shakes the hands of both Democrat and Republican lawmakers but snubs McConnell after he greets Senate Minority Leader Chuck Schumer (D-NY). He then moves to shake hands with House Speaker Nancy Pelosi (D-CA).  Rankin has so far made no comment about the incident, according to a report by the Hill. However, McConnell said during the ceremony that Cummings, who had served his district since 1996, “did not just represent Baltimore, he embodied it.” He continued: He knew there was only one reason why a son of sharecroppers, a child who had literally had to bear the injuries of bigotry and segregation, could graduate from law school and eventually chair a powerful committee in Congress. Only one reason, because principled leaders had fought to give kids like him a chance. Chairman Cummings made it his life’s work to continue that effort. He climbed the ranks here in the Capitol, not because he outgrew his hometown but because he was so committed to it. On Thursday, Breitbart News reported that Cummings was the first black American lawmaker to lie in state inside National Statuary Hall on Capitol Hill. “Civil rights icon Rosa Parks, who died in 2005, and Capitol Police Officer Jacob Chestnut, who was killed by a gunman in 1998, were also given the honor bestowed upon only a small number of private citizens in years past,” the report noted. Pelosi said during Cummings’ funeral in Baltimore on Friday that “Elijah brought people together in life of different parties and in his death of different parties,” and added that “it took bipartisan agreement for Elijah to lie in repose on the same catafalque that Abraham Lincoln lied in repose at the Capitol.” Also speaking at the funeral, former 2016 presidential candidate Hillary Clinton said Cummings “had little tolerance for those who put party ahead of country or partisanship ahead of truth. But he could find common ground with anyone willing to seek it with him.” “And he liked to remind all of us that you can’t get so caught up in who you are fighting that you forget what you are fighting for,” she concluded.",
      "date": "25 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "McConnell Praises Trump, Troops, and Intel for Making the World Safer",
      "url": "https://www.breitbart.com/politics/2019/10/27/mcconnell-praises-trump-troops-intel-making-world-safer/",
      "subtitle": "Senate Majority Leader Mitch McConnell (R-KY) praised President Donald Trump, U.S. troops, and intelligence for the raid on Saturday in Syria that led to the death of ISIS terrorist Abu Bakr al-Baghdadi.",
      "author": "Penny Starr",
      "content": " “The world is a safer place today because al-Baghdadi has been brought to justice,” McConnell tweeted. “I applaud our intelligence professionals, the brave service members who risked everything to carry out this mission, and President Trump and his team”:  McConnell also issued a statement about the operation: I applaud President Trump’s announcement that U.S. special forces have eliminated ISIS leader Abu Bakr al-Baghdadi. The world’s most wanted man has been brought to justice. The world is a safer place today. This victory for the U.S. and our many counterterrorism partners is a significant step for the campaign against ISIS, for the future of the Middle East, and for the safety of the American people and free people around the world. A victory like this is only possible because of the expertise, skill, and courage of those who work to keep the United States safe. I am grateful for the intelligence professionals who laid the groundwork for this raid, for the brave American service members who risked everything to carry it out, and to President Trump and his team for their leadership. While we welcome the fact that al-Baghdadi has been brought to justice, we know we cannot underestimate the resilience of terrorist groups like ISIS and al Qaeda. The important counterterrorism work of the United States, our international coalition partners, and local forces will not end with this significant victory. To the contrary, history shows us how vital it is to keep building on this victory and continue our work to set the conditions for the enduring defeat of ISIS, al Qaeda, and other terrorists in Syria, in Afghanistan, and around the world. Democrats have also been tweeting and speaking out on the raid with many of them failing to even mention Trump’s role in the operation. Follow Penny Starr on Twitter",
      "date": "27 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell: Impeachment Resolution ‘Falls Way Short,’ Makes Schiff ‘De Facto Special Prosecutor’",
      "url": "https://www.breitbart.com/politics/2019/10/30/mitch-mcconnell-impeachment-resolution-falls-way-short-makes-schiff-defacto-special-prosecutor/",
      "subtitle": "Senate Majority Leader Mitch McConnell (R-KY) on Wednesday slammed the House Democrats’ impeachment proceedings resolution, stating it “falls way short” and effectively elevates House Intelligence Chairman  Adam Schiff (D-CA) to a “de facto special prosecutor.”",
      "author": "Joshua Caplan",
      "content": "  House Democrats on Tuesday released the text of a resolution they plan to vote on later this week to formalize impeachment inquiry procedures for President Trump. The resolution establishes procedures for open hearings, authorizes the release of deposition transcripts, and outlines how the intelligence community can transfer evidence to the House judiciary committee It directs “certain committees to continue their ongoing investigations as part of the existing House of Representatives inquiry into whether sufficient grounds exist for the House of Representatives to exercise its constitutional power to impeach Donald John Trump, president of the United States of America, and for other purposes,” the document reads. The document gives Schiff the lead role in the investigation, giving him power to organize the questioning of witnesses. The committee will take over the probe, which until now has been handled by three committees, including intelligence, foreign affairs, and oversight and reform. The resolution also gives House Republicans the power to request their own documents and testimony. The document will go to the House Rules Committee for markup before the Thursday vote. As Breitbart News’ senior editor Joel Pollak writes, the measure’s proposed rules raise red flags about the probe’s fairness: 1. The resolution gives authority to the House Intelligence Committee that it has never had before. 2. The resolution does not provide the minority with equal subpoena power, as in the past. 3. The resolution waters down minority powers over the release of Intelligence transcripts. 4. The resolution does not compel the release of past testimony. 5. The resolution restricts the president’s right to be represented. Following the text’s release, White House press secretary Stephanie Grisham issued a statement unloading on House Democrats, branding their impeachment probe a “sham.” “The White House is barred from participating at all, until after Chairman Schiff conducts two rounds of one-sided hearings to generate a biased report for the judiciary committee. Even then, the White House’s rights remain undefined, unclear and uncertain — because those rules still haven’t been written,” Grisham said. The UPI contributed to this report.",
      "date": "30 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell: Democrat Impeachment Resolution Will ‘Codify Their Unfair Process’",
      "url": "https://www.breitbart.com/politics/2019/10/30/mitch-mcconnell-democrat-impeachment-resolution-will-codify-their-unfair-process/",
      "subtitle": "Senate Majority Leader Mitch McConnell (R-KY) on Wednesday dismissed the Democrats’ impeachment resolution, stating that it will do nothing more than “codify their unfair process.”",
      "author": "Hannah Bleau",
      "content": " McConnell blasted the Democrats’ impeachment proceedings resolution, stating that it will “codify their unfair process.” The Republican leader summarized the resolution thusly: 1. No due process now\n\n2. Maybe some later\n\n3. But only if they feel like it “No American, the president or anyone else, should be subjected to this kind of unfairness,” he added:  The resolution itself does little to address the concerns of Republicans, some of whom stormed House Intelligence Committee Chairman Adam Schiff’s (D-CA) secret impeachment lair in the Capitol Hill basement last week in an attempt to call for greater transparency. While House Rules Committee Chairman James McGovern (D-MA) claims the resolution provides “a clear path forward,” the resolution does not address the fact that the inquiry itself never faced a full House vote. As Breitbart News’s Joel Pollak extensively detailed, there are five key issues with the resolution: 1. The resolution gives authority to the House Intelligence Committee that it has never had before.\n\n2. The resolution does not provide the minority with equal subpoena power, as in the past.\n\n3. The resolution waters down minority powers over the release of Intelligence transcripts.\n\n4. The resolution does not compel the release of past testimony.\n\n5. The resolution restricts the president’s right to be represented. The White House responded to the House Democrats’ resolution on Tuesday, calling it an “illegitimate sham.” “The resolution put forward by Speaker Pelosi confirms that House Democrats’ impeachment has been an illegitimate sham from the start as it lacked any proper authorization by a House vote,” White House Press Secretary Stephanie Grisham said in a statement.",
      "date": "30 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell Blasts Democrats for Shirking Legislative Duties: ‘Put Aside Socialist Daydreams’",
      "url": "https://www.breitbart.com/politics/2019/11/05/mitch-mcconnell-blasts-democrats-for-shirking-legislative-duties-put-aside-socialist-daydreams/",
      "subtitle": "Senate Majority Leader Mitch McConnell (R-KY) on Tuesday blasted Democrats for shirking their legislative duties in pursuit of impeachment and “far-left schemes,” calling for them to finally “put aside socialist daydreams” and fulfill their “basic government responsibilities.”",
      "author": "Hannah Bleau",
      "content": " McConnell unleashed a tweetstorm on Tuesday, sparked by his Democrat colleagues’ decision to block funding for “our nation’s armed forces” and USMCA “while they pursue their three-year-old impeachment obsession.” “Senate Democrats have voted twice to block funding for our nation’s armed forces. Our competitors are growing stronger. America and our allies are threatened,” McConnell stated, adding that Democrats would “rather fight with the White House than deliver bipartisan funding for our military.” “Meanwhile, House Democrats are blocking the USMCA while they pursue their three-year-old impeachment obsession. 176,000 new American jobs are being held up because this major new trade deal might interfere with House Democrats’ political theater,” he continued, slamming 2020 Democrat candidates for continually “rallying around far-left schemes” on the campaign trail. “We need our Democratic colleagues to put aside socialist daydreams and fulfill their basic governing responsibilities,” McConnell said, calling on Democrats to step it up and refocus. “Republicans are ready and waiting to fund our servicemembers. We are ready and waiting to pass the USMCA. We just need Democrats to show up,” he added.   Meanwhile, Senate Minority Leader Chuck Schumer (D-NY) has been focusing on publicly condemning the Trump administration for pulling out of the Paris climate agreement – an agreement that remains entirely symbolic in nature. “In the long list of pitiful and dangerous policy decisions @realDonaldTrump has made as president, today’s announcement ranks as one of the worst,” Schumer tweeted:  “Future generations will look back on President Trump’s decision as a dramatic step backward in the fight to address the climate crisis that will hurt our planet, our economy, and our national security for decades to come,” he added in another tweet: ",
      "date": "5 Nov 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell: Impeachment Trial ‘Would Not Lead to a Removal’ if Held Today",
      "url": "https://www.breitbart.com/politics/2019/11/06/mitch-mcconnell-impeachment-trial-would-not-lead-removal-held-today/",
      "subtitle": "Senate Majority Leader Mitch McConnell (R-KY) told reporters on Tuesday that the Senate would acquit President Trump if the impeachment trial were held today.",
      "author": "Hannah Bleau",
      "content": " House Democrats voted to pass the partisan impeachment inquiry resolution last week. No Republican voted in favor of the measure, and two Democrats – Reps. Van Drew (D-NJ) and Collin Peterson (D-MN) – voted alongside the GOP. The resolution outlined the rules and procedures moving forward but did not, despite popular belief, authorize the inquiry itself. Republicans have said that Democrats deliberately skipped a crucial step in the impeachment process, adding that the resolution does not adequately satisfy their demands for transparency, giving Democrats, such as House Intelligence Committee chairman Adam Schiff (D-NY) and House Judiciary Committee chairman Jerry Nadler (D-NY), unprecedented power. However, transcripts from Schiff’s secret impeachment proceedings have been trickling out, and they have yet to demonstrate any such quid pro quo, as Democrats suspected. McConnell spoke to reporters on Tuesday and signaled that if the impeachment trial were held today, “it would not lead to a removal.” “I will say I’m pretty sure how it’s likely to end,” McConnell told reporters. “If it were today, I don’t think there’s any question — it would not lead to a removal.” “So the question is how long does the Senate want to take? How long do the presidential candidates want to be here on the floor of the Senate instead of in Iowa and New Hampshire?” he asked. The Republican leader made it clear that he is not going to comment regularly on the ongoing developments in the House – a tactic he has exercised since House Speaker Nancy Pelosi’s (D-CA) formal announcement of the inquiry. “I’m not going to comment sort of on a routine daily basis on all that’s breaking surrounding this story over in the House,” McConnell stated. “At some point, it looks to me like they’re going to send it over to the Senate,” he continued. “As you all know that means we have to take it up.” McConnell on Tuesday blasted Democrats in a tweetstorm for neglecting their legislative duties to “pursue their three-year-old impeachment obsession”:  ",
      "date": "6 Nov 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Hollywood Celebrates Democrat Victories: ‘Mitch McConnell Must Be Sh**ting His Shell’",
      "url": "https://www.breitbart.com/entertainment/2019/11/06/hollywood-celebrates-democrat-victories-mitch-mcconnell-must-be-shting-his-shell/",
      "subtitle": "Left-wing Hollywood celebrities gloated after Democrats won key electoral battles in Kentucky and Virginia on Tuesday, with some stars jabbing at Senate Majority Leader Mitch McConnell (R-KY), saying he will be the next politician to fall.",
      "author": "David Ng",
      "content": " Kentucky voters handed an apparent victory to Democratic gubernatorial candidate Andy Beshear, though Republican incumbent Gov. Matt Bevin has so far refused to concede the close race. In Virginia, voters flipped both houses of the state legislature blue. Actress Bette Midler celebrated the gubernatorial result in Kentucky, tweeting that “Mitch McConnell must be shitting his shell!”  Actor Jason Alexander showered praise on those who’d won their races in Kentucky and Virginia, saying he hope they govern with honesty and decency — “qualities to lead us out of this mess.”  Comedian Sarah Silverman also took a pot shot at Sen. McConnell, tweeting “GO KENTUCKY!! Next step: goodbye MOSCOW MITCH!”  Actor John Leguizamo joined in the social media pile-on.  Comedian and Virginia native Patton Oswalt expressed his pride that the state’s General Assembly will be controlled by Democrats for the first time in more than two decades. “So proud of my home state today. So so proud,” the Ratatouille star tweeted.  Actress Alyssa Milano tweeted that President Donald Trump is responsible for the Republican’s electoral losses on Tuesday. “He’s going to take the whole Republican Party down with him,” the Who’s the Boss star wrote. “Last night was proof that The People will do what’s right to correct the system.”  Comedian Chelsea Handler rejoiced, saying “Usually I have to take an edible to watch the news but not last night.”  Actress Piper Perabo said the victories in Kentucky and Virginia bode well for abortion. “Reproductive freedom is safer today in Virginia and Kentucky!” she tweeted.  Follow David Ng on Twitter @HeyItsDavidNg. Have a tip? Contact me at dng@breitbart.com",
      "date": "6 Nov 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "McConnell: Twitter Political Ad Ban Clears the Field for Elites",
      "url": "https://www.breitbart.com/clips/2019/11/06/mcconnell-twitter-political-ad-ban-clears-the-field-for-elites/",
      "subtitle": "null",
      "author": "Ian Hanchett",
      "content": " During a speech on the Senate floor on Wednesday, Senate Majority Leader Mitch McConnell (R-KY) reacted to Twitter’s ban on political ads by stating that “Twitter will either have to ban opinion journalists and the press from advertising their own work, or else create an enormous double standard that would just amplify the already privileged speakers” and that the reasoning behind the ban “gives way to an arbitrary process of picking winners and losers in the competition of ideas.” McConnell said Twitter’s rationale “quickly gives way to an arbitrary process of picking winners and losers in the competition of ideas. … Twitter’s new rules would seem to forbid either a small, liberal nonprofit or a small, conservative nonprofit from putting money behind an issue ad to amplify their perspective. But what about the press? Will media corporations large and small remain free to buy paid advertising to promote editorials and opinion writers? Will cable news networks and national newspapers remain free to advertise their political speech? It would seem, Mr. President, that Twitter will either have to ban opinion journalists and the press from advertising their own work, or else create an enormous double standard that would just amplify the already privileged speakers who already possess multimillion-dollar platforms. It would just help clear the field for those elites by denying the same tools to fledgling speakers who are not already famous.” (h/t the Hill) Follow Ian Hanchett on Twitter @IanHanchett",
      "date": "6 Nov 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell Pulls Funding Bill Containing Shaheen Pro-Abortion Amendment",
      "url": "https://www.breitbart.com/politics/2019/11/09/mitch-mcconnell-pulls-funding-bill-containing-shaheen-pro-abortion-amendment/",
      "subtitle": "Sen. Majority Leader Mitch McConnell (R-KY) withdrew an overseas spending bill last week that would have provided $665 million for “family planning and reproductive health care” overseas and funds for the pro-abortion U.N. Population Fund.",
      "author": "Dr. Susan Berry",
      "content": " C-Fam and the Eagle Forum reported McConnell withdrew the State and Foreign Operations (SFOPs) bill after New Hampshire Democrat Sen. Jeanne Shaheen inserted an amendment into the bill to provide support to groups that promote abortions overseas – a move that would have clearly undermined the Trump administration’s pro-life policies. A coalition of 44 national pro-life leaders sent a letter in October to McConnell and House Republican Leader Kevin McCarthy (R-CA) voicing their vehement opposition to the Shaheen amendment. Sen. Steve Daines (R-MT), chairman of the Senate pro-life caucus, joined with these leaders in asking McConnell to amend the bill before it advanced. “It’s our duty to protect the most vulnerable in our society,” Daines said, according to C-Fam. “I am deeply concerned about how this amendment undermines pro-life policies abroad and I will continue to work to defeat it.” SFOPs was part of the Bipartisan Budget Agreement reached by Congress and the White House in July. The agreement clearly stipulated, “[T]here will be no poison pills, additional new riders…unless agreed to on a bipartisan basis by the four leaders with the approval of the President.” C-Fam reported Shaheen’s longstanding attempts to force American taxpayers to fund promoting abortion overseas: Shaheen, a longtime member of the subcommittee tasked with funding overseas diplomacy, development and humanitarian assistance, annually proposes an amendment that undermines U.S. funding restrictions on abortion and abortion-related activities and increases funding to family planning groups abroad that are known to promote abortion. The Shaheen amendment routinely passes due to support from two Republican senators who promote abortion—Susan Collins (R-ME) and Lisa Murkowski (R-AK). In addition, Shaheen introduced this year in her amendment a non-discrimination policy, reported C-Fam, that bars “discrimination on the basis of pregnancy, sexual orientation and gender identity.” Thus, the amendment would have not only promoted abortion overseas, but the radical LGBT agenda. Eunie Smith, president of the Eagle Forum, said in a statement sent to Breitbart News the Shaheen amendment would have undercut the pro-life initiatives of the Trump administration: Through the adoption of the Mexico City Policy, or the Protecting Life in Global Health Assistance (PLGHA) policy, the United States has successfully prevented foreign organizations from using tax-payer money for abortion services. However, PLGHA does not prevent funds from being used by domestic organizations working overseas. “The Senate majority proved that they are not willing to compromise on life by rejecting the Shaheen amendment which allocated these overseas-based American organizations $665 million dollars to continue their atrocious life-ending work,” she added.",
      "date": "9 Nov 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "McConnell: If House Impeaches, ‘We’ll Have to Have a Trial’",
      "url": "https://www.breitbart.com/clips/2019/11/13/mcconnell-if-house-impeaches-well-have-to-have-a-trial/",
      "subtitle": "null",
      "author": "Ian Hanchett",
      "content": " During a press conference on Wednesday, Senate Majority Leader Mitch McConnell (R-KY) stated that if the House impeaches President Trump, the Senate must have a trial. McConnell said, “I don’t think there’s any question that we have to take up the matter. The rules of impeachment are very clear. We’ll have to have a trial. My own view is that we should give people an opportunity to put the case on. The House will have presenters. The president will no doubt be represented by lawyers as well.” McConnell added that the trial’s length of time is “really kind of up to the Senate. People will have to conclude, are they learning something new. At some point, we’ll get to an end.” (h/t The Hill) Follow Ian Hanchett on Twitter @IanHanchett",
      "date": "13 Nov 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "McConnell: ‘I’m Pretty Confident’ That Impeachment Will Not Lead to Ouster of Trump",
      "url": "https://www.breitbart.com/clips/2019/11/18/mcconnell-im-pretty-confident-that-impeachment-will-not-lead-to-ouster-of-trump/",
      "subtitle": "null",
      "author": "Pam Key",
      "content": " Senate Majority Leader Mitch McConnell (R-KY) told reporters on Monday that he was “confident” impeachment of President Donald Trump would not lead to his removal from office. McConnell said, “It looks to me like the House is determined to impeach the president. I can’t imagine a scenario under which President Trump would be removed from office with 67 votes in the Senate. So I don’t know how long senators will want to continue the trial, but I’m pretty confident at the end impeachment will not lead to ouster.” Follow Pam Key on Twitter @pamkeyNEN",
      "date": "18 Nov 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "McConnell: ‘Inconceivable’ Senate Votes to Remove Trump",
      "url": "https://www.breitbart.com/clips/2019/11/19/mcconnell-inconceivable-senate-votes-to-remove-trump/",
      "subtitle": "null",
      "author": "Ian Hanchett",
      "content": " During a press conference on Tuesday, Senate Majority Leader Mitch McConnell (R-KY) stated that it is “inconceivable” that 67 members of the Senate will vote to remove President Trump. McConnell said, “I will repeat what I’ve said in the past, it’s inconceivable to me that there would be 67 votes to remove the president from office. A number of Democratic senators are running for president. I’m sure they’re going to be excited to be here in their chairs, not being able to say anything during the pendency of this trial. So, hopefully, we’ll work our way through it and finish it in not too lengthy a process.” Follow Ian Hanchett on Twitter @IanHanchett",
      "date": "19 Nov 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "McConnell Slams Democrats: ‘There’s No Governing Priority … that Won’t Take a Backseat to Impeachment’",
      "url": "https://www.breitbart.com/politics/2019/11/20/mcconnell-slams-democrats-no-governing-priority-wont-take-backseat-impeachment/",
      "subtitle": "Senate Majority Leader Mitch McConnell (R-KY) responded to the fifth public impeachment hearing Wednesday by tweeting that Democrats are shirking their legislative duties in pursuit of impeachment, observing that “there’s no governing priority – no matter how bipartisan, no matter how beneficial to Americans – that won’t take a backseat to impeachment.”",
      "author": "Hannah Bleau",
      "content": " McConnell, who has refrained from offering in-depth analysis of the ongoing public impeachment hearings, tweeted during Ambassador Gordon Sondland’s testimony and noted that Democrats’ claim that “impeachment won’t keep them from legislating,” appears to be patently false, as House Speaker Nancy Pelosi (D-CA) has “refused to allow a vote on USMCA for months.” “It appears there’s no governing priority – no matter how bipartisan, no matter how beneficial to Americans – that won’t take a back seat to impeachment,” McConnell wrote:  McConnell expressed the same view two weeks ago, slamming Democrats for forgoing their legislative duties in pursuit of impeachment and other “far-left schemes.” He wrote: Senate Democrats have voted twice to block funding for our nation’s armed forces. Our competitors are growing stronger. America and our allies are threatened. But Senate Democrats would rather fight with the White House than deliver bipartisan funding for our military. Meanwhile, House Democrats are blocking the USMCA while they pursue their three-year-old impeachment obsession. 176,000 new American jobs are being held up because this major new trade deal might interfere with House Democrats’ political theater. On the campaign trail, leading Democrats are rallying around far-left schemes to take away Medicare, take away the existing health insurance that Americans get on the job, and leave American families with no options except an untested one-size-fits-all government insurance plan. We need our Democratic colleagues to put aside socialist daydreams and fulfill their basic governing responsibilities. Republicans are ready and waiting to fund our servicemembers. We are ready and waiting to pass the USMCA. We just need Democrats to show up.   On Tuesday, McConnell expressed doubt that an impeachment trial in the Senate would ultimately lead to President Trump’s removal: “I will repeat what I’ve said in the past. It’s inconceivable to me that there would be 67 votes to remove the president from office,” McConnell stated. “A number of Democratic senators are running for president. I’m sure they’re going to be excited to be here in their chairs, not being able to say anything during the pendency of this trial,” he continued. “So, hopefully, we’ll work our way through it and finish it in not too lengthy a process,” he added.",
      "date": "20 Nov 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    }
  ]
}