{
  "articles": [
    {
      "title": "Hollywood Blacklisted R. Lee Ermey for Thought Crimes Against Barack Obama",
      "url": "https://www.breitbart.com/entertainment/2018/04/16/rip-hollywood-blacklisted-r-lee-ermey-criticizing-barack-obama/",
      "subtitle": "Actor R. Lee Ermey, who died at 74 of pneumonia Sunday morning, was Exhibit A in the New Hollywood Blacklist. After criticizing Barack Obama in 2010, Ermey’s thriving film career immediately dried up. Even after apologizing, he was ostracized, fired by GEICO insurance and never did another commercial. After disappearing completely for a few years, he managed to appear in a couple of C-grade reality shows in the last few years of his life.",
      "author": "John Nolte",
      "content": " Iconic and talented, Ermey was a walking-talking example of left-wing Hollywood’s intolerance toward those they condemn as thought criminals. Ermey, who was known to his friends as “Gunny,” enlisted in the Marines in 1961 when he was only 17, and spent 14 months in Vietnam before earning a honorable discharge after 11 years of service. His screen career began in 1978 with a small role as a drill instructor in The Boys In Company C. He also appeared as a helicopter pilot in Francis Ford Coppola’s Apocalypse Now (1979). Some lean years followed, but Ermey’s career exploded in 1987 with Stanley Kubrick’s Full Metal Jacket where Ermey was unforgettable (to say the least) as Gunnery Sergeant Hartman, a drill instructor who pushes a recruit (Vincent D’ Onfrio) too far.  Ermey was only supposed to be a technical advisor for Kubrick, but he asked for an audition and not only nailed the role, the famously finicky and precise director went so far as to allow Ermey to improvise. Inside Kubrick’s intentionally sterile and hypnotic world that is the first half of Full Metal Jacket, Ermey’s masterpiece of a performance is not only a harbinger of the hell to come in the second half, but the first half’s humanity — in ways both good and bad, funny and menacing, father figure and monster. Ermey says he voted for Barack Obama in 2008, but in 2010 he was blacklisted in Hollywood (no one disputes this) for souring on and then publicly criticizing the president. Over his personal political opinion, he was also fired as a commercial spokesman for GEICO insurance. Here is what Ermey said that cost him his career. While you’re reading this, remember all the vile things Hollywood has said about Trump, including Avengers director Joss Whedon wishing Trump dead: We’re having a big problem this year. The economy really sucks. Now I really hate to point fingers at anybody, but the present [Obama] administration probably has a lot to do with it. And the way I see, they aren’t going to quit doing it until they bring this country to its knees. So I think we should all rise up and we should stop this administration from what they’re doing, because they are destroying this country.  They’re driving us into bankruptcy so that they can impose socialism on us. That’s exactly what they’re doing, and I’m sick and damn tired of it and I know you are too. But I know the Maince Corps’ gunna be here forever and this administration won’t.   – December 10, 2010 – video. On his website, Ermey apologized for these comments the following month. “I regret that I delivered a monologue that was inappropriately critical of the President. My comments were misguided and emotionally biased, and for that I am truly sorry,” he wrote. But it was too late. Intolerant Hollywood would never forgive him. His film career immediately dried up. What followed were two reality shows, one on the Outdoor Channel, the other on Lifetime. The good news is that before left-wing Hollywood blacklisted him, Ermey had a pretty good run., including Mississippi Burning (1988), Toy Soldiers (1990), Toy Story 1,2,3 (1995 – 2010), The Frighteners (1996), a hilarious turn in the horribly under-appreciated Saving Silverman (2000), Texas Chainsaw Massacre (2003), and countless television appearances. Here are some of his best personal quotes. “If you’re a conservative in this town [Hollywood], you better watch out.” – video. “I’m an Independent, but I said something bad about the president. I had something unsavory to say about the president’s administration, and even though I did vote for him the first time around, I was blackballed …  Do you realize I have not done a movie in five to six years? Why? Because I was totally blackballed by the… liberals in Hollywood. They can destroy you. They’re hateful people [who] don’t just not like you, they want to take away your livelihood… that’s why I live up in the desert on a dirt road… I don’t have to put up with their crap.” – video. “I don’t have any respect at all for the scum-bags who went to Canada to avoid the draft or to avoid doing their fair share.” “You can take a man out of the Corps, but you can’t take the Corps out of the man.” “It’s been a pretty fun ride, to tell you the truth.” ” I know that if Trump were to be elected, I know that our Second Amendment rights are solid as a rock for four years, or whatever his term might be. Donny Trump is on my shooting team, by the way.  He’s a heckuva shot. ” – video. Ermey is survived by his wife of 43 years, Nila, who he referred to as “Mrs. Gunny.” They had four children. Ermey is also survived by a second-to-none performance in Full Metal Jacket that will be remembered long after the fascist monsters who blacklisted him are worm food. Follow John Nolte on Twitter @NolteNC. Follow his Facebook Page here.",
      "date": "16 Apr 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Cory Booker: Obama ‘Made Some Mistakes’ but I’d Let Him Run for a Third Term",
      "url": "https://www.breitbart.com/politics/2019/08/01/cory-booker-obama-made-some-mistakes-but-id-let-him-run-for-a-third-term/",
      "subtitle": "Appearing Thursday on CNN’s New Day, Sen. Cory Booker (D-NJ) conceded Barack Obama “made mistakes” as president but would still welcome him to run for a third term.",
      "author": "Joshua Caplan",
      "content": "  A partial transcript is as follows: CNN HOST JOHN BERMAN: There was a lot of focus of things that took place in the eight years when [former President Obama] was in office, and he was not necessarily painted in a flattering way [during Wednesday’s Democrat debate]. One of the things you hear this morning is if Barack Obama was too far right or not connected to today’s Democratic Party; what does it say about today’s Democratic Party? I’m just telling you what we’re hearing. SEN. CORY BOOKER: Well, first of all, I miss Obama. And I miss her husband, too. Look, he [Obama] is our statesman… He ain’t perfect. Nobody’s ever pulled that off. Nobody has ever pulled that off. And I’m sure if Barack Obama was sitting here — and I hope he’s sleeping this morning — he would tell you, “I’ve made some mistakes…” Donald Trump is a guy that my Republican colleagues can’t even criticize when he’s preaching racism… We are having an honest conversation about an administration that was incredible. I would take him back. Heck, if [Obama] was running for president for a third term, I wouldn’t be running. The reality is we have a situation right now where the president is doing things to this country that are perverting our very values and ideals, and talking about what our plans would be, different from the previous president; different from the current president, is not a bad thing.",
      "date": "1 Aug 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Barack Obama: Trump’s Nationalism ‘Not Pride in Country, but Hatred for Somebody on the Other Side of the Border’",
      "url": "https://www.breitbart.com/politics/2018/11/28/barack-obama-trumps-nationalism-not-pride-country-hatred-somebody-other-side-border/",
      "subtitle": "Former President Barack Obama derided the American nationalism of President Donald Trump’s supporters as rooted in a “hatred” of foreigners, offering his remarks on Tuesday at Rice University in Houston, Texas. He joined former Secretary of State James Baker and presidential biographer Jon Meacham.",
      "author": "Robert Kraychik",
      "content": " Obama said: We did not adapt quickly enough to the fact that there were people being left behind [by globalization] and that frustrations were going to flare up and that all these changes were happening really quickly, and you had to address them and speak to them. In those environments, you then start getting a different kind of politics. You start getting politics that’s based on, “That person’s not like me, and it must be their fault,” and you start getting a politics based on a nationalism that’s not pride in country, but hatred for somebody on the other side of the border, and you start getting the kind of politics that does not allow for compromise because it’s based on passions and emotions and identities. When I hear people say they don’t like identity politics, I think it’s important to remember that identity politics doesn’t just apply when it’s black people or gay people or women. The folks who really originated identity politics were the folks who sad three-fifths clause and all that stuff. That was identity politics. That’s still out there. Jim Crow was identity politics. That’s where it started. WATCH:  Obama lamented the news media diversification following the rise of the Internet. He said a “common set of facts” — previously delivered by consensus via the Associated Press, Washington Post, New York Times, ABC, CBS, and NBC — was lost following the arrival of Rush Limbaugh and Fox News on the news media landscape. He said: There are a range of reasons why [“the overlapping ideological spectrum in each party”] changed. Some of it had to do with, frankly, the shift in the media because in 1981, your news cycle was still governed by the stories that were going to be filed by AP, the Washington Post, maybe the New York Times, and the three broadcast stations. Whether it was Cronkite or Brinkley, or what have you, there was a common set of facts, a baseline around which both parties had to adapt and respond to, and by the time I take office, what you increasingly have is a media environment in which if you are a Fox News viewer, you have an entirely different reality than if you are a New York Times reader. It means the basis of each respective party [has] become more ideological. WATCH:  Obama also said Trump lacks “reverence” for the Oval Office: When I walked into the Oval Office, there’s a reverence there for that office that is independent of you, and if you don’t feel that, then you shouldn’t be there because a lot of fights, a lot of sacrifices, a lot of bloodshed is represented in that office — not just soldiers in Iwo Jima. It’s maids in Selma, workers in a coal mine. It’s farmers in the Dust Bowl. You’re carrying that vessel, and I never lost that reverence for that office, and every day I would come, and I would say, “I’m going to make mistakes. There are going to be decisions that are compromises.” … Through all those ups and downs, you had to have a part of you — and the Bushes had that, and Ronald Reagan had that, and Bill Clinton had that — that sense of, “This is sacred. This is important.” And there’s a civic religion and a set of ideals and principles that we won’t get perfect, but we should strive to perfect, and that is something I never lost throughout the time I was there. Both Meacham and Obama refused to say Trump’s name, despite both referring to him implicitly. “He’s Voldemort. I’m not going to say his name,” Meacham said of Trump while asking Obama a question about Trump’s presidency. Neither Baker nor Meacham challenged Obama’s comments. Follow Robert Kraychik on Twitter.",
      "date": "28 Nov 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Gun Control Groups Rally as Barack Obama-Endorsed Jacky Rosen Targets Gun Rights",
      "url": "https://www.breitbart.com/politics/2018/10/24/gun-control-groups-rally-barack-obama-endorsed-jacky-rosen-targets-gun-rights/",
      "subtitle": "Gun control groups are rallying in Nevada as Barack Obama-endorsed Jacky Rosen (D) continues campaigning to restrict gun rights.",
      "author": "AWR Hawkins",
      "content": " Rosen is trying to unseat Sen. Dean Heller (R-NV), who has an A rating from the NRA. Fox News reported Barack Obama’s endorsement of Rosen and Mother Jones reported that gun control groups, including Gabby Giffords’ group, were rallying to raise money in hopes of helping Rosen capture Heller’s Senate seat, from which she could vote for more restrictions on the Second Amendment. Rosen supports outlawing private gun sales via universal background checks, even though such checks would not have hindered, must less stopped, any high profile shooting of recent memory, including the October 1, 2017, shooting in Las Vegas. On the Issues reports that Rosen also shares the gun control positions of other Senate Democrats on adding the no fly list to background checks, among other things. Ironically, Democrats like Rosen push the no fly list for gun control even though they cannot name one high profile shooting that the addition of such a list would have stopped. Down Range with AWR Hawkins.  Sign up today! Rosen’s support of gun control for gun control’s sake goes a long way in explaining why the NRA’s Political Victory Fund gives her an F rating. During a debate for the Senate seat Sen. Heller said Rosen “was born and raised in Chicago, Illinois.” He added, “I do not want Chicago laws here in the state of Nevada and that’s all we’re going to get if she goes to the US Senate.” AWR Hawkins is an award-winning Second Amendment columnist for Breitbart News, the host of the Breitbart podcast Bullets with AWR Hawkins, and the writer/curator of Down Range with AWR Hawkins, a weekly newsletter focused on all things Second Amendment, also for Breitbart News. He is the political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com. Sign up to get Down Range at breitbart.com/downrange. ",
      "date": "24 Oct 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Barack Obama Doesn’t Endorse Joe Biden After 2020 Campaign Launch",
      "url": "https://www.breitbart.com/politics/2019/04/25/barack-obama-doesnt-endorse-joe-biden-after-2020-campaign-launch/",
      "subtitle": "Former President Barack Obama on Thursday offered praise for his former Vice President Joe Biden following the launch of his 2020 presidential campaign — but noticeably stopped short of endorsing him as a candidate.",
      "author": "Joshua Caplan",
      "content": " “President Obama has long said that selecting Joe Biden as his running mate in 2008 was one of the best decisions he ever made,” Obama said in a statement released through his spokeswoman Katie Hill. “He relied on the Vice president’s knowledge, insight, and judgment throughout both campaign and the entire presidency. The two forged a special bond over the last 10 years and remain close today.” Biden formally joined the crowded Democrat presidential contest on Thursday, declaring the soul of the nation at stake if President Donald Trump wins re-election. In a video posted on Twitter, Biden focused on the 2017 deadly clash between white supremacists and far-left counter-protesters in Charlottesville, Virginia. He repeated the hoax claim that President Trump praised the former group as “very fine people.”  “We are in the battle for the soul of this nation,” Biden said. “If we give Donald Trump eight years in the White House, he will forever and fundamentally alter the character of this nation — who we are. And I cannot stand by and watch that happen.” The 76-year-old Biden becomes an instant front-runner alongside Sen. Bernie Sanders (I-VT), who is leading many polls and has proved to be a successful fundraiser. Despite his status within crowded Democrat field, the former vice president already faces several challenges, including fundraising and flaring tensions within his campaign. The New York Times reported this week that Biden will enter the race with zero campaign dollars and will need to raise at least $100,000 per day until Christmas if he wants to match the amount of cash that Sanders (I-VT) banked by April 1st. Team Biden is said to be concerned that the 76-year-old may not be able to raise the type of money Sanders and former Rep. Beto O’Rourke (D-TX) did in the first days of their campaigns — roughly $6 million each. According to the TIME magazine, some close to Biden are worried that his 2020 preparations had thus far largely been a failure. “I’ve never seen anything so half-assed,” one former Biden aide said last week. “They’re improvising and doing last-minute planning. The guy has been running for President since 1987 and can’t figure the basics out, like where to stand on his first day? This should make everyone very nervous.” The AP contributed to this report.",
      "date": "25 Apr 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Taylor Swift: ‘We Were in Such an Amazing Time When Obama was President’",
      "url": "https://www.breitbart.com/entertainment/2019/09/18/taylor-swift-we-were-in-such-an-amazing-time-when-obama-was-president/",
      "subtitle": "Pop megastar Taylor Swift heaped praise on former President Barack Obama, saying in a new interview that his presidency represented an “amazing time” because foreign countries “respected us.”",
      "author": "David Ng",
      "content": " “We were in such an amazing time when Obama was president because foreign nations respected us. We were so excited to have this dignified person in the White House. My first election was voting for him when he made it into office, and then voting to re-elect him,” the country pop megastar said in a Rolling Stone interview published Wednesday to promote her latest album, “Lover.” Taylor Swift added that she is now obsessed with politics. “Really, I keep trying to learn as much as I can about politics, and it’s become something I’m now obsessed with, whereas before, I was living in this sort of political ambivalence, because the person I voted for had always won,” she said. Swift supported Hillary Clinton in the 2016 election but didn’t publicly endorse her, saying Trump “was weaponizing the idea of the celebrity endorsement.” The pop star talked about a range of topics in the Rolling Stone interview, including her career and personal life. At one point, the interviewer asked her thoughts about the time a white-supremacist site suggested the singer was “on their team.” “I didn’t even see that, but, like, if that happened, that’s just disgusting,” Swift said. “There’s literally nothing worse than white supremacy. It’s repulsive. There should be no place for it.” The Grammy-winner told the magazine that she is now focused on the 2020 election, saying she is “really focused on how I can help and not hinder.” Follow David Ng on Twitter @HeyItsDavidNg. Have a tip? Contact me at dng@breitbart.com",
      "date": "18 Sep 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Barack, Michelle Obama Ink Deal to Produce Netflix Movies and Shows",
      "url": "https://www.breitbart.com/entertainment/2018/05/21/netflix-obamas-enter-into/",
      "subtitle": "Netflix announced Monday that it is partnering with former President Barack Obama and his wife Michelle to develop original content for the video streaming giant.",
      "author": "Joshua Caplan",
      "content": " “President Barack Obama and Michelle Obama have entered into a multi-year agreement to produce films and series for the streaming platform, potentially including scripted series, unscripted series, docu-series, documentaries, and features,” Netflix said in a statement.  The Obamas expressed their excitement for the deal, as well. “One of the simple joys of our time in public service was getting to meet so many fascinating people from all walks of life, and to help them share their experiences with a wider audience,” said former President Obama. “That’s why Michelle and I are so excited to partner with Netflix – we hope to cultivate and curate the talented, inspiring, creative voices who are able to promote greater empathy and understanding between peoples, and help them share their stories with the entire world.” “Barack and I have always believed in the power of storytelling to inspire us, to make us think differently about the world around us, and to help us open our minds and hearts to others,” said Michelle Obama. “Netflix’s unparalleled service is a natural fit for the kinds of stories we want to share, and we look forward to starting this exciting new partnership.” The New York Times reported in March that Netflix and the Obamas were in advanced negotiations to “produce a series of original shows” for the company. “Netflix would pay Mr. Obama and his wife, Michelle, for exclusive content that would be available only on the streaming service, which has nearly 118 million subscribers around the world. The number of episodes and the formats for the shows have not been decided,” the Times reported.",
      "date": "21 May 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "GOP Rep. Rogers: ‘Barack Obama Could Not Win the Nomination in This Year’s Democrat Field — He Is Not Socialist Enough to Win’",
      "url": "https://www.breitbart.com/clips/2019/08/30/gop-rep-rogers-barack-obama-could-not-win-the-nomination-in-this-years-democrat-field-he-is-not-socialist-enough-to-win/",
      "subtitle": "null",
      "author": "Jeff Poor",
      "content": " While the state of the Democratic Party in 2020 may make some Republicans cringe, it could pay off in the long run for Republicans according to Rep. Mike Rogers (R-AL). During an appearance on Huntsville, AL radio’s WVNN on Thursday, Rogers speculated that if former President Barack Obama were one of the candidates in the 2020 Democratic presidential field, he would not win the party nomination for not being “socialist enough.” “I hear it everywhere I go in my district – people do see them as the face of the future Democrat Party, and they see these presidential debates, and they see how far left they’re going with their rhetoric,” Rogers said on “The Jeff Poor Show.” “I just spoke to a civic group in Alex City today at lunch, and I told them – and I really mean this – Barack Obama could not win the nomination in this year’s Democrat field. He is not socialist enough to win. That’s how far left they’ve moved. So yeah, when I hear Omar and AOC and Tlaib all talking, I want them to keep it up because it is turning off Americans from coast to coast.” Rogers was still optimistic about Republicans chances of picking up the House in 2020 and warned not to read too much into the recent wave of Republican retirements. “It doesn’t have any effect on it,” he added. “One of the things that drives me nuts about the national news media is they spin these things to support a narrative they’re promoting. The fact that is we’re not having a larger retirement than we usually have.  If you take the last three-and-a-half years and you compare it to the previous three-and-a-half years, it’s the same percentage. Every August recess, we have a lot of people announce they’re retiring in part because they get back home in August and realize ‘I like being home. I don’t want to do this anymore.’ It’s a tough way of life. There’s a lot of time away from your family. A lot of time spent fundraising. Social media has made it just a nightmare to have to be in these jobs because people just beat the crap out of you constantly, cable news. A lot of folks just don’t want to do this for a long time.” “But this is nothing out of the ordinary,” he continued. “One of the things I would urge your audience to look at in the future because I’ve been doing this 17 years now, and I’ve seen this pattern: Every August, especially right at the end of August you get a lot of people announce they’re retiring because they’ve been home for a month and they like being out of Washington and back home. And then after every Christmas break, we have a wave of announcements for the same reason – people are back home with their family. They realize they like the private life and they want to go back to it. So there is nothing unusual about what’s happening right now.” Follow Jeff Poor on Twitter @jeff_poor",
      "date": "30 Aug 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Architects: Barack Obama’s Presidential Library Could Cost $1.5 Billion",
      "url": "https://www.breitbart.com/politics/2017/02/20/architects-barack-obamas-presidential-library-could-cost-1-5-billion/",
      "subtitle": "Former President Barack Obama’s presidential library could require a $1.5 billion endowment, according to architects in charge of designing the library.",
      "author": "Katherine Rodriguez",
      "content": " The amount is three times more than the money raised to build the George W. Bush Presidential Center in Dallas that opened in 2013, the New York Post’s Page Six reported. Architects Tod Williams and Billie Tsien noted that Obama declined to do a lot of fundraising for the center while in office, and said the reason the center would be so expensive was because of the high cost of building both a library and a museum. The architects say the originally estimated cost of the buildings at $200 million is more likely to be closer to $300 million. Another reason for the higher price tag is because recent federal regulations require that former presidents have larger endowments to pay for annual operating costs at the libraries. “It won’t be easy,” Williams said. “It’s not just about preserving the past. It’s about the future.” NBC Chicago reports that Obama is about to begin a major fundraising effort for the project as the former president met with community leaders and others to discuss the Obama Foundation.",
      "date": "20 Feb 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Barack Obama: Eating More Steaks Contributes to Climate Change",
      "url": "https://www.breitbart.com/politics/2017/05/09/barack-obama-eating-more-steaks-contributes-to-climate-change/",
      "subtitle": "Former President Barack Obama warned the world that more people on the planet were eating meat, causing a dramatic rise in climate emissions.",
      "author": "Charlie Spiering",
      "content": " “As people want to increase meat consumption, that in turn is spiking the growth of greenhouse emissions coming out of the agricultural sector,” Obama said, pointing to countries that were consuming more meat. The former president shared his views about the growing threat during a conversation about food with his former chef Sam Kass at a food innovation summit in Milan. “People aren’t as familiar with the impact of cows and methane,” Obama said, adding that “as people want to increase more meat consumption, that in turn is spiking the growth of greenhouse emissions coming out of the agricultural sectors.” The amount of cows, Obama explained, were contributing to global pollution, alluding to the amounts of methane gas emissions from cow herds. “No matter what, we are going to see an increase in meat consumption,” Obama said, pointing to developing economies in China, India, Indonesia, and Vietnam. More advanced countries, Obama said, would have to teach people to “have a smaller steak” and explore reductions to their meat consumption. “What it does mean is that we’re also going to have to find ways to produce protein in a more efficient way,” he said. During the conversation, Obama argued with Kass about how many steaks he had cooked him. Kass said that he probably cooked “thousands of steaks” for the president, but Obama interrupted. “I don’t think, thousands,” he protested. “Well hundreds maybe,” Kass backtracked. “I’ve been cooking for you for 10 years.” “What is true is that I’m not a vegetarian,” Obama admitted, adding that he “respected vegetarians” but continued to eat meat.",
      "date": "9 May 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Obama ‘Proud’ of Former Admin Staff Who Blasted Trump’s ‘Go Back’ Remark",
      "url": "https://www.breitbart.com/politics/2019/07/27/obama-proud-of-former-admin-staff-who-blasted-trumps-go-back-remark/",
      "subtitle": "Former President Barack Obama on Saturday praised staffers who served in his administration after roughly 150 African-Americans signed an opinion-editorial bashing President Donald Trump’s recent comments regarding the far-left Democrat “Squad.”",
      "author": "Joshua Caplan",
      "content": " “I’ve always been proud of what this team accomplished during my administration. But more than what we did, I’m proud of how they’re continuing to fight for an America that’s better,” Obama, who has largely remained silent about the Trump presidency, wrote on Twitter.  In a Washington Post op-ed published Friday, the ex-Obama administration members wrote they “witnessed firsthand the relentless attacks on the legitimacy of President Barack Obama and his family” from their “front-row seats to America’s first black presidency.” The op-ed reads: Witnessing racism surge in our country, both during and after Obama’s service and ours, has been a shattering reality, to say the least. But it has also provided jet-fuel for our activism, especially in moments such as these. We’ve heard this before. Go back where you came from. Go back to Africa. And now, ‘send her back.’ Black and brown people in America don’t hear these chants in a vacuum; for many of us, we’ve felt their full force being shouted in our faces, whispered behind our backs, scrawled across lockers, or hurled at us online. They are part of a pattern in our country designed to denigrate us as well as keep us separate and afraid. The Obama-era officials then expressed support for the four progressive lawmakers, accusing President Trump of being “complicit in the poisoning of our democracy.” “We stand with congresswomen Ilhan Omar, Alexandria Ocasio-Cortez, Ayanna Pressley and Rashida Tlaib, as well as all those currently under attack by President Trump. There is truly nothing more un-American than calling on fellow citizens to leave our country,” the wrote. Earlier this month, President Trump challenged the “Squad” to leave the U.S., citing their frequent verbal attacks on the country, writing on Twitter: “Why don’t they go back and help fix the totally broken and crime infested places from which they came. Then come back and show us how it is done.” During a recent campaign rally in Greenville, North Carolina, President Trump’s supporters broke out into a “send her back” chant about Omar, sending Democrats and the establishment media into a tizzy. The president later said he was “not happy” about the chants, and Vice President Mike Pence suggested the president may stop them in the future. Absent from the op-ed was any mention of various inflammatory and antisemitic comments made by the “Squad.” Omar has repeatedly sparked political firestorms for her anti-Israel comments and pushing anti-Jewish tropes. The Minnesota Democrat has suggested pro-Israel advocacy groups bribe members of Congress to support the Jewish state. In a 2012 tweet, Omar claimed Israel had “hypnotized the world.” Tlaib has attacked opponents of the anti-Israel BDS movement by claiming, “they forgot what country they represent,” inferring they hold foreign allegiances. In May, the Michigan Democrat said Palestinians provided “safe haven” for Jews following the Holocaust. However, it is widely known Palestinian leaders, including former Grand Mufti of Jerusalem Hajj Muhammad Amin Al-Husseini, collaborated openly with Adolf Hitler. She has also met with Abbas Hamideh, a Hezbollah supporter who has described Israel as a “terrorist entity.” Ocasio-Cortez has come under fire for trivializing the Holocaust by comparing immigrant detention centers to concentration camps. Senior White House advisor Stephen Miller, who is Jewish, recently criticized the New York Democrat for likening the two, saying they minimized the “death of six million of my Jewish brothers and sisters.”",
      "date": "27 Jul 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Barack Obama Launches ‘Unity Fund’ for Eventual 2020 Democrat Nominee",
      "url": "https://www.breitbart.com/2020-election/2019/05/18/barack-obama-launches-unity-fund-support-eventual-2020-democrat-nominee/",
      "subtitle": "Former President Barack Obama may not be ready to support any particular 2020 Democrat presidential candidate for the primaries, but he is already preparing for the eventual nominee by launching a “unity fund” to help in the general election.",
      "author": "Warner Todd Huston",
      "content": " Obama announced the launch of his “Democratic Unity Fund” on Friday in an email to Democrat donors, Fox News reported. “The Democratic Unity Fund is a promise that whoever earns our nomination, he or she will have a strong, united, and well organized DNC ready to spring into action the moment the general election starts – a DNC that’s ready to lift us all to victory in November,” the announcement read. With this look toward the day when the Democrat primaries are over, Obama has further distanced himself from coming to the support of any of the two dozen Democrats vying for the party’s nomination, including his own vice president, Joe Biden. On April 25, Biden spokesperson Kate Bedingfield insisted on MSNBC that the former veep requested that Obama not endorse him ahead of the 2020 primaries. “The vice president actually asked the president not to endorse. [Biden] wanted to make the case” directly to the voters, she claimed. Follow Warner Todd Huston on Twitter @warnerthuston.",
      "date": "18 May 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "former President Barack Obama",
      "url": "https://www.breitbart.com/tag/former-president-barack-obama/",
      "subtitle": "null",
      "author": "Pam Key",
      "content": "                             ",
      "date": "24 Aug 2018, 2:26 PM PDT",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Donald Trump Floats Barack Obama Investigation: ‘Let’s Look into His Book Deal’",
      "url": "https://www.breitbart.com/politics/2019/07/26/trump-floats-barack-obama-investigation-lets-look-into-his-book-deal/",
      "subtitle": "President Donald Trump expressed his disappointment with Democrats on Friday for continuing to push the idea of impeachment proceedings, suggesting that the House could investigate former President Barack Obama instead.",
      "author": "Charlie Spiering",
      "content": " “We want to find out what happened with the last Democrat president, let’s look into Obama the way that they’ve looked at me from Day One, they’ve looked into everything that we’ve done,” he said. “They could look into the book deal that President Obama made.” The president spoke about the possible investigation with reporters at the White House after a signing agreement with Guatemala. Obama and his wife Michelle famously signed a book deal estimated at $65 million in 2017. Trump appeared to use the example of the book deal to show that Republicans never took their presidential investigations as far as Democrats do in Congress. He noted that Republicans were “gentlemen and women” for not harassing Obama and Clinton with subpoenas when they were in the majority, unlike Democrats. Trump predicted that Republicans would probably take back majorities in the House and keep the Senate in 2020 and the presidency. He noted that the ongoing march toward impeachment was “politics” in order to rally their base in 2020. “It’s a disgrace that they’re doing it, they’re doing it for political reasons and most of them, many of them are admitting that it’s politics,” he said.",
      "date": "26 Jul 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Obama Crushes Conspiracy: No Evidence that Russia Tampered with Votes in Election",
      "url": "https://www.breitbart.com/politics/2016/12/13/obama-crushes-conspiracy-no-evidence-russia-tampered-votes-election/",
      "subtitle": "President Barack Obama emphatically denounced the conspiracy theory saying Russians successfully tampered with the American voting process.",
      "author": "Charlie Spiering",
      "content": " “We were frankly more concerned in the run up to the election to the possibilities of vote tampering, which we did not see evidence of,” he said. “And we’re confident that we can guard against.” During an interview with the Daily Show’s Trevor Noah, Obama downplayed the hack of a private email account of Clinton campaign chief John Podesta, defending his administration for revealing in October that the Russian government was connected. “None of this should be a big surprise,” Obama said, “Russia trying to influence our elections dates back to the Soviet Union.” Obama dismissed the hack and the leaked emails as “not very interesting” and lacking “explosive” revelations. He puzzled as to why it was an “obsession” by the news media despite the knowledge that the Russians were responsible. He also criticized President-elect Donald Trump for calling on the Russian government to hack Hillary’s emails to reveal the contents of the deleted emails from her private server, and reminded the audience that Trump had campaign officials connected to Russia. “What’s happened to our political system where some emails that were hacked and released ended up being the overwhelming story, and the constant source of coverage – breathless coverage – that was depicted as somehow damning in all sorts of ways when the truth of the matter was it was fairly routine stuff?” he said.",
      "date": "13 Dec 2016",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Barack Obama Lectures Europeans About Nationalism — in Denmark",
      "url": "https://www.breitbart.com/politics/2018/09/28/barack-obama-lectures-europeans-about-nationalism-in-denmark/",
      "subtitle": "Former President Barack Obama on Friday lectured Europeans on rising nationalism across the continent and beyond while speaking before entrepreneurs in Denmark — two days after taking a swipe at the Trump administration’s environmental policy in Norway.",
      "author": "Joshua Caplan",
      "content": " “I’m concerned enough about the international and American trends that I thought it was important to offer my views,” Obama, who is on a break from campaigning for Democrats ahead of the midterm elections for a series of speaking engagements around Europe, told attendees of a business forum in the central city of Kolding. “When you start seeing our politics driven completely free of facts, when you start seeing a debate that is driven solely on racial or nationalistic impulses, when you start seeing a rejection of science and expertise and logic in politics… we are beyond the sort of politics that will continue our best traditions,” Obama continued, as quoted by Agence France-Presse. Speaking on the rise of Poland’s populist Law and Justice Party and the Orban government in Hungary, Obama issued a warning: “[T]here is a shift that has implications for all of Europe,” adding, “When a population is passive and ill-informed and not paying attention, that’s when there is the greatest danger.” On Wednesday, Obama raised eyebrows at home after criticizing President Donald Trump’s position on climate change, citing the current administration’s move to pull out of the Paris Agreement signed in November 2016. “Obviously, Paris Accords were an important step in the right direction, but it was only a first step and so much more work needs to be done,” the former president said before the Oslo Business Forum, later adding, “But, that requires a level of political and social commitment on the part of all of us: businesses, the non-profit sector, each of us individuals, that right now is not forthcoming. Unfortunately, we have a U.S administration that deals differently around these issues.”",
      "date": "28 Sep 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Barack Obama Silent About Ralph Northam Racist Yearbook Scandal",
      "url": "https://www.breitbart.com/politics/2019/02/04/barack-obama-silent-ralph-northam-racist-yearbook-scandal/",
      "subtitle": "Former President Barack Obama remains silent about Virginia Gov. Ralph Northam’s racist yearbook scandal despite calls from the Democrat party for his resignation.",
      "author": "Charlie Spiering",
      "content": " Since the yearbook photo was released on Friday, 2020 Democrat presidential candidate Sen. Kamala Harris spearheaded a rush to call for Northam’s resignation. Even failed presidential candidate Hillary Clinton weighed in on the issue. “This has gone on too long. There is nothing to debate. He must resign,” Clinton wrote on Twitter Saturday. But Obama has stayed out of the conversation despite enthusiastically endorsing and rallying for Northam in 2017. “I know what Ralph Northam believes. I know what Justin Fairfax believes,” the former president said during a rally in October 2017. “They’ve got plans and policies that will reflect your values and your priorities.” Obama brought up the riot in Charlottesville during the rally with Northam, arguing that he was a more decent leader on race than his Republican opponent, Ed Gillespie. “Ralph believes if we’re gonna talk about our history, that we should do it in a way that heals, not in a way that wounds–not a way that divides,” he said. “We shouldn’t use the most painful parts of our history just to score political points.” Northam is reportedly meeting Monday with top advisers and other Democrats to discuss his political future.",
      "date": "4 Feb 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Barack Obama: Too Easy to ‘Buy Machine Guns’ in America",
      "url": "https://www.breitbart.com/politics/2019/05/31/barack-obama-too-easy-to-buy-machine-guns-in-america/",
      "subtitle": "Barack Obama said U.S. gun laws “don’t make much sense” and specifically criticized the ability to “buy machine guns.”",
      "author": "AWR Hawkins",
      "content": " Obama offered his thoughts during a May 30, 2019, speech while participating in VTEX DAY in San Paulo, Brazil. The Daily Mail quoted Obama saying, “Gun laws in the United States don’t make much sense. Anybody can buy any weapon, anytime without, you know, without much if any regulation. They can buy over the Internet. They can buy machine guns.” There are  number of problems with Obama’s claims. The first is the assertion anybody “can buy any weapon, anytime…without much if any regulation.” This is simply untrue. Firearms are highly regulated in the U.S. via background checks for retail point of sales, registration requirements in states like California and New York, and mandated waiting periods for gun purchases in numerous states as well. Down Range with AWR Hawkins.  Sign up today! Moreover, possession of a firearm is highly regulated requiring Firearm Owners Identication (FOID) cards or other licensing schemes in various states. One cannot even possess a gun in his home without such a card in states like Illinois or without first getting a certificate from the government in states like California. Obama’s claim that guns can be purchased over the internet is spurious as well as it is legal for retailers to advertise and accept payment for a gun over the internet but they cannot ship a gun directly to a buyer. Rather, the gun has to be shipped to a Federal Firearm License holder (FFL) near the buyer so a background check can be performed before the buyer is allowed to take possession of the gun. Lastly, Obama suggested it is easy to buy machine guns in the U.S. He made this statement in the context of talking about the December 14, 2012, attack on Sandy Hook Elementary School, in which machine guns were not used. Nevertheless, Obama broached the subject but did not mention that machine guns are regulated under the National Firearms Act (1934), which means the purchase of one requires a background check, the submission of fingerprints and photographs, the payment of a $200 federal tax, and registering with the weapon with the federal bureaucracy. This process takes eight to nine months to complete. Moreover, the only machine guns that legally be purchased are those built prior to May 1986, therefore there is a limited number of them available. This means the cost of such a weapon often runs in the tens of thousands. Obama did not mention any of these things when suggesting machine guns are too easy to buy in America. AWR Hawkins is an award-winning Second Amendment columnist for Breitbart News and the writer/curator of Down Range with AWR Hawkins, a weekly newsletter focused on all things Second Amendment, also for Breitbart News. He is the political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com. Sign up to get Down Range at breitbart.com/downrange.",
      "date": "31 May 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Donald Trump: Child Migrants Treated ‘Much Better’ than Under Barack Obama",
      "url": "https://www.breitbart.com/politics/2019/06/25/donald-trump-child-migrants-treated-much-better-than-under-barack-obama/",
      "subtitle": "President Donald Trump defended Tuesday the treatment of migrant children apprehended at the border, despite the increasing volume of individuals crossing into the United States.",
      "author": "Charlie Spiering",
      "content": " “I am very concerned,” Trump said when asked by reporters at the White House on Tuesday about the conditions of the holding centers. “They are much better than they were under President Obama by far,” Trump replied. He urged Democrats to move quickly to pass more government funding for humanitarian aid to help the children. “A lot of these young children come from places that you don’t even want to know about,” Trump said. The president noted that drug cartels and  coyotes were taking advantage of young children to help them cross the border. “It’s a form of slavery, it’s horrible what they’re doing to young children,” he said. Trump thanked Mexico for stepping up to help enforce the borders, sending 15,000 troops. “I just want to thank Mexico, they’ve really done a great job,” Trump said. “We appreciate what they are doing.” The president again asked Democrats to help close the asylum loopholes that were encouraging migrants to cross into the United States for economic reasons. “People want to flow up to the United States, but you just can’t do it that way, you have to do it legally,” he said.",
      "date": "25 Jun 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Donald Trump Pivots Russia Questions to Barack Obama’s Failures",
      "url": "https://www.breitbart.com/politics/2019/08/26/donald-trump-pivots-russia-questions-to-barack-obamas-failures/",
      "subtitle": "President Donald Trump repeatedly pivoted all reporters’ questions about Russia to highlight former President Barack Obama’s failure to contain Russian President Vladimir Putin’s aggressive actions.",
      "author": "Charlie Spiering",
      "content": " During a press conference, one reporter criticized Trump for signaling his openness to welcoming Putin back to the G7 summit after Obama joined world leaders in 2014 by exiling him from the summit after he annexed Crimea. “President Obama was not happy that this happened because it was embarrassing to him,” Trump said, adding that after Obama was “outsmarted” by Putin he could understand how Obama felt. Trump also noted Obama backing down from his infamous “red line” on the use of chemical weapons in Syria and his failure to keep Russia from annexing Crimea. “I’m not blaming him, but a lot of bad things happened with President Putin and President Obama,” Trump said. When the reporter criticized Trump for “misleading” Americans by saying that Russia outsmarted Obama by annexing Crimea, Trump replied, “He did.” “It was annexed during President Obama – I know you like President Obama – but it was annexed during President Obama’s term,” Trump continued, referring to Russia annexing Crimea in 2014. Trump said he was willing to welcome Putin back to the summit, despite past aggressive actions in Europe, and said that other world leaders agreed with him. “I think it would better to have Russia inside the tent than outside the tent,” Trump said. “Do we live either way? Yes, we live either way.”",
      "date": "26 Aug 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Donald Trump: Democrats Attacked Barack Obama in Debate More than Me",
      "url": "https://www.breitbart.com/politics/2019/08/01/donald-trump-democrats-attacked-barack-obama-in-debate-more-than-me/",
      "subtitle": "President Donald Trump mocked the radical Democrat 2020 candidates for president on Thursday, claiming they spent more time attacking former President Barack Obama in their last debate than they attacked him.",
      "author": "Charlie Spiering",
      "content": " “The Democrats spent more time attacking Barack Obama than they did attacking me, practically,” he said. “That wasn’t pretty.” After taking the stage at his Cincinnati rally, Trump immediately spoke about “so-called” Democratic debates. “That was long, long television,” he admitted, recalling the two Democrat debates on CNN that lasted over two hours on Tuesday and Wednesday. During the Wednesday debate, Democrats taking shots at Biden also criticized President Obama on issues like the proposed Trans-Pacific Partnership trade deal, the failure to end the war in Afghanistan, and his record of deportations. Earlier Thursday, Trump noted that former Vice President Biden barely made it through the debate and that Kamala Harris did poorly. “I think Biden did OK, he came through, he came limping through, as I say about sleepy Joe, he limped right through it,” Trump said to reporters as he left the White House for his trip to Ohio. He described Warren as a “fraud.” “I’ve watched Elizabeth Warren sometimes referred to as Pochahontas … I don’t know, to me she doesn’t have credibility,” Trump said. “It’s possible I’ll have to run against her,;everything she did was a fraud.”",
      "date": "1 Aug 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Cory Booker Rips Joe Biden for Clinging to Barack Obama",
      "url": "https://www.breitbart.com/politics/2019/07/31/cory-booker-rips-joe-biden-for-clinging-to-barack-obamacory-booker-rips-joe-biden-for-clinging-to-barack-obama/",
      "subtitle": "Sen. Cory Booker called out former Vice President Joe Biden for ducking a question about deportations and putting the responsibility on former President Barack Obama.",
      "author": "Charlie Spiering",
      "content": " “Mr. Vice President, you can’t have it both ways, you invoke President Obama more than anybody in this campaign, you can’t do it when it’s convenient and then dodge it when it’s not,” he said. The debate audience cheered and applauded Booker’s response, as the former Vice President struggled to respond to questions about the record of deportations under the Obama administration. Mayor Bill de Blasio challenged Biden for failing to answer the question. “I was vice president, I am not the president, I keep my recommendation to him in private, unlike you,” Biden replied to the New York City Mayor, appearing to cite executive privilege about the conversations he had with the president. Later in the debate, Joe Biden defended his record on criminal justice and other contentious issues that his fellow Democrats continued to raise by citing Obama. “I trust his judgment,” he said.",
      "date": "31 Jul 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Trump on Obama’s Silence During Biden-Ukraine Saga: ‘I Think He’s Hiding’",
      "url": "https://www.breitbart.com/clips/2019/10/12/trump-on-obamas-silence-during-biden-ukraine-saga-i-think-hes-hiding/",
      "subtitle": "null",
      "author": "Jeff Poor",
      "content": " During an appearance on Fox News Channel’s “Justice” on Saturday, President Donald Trump speculated as to why former President Barack Obama has remained silent as allegations have unfolded regarding wrongdoing by former Vice President Joe Biden’s son Hunter Biden that occurred during his presidency. Trump said he thought Obama was “hiding” and raised the possibility that Obama was aware of the efforts from former FBI agents Lisa Page and Peter Strzok to interfere in the 2016 presidential election. Partial transcript as follows: you know, I want to ask a question that I haven’t heard you answer. And that is, where is Barack Obama in all this? Why haven’t we heard from him? I mean, in the beginning of your administration, he wouldn’t stop talking. And now, he’s nowhere to be heard. Where is he? TRUMP: I think he’s hiding. PIRRO: Why? TRUMP: I think he knows all about it. And we are talking about investigate the investigators. We’re talking about the beginning. And it was really before I took office. It was — if you look at the insurance policy with Strzok and Page, just in case she should lose, we’ve got an insurance policy. That’s what all this stuff has been about, the insurance policy. These are bad people. These are evil people. And this was the insurance policy. The two lovers, Strzok and Page. Two beauties. (LAUGHTER) PIRRO: Well, you know … TRUMP: And it’s a terrible thing, what they do to this country. Terrible. But we are winning. And we’re winning big. And the American public knows it. And that’s why I think they want to stay away. But they can do whatever they want. But they want to stay away. If you look at what’s happening, Jeanine, if you take a look, the electricity for the Republican Party, they are so angry at what has taken place. Because, as an example, everybody knows that Schiff — we call him “shifty Schiff” — he made up the story. He made up my phone call. PIRRO: Right. TRUMP: And based on that phone call, this is what this whole thing is about. It’s all about a phone call. And the call is perfect. I have given that call to everybody to read it. In fact, Lindsey Graham made a statement. He said, I never knew you were so nice. Follow Jeff Poor on Twitter @jeff_poor",
      "date": "12 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Fact Check: Barack Obama Installed Golf Simulator in White House",
      "url": "https://www.breitbart.com/the-media/2019/02/14/fact-check-barack-obama-installed-golf-simulator-in-white-house/",
      "subtitle": "Barack Obama was the first U.S. president to install a golf simulator in the White House, according to a bombshell report in the far-left Washington Post.",
      "author": "John Nolte",
      "content": " In other news, what we have here is yet another example of just how determined the Washington Post and the rest of the media are to live in their own heads; because they don’t even realize what a dazzling self-own this report is. Seriously, think about it: the Washington Post “bombshell” on President Trump updating Obama’s golf simulator, and doing so with his own money, just proves once again how useless and corrupt the establishment media are. Gee, what a crack team of inspiring investigative journalists America is blessed with. At long last, even though he has been out of office for two years, we have finally been told Barry had a golf simulator installed in the White House. And this is real news, because it is a first. Before Barry, there had never been a golf simulator in the White House. So it was Bill Ayers’ Friend who set a national precedent, and thanks to a dogged and persistent Washington Post, we now know this truth, we finally have all the facts, because democracy dies in darkness n’ stuff. But with its stupid bombshell about Trump’s golf simulator, all the far-left Post is doing is admitting it did not report on Obama’s golf simulator, is admitting that were it not for the Post’s obsessive hatred of Trump, the public never would have learned about Obama’s golf simulator. Jimmy Carter made a point of posing as a workaholic and look at the job he did, so as someone who only cares about results and could not care less about how much time a Obama or Trump play golf or vacation or enjoy “executive time,” my only takeaway from the from the Post bombshell was: Look at what it takes to force the corrupt media to report on something they did not want us to know about Obama. If the installation of golf simulators at the White House is such a big deal — and anyone looking at today’s media coverage can only assume it is a Watergate-level Big Deal — why are we just finding out now that Obama not only enjoyed a golf simulator but was the first president in history to install one? We all know the answer: the Washington Post, along with the rest of the unethical and inept corporate media, had no curiosity when it comes to Obama; and when the media did accidently discover something out about Obama they did not want the public to know, the media covered it up — like this photo of Obama hanging out with anti-Semitic hate preacher Louis Farrakhan. My guess, and it is a safe one, is that almost everyone in the national political media knew about Obama’s golf simulator but chose to not report because they knew his critics would have a field day with it. And so, if you read between the lines. all the Washington Post reported on yesterday, all the Washington Post revealed with its big scoop about Trump’s golf simulator, is just how awful, unreliable, biased, lazy, and worthless the media have always been. Follow John Nolte on Twitter @NolteNC. Follow his Facebook Page here.",
      "date": "14 Feb 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Joe Biden Asks Audience to Imagine ‘if, God Forbid, Barack Obama Had Been Assassinated’",
      "url": "https://www.breitbart.com/2020-election/2019/08/23/joe-biden-asks-audience-to-imagine-if-god-forbid-barack-obama-had-been-assassinated/",
      "subtitle": "Former vice president Joe Biden asked an audience at New Hampshire on Friday to imagine what would have happened “if, God forbid, Barack Obama had been assassinated” after winning the 2008 Democratic primary.",
      "author": "Joel B. Pollak",
      "content": " Biden, speaking at Dartmouth College in Hanover, was comparing Obama to Robert F. Kennedy, who was assassinated by Palestinian radical Sirhan Sirhan on June 6, 1968, mere moments after winning the California Democratic Primary, virtually assuring him the party’s nomination. He also drew parallels to the assassination of Dr. Martin Luther King, Jr., on April 4, 1968. According to the New York Times, Biden’s full quote was as follows: I think of where we are at the moment. You know, none of you men are old — women are old enough, but a couple of you guys are old enough to remember. I graduated in 1968. Everybody before me was, drop out, go to Haight-Ashbury, don’t trust anybody over 30, everybody not getting involved. I’m serious, I know no woman will shake their head and acknowledge it, but you guys know what I’m talking about. Right? But then what happened? Dr. Ki— I only have two political heroes. I have one hero who was my dad, but I have two political heroes were Martin Luther King and Bobby Kennedy. My senior semester they were both shot and killed. Imagine what would have happened if, God forbid, Barack Obama had been assassinated after becoming the de facto nominee. What would have happened in America? Biden also compared the eassassinations of Kennedy and King to the election of President Donald Trump in 2016 in terms of the effect those events had on inspiring left-wing activists. “Unless I’m mistaken, Donald Trump did for your generation what the loss of two of my heroes did for mine,” he said, according to the Times, adding, “What they did was make you realize, my God, we’re in trouble.” Biden also came under criticism Friday for a gaffe in which he accidentally said his health care policy would not offer quality. Joel B. Pollak is Senior Editor-at-Large at Breitbart News. He earned an A.B. in Social Studies and Environmental Science and Public Policy from Harvard College, and a J.D. from Harvard Law School. He is a winner of the 2018 Robert Novak Journalism Alumni Fellowship. He is also the co-author of How Trump Won: The Inside Story of a Revolution, which is available from Regnery. Follow him on Twitter at @joelpollak. Photo: file",
      "date": "23 Aug 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Pollak: Barack Obama Wrote the Playbook on Political Division",
      "url": "https://www.breitbart.com/politics/2019/07/22/pollak-barack-obama-wrote-playbook-on-political-division/",
      "subtitle": "Left-wing pundits have accused President Donald Trump of using his tweets last weekend to launch a divisive re-election campaign.",
      "author": "Joel B. Pollak",
      "content": " David Axelrod, former adviser to President Barack Obama, tweeted: “With his deliberate, racist outburst, @realDonaldTrump wants to raise the profile of his targets, drive Dems to defend them and make them emblematic of the entire party. It’s a cold, hard strategy.” That is debatable — but if so, Axelrod should know; Obama did it first. By 2011, Obama knew that re-election would be difficult. The Tea Party had just led the Republicans to a historic victory in the 2010 midterm elections, winning the House and nearly taking the Senate. The economy was only growing sluggishly, and Obama’s stimulus had failed to keep unemployment below eight percent, as projected. Moreover, the passage of Obamacare had provoked a backlash against Obama’s state-centered model of American society. Facing a similar situation in the mid-1990s, President Bill Clinton had “triangulated,” moving back toward the middle, frustrating the GOP by taking up their issues, such as welfare reform. But Obama rejected that approach. Having watched his icon, Chicago mayor Harold Washington, settle for an incremental approach when faced with opposition in the 1980s, only to die of a sudden heart attack before fulfilling his potential, Obama chose the path of hard-left policy — and divide-and-rule politics. The first hint of his strategy emerged during the debt ceiling negotiations in the summer of August 2011. As Bob Woodward recounted in his book about the crisis, The Price of Politics, then-Speaker of the House John Boehner (R-OH) had wanted to reach a “grand bargain” with the president on long-term spending cuts. But Obama blew up that agreement by demanding $400 billion in new taxes, to his aides’ surprise. Obama wanted an opponent, not a deal. (Last week, Boehner told Breitbart News Tonight that Obama’s decision was his worst disappointment in 35 years of politics.) In the fall of 2011, a new left-wing movement, Occupy Wall Street, was launched. A mix of communists, anarchists, and digital pranksters, the Occupy movement cast American society as a struggle between the “99 percent” and the “one percent.” Obama and then-House Minority Leader Nancy Pelosi (D-CA) embraced the movement — and failed to distance themselves from it even as it collapsed into violence, sexual assault, and confrontations with police. Instead, Obama picked up on Occupy’s themes and used them to shape his campaign. In December 2011, Obama gave a speech at Osawatomie, Kansas — a place steeped in radical symbolism — at which he doubled down on his left-wing policies. He focused on the issue of economic inequality, and attacked the idea that the free market could lift the middle class to prosperity. “This isn’t about class warfare. This is about the nation’s welfare,” he insisted. Then, in the spring of 2012, Obama made a controversial play on race. When a black teen, Trayvon Martin, was killed in Florida during a scuffle with neighborhood watch volunteer George Zimmerman, Al Sharprton — who was serving as an informal adviser to Obama at the time — made the local crime story into a national racial controversy. Obama, following Sharpton’s lead, weighed in: “If I had a son, he’d look like Trayvon,” Obama said at the time. Poll numbers suggest that race relations, which had been improving, dropped precipitously after that. But to Obama, it was worth it: the campaign needed to find a way to motivate minority voters. (Vice President Joe Biden did his part, telling black voters that GOP nominee Mitt Romney was “gonna put y’all in chains.”) Trump is pushing a non-racial, nationalist message. But if he actually wanted to divide America for political gain, he could learn from the master. Joel B. Pollak is Senior Editor-at-Large at Breitbart News. He earned an A.B. in Social Studies and Environmental Science and Public Policy from Harvard. He is a winner of the 2018 Robert Novak Journalism Alumni Fellowship. He is also the co-author of How Trump Won: The Inside Story of a Revolution, which is available from Regnery. Follow him on Twitter at @joelpollak.",
      "date": "22 Jul 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Joe Biden Forgets Barack Obama Was America’s ‘Last President’ in Latest Lapse",
      "url": "https://www.breitbart.com/2020-election/2019/09/07/joe-biden-forgets-barack-obama-was-americas-last-president-in-latest-lapse/",
      "subtitle": "Joe Biden appeared to forget that his former running mate, Barack Obama, was America’s “last president” during a speech in New Hampshire on Friday.",
      "author": "Haris Alic",
      "content": " The former vice president, who has worried even the staunchest of allies with his frequent lapses on the campaign trail, made the slip-up when arguing there were “natural limits” on constitutional rights like the Second Amendment. “I’m the only guy that’s beaten the NRA, and my state is a big gun-owning state because of hunting,” Biden told voters in Laconia, New Hampshire, before touting decades-long support for gun control. In particular, Biden highlighted his work authoring the initial assault weapons ban, which was part of his controversial 1994 crime bill. “I’m the only guy that’s beaten them twice. I got assault weapons banned for ten years, it had to be reauthorized because of hanging chads in Florida,” he said. “The last president said no, I’m not going to reauthorize it.” The statement struck many as confusing, since the most recent former occupant of the White House, Obama, was an avid supporter of gun control, especially prohibitions on firearms utilizing high-capacity magazines. Biden was likely referencing President George W. Bush, who in 2004 signaled he would not make renewing the 10-year-old ban a priority in an election year. Despite having publicly supported the ban in the past, Bush’s lack of enthusiasm doomed efforts at reauthorization in the then-Republican controlled Congress.  This is the second time in less than a month that Biden has appeared to forget Obama, a man he has often fondly called his “brother,” while campaigning. In August, Biden could not remember Obama’s name when invoking his administration’s legacy in dealing with Russia. “They invaded a significant portion of another country and annexed a significant portion of it called Crimea,” Biden said when discussing Russia’s invasion of Ukraine with voters in South Carolina. “He’s saying it was President — my boss — it was his fault.” The 76-year-old former vice president has also shown an inability to recollect dates and places to the chagrin of some of his most prominent backers. Earlier this summer, Biden shocked the media establishment when he claimed to be vice president at the time of the mass shooting at Marjory Stoneman Douglas High School in Parkland, Florida. “Those kids in Parkland came up to see me when I was vice president,” Biden said during a huddle with reporters in Iowa, before claiming that when the survivors visited Congress, lawmakers were “basically cowering, not wanting to see them. They did not want to face it on camera.” The statement was quickly disproved as the shooting, which resulted in 17 fatalities and over a dozen injuries, actually occurred on February 14, 2018 — more than a year after Biden left office. In response, Biden’s team claimed the candidate had simply misspoken and pivoted to attacking the media for pushing it’s own “narrative” around the gaffes. “This is a press narrative, not a voter narrative,” Biden’s spokeswoman, Symone Sanders, asserted during an appearance on MSNBC. Sanders even went to the extent of lecturing the media on what it should and should not prioritize to “elevate the conversation” surrounding the election. “We cannot allow this election to devolve in a tit for tat over name-calling and ‘gaffes,’ something that does not matter,” she said. That argument, however, did not appear to sway many, including some of the left’s most venerated journalists. Some, like Jamil Smith, a senior writer for Rolling Stone magazine, have even called on the former vice president’s campaign to “step forward” and explain “what is going on with him.”  In the last week alone, such suggestions have flourished as Biden’s campaign struggles to dismiss controversy surrounding his fabrication of an emotional story about the war in Afghanistan. The controversy began when Biden told a story to more than 400 New Hampshire voters last month about how he was asked to travel to Afghanistan to honor a Navy captain during his tenure as vice president. As Biden recollected, he was asked by a four star general to travel to Kunar province in Afghanistan — “a dangerous foray into ‘godforsaken country’” — to honor an officer that “rappelled down a 60-foot ravine under fire and retrieved the body” of a fallen comrade. When some suggested it might be too dangerous to send a sitting vice president into a war zone, Biden brushed away concerns for his own safety. “We can lose a vice president,” he claimed to have said in response to such worries. “We can’t lose many more of these kids. Not a joke.” Apart from Biden supposedly putting his own life in jeopardy, the story was made more complicated as the officer in question did not want the honor being bestowed by his superiors. According to Biden, the captain was refusing the medal, a Silver Star, because he felt like a “failure” because the comrade he was attempting to save died during the mission. “He said, ‘Sir, I don’t want the damn thing!’” Biden, his jaw clenched and nearly shouting, relayed to the audience in New Hampshire. “’Do not pin it on me, Sir! Please, Sir. Do not do that! He died. He died!’” Biden’s emotional telling of the story left those in the audience “silent” and visibly moved. Unfortunately for the former vice president, though, The Washington Post found “almost every detail of the story” to be “incorrect” upon closer investigation. Biden visited Kunar province in 2008 as a U.S. senator, not as vice president. The service member who performed the celebrated rescue that Biden described was a 20-year-old Army specialist, not a much older Navy captain. And that soldier, Kyle J. White, never had a Silver Star, or any other medal, pinned on him by Biden. At a White House ceremony six years after Biden’s visit, White stood at attention as President Barack Obama placed a Medal of Honor, the nation’s highest award for valor, around his neck. In fact, the paper concluded that Biden had conflated three separate stories, including one in which he actually “did pin a medal on a heartbroken soldier, Army Staff Sgt. Chad Workman, who didn’t believe he deserved the award.” “In the space of three minutes, Biden got the time period, the location, the heroic act, the type of medal, the military branch and the rank of the recipient wrong, as well as his own role in the ceremony,” the Post reported. Upon the story breaking, Biden’s team immediately sought to downplay and dismiss the controversy. Biden, himself, asserted the central points of his story were accurate, even if the details were not. He even went to  claim details are not an important part within the confines of the presidency. “The details are irrelevant in terms of decision-making,” Biden explained to NPR this past week when asked if his fuzziness with specifics was problematic for anyone aspiring to be commander in chief. All of this has left Biden’s surrogates and allies wondering if the former vice president would be benefited by fewer public appearances and less speaking time on the stump. “I think Vice President Biden needs to speak less, and listen more, and let people talk,” Iowa State Senator Tony Bisignano, one of the former vice president’s top backers, told Politico on Friday.",
      "date": "7 Sep 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Breitbart",
      "url": "https://www.breitbart.com/",
      "subtitle": "null",
      "author": "Hannah Bleau",
      "content": "                                 ",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Nolte: Spastic Beto O’Rourke Is No Barack Obama",
      "url": "https://www.breitbart.com/politics/2019/03/14/nolte-spastic-beto-orourke-is-no-barack-obama/",
      "subtitle": "Yes, Barack Obama stutters a lot. Yes, Barack Obama wears mom jeans. But the primary reason Barack Obama served two terms as president was his poise, his cool.",
      "author": "John Nolte",
      "content": " History is already revealing him to be one of the worst presidents in history, certainly in my lifetime (and I lived through the Carter years), but that he was a brilliant politician is not in doubt. I’ll never forget the moment I knew Obama would be president. It was right after his Republican rival, Sen. John McCain, lost his ever-loving mind and quit the presidential campaign to go and save the economy. Immediately after McCain jumped on his white horse with nowhere to go, Obama called a press conference. But Obama was cool, you see. In his remarks, he said nothing about McCain. Then he opened things up for questions knowing McCain’s madness would be the first question, and it was, and this is when Obama dropped the nuke: “I think it is going to be part of the president’s job to be able to deal with more than one thing at once.’’ That’s how you win presidential elections. Obama did the same thing to Romney; time and again and again, Obama and his campaign emasculated the former Massachusetts governor. Romney almost constantly allowed himself to be on defense, to look weak and in a crouch. And whenever Romney tried to launch an offensive, he sounded shrill and desperate. Obama was a godawful president, but he played the role of president brilliantly. No question. Now watch the fake Hispanic Beto O’Rourke launch his presidential campaign. The guy’s a spaz, and how awkward is it watching his heiress wife count Beto’s ear hairs:  More spaz-o-rama:  Forget about the drivel coming out of his mouth and watch him: watch Beto’s body language, listen to the world salad… Obama always came off as calm, collected, No Drama Obama. O’Rourke behaves like a male cheerleader at a college game. He’s the ultimate beta male. And just so no one can accuse me of political bias, Marco Rubio had much of the same problem in 2016. Believe it or not, becoming president has nothing to do with policy, experience, or character or any of that stuff… Those things are addressed in the primaries. Sure, there are partisans on both sides who will vote for their guy no matter what, but it is still the 15 to 25 percent of the unaffiliated who choose our president — and going back to John F. Kennedy, to 1960 when television took over the messaging of political campaigns, it is the alpha male who has always won the presidency. By the way, this doesn’t mean a woman can’t become president. “Alpha male” is a figure of speech, shorthand for the poise, command, unflappable, and in charge. Hillary probably would have stomped all over Rubio or John Kasich. Her problem was that Donald Trump beat her soundly in that facet of the campaign. Don’t confuse this observation with a 2020 prediction, an election that will almost certainly be decided in the same way all presidential re-election campaigns are decided — on the state of the economy. If we hit a recession next year, Boy George could probably beat Trump. What’s more, O’Rourke could toughen up during the primary, work on his presentation… My only point is that this worshipful comparing O’Rourke to Obama is a more than a tad delusional right now. Yes, they share some of the same qualities, but the key one, the one that wins all the marbles is, to say the least, lacking. Obama was many things, but he was no spaz. Beto is a total spaz.  Follow John Nolte on Twitter @NolteNC. Follow his Facebook Page here.",
      "date": "14 Mar 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Joe Biden Refers to ‘Buddy’ Barack Obama Seven Times in 1/2 Hour Speech",
      "url": "https://www.breitbart.com/politics/2019/05/06/jjoe-biden-refers-to-buddy-barack-obama-seven-times-in-1-2-hour-speech/",
      "subtitle": "Former Vice President Joe Biden leaned heavily on the legacy of his old running mate, President Barack Obama, during a campaign appearance on Saturday.",
      "author": "Charlie Spiering",
      "content": " Prior to the rally, the campaign aired a video of Obama praising Biden in 2017 and awarding his own vice president a Presidential Medal of Freedom. “I heard you playing the tape of my buddy,” Biden said, speaking to the audience in Columbia, South Carolina, and apologized, “My buddy… I shouldn’t be so casual — President of the United States Barack Obama!” During his campaign speech, Biden recalled the 2015 racist church shooting in South Carolina, when Obama attended the funeral and sang “Amazing Grace” to the congregation. “I watched my buddy Barack stand up there, I watched him talk, and he talked about we have to find that Amazing Grace,” Biden said, Biden also referred to Obama’s Charleston eulogy for the slain, as he spoke about employment discrimination. “As Barack says, when two equally qualified people, one Jamal and one John, they both apply for a job, and John gets the job?” he said. “That’s the reality in America.” Biden reminded supporters that he and President Obama were the ones who passed Obamacare, as he talked about the continuing struggle for affordable health care. “How can you maintain your dignity when you look over at your child and he needs health care and he has a preexisting condition?” he asked. “You couldn’t afford it before Barack and I wrote … Barack passed the Affordable Care Act.” Biden also reminded the audience that he complimented Obama for passing Obamacare in 2010, alluding to the moment that he was caught on a hot mic calling it a “big f-ing deal.” “I know I complimented the president when I, when we passed the Affordable Care Act, I said this is a big deal or something to that effect,” he said as the crowd laughed. Biden also spoke about cutting short his plans to run for president in 2016, despite the difficulty of watching his son Beau die of cancer. “Only person I could confide in was my friend – and he is my friend – Barack Obama, I told him about everything that was going on, because I knew I could trust him completely,” he said. At another point in his speech, Biden interrupted his campaign message with more praise for Obama. “By the way, he’s a hell of a guy, I worked with him for eight years, I watched him, he has enormous integrity, and nobody I’ve ever worked with was smarter, and he is a decent, decent, decent man,” Biden said. “And folks, I think he was one of the best presidents we’ve ever, ever had.”",
      "date": "6 May 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Barack Obama: The United States Was ‘Founded on Inequality’",
      "url": "https://www.breitbart.com/politics/2019/05/31/barack-obama-the-united-states-was-founded-on-inequality/",
      "subtitle": "Barack Obama asserted that the United States was founded on inequality, despite the Constitution enshrining equality into the law.",
      "author": "Charlie Spiering",
      "content": " Obama said: You know Brazil just thinks the United States was founded on inequality and we have to admit that even though the United States has a Constitution that says, ‘We hold these truths to be self-evident, that all men are created equal,’ At that time not only were blacks excluded, but women were excluded, and people who didn’t own property were excluded. Obama commented on his understanding of the founding of the United States during the VTEXDAY 2019 conference in Sao Paulo, Brazil on Wednesday. Obama said that the Constitution gave America the means of inclusion through Democracy. “The more people we included, the more successful we became,” he said. Obama used a basketball analogy to illustrate his point, pointing out that the NBA was better than ever by including more international players like Giannis Antetokounmpo, a Nigerian from Greece who plays for the Milwaukee Bucks. “Now he’s one of the best players in the world,” Obama said, pointing out that if the NBA did not include international players, they were leaving talent on the field. “If you don’t include women, you are leaving talent on the field,” Obama said, saying it was in every country’s interest to “include everyone.” He admitted that “perfect equality” was difficult to achieve, because of natural talent and work ethic. “The issue is not perfect equality, the issue is, are those of us who are successful willing to give back enough to provide a ladder of opportunity for others that are coming behind us,” he said. Obama continued with a discussion about the wealthy, asserting after a family obtained enough money to eat, buy a house, send their kids to college, and take a vacation once in a while, additional financial wealth would not make people happy. He acknowledged that he now had more money than he ever had in his life, and claimed he could not spend it all if he tried. “It’s not money that is making me happy, but we teach ourselves that our measure of success is the more we have, the harder we hang onto it, the better we must be, the higher our status is,” he said. Obama said that the concept of wealth and status in the United States was what made societies less equal. “We have to redesign our minds to say that we’re at our most powerful and influential when we’re able to help others,” he concluded. Obama clarified that he still supported the concept of capitalism but called for a “revolution of values” to create a better, more equal society that was more environmentally stable. “It’s not going to do us much good to have really wonderful apps and great virtual reality when the actual reality of the planet is getting hotter, and the oceans are rising, and the forests are getting cut down, and we can’t breathe,” he said.",
      "date": "31 May 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "2020 Democrat Candidates Rip Former President Barack Obama’s Record",
      "url": "https://www.breitbart.com/politics/2019/07/31/2020-dem-candidates-rip-barack-obama-record/",
      "subtitle": "Democrats challenged former Vice President Joe Biden during CNN’s Democrat presidential debate on Wednesday, but in the process, they criticized former President Obama.",
      "author": "Charlie Spiering",
      "content": " Democrats like New York City Mayor Bill de Blasio criticized Democrats for continuing to support the concept of private insurance. “There’s this mythology that somehow all of these folks are in love with their insurance in America,” he said. Obama’s former secretary for the Department of Housing and Urban Development (HUD) Julian Castro criticized Obama’s former Department of Homeland Secretary, saying that his concern about decriminalizing crossing the border illegally was merely a “right-wing talking point.” He also criticized the Obama administration for high rates of deportation of illegal immigrants, challenging Joe Biden for failing to intervene. De Blasio also pressed Biden on why he did not advise Obama to slow deportation during the administration. “Did you say those deportations were a good idea or did you go to the president and say, ‘this is a mistake, we shouldn’t do it,'” he said. “Which one?” Biden defended Obama for trying to pass comprehensive immigration reform but vowed that he would “absolutely not” resume similar deportation rates as the Obama administration. Castro also joined the criticism of the Obama administration, suggesting that the former president had made mistakes in office. “First of all, Mr. Vice President, it looks like one of us has learned the lessons of the past and one of us hasn’t,” he said to Biden. Biden reminded Castro that he also served in the Obama administration. “I never heard him talk about any of this when he was the secretary,” he said pointedly. But even Biden found himself implicitly criticizing Obama’s proposed Trans-Pacific Partnership (TPP) deal, which Trump killed, when asked if he would rejoin the proposed trade agreement with Asian nations. “I would not rejoin the TPP as it was initially put forward,” he said. Biden also criticized the surge of troops in Afghanistan, which took place in 2009 under President Obama. “I opposed the surge in Afghanistan,” he said, adding that he felt going into Afghanistan was a mistake. Congresswoman Tulsi Gabbard also criticized both parties for allowing the war in Afghanistan to continue. “For too long, we’ve had leaders who have been arbitrating foreign policy from ivory towers in Washington without any idea about the cost and the consequence, the toll that it takes on our service members, on their families,” she said. Ultimately, Biden reminded his political rivals that Obama was the one that chose him as the vice president. “Everybody is talking about how terrible I am on these issues. Barack Obama knew exactly who I was,” he said, noting that he was fully vetted as vice president. “He chose me, and he said it was the best decision he made. I’ll take his judgment.” After the debate, Obama’s former Attorney General Eric Holder cautioned Democrats for their attacks against the Obama administration. “To my fellow Democrats. Be wary of attacking the Obama record,” he wrote on Twitter. “Build on it. Expand it. But there is little to be gained – for you or the party – by attacking a very successful and still popular Democratic President.” ",
      "date": "31 Jul 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Barack Obama Blames Donald Trump, Guns, ‘White Supremacist’ Websites for Mass Shootings",
      "url": "https://www.breitbart.com/politics/2019/08/05/barack-obama-blames-donald-trump-guns-white-supremacist-websites-mass-shootings/",
      "subtitle": "Former President Barack Obama delivered a lengthy response to the dual mass shootings that killed 31 people in Texas and Ohio over the weekend. He blamed guns, white supremacist websites, and President Donald Trump’s rhetoric for the ongoing violence in the United States.",
      "author": "Charlie Spiering",
      "content": " In a message shared on Twitter, the former president specifically called for more gun control to help prevent more mass shootings. “Until all of us stand up and insist on holding public officials accountable for changing our gun laws, these tragedies will keep happening,” Obama said in a statement, citing “evidence” that proved that more gun control could stop “some killings.” Obama lamented that “no other nation on Earth” experienced the level of gun violence the United States does. The former president also called for more censorship of “white nationalist websites” to prevent radicalization. Down Range with AWR Hawkins.  Sign up today! “[T]here are indications that the El Paso shooting follows a dangerous trend: troubled individuals who embrace racist ideologies and see themselves obligated to act violently to preserve white supremacy,” he wrote. He compared the radicalization of white nationalists to that of followers of Islamic State (ISIS) terrorists. “That means that both law enforcement agencies and internet platforms need to come up with better strategies to reduce the influence of these hate groups,” he wrote. While Obama did not cite President Trump’s rhetoric specifically, he called Americans to “soundly reject language coming out of the mouths of any of our leaders that feeds a climate of fear and hatred or normalizes racist sentiments.” He also criticized rhetoric meant to “demonize those who don’t look like us” or suggest that immigrants were “sub-human” or threatened the American way of life. Obama indicated that rhetoric, such as the kind Trump voiced, was the root of the worst moments in human history — citing Jim Crow laws, the Holocaust, Rwanda Genocide, and ethnic cleansing in the Balkans. “It has no place in our politics and our public life,” he wrote. “And it’s time for the overwhelming majority of Americans of goodwill, of every race and faith and political party, to say as much — clearly and unequivocally.” The president also shared a link to a Vox.com article calling for a bold plan to enact gun control:",
      "date": "5 Aug 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Barack and Michelle Obama Named Among Hollywood’s Most Powerful People",
      "url": "https://www.breitbart.com/entertainment/2019/10/16/barack-and-michelle-obama-named-among-hollywoods-most-powerful-people/",
      "subtitle": "Barack and Michelle Obama have been named for the first time among Hollywood’s most powerful people in the annual 100 list published by The Hollywood Reporter.",
      "author": "David Ng",
      "content": " The former first couple was listed alongside such entertainment titans (and friends) as Walt Disney Company chairman and CEO Bob Iger and Netflix honchos Reed Hastings and Ted Sarandos. The Obama’s signed a lucrative deal with Netflix last year to create and distribute documentaries and other content between the streamer and the couple’s production company, Higher Ground. The documentary American Factory — about a Chinese billionaire who opens a factory in an abandoned General Motors plant in Ohio — debuted on Netflix in August, and was recently nominated for a Critic’s Choice Award.  Other Obama Netflix projects under the partnership include a planned docuseries based on Michael Lewis’ The Fifth Risk: Undoing Democracy, which is critical of President Donald Trump’s administration. The Hollywood Reporter ranked the Obamas’ in 50th place, just behind Star Wars producer Kathleen Kennedy. The couple outranked such celebrities as Brad Pitt, Scarlett Johansson, and Kevin Hart. “Who wouldn’t take their call?” the Reporter said in its ranking of the Obamas, citing the Netflix partnership and a series of podcasts under a new deal with Spotify. Iger ranked No. 1 in the annual list, with Netflix’s Hastings and Sarandos coming in No. 2 — the same spots they held in last year’s ranking. Follow David Ng on Twitter @HeyItsDavidNg. Have a tip? Contact me at dng@breitbart.com",
      "date": "16 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Barack Obama Swipes at Donald Trump Habit of Watching TV and Social Media",
      "url": "https://www.breitbart.com/politics/2019/09/19/barack-obama-swipes-at-donald-trump-habit-of-watching-tv-and-social-media/",
      "subtitle": "Former President Barack Obama implicitly criticized President Donald Trump’s media habits in a speech on Wednesday.",
      "author": "Charlie Spiering",
      "content": " During a Splunk tech conference, Obama said it was helpful as president to have a diverse staff offering a wide range of advice on the issues of the day. “The other thing that is helpful is not watching TV or reading social media,” he added pointedly, according to Axios. He warned about people living in “filter bubbles” of information, made worse by social media. “That’s not healthy for a democracy and it’s not healthy between countries,” he said. “That’s how wars get started and bad things happen.” Obama had a history of purposefully ignoring cable news during his presidency. During an off-the-record conversation with prominent newspaper columnists, Obama let it slip that he “doesn’t watch TV” and “doesn’t watch cable news,” a comment that leaked to the media. In an interview with MSNBC’s Brian Williams, Obama criticized cable news for appearing fake. “I don’t find most of the cable chatter very persuasive,” he said. “I’ve used this analogy before. It feels like WWF wrestling. You know, everybody’s got their role to play.” White House staff at the time suggested that the former president was particularly frustrated during the campaign. “You had primarily donors but others, too, who would get fixated by cable and get freaked out and start calling,” former press secretary Robert Gibbs told Politico in 2009.",
      "date": "19 Sep 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Poll: College Students Say Barack Obama Is the Best President in American History",
      "url": "https://www.breitbart.com/tech/2019/08/02/poll-college-students-say-barack-obama-is-the-best-president-in-american-history/",
      "subtitle": "A new poll revealed that college students believe that Barack Obama was the best president in United States history. The 22 percent of Students choosing Obama doubled the votes for George Washington.",
      "author": "Tom Ciccotta",
      "content": " According to a new poll by College Pulse, American college students think that Barack Obama is the greatest president in American history. Of the 8,111 college students that participated in the poll, 22 percent of respondents picked Barack Obama as the ‘best U.S. President in history.” The poll, which was highlighted this week by Campus Reform, offered some other surprising results. Popular President Ronald Reagan only received seven percent of the total votes. President Donald Trump received six percent of the vote. With 22 percent of the votes, Barack Obama received almost twice as many votes as George Washington and almost four times as many votes as John F. Kennedy. Doug Bandow, a senior fellow at the Cato Institute and former special assistant to President Ronald Reagan, told Campus Reform that Obama’s popularity with college students is due, at least in part, to their familiarity with the 44th president. “People are best able to judge politicians with whom they are familiar,” Bandow said in a brief comment. “Obama was an attractive personality and path-breaking president. He would look like the obvious choice for a lot of folks of university age if they weren’t policy geeks focused on issues where they disagreed with his approach.” Stay tuned to Breitbart News for more campus trends.",
      "date": "2 Aug 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Barack Obama Launches ‘Redistricting U’ Campaign for ‘Fair Maps’",
      "url": "https://www.breitbart.com/politics/2019/08/27/barack-obama-launches-initiative-to-shape-redistricting-efforts/",
      "subtitle": "Former President Barack Obama on Monday unveiled a new initiative to influence redistricting efforts across the United States.",
      "author": "Joshua Caplan",
      "content": " The initiative, Redistricting U, will send activists to provide free training and tools to volunteers involved in redistricting efforts and guide groups on how to “be leaders in the movement for fair maps.” “Training is at the heart of organizing. It’s why I’ve always made it a priority – from my 2008 campaign until now,” Obama wrote in a tweet announcing Redistricting U, which is part of the All On The Line campaign. In February, Obama’s Organizing For Action and former Attorney General Eric Holder’s National Redistricting Action Fund joined forces to create the All On The Line campaign — aimed at thwarting the use of so-called gerrymandering across the country.  “The movement for fair maps will determine the course of progress on every issue we care about for the next decade,” Obama said. “And we can’t wait to begin organizing when the redistricting process starts in 2021. We need to build this movement from the ground up – right now.” “The movement for fair maps will determine the course of progress on every issue we care about for the next decade. And we can’t wait to begin organizing when the redistricting process starts in 2021. We need to build this movement from the ground up — right now,” Obama said in a statement on the initiative’s website. “It’s why I made it a priority in my 2008 campaign and throughout our larger movement for change in the years since,” the former president added. The initiative is part of a larger push by the Obamas for voting reform. In 2018, former first lady Michelle Obama created the When We All Vote initiative aimed at increasing voter turnout across the country.",
      "date": "27 Aug 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Book: Barack Obama Does Not Want to Endorse ‘Just Another White Guy’ Joe Biden",
      "url": "https://www.breitbart.com/politics/2019/09/30/book-barack-obama-does-not-endorse-another-white-guy-joe-biden/",
      "subtitle": "Former President Barack Obama did not endorse former Vice President Joe Biden for president, according to a new book, because he did not represent the appropriate level of change that he hoped his presidential legacy would represent.",
      "author": "Charlie Spiering",
      "content": " A new book claims that Obama endorsed former Secretary of State Hillary Clinton instead of Biden in 2016 because he was “just another white guy.” “Joe, despite his many virtues, was just another white guy, one in a long line of American presidents — hardly the symbol of the Teutonic change that Obama hoped would mark his place in the history books,” wrote author Steven Levingston in a new book, according to the Daily Mail. Levingston is the nonfiction editor of the Washington Post, and has authored books about former President John F. Kennedy. His new book, Barack and Joe: The Making of an Extraordinary Partnership is scheduled for release on October 8. “Barack had placed his bet on Hillary, the one he believed would confirm his revolutionary stamp on American’s political culture – the first black president passing the baton to the first woman president,” he wrote. The book notes that Obama did not endorse Biden for president in 2020 either, marking a blow to his former vice president who routinely cites Obama’s legacy on the campaign trail. Biden was also stung by the fact that Obama was meeting with potential presidential candidates such as former Rep. Robert Francis “Beto” O’Rourke, according to Livingston. The New York Times also reported in August that Obama told Biden, “You don’t have to do this, Joe,” referring to a conversation he had with his former vice president, and asked Biden’s aids to not let the former vice president embarrass himself. The book also details an anecdote about Obama as a newly elected senator emailing one of his advisers, “Shoot. Me. Now.” as Biden droned on during a speech.",
      "date": "30 Sep 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Barack Obama Endorses Justin Trudeau Despite Blackface Scandal",
      "url": "https://www.breitbart.com/politics/2019/10/16/barack-obama-endorses-justin-trudeau-despite-blackface-scandal/",
      "subtitle": "Former President Barack Obama sparked surprise when he endorsed Canadian Prime Minister Justin Trudeau on Wednesday on Twitter.",
      "author": "Charlie Spiering",
      "content": " Obama indicated that Trudeau was the progressive leader of the world in his endorsement. “The world needs his progressive leadership now, and I hope our neighbors to the north support him for another term,” he wrote on Twitter. The most famous African-American politician did not mention Trudeau’s blackface scandal that threatened to crater his chances at re-election. “I was proud to work with Justin Trudeau as President,” Obama continued. “He’s a hard-working, effective leader who takes on big issues like climate change.” Obama’s endorsement was also surprising because of his decision to engage in international politics, choosing to meddle in a foreign election. More pointedly, Obama has not endorsed his former vice president, Joe Biden, in his presidential race. Trudeau and Obama got along well during their brief time together, before the former president left office. “The first call I made to him, I said, ‘Justin, congratulations. You and your family look great. I know Canadians are incredibly inspired by your message of hope and change,’” Obama said when they met in 2015. ",
      "date": "16 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Barack Obama",
      "url": "https://www.breitbart.com/tag/barack-obama/",
      "subtitle": "null",
      "author": "Edwin Mora",
      "content": "                             ",
      "date": "18 Oct 2019, 3:07 PM PDT",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    }
  ]
}