{
  "articles": [
    {
      "title": "Alexandria Ocasio-Cortez Declares War on White, Moderate Democrats",
      "url": "https://www.breitbart.com/politics/2018/11/18/alexandria-ocasio-cortez-declares-war-on-white-moderate-democrats/",
      "subtitle": "Alexandria Ocasio-Cortez backed an effort Saturday by a group called the Justice Democrats, which opposes “Democratic incumbents who are demographically and ideologically out-of-touch with their districts.”",
      "author": "Joel B. Pollak",
      "content": " The Justice Democrats helped Ocasio-Cortez oust veteran Rep. Joe Crowley (D-NY) in a primary in New York’s 14th congressional district earlier this year. In a tweet, she supported the Justice Democrats’ new “#OurTime” campaign:  Since winning her election Nov. 6, Ocasio-Cortez has continued to challenge the Democratic Party leadership, joining a sit-in protest in the office of House Minority Leader Nancy Pelosi (D-CA) over climate change policy. Though she has not yet taken office, Ocasio-Cortez is already committing to replacing many of her colleagues — apparently on the basis of race and ideology. A press release from the Justice Democrats declared (original emphasis): After participating in sit-ins at Nancy Pelosi’s office on Tuesday, Justice Democrats officially launched the #OurTime project to repeat the organization’s success in recruiting and electing Congresswoman-elect Alexandria Ocasio-Cortez. The progressive grassroots organization will recruit the next generation of primary challengers to Democratic incumbents who are demographically and ideologically out-of-touch with their districts. The online conference call where the project was announced was joined by Ocasio-Cortez, who voiced her support for the project. “We recruited and supported Ocasio-Cortez all the way to a historic victory and now we’re going to repeat the playbook,” said Justice Democrats Executive Director Alexandra Rojas. “There’s lots of blue districts in this country where communities want to support a new generation of diverse working-class leaders who fight tirelessly for their voters and build a movement around big solutions to our country’s biggest problems. We’re creating an alternative pathway to Congress for grassroots candidates to become leaders in the Democratic Party.” The #OurTime project is a grassroots candidate recruitment effort asking Democrats and progressives around the country to submit nominees for both potential candidates and districts where an Alexandria Ocasio-Cortez-style campaign might succeed. The organization will prioritize candidates who are women, represent the diversity of communities in their district, and support the major tenets of Justice Democrats platform: rejecting corporate PAC donations, Medicare For All, free college, dismantling mass incarceration and deportations, and a Green New Deal. Others backing the campaign include Palestinian American Representative-elect Rashida Tlaib (D-MI), whose views are so hostile to Israel that even the left-wing J Street organization withdrew its support for her campaign. Joel B. Pollak is Senior Editor-at-Large at Breitbart News. He is a winner of the 2018 Robert Novak Journalism Alumni Fellowship. He is also the co-author of How Trump Won: The Inside Story of a Revolution, which is available from Regnery. Follow him on Twitter at @joelpollak.",
      "date": "18 Nov 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez Rants About Socialism and the End of the World",
      "url": "https://www.breitbart.com/politics/2019/02/24/alexandria-ocasio-cortez-rants-about-socialism-and-the-end-of-the-world-again/",
      "subtitle": "Rep. Alexandria Ocasio-Cortez (D-NY) took to Instagram live on Sunday evening from her kitchen in her Bronx apartment to rant about the Green New Deal, socialism, Sen. Diane Feinstein (D-CA), and the end of the world.",
      "author": "Joel B. Pollak",
      "content": " In a series of clips preserved on Twitter, the first-year representative blasted her critics and said the world only had “one shot” left to prevent total destruction. “AOC” ranted about plastic bags — “I wish they didn’t exist” — before pouring herself some wine: Socialist @AOC mulls banning plastic bags, since she wishes they don’t exist, and pours herself a glass of wine. pic.twitter.com/vKaO0uFHY4 — Gob Abierto (@GobAbiertoBOL) February 25, 2019  As she peeled sweet potatoes, she offered a “special hello to my haters,” noting that she had received death threats, and complaining that people feel “entitled to very private and personal information about me that they don’t ask for from other people”: Count how many times Socialist @AOC says “like” in this two minute commentary where she shares that she has moved apartments due to death threats (and wanting a second bedroom). Recall, this is an elected official. pic.twitter.com/ffEyX2Kalf — Gob Abierto (@GobAbiertoBOL) February 25, 2019  “The whole premise of the Green New Deal is that we’re screwed on climate,” she said. “At this point, we don’t even have to prove it — just walk outside in winter in a lot of places, and it’s either way worse than you’re used to, or way warmer than you’re used to.” Socialist @AOC describes the #GreenNewDeal and tells us if we don’t pass it we’re all screwed and all going to die. pic.twitter.com/MkUl2aG3x6 — Gob Abierto (@GobAbiertoBOL) February 25, 2019  She predicted that the planet would face “disaster if we don’t turn this ship around,” claimed there was a “scientific consensus” that “the lives of children are going to be very difficult,” and said that young people were wondering, as a result, “Is it OK to still have children?” AOC also bashed Sen. Feinstein, who was confronted by a group of children (and their adult activist chaperones) about the Green New Deal last week. It was “not good enough,” she said, to tell people “I’ve been working on this for X amount of years.” She rejected “watered-down proposals that are, frankly, going to kill us,” an apparent reference to Feinstein’s own climate change policies. Socialist @AOC discusses how people should reconsider having children due to global warming, and reminds us that we are all going to *literally* die if the Green New Deal doesn’t pass. She also takes some shots at Dianne Feinstein. *Sidenote: She failed to compost her potatoes* pic.twitter.com/6eWhbTbqqB — Gob Abierto (@GobAbiertoBOL) February 25, 2019  She scoffed at the idea that “working on an issue for 30 years, alone … makes someone qualified to solve an issue.” She said that people who had proposed more “ambitious solutions” had “not been listened to.” A carbon tax, she said, would not be enough to solve the problem: “If you think that a carbon tax alone, and no other intervention, is going to fix climate change, you’re part of the problem.” We have “one shot,” she said, because “people didn’t try” to solve the problem for decades before. “And now people are dying — in the thousands,” she claimed. Socialist @AOC eviscerates @SenFeinstein and calls her a political coward. This is wild. pic.twitter.com/ZQQw7Ibixh — Gob Abierto (@GobAbiertoBOL) February 25, 2019  She bashed “climate delayers”:  Ocasio-Cortez also defended her “Green New Deal” by noting that it “isn’t even a binding bill.” She called opposition to the bill “reprehensible,” and claimed critics were funded by the fossil fuel industry. .@AOC tries to sell her #GreenNewDeal by saying “if it passes, nothing will even happen.” That’s how you know it’s a steaming pile of manure. pic.twitter.com/6aNaEbmEEX — Gob Abierto (@GobAbiertoBOL) February 25, 2019  In addition, AOC rejected the idea of evaluating the crisis in Venezuela as a problem with socialism. Instead, she said, it was “kind of an issue of authoritarianism versus democracy.” It would be just as illogical, she said, for people to point to “Zimbabwe or … other failed states that use capitalist frameworks” as proof of the failure of capitalism. (Zimbabwe’s ruling party and its recently-ousted dictator, Robert Mugabe, defined themselves as socialist.) Socialist @AOC discusses Venezuela. She says that it has nothing do with socialism but rather is a failure of authoritarianism. She then bizarrely goes on an inane rant citing Zimbabwe as an example of failed capitalism. The poor potato she is cutting could be more coherent. pic.twitter.com/IHW8r6pCZS — Gob Abierto (@GobAbiertoBOL) February 25, 2019  The original full Instagram video is not yet available online. Joel B. Pollak is Senior Editor-at-Large at Breitbart News. He is a winner of the 2018 Robert Novak Journalism Alumni Fellowship. He is also the co-author of How Trump Won: The Inside Story of a Revolution, which is available from Regnery. Follow him on Twitter at @joelpollak.",
      "date": "24 Feb 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez: Call Her ‘Latinx’",
      "url": "https://www.breitbart.com/politics/2018/06/27/alexandria-ocasio-cortez-call-her-latinx/",
      "subtitle": "Alexandria Ocasio-Cortez is proud of her roots — but don’t call her a Latina: she prefers the gender-neutral pronoun “Latinx.”",
      "author": "Joel B. Pollak",
      "content": " The 28-year-old democratic socialist upset House Democratic Caucus chair Joe Crowley (D-NY) in the New York primary on Tuesday. “Latinx,” as HuffPost explained in 2016, is the new, progressive way to refer to people of Latin American descent, replacing the traditional -o or -a for male or female, respectively” (original links): Latinx is the gender-neutral alternative to Latino, Latina and even Latin@. Used by scholars, activists and an increasing number of journalists, Latinx is quickly gaining popularity among the general public. It’s part of a “linguistic revolution” that aims to move beyond gender binaries and is inclusive of the intersecting identities of Latin American descendants. In addition to men and women from all racial backgrounds, Latinx also makes room for people who are trans, queer, agender, non-binary, gender non-conforming or gender fluid. According to Google Trends data cited by HuffPost, the term was virtually unknown in Internet searches before 2016. Ocasio-Cortez is a big fan of the term, judging from her Twitter feed:       It is not clear whether Ocasio-Cortez herself identifies as gender-neutral. If so, she could become the first gender-neutral member of Congress, should she win the general election in November. Joel B. Pollak is Senior Editor-at-Large at Breitbart News. He is a winner of the 2018 Robert Novak Journalism Alumni Fellowship. He is also the co-author of How Trump Won: The Inside Story of a Revolution, which is available from Regnery. Follow him on Twitter at @joelpollak.",
      "date": "27 Jun 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez Demands ‘Answers’ After Jeffrey Epstein Found Dead in Jail",
      "url": "https://www.breitbart.com/crime/2019/08/10/alexandria-ocasio-cortez-demands-answers-epstein-found-dead-jail/",
      "subtitle": "Rep. Alexandria Ocasio-Cortez (D-NY) demanded answers Saturday after disgraced billionaire Jeffrey Epstein was found dead in a Manhattan jail cell from suspected suicide.",
      "author": "Katherine Rodriguez",
      "content": " We need answers. Lots of them.https://t.co/4DMckiZnVB — Alexandria Ocasio-Cortez (@AOC) August 10, 2019  “We need answers. Lots of them,” Ocasio-Cortez, a member of the House Oversight and Reform Committee, tweeted Saturday. Epstein’s body was found in his jail cell at the Metropolitan Correctional Center (MCC) around 7:30 a.m. Saturday, according to multiple reports. He reportedly died after hanging himself in his jail cell, despite being on suicide watch, the New York Times and ABC News reported. The disgraced billionaire had been accused in July of multiple sex trafficking charges. The news of Epstein’s suspected suicide comes weeks after prison officials found him unconscious in his jail cell with marks around his neck, indicating a possible suicide attempt. Epstein’s death also follows a move by the U.S. Attorney’s Office for the Southern District of New York Friday to unseal thousands of documents related to Epstein’s case. The documents alleged some of the inner workings of the operation, “in which Virginia Roberts Guiffre [sic] … said Epstein forced her to have sex with powerful men, including former Maine Sen. George Mitchell, former New Mexico Gov. Bill Richardson and Prince Andrew,” Fox Business reported.",
      "date": "10 Aug 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez’s Chief of Staff, Comms Director Depart",
      "url": "https://www.breitbart.com/politics/2019/08/02/alexandria-ocasio-cortezs-chief-of-staff-comms-director-depart/",
      "subtitle": "Rep. Alexandria Ocasio-Cortez’s (D-NY) chief of staff and her communications director have announced plans to depart.",
      "author": "Haris Alic",
      "content": " The Intercept reported on Friday that Saikat Chakrabarti, the congresswoman’s chief of staff since January, and Corbin Trent, her communications director, would be leaving her congressional office in the next few weeks. Chakrabarti, who masterminded Ocasio-Cortez’s election to Congress, is heading to New Consensus, a nonprofit working to bolster the Green New Deal and other climate change initiatives. The congresswoman’s office said in a statement: Saikat has decided to leave … to work with New Consensus to further develop plans for a Green New Deal. We are extraordinarily grateful for his service to advance a bold agenda …  Saikat’s goal has always been to do whatever he can to help the larger progressive movement, and we look forward to continuing working with him to do just that. Trent, on the other hand, is transitioning to Ocasio-Cortez’s reelection campaign, which has elicited a number of high-profile challengers. “With the Ocasio 2020 campaign beginning to ramp up, I’ve asked Corbin to transition to the campaign full-time and he has agreed to do so,” Ocasio-Cortez told The Intercept. “I’m looking forward to growing the movement with him in Queens and the Bronx and across the country.” The shakeup comes as the congresswoman’s office has been engulfed in controversy since Chakrabarti attacked more moderate members of the House majority. In June, Chakrabarti took to social media to air his frustration with moderate Democrats for forcing Speaker Nancy Pelosi (D-CA) to abandon a $4.6 billion emergency border appropriation bill favored by progressives. In a series of tweets, Chakrabarti likened the moderates to old Southern Democrats, many of whom were avowed segregationists. He stood by the comparison even when a progressive activist noted Rep. Sharice Davids (D-KS), the first openly LGBT Native American woman elected to Congress, was one of the moderates that wavered on the bill. “I think the point still stands. I don’t think people have to be personally racist to enable a racist system. And the same could even be said of the Southern Democrats,” Chakrabarti said in a now deleted follow-up tweet. “I don’t believe Sharice is a racist person, but her votes are showing her to enable a racist system.” Although Breitbart News reported on the controversial comments at the time, neither Ocasio-Cortez nor House leadership acknowledged that Chakrabarti may have crossed a line. The situation, though, changed sharply in July when Ocasio-Cortez accused Pelosi of “singling out newly elected women of color.” After the rebuke, Pelosi’s allies within the Congressional Black Caucus (CBC) moved simultaneously to defend the Speaker and attack the freshman congresswoman. A number of the CBC’s members, including Rep. William Lacy Clay (D-MO), directed their anger at both Ocasio-Cortez and her chief of staff. “It shows you how ignorant and little history [Chakrabarti] knows, how ignorant he is to American history. How dare he,” Clay told The Hill. The Missouri Democrat extended his criticism to Justice Democrats, the group started by Chakrabart to support left-leaning primary challenges to establishment Democrats. “I find it juvenile, their tactics, I find their ignorance to be beyond belief about American history and about who are really segregationists,” Clay said. “And so how dare they try to play the race card at this point, it shows you the weakness of their arguments.” Other moderates appeared to echo the sentiment, with some even anonymously calling for Chakrabarti’s ouster.  Even prior to the broadside about moderates, Chakrabarti had come under fire for his tenure leading Justice Democrats. In March, a complaint was filed with the Federal Election Commission claiming he funneled more than $1 million in political donations to two of his private companies.",
      "date": "2 Aug 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez Calls for Abolishing Electoral College: ‘Shadow of Slavery’s Power’",
      "url": "https://www.breitbart.com/politics/2018/10/07/alexandria-ocasio-cortez-calls-for-abolishing-electoral-college-shadow-of-slaverys-power/",
      "subtitle": "Alexandria Ocasio-Cortez, the Democrat Party’s rising socialist star running to represent New York’s 14th District in Congress, called for the electoral college to be abolished on Saturday, moments after then-Supreme Court nominee Brett Kavanaugh was confirmed by the Senate.",
      "author": "Joshua Caplan",
      "content": " In response to GQ magazine’s Julia Ioffe lamenting the impact presidents who won the electoral college have had on the Supreme Court, Ocasio-Cortez, tweeted her support for the process to be eliminated. “It is well past time we eliminate the Electoral College, a shadow of slavery’s power on America today that undermines our nation as a democratic republic,” she tweeted.   With Kavanaugh sworn into the Supreme Court as of Saturday evening, he is the fourth justice to be nominated by a president who did not win the popular vote. President Donald Trump, who beat his Democrat rival Hillary Clinton by 77 electoral votes (304-227) in the 2016 presidential election, has placed Neil Gorsuch and now Kavanaugh on the court. Both Justice Samuel Alito and John Roberts were selected by President George W. Bush. Ocasio-Cortez joins a growing number of Democrats, including Clinton, calling for the electoral college to be replaced. In a September 2017 interview with CNN, Clinton told host Anderson Cooper that she believed the process was outdated and needed to be replaced. “We’ve moved toward one-person, one-vote, that’s how we select winners,” said Clinton. “I think it needs to be eliminated. I’d like to see us move beyond it, yes.” One year later, Clinton once again called for the electoral college to be eliminated in an opinion-editorial for the Atlantic, arguing President Donald Trump was a racist who was damaging American democracy. “You won’t be surprised to hear that I passionately believe it’s time to abolish the Electoral College,” Clinton wrote. “Trump has sunk far below the already-low bar he set for himself in his ugly campaign.” “Hate speech isn’t ‘telling it like it is,’” she added. “It’s just hate.”",
      "date": "7 Oct 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Report: AOC, Omar & Tlaib to Endorse Bernie Sanders for President",
      "url": "https://www.breitbart.com/2020-election/2019/10/15/report-alexandria-ocasio-cortez-to-endorse-bernie-sanders-for-president/",
      "subtitle": "Far-left freshman congresswomen Reps. Alexandria Ocasio-Cortez (D-NY), Ilhan Omar (D-MN), and Rashida Tlaib (D-MI) are expected to endorse Sen. Bernie Sanders’s (I-VT) 2020 presidential campaign over the weekend, according to reports.",
      "author": "Joshua Caplan",
      "content": "  The Washington Post stated Tuesday that Ocasio-Cortez is expected to announce her support for Sanders’s White House bid alongside the senator on Saturday at his first rally since suffering a heart attack two weeks ago. “We’re looking forward to Saturday,” Ocasio-Cortez spokesperson Corbin Trent teased in a statement. During tonight’s CNN-New York Times’ Democrat presidential debate, Sanders teased that he would have a “special guest” at his “Bernie’s back” rally in Queens, New York. “The endorsement could be a blow for Sen. Elizabeth Warren (D-Mass.), who, like Sanders, is running on a platform of sweeping liberal change and who has emphasized her role as a female pioneer,” notes the Post. Ocasio-Cortez worked as a volunteer organizer for Sanders’s 2016 campaign. The development comes after Sanders said that he “misspoke” when he told reporters he may slow his frenetic campaigning pace after a recent heart attack. The Vermont senator backtracked in an interview with NBC News just a day after indicating that health concerns would force him to change “the nature” of his campaign, in the short term, at least. “We’re going to get back into the groove of a very vigorous campaign,” Sanders told NBC, downplaying the impact of the heat attack, which required him to be rushed to the hospital where he received two stents to clear a clogged artery in his heart. “People should think that I had a procedure which hundreds of thousands of people a year have,” Sanders continued. “People should think that according to the doctors I’m on the way to a full recovery.” The 78-year-old self-described democratic socialist was hospitalized after experiencing chest discomfort while campaigning in Las Vegas last week. His staff initially said the stents were inserted for a blocked artery, revealing only two days later that he had had a heart attack. Sanders told NBC it was “nonsense” to suggest his staff hadn’t been forthright about his condition. He said he was still talking to doctors and trying to understand what was going on. The Associated Press contributed to this report.",
      "date": "15 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez: We Progressives Are Going to ‘Run Train’",
      "url": "https://www.breitbart.com/politics/2019/01/16/alexandria-ocasio-cortez-we-progressives-are-going-to-run-train/",
      "subtitle": "Rep. Alexandria Ocasio-Cortez (D-NY) used a vulgar sexual term in an interview with the Washington Post published Wednesday, threatening conservatives that Democrats would “run train on the progressive agenda.”",
      "author": "Joel B. Pollak",
      "content": " The term “run train” refers to a gang rape. According to UrbanDictionary.com, the “top definition” for the term “run train” is “to ‘gangbang’ a girl with several friends.” Other definitions follow: 2. To call your friends to preform various unforgivable acts of a sexual nature on one female in rapid succession. … 3. When a bunch of guys have sex with the same girl one after another with no breakfor the girl … 4. to have sexual intercourse with a girl, with the help of one’s friends. … 5. Where men all have sex with one women. Either at the same time or one after another. Two other non-sexual definitions refer to attacking people in video games. The context of Ocasio-Cortez’s remark was an answer to a question about a fake nude photo, purporting to be of the congresswoman, that appeared on Reddit and was subsequently covered by other outlets, including Vice’s Motherboard, the Daily Caller, and other outlets. Ocasio-Cortez claimed, without evidence, that “Republicans” and “conservative outlets” had circulated the image. The relevant section of the interview is as follows: The Post: How did you feel when that hit yesterday? Ocasio-Cortez: I was surprised and I was annoyed because it was a new tack. They’ve been for a very long time focusing on taking quotes out of context or manipulating them or making it seem as though I said things that I didn’t say. This was different in that it was an outright fraudulent thing. You can tell that they’re getting into hysterics because now you’re getting into my actual body, which is definitely crossing a level, definitely crossing a line. I also think it’s encouraging because this is my sixth day in Congress and they’re out of all their artillery. The nude is supposed to be like the bazooka. You know, like, “We’re going to take her down.” Dude, you’re all out of bullets, you’re all out of bombs, you’re all out of all this stuff. What have you got left? I’m six days into the term, and you already used all your ammo. So enjoy being exhausted for the next two years while we run train on the progressive agenda. Ocasio-Cortez has not yet commented on the interview. Joel B. Pollak is Senior Editor-at-Large at Breitbart News. He is a winner of the 2018 Robert Novak Journalism Alumni Fellowship. He is also the co-author of How Trump Won: The Inside Story of a Revolution, which is available from Regnery. Follow him on Twitter at @joelpollak.",
      "date": "16 Jan 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez Faces Backlash for Scoffing that Veteran Dan Crenshaw Should ‘Go Do Something’ About Terrorism",
      "url": "https://www.breitbart.com/politics/2019/04/12/alexandria-ocasio-cortez-faces-backlash-for-scoffing-that-veteran-dan-crenshaw-should-go-do-something-about-terrorism/",
      "subtitle": "New York Congresswoman Alexandria Ocasio-Cortez is facing backlash for telling Rep. Dan Crenshaw, a wounded veteran, to “go do something” about terrorism. Crenshaw is a U.S. Army veteran of Afghanistan and lost an eye in battle, Fox reported.",
      "author": "Warner Todd Huston",
      "content": " Ocasio-Cortez stuck her foot in her mouth defending virulent anti-Semite Minnesota Rep. Ilhan Omar who Crenshaw criticized for her outrageous comment about the terror attacks on 9/11. Omar was seen on video breezily noting that on September 11, 2001, “some people did something” and that caused Muslims to become victims of discrimination. Crenshaw was aghast over Omar’s characterization of the brutal terror attacks as merely “some people did something.” The Texas Rep. jumped to his Twitter account on April 9 to slam Omar saying, “First Member of Congress to ever describe terrorists who killed thousands of Americans on 9/11 as ‘some people who did something.’ Unbelievable.”  Ocasio-Cortez felt compelled to come to the defense of the anti-Israel Omar and attacked Rep. Crenshaw for the “audacity” to attack Omar. “You refuse to cosponsor the 9/11 Victim’s Compensation Fund yet have the audacity to drum resentment towards Ilhan w/completely out-of-context quotes,” Ocasio-Cortez tweeted on April 11. “In 2018, right-wing extremists were behind almost ALL US domestic terrorist killings. Why don’t you go do something about that?”  Almost immediately, Ocasio-Cortez was excoriated for having the audacity to tell a man who lost his eye in service to the country to “go do something” about terrorism.    Follow Warner Todd Huston on Twitter @warnerthuston.",
      "date": "12 Apr 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez: USA ‘Headed Toward Fascism’",
      "url": "https://www.breitbart.com/politics/2019/07/02/alexandria-ocasio-cortez-usa-headed-toward-fascism/",
      "subtitle": "Rep. Alexandria Ocasio-Cortez (D-NY) told Yahoo! News on Monday evening that the United States is “headed toward fascism.”",
      "author": "Joel B. Pollak",
      "content": " Ocasio-Cortez, who is a self-described “democratic socialist,” made the comments in an interview published Tuesday. Yahoo! News reported: “Are we headed to fascism? Yes. I don’t think there’s a question,” the congresswoman told Yahoo News hours after she toured the detention facilities run by Customs and Border Protection. “If you actually take the time to study, and to look at the steps, and to see how government transforms under authoritarian regimes, and look at the political decisions and patterns of this president, the answer is yes.” Last month Ocasio-Cortez sparked controversy when she described the migrant detention facilities as “concentration camps on our southern border.” Her comment drew an immediate backlash from critics who accused her of trivializing Nazi concentration camps, while others, including some Holocaust survivors and scholars, said the comparison was a valid one. The freshman Democratic lawmaker from New York refused to back down from that comparison, and in her conversation with Yahoo News, Ocasio-Cortez argued that many things about President Trump echo that dark period in history. Read the full Yahoo! News article here. Also on Monday evening, National Border Patrol Council president Brandon Judd told Breitbart News Tonight that Ocasio-Cortez had lied about conditions at facilities where illegal aliens are being held near the border, as well as about the behavior of officers at the facilities. “How can you have the moral high ground if you are going to throw facts out the window and spew falsehoods?” he commented. Ocasio-Cortez was elected in November as part of a Democratic Party victory in the U.S. House of Representatives, matching a pattern throughout recent U.S. history in which the opposition fares well in the midterm elections. Since taking office, Ocasio-Cortez has proposed ambitious new policies that grant sweeping powers to the government over the U.S. economy, envisioning a highly controlled system in which the state controls private industry and steers it toward overarching utopian goals, such as a shift to 100% renewable energy and the elimination of fossil fuels. Joel B. Pollak is Senior Editor-at-Large at Breitbart News. He is a winner of the 2018 Robert Novak Journalism Alumni Fellowship. He is also the co-author of How Trump Won: The Inside Story of a Revolution, which is available from Regnery. Follow him on Twitter at @joelpollak.",
      "date": "2 Jul 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Ocasio-Cortez: I Want to Have ‘One Less Child’ Due to Climate Change Crisis",
      "url": "https://www.breitbart.com/politics/2019/08/28/ocasio-cortez-i-want-to-have-one-less-child-due-to-climate-change-crisis/",
      "subtitle": "Rep. Alexandria Ocasio-Cortez (D-NY) returned to social media Tuesday evening to talk about climate change, revealing she wants to have “one less child” due to her climate concerns.",
      "author": "Hannah Bleau",
      "content": " Ocasio-Cortez’s appearance following her vacation prompted one viewer to ask, “How can we save the climate. I’m trying to have a nice life.” Ocasio-Cortez told viewers the same question keeps her up at night. It, quite literally, woke her up during her vacation, she claimed. “Even while I was on vacation I woke up in the middle of the night at 3:30 in the morning just concerned about climate change,” Ocasio-Cortez told viewers: Last night on Instagram live while @AOC was making some boxed mac and cheese, she told a sob story about how she “woke up in the middle of the night while on vacation at 3:30 in the morning” because she was so worried about climate change… Raise your hand if you call bullshit! pic.twitter.com/B6mNvah8YT — That Trump Guy 🇺🇸 (@ThatTrumpGuy) August 28, 2019  She also told viewers how the climate change “crisis” is affecting her long-term family planning. She said she has always wanted to adopt children but added that she wants to have one less child due to environmental concerns. “Even now, you know when you put climate change on top of that, I know that I want to perhaps have one less child than I thought I would maybe have,” the freshman Democrat said, adding “older generations” do not understand how much climate change impacts the decisions of the younger generation. “I think having a mixed family is part of my personal planning. But it’s really hard, and I don’t think sometimes that older generations understand how much we’re taking this into account,” she continued: On Instagram live just now, AOC says she's going to have one less child because of climate change. pic.twitter.com/qUess81XPi — Caleb Hull (@CalebJHull) August 28, 2019  The “Squad” ringleader took her remarks on older generations a step further after a viewer asked if she believed younger generations were too “delicate.” Ocasio-Cortez passionately disagreed with that assessment, calling younger generations “badass” and proceeding to insult older generations to build her case. “I think young people are more informed and dynamic than their predecessors. I think that they are more sensitive in a positive way in that they actually care about other people’s experiences and lives,” she said, praising what she calls the younger generation’s “radical acceptance.” She continued: They actually take time to read and understand our history. The history of the labor movement, history of civil rights, history of racial struggles, history of economics, history of the United States, history of colonialism. And they’re not afraid to have those conversations. “If anything, I think they’re profoundly courageous because they’re willing to puncture taboos and have conversations that frankly older generations sometimes struggle to have,” she said. “Not everyone. I don’t want to paint everybody with a broad brush,” she added, before proceeding to paint older generations with a broad brush. “I think this new generation is very profound and very strong and very brave because they’re actually willing to go to the streets. How about that?” she said. “Previous generations have just assumed that government’s got it. Let me tell you something. You are the government. Like, as a democracy, ‘We the People’ means you,” she added: AOC on Instagram live: “Young people are more informed and dynamic than their predecessors… they actually take time to read and understand our [world] history.” Um, what? pic.twitter.com/hk1ZHpUSOv — Caleb Hull (@CalebJHull) August 28, 2019 ",
      "date": "28 Aug 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "James Woods Rips ‘Arrogant Idiot’ Alexandria Ocasio-Cortez: ‘You Work for Us’",
      "url": "https://www.breitbart.com/entertainment/2019/02/25/rrjames-woods-rips-ocasio-cortez-you-work-for-us/",
      "subtitle": "Veteran actor James Woods slammed Rep. Alexandria Ocasio-Cortez (D-NY) and Green New Deal advocate over the weekend after she declared that she was “in charge.”",
      "author": "Justin Caruso",
      "content": " “So, you may have missed this, but the way it works in America is YOU work for US. The last time somebody told Americans to sit down and shut up was 1776,” James Woods said. “If you ever learn to read, look it up. You are not only a idiot, you’re an arrogant idiot, and there is nothing more dangerous.”  Indeed, Ocasio-Cortez rattled the cages of the Democratic establishment in a social media post Friday over their criticisms of her Green New Deal. “Yup. If you don’t like the GreenNewDeal, then come up with your own ambitious, on-scale proposal to address the global climate crisis,” she said. “Until then, we’re in charge – and you’re just shouting from the cheap seats.”  Woods, one of the few outspoken conservatives in Hollywood, criticized the New York Democrat last month, calling her the most dangerous person in America. “This is the most dangerous person in America right now. Ignore her at your peril…” the Casino actor said.  Indeed, in a livestream over the weekend, the 29-year-old congresswoman can be seen ranting about the end of the world due to climate change. “The whole premise of the Green New Deal is that we’re screwed on climate,” the socialist congresswoman said. “At this point, we don’t even have to prove it, just walk outside in winter in a lot of places, and it’s either way worse than you’re used to, or way warmer than you’re used to.” ",
      "date": "25 Feb 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Nolte: Media Scramble to Protect Alexandria Ocasio-Cortez from Holocaust Lie",
      "url": "https://www.breitbart.com/the-media/2019/06/19/nolte-media-scramble-to-protect-alexandria-ocasio-cortez-from-holocaust-lie/",
      "subtitle": "Rep. Alexandria Ocasio-Cortez (D-NY) is lying about how she compared our migrant detention camps on the Southern border to the Holocaust, and to the surprise of no one, fake news outlets like CNN, MSNBC, and the Washington Post are covering for her with their own lies.",
      "author": "John Nolte",
      "content": " CNN is even trying to explain how Auschwitz wasn’t all that bad. On Monday, Ocasio-Crazy, probably from that luxury apartment of hers, filmed a video that compared American migrant camps to “concentration camps.” Nevermind that our migrant camps have been in use long before President Trump took office. Nevermind that these illegal migrants enjoy free food, healthcare, and sanitary conditions. Nevermind that if these illegal migrants simply agreed to return home where they belong, we would provide free transportation (translation: they are NOT prisoners). Nevermind that what was perfectly okay under Obama is a concentration camp because Orange Man Bad. Ocasio-Crazy’s comparison is, of course, not only outrageous, it is yet another way to deliberately smear Trump as a Nazi, which is a sure way to embolden violence or an assassination attempt against him. The good news is that Ocasio-Crazy got some well-deserved blowback. Because on top of her mindless stupidity and dangerous rhetoric, there is the not-unimportant matter of her trivializing the Holocaust. Naturally, though, as soon as the backlash began, Ocasio-Crazy did what she usually does in these matters… She played dumb and lied. “And for the shrieking Republicans,” she tweeted on Tuesday, “who don’t know the difference: concentration camps are not the same as death camps.” In other words: My “concentration camp” rhetoric had not-a-thang to do with the Holocaust. In fact, I wasn’t even thinking about Nazi Germany and Auschwitz, you deplorable racists. Yeah, no. That’s not only a lie, it’s provable lie, because in her video, Ocasio-Crazy says, “‘Never Again’ means something.” The phrase “Never Again” refers directly to the Holocaust, so the fact that she was comparing our migrant camps to the Holocaust is not even debatable, nor is the fact that she is now lying about it. But guess who do see it as debatable, who are making excuses for Ocasio-Crazy’s inexcusable Holocaust comparison and  just as inexcusable lies to cover  it up? Yep, you guessed it: our useless, dishonest, fake newsers in the establishment media. Here’s CNN’s Manu Raju helping Ocasio-Crazy clean up this mess by allowing her to lie to his stupid face:  Weird how he never asks her to explain that “Never Again” remark, no? Oh, and here’s CNN’s favorite crybully, Andrew Kaczynski, breaking the fake news that Auschwitz wasn’t all that bad: Aushwitz was a mixture of work and extermination camps. — andrew kaczynski (@KFILE) June 18, 2019  Hey, Kaczynski: Auschwitz also had roads, its own train station, offices, and kitchens… So Auschwitz was kinda like Six Flags, amiright? Not to be outdone, Dave Weigel, the far-left Washington Post’s lead Democrat fluffer, is pretty sure that a world-class dingbat who just a few weeks ago found herself awed by the miracle of a garbage disposal, must have been referring to the Boer War:  And then there’s MSNBC’s Chris Hayes, who also chose to ignore the “Never Again” remark so he could yell at Liz Cheney: “If you spend a few minutes learning some actual history,” Hayes harrumphed, “you will find out that concentration camps are different from death camps and have a history that both predates and extends far past the Nazis.”  Now explain “Never Again,” pajama boy. So what we have here are three national news outlets so desperate to protect Ocasio-Crazy they are ignoring her “Never Again” reference, and we even have one CNN “reporter” breaking the bombshell news that Auschwitz was nowhere near as bad as advertised. Is it just me or does this all qualify as “enemy-of-the-people” type behavior? Anyway, this has been today’s episode of Democrats Sure Got It Good.  Follow John Nolte on Twitter @NolteNC. Follow his Facebook Page here.",
      "date": "19 Jun 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Nolte: Alexandria Ocasio-Cortez Uses Obamacare Con to Lead Millennials Astray",
      "url": "https://www.breitbart.com/politics/2018/12/18/nolte-alexandria-ocasio-cortez-uses-obamacare-con-to-lead-millennials-astray/",
      "subtitle": "It can be painful to watch the government, media, and left lead America’s young people, most especially millennials, astray. On top of being brainwashed into humorless censors and joyless puritans, the debt they are pressured to take on is beyond belief.",
      "author": "John Nolte",
      "content": " To begin with, there is college tuition. I graduated high school in 1984 (barely), and even during those saner times, when tuition was much more reasonable, I had no desire to go to college, primarily due to the cost. The idea of enslaving myself to a monthly payment before I even had the chance to be young and free was intolerable. Nowadays, though, tuition costs are not only insane, a number of degrees that once required four years of study, now require five. Talk about a scam. How sad to be in your early to mid-20s and already saddled with a six-figure debt.  It is even sadder if you hold a degree that will do you no good in the real world. And the entire American establishment is engineered to convince teenagers to jump into this financial abyss, but only because the entire American establishment benefits. In college, kids are politically brainwashed, which is why post-college, they are more likely than not to vote Democrat — to vote for a bigger and more intrusive government, to relish the idea of centralized control. As far as the insatiable tuition train, this is what funds these greedy left-wing universities and their staff. And then it all comes together when the crushing debt combined with the brainwashing radicalizes young people into believing government-subsidized anything (tuition, healthcare) has to be better than this. Obviously, though, that crushing misery is not enough for far-leftists like incoming Rep. Alexandria Ocasio-Cortez (D-NY), who is pressuring her fellow millennials to sign up for the con game that is Obamacare. In a tweet Monday, Ocasio-Cortez wrote: “Reminder to my fellow millennials to get your act together & buy insurance before tonight’s deadline.” “Is open enrollment a pain? Yes. Is it expensive? Yes. But it’s WAY better than being uninsured (been there) & reason enough to fight for #MedicareForAll.”  At least she doesn’t hide the true agenda behind Obamacare — t0 make health insurance so expensive people beg to put centralized government in charge of our health. Regardless, shame on her. Obamacare is nothing less than a con job that sucks young people dry for no valid reason. The young and healthy do need health insurance, much less the utterly useless insurance that is Obamacare. Not only are Obamacare’s monthly premiums obnoxiously expensive (upwards of $1,000), so are the deductibles. The chances a young person will meet the deductible are extremely low, which means that on top of paying that crippling Obamacare premium, young people are paying for their own healthcare. Obamacare is only about wealth redistribution, to saddle the young and healthy with massive monthly premiums as a means to lower premiums for the old and sick. Originally, through the fascist mandate, the government forced you to buy health insurance. With the repeal of the mandate, you now have con artists like Ocasio-Cortez guilting and misleading young people into paying for a product they do not need. “[I]t’s WAY better than being uninsured.” No, no, it is actually not “WAY better than being uninsured.” Being uninsured is WAY better because you are almost certainly going to waste thousands of dollars a year on a product you do not need. And it is worth repeating that on top of that, thanks to the deductible, you will also end up paying for whatever health care you do get. Of course there is always the unlikely (especially for the young) catastrophic situation — a cancer, heart attack, or car accident. If that is a concern, you can either look into a catastrophic health insurance plan (low monthly premium with a very high deductible) or take the risk. Me? I’d take the risk, and I have taken the risk. After Obamacare outlawed my health insurance, as a grown man in my 40s, I took the risk for years.  These days, I have this as a catastrophic backup, but I still pay for all of my own healthcare out of pocket, which is a helluva lot cheaper than Obamacare. Sorry, but there is just no way I’m going to allow the government to con or pressure me into paying for a lousy product I don’t need. Wise up, millennails, you’re not only being hoodwinked, you’re being stripped of the joy and freedom that is supposed to come with being young. This country would be a lot better off if millennials stopped paying their Obamacare premiums and used that money instead to fund a wild, drunken toga party — complete with a live band and strippers. In fact, we should all do that.  Follow John Nolte on Twitter @NolteNC. Follow his Facebook Page here.",
      "date": "18 Dec 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Ocasio-Cortez to Republicans: Vote Against Impeachment and Live with the ‘Stain’ on Your Careers",
      "url": "https://www.breitbart.com/politics/2019/09/10/ocasio-cortez-to-republicans-vote-against-impeachment-and-live-with-the-stain-on-your-careers/",
      "subtitle": "Rep. Alexandria Ocasio-Cortez (D-NY) on Tuesday signaled strong support for the House Judiciary Committee’s impeachment efforts and dared Senate Republicans to go on the record and “knowingly vote against impeachment of this president knowing his corruption” so they can “have that stain on their careers the rest of their lives.”",
      "author": "Hannah Bleau",
      "content": " “Once the House impeaches, the House has impeached the president,” Ocasio-Cortez told reporters Tuesday, despite the fact that the House has yet to hold a full impeachment vote, as Democrats fall over 80 votes shorts of a pro-impeachment majority. She continued: If they [Republicans in the Senate] want to fail it, then I want to see every Republican go on the record and knowingly vote against impeachment of this president, knowing his corruption so that they can have that stain on their careers the rest of their lives because this is outrageous to protect the amount of lawlessness.   Chairman Jerry Nadler (D-NY) is vying for a committee vote, laying the groundwork and defining the scope of an impeachment probe. Despite House Speaker Nancy Pelosi’s (D-CA) efforts to stall the probe, she claims the party is united. “I think you should characterize it [the resolution] for what it is,” Pelosi told Fox News. “It’s a continuation of what we have been doing. You know, we all work together on these things.” Ocasio-Cortez began calling for Trump’s impeachment prior to taking office, telling Real America with Jorge Ramos last fall that impeachment was a “no-brainer.” The freshman lawmaker renewed her calls for impeachment over the weekend following reports of an inquiry into military spending associated with Trump’s Turnberry resort: ",
      "date": "10 Sep 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez Predicts Democrats Will Win Texas in 2020",
      "url": "https://www.breitbart.com/politics/2019/08/02/alexandria-ocasio-cortez-predicts-democrats-win-texas-2020/",
      "subtitle": "Rep. Alexandria Ocasio Cortez (D-NY) said in a tweet Friday that Democrats will work hard and win over Texas in 2020.",
      "author": "Hannah Bleau",
      "content": " The freshman lawmaker responded to a tweet from MSNBC’s Chris Hayes, which read, “Time for the GOP to start fully freaking out about Texas.” Ocasio-Cortez took Hayes’s sentiments a step further in a tweet completely in Spanish, telling supporters to get ready because they are “going to work hard and win in Texas”:  Hayes’s tweet followed Rep. Will Hurd’s (R-TX) decision not to seek reelection, leaving the 23rd Congressional District of Texas wide open. “I have made the decision to not seek reelection for the 23rd Congressional District of Texas in order to pursue opportunities outside the halls of Congress to solve problems at the nexus between technology and national security,” he wrote:  It is a tight district, as Hurd narrowly edged out Democrat challenger Gina Ortiz Jones in 2018, winning by less than one percent. Republican Texas Reps. Pete Olson and Mike Conaway also recently announced they will not seek reelection, sparking Democrat hopes of a series of congressional upsets in 2020:     Some, such as former Texas Rep. Beto O’Rourke (D), believe Texas will be in play in the general election as well:  President Trump defeated Hillary Clinton in Texas by 9 points– 52.2 percent to 43.2 percent. The current Real Clear Politics averages of hypothetical Texas general election matchups show Trump beating every candidate except for Joe Biden (D), who is up by 2.5 percent. As Breitbart News reported last month, the GOP is beefing up resources in Texas to prevent the blue shift Ocasio-Cortez and her counterparts predict: Donors are reportedly strengthening efforts in the state and primarily focusing on GOP voter registration efforts. The broad goal involves registering at least one million new Republican voters ahead of 2020. One specific group, Engage Texas, led by Houston real estate developer Richard Weekley, hopes to raise millions ahead of the presidential election. According to reports from the Washington Examiner, Engage Texas was “set up as a 501(c)4, political nonprofit organization and plans to raise and spend $25 million by Election Day next year.” “Without our 38 electoral votes, no Republican candidate has a path to victory for the foreseeable future. That is why we are asking for the support of people around the country,” Republican Party of Texas chairman James Dickey told Breitbart Washington editor Matt Boyle on Sirius XM’s Breitbart News Saturday in April. “One of the things that we face as a challenge in Texas is people assume that Texas always has been and always will be red. That’s not true. It was only 16 years ago that Republicans even took the Texas House,” he continued. “Democrats have been pouring money and pouring resources into Texas to try and flip Texas,” Dickey added.",
      "date": "2 Aug 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Ocasio-Cortez: Trump Running ‘Concentration Camps’ at Border",
      "url": "https://www.breitbart.com/politics/2019/06/18/ocasio-cortez-trump-running-concentration-camps-at-border/",
      "subtitle": "Rep. Alexandria Ocasio-Cortez (D-NY) on Monday evening ratcheted up her attacks on the Trump administration’s immigration policies, referring to President Donald Trump as a “fascist” operating “concentration camps” on the U.S.-Mexico border.",
      "author": "Joshua Caplan",
      "content": " “That is exactly what they are. They are concentration camps,” Ocasio-Cortez said of migrant holding facilities during a Q&A live-streamed on Instagram. “The fact that concentrations camps are now an institutionalized practice in the Home of the Free is extraordinarily disturbing and we need to do something about it.”  The self-avowed Democratic-socialist then voiced her eagerness to connect with others “who are concerned enough with humanity to say that ‘never again’ means something.” The expression “never again” is strongly associated with Holocaust remembrance. During another part of the live-stream, the 29-year-old freshman lawmaker warned her followers that “we are losing to an authoritarian and fascist presidency.” “I don’t use those words lightly,” she continued. “I don’t use those words to just throw bombs. I use that word because that is what an administration that creates concentration camps is. A presidency that creates concentration camps is fascist, and it’s very difficult to say that.” “The fact that concentration camps are now an institutionalized practice in the home of the free is extraordinarily disturbing, and we need to do something about it,” she added.  In November, Ocasio-Cortez faced blowback after comparing asylum seekers to Jews fleeing Nazi Germany during World War II, attempting to make the point that neither was a “crime.” “Asking to be considered a refugee and applying for status isn’t a crime,” the congresswoman wrote on Twitter. “It wasn’t for Jewish families fleeing Germany. It wasn’t for targeted families fleeing Rwanda. It wasn’t for communities fleeing war-torn Syria. And it isn’t for those fleeing violence in Central America.”   Ocasio-Cortez’s remarks came as President Trump vowed to deport millions of illegal aliens in a series of tweets. Ahead of launching his 2020 re-election campaign, the president stated that U.S. Immigration and Customs Enforcement (ICE) will next week “begin the process of removing the millions of illegal aliens who have illicitly found their way into the United States.” “They will be removed as fast as they come in,” he added.  ",
      "date": "18 Jun 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Nolte: Alexandria Ocasio-Cortez Melts Down over Criticism of Fake Accent",
      "url": "https://www.breitbart.com/politics/2019/04/06/alexandria-ocasio-cortez-melts-criticism-fake-accent/",
      "subtitle": "Rep. Alexandria Ocasio-Cortez (D-NY) responded to criticism for her patronizing use of a fake accent in front of a black audience in the usual manner — crybabying.",
      "author": "John Nolte",
      "content": " The not-terribly-bright socialist was caught on video Friday patronizing the mostly black audience with a fake southern drawl at Rev. Al Sharpton’s National Action Network conference. The humiliating video quickly made the rounds on social media, earning the criticism and ridicule it deserved. The video is as shocking as it is excruciating. All of a sudden, the Westchester socialist, who is famous for her Jerry the Mouse voice, starts talking like a black preacher. “This is what organizing looks like. This is what building power looks like,” Ocasio-Crazy said with her affected cadence. “This is what changing the country looks like. It’s when we choose to show up and occupy the room and talk about the things that matter most, talking about our future.” “Ain’t nothing wrong with that. There’s nothing wrong with working retail, folding clothes for other people to buy,” she continued. “There is nothing wrong with preparing the food that your neighbors will eat. There is nothing wrong with driving the buses that take your family to work”:  The moment is reminiscent of two-time presidential loser Hillary “Hot Sauce” Clinton’s similar attempt to condescend to a predominantly black audience with her “Ain’t No Ways Tired” remarks in 2007:  And let’s not forget then-Vice President Joe “The Hair Sniffer” Biden warning a black audience that Mitt Romney’s going “to put y’all back in chains”:  “Ain’t.” “Y’all.” More like… “Phony.” “Freak.” Anyway, using the Twitters, Ocasio-CowFart basically melted down over the ridicule, using the absurd argument that this is how Alex from The Block does her thang, and if you were from The Block, you’d know that’s how a thang is done, and y’all need to forget Miss Thang grew up in, ahem, Westchester:  “Folks talking about my voice can step right off,” she tweeted. “Women’s March & Kavanaugh speech, same. Any kid who grew up in a distinct linguistic culture & had to learn to navigate class enviros at school/work knows what’s up. My Spanish is the same way.” What a load of crap. Even though, at the time, I was younger than she is (she’s currently 29 going on 14), I  managed to live, work, and go to school in Milwaukee’s inner city for a total of five years. My whole “class enviro” during those years was predominantly black, but the thought of affecting an accent never even crossed my mind — not because I was woke or sensitive, but because I didn’t want to look like an asshole — because this is what Ocasio-Crazy looks like (NSFW):  What’s more, she’s lying… As Ryan Saavedra at the Daily Wire discovered, her claim that this is not the first time she’s used a “distinct dialect,” that she did the same during her “Women’s March & Kavanaugh speech,” simply isn’t true. Below is video footage of those two speeches, and all you hear is Jerry the Mouse:   In a second tweet, she lied again. “As much as the right wants to distort & deflect, I am from the Bronx. I act & talk like it, *especially* when I’m fired up and especially when I’m home,” she tweeted. Except she’s not from the Bronx. She’s from Westchester. “It is so hurtful to see how every aspect of my life is weaponized against me, yet somehow asserted as false at the same time,” she added, as though it wasn’t hurtful for us to have to watch her patronize a mostly black audience as though they were babies who require baby talk. Man, she’s awful. Follow John Nolte on Twitter @NolteNC. Follow his Facebook Page here.",
      "date": "6 Apr 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Democratic Socialist",
      "url": "https://www.breitbart.com/tag/democratic-socialist/",
      "subtitle": "null",
      "author": "Penny Starr",
      "content": "                   ",
      "date": "7 Jul 2019, 5:49 PM PDT",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "FEC Complaint: Alexandria Ocasio-Cortez Ran ‘Subsidy Scheme’",
      "url": "https://www.breitbart.com/politics/2019/04/03/fec-complaint-alexandria-ocasio-cortez-ran-subsidy-scheme/",
      "subtitle": "Rep. Alexandria Ocasio-Cortez (D-NY) and her campaign manager ran a “subsidy scheme” that violated campaign laws, according to a Federal Election Commission (FEC) complaint.",
      "author": "Katherine Rodriguez",
      "content": " The complaint, which was obtained by Fox News on Tuesday, alleges that Ocasio-Cortez and her campaign manager, Saikat Chakrabarti, ran a dark web of political action committees (PACs) that enabled them to raise money beyond the legal limits set in place by federal campaign finance laws. The FEC complaint also alleged that Ocasio-Cortez and Chakrabarti created a limited liability company (LLC) to go around federal expenditure requirements, offering political consulting services to Ocasio-Cortez and other Democratic candidates at extremely low prices. Chakrabarti’s group, Brand New Congress LLC, took on Ocasio-Cortez as a client and charged those clients “far below market value” while using PAC money to subsidize the company’s losses, according to the complaint. Dan Backer, a conservative attorney, filed the FEC complaint alleging that Ocasio-Cortez and Chakrabarti violated a group of FEC Advisory Opinions in place since the 1990s which state that campaigns have to pay full price for political consulting services or accept them as contributions. This is not the first FEC complaint filed against Ocasio-Cortez recently. The National Legal and Policy Center (NLPC) filed an FEC complaint against Chakrabarti for allegedly using two different PACs to funnel $1 million to two private companies he owned to hide campaign finance expenditures.",
      "date": "3 Apr 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez Suggests Joe Biden Too Old To Be President",
      "url": "https://www.breitbart.com/2020-election/2019/07/11/alexandria-ocasio-cortez-suggests-joe-biden-too-old-to-be-president/",
      "subtitle": "Rep. Alexandria Ocasio-Cortez (D-NY) said Joe Biden’s performance at the first Democrat presidential debate had “raised questions” about the 76-year-old former vice president’s capacity to be commander in chief.",
      "author": "Haris Alic",
      "content": " Ocasio-Cortez made the comments during an interview with the The New Yorker radio hour on Tuesday when asked by David Remnick, the show’s host, if age was a factor in whom the Democrats should nominate to take on President Donald Trump in 2020. The 29-year-old congresswoman started off by saying that age often is used “as a proxy” for capacit, and there were certainly “some folks of a certain age where you could question their capacity.” When pressed, Ocasio-Cortez cited Trump was “a perfect example,” but admitted Biden’s performance at the debate cast doubt on his own “capacity” to be president. “I think Joe Biden, his performance on the stage, kind of raised some questions in respect to that,” Ocasio-Cortez said. “But I don’t want to say just because someone is 79, they can’t or shouldn’t run for president. I don’t want to… use a number as a proxy for capacity.” Remnick asked what it was about Biden that made Ocasio-Cortez think he was “not there” and how progressives “should behave” if the former vice president or any other centrist Democrat were to win the nomination. “It’s not just about being centrist per se,” the congresswoman responded. “When you are struggling to talk about segregationists and you air on the side of discussing them in glowing terms, that is a big problem.” Ocasio-Cortez went on to say Biden, who recently flip-flopped on the Hyde Amendment and has been accused by multiple females of unwanted touching, appeared to have “systemic” problems with women. “I think struggling and talking about women’s rights is a big issue,” she said. “Struggling to convey respect for women in this day and age is a big issue. I think those are systemic issues, those are very deep, those are not gaffes, they are problems.” At the Democrat debate last month, Biden was confronted by Sen. Kamala Harris (D-CA) for having recently praised segregationists and long opposing busing to integrate public schools. “I agree with you when you commit yourself to the importance of finding common ground,” Harris said, “but I also believe and it’s personal and it was hurtful to hear you talk about the reputations of two United States senators who built their reputations and career on the segregation of race in this country.” Harris also criticized Biden for opposing busing to integrate public schools for the majority of his career in public office. “It was not only that, but you also worked with them to oppose busing,” she said. “There was a little girl in California who was part of the second class to integrate her public schools and she was bussed to school every day. That little girl was me. So I will tell you that on this subject, it cannot be an intellectual debate… we have to take it seriously.” Biden tried to defend himself by claiming Harris had mischaracterized his record. Instead of providing evidence to dispute Harris’s indictment, the former vice president only muddled his position on busing and inaccurately claimed that he never offered praised for racists. After the debate, Biden’s team was reportedly “freaking out” about the his poor performance. Biden’s team appeared to be correct to worry. Most political observers seemed to agree that Biden underperformed and was caught off the guard by Harris’s criticism.",
      "date": "11 Jul 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez: Miami Will Not Exist in a ‘Few Years’",
      "url": "https://www.breitbart.com/clips/2019/09/13/alexandria-ocasio-cortez-miami-will-not-exist-in-a-few-years/",
      "subtitle": "null",
      "author": "Pam Key",
      "content": " Wednesday at the NAACP town hall, Rep. Alexandria Ocasio-Cortez (D-NY) said Miami has only a few years left on this planet. Ocasio-Cortez said, “When it comes to climate change, what is not realistic is not responding … with a solution on the scale of the crisis—because what’s not realistic is Miami not existing in a few years. That’s not realistic. So we need to be realistic about the problem.” Follow Pam Key on Twitter @pamkeyNEN",
      "date": "13 Sep 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Ocasio-Cortez: Impeaching Trump ‘No-Brainer’",
      "url": "https://www.breitbart.com/politics/2018/11/03/ocasio-cortez-impeaching-trump-no-brainer/",
      "subtitle": "Alexandria Ocasio-Cortez, the Democratic-Socialist who will most likely be the youngest member of Congress next year, believes it is a “no-brainer” that President Donald Trump should be impeached.",
      "author": "Tony Lee",
      "content": " On his Real America with Jorge Ramos show on Facebook Watch this week, the Univision anchor asked Ocasio-Cortez whether she wanted to impeach Trump once she got to Congress. “I mean, yeah. To me, it’s a no-brainer,” Ocasio-Cortez replied to Ramos. “Well, I believe that he has violated the law. Violated potentially many laws, whether it’s the Emoluments Clause of the Constitution because he keeps his businesses open that foreign actors kind of participate in financial transactions with. Whether it’s what we are seeing with potentially illegal buyouts of campaign, you know, FEC violations of women that he is trying to silence.” Ocasio-Cortez also said impeaching Trump should not be “beyond the pale” because of how Republicans impeached former President Bill Clinton for lying under oath. “But overall, you look at the bar that the Republicans held for impeaching Bill Clinton and somehow impeaching Donald Trump is supposed to be beyond the pale? It seems ridiculous to me,” she added. Though Ocasio-Cortez said she believes Trump should be impeached because he committed a crime, other Democrats like Rep. Al Green (D-TX) have insisted that Trump “does not have to commit a crime to be impeached.” In fact, Green has argued that Trump could be impeached simply for “harming society.” “In fact, the president is not likely to be indicted, which means he’s not likely to be found guilty of a crime while he’s sitting, which means that if this comes before the House, it won’t come before the House as a president who has been found guilty, but rather as a president who is alleged to have committed certain offenses that are onerous to the Constitution and that harm society,” Green said during an August Democracy Now interview. “And what this president is doing is harming society.” Top Democrats like House Minority Leader Nancy Pelosi (D-CA), aware that impeachment is not a popular issue among Americans, has previously said that talk of impeachment before the midterms would be a “gift” to Republicans. But left-wing Democrats like Ocasio-Cortez, egged on by the party’s left-wing base that may not settle for anything less than impeachment if Democrats take back the House, have been ignoring Pelosi’s warnings to be disciplined and not talk about impeachment before Special Counsel Robert Mueller concludes his investigation.",
      "date": "3 Nov 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez Gives Illegal Aliens Tips on How to Evade ICE Raids",
      "url": "https://www.breitbart.com/immigration/2019/06/23/alexandria-ocasio-cortez-gives-illegal-aliens-tips-on-how-to-evade-ice-raids/",
      "subtitle": "Rep. Alexandria Ocasio-Cortez (D-NY) tweeted out a few tips on Saturday to illegal aliens looking to evade sweeps conducted by U.S. Customs and Immigration Enforcement (ICE) officers.",
      "author": "Katherine Rodriguez",
      "content": "  “Warning: The Trump admin is expected to begin ICE raids across the country TOMORROW, targeting people for round up,” Ocasio-Cortez wrote in the Saturday tweet. The self-described Democratic socialist then linked to tweets from Refugee and Immigrant Center for Education and Legal Services (RAICES) and United We Dream— both organizations which posted the locations of the suspected ICE raids. “NOW is the time for us to come together: – Check in w/ your neighbors – Share “Know Your Rights” info – If you see ICE, report to @UNITEDWEDREAM 1-844-363-1423,” the post continued. The freshman Democrat continued her series of tweets Saturday, claiming that the Trump administration is running “concentration camps” on the southern border where children do not get “toothpaste or soap.” Donald Trump Jr. quickly refuted her “concentration camp” claim, sending Ocasio-Cortez a tweet with messages from Holocaust survivors.  Although Ocasio-Cortez and other Democrats have strongly condemned the Trump administration for going after people who stay in the country illegally, their rhetoric did not match up to the reality of Trump’s plan on border enforcement. Trump announced later on Saturday that he would be delaying the administration’s effort to deport more illegal aliens until both political parties can work out a bipartisan solution to solve the problems at the southern border.",
      "date": "23 Jun 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "‘This Is the Truth’: Ocasio-Cortez Likens Migrant Detention Centers to ‘Torture Facilities’",
      "url": "https://www.breitbart.com/politics/2019/06/24/truth-ocasio-cortez-likens-migrant-detention-centers-torture-facilities/",
      "subtitle": "Rep. Alexandria Ocasio-Cortez (D-NY) doubled down and likened migrant detention centers to torture facilities in a tweet posted Sunday night.",
      "author": "Hannah Bleau",
      "content": " The New York lawmaker has been under fire for describing migrant detention centers as concentration camps and using phrases – like “Never Again” – commonly associated with the Holocaust. Despite the political backlash, she is not backing down. On Sunday, she wrote: Remember when the Bush administration bullied media into using their devised term “enhanced interrogation” instead of the accurate term “torture?” Well, waterboarding was torture. And these are concentration camps. Journalism should be about the truth. And this is the truth. The tweet was in reference to an ABC News report featuring a physician, Dolly Lucio Sevier, who witnessed a migrant detention center in person. She compared the conditions to “torture facilities” and described it as “worse than jail.” Ocasio-Cortez seemed to agree with the general assessment. Sevier had access to the Ursula facility in McAllen and wrote, “The conditions within which they are held could be compared to torture facilities,” ABC News reported. ABC News added:  After assessing 39 children under the age of 18, she described conditions for unaccompanied minors at the McAllen facility as including “extreme cold temperatures, lights on 24 hours a day, no adequate access to medical care, basic sanitation, water, or adequate food.” All the children who were seen showed evidence of trauma, Lucio Sevier reported, and the teens spoke of having no access to hand washing during their entire time in custody. She compared it to being “tantamount to intentionally causing the spread of disease.” In an interview with ABC News, Lucio Sevier said the facility “felt worse than jail.” The report did not address the trauma that children experienced on their journey to the U.S.-Mexico border. Many enter facilities with existing physical and emotional issues – issues not created by the facility itself. More than 5,000 migrants were quarantined due to exposure to mumps and chicken pox in June alone. As Breitbart News reported:  And the immigrants are not the only ones affected — border officials are suffering too. “Their morale is impacted. They’re tired. A lot of them have gotten sick. They’ve been exposed to flu, chicken pox, measles, mumps — all kinds of challenges in terms of the medical care,” Acting Department of Homeland Security (DHS) Secretary Kevin McAleenan said. “They’re spending time overnight in hospitals instead of patrolling the border.” Overcrowding is a massive issue. In May, the Department of Homeland Security inspector general found “dangerous overcrowding” at the El Paso Del Norte Processing Center, particularly. “Border Patrol agents told us some of the detainees had been held in standing-room-only conditions for days or weeks,” the office of inspector general concluded. Breitbart News also reported that “an inspection of the facility revealed that a cell with a maximum capacity of 12 people held 76, one with a maximum capacity of eight held 41 and one with a maximum capacity of 35 held 155 people.” Additionally, Breitbart News highlighted that facilities in the Rio Grande Valley Sector of South Texas were holding an average of 8,000 migrants per day. The overflow was so massive that Border Patrol requested the construction of temporary shelters and began flying migrants to other processing centers in Del Rio, Texas. The GOP is placing much of the blame squarely on Democrats in Congress, who refuse to provide funding for additional bed space and other essential resources that would improve conditions. “We’re doing a lot with what the Congress has given us, but again Congress refused to increase the bed space in the last appropriations bill,” Vice President Mike Pence told Face the Nation Sunday. “They continue to delay efforts on additional humanitarian support,” he continued. On Saturday, Ocasio-Cortez accused the GOP of supporting the construction of “mass concentration camps on the southern border.” “Reminder this admin is CHOOSING to round up refugees seeking asylum, fighting to not give children toothpaste or soap & making people sleep on dirt floors,” she tweeted, confirming the left’s position on withholding money that could improve conditions of the overcrowded facilities. “They say it’s bc of a lack of money,” she wrote. “You know what saves money? Not putting masses of people in internment in the first place”:  ",
      "date": "24 Jun 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez: Reagan Used ‘Racist’ Caricatures to Divide Americans",
      "url": "https://www.breitbart.com/clips/2019/03/10/alexandria-ocasio-cortez-reagan-used-racist-caricatures-to-divide-americans/",
      "subtitle": "null",
      "author": "Pam Key",
      "content": " Saturday at the South by Southwest Conference & Festivals in Austin, TX, Rep. Alexandria Ocasio-Cortez (D-NY) said former President Ronald Reagan used “racist,” caricatures to pit “white working-class Americans against brown and black working-class Americans.” Ocasio-Cortez said, “One perfect example, I think a perfect example of how special interests and the powerful have pitted white working-class Americans against brown and black working-class Americans in order to just screw over all working-class Americans, is Reaganism in the ’80s when he started talking about welfare queens.” She added, “So you think about this image; welfare queens and what he was really trying to talk about was he was painting this photo, he was painting this like really resentful vision of essentially black women who were doing nothing that were ‘sucks’ on our country. And it’s this whole tragedy of the commons type of thinking where it’s like because these one, this one specific group of people, that you are already kind of subconsciously primed to resent, you give them a different reason that’s not explicit racism but still rooted in a racist caricature. It gives people a logical reason, a ‘logical’ reason to say, ‘oh yeah, no, toss out the whole social safety net.'” (h/t The Daily Wire) Follow Pam Key on Twitter @pamkeyNEN",
      "date": "10 Mar 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Fact Check: ‘Girl from the Bronx’ Alexandria Ocasio-Cortez Grew Up in One of Richest U.S. Counties",
      "url": "https://www.breitbart.com/politics/2018/06/29/fact-check-girl-from-the-bronx-alexandria-ocasio-cortez-grew-up-in-one-of-richest-u-s-counties/",
      "subtitle": "Alexandria Ocasio-Cortez, the Democratic Party’s rising socialist star, describes herself as “a girl from the Bronx” to project a working-class image. However, this claim is only half true – to borrow a phrase from the left-wing website PolitiFact.",
      "author": "Joshua Caplan",
      "content": " “Well, you know, the president is from Queens, and with all due respect — half of my district is from Queens — I don’t think he knows how to deal with a girl from the Bronx,” Ocasio-Cortez said this week on The Late Show with Stephen Colbert. She similarly told the Washington Post: “I wasn’t born to a wealthy or powerful family — mother from Puerto Rico, dad from the South Bronx. I was born in a place where your Zip code determines your destiny.” The congressional candidate, who pulled off an upset win against high-ranking establishment Rep. Joe Crowley (D-NY), was indeed born in New York City’s Bronx borough. She currently lives there, too. So what’s the issue? Ocasio-Cortez omits that for most of her formative years, she was actually raised in one of the United States’ wealthiest counties. Around the age of five, Alexandria’s architect father Sergio Ocasio moved the family from the “planned community” of Parkchester in the Bronx to a home in Yorktown Heights, a wealthy suburb in Westchester County. The New York Times describes her childhood home as “a modest two-bedroom house on a quiet street.” In a 1999 profile of the area, when Ocasio-Cortez would have been ten years old, the Times lauded Yorktown Heights’ “diversity of housing in a scenic setting” – complete with two golf courses. The paper quoted Linda Cooper, the town supervisor, describing Yorktown as ”a folksy area where people can come, kick off their shoes, wander around, sit in a cafe, listen to a concert in the park, or go to the theater.” In a fun coincidence, Yorktown, which contains Yorktown Heights, is also home to a 436-acre state park named after – yes, one Donald J. Trump. After high school, Ocasio-Cortez studied international relations and economics at Boston University and worked for Sen. Edward M. Kennedy (D-MA). Only after college did Ocasio-Cortez return to the Parkchester complex, where she launched Brook Avenue Press, a publishing group aimed at improving the public image of the Bronx. Westchester County – which the Washington Post, in a glowing profile on Ocasio-Cortez, describes as only “middle class” – ranks #8 in the nation for the counties with the “highest average incomes among the wealthiest one percent of residents.” According to the Economic Policy Institute, the county’s average annual income of the top one percent is a staggering $4,326,049. Yorktown Heights, specifically, offers a sharp contrast from Bronx living. According to USA.com, the town’s population is 81 percent white, and median household income is $96,413 – nearly double the average for both New York state and the nation, according to data from 2010-2014. The 28-year-old’s far-left platform includes abolishing ICE, universal guaranteed employment, and Medicare for all. In an interview with CNN, Ocasio-Cortez said she supports impeaching President Trump, despite warnings from Rep. Nancy Pelosi (D-CA) to avoid the issue.",
      "date": "29 Jun 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Donald Trump Brands Alexandria Ocasio-Cortez Just ‘Cortez’",
      "url": "https://www.breitbart.com/politics/2019/07/17/donald-trump-brands-alexandria-ocasio-cortez-just-cortez/",
      "subtitle": "President Donald Trump specifically called out Rep. Alexandria Ocasio-Cortez on Wednesday, branding her simply “Cortez.”",
      "author": "Charlie Spiering",
      "content": " Trump said her full name before admitting that he would just call her “Cortez” in the future. “No, no, I don’t have time to go with three different names, we’ll call her Cortez, it takes too much time,” he noted during his campaign rally in Greenville, North Carolina on Wednesday night. Trump noted that Ocasio-Cortez compared border officials to Nazis running concentration camps and attacked them for detaining migrants and illegal immigrants. He defended the conditions of the government facilities hosting unaccompanied minors and other migrants claiming asylum at the border. “They have water, they have air conditioning, they have things that they have never seen,” Trump said, noting the squalid conditions in migrant’s home countries. Trump also criticized Ocasio-Cortez for describing contemporary Americans as “garbage.” “That’s you, that’s me, that’s all of us,” he said. “Remember Deplorables?” Trump asked referring to Hillary Clinton’s famous gaffe in 2016. “This sounds worse!”",
      "date": "17 Jul 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez: ‘The World Is Going to End in 12 Years if We Don’t Address Climate Change’",
      "url": "https://www.breitbart.com/politics/2019/01/21/alexandria-ocasio-cortez-the-world-is-going-to-end-in-12-years-if-we-dont-address-climate-change/",
      "subtitle": "Devout socialist Rep. Alexandria Ocasio-Cortez (D-NY) says that the world will stop spinning in a dozen years if “climate change” is left unchecked. Ocasio-Cortez is pushing a new plan in Congress she calls her “Green New Deal” to confront climate matters.",
      "author": "Matthew Boyle",
      "content": " “I think that the part of it that is generational is that millennials and Gen-Z and all these folks that come after us are looking up and we’re like, ‘The world is going to end in 12 years if we don’t address climate change,’ and your biggest issue is–your biggest issue is, ‘How are we going to pay for it?'” Ocasio-Cortez said. “And, like, this is the war; this is our World War II.”   Ocasio-Cortez was speaking during an interview with Ta-Nehisi Coutes, a leftist writer, at Riverside Church in Harlem in New York City for their Martin Luther King, Jr., Day MLKNOW event.  She was celebrated by the left for the stand she is taking for her “Green New Deal” plan:  But Ocasio-Cortez’s push for the idea that there is a crisis when it comes to the climate smacks of former Vice President Al Gore from back in 1992: Ocasio-Cortez at #MLKDAY event is Al Gore, circa 1992: \"We're like, the world is going to end in 12 years if we don't address climate change, and your biggest issue is how are we going to pay for it? And like, this is the war. This is our World war II.\" https://t.co/1XP2CpxtHD — David Martosko (@dmartosko) January 22, 2019  Back then, Gore claimed there was a “crisis” with regard to the climate:  Gore would spend the better part of the next couple of decades pushing theories that there was a climate crisis, in some cases falsely claiming–citing others–that the polar ice caps would melt by 2014. Gore made those claims in the mid-2000s, years before 2014, but 2014 has long since passed, and the polar ice caps are still there.",
      "date": "21 Jan 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez: Illegal Aliens Deserve ‘Right of Passage’ to Freely Enter U.S.",
      "url": "https://www.breitbart.com/politics/2018/07/02/alexandria-ocasio-cortez-illegal-aliens-deserve-right-of-passage-to-freely-enter-u-s/",
      "subtitle": "Socialist Democrat candidate for Congress Alexandria Ocasio-Cortez is taking her campaign for open borders even further to the political left, now saying that all border crossers and illegal aliens deserve a “right of passage” into the United States.",
      "author": "John Binder",
      "content": " Last week, Ocasio delivered an upset to establishment Democratic power player Rep. Joe Crowley (D-NY) in the district’s primary election, running on a platform that promises to abolish all immigration and border enforcement. Now, in an interview with AJ+, owned by the Al Jazeera Media Network, Ocasio says that not only should the U.S. abolish the Immigration and Customs Enforcement (ICE) agency — which is tasked with enforcing interior immigration laws — but that foreign nationals, border crossers, and illegal aliens are entitled to enter the U.S. Ocasio said: I think that immigration should be safe. I think that we should grant people a safe and documented right of passage. Republicans try all these scare tactics. And they go ‘Oh, open borders.’ Because they’re trying to incite fear. But what we really need to do is demilitarize a lot of what’s going on in terms of the detention of people, which has been happening for a very long time by the way. [Emphasis added] So I think that when we talk about replacing it with a system, we talk about having a system that is safe, that documents people effectively, that is also not rooted in the discrimination that our immigration system was initially built on. [Emphasis added] The first immigration law in the United States was the Chinese Exclusion Act. The first law about immigration in the United States was about how do we exclude a specific type of people. And our immigration system has really kind of evolved from that initial root and I don’t think it necessarily has to be that way. [Emphasis added]  Ocasio is increasingly shaping the Democratic Party’s open borders platform ahead of the 2018 midterm elections. Since her beating of Crowley in the Bronx, Democrats in the House and Senate, along with progressive liberals like Cynthia Nixon in New York, have been demanding ICE be abolished and all immigration enforcement be ended. House Democrats are now crafting legislation that would officially abolish ICE, while Sen. Bernie Sanders (I-VT) has been purged from the Democratic party for failing to endorse the “abolish ICE” campaign like his fellow left-wingers such as Sen. Elizabeth Warren (D-MA). The latest Harvard/Harris Poll, though, reveals that swing voters are overwhelmingly opposed to the Democrats’ plan to end all immigration enforcement across the U.S. Nearly 3-in-4 swing voters, about 73 percent, said they do not want ICE to be disbanded, as Breitbart News reported. Less than 30 percent of swing voters said they support the abolishment of ICE. Even Democrat voters are opposed to the abolishment of ICE. Nearly 60 percent of Democrats said they do not want ICE to be disbanded. Abolishing the deportation agency, as Breitbart News reported, would have allowed more than 1.6 million illegal aliens to have gone free throughout the U.S. in the last five years. John Binder is a reporter for Breitbart News. Follow him on Twitter at @JxhnBinder.",
      "date": "2 Jul 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez Unveils 4-Point Immigration Plan (Point #2: Climate Change)",
      "url": "https://www.breitbart.com/politics/2019/07/03/alexandria-ocasio-cortez-unveils-4-point-immigration-plan-point-2-climate-change/",
      "subtitle": "Rep. Alexandria Ocasio-Cortez (D-NY) has released a four-point immigration plan for dealing with the crisis at the U.S.-Mexico border.",
      "author": "Joel B. Pollak",
      "content": " Ocasio-Cortez, who toured facilities Monday where migrants are held after being caught crossing the border illegally —  and which she refers to as “concentration camps” — unveiled her plan via Twitter on Wednesday. The plan begins by calling for more aid to the countries of the “Northern Triangle” in Central America — El Salvador, Guatemala, and Honduras — on the apparent theory that more cash will address what Sen. Bernie Sanders (I-VT) calls the “root causes” of the migration. Next, Ocasio-Cortez — echoing presidential candidate Beto O’Rourke — demands action on climate change and the implementation of her “Green New Deal,” which she says will reduce the flow of “refugees.” Following that, Ocasio-Cortez calls for decriminalizing illegal border crossings, making illegal immigration a “civil” matter. Finally, she calls for massive spending by the government to stimulate the economy — though the U.S. economy is already growing quickly, and is at the lowest unemployment levels in nearly half a century.     Ocasio-Cortez’s plan does not include any provision for additional border security; for fighting Mexican cartels that smuggle people across the border; or for protecting women and children from sexual assault, violence, or trafficking. Joel B. Pollak is Senior Editor-at-Large at Breitbart News. He is a winner of the 2018 Robert Novak Journalism Alumni Fellowship. He is also the co-author of How Trump Won: The Inside Story of a Revolution, which is available from Regnery. Follow him on Twitter at @joelpollak.",
      "date": "3 Jul 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Pollak: New Democrat Heroine Alexandria Ocasio-Cortez Is an Anti-Israel Radical",
      "url": "https://www.breitbart.com/politics/2018/06/27/new-democrat-heroine-alexandria-ocasio-cortez-is-anti-israel-radical/",
      "subtitle": "Alexandria Ocasio-Cortez, the 28-year-old democratic socialist who became an instant Democratic Party heroine by unseating party caucus chair Rep. Joe Crowley (D-NY) in Tuesday’s New York primary, is an anti-Israel radical.",
      "author": "Joel B. Pollak",
      "content": " Her victory is a further sign of the Democratic Party’s slide toward the extreme left — and toward the anti-Israel left in particular. During her primary election, Ocasio-Cortez tweeted passionately about an alleged Israeli “massacre” of Palestinian “protesters” at the Gaza border, citing an Al Jazeera article.  But those killed at the Gaza border were not “protesters.” The vast majority — 50 of 62 — were members of Hamas, a terrorist organization devoted to the destruction of Israel and the murder of Jews. They were not demonstrating against Israel. They were attempting to breach the border so they could carry out attacks against Israeli civilians. Far from carrying out a “massacre,” Israeli forces showed extraordinary restraint, using pinpoint attacks to target the terrorists and avoid hitting the many human shields — including children — that Hamas marched to the fence. In the event, the so-called “peaceful” protesters set fire to Israeli fields nearby using kites equipped with explosives. Ocasio-Cortez brought up the Gaza deaths again after a debate with a Crowley surrogate who claimed — bizarrely — that the incumbent supported the move of the U.S. embassy in Israel from Tel Aviv to Jerusalem. (Like every other Democrat, Crowley failed to show up for the event, or for a party held to celebrate it in Washington, D.C.) That was too much for Ocasio-Cortez, who not only opposed the embassy move but also cited the Hamas dead in doing so:  The Jewish radicals of J Street will, no doubt, be thrilled to have another member of Congress who supports Hamas over Israel, and will rush to her defense. But for the few Democrats who still support Israel, her victory is worrying. Ocasio-Cortez’s anti-Israel views are of a piece with her radical policies in general — such as government health care for all, free college tuition, guaranteed federal jobs, and abolishing Immigration and Customs Enforcement (ICE). (At least she is consistent: she does not believe in a border fence with Gaza or a border wall with Mexico.) Her campaign even adopted the zombie-like “mic check” first seen at radical Occupy Wall Street protests in 2011. Ocasio-Cortez’s anti-Israel views, like her other socialist policies, are ill-informed and would have devastating consequences if enacted. She is not stupid: far from it, the Boston University graduate is whip-smart. But like other far-left millennials, she has mastered the finer details of a fictional universe. These are positions she will not easily walk back. Her victory has thrilled the Democratic base, but it spells trouble for the party, and for the country. Joel B. Pollak is Senior Editor-at-Large at Breitbart News. He is a winner of the 2018 Robert Novak Journalism Alumni Fellowship. He is also the co-author of How Trump Won: The Inside Story of a Revolution, which is available from Regnery. Follow him on Twitter at @joelpollak.",
      "date": "27 Jun 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Border Patrol’s Brandon Judd Fires Back at Alexandria Ocasio-Cortez for ‘Falsehoods’ About Migrant Facilities",
      "url": "https://www.breitbart.com/border/2019/07/01/alexandria-ocasio-cortez-brandon-judd-the-cameras-will-prove-aoc-lied-about-migrant-facilities-border/",
      "subtitle": "Brandon Judd, president of the National Border Patrol Council, fired back at Rep. Alexandria Ocasio-Cortez (D-NY) on Monday evening after she made incendiary claims about her visit earlier that day to several U.S. Customs and Border Protection (CBP) sites housing migrants who crossed the U.S. border illegally.",
      "author": "Breitbart Texas",
      "content": " Ocasio-Cortez, who continues to refer to CBP facilities as “concentration camps” despite being criticized by Jewish leaders, the U.S. Holocaust Museum, and Israel’s Yad Vashem, tweeted that women had been forced to drink water from toilets, among other atrocities:     Judd, whose union represents U.S. Border Patrol agents, spoke to Breitbart News’ Rebecca Mansour and Joel Pollak on Breitbart News Tonight on SiriusXM. He was furious at Ocasio-Cortez’s claims, and pushed back passionately. He said that cameras that film the facilities would show that Ocasio-Cortez was lying: “I’m calling on CBP to release that footage so they clearly show that she was treated with the utmost dignity and respect,” Judd said. “Nobody is forced to drink out of a toilet and nobody is told to drink out of a toilet,” Judd explained. “Its completely and totally a baseless and ridiculous allegation and frankly it needs to be investigated and she needs to be exposed.”  Other reports suggested that Ocasio-Cortez had actually been rude and confrontational toward law enforcement personnel, and had misinterpreted or misrepresented information she learned. The Washington Examiner specifically disputed Ocasio-Cortez’s claims about a woman, or women, being forced to drink from a toilet. During the interview with Breitbart New Tonight, Judd mentioned a previous statement by Ocasio-Cortez in which she stated that she would rather be morally correct than factually accurate. Judd disagreed. “How can you have the moral high ground if you are going to throw facts out the window and spew falsehoods?” he asked, adding: “And that’s what she is doing.” He continued, “She gives absolutely no contexts to these allegations that she is making and by not giving context she is trying to paint a false narrative and a false picture and she needs to be held accountable for that.” During the interview, Judd said Ocasio-Cortez was misleading the nation by painting a false picture of agents. When asked about Ocasio-Cortez’s claim that migrants were subjected to “psychological warfare” by agents who would wake them at odd hours and call them derogative names, Judd said, “Where is the proof? It’s very easy to throw out these allegations and say this is what’s happening.” Judd continued: “Let the cameras speak …The cameras will prove her wrong and they will prove that she is being false.” Breitbart News Tonight broadcasts live on the SiriusXM Patriot channel 125 weeknights from 9:00 p.m. to midnight Eastern, or 6:00 p.m. to 9:00 p.m. Pacific.",
      "date": "1 Jul 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez to Democrat Establishment: ‘We’re in Charge’",
      "url": "https://www.breitbart.com/politics/2019/02/23/alexandria-ocasio-cortez-democrat-establishment-were-charge/",
      "subtitle": "Rep. Alexandria Ocasio-Cortez (D-NY) warned the Democratic Party establishment Friday that supporters of the socialist Green New Deal are now “in charge.”",
      "author": "Justin Caruso",
      "content": " “If you don’t like the #GreenNewDeal, then come up with your own ambitious, on-scale proposal to address the global climate crisis,” Ocasio-Cortez said in a social media post. “Until then, we’re in charge – and you’re just shouting from the cheap seats”:  Ocasio-Cortez’s tweet came after Sen. Dianne Feinstein (D-CA) was confronted by a group of school children and teenage activists who urged her to support the Green New Deal. Video of the confrontation went viral on social media, and the activist group, Sunrise Movement, accused her of treating them with “smugness” and “disrespect”:  “You come in here, and you say it has to be my way or the highway. I don’t respond to that,” the California Democrat told the group, also saying that others should “listen a little bit.” The Green New Deal proposes a major restructuring of the entire United States economy with the goal of reversing climate change. Among other things, the plan seeks to guarantee the “economic security” of people “unwilling to work” and replace every combustion-engine vehicle. President Trump has mocked the Green New Deal, saying, “It sounds like a high school term paper that got a low mark.” ",
      "date": "23 Feb 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez Refuses Invitation to Visit Auschwitz Concentration Camp",
      "url": "https://www.breitbart.com/politics/2019/06/23/alexandria-ocasio-cortez-refuses-invitation-to-visit-auschwitz-concentration-camp/",
      "subtitle": "Rep. Alexandria Ocasio-Cortez (D-NY) refused Sunday to visit the Auschwitz concentration camp, after a Jewish group had invited her to tour that camp and others this summer to educate herself about the facts of the Holocaust.",
      "author": "Joel B. Pollak",
      "content": " Last Monday evening, Ocasio-Cortez compared detention facilities for illegal aliens caught crossing the U.S.-Mexico border to “concentration camps,” adding the phrase “never again,” which commonly refers to the Nazi Holocaust. The remark drew outrage and criticism, even from fellow Democrats. Nevertheless, Ocasio-Cortez doubled down, first claiming that she had not been referring to Nazi Germany, then drawing parallels to the U.S. internment of Japanese-Americans during the Second World War. “I will never apologize for calling these camps what they are,” she tweeted. Alan Dershowitz, who recently said he would support Joe Biden over President Donald Trump in 2020, said Ocasio-Cortez’s “concentration camp” claim made her a “Holocaust denier.” Bill Maher, host of HBO’s Real Time with Bill Maher, and a determined foe of President Trump, criticized her on his show Friday evening: “If you want to run a campaign based on reparations and concentration camps then it’s going to be very hard to win the election.” Rabbi Shmuley Boteach (who is also a Breitbart News contributor) published a full-page ad in the New York Times:  Numerous Holocaust educational foundations, including Israel’s Yad Vashem, offered to educate Ocasio-Cortez. Senior Yad Vashem historian Robert Rozett wrote in response to Ocasio-Cortez’s use of the term “concentration camp”: The term “concentration camps” has become a commonly used term for an array of Nazi camps all characterized by profound inhumanity and suffering. Even Auschwitz-Birkenau – the most infamous of the Nazi camps where more than one million people were murdered– was officially termed a Konzentrationslager (Concentration camp) in German. One group, From the Depths, issued an open invitation Friday for Ocasio-Cortez to join it on a tour of Holocaust sites: We at From The Depths, would like to invite you as our guest during your summer recess from The United Congress, to join us along with Holocaust Survivor, United States Citizen and President of From The Depths, Mr. Edward Mosberg on an educational tour, specifically built for legislators, of the German Nazi Concentration Camps. The educational tour will visit Mauthausen, Auschwitz-Birkenau and Majdanek Concentration Camps, amongst many other educational sites. But Ocasio-Cortez refused the invitation, citing the fact that Rep. Steve King (R-IA) had been on a similar tour:  King was rebuked by the U.S. House of Representatives earlier this year for appearing to support white supremacy. The Washington Post reported last year that he had met with a far-right Austrian group after completing his tour of Holocaust sites with From the Depths, which denied any knowledge of his subsequent travel plans in Europe. In May, President Donald Trump sent the first-ever official U.S. government delegation to the March of the Living, an annual march between Auschwitz and the Birkenau death camp nearby that commemorates victims of the Holocaust. Joel B. Pollak is Senior Editor-at-Large at Breitbart News. He is a winner of the 2018 Robert Novak Journalism Alumni Fellowship. He is also the co-author of How Trump Won: The Inside Story of a Revolution, which is available from Regnery. Follow him on Twitter at @joelpollak.",
      "date": "23 Jun 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez Discovers a Garbage Disposal, Asks if It Is ‘Environmentally Sound’",
      "url": "https://www.breitbart.com/politics/2019/05/07/alexandria-ocasio-cortez-discovers-a-garbage-disposal-asks-if-it-is-environmentally-sound/",
      "subtitle": "After her recent move to Washington D.C., Rep. Alexandria Ocasio-Cortez (D-NY) has allegedly discovered what a garbage disposal is, describing it as “terrifying” in a series of photos and videos she shared to her Instagram account.",
      "author": "Kyle Morris",
      "content": " “This DC apartment is bougie and has things I’ve never seen before. Like what is a garbage disposal really for,” Ocasio-Cortez asked in the video caption. “Is it better or worse to than throwing something in the garbage? Most importantly why is it so loud and yelling at me?” “OK everyone I need your help because I just moved into this apartment a few months ago and I just flipped a switch and it made that noise and it scared the daylights out of me,” the 29-year-old freshman congresswoman said in the video. AOC saying she’s never seen a garbage disposal and then proceeding to ask if it’s environmentally sound made me lose brain cells pic.twitter.com/gV5rKfmxp3 — Ashley StClair 🇺🇸 (@stclairashley) May 7, 2019  “I am told this is a garbage disposal,” Ocasio-Cortez explained – either publicly revealing her ignorance or engaging in supreme trolling. “I’ve never seen a garbage disposal. I never had one in any place I’ve ever lived. It is terrifying. I don’t know what to use it for, or what its purpose is. At one point, Ocasio-Cortez asked, “Is this environmentally sound?” Ocasio-Cortez later noted: “Is this what social mobility is? Using kitchen appliances you never saw growing up?” As she ended the message of curiosity, Ocasio-Cortez said, “All you people telling me to reach in and grab whatever’s there are just Republicans trying to test my health insurance.” “I’m onto you,” she added. Follow Kyle on Twitter @RealKyleMorris and Facebook.",
      "date": "7 May 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez: ‘I Will Never Apologize’ for ‘Concentration Camp’",
      "url": "https://www.breitbart.com/politics/2019/06/19/alexandria-ocasio-cortez-i-will-never-apologize-for-concentration-camp/",
      "subtitle": "Rep. Alexandria Ocasio-Cortez (D-NY) declared that she would never apologize for comparing detention facilities at the U.S. border with “concentration camps” in Nazi-occupied Europe.",
      "author": "Joel B. Pollak",
      "content": " Ocasio-Cortez made the comparison on a live Instagram video stream on Monday night: “That is exactly what they are. They are concentration camps,” she said, adding that the phrase “never again” — popularly associated with the memory of the Holocaust — “means something.” Ocasio-Cortez drew criticism all day Tuesday. But she kept doubling down and digging in, first insisting the detention camps met the definition of “concentration camps”; then trying to draw a distinction between “concentration camps” and “death camps”; then arguing that the U.S. had also used “concentration camps” when President Franklin Delano Roosevelt (a Democrat) interned Japanese-Americans during the Second World War. She also spent hours retweeting supportive messages from those on the left who attempted to defend her use of the “concentration camp” analogy. And she resumed her fight Wednesday morning, arguing that the U.S. had “run concentration camps before.” By then, even CNN had enough. John Avlon — no friend of President Donald Trump — said that Ocasio-Cortez had gone “across the line,” adding: “It’s not that hard to apologize. she should do it. It’s unacceptable.” House Minority Leader Kevin McCarthy (D-CA) likewise said that she should apologize. Ocasio-Cortez tweeted, apparently in response, that she would never apologize:  Ocasio-Cortez also thanked House Judiciary Committee Chairman Jerrold Nadler (D-NY) for arguing that the phrase “never again” could be interpreted more broadly. (Nadler told Breitbart News in 2016 that Democrats who used antisemitism to attack Sen. Bernie Sanders (I-VT) should be fired.) On Wednesday morning, Speaker of the House Nancy Pelosi (D-CA) refused to condemn Ocasio-Cortez’s statement. It was the second time in recent weeks that she has had to defend a member of her caucus accused of antisemitism: she also protected Rep. Ilhan Omar (D-MN) after repeated antisemitic remarks. Joel B. Pollak is Senior Editor-at-Large at Breitbart News. He is a winner of the 2018 Robert Novak Journalism Alumni Fellowship. He is also the co-author of How Trump Won: The Inside Story of a Revolution, which is available from Regnery. Follow him on Twitter at @joelpollak.",
      "date": "19 Jun 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez Calls Pelosi Racist: ‘Singling Out … Women of Color’",
      "url": "https://www.breitbart.com/politics/2019/07/10/alexandria-ocasio-cortez-calls-pelosi-racist-singling-out-women-of-color/",
      "subtitle": "Rep. Alexandria Ocasio-Cortez (D-NY) accused Speaker of the House Nancy Pelosi (D-CA) of racism on Wednesday, telling the Washington Post that Pelosi was guilty of “the explicit singling out of newly elected women of color.”",
      "author": "Joel B. Pollak",
      "content": " Pelosi and Ocasio-Cortez — also known as “AOC” — have feuded ever since the “democratic socialist” newcomer upset incumbent Rep. Joe Crowley (D-NY), a member of the party’s leadership team under Pelosi, in last year’s primary race. The latest spat began on Saturday, when columnist Maureen Dowd of the New York Times reported that Pelosi had disparaged AOC and her allies on the left (original links): I asked Pelosi whether, after being the subject of so many you-go-girl memes for literally clapping back at Trump, it was jarring to get a bad headline like the one in HuffPost that day — “What The Hell Is Nancy Pelosi Doing?” The article described the outrage of the Squad, as Alexandria Ocasio-Cortez of New York, Ilhan Omar of Minnesota, Rashida Tlaib of Michigan and Ayanna Pressley of Massachusetts are known. Pelosi feels that the four made themselves irrelevant to the process by voting against “our bill,” as she put it, which she felt was the strongest one she could get. “All these people have their public whatever and their Twitter world,” she said. “But they didn’t have any following. They’re four people and that’s how many votes they got.” AOC responded on Twitter by calling out Pelosi for her past efforts to disparage the party’s “democratic socialist” wing:  On Wednesday, Pelosi held a meeting with her caucus in which she reportedly insisted on party unity, and discouraged House members from tweeting criticisms of each other or the leadership. Asked by reporters whether she regretted criticizing AOC in public, Pelosi said: “Regrets is [sic] not what I do.” Ocasio-Cortez did not tweet. But she did talk to the Washington Post, the newspaper of record in the capital city: “When these comments first started, I kind of thought that she was keeping the progressive flank at more of an arm’s distance in order to protect more moderate members, which I understood,” Ocasio-Cortez told The Washington Post. “But the persistent singling out . . . it got to a point where it was just outright disrespectful . . . the explicit singling out of newly elected women of color.” The Post noted that even though Pelosi had posed with AOC and other “Justice Democrats” on the cover of Rolling Stone earlier this year, the two have not spoken “one-on-one” since February.  Pelosi was apparently upset that Ocasio-Cortez had declined to serve on a select committee on climate change, preferring to launch her own “Green New Deal.” Joel B. Pollak is Senior Editor-at-Large at Breitbart News. He earned an A.B. in Social Studies and Environmental Science and Public Policy from Harvard. He is a winner of the 2018 Robert Novak Journalism Alumni Fellowship. He is also the co-author of How Trump Won: The Inside Story of a Revolution, which is available from Regnery. Follow him on Twitter at @joelpollak.",
      "date": "10 Jul 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez Learns to Love War: Blasts Trump’s Syria Withdrawal",
      "url": "https://www.breitbart.com/national-security/2019/10/08/alexandria-ocasio-cortez-learns-to-love-war-blasts-trumps-syria-withdrawal/",
      "subtitle": "Rep. Alexandria Ocasio-Cortez (D-NY) attacked President Donald Trump’s proposal to withdraw remaining U.S. troops from Syria, tweeting Tuesday that a pullout could have “catastrophic consequences.”",
      "author": "Joel B. Pollak",
      "content": "  Ocasio-Cortez’s stance is a complete reversal of her earlier position on the war in Syria and other “endless wars” overseas. She ran in 2018 on a pledge to end the war in Syria and elsewhere: “Alexandria believes that we must end the “forever war” by bringing our troops home, and ending the air strikes that perpetuate the cycle of terrorism throughout the world,” her 2018 campaign website said: Since the invasion of Iraq in 2003, the United States has entangled itself in war and occupation throughout the Middle East and North Africa. As of 2018, we are currently involved in military action in Libya, Syria, Iraq, Afghanistan, Yemen, Pakistan, and Somalia. Hundreds of thousands of civilians in these countries have been killed either as collateral damage from American strikes or from the instability caused by U.S. interventions. Millions more have fled their broken countries, contributing to the global refugee crisis.\n\n… According to the Constitution, the right to declare war belongs to the legislative body, and yet many of these global acts of aggression have never once been voted on by Congress. In some cases, we’ve even acted unilaterally, without the backing of the United Nations. America should not be in the business of destabilizing countries. While we may see ourselves as liberators, the world increasingly views us as occupiers and aggressors. Alexandria believes that we must end the “forever war” by bringing our troops home, and ending the air strikes that perpetuate the cycle of terrorism throughout the world. By bringing our troops home, we can begin to heal the wounds we’re opening by continuing military engagement. We can begin to repair our image. We can reunite military families, separated by repeated deployments. We can become stronger by building stronger diplomatic and economic ties, and by saving our armed forces only for when they’re truly needed. In addition, Ocasio-Cortez has repeatedly used her widely-followed Twitter account to attack U.S. wars in Syria and elsewhere:           Ocasio-Cortez did not provide an alternative solution for Syria, or for Kurdish security, or relations with Turkey. Joel B. Pollak is Senior Editor-at-Large at Breitbart News. He earned an A.B. in Social Studies and Environmental Science and Public Policy from Harvard College, and a J.D. from Harvard Law School. He is a winner of the 2018 Robert Novak Journalism Alumni Fellowship. He is also the co-author of How Trump Won: The Inside Story of a Revolution, which is available from Regnery. Follow him on Twitter at @joelpollak.",
      "date": "8 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez",
      "url": "https://www.breitbart.com/tag/alexandria-ocasio-cortez/",
      "subtitle": "null",
      "author": "Hannah Bleau",
      "content": "                             ",
      "date": "19 Oct 2019, 2:56 PM PDT",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    }
  ]
}