{
  "articles": [
    {
      "title": "Elizabeth Warren Pledges ‘Executive Action in Every Corner’ for Gun Control",
      "url": "https://www.breitbart.com/politics/2019/08/15/elizabeth-warren-pledges-executive-action-in-every-corner-for-gun-control/",
      "subtitle": "On Thursday Democrat presidential hopeful Elizabeth Warren tweeted a video clip in which she pledged “executive action in every corner” for gun control.",
      "author": "AWR Hawkins",
      "content": " Warren said, “40,000 Americans died last year from gun violence.” Warren’s claim is actually a loose reference to the Centers for Disease Control and Prevention numbers for 2017–the most recent numbers–which show 39,773 people died in a firearm-related death. However, Warren did not mention that nearly two-thirds of those deaths were due to suicide, not “gun violence.” In fact, the surge in the gun deaths was the result of a surge in suicides. And the Chicago Tribune’s Steven Chapman notes that “the increase was actually greater for the non-firearm suicide rate than for the firearm suicide rate.” But Warren presented it all as due to “gun violence,” before pledging to more gun control, which included a promise to reduce the number of “gun violence” deaths by 80 percent. Down Range with AWR Hawkins.  Sign up today! She said, “We will make change, we’ll figure out what works, and then we’ll make some more change and some more change.” Warren added, “I will take executive action in every corner, with the Department of Justice, with ATF, to move as much as I can.” She then noted that Congress will have a role too, but she suggested they are frozen in place because “the gun industry controls Washington.” She described such influence as “corruption” and said “real change, meaningful change, starts with breaking up the corruption in Washington, breaking the stranglehold of the gun industry and the NRA.” AWR Hawkins is an award-winning Second Amendment columnist for Breitbart News and the writer/curator of Down Range with AWR Hawkins, a weekly newsletter focused on all things Second Amendment, also for Breitbart News. He is the political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com. Sign up to get Down Range at breitbart.com/downrange.",
      "date": "15 Aug 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Report: Hillary Clinton Speaking to Elizabeth Warren Behind the Scenes",
      "url": "https://www.breitbart.com/politics/2019/09/08/report-hillary-clinton-speaking-to-elizabeth-warren-behind-the-scenes/",
      "subtitle": "Sen. Elizabeth Warren (D-MA) has been speaking to Hillary Clinton behind the scenes throughout her presidential bid, according to sources who spoke with NBC News.",
      "author": "Hannah Bleau",
      "content": " It was widely reported Clinton met with several potential 2020 candidates at the beginning of the year, including former Colorado Gov. John Hickenlooper (D), Sen. Cory Booker (D-NJ), and Sen. Elizabeth Warren (D-MA). However, the failed presidential candidate has been speaking to Warren in recent months, according to sources who spoke to NBC News. Sources are not sure how many conversations Warren has had with Clinton, and neither has made obvious attempts to make their conversations nor the nature of them known to the general public. NBC News reports: One source was aware of just one additional call between Warren and Clinton since then. But a person who is close to Clinton said the contact has been substantial enough to merit attention, describing a conversation between the two as seemingly recent because it was “front of mind” for her. “That has clearly not gone unnoticed, and I think she really appreciates that,” the person close to Clinton said. It is established both women want President Trump out of the White House, though it is possible that Warren has failed to make her points of contact explicitly known due to the optics, as Clinton – another female who attempted to break the glass ceiling – lost handily to Trump in 2016. “To the extent that Democratic primary voters fear a repeat scenario in 2020 — and to the extent that she’s competing with Sanders for the votes of progressives — there may be good reason for Warren to keep her distance from Clinton publicly,” NBC News reports. It notes Clinton could be a valuable asset in the event Warren “finds herself battling for delegates and superdelegates” at next year’s Democratic National Convention in Milwaukee, Wisconsin– the same state Clinton lost in 2016. “Hillary Clinton would absolutely have influence over a number of delegates to this convention,” Deb Kozikowski, the vice chair of the Massachusetts Democratic Party, told NBC News. “It would be counterproductive for the first woman nominee of the party to not be supportive of a woman who may go over that threshold,” Kozikowski added. According to a Democrat strategist who spoke to NBC News on the condition of anonymity, Clinton admires Warren’s campaign. “She has applauded her about being serious and disciplined and loves that she is sticking to her guns,” the strategist said. Warren’s team would not provide NBC News with details on Clinton and Warren’s relationship or their conversations, but the outlet admits that the duo’s contact “appears to have been more than a courtesy call or a trip to the principal’s office.”",
      "date": "8 Sep 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "California Poll: Elizabeth Warren Surges Past Kamala Harris, Joe Biden in Golden State",
      "url": "https://www.breitbart.com/politics/2019/07/16/california-poll-elizabeth-warren-surges-past-kamala-harris-joe-biden-in-golden-state/",
      "subtitle": "A California poll of Democrat primary voters in the state has Sen. Elizabeth Warren (D-MA) surging past favorite daughter Sen. Kamala Harris (D-CA) and former Vice President Joe Biden in the Golden State ahead of the second debates upcoming at the end of July.",
      "author": "Matthew Boyle",
      "content": " The tracking survey of 4,050 respondents, conducted by Capitol Weekly, has Warren at 24.8 percent in California, while Harris is at 20.3 percent and Biden is at 19.6 percent. Sen. Bernie Sanders of Vermont is at 15.6 percent and South Bend, Indiana, mayor Pete Buttigieg is down at 7.7 percent. The only other candidate to break the 2 percent threshold, at 2.4 percent, is former Rep. Robert Francis “Beto” O’Rourke (D-TX).  The fact that Warren is leading Harris and Biden in California, one of the biggest states in the union and an important early battleground state should the race last longer than just Iowa, New Hampshire, and South Carolina, is particularly important and interesting. It suggests that Harris, who led a different survey out this week in California by one point over Warren, is having difficulty locking up her home state. It also suggests Biden is on the decline in a big way in key Democrat states, and will need to lock in some solid victories ahead of California in states like Iowa or South Carolina if he is to win the nomination. South Carolina polling has had Biden with consistent strong leads over the rest of the field. The previous California survey, from Change Research, had Biden down in fourth place in California at 17 percent, with Harris out in front at 23 percent and Warren right behind her at 22 percent. Sanders came in third in that survey at 20 percent. While Warren is out in front in the new Capitol Weekly poll, there are also some interesting data points when it comes to survey respondents’ second choice–with regard to both Harris and Warren. “While the initial vote is the most watched metric, there are underlying measures that can also be extremely valuable to track over time.  One of these is the ‘second choice’ of voters – those candidates who are consistently viewed as a backup option for voters as their primary choice might falter later in the process,” Capitol Weekly wrote in a piece about the survey data. “On this metric, we see Harris and Warren consistently at the top of the rankings. Within the CA120 tracking infographic you can actually select any candidate to identify whose voters are likely to support as a second choice. Harris is the second choice of backers of every single candidate in the poll (including the recently exited Congressman Eric Swalwell) except for those who prefer Sanders, whose support goes to Warren as a second choice.”",
      "date": "16 Jul 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Fact Check: Elizabeth Warren Exaggerates Crowd Sizes for the Third Time",
      "url": "https://www.breitbart.com/2020-election/2019/09/18/fact-check-elizabeth-warren-exaggerates-crowd-sizes-for-the-third-time/",
      "subtitle": "CLAIM: Sen. Elizabeth Warren (D-MA) “didn’t have 20,000 people” at her rally in Manhattan on Monday night, according to President Donald Trump.",
      "author": "Joel B. Pollak",
      "content": " As Trump suggested Tuesday, Warren appears to have exaggerated the size of her rally crowd in Washington Square on Monday night — apparently the third time she has done so in recent weeks. Warren’s campaign claimed that 20,000 people had shown up for the event. However, as Breitbart News reported, New York City Parks said that the park did not hold more than 10,000 — the maximum permitted for the event. Last month, in Minnesota, the Warren campaign claimed that she had drawn a crowd of 12,000 to the campus of Macalester College in St. Paul, Minnesota. But college officials told Breitbart News that the field only had capacity for 3,000, with some “spillover.” Given that the event had been moved outdoors out of concern that the largest indoor hall, at a capacity of 4,000, would be too small, a generous estimate would have put the crowd at 6,000. Nevertheless, many media outlets reported the 12,000 figure, though the only source for that claim was the Warren campaign, and there was no official count from local police, campus officials, or fire marshals. In New Hampshire, the Warren campaign claimed that a crowd of 700 people attended an outdoor town hall event on a farm in Franconia. But Breitbart News — which was there — judged the crowd at “over 300,” based on a visual estimate. The pattern appears to be that the Warren campaign claims twice the attendance that can actually be confirmed. There is no doubt that Warren is drawing the largest crowd of any Democratic candidate right now — certainly larger than frontrunner Joe Biden. Sen. Bernie Sanders (I-VT) is also filling halls but has shied away from larger arenas. Warren’s aim appears to be to compare her crowd sizes not with those of her Democratic rivals, but with those of President Donald Trump, who regularly draws numbers in the tens of thousands. The message Warren is sending to Democratic voters is that she will be the most competitive general election candidate against Trump. It is an indirect attack on the “electability” argument that Biden has made to the Democratic Party primary electorate. The media seem eager to oblige her claims — and they have been caught underestimating Trump’s crowd sizes. Last month, he broke an attendance record at the SNHU Arena in Manchester, New Hampshire, but mainstream outlets ran inaccurate stories about empty seats. But Trump has been known to exaggerate crowd size in the past. In this case, Warren is learning from the master. Joel B. Pollak is Senior Editor-at-Large at Breitbart News. He earned an A.B. in Social Studies and Environmental Science and Public Policy from Harvard College, and a J.D. from Harvard Law School. He is a winner of the 2018 Robert Novak Journalism Alumni Fellowship. He is also the co-author of How Trump Won: The Inside Story of a Revolution, which is available from Regnery. Follow him on Twitter at @joelpollak.",
      "date": "18 Sep 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Elizabeth Warren Takes Huge Lead in Iowa Poll",
      "url": "https://www.breitbart.com/politics/2019/08/15/elizabeth-warren-takes-huge-lead-in-iowa-poll/",
      "subtitle": "The tide may be turning in Iowa, where Sen. Elizabeth Warren (D-MA) has taken a huge lead, according to an Iowa Starting Line-Change Research poll released Thursday.",
      "author": "Hannah Bleau",
      "content": " The poll, taken August 9–11, surveyed 621 likely Iowa Democrat caucus-goers. Of those, 28 percent said they support Warren, putting her 11 points ahead of Sen. Bernie Sanders (I-VT) and Joe Biden (D), who garnered 17 percent support each. Mayor Pete Buttigieg (D) toppled Sen. Kamala Harris (D-CA) for fourth place, with 13 percent support to Harris’s eight. Both Sen. Cory Booker (D-NJ) and Beto O’Rourke (D) saw three percent support. The remaining candidates garnered two percent or less. The poll’s margin of error is +/- 3.9 percent. Warren – by far – has experienced the biggest jump in the Hawkeye State, seeing a 16 point gain since May. As Iowa Starting Line pointed out: May Poll (change to August)\n\nJoe Biden: 24% (-7)\n\nBernie Sanders: 24% (-7)\n\nPete Buttigieg: 14% (-1)\n\nElizabeth Warren: 12% (+16)\n\nKamala Harris: 10% (-2)\n\nBeto O’Rourke: 5% (-2) This follows Sanders’ surge in the early primary state New Hampshire. A Gravis Marketing poll released last week showed the socialist senator leading the pack, six points ahead of Biden, who dropped to second place. As Breitbart News reported: Sanders leads the pack with 21 percent support, followed by Joe Biden (D) with 15 percent support, and Sen. Elizabeth Warren (D-MA) with 12 percent. Warren’s failure to capture second place is significant, as she and Sanders share similar far-left ideologies and represent New England states neighboring New Hampshire. Mayor Pete Buttigieg (D) came in with eight percent, one point above Sen. Kamala Harris’s (D-CA) seven percent support, further signifying the loss of the momentum she sufferred after the first Democrat debate. However, Biden is still the fan favorite in South Carolina, another crucial early primary state. As Breitbart News reported: A survey released by Change Research and The Post and Courier on Wednesday shows Biden leading in South Carolina by double digits. Conducted between August 9 through August 12 by surveying 521 likely primary voters, the poll is one of the first out of the Palmetto State since the second Democrat presidential debate. When stacked up against candidates in the field of 2020 Democrats, Biden takes first place with 36 percent support — an advantage of 19 points over his nearest challenger. Coming in second place was Sen. Elizabeth Warren (D-MA) at 17 percent, although she narrowly beat out Sen. Bernie Sanders (D-VT), who landed in third place with 16 percent support, for the spot. Typically, a candidate who wins two of the three early primary states – New Hampshire, Iowa, and South Carolina – tends to secure the nomination. However, it will make for an interesting primary if Sanders maintains his lead in the Granite State and Warren’s support grows in Iowa.",
      "date": "15 Aug 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Elizabeth Warren: More Action Against Gun Violence ‘Now’",
      "url": "https://www.breitbart.com/politics/2019/10/08/elizabeth-warren-more-action-against-gun-violence-now/",
      "subtitle": "Democrat presidential hopeful Elizabeth Warren is calling for more action against gun violence “now.”",
      "author": "AWR Hawkins",
      "content": " Her calls are in response to the October 6, Kansas City bar shooting in which four people were killed. Breitbart News reported that police were looking for two shooting suspects following the incident. One of the suspects was apprehended on Sunday, and KCTV reports that the second shooting suspect is still on the loose. The shooting followed an altercation at the bar, after which the two suspects allegedly left the bar, retrieved handguns, then returned and opened fire. Warren responded to the incident the day after it happened, tweeting: Down Range with AWR Hawkins.  Sign up today!  Democrat presidential hopeful Robert “Beto” O’Rourke seized on the Kansas City bar shooting to push more gun control on Sunday, and Kamala Harris, another Democrat presidential hopeful, pushed more gun control too. Harris tried to use the bar shooting to shame Sen. Majority Leader Mitch McConnell (R-KY) into holding a gun control vote.  Harris did not list a gun control that could have prevented the bar shooting. AWR Hawkins is an award-winning Second Amendment columnist for Breitbart News and the writer/curator of Down Range with AWR Hawkins, a weekly newsletter focused on all things Second Amendment, also for Breitbart News. He is the political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Sign up to get Down Range at breitbart.com/downrange.",
      "date": "8 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Poll: Warren Top Choice of Democrat College Students, Majority Find Biden ‘Unfavorable’",
      "url": "https://www.breitbart.com/politics/2019/10/17/poll-warren-top-choice-of-democrat-college-students-majority-find-biden-unfavorable/",
      "subtitle": "Sen. Elizabeth Warren (D-MA) is topping presidential rival Sen. Bernie Sanders (I-VT) in support among Democrat college students, the latest College Pulse/Chegg Election tracker results show.",
      "author": "Hannah Bleau",
      "content": " College Pulse and Chegg surveyedover 1,500 college students weekly in order to get a finger on the pulse of the presidential preferences of college students across the country. The results, based on Democrat and Democratic-leaning undergraduates, are updated once a week. Students were asked, “Regardless of who you may support in the upcoming 2020 presidential election, who would you most like to be the Democratic nominee for President?” The latest update, on October 15, showed Warren leaping to first place with 32 percent to Sanders’ 27 percent. This is significant, as Sanders has dominated as the frontrunner since the tracker’s formal launch in March. On March 26, Warren only had six percent support in the poll compared to Sanders’ 33 percent. The “gender gap” on the two candidates is hitting an “all-time high,” according to College Pulse. Among female college students, Warren leads 34 percent to 27 percent, while Sanders leads among male college students with 31 percent to Warren’s 21 percent. No other candidate comes close to Warren or Sanders, with Joe Biden (D) falling to a distant third with just ten percent support among Democrat and Democrat-leaning college students– a long fall from the 22 percent he garnered in March. Andrew Yang (D) falls closely behind Biden with nine percent support, followed by Mayor Pete Buttigieg (D), Beto O’Rourke (D), and Sen. Kamala Harris (D-CA), with seven percent, four percent, and three percent, respectively. The margin of error was not immediately available. Harris’s three percent support marks an “all-time low” for the candidate,” College Pulse assessed. The poll also found that the majority of college students, 54 percent, have an unfavorable view of Biden. Only 45 percent have a favorable view of the former vice president, whose role in the questionable foreign business dealings of his son has been a topic of controversy in recent weeks. The vast majority of Democrat and Democrat-leaning college students, 89 percent, have a favorable view of Warren and Sanders, the survey showed.",
      "date": "17 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Nolte: Elizabeth Warren Tries to Buy Off American Indian with 1/1024th Apology",
      "url": "https://www.breitbart.com/politics/2019/08/20/nolte-elizabeth-warren-tries-to-buy-off-american-indian-with-1-1024th-apology/",
      "subtitle": "Looking to buy her way out of decades of identity fraud,  Sen. Elizabeth Warren (D-MA) is using billions of our tax dollars and what can only be described as 1/1024th of an apology.",
      "author": "John Nolte",
      "content": " What is this all about? One thing, and one thing only. Should she win the Democrat nomination for president, the last thing she wants is the spectacle of American Indians protesting the fact that for decades, and as a means to advance her academic and political fortunes, The Whitest Woman In The World falsely identified herself as a Cherokee Indian. And this fraud extend through last year, until Warren was 69-years-old. Because it was just last year, in a cynical and audaciously dishonest effort to prove she was indeed a member of Cherokee Nation, Warren lied about the results of her DNA test; a DNA test that actually proved she has no more Native blood than any other white person. In fact, because her genome could range from 1/64 to 1/1024 “Native,” she probably has less. So now, in order to buy off the American Indian, she’s offering billions of our tax dollars for something called the Honoring Promises to Native Nations Act. Worse, in keeping with her tradition of speaking with forked tongue, while appearing before an American Indian advocacy group in Iowa this week, she offered up 1/1024th of an apology for decades and decades of identity fraud and lies. Like anyone who’s been honest with themselves, I know that I have made mistakes. I am sorry for harm I have caused. I have listened and I have learned a lot, and I am grateful for the many conversations we have had together. What is she talking about…? What is she apologizing for…? Does anyone know? I don’t understand the words that are coming out her mouth because she has never once admitted to doing anything wrong… I this an apology for littering? For filling up her gas tank and taking off? Did she engage in some underage drinking? Did she cheat on her husband, kick a puppy, run with scissors, cheat at Monopoly, shoot a man in Reno just to watch him die? What the hell is she apologizing for…? And how can she apologize when she refuses to admit there has been no wrongdoing? Elizabeth Warren has admitted to NO mistakes, but she thinks she can apologize without admitting to those mistakes, without telling us what those mistakes were. Sorry, no, it doesn’t work that way. Here she is in front of a group of American Indians looking to buy their support, silence, and souls with the apology-equivalent of glass beads. Listen, I am all in favor of second chances, of accepting apologies, of moving on, and if Warren had half a brain in that shrill, neurotic head of hers, she would have used that DNA test as an out, as a way to say, “You know what, I was wrong. I should not have depended on family lore. I apologize.” But no, instead she counted on the fake news media to shove the lie through, to make it stick, but made the mistake of doing so in an era when that is no longer possible. Hey, 50 years ago the fake news media could convince the public that Ted Kennedy leaving a woman to die was just another “Kennedy family tragedy,” but in the reality of today’s New Media, those days are long gone. And now she’s doubling down, obfuscating, dissembling, apologizing while not apologizing, which means nothing has changed. Until last year — keep that in mind — until just last year, this whiter than white woman sought to exploit the identity of the American Indian for her own personal gain, and she is still doing it — still exploiting the Indian; looking to buy them off with empty promises, with a non-apology-apology, with rhetorical trinkets. Follow John Nolte on Twitter @NolteNC. Follow his Facebook Page here.",
      "date": "20 Aug 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Elizabeth Warren, Joe Biden to Take Center Stage at Democrat Debate",
      "url": "https://www.breitbart.com/2020-election/2019/09/09/elizabeth-warren-joe-biden-to-take-center-stage-at-democrat-debate/",
      "subtitle": "For the first time, the two Democratic frontrunners — former Vice President Joe Biden and Sen. Elizabeth Warren (D-MA) — will be on center stage together at the next Democrat debate on Thursday evening in Houston, Texas.",
      "author": "Joel B. Pollak",
      "content": " ABC News released the podium order on Monday evening, with “the highest polling candidates near the center”: Warren has thus far avoided appearing on the same stage as Biden, and was placed instead on the first night of the first two debates — as the lone first-tier candidate on the first night in Miami, Florida; then alongside Sanders on the first night in Detroit, Michigan. (Alternatively, Biden has avoided appearing with Warren, who some pundits consider the most serious threat to Biden’s national lead.) On Thursday, Biden will also be flanked by Sen. Bernie Sanders (I-VT), who is the other major frontrunner. The debate will be held at Texas Southern University, a public, historically black university. It will air on ABC and on Univision (with translation in Spanish) from 8:00 p.m. to 11:00 p.m. Eastern Daylight Time on Thursday, and will also appear on the network’s other platforms and live streams. Joel B. Pollak is Senior Editor-at-Large at Breitbart News. He earned an A.B. in Social Studies and Environmental Science and Public Policy from Harvard College, and a J.D. from Harvard Law School. He is a winner of the 2018 Robert Novak Journalism Alumni Fellowship. He is also the co-author of How Trump Won: The Inside Story of a Revolution, which is available from Regnery. Follow him on Twitter at @joelpollak.",
      "date": "9 Sep 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Elizabeth Warren Surges into Statistical Tie with Joe Biden in National Poll",
      "url": "https://www.breitbart.com/politics/2019/08/14/elizabeth-warren-surges-statistical-tie-joe-biden-national-poll/",
      "subtitle": "Sen. Elizabeth Warren (D-MA) has surged into a statistical tie with Democrat 2020 frontrunner Joe Biden (D), according to an Economist/YouGov poll released this week.",
      "author": "Hannah Bleau",
      "content": " YouGov surveyed 1500 U.S. adults (1127 of which are registered voters) August 10–13 and asked likely Democrat primary voters, “If the Democratic presidential primary or caucus in your state were held today, who would you vote for?” Biden came in with 21 percent support among Democrat primary voters. Warren – who has found herself on Biden’s heels in recent weeks – came right up behind him with 20 percent support. With a margin of error of +/- 2.6 percent (when adjusted for weighting) and +/- 3 percent (for registered voters), the two are statistically tied for first place. Sen. Bernie Sanders (I-VT) came in third place with 16 percent support – a gain of three percent in one week. Sen. Kamala Harris (D-CA) came in with eight percent support, followed by Beto O’Rourke (D) and Mayor Pete Buttigieg (D), who garnered five percent each. Sen. Cory Booker (D-NJ) and Rep. Tulsi Gabbard (D-HI) came in right behind them with two percent support. The remaining candidates garnered one percent support or less. Eleven percent said they were “not sure” whom they would choose:  The poll echoes the findings of additional national surveys, showing Sanders and Warren on the rise and Harris at a stalemate, losing most of the momentum she gained after her fiery performance at the first debate in June. It is true that the candidate who wins two of the three early primary states – New Hampshire, Iowa, and South Carolina – tends to secure the nomination, but Biden does not have all three locked up. While the former vice president seems to have an iron grip on the early primary state of South Carolina, a recent poll shows Sanders surging in New Hampshire, topping Biden by six percent:  Biden is leading in Iowa by less than ten points, with Warren firmly in second place.",
      "date": "14 Aug 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Elizabeth Warren Tells NYC Crowd Trump Is ‘Corruption in the Flesh’",
      "url": "https://www.breitbart.com/politics/2019/09/17/elizabeth-warren-tells-nyc-crowd-trump-is-corruption-in-the-flesh/",
      "subtitle": "Sen. Elizabeth Warren (D-MA) spoke to enthusiastic supporters in Washington Square Park on Monday evening and declared President Trump is “corruption in the flesh.”",
      "author": "Hannah Bleau",
      "content": " Warren delivered a wide-ranging speech focusing on her recently unveiled anti-corruption plan and took aim at the president directly, calling him “corruption in the flesh.” “Donald Trump is corruption in the flesh. He’s sworn to serve the people of the United States, but he only serves himself and his partners in corruption,” she said, accusing him of dividing people based on religion, race, and gender. “He tries to divide us. White against black, Christian against Muslim, straight against queer and trans, and everyone against Democrats,” Warren said. “Because if we’re all busy fighting each other, no one will notice that he and his buddies are stealing more and more our country’s wealth and destroying the future for everyone else,” she added:  Warren also used the opportunity to resurrect the Muller report – which found no evidence of collusion or conspiracy between the Trump campaign and Russia – and called for Trump’s impeachment. “And yeah. When we’re talking corruption, we need to call it out in the Oval Office,” Warren said. “I read all 448 pages of the Mueller report. No one is above the law, not even the United States president.” “Impeachment is our Constitutional duty,” she added. Warren’s campaign has touted the Washington Square Park event as her biggest rally to date, with 20,000 in attendance. However, NYC Parks told Breitbart News that it could not corroborate the campaign’s estimates and that it issued a permit for 8,000 – 10,000, with the park’s capacity at roughy 10,000.",
      "date": "17 Sep 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Fake ‘Big Tech Critic’ Elizabeth Warren Calls for More Tech Censorship",
      "url": "https://www.breitbart.com/tech/2019/07/01/fake-big-tech-critic-elizabeth-warren-calls-for-more-tech-censorship/",
      "subtitle": "Democrat presidential candidate Elizabeth Warren has positioned herself as a critic of Silicon Valley and even criticized tech censorship in the recent past — but now she’s reversed her stance, calling for more policing of lawful speech by the unaccountable Masters of the Universe in Silicon Valley.",
      "author": "Allum Bokhari",
      "content": " In March, Warren called out Facebook for its “ability to shut down a debate.” The context was Facebook’s decision to temporarily take down several of her posts that called for the breakup of  the tech giant.  The text of her proposal to break up big tech calls for the designation of major tech platforms as “platform utilities,” that would be required to “meet a standard of fair, reasonable, and nondiscriminatory dealing with users” — if this was meant in good faith, it would mean that users couldn’t be discriminated against on the basis of their political viewpoints or opinions. But Warren doesn’t actually believe that. Far from opposing big tech’s ability to, in her words, “shut down a debate,” she fully supports it — when the debate has been started by someone she disagrees with. Warren recently called on big tech to crack down on speech she disagrees with, after black Twitter user Ali Alexander questioned whether Kamala Harris, a second-generation Jamaican-Indian, could fully lay claim to the American black identity. Warren today took to Twitter called the insinuation “racist and ugly” and reminded tech companies that they could “stop these vile lies dead in their tracks.” Instead of simply challenging or denouncing the claim in an open marketplace of ideas, Warren went further — she wants tech companies to exercise greater control over that marketplace, so that rogue ideas can never spread in the first place.  In other words, Warren doesn’t really oppose corporate censorship. Like many of her Democrat colleagues, she simply wants the right kind of corporate censorship. Are you a source at a Big Tech company or any other corporation who wants to confidentially blow the whistle on wrongdoing or political bias at your company? Reach out to Allum Bokhari securely at allumbokhari@protonmail.com. Allum Bokhari is the senior technology correspondent at Breitbart News.",
      "date": "1 Jul 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Elizabeth Warren Defends False Claim Michael Brown Was ‘Murdered’",
      "url": "https://www.breitbart.com/2020-election/2019/08/14/elizabeth-warren-defends-false-claim-michael-brown-was-murdered/",
      "subtitle": "FRANCONIA, Grafton County, New Hampshire — Sen. Elizabeth Warren (D-MA) on Wednesday defended her false claim last week that 18-year-old Michael Brown had been “murdered” by police in Ferguson, Missouri in 2014.",
      "author": "Joel B. Pollak",
      "content": " Speaking to reporters after a town hall event in Franconia, New Hampshire, Warren said that Brown had been unarmed when he was shot “in the middle of the street, by police officers, and left to die.” The 18-year-old Brown, who was unarmed at the time, was shot and killed by police officer Darren Wilson on August 9, 2014. That much is true. However, left-wing activists falsely claimed at the time that Brown was innocent of any crime; had been shot in the back; and had put his hands over his head and said, “Don’t shoot!” (hence the slogan, “Hands up, don’t shoot!”). None of those claims turned out to be true — though they were circulated by Democrats and mainstream journalists. Screenshot / CNN via The Right Scoop The incident revitalized the “Black Lives Matter” movement, bringing focus to claims of police brutality — but also bringing unrest to many American cities, and prompting police to pull back from fighting crime in black neighborhoods. Race relations, according to Gallup polls, suffered a decline from which they have not recovered. The U.S. Department of Justice under President Barack Obama, after an extensive investigation, found evidence that Brown had not been murdered, and that he had probably attacked Wilson first, reaching for his gun (and shooting his own thumb during the scuffle). Brown had also been charging Wilson later when the shots were fired. The Department of Justice concluded that Officer Wilson’s use of force could not be described as “objectively unreasonable.” It added: “Accordingly … it is not appropriate to present this matter to a federal grand jury for indictment, and it should therefore be closed without prosecution. ” When a local grand jury likewise declined to induct Wilson, a riot ensued, damaging many minority-owned businesses in Ferguson. The neighborhood has struggled ever since. Warren tweeted last Friday:  Sen. Kamala Harris (D-CA), also running for president, made a similar claim in a tweet of her own on Friday. The Washington Post‘s left-leaning fact-checker awarded Warren and Harris’s claim that Brown was murdered “Four Pinnochios.” In addition, in response to Warren’s tweet, the Massachusetts Chiefs of Police Association wrote a sharply critical letter, arguing, “Your reckless tweet will only serve to create hatred towards Police Officers and place them in danger of more assaults and perhaps death.” Asked by a reporter for ABC News at a press gaggle after the town hall if she still thought Brown was “murdered,” Warren refused to retract her claim or to apologize: What happened is that a man was shot — an unarmed man, in the middle of the street, by police officers, and left to die. And I think that’s where our focus should be. It is the fifth anniversary of that occurring, and we need to talk about how to make real change in this country. I have a more comprehensive plan coming out just a little bit later. Warren, who spoke to a crowd of over 300 in Franconia, is scheduled to continue campaigning in New Hampshire through Wednesday evening. Joel B. Pollak is Senior Editor-at-Large at Breitbart News. He earned an A.B. in Social Studies and Environmental Science and Public Policy from Harvard College, and a J.D. from Harvard Law School. He is a winner of the 2018 Robert Novak Journalism Alumni Fellowship. He is also the co-author of How Trump Won: The Inside Story of a Revolution, which is available from Regnery. Follow him on Twitter at @joelpollak.",
      "date": "14 Aug 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Poll Shows Elizabeth Warren Pulling Ahead in Early States",
      "url": "https://www.breitbart.com/politics/2019/10/14/poll-shows-elizabeth-warren-pulling-ahead-in-early-states/",
      "subtitle": "Sen. Elizabeth Warren (D-MA) has extended her lead in early primary and caucus states, the latest YouGovUS/CBS News poll reveals.",
      "author": "Hannah Bleau",
      "content": " YouGov conducted the survey for CBS News October 3 – October 9, 2019, polling 16,500 registered voters (7,958 Democrats and Democrat-leaning voters) in 18 early states. Of those surveyed, 31 percent named Warren as their Democrat nominee of choice. Joe Biden (D) came in second place with 25 percent support, followed by Sen. Bernie Sanders (I-VT) with 17 percent support. The results demonstrate a five-point gain for Warren, who had 26 percent to Biden’s 25 percent in the YouGovUS/CBS News poll taken August 28 – September 4, 2019. The remaining candidates fell below the well-established top tier. The survey shows Sen. Kamala Harris (D-CA) down by double digits, with seven percent support. Mayor Pete Buttigieg (D) came in fifth place with five percent support, and former Texas Rep. Beto O’Rourke (D) came in right behind with four percent support. The remaining candidates saw one percent support or less. The margin of error is +/- 1.6 percent:   Warren also saw a boost in individual states. YouGov surveyed 506 registered Democrats in New Hampshire. Thirty-two percent of those respondents chose Warren as their first choice, followed by Biden with 24 percent and Sanders with 17 percent. The margin of error is +/- 5.4 percent:  The survey showed a tighter race in the early caucus state, Iowa. Of the 729 registered Democrats surveyed, 22 percent chose both Warren and Biden. Sanders came in a close third with 21 percent support, followed by Buttigieg with 14 percent support. The margin of error for the Hawkeye State results is +/- 4.6 percent:  Biden, however, continues to hold a strong lead in South Carolina, with 43 percent of the 915 registered Democrats surveyed choosing the former vice president. He topped his closest competitor, Warren, by 25 percent. She garnered 18 percent, followed by Sanders with 16 percent. The margin of error is +/-3.9 percent:  While Biden still holds the greatest electability, he has experienced a ten-point drop in the last month, falling from 77 percent to 67 percent. Warren’s electability, however, has slightly grown, jumping from 55 percent in September to 56 percent in October. Biden and Warren will face each other on the debate stage alongside ten other candidates at Otterbein University in Westerville, Ohio, on Tuesday evening.",
      "date": "14 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Bernie Sanders on Elizabeth Warren: Says ‘She Is a Capitalist Through Her Bones — I’m Not’",
      "url": "https://www.breitbart.com/clips/2019/10/13/bernie-sanders-on-elizabeth-warren-says-she-is-a-capitalist-through-her-bones-im-not/",
      "subtitle": "null",
      "author": "Pam Key",
      "content": " On Sunday’s broadcast of  ABC’s “This Week,” 2020 Democratic presidential candidate Sen. Bernie Sanders (I-VT) noted his 2020 Democratic presidential nomination race opponent Sen. Elizabeth Warren (D-MA) was a self-proclaimed “capitalist,” while he was not. Sanders said, “I think she’s a very, very good senator, but there are differences between Elizabeth and myself. Elizabeth, as you know, said she’s a capitalist through her bones. I’m not. I think the situation we face in this country of the greed and corruption that is existing in Washington, that is existing at the corporate elite level where you have massive amounts of price-fixing going on with the drug companies.” “We’re the only major country on earth not to guarantee health care, where we have right now as we speak in the fossil fuel industry, you have companies making billions of dollars a year in profit,” he continued. “By the way, they’re destroying the planet. Business as usual and doing it the old fashion way is not good enough. What we need is, in fact — I don’t want to get people to nervous—we need a political revolution. I’m the only candidate that’s going to say to the ruling class, the corporate elite, enough with your greed and corruption. We need real change.” Follow Pam Key on Twitter @pamkeyNEN",
      "date": "13 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Nolte: Establishment Media Reverse Course to Blast Elizabeth Warren over DNA Fiasco",
      "url": "https://www.breitbart.com/politics/2018/10/17/nolte-establishment-media-reverse-course-to-blast-elizabeth-warren-over-dna-fiasco/",
      "subtitle": "Sen. Elizabeth Warren’s (D-MA) roll-out of her DNA test has been such a train wreck that even the establishment media have been forced to reverse course and admit to it.",
      "author": "John Nolte",
      "content": " As hard as the media worked to cover and lie for her for over those first 24 hours, the unassailable facts have forced them to throw in the towel. The science is settled: Elizabeth Warren is a fake Indian. Here’s a quick list of the headlines Warren is dealing with today: Washington Post: “Elizabeth Warren angers prominent Native Americans with politically fraught DNA test” CNN: “Elizabeth Warren might have actually made things worse with her DNA gambit” CBS News: “Elizabeth Warren criticized for releasing DNA report” Politico (Politico!): “Warren stumbles with ‘Native American’ rollout” HuffPost: “Why White Americans Love To Claim Native Ancestry” The Hill: “Dem strategist says Warren taking DNA test was ‘tone deaf'” New York Times: Elizabeth Warren’s DNA Results Draw Rebuke from Trump and Raise Questions USA Today: “Cherokee Nation slams Sen. Elizabeth Warren DNA test as ‘inappropriate and wrong'” Boston Globe: Elizabeth Warren Defends Decision to Release DNA Test Compare those headlines to the headlines Monday morning when Warren rolled out her carefully planned assault on Trump using her DNA results. Keep in mind that part of Team Warren’s careful planning involved alerting the media beforehand. This allowed every establishment media outlet to coordinate and execute a plan that would spin this into vindication and a big victory for Warren over Trump. Remember, our establishment media is the communication arm of the Democrat Party, so all of them got the talking points ahead of time and tried diligently to stick to them. All of this is painfully obvious in these Monday morning headlines: ABC News: “Elizabeth Warren reveals proof of Native American ancestry” AP: “Warren DNA shows Native American heritage” CNN: “Elizabeth Warren releases DNA test with ‘strong evidence’ of Native American ancestry” BBC: “Elizabeth Warren: DNA test finds ‘strong evidence’ of Native American blood” USA Today: “Warren DNA shows Native American heritage” NBC News: “Elizabeth Warren releases DNA results indicating she has Native American heritage” Boston Globe: “Warren Reveals test Confirming Ancestry” Here is my favorite flip-flop… The far-left Daily Beast on Monday: “BREAKING: Elizabeth Warren releases her DNA test: Yes, she is Native American” The far-left Daily Beast on Wednesday: “Elizabeth Warren’s DNA Stunt Alienates Native Americans” Try to imagine Warren on Sunday night. Picture her so excited she cannot sleep, excited because she has planned this out like the invasion of Normandy. She’s got the DNA test proving she might only be 1023/1024 white. She has a slick video that will own Drumpf. She has the establishment media all lined up to do her bidding. The Boston Globe has even agreed to botch the math in her favor. So there she is, lying in the dark grinning, rubbing her hands together, because she can see 2020 from her wigwam. Better still, in her mind’s eye she can see President Trump on defense for days as the media pummel him as an Indian giver over his $1 million bet. Oh, yes, at long last someone will get the best of Drumpf, and it will be me! Me, I tell you! ME! And I will leap to the top of the presidential polls, and destroy Trump in 2020, and be the first woman president and the first Cherokee president and redistribute the wampum and, and, and… In the immortal words of Bugs Bunny: “Sheesh, what a maroon.” Let me tell you the mistake Warren made. Oh, yes, she made quite a few, but here is the Big One –the only one that mattered… Warren believes she still lives in a world where the establishment media can set the narrative. There is no other explanation for this fiasco. She actually thought that if she lined up the dinosaurs — the Boston Globe, CNN, the New York Times, the Washington Post and the rest — that she could magically get away with passing her junk science off as proof she is not a godless liar. Ten years ago, she probably would have gotten away with it. Today? No way. New Media is just too good at what we do. And it certainly helps when we have the facts on our side, and in the case of Warren’s DNA test, the facts are not only devastating to Warren, they are fatal to her 2020 presidential aspirations. The truth is that Warren’s DNA test — just like all the documentary evidence of the past — only proved Warren a liar, a liar with no more Native blood in her than the average white American. She might even have less. And even that is not exactly true because — get this — her DNA test did not even use American Indian samples. The samples came from Peru, Mexico, and Colombia. Sure, back in ’08, just as the media was able to shoot down Barack Obama known associations with racists and domestic terrorists, just as they were able to wrist flick his illegal drug use, they might have been able to put this controversy to bed for Warren — to declare it old and settled news. But it is not 2008 anymore, and if Warren is incapable of grasping that simple fact, she has no business running for president. Follow John Nolte on Twitter @NolteNC. Follow his Facebook Page here. ",
      "date": "17 Oct 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Elizabeth Warren Subtly Reminisces Days as Republican, Citing Friendship with ‘Deeply Principled Republican’",
      "url": "https://www.breitbart.com/politics/2019/10/15/elizabeth-warren-subtly-reminisces-days-republican/",
      "subtitle": "Sen. Elizabeth Warren (D-MA) subtly reminisced her days as a registered Republican. She answered a question about a “surprise” friendship that impacted her and her beliefs by talking about her relationship with “deeply principled Republican” Charles Fried — who served as Solicitor General from 1985-1989 — and her three brothers, two of whom are Republicans.",
      "author": "Hannah Bleau",
      "content": " Candidates at the Ohio Democrat debate on Tuesday were asked, “What friendship have you had that would surprise us, and what impact has it had on you and your beliefs?” “Twenty-seven years ago, when I was under consideration for a job,” Warren began, mentioning Fried, whom she described as “a deeply principled Republican.” “We didn’t agree on much. I was far more liberal than he was,” Warren said. Notably, Warren was a registered Republican 27 years ago. She did not change her party affiliation to Democrat until 1996. “But he also was willing to listen to my work about what’s happening to America’s middle class, and Charles engaged with it over and over and ultimately is the person who made sure that I got the job,” Warren continued before pivoting to her Republican brothers. “You know, I grew up out in Oklahoma. I have three older brothers. They all served in the military. Two of the three are still Republicans. I love all three of my brothers. And there are a lot of things that we’re divided on, but there are core things that we believe in together,” the presidential hopeful said. She continued: We want to see all of our children get a good start in life. We don’t want to see any of our friends or neighbors not get covered by health care. We’re willing to get out there for the things we believe in. Look, people across this country — whether they’re Democrats, independents, or Republicans — they know what’s broken. They know that we have an America that’s working better and better and better for a thinner and thinner and thinner slice at the top and leaving everyone else behind. People across this country, regardless of party, are ready to say, “No more. We want an America that works for everyone.” “2020 is our moment in history. It’s a deep honor to be here to be in this fight. I know what’s broken. I know how to fix it, and we are building a grassroots movement to get it done that includes everyone,” she concluded.",
      "date": "15 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Elizabeth Warren Backs Slavery Reparations",
      "url": "https://www.breitbart.com/politics/2019/02/21/elizabeth-warren-backs-slavery-reparations/",
      "subtitle": "Democratic 2020 presidential candidate Sen. Elizabeth Warren (D-MA) confirmed in a Thursday interview with the New York Times that she supports slavery reparations for American blacks.",
      "author": "Katherine Rodriguez",
      "content": " The New York Times reported that Warren expressed her support for a policy that would pay money to black Americans who have been affected by slavery. Warren’s campaign staff declined to elaborate on how she would support reparations, but the calls for reparations came after she said the federal government should provide financial assistance to residents in poor communities affected by “redlining,” a practice where lenders refuse mortgages to people in financially risky areas. Warren is not the first 2020 presidential candidate to call for reparations. Sen. Kamala Harris (D-CA) announced in a Monday radio interview with New York City’s Power 105.1’s “The Breakfast Club” that “some type of” reparations should be provided to black Americans impacted by slavery. Harris confirmed her comments calling for reparation in the radio interview with the Times on Thursday. “We have to be honest that people in this country do not start from the same place or have access to the same opportunities,” Harris said in the statement. “I’m serious about taking an approach that would change policies and structures and make real investments in black communities.” Other Democrats, including former President Barack Obama, Sen. Bernie Sanders (I-VT), former 2016 presidential candidate Hillary Clinton, have not expressed support for this policy. Warren has received a lot of pushback on the campaign trail for her exaggerated claims of Native American ancestry. One heckler at Warren’s campaign rally in Georgia on Saturday yelled, “Why did you lie?” and held up a “1/2020th” sign before being escorted out of the campaign event. The Massachusetts Democrat released results of a 2018 DNA test which revealed that she had between 1/64th and 1/1,1024th Native American ancestry after President Donald Trump and other Republicans criticized her for falsely claiming Native American ancestry. Trump has frequently called Warren “Pocahontas,” most recently using the term to refer to Warren after she launched her bid for the 2020 Democratic presidential nomination this month. The Massachusetts Democrat issued an apology in January to the Cherokee Nation for taking the DNA test shortly after the results of the DNA test went public because Cherokee leaders thought modern DNA tests undermined centuries-old laws and traditions defining tribal heritage.",
      "date": "21 Feb 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Elizabeth Warren Goes All Out for Labor Day: ‘Unions Will Rebuild America’s Middle Class’",
      "url": "https://www.breitbart.com/politics/2019/09/02/elizabeth-warren-goes-all-out-labor-day-unions-rebuild-americas-middle-class/",
      "subtitle": "Sen. Elizabeth Warren (D-MA) – one of the most outspoken pro-union Democrat candidates – tweeted a series of messages on Labor Day, promising that unions will “rebuild” America’s middle class.",
      "author": "Hannah Bleau",
      "content": " Warren used both of her verified Twitter accounts to tweet messages of support for unions and declared that they will “rebuild” the middle class. “Unions built the middle class—and unions will rebuild the middle class,” Warren wrote. “If we want more good American jobs, then we need stronger unions and more power in the hands of the people.” “I’m proud to be fighting alongside our unions,” she added, later suggesting that unions are “under attack”:      It is true that Warren has been one of the most outspoken supporters of the labor movement, despite membership declining across the board. It has dipped from 12.3 percent participation to 10.5 percent over the last decade, according to Illinois Public Media. Pew Research Center also found that the “share of American workers who belong to labor unions has fallen by about half” during the past few decades, going from 35 percent in 1954 to 10.5 percent in 2018: The actual number of union members was 14.7 million last year, according to the Bureau of Labor Statistics (BLS). In 2012, union membership hit its lowest point since the current data series began in the early 1980s, falling below 14.4 million, before turning modestly upward. Warren joined airport food workers in a minimum wage protest organized by Unite Here at the Reagan National Airport in July, alongside Sen. Bernie Sanders (I-VT) – another notable pro-union Democrat candidate – and Mayor Bill de Blasio (D):  Warren is spending Labor Day campaigning in New Hampshire. She is expected to deliver remarks at a house party in Hampton Falls at approximately 2:30 p.m. Eastern.",
      "date": "2 Sep 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Elizabeth Warren Glitches Out as ‘Breakfast Club’ Asks When She Learned She’s White",
      "url": "https://www.breitbart.com/politics/2019/05/31/elizabeth-warren-glitches-out-as-breakfast-club-asks-when-she-learned-shes-white/",
      "subtitle": "2020 White House hopeful Sen. Elizabeth Warren (D-MA) dodged the question of when she learned she is not Native American during a Friday interview on the popular radio show The Breakfast Club, floundering as co-host Charlamagne tha God took her to task for false claims about her heritage.",
      "author": "Joshua Caplan",
      "content": "  The painful exchange began with Charlamagne tha God asking Warren if she regretted taking the DNA test which revealed her genes only show evidence of 1/64 to 1/1024 Native American heritage. “Oh, I can’t go back,” Warren began. “I grew up in Oklahoma, I learned about my family the same way most people learn about there family, from there my momma, from my daddy, aunts and my uncles. And it’s what I believed.” “I’m not a person of color,” she then conceded. “I’m not a citizen of a tribe and I shouldn’t have done it.” Charlamagne, interrupting Warren, then asked if she would claim Native American heritage again if she could do it again. “I can’t go back,” Warren repeated. “But, I shouldn’t. But what I do is try to be a good partner. And that’s what I do every day.” Warren went on to name drop issues such as health care, student loan debt, and the housing crisis. However, the Breakfast Club hosts were unfazed by Warren’s attempt to pivot away from the controversial subject and continued to press her. “So what? Your family told you were Native American,” DJ Envy asked. “Yeah!” Warren exclaimed. “How long did you hold on to that?” Charlamagne asked. “Because there were some reports that said you were Native American on your Texas Bar license and that you said you were Native American, also documents when you were a professor at Harvard–like, why did you do that?” Warren repeated her initiation response, claiming that she learned of her now-debunked lineage from her family. She failed to provide any date and time on when exactly she found out about her true heritage. Charlamagne’s next, key question went entirely unanswered: “When did you find out you weren’t?” Warren sputtered, then replied: “I’m not a person of color. I’m not a citizen of a tribe and tribal citizenship is an important distinction, and not something I am. So…” She left that final sentence unfinished, waiting for another question. “Was there any benefits to that?” Charlamagne tha God shot back. “No,” she said, finding her footing again in a prepared line. “Boston Globe did a full investigation, it never affected anything about my family. It never affected any job I ever got.” “It’s kind of like the original Rachel Dolezal a little bit,” Charlamagne quipped. “Rachel Dolezal is a white woman pretending to be black.” “Well, this is what I learned from my family,” Warren replied, throwing her hands up.",
      "date": "31 May 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Elizabeth Warren: Use Excise Taxes to Reduce Gun, Ammo Sales",
      "url": "https://www.breitbart.com/politics/2019/10/15/elizabeth-warren-use-excise-taxes-to-reduce-gun-ammo-sales/",
      "subtitle": "Democrat presidential hopeful Elizabeth Warren wants to use federal excise taxes to reduce gun and ammunition sales.",
      "author": "AWR Hawkins",
      "content": " Her gun control, made public in August on Medium, shows Warren believes the current ten percent excise tax on firearms is too low. She wants to raise that tax to 30 percent while increasing the tax on ammunition to 50 percent. Because excise taxes are paid directly by the consumer–the taxes are added to the price of the goods–this means a $500 gun would immediately cost $650 and the price for a $20 box of ammo would immediately rise to $30. Warren claims this taxation policy would “bring in new federal revenue” that can used for “gun violence prevention.” And she simultaneously suggests the tax would raise the price on guns and ammo to a level sufficient to stifle sales. She does not explain how reducing sales via tax policy can bring in new revenue. Rather, she cites”federal excise tax on cigarettes, domestic wine, or even airline tickets,” to try to bolster justify pushing for more taxes on firearms and bullets. Down Range with AWR Hawkins.  Sign up today! Ironically, Warren also wants government-imposed limits on the number of guns Americans can purchase. This would cut sales as well, further reducing tax revenue. AWR Hawkins is an award-winning Second Amendment columnist for Breitbart News and the writer/curator of Down Range with AWR Hawkins, a weekly newsletter focused on all things Second Amendment, also for Breitbart News. He is the political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com. Sign up to get Down Range at breitbart.com/downrange.",
      "date": "15 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Donald Trump: ‘Crooked One’ Hillary Clinton Should Steal Democrat Nomination from ‘Uber Left’ Elizabeth Warren",
      "url": "https://www.breitbart.com/politics/2019/10/08/donald-trump-crooked-one-hillary-clinton-should-steal-democrat-nomination-from-uber-left-elizabeth-warren/",
      "subtitle": "President Donald Trump on Tuesday taunted failed presidential candidate Hillary Clinton, suggesting she could beat Elizabeth Warren for the 2020 Democrat nomination if she entered the race.",
      "author": "Charlie Spiering",
      "content": " “I think that Crooked Hillary Clinton should enter the race to try and steal it away from Uber Left Elizabeth Warren,” Trump wrote on Twitter. The president commented as Clinton and her daughter Chelsea Clinton continue their media tour promoting their book featuring “gutsy women” feminists. But Trump said Clinton should finally come clean about her deleted emails from her private server before running again. “The Crooked one must explain all of her high crimes and misdemeanors including how & why she deleted 33,000 Emails AFTER getting “C” Subpoena!” he wrote.  A Rasmussen poll released Monday found both Trump and Clinton would receive 45 percent support in a potential matchup. That prompted Donald Trump Jr. to joke about a Clinton 2020 run on Twitter. “All I want for Christmas is for Hillary to run again,” he wrote.  ",
      "date": "8 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Elizabeth Warren Promises Day One Executive Order on Fossil Fuel Leases, Pledges to Ban Fracking",
      "url": "https://www.breitbart.com/politics/2019/09/06/elizabeth-warren-promises-executive-order-fossil-fuel-leases-ban-fracking/",
      "subtitle": "Sen. Elizabeth Warren (D-MA) on Friday promised to sign an executive order on her first day in office, putting a moratorium on new fossil fuel leases and pledged to ban fracking “everywhere.”",
      "author": "Hannah Bleau",
      "content": " Warren promised in a tweet Friday to “sign an executive order that puts a total moratorium on all new fossil fuel leases for drilling offshore and on public lands” and vowed to “ban fracking — everywhere”:  Warren’s pledge to ban fracking follows Sen. Bernie Sanders’ (I-VT) call, urging fellow Democrat candidates to support a “fracking ban on public and private lands.” “Fracking is a danger to our water supply. It’s a danger to the air we breathe. It causes earthquakes. It’s highly explosive. Safe fracking is, like clean coal, pure fiction,” Sanders said in a statement Wednesday. “But, most importantly, methane from natural gas contributes to climate change and is setting us on a path to disaster,” he added. “When we are in the White House, we will end the era of fossil fuels, and that includes fracking”:  Ten Democrat candidates participated in CNN’s seven-hour climate change town hall Wednesday, and many signaled support for the implementation of a carbon tax as well as plastic straw bans, actions on meat consumption, and the end of fracking. “There’s no question I’m in favor of banning fracking,” Sen. Kamala Harris (D-CA) said during the town hall. “Starting with what we can do on day one around public lands and then there has to be legislation, but yes. This is something I’ve taken on in California, I have a history of working on this issue,” she added. Sen. Cory Booker (D-NJ) said he would ban fracking “right away on public lands.” Warren released her comprehensive climate change proposal — inspired by Gov. Jay Inslee (D) — ahead of CNN’s town hall. It called for the decarbonization of the economy and 100 percent clean energy over the next decade. While Warren did not go as far as Sanders in calling for the complete public ownership of utilities, she said she will tell companies that use carbon-based fuel that they are “done” by 2035. “I’m perfectly willing to take on giant corporations. I think I’ve been known to do that once or twice. But for me, I think the way we get there is we just say, ‘sorry guys, but by 2035, you’re done,’” she said during CNN’s town hall.",
      "date": "6 Sep 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Report: Campaigns Ramping Up Opposition Research on Elizabeth Warren",
      "url": "https://www.breitbart.com/politics/2019/08/31/report-campaigns-ramping-up-opposition-research-on-elizabeth-warren/",
      "subtitle": "Sen. Elizabeth Warren (D-MA) has had a relatively lax campaign as far as opposition goes, with ideological ally Sen. Bernie Sanders (I-VT) refusing to criticize her. However, other campaigns are ramping up their opposition research and planning to take Warren on in the next debate, according to campaign aides who spoke to Politico.",
      "author": "Hannah Bleau",
      "content": " Sanders – who has been Warren’s closest ally in the race – has repeatedly refused to take the Massachusetts senator on, arguing that it “is not the way you necessarily win a campaign.” However, with Warren solidifying herself as a top tier candidate with growing momentum, other campaigns are ramping up their efforts and preparing to challenge her in the next debate. Politico reports: Aides to three rival candidates confirmed in interviews they’re revving up opposition research on Warren in preparation for the next debate on Sept. 12. Still others privately complained she’s gotten fawning treatment in the media as she unveiled a litany of ambitious plans without being pressed on where the money would come from to pay for them. Warren’s supporters said the gripes amount to sour grapes from campaigns who didn’t take her seriously until she shot up in the polls, and are now watching with envy the organization she’s amassed while they were busy attacking each other. Her competitors do not want to alienate potential voters in the process. Campaign aides, though, have signaled that their candidates will be ready to attack if Warren chooses to go on offense: An adviser to a competing campaign, who spoke on condition of anonymity, echoed some of that sentiment. If Warren attacks someone else’s record on the debate stage, the person said, she will get it back in return. “Nobody else here has been a Republican before,” the adviser said. As Breitbart News previously reported, Warren has been using Sanders as somewhat of a human shield, agreeing with his aggressive proposals – like Medicare for All and a Green New Deal plan – but allowing him to take the brunt of the questions and criticisms. As Breitbart News reported: While it is true that most criticisms of Medicare for All have been geared toward Sanders, he has been demonstratively more vocal and honest about his efforts. Warren, however, has yet to provide details of her comprehensive plan, which may explain why she has not had as much of a target on her back. Nonetheless, some campaigns believe that Warren’s momentum will slow, much like Sen. Kamala Harris’s. “It’s inevitable: What goes up must come down. It’s the law of political physics,” Joe Biden (D) organizer Dick Harpootlian said, according to Politico. Warren is currently averaging 16.5 percent in the polls and will face nine candidates – including Biden, Harris, and Sanders – on the debate stage in Houston, Texas, September 12.",
      "date": "31 Aug 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Watch: Stephen Colbert Stumps Elizabeth Warren over Middle Class Tax Hikes",
      "url": "https://www.breitbart.com/entertainment/2019/09/18/stephen-colbert-stumps-elizabeth-warren-over-middle-class-tax-hikes/",
      "subtitle": "Late-night host Stephen Colbert stumped Sen. Elizabeth Warren (D-MA) during her appearance on his show Tuesday night after confronting her for refusing to say if Medicare for All would result in higher taxes for the middle class.",
      "author": "Hannah Bleau",
      "content": " Colbert asked Warren, a strong advocate for a government-run health care system, if Medicare for All would result in higher taxes for the middle class — a question she has faced before but has continually refused to answer directly:  “You keep being asked in the debates ‘how are you going to pay for it. Are you going to be raising the middle class taxes?'” The Late Show host said. “How are you going to pay for it? Are you going to be raising the middle class taxes?” “So, here’s how we’re going to do this,” Warren said. “Costs are going to go up for the wealthiest Americans, for big corporations… and hard-working middle class families are going to see their costs going down.” “But will their taxes go up?” Colbert asked, before offering a suggestion to the presidential candidate on how to better frame the “radical” proposal. “I’ve listened to these answers a few times before, and I just want to make a parallel suggestion to you that you might defend the taxes perhaps that you’re not mentioning in your sentence,” Colbert said. “Isn’t Medicare for All like public school? There might be taxes for it, but you certainly save a lot of money sending your kids to school and do you want to live in a world where your kids aren’t educated? Do you want to live in a world where your fellow citizens are dying, even if it costs a little bit of money?” he asked. Despite Colbert’s suggestion, Warren would not directly say if the proposal would result in higher taxes on the middle class. “So, I accept your point and I believe in your point. Health care is a basic human right. We fight for basic human rights, and that’s Medicare for All. Everyone gets covered,” she said before detailing her history of studying “why families go broke” and naming health care costs as one of the primary factors. She continued: I am so deeply grateful to President Obama who moved this country to say, ‘We as a country want every person here to have health care coverage.’ And now it’s time to take the next step and say let’s do that in the most effective way possible,” Warren said. “And what every study shows is that Medicare for All is the cheapest way to do that. And it’s the way to make sure that those who have more will pay more, but that hardworking families will pay less. Nobody has to go bankrupt over health care if we get Medicare for All. Warren dodged a similar question posed during the third Democrat primary debate in Houston, Texas, last week, refusing to say if Medicare for All would result in higher taxes for the middle class. “Middle class families are going to pay less,” she said during the debate, referring to health care costs, specifically:  “What we’re talking about here is what’s going to happen in families’ pockets, what’s going to happen in their budgets, and the answer is, on Medicare for All, costs are going to go up for wealthier individuals and costs are going to go up for giant corporations,” the Massachusetts senator continued. “But for hardworking families across this country costs are going to go down, and that’s how it should work under Medicare for All,” she added.",
      "date": "18 Sep 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Elizabeth Warren: Crossing the Border Illegally Should Not Be a Criminal Offense",
      "url": "https://www.breitbart.com/politics/2019/07/08/elizabeth-warren-crossing-border-illegally-should-not-be-criminal-offense/",
      "subtitle": "Sen. Elizabeth Warren (D-MA) does not believe it should be a criminal offense to cross the border illegally, she said during an interview with the California Nation podcast, which was posted Monday.",
      "author": "Hannah Bleau",
      "content": " While the presidential candidate hit a number of issues during the broad discussion, Section 1325 of the immigration code, which makes it a criminal offense for people to cross the border illegally, became a highlight. “Are you in favor of repealing that?” she was asked. “I am,” Warren said, arguing that “criminalizing” illegal entry does not make people safer. “I think that the whole notion of criminalizing the approach to coming across the border without documentation is not making anybody any safer. We just need to be in a different position on this,” she said, downplaying the number of criminals and drug traffickers who take advantage of the porous border. “It’s really important on immigration that we concentrate our resources on the people who pose threats to us, and that’s not children,” she continued. “It’s not mamas fleeing terror from gangs down in Central America. It’s not people trying to build a life who have family here,” she added:  Recent U.S. Customs and Border Protection data revealed that two caravans that arrived at the U.S.-Mexico border, in October 2018 and January 2019, included “1,520 previously deported illegal aliens who had been convicted of crimes in the U.S.,” Breitbart News reported. Of those: That data only reflects the illegal aliens from those two caravans alone. There are countless stories of illegal alien crime, although many of the stories are largely ignored by the establishment media. In January, U.S. Immigration and Customs Enforcement (ICE) arrested more than 100 immigration violators in New York. The vast majority of the illegal aliens were convicted criminals. Breitbart News reported:  U.S. Immigration and Customs Enforcement (ICE) Enforcement and Removal Operations (ERO) made 188 arrests from January 14-18. Of those arrested, 107 were convicted criminals or facing charges, and 55 failed to leave the country after a final order of removal or were previously removed and returned to the U.S. The following month, a story emerged of an illegal alien mother of nine, Celia Ruiz-Ochoa, who ran a massive drug trafficking ring after settling in the states and passed it down to her son in 2016. She is serving 17 years in federal prison: Federal authorities say Ruiz-Ochoa often trafficked the drugs into the U.S. by air and by land. She was so successful that she rose to the top of an international drug trafficking ring which contributed to the opioid crisis in Ohio, WCPO reported Thursday. Additionally, the majority of working-class Americans say current immigration policies are driving up crime in the U.S. Breitbart News reported:  The latest Gallup survey finds that among Americans with less than a college degree, more than one-in-two, or 51 percent, said immigration to the U.S. has made crime across the country worse. About 41 percent said immigration has not had much impact on crime, and only seven percent said immigration has decreased crime. Overall, more Americans say immigration is driving up crime than those who say immigration is decreasing crime. About 42 percent of Americans said immigration makes crime worse, while about 50 percent said immigration has no impact on crime. Only seven percent of Americans believe immigration decreases crime. The “criminal offense” topic bubbled up during the recent Democrat debate, with former HUD Secretary Julián Castro (D) hitting Beto O’Rourke (D) over his purported support of Section 1325. “Let’s be very clear. The reason that they’re separating these little children from their families is that they’re using Section 1325 of that act, which criminalizes coming across the border to incarcerate the parents and then separate them,” Castro said on the debate stage. “Some of us on this stage have called to end that section, to terminate it. Some, like Congressman O’Rourke, have not,” he continued. “And I want to challenge all of the candidates to do that.” Voters can add Warren – a top tier Democrat candidate – to the list of candidates who support decriminalizing illegal entry into the United States. ",
      "date": "8 Jul 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Watch: Larry Summers Assails Elizabeth Warren’s Wealth Tax",
      "url": "https://www.breitbart.com/economy/2019/10/18/larry-summers-wealth-tax/",
      "subtitle": "Former Treasury Secretary Larry Summers assailed proposals from presidential candidates Elizabeth Warren and Bernie Sanders to impose a wealth tax.",
      "author": "John Carney",
      "content": " A tax on the wealth of the richest Americans would raise far less money than its proponents claim and would likely exacerbate any problems with the wealthy exercising too much influence over politics, Summers said Thursday at an event at the Peterson Institute for Interna Summers was Treasury Secretary in Bill Clinton’s administration and a top economic adviser to Barack Obama. That makes his critique of the wealth tax proposals from Warren and Sanders particularly relevant for Democrats. Summers said the data put forth by a pair of economists, Berkeley professors Emmanuel Saez and Gabriel Zucman, to support the case for a wealth tax is “substantially misleading” and “substantially inaccurate.” He argued on Thursday that it was likely that the wealthy could avoid much of the tax by spreading their wealth around to relatives and by donating it to organizations that would pursue their goals. This could increase their political influence because some of those organizations would likely lobby for policies their donors approve of, Summers said.  “If you had a successful wealth tax that forced people to react the way they normally would by giving away their money to organizations that share their values and spent money in pursuit of their values, you would in all likelihood increase, rather than decrease, the influence of the views of the wealthy,” Summers argued. Warren has proposed a 2 percent tax on wealth that exceeds $50 million, and 3 percent on the amount above $1 billion. “The arguments around political power have almost no validity,” Summers said. “The truth is you can become one of the most powerful money people around the Democratic Party or the Republican Party for four or five million dollars a year. Nothing in this world is going to be able stop the wealthiest people in America from being able to come up with a vast multiple of that.” ",
      "date": "18 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Elizabeth Warren Overtakes Joe Biden in Real Clear Politics Average",
      "url": "https://www.breitbart.com/politics/2019/10/08/elizabeth-warren-overtakes-joe-biden-in-real-clear-politics-average/",
      "subtitle": "Sen. Elizabeth Warren (D-MA) has surpassed Joe Biden (D) in the current Real Clear Politics average, marking the first time Biden has lost his lead since announcing his presidential bid.",
      "author": "Hannah Bleau",
      "content": " The current Real Clear Politics average shows Warren narrowly edging out Biden with 26.6 percent support to Biden’s 26.4 percent support. The change follows weeks of Warren slowly gaining on Biden in both national and early primary state polls. Both candidates hold a double-digit lead over Sen. Bernie Sanders (I-VT), who is currently averaging 14.6 percent. The RCP average also reflects Sen. Kamala Harris’s (D-CA) continued fall, showing Mayor Pete Buttigieg (D) taking her formerly held fourth place position with 5.6 percent support to the California senator’s 4.4 percent. The average shows Andrew Yang (D) in sixth place with 2.8 percent support, followed by Beto O’Rourke (D) with two percent support. The remaining candidates are averaging less than two percent:  Twelve candidates will participate in the Democrat debate in Westerville, Ohio, on October 15.",
      "date": "8 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Elizabeth Warren Touts Plan to Address ‘Environmental Racism’",
      "url": "https://www.breitbart.com/politics/2019/10/09/elizabeth-warren-touts-plan-to-address-environmental-racism/",
      "subtitle": "Sen. Elizabeth Warren (D-MA) on Wednesday unveiled her plan to address “environmental injustice” and “environmental racism,” which includes a $1 trillion investment into minority communities affected by “industrial pollution.”",
      "author": "Hannah Bleau",
      "content": " Warren argues that “justice” plays a massive role in properly addressing the climate change “crisis,” citing studies that suggest that black and Hispanic families are disproportionately affected by air pollution caused by white people: A more recent study found that while whites largely cause air pollution, Blacks and Latinxs are more likely to breathe it in. Unsurprisingly, these groups also experience higher rates of childhood asthma. And many more low-income and minority communities are exposed to toxins in their water – including lead and chemicals from industrial and agricultural run-off. Warren calls this phenomenon “environmental racism” and concludes that “environmental injustice is the result of decades of discrimination and environmental racism compounding in communities that have been overlooked for too long.” She previewed her plan in a video clip featuring far-left “Squad” member Rep. Rashida Tlaib (D-MI). “We need a government that’s on the side of families—not giant corporations polluting our communities. @RashidaTlaib and I walked through 48217, the most polluted zip code in Michigan, and talked with the families living every day with the effects of pollution,” Warren tweeted alongside the clip:  Like Warren’s other proposals, her environmental injustice plan weaves in aspects of her other campaign promises. For instance, Warren says her housing plan will provide an assistance program, aimed to get impoverished families out of poor, pollution-ridden neighborhoods and into the “neighborhood of their choice.” She also pledges to invest one-third – or $1 trillion – of her climate change investment “into the most vulnerable communities,” although she does not specify what the $1 trillion will be spent on, specifically. Like most of Warren’s plans, her environmental injustice proposal involves the implementation of another tax. In this instance, it is the “Superfund Waste Tax.” Her plan states: There are over 1300 remaining Superfund sites across the country, many located in or adjacent to frontline communities. So-called “orphan” toxic waste clean-ups were originally funded by a series of excise taxes on the petroleum and chemical industries. But thanks to Big Oil and other industry lobbyists, when that tax authority expired in 1995 it was not renewed. Polluters must pay for the consequences of their actions – not leave them for the communities to clean up. I’ll work with Congress to reinstate and then triple the Superfund tax, generating needed revenue to clean up the mess. The presidential hopeful even weaves in Medicare for All as part of her broader proposal, arguing such a system will “make it easier for the federal government to quickly tailor health care responses to specific environmental disasters in affected communities when they occur.” Warren also reiterates her pledge to “ensure that employers and our government honor the promises they made to workers in fossil fuel industries.” “I’ve fought for years to protect pensions and health benefits for retired coal workers, and I’ll continue fighting to maintain the solvency of multi-employer pension plans,” she said. “As president, I’ll protect those benefits that fossil fuel workers have earned.” However, Warren’s role in crafting a petition to the Supreme Court on behalf of LTV Steel – which helped the company’s “fight against a congressional requirement  that it pay millions of dollars into a fund for its retired coal miners’ health care” – calls her promise into question. “As I’ve traveled this country, I’ve heard the human stories from frontline communities. Families where many people have cancer. Coastal communities facing the threat of rising sea levels. Ruined land and poisoned water,” Warren tweeted. “These communities need justice—and I will stand with them,” she added:    ",
      "date": "9 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Elizabeth Warren: I Will End Israeli ‘Occupation’",
      "url": "https://www.breitbart.com/2020-election/2019/07/09/elizabeth-warren-i-will-end-israeli-occupation/",
      "subtitle": "Sen. Elizabeth Warren (D-MA) told anti-Israel activists on Monday that she would end Israel’s “occupation.”",
      "author": "Joel B. Pollak",
      "content": " Warren, who is rapidly moving up through the ranks of Democratic Party presidential contenders, has taken increasingly anti-Israel stances in the past several years. She boycotted Israeli Prime Minister Benjamin Netanyahu’s address to Congress in 2015, and accused Netanyahu of corruption and “embracing right-wing extremism” earlier this year. An activist from the radical left-wing group IfNotNow named Becca Lubow approached Warren in New Hampshire on Monday after a town hall and asked Warren if she would commit to pushing “the Israeli government to end Occupation.” Warren answered, “Yes. Yes. So I’m there.”  In a statement, IfNotNow described, and applauded, what it described as Warren’s increasingly “progressive” stance on Israel:  The word “occupation” was not defined. Some anti-Israel activists consider the very existence of Israel to be an “occupation.” IfNotNow is a fringe group that began in the midst of Israel’s war against the Palestinian terror group Hamas in 2014 — a war for which Hamas was almost universally blamed, and in which Hamas fired rockets at civilian population centers. As Breitbart News noted earlier this year (original links): IfNotNow seeks to disrupt the connections that many American Jewish organizations have with Israel. It blames American Jewish support for Israel for the persistence of the Israeli occupation of Judea and Samaria (the West Bank), though most Palestinians in that territory live under the administration of the Palestinian Authority. In addition to staging sit-ins and protests, members of IfNotNow attempt to infiltrate Jewish summer camps and tours of Israel, where they launch demonstrations or expose the mainstream Jewish community to anti-Israel propaganda. In one episode in 2018, members of IfNotNow were arrested while reciting the Kaddish — the traditional Jewish prayer for the dead — near the offices of the Jewish Federation of Greater Los Angeles, memorializing Palestinians killed in “protests” at the Gaza border. (The vast majority of Palestinians killed were members of Hamas, and they were trying to infiltrate Israel to carry out attacks, not stage a non-violent protest against Israeli policies.) Recently, IfNotNow supported Rep. Ilhan Omar (D-MN) after she repeatedly used antisemitic rhetoric. Joel B. Pollak is Senior Editor-at-Large at Breitbart News. He earned an A.B. in Social Studies and Environmental Science and Public Policy from Harvard. He is a winner of the 2018 Robert Novak Journalism Alumni Fellowship. He is also the co-author of How Trump Won: The Inside Story of a Revolution, which is available from Regnery. Follow him on Twitter at @joelpollak. Photo: file",
      "date": "9 Jul 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Elizabeth Warren Commemorates ‘Indigenous Peoples’ Day’",
      "url": "https://www.breitbart.com/politics/2019/10/14/elizabeth-warren-commemorates-indigenous-peoples-day/",
      "subtitle": "Sen. Elizabeth Warren (D-MA) on Monday commemorated “Indigenous Peoples’ Day” in place of Columbus Day and claimed America has a “long and painful” history of mistreating Native Americans.",
      "author": "Hannah Bleau",
      "content": " The DC Council approved of the “Indigenous Peoples’ Day Emergency Declaration Act of 2019” last week, which temporarily replaces Columbus Day with “Indigenous Peoples’ Day” in the city this year. However, it is not a permanent measure:  Council member David Grosso said last week: “Columbus Day was officially designated as a federal holiday in 1937, despite the fact Columbus did not discover North America, despite the fact millions of people were already living in North America upon his arrival to the Americas, and despite the fact Columbus never set foot on the shores of the current United States. … Columbus enslaved, colonized, mutilated, and massacred thousands of Indigenous People in the Americas. Warren, who falsely claimed Native American heritage throughout her academic career, embraced the temporary replacement. “The story of America’s mistreatment of indigenous peoples is long and painful. And yet, Native communities have proven resilient,” Warren wrote. “We owe them our respect—and we must honor our government’s commitments and promises to them,” she added with the hashtag, “#IndigenousPeoplesDay”:  Warren also provided a link to her extensive plan focused on “honoring and empowering tribal nations and Indigenous peoples”:  The presidential hopeful unveiled her comprehensive plan to “empower” tribal nations in August, which included key pieces from her other plans. She promised to expand federally protected land, sign a “set of executive orders to hold private contractors accountable for pay equity,” and provide Medicare for All. Warren has faced scrutiny for falsely claiming Native American heritage in the past. The results of her DNA test made public last year showed that she possessed between 1/64th and 1/1,024 Native American ancestry (or between 0.1 percent to 1.56 percent). The results called her past claims of Native American heritage – Cherokee heritage, specifically – into question. Not only had Warren identified as a minority professor for years, she also claimed Native American heritage on her Texas Bar registration card and once cited her high cheekbones as proof of her native roots. A clip of an interview from 2012 shows the presidential hopeful telling a reporter that she had pictures proving her Native American family history, but she refused to show them. “I have plenty of pictures. They’re not for you,” Warren told the reporter:  As Breitbart News reported, Warren’s DNA results did not show a direct association with Native American tribes in the U.S., further debunking her claims of Cherokee heritage. Warren has failed to explain why she went so many years claiming minority status without checking her family history, but she has since admitted that she is “not a citizen of a tribe” and issued a general apology for making what she described as a “mistake.” “Like anyone who’s been honest with themselves, I know that I have made mistakes,” Warren said at the Native American Presidential Forum in Sioux City, Iowa, in August. “I am sorry for harm I have caused.” Warren will join 11 other candidates on the debate stage at Otterbein University in Westerville, Ohio, on Tuesday evening. The Massachusetts senator’s false claims of Native American heritage have yet to become a topic of conversation at any of the primary debates.",
      "date": "14 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Elizabeth Warren Thanks Obama for Creation of CFPB After Biden Brags ‘I Got You Votes’",
      "url": "https://www.breitbart.com/2020-election/2019/10/15/elizabeth-warren-thanks-obama-for-creation-of-cfpb-after-biden-brags-i-got-you-votes/",
      "subtitle": "Sen. Elizabeth Warren (D-MA) snubbed former Vice President Joe Biden during Tuesday’s CNN-New York Times Democrat presidential primary debate, thanking only President Barack Obama for securing the votes to establish the Consumer Financial Protection Bureau (CFPB).",
      "author": "Joshua Caplan",
      "content": " “I had an idea for a consumer agency that would keep giant banks from cheating people, and all of the Washington insiders and strategic geniuses said ‘don’t even try because you will never get it passed,’” Warren recalled of her plans for the CFPB, a government agency responsible for consumer protection in the financial sector that was formed in 2011. “We need to get out there and fight for the things that touch people’s lives,” the senator added.  Biden then blurted out: “I agreed with the great job she did!” The former vice president then raised his voice as he explained how he secured votes in Congress to establish the agency. “I got votes for that bill. I convinced people to vote for it. So, let’s get those things straight too,” Biden said. “I am deeply grateful to President Obama, who fought so hard to make sure that agency was passed into law,” Warren replied softly, prompting laughter from both Biden and debate attendees. “I am deeply grateful to every single person who fought for it and who helped pass it into law, but understand—,” she continued. Biden then interrupted Warren with a compliment, stating: “You did a hell of a job in your job.” “Thank you,” the Massachusetts Democrat simply replied.",
      "date": "15 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "More Evidence Emerges Elizabeth Warren Lied About Being Fired for Pregnancy",
      "url": "https://www.breitbart.com/2020-election/2019/10/07/more-evidence-emerges-elizabeth-warren-lied-about-being-fired-for-pregnancy/",
      "subtitle": "New evidence emerged Monday that Sen. Elizabeth Warren (D-MA) has been untruthful in telling voters she was fired from a teaching job because she was “visibly pregnant.”",
      "author": "Joel B. Pollak",
      "content": " As Breitbart News noted Sunday, Warren’s campaign tale was called into question by a 2007 interview in which she suggested she left for lack of qualifications and interest. County records published by the Washington Free Beacon on Monday confirm that Warren resigned and was never fired. The Free Beacon’s Collin Anderson reported: RIVERDALE, N.J.—The Riverdale Board of Education approved a second-year teaching contract for a young Elizabeth Warren, documents show, contradicting the Democratic presidential candidate’s repeated claims that she was asked not to return to teaching after a single year because she was “visibly pregnant.” Minutes of an April 21, 1971, Riverdale Board of Education meeting obtained by the Washington Free Beacon show that the board voted unanimously on a motion to extend Warren a “2nd year” contract for a two-days-per-week teaching job. That job is similar to the one she held the previous year, her first year of teaching. Minutes from a board meeting held two months later, on June 16, 1971, indicate that Warren’s resignation was “accepted with regret.” In fact, the minutes show that far from being fired, Warren had been unanimously approved for a second year:  The minutes also confirm a key detail from the 2007 interview: namely, that Warren was hired on an “emergency” basis because she lacked the necessary education qualifications, despite graduating from George Washington University with a degree in speech pathology, and supposedly pursuing a lifelong dream of being a public school teacher. In the course of her presidential campaign, Warren has repeatedly told the nation a very different story — one in which an old-fashioned male principal discriminated against her because of her pregnancy. In the second presidential debate in Detroit, for example, Warren said: “[A]t the end of that first year, I was visibly pregnant. And back in the day, that meant that the principal said to me — wished me luck and hired someone else for the job.” Joel B. Pollak is Senior Editor-at-Large at Breitbart News. He earned an A.B. in Social Studies and Environmental Science and Public Policy from Harvard College, and a J.D. from Harvard Law School. He is a winner of the 2018 Robert Novak Journalism Alumni Fellowship. He is also the co-author of How Trump Won: The Inside Story of a Revolution, which is available from Regnery. Follow him on Twitter at @joelpollak.",
      "date": "7 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Michael Moore Challenges Elizabeth Warren: Capitalism Economically Enslaves People",
      "url": "https://www.breitbart.com/entertainment/2019/10/15/michael-moore-challenges-elizabeth-warren-capitalism-economically-enslaves-people/",
      "subtitle": "Left-wing documentary filmmaker Michael Moore took a swipe at Sen. Elizabeth Warren (D-MA) during the Democratic Presidential debate on Tuesday, saying that her “accountable capitalism” platform endorses a system that enslaves people.",
      "author": "David Ng",
      "content": " The far-left Farenheit 9/11 director also slammed candidates Joe Biden, Amy Klobuchar, and Pete Buttigieg for their defense of capitalism in the health care system. Sen. Elizabeth Warren (D-MA) said during the televised debate that “corporations only care about their bottom line. I have a plan for that. It’s accountable capitalism.” Sen. Warren was referring to a plan she announced earlier this month called the Accountable Capitalism Act, which would redistribute trillions of dollars from corporations and executives to the middle class. The act would also mandate that corporations act in a closer capacity with its employees and communities. Moore hit back at Warren on social media during Tuesday’s debate, saying that the candidate’s stance on capitalism wasn’t strong enough.  “Senator Warren (whom I love) just said she believes in ‘accountable capitalism.’ There is no such thing,” the left-wing documentarian tweeted. “The only thing capitalism is accountable to is weath and more wealth for the wealthy. It’s only mission is to economically enslave the citizenry so the rich can get richer.”  Moore also lashed out at other Democratic candidates who defended a capitalist-based health care system, saying they are boosting Republican chances of winning in the 2020 elections. “Joe Biden, Amy K and Pete B just boosted the Republican chances of winning in November 2020 by their passionate defense of the for-profit, capitalist-greed health “care” system. #DemocraticDebate,” he said.  Follow David Ng on Twitter @HeyItsDavidNg. Have a tip? Contact me at dng@breitbart.com",
      "date": "15 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Elizabeth Warren Applauds Transgender 9-Year-Old, Suggests Child Help Choose Education Secretary",
      "url": "https://www.breitbart.com/politics/2019/10/10/elizabeth-warren-applauds-transgender-9-year-old-choose-education-secretary/",
      "subtitle": "Democrat presidential hopeful Sen. Elizabeth Warren (D-MA) applauded a nine-year-old child who claims to be transgender during Thursday night’s CNN Equality Town Hall, and she suggested that the child assist her with choosing her education secretary, should she be elected.",
      "author": "Kyle Morris",
      "content": " “My name is Jacob, and I am a nine-year-old transgender American,” Jacob Lemay said to applause from Elizabeth Warren and the audience. “What will you do in your first week as president to make sure kids like me feel safer in schools, and what do you think schools need to do better to make sure that I don’t have to worry about anything but my homework?” “Let me start by saying I want to have a secretary of education who both believes in public education and believes in the value of every one of our kids and is willing to enforce our civil rights laws,” Warren said. “We’ve had some secretaries of education who’ve been better, and we’ve had one that’s been a whole lot worse,” she added. “Her name is Betsy DeVos. So, when I’m president, she’ll be gone.” Before closing, Warren indicated that she would like to have Jacob vet who she chooses as the secretary of education in her administration. “I want to make sure that the person I think is the right secretary of education meets you and hears your story, and then I want you to tell me if you think that’s the right person and then we’ll make the deal,” Warren said. Jacob smiled and gave Warren a thumbs up as he took his seat. Follow Kyle on Twitter @RealKyleMorris and Facebook.",
      "date": "10 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Elizabeth Warren: People Who Are Hateful ‘Celebrate’ President Trump",
      "url": "https://www.breitbart.com/politics/2019/08/06/elizabeth-warren-people-who-are-hateful-celebrate-president-trump/",
      "subtitle": "Sen. Elizabeth Warren (D-MA) spoke to CNN’s Don Lemon on Monday and discussed President Trump’s supposed role in the mass shootings that ravaged communities in El Paso, Texas, and Dayton, Ohio. She proclaimed Trump has “created plenty of space for hate,” adding that hateful people “celebrate” the president while noticeably ignoring her role as the choice candidate of the Dayton shooter.",
      "author": "Hannah Bleau",
      "content": " The presidential candidate spoke about the shootings that occurred over the weekend and told Lemon the president has “created plenty of space for hate.” “Donald Trump says ‘hate has no place in this country.’ Donald Trump has created plenty of space for hate,” she proclaimed. “He is a racist. He has made one racist remark after another. He has put in place racist policies, and we’ve seen the consequences of it,” she continued, seemingly bashing Trump supporters by calling those who “celebrate” and support the president “hateful.” “People who are hateful feel like they are now in power,” Warren said. “They are protected. They celebrate this president.” “This has turned America in a terrible direction, and Donald Trump keeps it going,” she continued. “And let’s be clear. A Republican Congress, Republican leadership in Washington – they got nothing to say about it. And that means they just help strengthen it. They help it keep moving right along,” she added. While she agreed with Lemon that Trump needs to be more “forceful” in condemning white supremacy, she was among critics who dismissed Trump’s most recent forceful rebuke. “It is the responsibility to the President of the United States to help fight back against that– not to wink and nod and smile at it,” she said:   Despite Warren’s assertion, Trump did not “wink and nod and smile” at the carnage that shook the two communities over the weekend. He addressed the American people Monday morning and forcefully condemned “sinister ideologies” like white supremacism and racism, just as Warren requested. “In one voice our nation must condemn racism, bigotry and white supremacy,” Trump said. “These sinister ideologies must be defeated. Hate has no place in America”:  While it is true that the El Paso gunman allegedly posted an anti-immigration manifesto filled with bigoted vitriol, the writer said his twisted thoughts predated Trump. The Dayton shooter, on the other hand, was an avowed leftist who seemingly supported Antifa and held anti-ICE, anti-police, and anti-Second Amendment views, according to a Twitter account linked to the gunman. He also had a liking for Warren herself, writing in one tweet that he would “happily” vote for the Massachusetts senator. Warren has not delved into the Dayton shooter’s purported support for her. Rather, the mainstream media have rallied behind her, urging critics to refrain from implicating Warren. Warren is not the only candidate to dismiss Trump’s swift condemnation. Fellow 2020 candidates pounced following his remarks, continuing to accuse him of fostering a negative environment conducive to white supremacy:    ",
      "date": "6 Aug 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Elizabeth Warren Deletes Tweet Announcing Her DNA Test Results",
      "url": "https://www.breitbart.com/politics/2019/10/17/elizabeth-warren-deletes-tweet-announcing-her-dna-test-results/",
      "subtitle": "Sen. Elizabeth Warren (D-MA) deleted the year-old tweet announcing her DNA test results, it was discovered on Wednesday.",
      "author": "Hannah Bleau",
      "content": " Warren – who claimed to possess Native American heritage, Cherokee, specifically, over the course of her academic career – deleted the infamous tweet announcing the results of her DNA test after PJ Media columnist Jim Treacher wrote a post titled, “Happy Anniversary to Elizabeth Warren’s DNA Test!” on Tuesday: My family (including Fox News-watchers) sat together and talked about what they think of @realDonaldTrump’s attacks on our heritage. And yes, a famous geneticist analyzed my DNA and concluded that it contains Native American ancestry. pic.twitter.com/r3SNzP22f8 — Elizabeth Warren (@ewarren) October 15, 2018    The DNA results did not bode well for Warren, despite her initial victory lap. The results showed that she possessed between 1/64th and 1/1024th Native American ancestry, or between 0.1 percent to 1.56 percent. Additionally, the results indicated that Warren’s minuscule Native American links were not associated with tribes in the United States, further casting doubt on her claims of Cherokee heritage. President Trump pounced on the results. “Pocahontas (the bad version), sometimes referred to as Elizabeth Warren, is getting slammed,” he wrote on October 16, 2018. “She took a bogus DNA test and it showed that she may be 1/1024, far less than the average American. Now Cherokee Nation denies her, ‘DNA test is useless.’ Even they don’t want her. Phony!” he added:  “A DNA test is useless to determine tribal citizenship,” Cherokee Nation Secretary of State Chuck Hoskin Jr. said. “Current DNA tests do not even distinguish whether a person’s ancestors were indigenous to North or South America”: Using a DNA test to lay claim to any connection to the Cherokee Nation or any tribal nation, even vaguely, is inappropriate and wrong. It makes a mockery out of DNA tests and its legitimate uses while also dishonoring legitimate tribal governments and their citizens, whose ancestors are well documented and whose heritage is prove. Senator Warren is undermining tribal interests with her continued claims of tribal heritage. The results followed Warren’s years of false Native American claims. She listed herself as a minority professor at the University of Pennsylvania Law School and Harvard Law School and claimed Native American heritage on her Texas Bar registration card. She continued to tout false claims of Native American heritage into her 2012 senatorial bid, telling a reporter that she had pictures that reflected her Native American heritage but added, “I have plenty of pictures. They’re not for you,” leaving the purported evidence shrouded in mystery:  That same year, Warren told the story of her parents, claiming that her father’s parent’s disapproved of her mother because she – as Warren claimed – was part Cherokee and Delaware. “If your family heritage had an African American like you have, the grandfather or great grandparent who was a Cherokee, would you call yourself a black, and expect African Americans to accept that?” New England Cable News’s Jim Braude asked Warren. “If that same ancestor was black and not Cherokee,” he added. “If my Father’s parents had said, ‘You can’t marry her because she’s black, and that had been part of our family growing up, that we had two different families?” Warren said. “You would be comfortable with saying you’re black?” Braude asked. “It would be part of identification,” Warren quipped:  While Warren has failed to offer an explicit and thorough explanation for her years of misleading claims, she has vaguely apologized for making a “mistake” and admitted that she is “not a person of color” and “not a citizen of a tribe.” “Like anyone who’s been honest with themselves, I know that I have made mistakes,” Warren said at the Native American Presidential Forum in Sioux City, Iowa, in August. “I am sorry for harm I have caused”:  Warren’s campaign deleted the results of her DNA test from her campaign website in August.",
      "date": "17 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Elizabeth Warren: EPA Administrator Must Believe in Climate Change",
      "url": "https://www.breitbart.com/politics/2018/07/06/elizabeth-warren-epa-administrator-must-believe-in-climate-change/",
      "subtitle": "Sen. Elizabeth Warren (D-MA) said on Thursday following President Donald Trump’s tweet announcing that Scott Pruitt was stepping down as administrator of the Environmental Protection Agency (EPA) that anyone who doesn’t believe in climate change should not head the agency.",
      "author": "Penny Starr",
      "content": " The Hill reported on Warren’s statement about Pruitt’s resignation in which she said he should have been fired “28 scandals ago,” even though he was not fired but tendered a letter of resignation to Trump. In the letter, Pruitt mentioned “unrelenting attacks” from the leftwing media and Democrats for alleged ethics violations, including criticism of family members “that have taken a sizable toll on all of us.” Warren claimed in the statement that Pruitt should never have been selected by Trump because he didn’t believe in manmade climate change. “A man who doesn’t believe in climate change never should have been in charge of the Environmental Protection Agency in the first place,” Warren said. “And a government official that corrupt should have been fired by the President of the United States 28 scandals ago.” Warren also slammed Andrew Wheeler, Pruitt’s deputy who will now serve as acting administrator, saying he is “a longtime Washington insider and corporate lawyer who’s done the bidding of fossil fuel companies for decades.” Then Warren went on to trash other members of Trump’s cabinet, calling them by name and saying they have “no business” heading federal agencies. “Donald Trump’s cabinet is full of people who have no business running their agencies,” Warren said. “Betsy DeVos at the Education Department. Steve Mnuchin at Treasury. Jeff Sessions at the Justice Department. Mick Mulvaney and his part-time work at [the Office of Management and Budget] and the [Consumer Financial Protection Bureau],” the Hill reported. In his resignation letter, Pruitt praised the president and thanked him for allowing him to be a part of an agenda that is aimed at reversing the dangerous and damaging regulations put into place by climate change activists in the Barack Obama administration. “Your courage, steadfastness and resolute commitment to get results for the American people, both with regard to improved environmental outcomes as well as historical regulatory reform, is, in fact, occurring at an unprecedented pace and I thank you for the opportunity to serve you and the American people in helping achieve those ends,” Pruitt wrote. Follow @PennyStarrDC on Twitter",
      "date": "6 Jul 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Elizabeth Warren",
      "url": "https://www.breitbart.com/tag/elizabeth-warren/",
      "subtitle": "null",
      "author": "Hannah Bleau",
      "content": "                             ",
      "date": "19 Oct 2019, 8:36 AM PDT",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    }
  ]
}