{
  "articles": [
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9Im36NtpdUyQAG4lsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610811/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2frepublican-ron-johnson-whistleblower-us-ukraine_n_5dd15b80e4b029474818f42a/RK=2/RS=7xJf.4dQcA1R50Oh7d2iZYv815A-",
      "url": "GOP Sen. Ron Johnson: Whistleblower 'Weakened' U.S.-Ukraine Relationship",
      "subtitle": "The whistleblower “exposed things that didn’t need to be exposed,” he said.",
      "author": "Hayley Miller",
      "content": " Sen. Ron Johnson (R-Wis.) on Sunday accused the whistleblower who filed a complaint regarding President Donald Trump’s dealings with Ukraine of weakening the United States’ relationship with the Eastern European country. The whistleblower, reportedly a CIA analyst formerly detailed to the White House, has alleged that Trump used military aid as leverage in his efforts to get Ukraine to investigate political rival Joe Biden. His complaint is the subject of the House’s ongoing impeachment inquiry into the president. But Johnson, a member of the Senate Foreign Relations Committee, blamed the whistleblower ― not Trump and his alleged pressure campaign ― for any strain on U.S.-Ukraine relations during an appearance on NBC’s “Meet the Press.” “One thing that I want to point out is the damage that’s being done to our country through this entire impeachment process,” Johnson said. “You know, it’s going to be very difficult for future presidents to have a candid conversation with a world leader because now we’ve set the precedent of leaking transcripts,” he added. The comment appeared to be a criticism of the whistleblower and his sources, though the White House is the only party that has published a summary, which Trump has incorrectly referred to as a “transcript,” of his July 25 call with Ukrainian President Volodymyr Zelensky. “By the way, those individuals that leaked this, if their interest was a stronger relationship with Ukraine, they didn’t accomplish it,” Johnson continued. “Having this all come out into public has weakened that relationship ― has exposed things that didn’t need to be exposed.” Johnson told CNN earlier this month that he, along with several of Trump’s advisers, had to persuade the president to release the congressionally approved military aid to Ukraine. Trump eventually did so after the White House was made aware of the whistleblower’s complaint. But the Republican senator suggested Sunday that exposing Trump’s actions is bad for America and should have been dealt with privately. “This would have been far better off if we had just taken care of this behind the scenes,” Johnson said. “Most people wanted to support Ukraine that were trying to convince President Trump ― and so the whole. ... Listen, if the whistleblower’s goal was to improve our relationship with Ukraine he utterly ― or she utterly ― failed.” Johnson has said he called Trump in late August to inquire about the delayed U.S. aid to Ukraine and that the president told him he had concerns about the country’s issues with corruption. He also wanted European countries to increase their financial assistance to Ukraine, according to Johnson. On Sunday, Johnson told NBC that Trump had denied “any kind of arrangement that Ukraine had to do something before he released that funding” during their August phone call. Johnson said he received a letter Saturday from Reps. Jim Jordan of Ohio and Devin Nunes of California, two Republican members of the House Intelligence Committee, asking him to “lay out” what he knows about the delayed military aid. He said he won’t be called to testify, but will respond to his colleagues’ letter with his account of what happened. This story has been updated with additional comments from Johnson.",
      "date": "11/17/2019 10:47 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9Im36NtpdUyQAGYlsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610811/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fnancy-pelosi-trump-nixon-impeachment_n_5dd17adde4b0d2e79f8e9f9a/RK=2/RS=HI0kljG9a3qGKozc_DzqU66Aq4g-",
      "url": "Nancy Pelosi: Trump's Actions 'So Much Worse' Than What Nixon Did",
      "subtitle": "The House speaker suggested former President Richard Nixon at least “cared about the country enough” to resign.",
      "author": "Hayley Miller",
      "content": " House Speaker Nancy Pelosi (D-Calif.) said President Donald Trump’s dealings with Ukraine are “so much worse” than former President Richard Nixon’s actions in the Watergate scandal, which prompted his resignation from office. Pelosi, during an interview with CBS’s “Face the Nation” that aired Sunday, discussed the House’s ongoing impeachment inquiry that focuses on Trump’s efforts to get Ukraine to investigate political rival Joe Biden. “It’s really a sad thing,” she said. “What the president did was so much worse than even what Richard Nixon did. But at some point, Richard Nixon cared about the country enough to recognize that this could not continue.” Faced with impeachment and the near certainty that the Senate would vote to remove him from office, Nixon resigned in August 1974. Trump has described his July 25 call with Ukrainian President Volodymyr Zelensky, the focal point of a subsequent whistleblower complaint and the impeachment inquiry, as a “perfect conversation.” He has dismissed the Democratic-led impeachment inquiry as a “witch hunt.” Several State Department officials have testified that Trump used military aid as leverage in his efforts to get Ukraine to investigate Biden. Pelosi told CBS that “of course” there’s a connection between the whistleblower filing his complaint and Trump eventually releasing the congressionally approved aid. She said Trump has “every opportunity to make his case” before House impeachment investigators, including testifying before the House Intelligence Committee or answering questions in writing. Trump on Monday said he would “strongly consider” Pelosi’s suggestion that he testify. “Even though I did nothing wrong, and don’t like giving credibility to this No Due Process Hoax, I like the idea & will, in order to get Congress focused again, strongly consider it!” the president tweeted. Pelosi’s comments followed the first week of public hearings in the impeachment inquiry that included testimonies from acting U.S. Ambassador to Ukraine Bill Taylor and Marie Yovanovitch, who was abruptly recalled from that position by Trump in May. Asked if Democrats had a good week, Pelosi responded that “the American people have had a good week.” “I think truth has had a good week,” she continued. “I think patriotism has had a good week. And I think the Constitution has had a good week. I don’t think the president has had a good week.” This article has been updated to include Trump’s tweet.",
      "date": "11/17/2019 12:50 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9Im36NtpdUyQAF4lsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610811/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2ftrump-kim-jong-un-joe-biden-rabid-dog_n_5dd16881e4b0294748190af3/RK=2/RS=aYF1jb8w2ytM9MZa08kVP73vnuc-",
      "url": "Trump To Kim Jong Un: Joe Biden Is 'Somewhat Better' Than A Rabid Dog",
      "subtitle": "North Korea said the former vice president should “be beaten to death with a stick” for calling Kim a “murderous dictator.”",
      "author": "Amy Russo",
      "content": " President Donald Trump responded to North Korea after its state-run news agency attacked former Vice President Joe Biden as a “rabid dog” who should “be beaten to death with a stick.” In a Sunday morning tweet addressed to North Korean leader Kim Jong Un, Trump expressed mild disapproval of the verbal assault, stating, “Biden may be Sleepy and Very Slow, but he is not a ‘rabid dog.’” “He is actually somewhat better than that, but I am the only one who can get you where you have to be,” the president said, ending his message by encouraging Kim to “get the deal done” on denuclearization. Virtually no progress has been made on the issue. On Thursday, the state-run Korean Central News Agency threatened the Democratic presidential candidate after he criticized Trump’s foreign policy and called Kim a “murderous dictator.” “Anyone who dare slanders the dignity of the supreme leadership of the [Democratic People’s Republic of Korea], can never spare the DPRK’s merciless punishment whoever and wherever,” it said. “And he will be made to see even in a grave what horrible consequences will be brought about by his thoughtless utterances.” The agency continued, “Rabid dogs like Biden can hurt lots of people if they are allowed to run about. They must be beaten to death with a stick, before it is too late,” adding that the former vice president’s demise would “be beneficial for the U.S. also.” Hitting back at the remarks, Biden’s campaign spokesperson Andrew Bates told The Associated Press that it was a sign of Kim’s fear of the 2020 hopeful. “It’s becoming more and more obvious that repugnant dictators, as well as those who admire and ‘love’ them, find Joe Biden threatening,” Bates said. “That’s because he’d restore American leadership in the world on day one by putting our security, interests and values at the heart of our foreign policy.” Unlike North Korea’s treatment of Biden, its regime has praised Trump, including after the ouster of former national security adviser John Bolton. Following Bolton’s departure in September, Kim Myong Gil, North Korea’s chief negotiator for denuclearization talks, reportedly applauded Trump’s “more practical point of view” in pushing out the “troublemaker who used to face everything out of his anachronistic way of thinking.” Trump has also spoken highly of Kim in the past, referring to the dictator as a “great leader” whose country has “a tremendous future.”",
      "date": "11/17/2019 11:56 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9Im36NtpdUyQAFYlsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610811/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2ftrump-hotel-eric-washington-emoluments-walter-shaub_n_5dd1d2cfe4b01f982f0427b7/RK=2/RS=2IZ6..SMWkiVKBoHe.aN27CCz6M-",
      "url": "Trump Retweets Son Eric's Promo Of Their D.C. Hotel, Infuriating His Former Ethics Chief",
      "subtitle": "“Definitely not trying to profit off the presidency at all,” Walter Shaub noted sarcastically.",
      "author": "Mary Papenfuss",
      "content": " President Donald Trump on Sunday retweeted a message from his son Eric touting the Trump International Hotel in Washington. The double promotion with White House clout occurred at the same time that the Trump family is slamming Hunter Biden for allegedly profiting from father Joe Biden’s role as vice president by serving on the board of a Ukrainian energy company. The retweet infuriated Walter Shaub, former head of the U.S. Office of Government Ethics for former President Barack Obama and Trump. “Definitely not trying to profit off the presidency at all,” Shaub noted sarcastically. Unlike previous presidents, Trump has not divested from his businesses to avoid conflicts of interest. His business operations are in a revocable trust — from which he can withdraw money whenever he wants. The Washington hotel has been the target of lawsuits charging that it violates the emoluments clause of the Constitution, which bans federal officeholders from accepting gifts or cash from foreign interests. The clause is intended to guard against undue influence by foreign interests on American officials. Foreign governments, officials and lobbyists frequently pay for rooms and facilities at the hotel. Ukraine President Volodymyr Zelensky made it point earlier this year to tell Trump that he stayed at another of the president’s hotels, in New York. The Trump Organization is considering selling the lease on the Washington hotel, which is owned by the federal government. As part of a sales pitch for the operation, investors have been told they can make millions from foreign governments, CNN reported. Trump has come under increasing criticism for steering business to his enterprises from the White House, often at taxpayer expense. Vice President Mike Pence in September went out of his way at extra expense to stay at Trump’s golf resort in Doonbeg as part of a trip to Ireland to meet with the nation’s prime minister — in Dublin. Trump decided to stage the Group of Seven summit next summer at his Doral golf resort in Florida until he backed down amid a storm of bipartisan criticism.",
      "date": "11/17/2019 08:58 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9Im36NtpdUyQAE4lsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610811/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fpelosi-says-trump-welcome-to-testify-in-impeachment-inquiry_n_5dd1ba0fe4b0d2e79f8ee3ad/RK=2/RS=YoAehNJWKaZj5Whgh_GluklwL88-",
      "url": "Pelosi Says Trump Welcome To Testify In Impeachment Inquiry",
      "subtitle": "The House Speaker said the president is welcome to appear or answer questions in writing, if he chooses.",
      "author": "",
      "content": "WASHINGTON (AP) — Democratic House Speaker Nancy Pelosi invited President Donald Trump to testify in front of investigators in the House impeachment inquiry ahead of a week that will see several key witnesses appear publicly. Pushing back against accusations from the president that the process has been stacked against him, Pelosi said Trump is welcome to appear or answer questions in writing, if he chooses. “If he has information that is exculpatory, that means ex, taking away, culpable, blame, then we look forward to seeing it,” she said in an interview that aired Sunday on CBS’s “Face the Nation.” Trump “could come right before the committee and talk, speak all the truth that he wants if he wants,” she said. Senate Democratic leader Chuck Schumer echoed that suggestion. “If Donald Trump doesn’t agree with what he’s hearing, doesn’t like what he’s hearing, he shouldn’t tweet. He should come to the committee and testify under oath. And he should allow all those around him to come to the committee and testify under oath,” Schumer told reporters. He said the White House’s insistence on blocking witnesses from cooperating begs the question: “What is he hiding?” Trump on Monday said he would “strongly consider” Pelosi’s suggestion that he testify. “Even though I did nothing wrong, and don’t like giving credibility to this No Due Process Hoax, I like the idea & will, in order to get Congress focused again, strongly consider it!” the president tweeted. The comments come as the House Intelligence Committee prepares for a second week of public hearings as part of its inquiry, including with the man who is arguably the most important witness. Gordon Sondland, Trump’s ambassador to the European Union, is the only person interviewed to date who had conversations directly with the president because the White House has blocked others from cooperating with what they dismiss as a sham investigation. And testimony suggests he was intimately involved in discussions that are at the heart of the investigation into whether Trump held up U.S. military aid to Ukraine to try to pressure the county’s president to announce an investigation into Democrats, including former Vice President Joe Biden, a leading 2020 candidate, and his son, Hunter. Multiple witnesses overheard a phone call in which Trump and Sondland reportedly discussed efforts to push for the investigations. In private testimony to impeachment investigators made public Saturday, Tim Morrison, a former National Security Council aide and longtime Republican defense hawk, said Sondland told him he was discussing Ukraine matters directly with Trump. Morrison said Sondland and Trump had spoken approximately five times between July 15 and Sept. 11 — the weeks that $391 million in U.S. assistance was withheld from Ukraine before it was released. And he recounted that Sondland told a top Ukrainian official in a meeting that the vital U.S. military assistance might be freed up if the country’s top prosecutor “would go to the mike and announce that he was opening the Burisma investigation.” Burisma is the gas company that hired Hunter Biden. Morrison’s testimony contradicted much of what Sondland told congressional investigators during his own closed-door deposition, which the ambassador later amended. Trump has said he has no recollection of the overheard call and has suggested he barely knew Sondland, a wealthy donor to his 2016 campaign. But Democrats are hoping he sheds new light on the discussions. “I’m not going to try to prejudge his testimony,” Rep. Jim Himes, D-Conn., said on “Fox News Sunday.” But he suggested, “it was not lost on Ambassador Sondland what happened to the president’s close associate Roger Stone for lying to Congress, to Michael Cohen for lying to Congress. My guess is that Ambassador Sondland is going to do his level best to tell the truth, because otherwise he may have a very unpleasant legal future in front of him.” The committee will also be interviewing a long list of others. On Tuesday, they’ll hear from Morrison along with Jennifer Williams, an aide to Vice President Mike Pence, Alexander Vindman, the director for European affairs at the National Security Council, and Kurt Volker, the former U.S. special envoy to Ukraine. On Wednesday the committee will hear from Sondland in addition to Laura Cooper, a deputy assistant secretary of defense, and David Hale, a State Department official. And on Thursday, Fiona Hill, a former top NSC staffer for Europe and Russia, will appear. Trump, meanwhile, continued to tweet and retweet a steady stream of commentary from supporters as he bashed “The Crazed, Do Nothing Democrats” for “turning Impeachment into a routine partisan weapon.” “That is very bad for our Country, and not what the Founders had in mind!!!!” he wrote. He also tweeted a doctored video exchange between Rep. Adam Schiff, the Democratic chairman of the Intelligence Committee, and Republican Rep. Jim Jordan, in which Schiff said he did not know the identity of the whistleblower whose complaint triggered the inquiry. The clip has been altered to show Schiff wearing a referee’s uniform and loudly blowing a whistle. In her CBS interview, Pelosi vowed to protect the whistleblower, whom Trump has said should be forced to come forward despite longstanding whistleblower protections. “I will make sure he does not intimidate the whistleblower,” Pelosi said. Trump has been under fire for his treatment of one of the witnesses, the former ambassador to Ukraine, Marie Yovanovitch, whom Trump criticized by tweet as she was testifying last week. That attack prompted accusations of witness intimidation from Democrats and even some criticism from Republicans, who have been largely united in their defense of Trump “I think, along with most people, I find the president’s tweet generally unfortunate,” said Ohio Republican Rep. Mike Turner on CNN’s “State of the Union.” Still, he insisted that tweets were “certainly not impeachable and it’s certainly not criminal. And it’s certainly not witness intimidation,” even if Yovanovitch said she felt intimidated by the attacks. Rep. Chris Stewart, R-Utah, said Trump “communicates in ways that sometimes I wouldn’t,” but dismissed the significance of the attacks. “If your basis for impeachment is going to include a tweet, that shows how weak the evidence for that impeachment is,” he said on ABC’s “This Week.” And the backlash didn’t stop Trump from lashing out at yet another witness, this time Pence aide Williams. He directed her in a Sunday tweet to “meet with the other Never Trumpers, who I don’t know & mostly never even heard of, & work out a better presidential attack!” __ Associated Press writer Hope Yen and HuffPost reporter Hayley Miller contributed to this report.",
      "date": "11/17/2019 04:30 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9Im36NtpdUyQAEYlsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610811/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fdan-rather-trump-cult-cnn-mcconnell_n_5dd1c6ede4b01f982f042034/RK=2/RS=EQf6U7RxAr1TLQNn17emrRE2mxw-",
      "url": "Dan Rather Accuses Mitch McConnell Of Being Part Of Donald Trump 'Cult'",
      "subtitle": "“Cults generally don’t end well,” Rather warned on CNN.",
      "author": "Mary Papenfuss",
      "content": " Legendary newsman Dan Rather on Sunday accused Senate Majority Leader Mitch McConnell (R-Ky.) of being part of the troubling “cult” of President Donald Trump. “Increasingly, President Trump’s support seems cultish,” Rather told Brian Stelter on CNN’s “Reliable Sources,” noting: “I’m not the only one making this observation.” It’s “all about him, it’s not about the policy, it’s not about the standards of politics,” he explained. “Cults generally don’t end well,” he said, echoing a tweet he posted Friday. Asked by Stelter if he considered McConnell part of the cult, Rather said: “The short answer is yes.” Rather said the question lawmakers have to decide for impeachment is if Trump tried to “bribe” a foreign government with military aid to investigate a political rival, and if he tried to “intimidate witnesses.” He added: “I’d say history is closing in on him, facts are closing in” on Trump. But Rather said he doubts the Senate will hold a “real” impeachment trial. The cult concept appears to part a growing narrative about the president’s pull on the Republican Party and his supporters. Sources told Vanity Fair for an article last week that conservative attorney George Conway, husband of White House counselor Kellyanne Conway, has complained that his wife is part of the Trump “cult.” Check out Rather’s comments in the video above.",
      "date": "11/17/2019 06:21 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9Im36NtpdUyQAD4lsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610811/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2ffarm-trade-aid-billionaires-south-democrats-china_n_5dd1f062e4b02947481990ab/RK=2/RS=L7VLTSOy52KLgZIVJNBMVjy.USY-",
      "url": "Trump Hails New Farm Aid Billions As Report Reveals Money Helps Wealthy, Southerners",
      "subtitle": "The president again falsely claimed the farm bailout cost is being borne “compliments of the Chinese tariffs.”",
      "author": "Mary Papenfuss",
      "content": " President Donald Trump on Sunday hailed the new round of billions of dollars in taxpayer subsidies to help struggling farmers survive his trade war with China. But his praise follows a troubling report that the trade aid — a total over two years of $28 billion — is being disproportionately doled out to farmers in Trump-supporting Southern states, and being paid to the largest, wealthiest farms and foreign corporations. The Department of Agriculture said Friday it will begin making the second round of this year’s $16 billion in trade aid payments to farmers this week. The aid is not being paid “compliments of China tariffs,” as Trump tweeted, but by the Market Facilitation Program funded by U.S. taxpayers. Trump’s tariffs on Chinese goods are paid by American companies that import the products and typically pass on costs to U.S. consumers. Nor has China started to “buy big again,” as Trump claimed. Though China purchased 50 million bushels of soy from American farmers in October, the American Farm Bureau Federation said it was still 76% below purchase levels before Trump launched his trade war. Also, smaller farmers will unlikely be the “big beneficiaries” of the aid, as Trump tweeted, because aid is flowing to the largest and most successful farmers rather than aiding struggling operations, according to a study in August by the Environmental Working Group. More than half of the farm bailouts from January 2018 to April 2019 went to just one-tenth of the recipients in the program, according to the study. The top 1% of farmers were paid an average of $183,000, while the bottom 80% averaged less than $5,000. Trump’s praise for the aid follows by just days another critical report by Democrats on the Senate Committee on Agriculture, Nutrition, and Forestry, saying the aid package “treats farmers unfairly.” Figures show that 95% of top payment rates are going to farmers in the South, even though they have been less affected by the trade war with China, and that significant payments have been made to wealthy farmers and foreign corporations, the report noted. Five Southern states receive the highest payments per acre under the program — Georgia, Mississippi, Alabama, Tennessee, and Arkansas. All voted for Trump, all but Georgia voted overwhelmingly for him. The analysis determined that farmers in the Midwest and Northern Plains have been hurt the most by the trade war. The report accused the Agriculture Department of doing nothing to direct aid to struggling small and medium farms, and farmers just starting out. Instead, the agency doubled payment limits, directing even more money to large, wealthy farming partnerships. The report also lashed the aid program for making commodity purchases from foreign-owned agricultural conglomerates, including $90 million paid to a subsidiary of Brazilian-owned JBS SA. Meanwhile, farm fortunes continue to stumble. The Farm Bureau reported last month that farm bankruptcies were up 24%, with more on the way. In other data released last week, farm income fell in the third quarter from a year ago in each of the seven rural heartland states covered by the Kansas City Fed.",
      "date": "11/18/2019 12:06 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9Im36NtpdUyQADYlsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610811/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fradio-host-says-he-was-fired-over-trump_n_5dd1586ee4b0d2e79f8e7211/RK=2/RS=TK4J3SAZt0a7RxbI7pN8c2YMENQ-",
      "url": "Talk Radio Host Says He Was Fired Mid-Show After Criticizing Trump",
      "subtitle": "Craig Silverman said he was bashing Trump and his conservative colleagues’ coverage of the impeachment hearings when he was told: “You’re done.”",
      "author": "Nina Golgowski",
      "content": " A talk show host from a conservative radio station in Denver says he was fired midway through his weekly broadcast after criticizing both President Donald Trump and the way station employees had covered the impeachment inquiry. Craig Silverman, a former chief deputy district attorney in Denver, said he was discussing Trump and the president’s criminally indicted associates on 710 KNUS on Saturday when he was abruptly taken off the air. “It was pretty startling,” Silverman said on CNN’s “Reliable Sources” on Sunday. “While I’m talking about the association of Donald Trump, Paul Manafort, Roger Stone, Roy Cohn, right as I was making my points about that, the show went dark, the program director came in and said, ‘You’re done.’” Silverman said the decision followed him criticizing his conservative colleagues for not discussing the ongoing impeachment hearings, which on Friday featured testimony from former U.S. ambassador to Ukraine Marie Yovanovitch. “Marie Yovanovitch, she inspired me. She was an outstanding witness, but if nobody on radio talks about it, how are the American people going to understand?” he asked. 710 KNUS, which is owned by the conservative-leaning Salem Media Group, did not respond to HuffPost’s request for comment. In an email to CNN Business﻿, Brian Taylor, KNUS vice president and general manager, denied that Silverman’s show was taken off the air because of his impeachment coverage. He instead said that it was because Silverman mentioned a recent appearance on a competing station, which Silverman had been told not to speak on. “We asked Craig to avoid appearing there, since we consider him an important part of KNUS,” Taylor said in the email. “The notion that he was relieved of his program because he criticized President Trump is absolutely untrue. We have never told Mr. Silverman the position to take on Trump and impeachment.” Silverman, who off the air works as a trial attorney, has said he is an “independent contractor” for the station. Silverman, who has identified himself as an independent who voted for Trump, posted on Twitter after his alleged firing to say that he won’t let censoring stop him and will continue to “call things as I see them.” “I see corruption and blatant dishonesty by [Trump] and his cronies. I also see bullying/smearing of American heroes w/ courage to take (an) oath and tell truth,” he tweeted. Silverman said he is confident he’ll find another forum to continue his talk show. This story has been updated with a response from a KNUS representative.",
      "date": "11/17/2019 03:37 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9Im36NtpdUyQAC4lsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610811/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fmike-turner-trump-tweet-unfortunate_n_5dd18640e4b01f982f03e166/RK=2/RS=zanrP717.alPnplJWfTQW2tC8zo-",
      "url": "GOP Congressman: Trump's Yovanovitch Tweet 'Unfortunate' But 'Not Impeachable'",
      "subtitle": "Rep. Mike Turner said the president’s tweet, sent as the former U.S. ambassador to Ukraine testified before Congress, was “certainly not witness intimidation.”",
      "author": "Hayley Miller",
      "content": " Rep. Mike Turner (R-Ohio) said President Donald Trump’s tweet attacking former U.S. Ambassador to Ukraine Marie Yovanovitch as she testified before Congress on Friday was “generally unfortunate” but did not amount to witness intimidation. In his tweet, Trump claimed everywhere Yovanovitch went “turned bad.” House Intelligence Committee Chairman Adam Schiff (D-Calif.) read Yovanovitch the tweet during the hearing Friday ― minutes after it was sent ― and asked for her reaction. She responded that Trump’s comments were “very intimidating.” But Turner, a member of House Intelligence Committee, appeared to shrug off the president’s timely tweet during an appearance Sunday on CNN’s “State of the Union.” “Does it concern you at all that a witness found what President Trump tweeted to be intimidating?” host Jake Tapper asked Turner. “I think along with most people I find Trump’s tweet generally unfortunate,” the Republican congressman responded before attacking Schiff and accusing him of being “obsessed with impeachment.” “It’s kind of laughable that in the middle of the hearing [Schiff] reads a witness a tweet that she’s, up to that point, unaware of and then says, ‘Shazam! Eureka! I have another reason to impeach the president,’” Turner continued. Tapper pressed him again: “I get you don’t like Congressman Schiff, but you do find it concerning that a witness in real time found the president’s tweet to be ...  intimidating?” “It’s certainly not impeachable,” Turner said. “And it’s certainly not criminal. And it’s certainly not witness intimidation. It certainly wasn’t trying to prevent her ― or wouldn’t have prevented her ― from testifying. She was actually in the process of testifying.” But Tapper continued to grill him, asking how the tweet doesn’t amount to witness intimidation if Yovanovitch herself said she felt intimidated by it. “Clearly, she testified completely and fully. ... She was in no means intimidated and prevented from testifying,” Turner claimed, prompting Tapper to note that he’s “not a mind reader” and has no idea whether Trump’s tweet caused her to hold back during her testimony. Though Republicans have largely defended Trump’s comments, his tweet drew significant backlash from Democrats and some members of the GOP. Sen. Chris Murphy (D-Conn.) said Sunday, during an appearance on NBC’s “Meet the Press,” that the House may want to consider the tweet as an article of impeachment. Though Trump abruptly recalled Yovanovitch from her position as ambassador in May, Murphy said, she continues to work in the State Department. “The president is basically telling her during her testimony is that there may be consequences to you and your family and your paycheck if you don’t shut up,” Murphy said. “And the message that’s being sent to everybody else who’s thinking about testifying is chilling as well.”",
      "date": "11/17/2019 02:01 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9DuP4NtpdQBUAcYlsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610809/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2ftrump-lie-mueller-written-testimony_n_5dd2c9d4e4b01f982f066331/RK=2/RS=SH1vEs0fZcxhdEDIgkJ1IL72kP0-",
      "url": "House Investigating Whether Trump Lied To Mueller In U.S. Russia Probe",
      "subtitle": "President Donald Trump may have lied in his written testimony to former U.S. Special Counsel Robert Mueller.",
      "author": "",
      "content": "WASHINGTON (Reuters) - The U.S. House of Representatives is probing whether President Donald Trump lied in his written testimony submitted to then-U.S. Special Counsel Robert Mueller as part of the completed federal investigation into Russian meddling in the 2016 election, CNN said on Monday. A House lawyer told a federal appeals court in Washington on Monday that lawmakers were examining whether Trump’s written answers to federal investigators were untruthful, CNN reported. A spokeswoman for the House Judiciary Committee had no immediate comment. Mueller submitted a report to U.S. Attorney General William Barr in March after completing a 22-month investigation that detailed Russia’s campaign of hacking and propaganda to boost Trump’s candidacy in the 2016 election as well as extensive contacts between Trump’s campaign and Moscow. House lawyers disclosed the investigation into Trump’s written responses in September, saying in a court filing that materials from the Mueller report could show Trump was not honest about his knowledge of his campaign’s contacts with WikiLeaks, which published emails hacked from the Democratic Party. The redacted Mueller report materials “have direct bearing on whether the president was untruthful, and further obstructed the special counsel’s investigation, when in providing written responses to the special counsel’s questions he denied being aware of any communications between his campaign and WikiLeaks,” the House lawyers said in the filing. Last week, Trump’s former deputy campaign chairman, Rick Gates, suggested in testimony during a jury trial in a criminal case that Trump talked to longtime adviser Roger Stone about WikiLeaks during the 2016 campaign. Gates testified that after finishing a July 2016 call from Stone, Trump indicated that “more information would be coming,” in an apparent reference to WikiLeaks. Gates’ testimony appeared to conflict with sworn written statements that Trump gave Mueller. In Trump’s written responses to Mueller, he said he could not recall discussing WikiLeaks with Stone. “I do not recall discussing WikiLeaks with him,” Trump wrote. “Nor do I recall being aware of Mr. Stone having discussed WikiLeaks with individuals associated with my campaign.” (Reporting by Susan Heavey; Editing by Bill Berkrot)",
      "date": "11/18/2019 11:54 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9DuP4NtpdQBUAb4lsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610809/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2ftrump-walter-reed-medical-center-unannounced-exam_n_5dd15aeae4b01f982f03a478/RK=2/RS=02nN83VheGsRQ1fZpuH7i7MsCVQ-",
      "url": "Trump Visits Walter Reed Medical Center For Unannounced Exam",
      "subtitle": "White House press secretary Stephanie Grisham said the president received “routine checkups as part of his annual exam.”",
      "author": "Amy Russo",
      "content": " President Donald Trump on Saturday made an unannounced trip to Walter Reed National Military Medical Center for a routine exam, White House press secretary Stephanie Grisham said. The two-hour visit to the Bethesda, Maryland, hospital included lab work and was not on Trump’s schedule, according to The New York Times. In an appearance on Fox News, Grisham said the president was preparing for “a really busy year ahead” by getting “a head start with some routine checkups as part of his annual exam.” “He is healthy as can be,” she added. “He’s got more energy than anybody in the White House.” Fox News opinion host Jeanine Pirro, a staunch defender of the Trump administration, praised the president as “almost superhuman.” In a midnight tweet on Sunday, Trump said he had been visiting “a great family of a young man under major surgery” at Walter Reed. The patient is a U.S. Army Special Forces soldier who was wounded in Afghanistan, CNN reported. While there, Trump said he “began phase one of my yearly physical.” “Everything very good (great!),” he wrote. “Will complete next year.” Trump’s previous physical in February, which also took place at Walter Reed, was on his public schedule. Sean Conley, a Navy officer and the president’s personal doctor, said in a memo at the time that he determined in the four-hour exam that Trump was “in very good health” and anticipated that he would “remain so for the duration of his Presidency, and beyond.”",
      "date": "11/17/2019 11:21 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9DuP4NtpdQBUAbYlsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610809/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2ftrum-press-notes-meme_n_5dd59626e4b010f3f1d1d162/RK=2/RS=19nOqlhxK4NmeBpfzj4pUXpSL9o-",
      "url": "Trump's Super-Sized Press Notes Have Become Twitter's New Favorite Meme",
      "subtitle": "After a photo of the president’s notepad went viral, Twitter users responded by offering alternative versions of his notes.",
      "author": "David Moye",
      "content": " President Donald Trump’s recitation of Gordon Sondland’s impeachment hearing testimony on Wednesday was noteworthy in more ways than one. Trump’s attempt to spin his ambassador to the European Union’s testimony as vindication for himself was a master class in gaslighting, but the real star of the show was the notepad he used for his disinformation dump. Twitter users, bless their hearts, responded by offering alternative versions of the notes. One person felt Panic! At The Disco lyrics were more appropriate. Another felt the president should be focusing his attention on more pressing matters ― like “The Mandalorian.” Others thought Trump was just waiting for a passing bus that he could throw a certain someone under. Some Twitter users thought Dr. Seuss was more Trump’s speed. And one person decided to try using the president’s persuasion techniques in their own life.",
      "date": "11/20/2019 03:26 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9DuP4NtpdQBUAa4lsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610809/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2ftrump-chris-wallace-steve-scalise_n_5dd19d5fe4b029474819495e/RK=2/RS=MvZ1zjjMS9ITzjg42_.SYvUiyEQ-",
      "url": "Trump Calls Fox News' Chris Wallace 'Nasty & Obnoxious' Over Steve Scalise Interview",
      "subtitle": "The president wasn’t happy with the way Wallace grilled one of his loudest cheerleaders in Congress about impeachment.",
      "author": "Hayley Miller",
      "content": " President Donald Trump lambasted Fox News’ Chris Wallace on Sunday hours after the veteran journalist subjected Rep. Steve Scalise (R-La.) to a thorny line of questioning about the House’s ongoing impeachment inquiry. The president tweeted that Scalise, one of his loudest cheerleaders in Congress, “blew the nasty & obnoxious Chris Wallace ... away” during his appearance on “Fox News Sunday.” “This kind of dumb and unfair interview would never have happened in the @FoxNews past,” Trump wrote, adding that Wallace “will never be his father,” the late journalist Mike Wallace. HuffPost reached out to Fox News and Scalise’s office for comment. Neither immediately responded. Though Fox News is often a safe space for Trump, featuring largely friendly coverage of his presidency, he has previously lashed out at a few network employees who have at times been critical of his actions. Last month, he tweeted that someone should explain to Wallace that his July 25 phone call with Ukrainian President Volodymyr Zelensky, the focal point of a subsequent whistleblower complaint and the ongoing impeachment inquiry, was a “good one.” He repeatedly attacked anchor Shepard Smith, calling him “hopeless” and “totally biased” before Smith abruptly left the network last month. Trump’s latest criticism of Wallace came hours after the “Fox News Sunday” host interviewed Scalise. During the exchange, Wallace called out Scalise for “very badly” mischaracterizing some of the impeachment inquiry witnesses’ testimonies. “Ultimately, President Trump and President Zelensky were the ones on the call,” Scalise told Wallace. “Both of them said there was nothing wrong. The foreign minister of Ukraine just came out a few days ago to clear some of this up to say there was never a link between money ―” Wallace interrupted to point out that the Ukrainian foreign minister hadn’t been on the call. Scalise has repeatedly tried to dismiss impeachment inquiry witnesses for having only secondhand information about Trump’s dealings with Ukraine. “If [U.S. Ambassador to the European Union] Gordon Sondland says the president told him, ‘Condition aid to Ukraine on investigating the Bidens,’ are you going to say that he’s wrong, that’s he’s lying?” Wallace asked. Sondland, who donated $1 million to Trump’s inaugural committee before the president appointed him as ambassador, is scheduled to publicly testify before the House Intelligence Committee on Wednesday. He initially testified behind closed doors that he wasn’t aware of Trump’s pressure campaign to get Ukraine to investigate Biden, a front-runner in the 2020 Democratic presidential primary. He later amended his testimony to say that he knew about it. “Look, I know you’ve been asking and others have been asking hypothetical questions ― let’s talk in reality,” Scalise said, adding that “not one” of the State Department officials who testified before Congress last week as part of the impeachment inquiry said they saw Trump commit an impeachable offense. But Wallace interrupted again to scold Scalise for misrepresenting their testimonies. “Sir, with all due respect, that very badly mischaracterizes what they said,” Wallace said. “William Taylor, for instance, the acting ambassador to Ukraine, was asked whether or not these were impeachable offenses. He said, ‘I’m there as a fact witness. I’m not there to pass judgment.’” “But he made it clear about what he thought the president was doing,” Wallace continued. “He said withholding military aid to help with the president’s political campaign was crazy.” Scalise shrugged off Taylor’s claim: “The problem with that is it didn’t happen.”",
      "date": "11/17/2019 04:17 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9DuP4NtpdQBUAaYlsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610809/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2ffox-and-friends-clint-lorance-pardon_n_5dd2bf08e4b01f982f063e94/RK=2/RS=14AXs4zNTbgyIU4GnY8QYvzOaA0-",
      "url": "'Fox & Friends' Hosts Gush Over Convicted War Criminal Pardoned By Trump",
      "subtitle": "“The timing is perfect because next week is Thanksgiving,” host Ainsley Earhardt told Army 1st Lt. Clint Lorance.",
      "author": "Hayley Miller",
      "content": " A convicted war criminal pardoned by President Donald Trump stopped by “Fox & Friends” on Monday for his first interview since being released from military prison, and the show’s hosts were apparently over the moon about it. Army 1st Lt. Clint Lorance told hosts Steve Doocy, Ainsley Earhardt and Pete Hegseth that he loves Trump, Vice President Mike Pence and their “impassioned leadership.” “Thank you for serving our country,” a teary Earhardt told him. “God bless. We wish you all the best in your future.” Hegseth had previously lobbied the White House for the soldier’s release. Against the advice of the Defense Department, Trump last week issued pardons for Lorance and Army Maj. Mathew Golsteyn, another U.S. service member accused of war crimes, and restored a promotion for Navy SEAL Edward Gallagher, who had been accused of murdering a prisoner of war. Lorance was found guilty of second-degree murder in 2013 for ordering his soldiers to fire on three men in Afghanistan five years earlier. He was released from Fort Leavenworth in Kansas on Friday after serving six years of his 19-year prison sentence. “I’m so happy to be an American,” Lorance told Fox News. “A soldier or service member who knows that their commanders love them will go to the gates of hell for their country and knock ’em down.” “The timing is perfect because next week is Thanksgiving,” Earhardt said of Lorance’s release. Asked if he would like to say anything to Trump, Lorance stared directly into the camera and said, “I love you, sir.” “You’re awesome,” he continued. “I wish you had a better team around you. You need more people watching your back, and I think you don’t have a lot of that.” Many Democrats have condemned Trump’s decision to pardon the men, stating that it could put U.S. troops’ lives at risk and jeopardize justice. South Bend, Indiana, Mayor Pete Buttigieg, a frontrunner in the 2020 Democratic presidential primary race and a Navy veteran, said Trump had “dishonored our armed services” by issuing the pardons. Lorance dismissed Democrats’ criticism, claiming that senior Pentagon officials “threw me under the bus.” He said that he’s “actually proud of everything that happened to me.” Defense Secretary Mark Esper urged Trump not to intervene in the military justice system by dismissing charges or changing the sentences of service members accused of war crimes, CNN reported. On Monday, Lorance said Trump told him on the phone last week that the pardons would make “a lot of people irritated” but that he didn’t care. “That’s what I want in my commander in chief,” Lorance said on Fox News. “The military justice system is completely broken.” Before being pardoned, Golsteyn was facing murder charges for killing an unarmed Afghan suspected of being a Taliban bomb-maker. Gallagher had been acquitted of murdering a teenage prisoner of war in Iraq, but he was found guilty of posing for photos with the body and demoted for that. Trump restored his promotion. Hegseth, an Army veteran himself, reportedly played a major role in securing pardons for Lorance, Golsteyn and Gallagher. “This has been a group fight,” Hegseth told Lorance toward the end of Monday’s interview. “We’re grateful you spent your first opportunity here at ‘Fox & Friends.’” Earhardt said Lorance’s story “makes you want to cry.” “It does,” Doocy added. Watch Lorance’s full interview on “Fox & Friends” below:",
      "date": "11/18/2019 01:29 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9DuP4NtpdQBUAZ4lsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610809/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fchris-cuomo-gop-hypocrisy_n_5dd4cc5ce4b0e29d727bce3d/RK=2/RS=YzsoPPInMBlYxBW5wWCKXtHRnwA-",
      "url": "Chris Cuomo Nails 'Pathetic' Republicans For Trump Impeachment Hypocrisy",
      "subtitle": "CNN host calls out GOP lawmakers for an insincere defense of the president.",
      "author": "Ed Mazza",
      "content": " CNN’s Chris Cuomo is calling Republicans hypocrites for their defense of President Donald Trump during the impeachment hearings. On one hand, Cuomo noted, they’re dismissing any evidence that doesn’t come from a first-hand witness to Trump’s behavior in the White House. On the other, they’re supporting Trump’s efforts to block any witness with first-hand info from testifying, including acting chief of staff Mick Mulvaney, former national security adviser John Bolton and Secretary of State Mike Pompeo. “If everything is so perfect, then why hide the key players?” Cuomo said on CNN on Tuesday night. “If the Republicans are so desperate for first-hand knowledge ― so frustrated that people can’t give them the straight truth ― then why don’t they ask for the main players?” He called out the GOP for trying to expose the whistleblower, but not “the people at the top of the food chain.” “You want first-hand info, but you don’t want to question Bolton. You don’t want Pompeo. You don’t want Mulvaney,” he said. “Bolton called it a drug deal!” Later, Cuomo asked: “Do you understand the hypocrisy at play here? All of them are defying subpoenas for either documents or testimony at the White House’s direction. Why?” He said Republicans are trying to deceive the public about the process instead of working to get the information they claim they want: Think about how pathetic it is to watch these men and women pick apart the inches of insight that these men and women who’ve testified so far have about the decisions that others have made, instructions others gave them, and yet leave yards of truth untouched. See Cuomo’s full monologue below:",
      "date": "11/20/2019 02:39 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9DuP4NtpdQBUAZYlsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610809/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fstephen-colbert-trump-impeachment-testiomy_n_5dd49d9be4b0fc53f20a9951/RK=2/RS=Bv.D_tPhAnopyEagijYb2MFXILk-",
      "url": "Stephen Colbert Reveals The 'Beautiful' Impeachment Moment That'll 'Enrage' Trump",
      "subtitle": "The “Late Show” host said one key piece of  Lt. Col. Alexander Vindman’s testimony featured a couple of things the president hates.",
      "author": "Ed Mazza",
      "content": " “Late Show” host Stephen Colbert praised National Security Council official Lt. Col. Alexander Vindman for his powerful testimony during Tuesday’s impeachment hearings investigating President Donald Trump. Vindman spoke of how his father emigrated from the Soviet Union to the United States 40 years ago “in search of a better life for our family.” He also sent a message to his father during his testimony, saying he’d made the right choice to come to America. “Do not worry. I will be fine for telling the truth,” Vindman said. Colbert called the moment “beautiful” as his studio audience cheered for the combat veteran. “But you know, it’s really going to enrage Trump,” Colbert added. “Because it features his two least favorite things: immigrants and fathers who love their sons.” See more of his monologue below:",
      "date": "11/19/2019 09:59 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9DuP4NtpdQBUAY4lsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610809/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2ftrump-sondland-quid-pro-quo_n_5dd5d31ae4b0e29d727e8391/RK=2/RS=TiogDpkxm_2ReBbZmk3IUNx7xdY-",
      "url": "With ‘No Quid Pro Quo’ Defense Shredded, Trump Left With ‘I Can Do Whatever I Want’",
      "subtitle": "His fallback argument is that presidents have full authority to shape foreign policy, even to help their own campaigns.",
      "author": "S.V. Date",
      "content": " WASHINGTON ― Explosive testimony from a hotelier who turned a $1 million inaugural donation into a glamorous ambassadorship has largely left the White House with a single defense of President Donald Trump: that coercing foreign leaders into investigating a political rival is completely legal and not at all impeachable. Trump, his White House staff and his allies have for weeks been pointing to a Sept. 9 text message from Gordon Sondland, ambassador to the European Union, to his State Department colleagues, describing a phone conversation he’d had with Trump: “The president has been crystal clear no quid pro quo’s of any kind.” But in an impeachment hearing Wednesday before the House Intelligence Committee, Sondland testified that not only was there a quid pro quo with Ukraine, but virtually every top official in the Trump administration was well aware of it. “Was there a quid pro quo? As I testified previously … the answer is yes,” Sondland said in his opening statement, which heavily revised what he had told lawmakers in closed-door testimony on Oct. 17. “Everyone was in the loop. It was no secret.” Sondland’s appearance Wednesday also confirmed testimony by several other witnesses that $391 million in congressionally approved military aid to Ukraine was being blocked by the White House until the new Ukrainian president announced investigations into two matters: alleged corruption by the Democrat Trump most feared in 2020, former Vice President Joe Biden, and a debunked conspiracy theory falsely claiming that Russia had not helped Trump win the 2016 election but that Ukrainian officials had planted false evidence implicating Russia. All this material will likely make it more difficult for Trump’s defenders in the Senate, should there eventually be a trial on impeachment charges, to argue that Trump did not withhold official benefits to Ukraine in return for politically useful favors to himself, former prosecutors said. “His best remaining argument is that what he did was wrongful but should not result in his removal from office,” said Renato Mariotti, a former assistant U.S. attorney in Chicago. The White House has struggled to settle on a coherent defense of Trump’s actions, at first arguing that the impeachment process itself was flawed and therefore unfair to Trump. Then, the main thrust became that Trump has a legitimate interest in ensuring that U.S. taxpayer money is not wasted in countries with rampant corruption ― but that was undermined by the lack of any record of Trump criticizing corruption in instances other than the allegations about Biden’s son’s work with a Ukrainian natural gas company. This could leave the White House pushing the most basic argument: that Trump as president has broad authority to set foreign policy, even if it benefits him personally. This argument has been made by outside White House allies as well as Republicans on Capitol Hill. “The president can meet with whoever he wants to meet for good reason or no reason at all,” said Texas Republican Sen. John Cornyn. One White House official, speaking on condition of anonymity, said that Trump has been denied the opportunity to participate in the proceedings. “We don’t have to accept as compelling evidence testimony from any witness we haven’t been able to cross-examine. The president has been denied all levels of due process,” the official said. On Wednesday, despite all the witness testimony to the contrary, Trump personally continued repeating his claim that he did not try to coerce Ukraine to help him damage Biden. He read from handwritten notes before boarding a helicopter, repeating what he said he’d told Sondland in a September phone call: “‘I want nothing. I want nothing. I want no quid pro quo. Tell Zelensky’ ― President Zelensky ― ‘to do the right thing.’ So here’s my answer: ‘I want nothing. I want nothing. I want no quid pro quo.’” Republicans in the impeachment hearing, meanwhile, continued to make a separate argument ― that the entire question is moot because the aid was ultimately delivered. “The fact is the aid was given to Ukraine without any announcement of new investigations,” said Rep. Elise Stefanik of New York. “They got the money, they got the money. God bless America, it all worked out, right?” added Rep. Jim Jordan of Ohio. Rep. Adam Schiff, the Democratic chairman of the Intelligence Committee, said their argument made no sense, given that the military aid was only released after the White House learned that a whistleblower complaint on the matter was about to make its way to Congress, despite White House attempts to block it. “Getting caught is no defense,” said Schiff. Danya Perry, a former federal prosecutor in New York City, said the Republicans’ related argument that Trump could not have committed bribery or extortion because he never used those words is similarly nonsensical. “If a mobster, caught in the act of kneecapping a victim, were to tell the cops: ‘I am definitely not committing an extortive act under Title 18, United States Code, section 1951,’ it likely would not be an overly persuasive line of defense,” she said. HuffPost reporter Igor Bobic contributed to this report.",
      "date": "11/20/2019 08:14 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9DuP4NtpdQBUAYYlsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610809/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2ftrump-impeachment-hearings-public-day-3_n_5dd3e7c7e4b0263fbc9abce1/RK=2/RS=yNec7509zbZel0conWEbUWatMuU-",
      "url": "What To Watch On Day 3 Of Public Trump Impeachment Hearings",
      "subtitle": "Army Lt. Col. Alexander Vindman and adviser Jennifer Williams heard the July 25 phone call for themselves.",
      "author": "",
      "content": "WASHINGTON (AP) — They heard the July 25 phone call for themselves. And now, Army Lt. Col. Alexander Vindman and adviser Jennifer Williams are set to tell Americans and the world about its content and their concerns as the lead witnesses in perhaps the most consequential week of the impeachment hearings against President Donald Trump. They are the first two of nine witnesses called to testify before the House Intelligence Committee this week. The procession includes officials closest to Trump as lawmakers grind through their investigation of the 45th president. Vindman and Williams were listening with others in the White House Situation Room and heard Trump pressure Ukraine’s president to do him the “favor” of investigating Joe Biden and his son, all while the U.S. had placed a hold on aid to Ukraine. What to watch as the marathon week of hearings opens at 9 a.m. EST Tuesday: ___ Vindman is a Soviet-era immigrant who came to the U.S. as a toddler and grew up to become a decorated soldier and a White House aide. Now, he is a 20-year Army officer assigned to the National Security Council at the white-hot center of the inquiry. Vindman, 44, testified last month in closed session that he twice raised concerns about Trump and his European Union ambassador, Gordon Sondland, inappropriately pushing Ukrainian leaders to investigate the former vice president and his son. “I have a deep appreciation for American values and ideals and the power of freedom. I am a patriot, and it is my sacred duty and honor to advance and defend our country, irrespective of party or politics,” Vindman said in written remarks. He earned the Purple Heart after being wounded in Iraq in 2004 leading infantrymen. In October, Vindman attended his closed-door testimony wearing his Army service uniform, with a chest full of military ribbons and other commendations. The visual underscored Trump’s conflict with the military and national security establishment. Republicans are expressing concern about Vindman’s “judgment” in handling his concern about the call. ___ Trump and the world are about to find out. Williams is Vice President Mike Pence’s special adviser for Europe and Russia, on detail from the State Department. On July 25, she was in the Situation Room taking notes as Trump spoke with Ukrainian President Volodymyr Zelenskiy about potential 2020 rival Joe Biden’s son Hunter, who sat on the board of Burisma, a Ukrainian gas company. “It was President Trump who raised Burisma,” Williams testified on Nov. 7. Later, she says that “I believed those references to be more political in nature and so that struck me as unusual.” The word Burisma does not appear in the rough transcript of the call released by the White House. “Tell Jennifer Williams, whoever that is, to read BOTH transcripts of the presidential calls,” Trump tweeted in part over the weekend. He called her a “Never Trumper.” ___ The president and his allies have pointed to Zelenskiy’s statement during a September press conference, shoulder-to-shoulder with Trump, in which the Ukrainian president said he didn’t feel any pressure in the July 25 call. But even before that call, Zelenskiy had reported feeling pressure from the Trump administration to investigate Biden, The Associated Press reported. Zelenskiy was concerned Trump and associates were pressing him to take action that could affect the 2020 election, two individuals said. They spoke on condition of anonymity because of the diplomatic and political sensitivity of the issue. State Department officials in Kyiv and Washington were briefed on Zelenskiy’s concerns at least three times, the two individuals said, and notes summarizing his worries were circulated within the department. ___ He did last week, castigating the ambassador he fired, Marie Yovanovich, on Twitter and giving weight to her account of being bullied out of her job by members of the administration. House Speaker Nancy Pelosi several times over the past few days has suggested that if Trump wants to testify — she mockingly explained the word “exculpatory” — he’s welcome to do so in person or in writing. He hasn’t said he will do so. But Trump did tweet: “Even though I did nothing wrong, and don’t like giving credibility to this No Due Process Hoax, I like the idea & will, in order to get Congress focused again, strongly consider it!” ___ The administration is confident about the testimony of all the impeachment witnesses this week except for that of EU Ambassador Gordon Sondland on Wednesday, according to two White House officials who spoke on condition of anonymity to discuss internal thinking. Like all the witnesses, Sondland will testify under oath and penalty of perjury. Sondland already has had to amend his earlier account after contradicting testimony from others. The White House is happy with the role of Rep. Jim Jordan, R-Ohio, as the committee’s Republican bulldog questioner. But privately these officials pointed to concerns in the White House about the performance of GOP counsel Steve Castor. ___ The president’s allies have mostly stayed together so far during the hearings, but they are hopping between strategies for pushing back. One argument against the inquiry is that witnesses, including the whistleblower and charge d’affaires William Taylor last week, are reporting the goings-on second- or third-hand. Look for whether they abandon that argument when Vindman and Williams testify. Republicans now say the president is innocent because the military money was eventually released. In fact, it was released Sept. 11 after Congress began looking into the holdup. ___ Testifying in a second session Tuesday are Kurt Volker, the former special envoy to Ukraine, and Tim Morrison, a former National Security Council aide who oversaw Europe and Russia Policy. ___ Associated Press writer Zeke Miller contributed to this report.",
      "date": "11/19/2019 08:06 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9KRb2Ntpd56YAudRsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610807/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2ftrump-accuses-pence-aide-jennifer-williams-of-presidential-attack_n_5dd1a3c0e4b01f982f0402ad/RK=2/RS=OhAyK2N1WIEkR5srhgjJegzQ45I-",
      "url": "Trump Accuses Pence Aide Jennifer Williams Of 'Presidential Attack'",
      "subtitle": "Williams testified in the impeachment probe that Trump’s July phone call with the Ukrainian president was “unusual and inappropriate.”",
      "author": "Amy Russo",
      "content": " President Donald Trump lashed out on Sunday against Jennifer Williams, a foreign policy aide to Vice President Mike Pence who has become the latest impeachment inquiry witness to be targeted by the president’s wrath. “Tell Jennifer Williams, whoever that is, to read BOTH transcripts of the presidential calls, & see the just released ststement from Ukraine,” Trump tweeted, misspelling “statement.” “Then she should meet with the other Never Trumpers, who I don’t know & mostly never even heard of, & work out a better presidential attack!” Pence’s spokesperson offered no defense of Williams, telling CNN: “Jennifer is a State Department employee.” On Saturday, House lawmakers released a transcript of Williams’ testimony on Trump’s July 25 phone call with Ukrainian President Volodymyr Zelensky, which is at the heart of impeachment proceedings. A rough transcript of the call shows Trump sought Zelensky’s help with a corruption probe of former Vice President Joe Biden and his son Hunter, based on unsubstantiated allegations. Earlier this month, Williams told Intelligence Committee members that the conversation on which she listened in, “struck me as unusual and inappropriate.” She described the discussion as “more political in nature” than Trump’s communications with other foreign leaders, noting that he was concerned with his “personal political agenda.” The call, which occurred while American military aid was being withheld from Ukraine, has raised questions over whether Trump was attempting to broker a quid pro quo while soliciting interference in the 2020 election to handicap his Democratic rival. Trump has already bashed other impeachment witnesses, including former U.S. ambassador to Ukraine Marie Yovanovitch who hadn’t even left Friday’s hearing before he assailed her decadeslong career online. In a tweet, Trump claimed that “everywhere” she “went turned bad.” Yovanovitch, responding in real time, called the rebuke “intimidating.” Speaking to reporters, Intelligence Committee chair Rep. Adam Schiff (D-Calif.) characterized Trump’s remarks as “witness intimidation.”",
      "date": "11/17/2019 04:44 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9KRb2Ntpd56YAt9RsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610807/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fgordon-sondland-trump-impeachment_n_5dcd8319e4b0d43931d0ff32/RK=2/RS=5Spn8dNpAdqE7.4gOsS9h3fLH58-",
      "url": "Trump Donor Gordon Sondland's Testimony Could Be An Impeachment Turning Point",
      "subtitle": "The inexperienced diplomat Trump is relying upon to deny a quid pro quo got his position after donating $1 million to Trump’s inaugural committee.",
      "author": "Ryan J. Reilly",
      "content": " In seeking to deny the existence of a quid pro quo that’s become the center of an impeachment inquiry, President Donald Trump is relying on the testimony of Gordon Sondland, a hotel magnate who secured his position as ambassador after giving $1 million to Trump’s inaugural committee. Sondland is set to publicly testify before the House Intelligence Committee on Wednesday in what has the potential to be the most consequential day of the impeachment saga thus far. Sondland, other officials have testified, was a key figure in the apparent plot to condition the release of U.S. military aid on the Ukrainians announcing an investigation into 2020 political rival Joe Biden and his son Hunter Biden. The first week of hearings in the impeachment inquiry largely featured testimony from cooperative witnesses. As the White House blocked certain primary witnesses from testifying, Republicans complained that the witnesses who did appear lacked firsthand knowledge of the alleged scheme. Sondland does have firsthand knowledge of key facts, and his testimony could be combative. The self-described lifelong Republican already had to correct the record following closed-door testimony on Oct. 17, and several other government officials have offered accounts that contrast with Sondland’s. Sondland, whom Trump named U.S. ambassador to the European Union, took on a major role in Ukrainian policy. He was in communication with Trump’s personal attorney Rudy Giuliani, who was working with two indicted Ukrainian Americans who sought the ouster of former U.S. Ambassador to Ukraine Marie Yovanovitch. Sondland, in his testimony last month, sought to portray himself as disappointed by Giuliani’s involvement in foreign relations. Sondland told lawmakers that Trump was “skeptical that Ukraine was serious about reforms and anti-corruption” and that it was “apparent” that Giuliani was “the key to changing the President’s mind on Ukraine.” He claimed he was “disappointed” by Trump’s instructions to involve Giuliani but that he “did not understand until much later that Mr. Giuliani’s agenda might have also included an effort to prompt the Ukrainians to investigate [former] Vice President Biden or his son, or to involve Ukrainians directly or indirectly in the President’s 2020 reelection campaign.” Sondland, who said he believed he spoke to Trump five or six times since becoming ambassador, claimed he had “no idea” that Trump had brought up the Bidens in the call until the White House released a summary of Trump’s July 25 conversation with Ukrainian President Volodymyr Zelensky. But testimony from other officials raised doubts about Sondland’s story. One key scene took place at a restaurant in Kyiv over the summer, when Sondland called up the president after Trump’s call with Zelensky. “So, he’s going to do the investigation?” Trump asked, according to testimony from State Department official David Holmes, who will testify publicly on Thursday. “He’s going to do it,” Sondland told Trump, according to Holmes. After the Sondland-Trump calls, Holmes said Sondland agreed that Trump didn’t “give a shit about Ukraine” and cared only about the “big stuff.” Holmes said he’d “never seen anything like” what he witnessed: someone calling the president from a cellphone in a restaurant in a foreign country and having such a candid conversation. Holmes said he was surprised that the sensitive conversation took place on a non-secure cellphone call in the middle of a restaurant. “We generally assume that mobile communications in Ukraine are being monitored.” The Wall Street Journal reported that Sondland kept White House officials informed of his activities, and Sondland emailed acting chief of staff Mick Mulvaney and Energy Secretary Rick Perry ahead of a call between Zelensky and Trump and said the Ukrainian president would assure Trump “that he intends to run a fully transparent investigation and will ‘turn over every stone.’” For Democrats, Sondland is a compelling antagonist in the impeachment drama. They can portray him as an unqualified political appointee who had no diplomatic experience before he essentially bought a key position in the Trump administration and acted as Trump’s yes man as he tried to use U.S. military aid for political gain. CORRECTION: This article previously misstated that Sondland’s phone call to the president from the restaurant took place prior to Trump’s call to Zelensky.",
      "date": "11/19/2019 05:45 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9KRb2Ntpd56YAtdRsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610807/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2ftrump-mcconnell-impeachment_n_5dd4728ae4b0fc53f20a672e/RK=2/RS=eN0.yK0Ccq2wIMXdJWD5X3CU8M4-",
      "url": "The Day Impeachment Threatens McConnell’s Senate Job Is The Day Trump Is In Big Trouble",
      "subtitle": "The Senate majority leader is likely to abandon the president if it appears that keeping his role is more assured if Trump is gone.",
      "author": "S.V. Date",
      "content": " WASHINGTON — Is Mitch McConnell’s future as Senate majority leader in 2021 more assured with President Donald Trump at the top of the 2020 Republican ticket? Or with a President Mike Pence? Because while the president’s staff is focused on the ongoing impeachment proceedings in the House regarding his attempts to coerce Ukraine into helping his reelection efforts, Trump’s ultimate fate is more likely to hinge on the calculations of a single lawmaker from the other chamber, Kentucky’s McConnell. And although McConnell would certainly rather keep his control over the Senate and have a Republican in the White House, a number of Republicans predicted that, if Trump’s standing among voters were to fall even further, McConnell would choose his own political future over Trump’s. “I’m sure he’d prefer both. But, if he has to choose, yes, the Senate is his higher priority,” said one former top GOP congressional aide, who spoke on condition of anonymity to candidly assess McConnell. The former aide could not predict how low that approval rating would have to drop. “That’s the $64,000 question.” On Tuesday, as additional witnesses testified about Trump’s efforts to use $391 million in military aid as leverage to force Ukraine to announce politically useful investigations, McConnell told reporters: “It’s inconceivable to me that there will be 67 votes to remove the president from office.” The Constitution requires a two-thirds vote of those present to remove a president who has been impeached by the House. If all 47 Democrats were to vote that way, it would require 20 Republicans to vote with them for Trump to be forced out. “I think most Republicans are going to fall on a spectrum ranging from no big deal to moderately alarmed to believing this was very bad judgment ― but that it doesn’t rise to the level of impeachment,” said Scott Jennings, a GOP consultant in Kentucky and a former McConnell campaign aide. “I think the White House will need to give Republicans the latitude to express those varying opinions as long as they hold the line against votes to convict.” But Trump’s problem is that while he is feared by Republican senators — and likely less so now than he has been, given recent GOP losses in Kentucky and Louisiana governors’ races, despite his campaign visits — he is not particularly respected or liked. Former GOP Sen. Jeff Flake of Arizona said that if the Senate were to hold a secret ballot to convict Trump, “at least 35” Republicans would vote to do so. Which means that Republican senators’ loyalty to Trump likely goes no further than to the extent it benefits them politically — and they could well abandon him if it appears that doing so is more likely to ensure their own reelections. In the case of McConnell, the limits of his loyalty are more likely to be linked to the fates of the half dozen or so of his most vulnerable Republican members in the coming 2020 election. With that current 53-47 majority, if just four Republicans lose reelection, McConnell would no longer be majority leader — a title he has sought for decades. Meaning Trump’s fate will be less tied to his polling in safe, Trump-friendly states than to his approval numbers in places like Colorado, Maine, North Carolina and Arizona, where GOP senators are all facing challenging races. “If Trump is not removed, all those senators lose,” said William Weld, a former Massachusetts governor and a Reagan-era Justice Department official who is now running against Trump for the 2020 GOP nomination. He recalled the aftermath of the 1986 elections, when Republicans lost the Senate. “It’s such a feeling of powerlessness, and it’s one that Mitch has had in the past, and he doesn’t want to have it back,” he said. Former Illinois congressman Joe Walsh, who is also running for the 2020 GOP presidential nomination, said McConnell’s primary goal will be to keep Republican control of the Senate. “Everything else is a distant second to that,” he said. “They will dump Trump in a nanosecond if it helps the GOP retain the Senate. And remember, none of the Senate Republicans like or fear Trump. They fear his voters.” Rick Tyler, a Republican political consultant who worked for Texas Sen. Ted Cruz in the 2016 GOP primaries, said McConnell understands that the party is better off without Trump heading into the 2020 election. “McConnell will shrewdly play Trump’s game until a clear majority of voters in enough states that Republican senators need to hold to keep control turn on Trump,” Tyler said. “At that point, he will dump Trump.” Trump is facing an impeachment inquiry in the House after a whistleblower filed a complaint that the president was withholding congressionally approved military aid to Ukraine unless its leaders announced investigations politically useful to Trump’s 2020 reelection. According to witness testimony as well as the rough transcript of Trump’s July 25 phone call with Ukraine’s president, Trump demanded that Ukraine investigate former Vice President Joe Biden as well as support a conspiracy theory which falsely claims that Russian intelligence agencies did not help Trump win the 2016 election, but rather it was Ukrainian officials who framed Russia by using fake evidence. He made the military aid contingent on Ukraine publicly announcing the probes but then backed down after the White House learned that the whistleblower’s complaint on the matter was about to reach Congress. John Ryder, a former Republican National Committee member from Tennessee, said few people outside of Washington, D.C., are paying much attention to the impeachment hearings. He said Republicans in particular are wary of the new effort because of the long-running investigation into Trump’s relationship with Russia, which did not result in articles of impeachment or a prosecution of the president. “They’re suffering a little bit of ‘boy who cried wolf’ syndrome,” he said, adding that Trump’s approval ratings, after dipping a few points when House Speaker Nancy Pelosi announced the start of the impeachment inquiry, are back to the low 40s. He said that if the percentage of people approving of Trump starts falling to the low 30s, senators who currently back Trump will start to rethink that position. “If you move public opinion, you start to move senators,” he said. Igor Bobic contributed to this report.",
      "date": "11/19/2019 07:09 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9KRb2Ntpd56YAs9RsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610807/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2frick-santorum-insane-argument_n_5dd4cd74e4b010f3f1cf7b9f/RK=2/RS=nwZIRBpS.vFoq7ha9b_xcPfq5gw-",
      "url": "‘Insane!’ CNN Legal Analysts Dismantle Santorum’s Bonkers New Trump Defense",
      "subtitle": "Carrie Cordero and Jeffrey Toobin take on the former Pennsylvania senator.",
      "author": "Ed Mazza",
      "content": " Former Sen. Rick Santorum (R-Pa.) attempted a defense of President Donald Trump that’s been used by Republicans before ― but it didn’t go so well on CNN on Tuesday night. One of his fellow panelists even called it “insane.” Santorum suggested that what Trump says isn’t nearly as important as what his administration does. “This administration does many things, he doesn’t talk about any of them ... he doesn’t talk about policy,” Santorum said. “This argument is insane,” legal analyst Carrie Cordero fired back. “You cannot argue that the president of the United States’ words do not matter, or that he’s just sort of spouting off or he has his own views.” “I didn’t say they don’t matter,” Santorum said. “But actions matter too.” Cordero replied: The president’s words matter and it cannot be that on one hand we’re supposed to take him seriously as the commander in chief and the person who’s running the government and on the other hand his defenders say, “it doesn’t matter what he said, ignore all that other crazy.” But Santorum said up to 90% of what Trump says gets ignored. “Look at his tweets,” he said. “We ignore most of those things he tweets and say there’s Trump being Trump.” CNN legal analyst Jeffrey Toobin took a shot at trying to sum up Santorum’s argument. “So your position is he shouldn’t be impeached because he’s surrounded by people who are less corrupt and crazy than he is?” he asked. Santorum replied that Trump is merely “a little worked up” due to the attacks against him, including impeachment. See more of the discussion below:",
      "date": "11/20/2019 01:53 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9KRb2Ntpd56YAsdRsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610807/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2ffox-news-brian-kilmeade-trump-dont-tweet-during-vindman-hearing_n_5dd3f640e4b082dae81432ec/RK=2/RS=SyaCGCHbm5CyFQjA.bIlUuOpi1g-",
      "url": "Fox News' Brian Kilmeade To Trump: Don't Tweet During Vindman Hearing",
      "subtitle": "The “Fox & Friends” co-host urged the president to stay off Twitter and let his GOP allies “fight it out” with Democrats in the impeachment inquiry.",
      "author": "Amy Russo",
      "content": " Fox News’ Brian Kilmeade had some advice for President Donald Trump ahead of Tuesday’s House impeachment hearing: Stay off Twitter. “I just think overall, the president should just ignore this whole thing,” the “Fox & Friends” co-host said. “Don’t tweet during it, don’t get outraged over it.” Instead, Trump should allow his allies to “fight it out and keep it on the straight and narrow from the Republican perspective,” Kilmeade urged. The Fox News morning program is known to be a favorite of the president, who has routinely live-tweeted what he watches and has offered glowing praise of the show’s ratings. But it’s unclear whether Trump will take Kilmeade’s advice. On Friday, when former U.S. ambassador to Ukraine Marie Yovanovitch testified about a smear campaign led by Trump lawyer Rudy Giuliani that led to her May ouster, Trump assailed her on Twitter. The president ripped Yovanovitch’s long diplomatic career, asserting that “everywhere” she “went turned bad,” and that Ukrainian President Volodymyr Zelensky “spoke unfavorably about her” in their July 25 phone call. Yovanovitch, shown the president’s tweets, told lawmakers the attack was “intimidating,” and Intelligence Committee Chair Adam Schiff (D-Calif.) suggested it was “witness intimidation.” Trump’s call with Zelensky is at the center of the impeachment inquiry. A White House summary shows Trump pressed Zelensky to investigate former Vice President Joe Biden and his son. On Tuesday morning, Lt. Col. Alexander Vindman, the National Security Council’s top Ukraine expert, told lawmakers publicly about Trump’s call, which he monitored. Vindman previously testified that Trump conditioned a White House meeting with Zelensky on the probe into the Bidens, and that there was “no ambiguity” about the demand. Vindman also said “there was no doubt” that Trump was taking aim at Biden, his Democratic rival. “It doesn’t take a rocket scientist to see where the gain would be for the president in investigating the son of a political opponent,” he said. Jennifer Williams, a foreign policy aide to Vice President Mike Pence, testified alongside Vindman. Former U.S. special envoy to Ukraine Kurt Volker and former National Security Council official Timothy Morrison are set to testify in the afternoon.",
      "date": "11/19/2019 11:10 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9KRb2Ntpd56YAr9RsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610807/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fimpeachment-testimony-hale-holmes-trump_n_5dd340efe4b0d6f02fa40d80/RK=2/RS=9nNcPhQm.QKRWlgzdiDT2ro8KD4-",
      "url": "House Releases Impeachment Inquiry Testimony From David Hale, David Holmes",
      "subtitle": "The State Department officials testified earlier this month in closed-door hearings in the investigation into alleged abuses of power by President Trump.",
      "author": "Sarah Ruiz-Grossman",
      "content": " House investigators on Monday released transcripts of closed-door testimony from two State Department officials ― David Holmes, the political counsel at the U.S. Embassy in Ukraine, and David Hale, the State Department’s third-ranking official ― as part of the impeachment inquiry into President Donald Trump’s pressure campaign on Ukraine. Holmes, who testified Friday, told impeachment investigators that he overheard President Donald Trump talking with Gordon Sondland, the U.S. ambassador to the European Union, about “investigations” in Ukraine. Holmes said Trump was talking so loudly that Sondland had to hold the phone from his ear. This conversation came a day after Trump’s July 25 phone call with Ukrainian President Volodymyr Zelensky, in which Trump pressed his counterpart to investigate 2020 presidential rival Joe Biden. A whistleblower’s complaint about that call sparked the announcement of the impeachment inquiry. After Sondland told Trump on the July 26 call that Zelensky “loves your ass,” the U.S. president responded, “So, he’s going to do the investigation?” “He’s going to do it,” Sondland replied. Hale, who spoke to lawmakers earlier this month, testified that State Department records show Secretary of State Mike Pompeo called Rudy Giuliani, Trump’s personal lawyer, twice in late March. These calls came around the time that Giuliani was involved in a political smear campaign against former U.S. Ambassador to Ukraine Marie Yovanovitch. Yovanovitch, who testified Friday, said that she tried to get Pompeo to issue a statement of support for her but learned that he declined to do so, purportedly out of concern that Trump could undermine it in a tweet. Hale also said that Pompeo called Fox News host Sean Hannity, which Hannity has denied. Read David Holmes’s testimony here, and David Hale’s testimony here. Here you can read the transcript of Hale’s testimony: Below you can read the transcript of Holmes’ testimony. In his testimony, Holmes also detailed how Giuliani was promoting a political agenda, including an investigation of former Vice President Biden and his son Hunter and of supposed Ukrainian interference in the 2016 U.S. election (a debunked conspiracy theory that Giuliani nevertheless still pushed). “The themes that Mr. Giuliani was promoting and his associates were promoting.... In my mind, those were... political things that were not related to the implementation of our policy,” Holmes said.",
      "date": "11/18/2019 09:53 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9KRb2Ntpd56YArdRsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610807/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fanderson-cooper-donald-trump-testimony_n_5dd3cbc7e4b0d6f02fa50e20/RK=2/RS=rYtx.y.SEKibl3B3u4AKhtoqKtU-",
      "url": "Anderson Cooper Debunks Donald Trump's Testimony Claim: Must Think We're All Idiots",
      "subtitle": "The CNN host explained how he knows Trump won’t testify in the impeachment inquiry with a tongue twister.",
      "author": "Lee Moran",
      "content": " CNN’s Anderson Cooper on Monday cast mocking doubt on President Donald Trump’s claim that he may testify in the impeachment inquiry. Trump had earlier tweeted: “I know the president is not going to testify,” Cooper responded. “And I know that you know it. And I know that you know that he knows it. But my question is does he know that you know that he knows it? I’m not sure he does. I don’t know that he knows that,” he continued. “If he doesn’t know that you and I know that he knows he isn’t going to ever testify, then he must think we are all idiots.” Check out the segment here:",
      "date": "11/19/2019 06:28 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9KRb2Ntpd56YAq9RsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610807/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fjohn-oliver-trump-census_n_5dd25187e4b0d2e79f8fa4e9/RK=2/RS=9WH64T_z.xkdwBj4IaTK6x6Iy2E-",
      "url": "Want To 'Really Irritate' Donald Trump? John Oliver Has A Plan For You.",
      "subtitle": "The “Last Week Tonight” host wants you to use the census to get back at the president.",
      "author": "Ed Mazza",
      "content": " John Oliver closed out the latest season of “Last Week Tonight” with an extended look at how President Donald Trump has attempted to weaponize next year’s U.S. census by trying to add a question about citizenship. And as Oliver pointed out, that could cause people to avoid the census “out of fear that the information could be used against them or people in their household.” That question was dropped, but Oliver said many in the immigrant community are nevertheless still nervous about the census. He warned that experts expect an undercount, which will be used in redistricting, potentially shifting the balance of power in Congress. So he rallied his viewers to participate for one very specific reason. “It would probably really irritate this guy,” he said, showing a picture of Trump. He added: Think about it: His administration already clearly thinks that certain people don’t count. So what better way to get back at him than to make sure that you do and make the census count you. He even offered a way to make Trump “extra mad.” Check it out below:",
      "date": "11/18/2019 04:23 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9KRb2Ntpd56YAqdRsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610807/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fadam-schiff-gordon-sondland-obstruction_n_5dd566c7e4b0fc53f20c832e/RK=2/RS=QoIX.ICRKFvVeAquqAdch7UC2pg-",
      "url": "Schiff: Sondland Testimony Shows Trump's Ukraine Push A 'Basic Quid Pro Quo'",
      "subtitle": "Gordon Sondland said the White House withheld documents for his testimony, which Intelligence Chair Adam Schiff called “unprecedented obstruction.”",
      "author": "Ryan Grenoble",
      "content": " U.S. Ambassador to the European Union Gordon Sondland said Wednesday the White House and the State Department refused to provide documents he’d requested for his testimony in the House impeachment inquiry, a refusal Intelligence Committee Chair Adam Schiff (D-Calif.) characterized as “unprecedented obstruction.” In his opening statement, Sondland said he’d been barred access to his phone records, State Department emails, “and other State Department documents” that would have helped him reconstruct “with whom I spoke and met, when, and what was said.” “My lawyers and I have made multiple requests to the State Department and the White House for these materials,” Sondland said. “Yet, these materials were not provided to me. They have also refused to share these materials with this committee. These documents are not classified and, in fairness, should have been made available.” Schiff emphasized the point to reporters during a recess: “We now can see ... just why Secretary Pompeo and President Donald Trump do not want any of these documents provided to Congress,” Schiff said, referring to Secretary of State Mike Pompeo. “Because apparently they show ― as Ambassador Sondland has testified ― that the knowledge of this scheme ... was conditioned on political favors the president wanted for his reelection.” Schiff also cast Sondland’s testimony as “the most significant evidence to date” of “a basic quid pro quo.” Trump, according to Sondland, was pressing Ukraine to announce an investigation of Joe Biden and his son at a time when the U.S. was withholding military aid to the country. “It was the conditioning of official acts for something of great value,” said Schiff, “right to the heart of the issue of bribery.” The White House attempted to counter via tweet, portraying Schiff’s press conference as a “hoax” and a bid for attention. Notably, the White House statement didn’t address the actual substance of anything Schiff or Sondland said.",
      "date": "11/20/2019 12:24 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9CW30NtpdO4EA2uBsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610805/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2frepublicans-never-impeach_n_5dd464b4e4b0fc53f20a45b8/RK=2/RS=A6dRy3dDsh33WXQaQAICa5ojaaY-",
      "url": "Republicans Will Never Be Convinced Trump Did Something Wrong",
      "subtitle": "You’ve heard of “Never Trumpers.” Meet “Never Impeachers.”",
      "author": "",
      "content": "WASHINGTON ― As Democrats continue to lay out their case for impeaching President Donald Trump, one thing is becoming increasingly clear: There is nothing Republican lawmakers could hear that would change their minds. “It’s all bullshit,” Rep. Peter King (R-N.Y.) told HuffPost on Tuesday. King said he hasn’t seen anything in the House Intelligence Committee’s hearings that has made him uncomfortable. “There’s nothing there,” he said. “There’s absolutely nothing there.” Asked if there were any evidence that would make him uncomfortable, King said he wouldn’t get into hypotheticals. “The whole thing is a fraud, just like the Russia thing,” he said. Republicans complained on Tuesday that Democrats were using all the wrong words. They argued that Trump was asking for a favor ― a legitimate one, in their minds ― not “demanding” that Ukrainian President Volodymyr Zelensky open an investigation into Democratic presidential candidate Joe Biden and his son, Hunter. They argued that administration officials have merely been interpreting Trump’s motivations while the president himself (shockingly) has not admitted to seeking a quid pro quo. They even suggested that a key impeachment witness might be wearing the wrong clothes. During Tuesday morning’s hearing, Rep. Chris Stewart (R-Utah) noted that Alexander Vindman was wearing his military uniform, even though he generally wears a suit to the White House. Vindman had corrected Rep. Devin Nunes (R-Calif.) for referring to him as “Mister” instead of by his rank ― “Lieutenant Colonel” ― so Stewart asked if he always insisted that civilians call him by his rank. Vindman said people in the press and on Twitter had “marginalized” him as a military officer. After the hearing, Stewart said he did not mean to imply that Vindman should not have worn his military uniform. “I was saying it’s a great reminder of his service,” Stewart said. “I don’t know how you could interpret it any other way.” Republicans appear convinced that Trump did nothing wrong, and no matter what comes out in the Intelligence Committee, no matter who testifies, it seems the overwhelming majority of Republicans in Congress are never going to accept that the president acted improperly. “It’s perfectly within the purview of the president’s authority,” Rep. Scott Perry (R-Pa.) told HuffPost. Perry said it was “totally appropriate” for Trump to safeguard American taxpayers by withholding military security aid for Ukraine, and he dismissed those testifying that there was a connection between the withholding of the aid and the possibility of Zelensky announcing an investigation because “they’re not the president.” Asked if there was anything Congress could find out that would make him uncomfortable, Perry said if Zelensky were trying to bribe Trump or Trump were trying to bribe Zelensky, then he’d be uncomfortable. “But I haven’t seen any of that,” Perry said. Republicans are increasingly clinging to the talking point that all these White House aides and State Department officials were operating with a false understanding of the president’s intentions. To the GOP lawmakers, because there’s no evidence that Trump ever directly said there was a connection between the security aid and an investigation into the Bidens, there could not have been a connection. “If you read the actual transcript of the call, to me there’s nothing impeachable there,” Rep. Debbie Lesko (R-Ariz.) told HuffPost. In the rough transcript of their July 25 call released by the White House, Trump asked Zelensky to “do us a favor” and investigate possible Ukrainian involvement in the 2016 U.S. presidential election. He also raised the topic of investigating Joe and Hunter Biden. But Lesko said that because Trump did not mention either Biden immediately after the word “favor,” he wasn’t asking for an investigation into the Bidens. “Biden was not in that same paragraph,” Lesko said. Multiple U.S. officials who worked on supplying nearly $400 million in aid to Ukraine have testified that it was their understanding the aid would not be released until Zelensky announced such an investigation. Democrats say the aid was only released without that promise because the whistleblower came forward and shined a light on the president’s scheme. But Republicans have jumped to the opposite conclusion: that the aid was released because Trump’s intentions were pure. And no amount of testimony to the contrary looks likely to change their minds. “Democrats are striking out here,” Rep. Kevin Brady (R-Texas) said. “Not a single witness has stated that any crime has been committed. Certainly no impeachable crimes.” Brady also mocked Democrats for shifting from alleging a quid pro quo to alleging bribery. “Maybe it’s bribery with puppies and sprinkles on top,” he said. Rep. Mark Meadows (R-N.C.) insisted that because the witnesses didn’t directly hear from the president that the push for a Biden investigation was politically motivated or that it was tied to the aid, that means it wasn’t. He said the case for impeachment was built on “an interpretation of a phone call by somebody that never met the president, never talked to the president.” Testimony from Gordon Sondland, a major Trump campaign donor whom the president named U.S. ambassador to the European Union, might be more enlightening, the congressman said. “Let’s talk about people that have real knowledge of why the aid was withheld, and we’ll get some of that tomorrow,” Meadows said on Tuesday. “Ambassador Sondland will certainly be able to speak to that more directly than any witness today.” Sondland has already amended his testimony once to note that he now remembers having a conversation with a Ukrainian official in which he made it clear that a White House meeting with Zelensky and the security aid were contingent on Ukraine opening an inquiry into Burisma, the Ukrainian gas company on whose board Hunter Biden sat. Acting U.S. Ambassador to Ukraine William Taylor testified last week that one of his aides overheard a conversation between Trump and Sondland in which the president asked about “the investigations.” If that is true, Sondland’s already shaky testimony will look even more unreliable. Sondland initially testified behind closed doors that he did not believe there was a quid pro quo, and Republicans are counting on him to reiterate that belief on Wednesday, even though his amended testimony now makes it clear he did believe there was a quid pro quo. Still, even if Sondland ends up supporting the conclusions that Democrats are drawing, Republicans are unlikely to be convinced. “What I would say is, there are conversations and things that have been held that may not always follow best practices,” Rep. Mark Walker (R-N.C.) told HuffPost on Tuesday. “But to jump to the point where it’s treasonous or high crimes, I think that leap is so far that, in the end, most Americans will say, ‘Democrats, you’ve lost your credibility here.’” There are, of course, some Republicans who have sounded less resolute about supporting Trump. The shakiest of them all is Rep. Francis Rooney (R-Fla.), who told reporters Tuesday that the officials who are testifying deserve respect. Rooney said lawmakers were caught off guard last week when the president tweeted during testimony by former U.S. Ambassador to Ukraine Marie Yovanovitch that everywhere she went “turned bad” ― a possible example of witness intimidation by the president. “That was a pretty strong tweet from the president of the United States,” Rooney said. And Rep. Brian Fitzpatrick (R-Pa.), whose district is only mildly Republican, said he wished the FBI was doing the investigation instead of congressional Democrats. He declined to defend Trump but denigrated the impeachment inquiry. “I want to find the facts, that’s what I want,” Fitzpatrick said. “And this process is not planned to do that when you have partisan politicians doing this investigation.” But, notably, Rooney and Fitzpatrick both voted against even opening the impeachment inquiry ― along with every other Republican in the House. Former Republican ― now independent ― Rep. Justin Amash of Michigan said his old GOP colleagues were “caught up in a lot of word games.” “The Republicans will use whatever excuse they need to against whichever particular set of witnesses,” Amash said.",
      "date": "11/19/2019 06:31 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9CW30NtpdO4EA2OBsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610805/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2ftrump-zuckerberg-thiel-secret-dinner_n_5dd61edee4b0fc53f20dd252/RK=2/RS=PSRoxNKHKPviVq0TFDFZaDi.izs-",
      "url": "Trump Reportedly Hosted Secret Dinner With Facebook's Mark Zuckerberg And Peter Thiel",
      "subtitle": "Facebook confirmed to NBC News that the October meeting had taken place. The company would not say, however, what was discussed during the dinner.",
      "author": "Dominique Mosbergen",
      "content": " In September, President Donald Trump held a surprise meeting with Facebook CEO Mark Zuckerberg at the White House. At the time, Zuckerberg said he’d had a “good” and “constructive” conversation with the president. The topics, however, were never revealed. Now it’s been disclosed that the two met again a few weeks later for another unannounced dinner, NBC News reported Wednesday. Facebook confirmed to the network that the pair, along with Facebook board member and Trump donor Peter Thiel, had dined at the White House in October. The company would not say, however, what they discussed nor why both Facebook and the White House had not disclosed that the dinner had taken place. Facebook characterized the October meeting as perfectly “normal.” A company spokesperson told NBC News that Zuckerberg had “accepted an invitation to have dinner with the President and First Lady at the White House” ― “as is normal for a CEO of a major U.S. company.” According to the network, Zuckerberg’s dinner date with Trump took place around the same time as the Facebook chief’s testimony before the House Financial Services Committee about the tech giant’s new cryptocurrency, Libra. During the hearing, Zuckerberg was grilled by lawmakers on a broad range of topics, including Libra’s potential pitfalls, Facebook’s stance on political ads and the company’s trust problem. “We certainly have work to do to build trust,” Zuckerberg conceded when asked about Facebook’s past failures to safeguard user data and privacy. Zuckerberg was also quizzed about his September meeting with Trump ― though he was not forthcoming with details. He said only that the antitrust investigations into Facebook and the company’s refusal to fact-check political ads had not come up during the meeting. “Those subjects didn’t come up, but in general I don’t feel like it’s appropriate for me to comment in too much detail on private conversations,” Zuckerberg said.",
      "date": "11/21/2019 01:57 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9CW30NtpdO4EA1uBsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610805/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fkurt-volker-testimony-trump-impeachment-ukraine_n_5dd448fce4b08a4325e3f569/RK=2/RS=VsSAdqFfc38.tom2Jx9CpJKN8_I-",
      "url": "Kurt Volker Says He Was Clueless That Trump’s Desire For Burisma Probe Was About Joe Biden",
      "subtitle": "The former special envoy to Ukraine is one of many establishment Republicans who tried in vain to change the Trump administration from within.",
      "author": "",
      "content": "WASHINGTON ― Kurt Volker, President Donald Trump’s former special envoy to Ukraine, testified that he was oblivious to the connection between President Donald Trump’s desire for an investigation into the Ukrainian gas company Burisma and targeting former Vice President Joe Biden. Volker was trying to “thread the needle” between a Burisma investigation (which Trump desperately wanted and Volker believed could help convince him to continue supporting Ukraine) and a Biden investigation (which he says he knew would be “unacceptable”). “I now understand most of the other people didn’t see or consider this distinction,” Volker said of investigating Burisma and investigating the Bidens. “For them it was synonymous.” It’s common for Trump administration officials to believe that they can advance broad policy goals without becoming complicit in anything improper. An anonymous administration official has insisted to the public that they are working diligently to “preserve our democratic institutions while thwarting Mr. Trump’s more misguided impulses.” Respected national security officials like John Kelly, H.R. McMaster, and Jim Mattis all thought they could serve as the adults in the room. They all resigned after realizing the futility of that goal. Before Trump was elected president, Volker and friends joked that none of them would want to work in the Trump administration — but they each wanted the other to do it and serve as the voice of reason. Volker felt committed to Ukraine’s future and the fight against Russia, he said Tuesday. He hoped that he could get a skeptical Trump to support that effort by convincing the Ukrainians to give the president what he wanted. But Volker soon learned that the only way to get Trump on board was with what amounted to a demand that a country deeply dependent on U.S. military aid help advance the president’s personal political ambitions. Volker claimed that he thought there was a distinction between “Burisma” and “Biden,” and that he saw investigating them as “different ― the former being appropriate and unremarkable, the latter being unacceptable.” When U.S. Ambassador to the European Union Gordon Sondland brought up the investigations during a meeting with Ukrainian officials, it was an “eye-roll moment,” Volker said Tuesday. “In retrospect, I should have seen that connection differently, and had I done so, I would have raised my own objections,” Volker told the House Intelligence Committee in an open hearing on Tuesday afternoon. Volker later admitted that he “ knew that [Hunter Biden] had been a board member,” but said that he believed that investigating Burisma and investigating former Vice President Biden were “very different things.” Volker is the first of the “three amigos” at the center of the Trump-Ukraine scandal to testify in the impeachment inquiry ― Sondland will appear before the committee tomorrow, while Energy Secretary Rick Perry isn’t scheduled to testify. Volker texted a Ukranian official that they would set up a White House meeting after “President Z convinces trump he will investigate/‘get to the bottom of what happened’ in 2016.” Tim Morrison, a White House National Security Council official who testified alongside Volker, told lawmakers that he was hoping that Trump would have given Ukrainian President Volodymyr Zelensky more support in their phone call in July. Volker said that he didn’t think that the United States foreign policy should be focused on pursuing “conspiracy theories” he believed the Ukranians were floating. “I don’t think that raising 2016 elections or Vice President Biden or these things I consider to be conspiracy theories that have been circulated by the Ukrainians ― particularly the former prosecutor general ― they’re not things that we should be pursuing as part of our national security strategy with Ukraine,” Volker said. This article has been updated with Volker’s comment about Ambassador Gordon Sondland.",
      "date": "11/19/2019 05:53 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9CW30NtpdO4EA1OBsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610805/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fkurt-volker-impeachment-hearing-rejects-trump-conspiracy-theories_n_5dd4bb90e4b0e29d727bbb8d/RK=2/RS=AU2u62svWRdtAfUQUo9_ywjX0Kc-",
      "url": "GOP-Requested Witness Rejects Trump ‘Conspiracy Theories’",
      "subtitle": "Kurt Volker said he has known former Vice President Joe Biden as an honorable man for decades while rebuffing debunked corruption allegations.",
      "author": "",
      "content": "WASHINGTON (AP) — Sought by Republicans to testify, the former U.S. special envoy to Ukraine spoke up instead for Democrat Joe Biden in Tuesday’s impeachment hearings, rejecting “conspiracy theories” embraced by President Donald Trump and some of his allies. Kurt Volker said he has known Biden as an honorable man for more than two decades, rebuffing debunked corruption allegations that Trump is said to have wanted the Ukrainians to investigate in exchange for military aid to hold off Russian aggression. “The allegations against Vice President Biden are self-serving and non-credible,” Volker declared. Broader corruption in Ukraine was “plausible,” but corruption by Biden wasn’t, he said. Volker testified alongside former White House national security official Tim Morrison in the second hearing of the day in the House’s impeachment inquiry, only the fourth in history against a U.S. president. Morrison, also requested by GOP members on the House Intelligence Committee, said at the outset that he was not there to question the “character or integrity” of any of his colleagues, though earlier Tuesday Republican lawmakers used his prior comments to try to discredit another witness, Lt. Col. Alexander Vindman. The White House even circulated a tweet that was an earlier quote by Morrison questioning Vindman’s judgment. Democrats say there may be grounds for impeachment in Trump’s push for Ukraine’s new leadership to investigate his Democratic rival and the 2016 U.S. election as he withheld military assistance approved by Congress. Trump says he did nothing wrong and dismissed the hearings as a “kangaroo court.” Volker was the first person to come behind closed doors in the inquiry that started in September, resigning his position shortly before he did so. Since then, a parade of witnesses has testified publicly and privately about what they recalled about the July 25 phone call between Trump and Ukraine’s new leader, Volodymyr Zelenskiy. Many of those statements cast doubt on Volker’s account that he didn’t know the Ukraine gas company Burisma was tied to Biden, and that he wasn’t aware of a possible quid pro quo offered by Trump. A number of White House and State Department officials were listening to the call, but Volker was not. On Tuesday, he said he opposed any hold on security assistance. And he said, “I did not understand that others believed that any investigation of the Ukrainian company, Burisma, which had a history of accusations of corruption, was tantamount to investigating Vice President Biden. I drew a distinction between the two.” Even though, he said, he understood that Biden’s son Hunter had been a board member ― and he himself had been deeply involved with Ukrainian officials on a statement, never released, that would have committed the country to investigating Burisma and the 2016 U.S. election. Volker himself requested a meeting on July 19 with Rudy Giuliani, Trump’s personal lawyer, at which Giuliani mentioned accusations about the Bidens as well as the discredited theory that Ukraine interfered in the 2016 U.S. election. He said he believes now, thanks to hindsight and the testimony of other witnesses, that Trump was using the aid to pressure Ukraine to investigate Hunter Biden and his role on the company’s board. “In retrospect I should have seen that connection differently, and had I done so, I would have raised my own objections,” Volker testified. Yet he also acknowledged that Trump never told him he was withholding aid for Ukraine unless there were investigations. He also said Ukrainians never told him that they wouldn’t get a White House visit or military aid without committing to investigations. He said he would have objected had the president asked him to get Ukraine to do investigations. Morrison, who stepped down from Trump’s National Security Council shortly before he appeared behind closed doors last month, said he was not concerned that anything illegal was discussed on Trump’s July 25 call with Ukraine’s leader, testimony that Republicans have repeatedly highlighted. “As I stated during my deposition, I feared at the time of the call on July 25th how its disclosure would play in Washington’s political climate,” he said Tuesday. “My fears have been realized.” He told lawmakers Tuesday that the transcript of the call was incorrectly placed in a highly secure location. Democrats have seen ill intent in that action, but he said, “It was a mistake ... an administrative error.” Morrison has confirmed to investigators that he witnessed a key September conversation in Warsaw between Gordon Sondland, the U.S. ambassador to the European Union, and a Ukrainian official. Sondland told the official that U.S. aid might be freed if the country’s top prosecutor “would go to the mike and announce that he was opening the Burisma investigation,” Morrison said in previous closed-door testimony. Volker shifted his account of a pivotal July 10 interaction at the White House. In his closed-door interview last month, he said there was no discussion of Giuliani’s activities in Ukraine or investigations sought by the president. But on Tuesday, he said the meeting was essentially over when Sondland made a “general” comment about investigations. “I think all of us thought it was inappropriate; the conversation did not continue and the meeting concluded,” Volker said. A series of text messages Volker provided to lawmakers showed conversations between him, Sondland and another envoy in which they discussed a need for Ukraine to launch investigations, including into Burisma. Volker said meeting with Giuliani was just part of the dialogue, and he had one in-person meeting with him, in which Giuliani “raised, and I rejected, the conspiracy theory that Vice President Biden would have been influenced in his duties as vice president by money paid to his son.” Volker also said a senior aide to Zelenskiy approached him last summer to ask to be connected to Giuliani. He said he made clear to the Zelenskiy aide, Andriy Yermak, that Giuliani was a private citizen and not a representative of the U.S. government. He testified he wasn’t part of an irregular foreign policy channel led Giuliani, as others have testified. He also rejected the idea that Trump dubbed him, Sondland and Energy Secretary Rick Perry the “three amigos” in charge of Ukraine policy. “My role was not some irregular channel, but the official channel,” Volker said. ___ Associated Press Writers Mary Clare Jalonick, Matthew Daly, Alan Fram, Lisa Mascaro and Laurie Kellman contributed to this report.",
      "date": "11/19/2019 11:11 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9CW30NtpdO4EA0uBsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610805/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fcnn-fact-checker-donald-trump-impeachment-ukraine_n_5dd399e9e4b082dae8134eed/RK=2/RS=rVnYy.06pJMy7cmcAY9FYol2gh4-",
      "url": "CNN Fact-Checker Nails ‘Unique’ Aspect Of Donald Trump’s Latest Lies",
      "subtitle": "Daniel Dale broke down why Trump’s latest untruths are unprecedented to “CNN Tonight” host Don Lemon.",
      "author": "Lee Moran",
      "content": " CNN’s fact-checking reporter Daniel Dale on Monday noted the “unique” aspect of Donald Trump’s dishonest claims about the Ukraine scandal and the impeachment inquiry into the president. Dale told “CNN Tonight” host Don Lemon ― as a list of 45 untruths that Trump has told about the scandal and the inquiry scrolled down the screen ― they were unprecedented “because of how comprehensively Trump is lying here.” “If you fact-check Trump, or just watch Trump, you know that he lies about basically every subject,” said Dale. “What’s unique about the Ukraine story is that he’s lying about basically every individual component of the story,” he continued. “So he’s not sprinkling in lies here and there, and mixing them up with platitudes and the stuff that’s true.” “Everything he’s saying about his dealings with Ukraine, about the Bidens’ dealings with Ukraine,  about the whistleblower, about Schiff, about the impeachment process. It’s all wrong, all the time,” Dale concluded. Check out the clip here:",
      "date": "11/19/2019 02:59 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9CW30NtpdO4EA0OBsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610805/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fcongresswoman-says-trump-has-5-pinocchios-on-a-daily-basis_n_5dd595f1e4b0fc53f20d24c5/RK=2/RS=TSF35MPu02s2mEZXZdibuTQKucg-",
      "url": "Congresswoman Says Trump Has '5 Pinocchios On A Daily Basis'",
      "subtitle": "California Rep. Jackie Speier made the comment during U.S. Ambassador to the European Union Gordon Sondland’s testimony.",
      "author": "Sanjana Karanth",
      "content": " Rep. Jackie Speier (D-Calif.) got a round of applause during an impeachment hearing Wednesday when she said that President Donald Trump gets “five Pinocchios” a day. The comment came during her questioning of Gordon Sondland, the U.S. ambassador to the European Union whose testimony incriminated many in Trump’s orbit who have been associated with the president’s attempted quid pro quo with Ukraine. Before Speier’s turn, Rep. Mike Conaway (R-Texas) used his five minutes to discuss a Washington Post column that fact-checked a claim made by Rep. Adam Schiff (D-Calif.), the committee’s chairman, that the whistleblower who set off the impeachment inquiry has a “statutory right” to anonymity. As an indication of Schiff’s correctness, the writer of the column gave the comments “three Pinocchios.” When Speier brought up the whistleblower rules during her questioning, Conaway tried to interject by again bringing up the Post’s “three Pinocchios.” “Well, the president of the United States has five Pinocchios on a daily basis, so let’s not go there,” Speier responded, receiving applause from those in the hearing room. Schiff has repeatedly said that the whistleblower has a “statutory right” to anonymity, often urging witnesses to be cautious when Republicans have asked questions that could reveal that person’s identity. According to the Post’s fact check, anonymity is not an explicit statutory right for whistleblowers, though national security experts warn that revealing the person’s identity would risk his or her safety. Neither the Intelligence Community Whistleblower Protection Act of 1998 nor any similar statues have language guaranteeing anonymity. Those laws, according to the Post, instead provide protections from work-related retaliation: Whistleblowers in the intelligence community are not allowed to be demoted, fired or reassigned for legally reporting concerns; their pay can’t be cut; they can’t be sent in for psychiatric evaluations; and their security clearance can’t be manipulated. The ICWPA implies anonymity “as a shield from other forms of workplace retaliation,” Irvin McCullough, a national security analyst at the nonprofit Government Accountability Project, told the Post. Sondland was the first of three people to publicly testify Wednesday in the impeachment investigation into Trump. The EU ambassador started off his testimony by saying that “everyone” knew the president’s “desires and requirements” on Ukraine, and that there was a quid pro quo. He also said that many officials in the Trump administration did not want to work with the president’s personal attorney Rudy Giuliani but did so “at the express direction of the president.”",
      "date": "11/20/2019 03:39 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9CW30NtpdO4EAzuBsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610805/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fdonald-trump-jr-vindman-tweet_n_5dd42a77e4b08a4325e3ac3c/RK=2/RS=vqrSsluMe_w4zCD6MzXpvMpKgrA-",
      "url": "Twitter Users Trash Donald Trump Jr. For Questioning Vindman's Heroism",
      "subtitle": "Critics pointed out that Lt. Col. Alexander Vindman is a decorated combat veteran, while Trump recently fled a book signing “because people were being mean.”",
      "author": "David Moye",
      "content": " Donald Trump Jr. on Tuesday attempted to attack the character of National Security Council official Lt. Col. Alexander Vindman, the Ukraine expert who testified to House impeachment committee members. Instead, the president’s eldest son once again proved why he is the absolute master at the self-own. It all started when Trump retweeted an article from the Federalist titled “Let’s Stop Pretending Every Impeachment Witness Is A Selfless Hero,” which seemed to question the character of impeachment witnesses like Vindman, a decorated combat veteran, and the former U.S. ambassador to Ukraine Marie Yovanovitch, a lifelong diplomat who told lawmakers last week how the president ordered her ousted amid a smear campaign led by his lawyer, Rudy Giuliani. Trump Jr. retweeted the article without commenting on it, but many Twitter users took time out of their day to let him know why he is exactly the wrong person to go after Vindman. Some people didn’t pull any punches. Others were confused about the message Trump Jr. and other Republican supporters of the president were trying to send.",
      "date": "11/19/2019 02:36 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9CW30NtpdO4EAzOBsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610805/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2ftuesday-impeachment-hearing-trump-ukraine_n_5dd4105ce4b03b9697181a69/RK=2/RS=HtOLGiuZACic9kOnZieJyGTLeB4-",
      "url": "Tuesday's First Impeachment Hearing Builds The Case For A Quid Pro Quo",
      "subtitle": "Lt. Col Alexander Vindman and State Department official Jennifer Williams testified about their concerns with President Trump’s call with Ukrainian President Zelensky.",
      "author": "Ryan J. Reilly",
      "content": " WASHINGTON ― Officials who heard President Donald Trump’s interactions with Ukraine over the spring and summer understood that Ukrainian President Volodymyr Zelensky would have to investigate Trump’s political opponents if he hoped to get the White House visit and military aid his country desperately needed, two key witnesses made clear to Congress on Tuesday. The testimony added more evidence that Trump’s request amounted to a quid pro quo. Lt. Col. Alexander Vindman, a decorated Iraq war veteran who was working in the White House as the National Security Council’s Ukraine expert, testified that he saw Trump’s push for investigations into former Vice President Joe Biden and his son Hunter as an “order” to Zelensky and felt compelled to report it up the chain of command. Vindman is registered to vote with no party affiliation. Asked if he was a “Never Trumper,” he called himself a “never partisan.” State Department official Jennifer Williams said she found Trump’s now-infamous July 25 phone call to Zelensky “unusual” because it involved discussion of a domestic political matter. Williams, who Trump attacked in a tweet as a “Never Trumper,” serves as an adviser on Russia to Vice President Mike Pence and campaigned for ex-President George W. Bush in 2004. She testified that “the reference to Biden” on Trump’s call with Zelensky “sounded political.” Republicans on the committee spent most of the hearing attacking the media as Democratic “puppets” and trying to gently undermine a Purple Heart recipient and a Bush campaign official. Republicans pressed Vindman about being offered the position of defense secretary of Ukraine, which Vindman reported to his superiors when he returned home. Vindman said the offer wasn’t something he seriously considered, and considered it laughable because he’s an American and a member of the U.S. military. Rep. Jim Himes (D-Conn.) said the line of questioning was a question about his loyalty “cloaked in a Brooks Brothers suit.” Vindman testified that he felt it was “improper for the president to request, to demand, an investigation into a political opponent” and felt he “had to report this to the White House counsel.” He said it would undermine foreign policy and national security. Vindman testified that Trump didn’t mention corruption in either phone call that he had with Zelensky before the July phone call, despite the fact that rooting out corruption in Ukraine was part of U.S. policy and was mentioned in Trump’s talking points. Tuesday’s morning session kicked off a busy week in the impeachment process. Ambassador Kurt Volker and Tim Morrison will testify Tuesday afternoon. Trump donor and Ambassador Gordon Sondland, Defense Department official Laura Cooper and U.S. diplomat David Hale will testify Wednesday, and presidential adviser Fiona Hill and State Department official David Holmes will testify on Thursday. Sondland’s highly anticipated testimony could be the most important day of testimony. But Volker is also expected to face tough questions from Democrats, as his testimony has been inconsistent with that of other witnesses. Volker claimed he wasn’t aware of being part of an effort to urge Ukraine to investigate Biden, but several other officials testified that Volker was closely involved in the efforts.",
      "date": "11/19/2019 03:34 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9CW30NtpdO4EAyuBsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610805/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fwomen-immigrants-trump-impeachment-hearings_n_5dd6b4dfe4b0e29d72807059/RK=2/RS=RZR81CEef8tv0Vc.ruRaXMYaIIw-",
      "url": "Women And Immigrants, Demeaned By Trump, Take Center Stage At Impeachment",
      "subtitle": "If the president is averse to strong women challenging him, he had a very bad week.",
      "author": "Alanna Vagianos",
      "content": " When former White House adviser Fiona Hill, who served as the National Security Council’s top official on Russian affairs, testified before the House Intelligence Committee on Thursday, she described a sharp interaction with Gordon Sondland. Hill said it began when she had a tense disagreement with the U.S. ambassador to the European Union. “I actually said to [Sondland], ‘Who put you in charge of Ukraine?’” Hill said of the encounter. “I mean I’ll admit I was a bit rude, but that’s when he told me the president, which shut me up.” Hill said that she was angry with the ambassador — and that Sondland dismissed her concerns because she is a woman. “Often, when women show anger, it’s not fully appreciated,” she continued. “It’s often pushed onto emotional issues perhaps or deflected onto other people.” Throughout his presidency, Donald Trump has routinely demeaned, degraded and attacked women and immigrants. Over the past five days of impeachment hearings, some of the most incriminating testimony has come from those very people. Key witnesses who have testified in the public impeachment hearings, which began last week, include women like Marie Yovanovitch, the former U.S. ambassador to Ukraine, Laura Cooper, a deputy assistant secretary at the Defense Department, and Jennifer Williams, a top aide to Vice President Mike Pence, in addition to immigrants like Army Lt. Col. Alexander Vindman, the NSC’s Ukraine expert. (Hill has the distinction of being both an immigrant and a woman.) Day after day, these witnesses laid out a damning case against Trump. Yovanovitch, who served as a foreign service officer for 33 years before Trump recalled her from her post in Ukraine in May, spoke calmly and clearly throughout hours of testimony last week. The cool-headed former ambassador even responded to smears from the president in real time during the hearing. Her testimony was so well-received that she earned a standing ovation from the public at the hearing (and, later, at a jazz club in Washington, D.C.). The former ambassador laid out how the Trump administration peddled a campaign of lies about her, launched jointly by a Ukrainian official, Trump’s personal attorney and a host of right-wing pundits. During his infamous July call with Ukrainian President Volodymyr Zelensky, Trump called Yovanovitch “bad news” and said she was “going to go through some things.” She testified last week that Trump’s statement “sounded like a threat.” Yovanovitch said that Trump opened the door for corruption by being complicit in “a campaign of disinformation against a sitting ambassador, using unofficial back channels.” Her experience, she argued, sets a dangerous precedent worldwide. “When other countries, other actors... see that private interests, foreign interests can come together and get a U.S. ambassador removed, what’s going to stop them from doing that in the future in other countries?” she said. Cooper, the Defense Department official, clarified a key timeline question about the withholding of military aid during her Tuesday testimony. She said that Ukraine was aware that the aid was stalled before Trump’s July 25 call with Zelensky. If true, this would make it extremely hard to argue that Trump’s push for politically beneficial investigations that day wasn’t a quid pro quo. Vindman, who was born in Ukraine and immigrated to the U.S. as a toddler, testified as a real-time witness to that now-infamous call. He said there was an obvious “power disparity” between Zelensky and Trump on the call because of Ukraine’s reliance on the U.S. for military and other aid. “When a senior asks you to do something, even when it’s polite and pleasant, it’s not to be taken as a request ― it’s to be taken as an order,” he told the House Intelligence Committee earlier this week. Vindman, whose family fled the Soviet Union, is not the typical immigrant targeted by the Trump administration. Those attacks are normally reserved for Black and brown people. But his status as an immigrant was still weaponized against him. Republican lawmakers and conservative cable news hosts questioned Vindman’s loyalty to the U.S. because he was born in Ukraine. The 44-year-old Army officer responded to these attacks in one of the more emotional moments of the impeachment hearings. He addressed his immigrant father in his opening statement. “I also recognize that my simple act of appearing here today ... would not be tolerated in many places around the world,” Vindman said. “Dad, my sitting here today in the U.S. Capitol talking to our elected officials is proof that you made the right decision 40 years ago to leave the Soviet Union and come here to the United States of America in search of a better life for our family. Do not worry, I will be fine for telling the truth.” Hill, an immigrant from the U.K., said the accusations of dual loyalty lobbed at Vindman were “deeply unfair.” “This is the essence of America,” she said during her Thursday testimony. “It’s why I wanted to be here and why I wanted to stay here, and I think it’s unfair to castigate anyone.” “I do not believe that my loyalty is to the United Kingdom. My loyalty is here, to the United States. This is my country and the country that I serve,” Hill continued. “And I know for a fact that every single one of my colleagues ― and there were many naturalized citizens in my office and across the National Security Council ― felt exactly the same way.” During Hill’s testimony, Rep. Terri Sewell (D-Ala.) said that she was “especially disheartened” by Trump’s treatment of women throughout this process, specifically his ongoing attacks on Yovanovitch. “She was an easy target as a woman,” Sewell said. “The fact of the matter is that there’s a long line of strong, talented women who have been smeared and victimized by this president,” the congresswoman continued. “We can either choose to ignore it or do something about it.” After the hearing, Rep. André Carson (D-Ind.) said, “I think for a certain pocket of society who are perpetuating harmful mythologies about immigrants and women, and who are trying to take our country back to some mythological good old days ― I think it’s important to have representation from women and those who have immigrant backgrounds to dismantle this notion of what it means to be an American.” It’s possible that the dual-loyalty smears against Vindman are a sneak peek of what’s to come as the pressure increases on the president. Given Trump’s history, stoking fears around citizenship and gender for political gain would be nothing new. Igor Bobic contributed reporting.",
      "date": "11/22/2019 05:45 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9CWjyNtpdHnoA.mtsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610803/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2faclu-sues-trump-detaining-photojournalists_n_5dd5e2d8e4b0fc53f20d9a61/RK=2/RS=7ceHnWT4X7THQvPEPtUvYFB6pPw-",
      "url": "ACLU Sues Trump Administration For Detaining Journalists At Border",
      "subtitle": "The photographers documenting conditions at the U.S.-Mexico border were unlawfully tracked, detained and interrogated, the ACLU says.",
      "author": "Lydia O’Connor",
      "content": " The American Civil Liberties Union announced Wednesday that it is suing President Donald Trump’s administration for tracking, detaining and interrogating journalists while they were reporting on U.S.-Mexico border conditions. The ACLU lawsuit is being filed on behalf of five photojournalists who traveled to Mexico late last year and early this year to document the stories of those traveling in a so-called caravan toward the border ― a group of asylum-seekers Trump has bashed as a “big con” and has compared to murderers. “When the government tries to circumvent constitutional protections, we must hold it accountable,” an ACLU statement said. “No journalist should have to fear government interference for having the persistence, courage, and commitment to expose the truth.” The White House did not immediately return a request for comment. The journalists who were detained when trying to reenter the U.S. were among the press members whom the Trump administration was tracking with a secret government database uncovered by the media earlier this year, the ACLU says. The border agents violated the journalists’ First Amendment rights by forcing them to disclose information they uncovered on their trips and the names of their sources, the ACLU contends. Harassment of journalists at the border has been an ongoing problem during Trump’s administration. Last month, acting Customs and Border Protection Commissioner Mark Morgan spoke out about the issue after a reporter said that a customs official had repeatedly asked him whether he wrote “propaganda.” “Unequivocally, let me say that any journalist that is stopped and harassed and treated improperly because they’re a journalist is absolutely unacceptable ― unequivocally,” Morgan said.",
      "date": "11/20/2019 09:03 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9CWjyNtpdHnoA.GtsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610803/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fgordon-sondland-testimony-trump-impea_n_5dd54755e4b0e29d727d0efe/RK=2/RS=7YVqLgFN6gy3dNajZVDvH70ArH4-",
      "url": "Sondland Says Trump Gave Him 'Express Direction' To Work With Giuliani On Ukraine",
      "subtitle": "“Everyone was in the loop,” the hotel executive said. “It was no secret.”",
      "author": "Ryan J. Reilly",
      "content": " WASHINGTON ― In devastating testimony before the House Intelligence Committee, the hotel executive President Donald Trump appointed as an ambassador after he donated $1 million to Trump’s inauguration said that Trump gave him “express direction” to work with Rudy Giuliani, who was pressuring Ukraine to announce an investigation of former Vice President Joe Biden’s son. “Everyone was in the loop,” Trump donor turned Ambassador Gordon Sondland said. “It was no secret … the suggestion that we were engaged in some irregular or rogue diplomacy is absolutely false.” Sondland, who testified against the wishes of the Trump administration, implicated Trump and a number of top administration officials in what he acknowledged was a “clear quid pro quo” scheme to exchange official acts for millions of dollars in U.S. government funds. Sondland said Giuliani, who spoke for the president, wanted Ukrainian President Volodymyr Zelensky to announce an investigation into the company Burisma, which included Hunter Biden on its board. “He didn’t actually have to do them, as I understood it,” Sondland testified, confirming that the key interest of the Trump administration was a public announcement that would damage Biden’s campaign rather than an actual investigation aimed at combating corruption. But Sondland insisted that he didn’t realize why, exactly, figures like Giuliani were so focused on Burisma, despite contemporaneous news accounts tying a Burisma investigation to Biden. He said it was only with the benefit of “20/20 hindsight” that he recognized that having the Ukrainian government announce an investigation into Burisma would benefit Trump’s 2020 presidential campaign by hurting Biden’s campaign. Sondland said he kept key figures, including Secretary of State Mike Pompeo, informed about his activities. He said Trump was clearly interested in “the investigations” but said Trump never told him directly that a Zelensky-Trump meeting or millions of dollars in U.S. military aid to Ukraine were conditioned on announcing the investigation. However, he said that was his “presumption” based on how things played out. Sondland claimed once again that he wasn’t happy with “the president’s orders” to involve Giuliani in foreign policy, but did so because he was trying to problem-solve and believed it was important to support the Zelensky administration’s anti-corruption efforts as well as get the delayed military aid flowing to Ukraine. Sondland said he was trying to “break the logjam” by having Zelensky issue a statement. “Mr. Giuliani’s requests were a quid pro quo for arranging a White House visit for President Zelensky. Mr. Giuliani demanded that Ukraine make a public statement announcing investigations of the 2016 election/DNC server and Burisma. Mr. Giuliani was expressing the desires of the President of the United States, and we knew that these investigations were important to the President,” Sondland said. Although Sondland said it was clear that Trump was interested in the investigations, he said he “never heard from President Trump that aid was conditioned on an announcement of investigations.” But even after talking to Trump, Sondland remained “absolutely convinced” that Ukraine wouldn’t get the aid until it announced an investigation into Burisma. “President Trump was not really interested in engaging, he wanted Rudy to handle it,” said Sondland, referring to Trump’s lawyer whom other White House officials have placed at the center of the Ukraine scheme. Sondland claimed that he “would not have acquiesced” to Giuliani’s involvement in foreign affairs “if he had known of all of Mr. Giuliani’s dealings or of his associations with individuals now under criminal indictment,” referring to indicted Giuliani associates Lev Parnas and Igor Fruman. This article has been updated with additional details from Wednesday’s hearing.",
      "date": "11/20/2019 09:17 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9CWjyNtpdHnoA9mtsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610803/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fmaloney-sondland-biden-probe-benefit_n_5dd5b860e4b010f3f1d224b0/RK=2/RS=D9SwwbXeVBKdsYXWjMIbzA_GzwY-",
      "url": "Democrat Presses Gordon Sondland To Admit A Biden Probe Would Benefit Trump",
      "subtitle": "The European Union ambassador repeatedly refused to answer Rep. Sean Patrick Maloney’s question during testimony in the House impeachment inquiry.",
      "author": "Lydia O’Connor",
      "content": " Rep. Sean Patrick Maloney (D-N.Y.) got into a heated exchange with Republican donor-turned-ambassador Gordon Sondland at Wednesday’s impeachment hearing when Sondland repeatedly refused to say who stood to gain from investigations into President Donald Trump’s political rivals. “Let me ask you something. Who would have benefited from an investigation of the president’s political opponents?” Maloney asked Sondland, the U.S. ambassador to the European Union who is under scrutiny for his role in shaping Trump’s Ukraine policy. The question was in reference to a call at the center of the impeachment inquiry in which Trump pressured Ukrainian President Volodymyr Zelensky to investigate former Vice President Joe Biden, his political rival, while discussing U.S. aid to Ukraine. Sondland dodged Maloney’s questions, saying, “I don’t want to characterize who would have and who would not have.” Maloney, growing visibly frustrated, asked him five more times to answer him until Sondland said: “I assume President Trump would benefit.” “There we have it,” Maloney said. “See, didn’t hurt a bit, did it?” Sondland’s testimony Wednesday has been largely damning to Trump, with Sondland admitting that the primary focus for Trump and his lawyer Rudy Giuliani was to leverage aid to Ukraine in order to get the country to investigate Biden, whose son once worked for the Ukrainian energy company Burisma, along with other conspiracy theories. “Everyone was in the loop. There were no secrets,” Sondland said of Trump’s pressure on Zelensky. Trump, meanwhile, attempted to characterize Sondland’s testimony as a positive, claiming he had been vindicated and that the impeachment hearings should come to a close.",
      "date": "11/20/2019 06:18 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9CWjyNtpdHnoA9GtsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610803/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fgordon-sondland-testimony-republican-reaction_n_5dd5c4c1e4b010f3f1d23061/RK=2/RS=bpLRHkfDzYCKY1Dx51KZrO0EefI-",
      "url": "Sondland’s Testimony Was A Bombshell. Republicans Pretended It Was A Dud.",
      "subtitle": "Figuring out there was a quid pro quo was “2+2,” the ambassador said.",
      "author": "",
      "content": "WASHINGTON ― Gordon Sondland, the American ambassador to the European Union and the man at the center of the Ukraine controversy, testified before Congress on Wednesday that President Donald Trump conditioned security aid and a meeting with the Ukrainian president at the White House upon on Ukraine investigating former Vice President Joe Biden and his son Hunter, giving Democrats their most potent sound bite yet. “Was there a quid pro quo?” Sondland asked himself. “The answer is yes.” But for Republicans, somehow, Sondland’s testimony exonerated Trump. Sen. John Cornyn (R-Texas) called Sondland’s testimony “a nothing-burger.” Rep. Mario Diaz-Balart (R-Fla.), while admitting he didn’t see any of Sondland’s testimony, said it was “all hearsay.” And House Freedom Caucus Chairman Andy Biggs (R-Ariz.) described Sondland’s testimony as “scrambled eggs.” “A yolk for them, a yolk for us,” Biggs said. Like many Republicans Wednesday night, Biggs disregarded Sondland’s claim that aid and a White House meeting were conditional on the Ukrainian president announcing an investigation into Biden, because Sondland also testified that Trump never directly said that it was a quid pro quo — the existence of one was Sondland’s impression. “There’s no evidence anywhere else around,” Biggs said of the quid pro quo. That, of course, ignores a lot of evidence. For starters, Ukrainian President Volodymyr Zelensky didn’t get his White House meeting, and the U.S. security aid for Ukraine was held up. Even if you believe the GOP line that Trump delayed the aid because he was doing due diligence, that doesn’t explain why he wouldn’t agree to meeting Zelensky at the White House. And, even more damning, the aid was only released after the existence of a whistleblower complaint about the situation became public. In the words of former Republican Rep. Justin Amash of Michigan ― now an Independent ― Republicans are relying on simply confusing the public. “They talk about it like we’re all stupid, like we can’t see what’s going on,” Amash told HuffPost, in an elevator full of his former Republican colleagues. “Sondland testified to a quid pro quo. He testified to significant details and facts. He testified that he thought it was wrong. So the inference is obvious that the president was withholding security assistance.” When we pressed Amash on what he would say to GOP legislators ― like the ones standing beside him in the elevator ― who say it’s not obvious, Amash was not sympathetic. “It just is,” he said. “If this were any grand jury proceeding, it would be obvious to everyone.” Predictably, that is not how Republicans see it. Despite Trump freezing the aid and not acquiescing to a White House meeting, Republicans are focused on the fact that the aid was eventually released. “My biggest problem with the whole thing is that it’s like an armed robbery without a weapon, without a product that’s been stolen and without a victim that’s been robbed,” Sen. Kevin Cramer (R-N.D.) said Wednesday. “All of this planning that was apparently going on that didn’t come to pass.” Rep. Scott Perry (R-Pa.), who was in the elevator during Amash’s interview, suggested the comparisons to a grand jury aren’t apt because the federal standards of evidence weren’t being used for the impeachment hearings. “If it were, almost all of this information, almost every single shred of it, would be inadmissible,” he said. Generally, Republicans were all over the place in their defense of Trump Wednesday night. Some of it was muted and general ― Rep. Ted Budd (R-N.C.) told HuffPost that “nothing stands out to me that’s troubling,” before insisting we get in touch with his communications director ― while other defenses were animated and extremely specific. Diaz-Balart said foreign aid gets tied up all the time. He offered the defense that everyone was misinterpreting the president. He went on an extended rant about how the press wasn’t adequately arguing for transparency in the Intelligence Committee’s investigation. (While the Intelligence Committee did initially depose witnesses behind closed doors, it has been releasing transcripts of those depositions and holding public hearings for the last week.) Other Republicans offered a smorgasbord of defenses. Perry was particularly concerned that Democrats were blocking an investigation into Hunter Biden. Rep. Peter King (R-N.Y.) said even the “worst interpretation” was still acceptable. “There’s nothing impeachable,” King said. “[Trump] has a constitutional right to ask that corruption be eliminated.” And Biggs complained about the National Security Council’s Ukraine expert, Alexander Vindman, deviating from the chain of command to report his concerns about Trump’s call with Zelensky. “Now see, here’s the problem, you get me going on this stuff,” Biggs said. But if there was one consistent part of Sondland’s testimony Wednesday that Republicans homed in on, it was the president saying “no quid pro quo.” In his deposition last month, Sondland described a September 9 phone call with the president during which he asked Trump what he wanted from Zelensky. “I want nothing. I want no quid pro quo,” Trump said, according to Sondland. “I want Zelensky to do the right thing.” Trump is so convinced that the September call vindicates him that he held an impromptu press conference on the White House lawn on Wednesday with notes that mirrored those quotes from the call. Intelligence Committee member Rep. Jim Jordan (R-Ohio) ― perhaps the president’s biggest defender in Congress ― castigated Sondland for omitting the September call from his Wednesday testimony, calling the call “the best direct evidence” about the president’s involvement in the Ukraine scandal. The entire thrust of Sondland’s testimony was that the president had, in fact, demanded a quid pro quo. At the time of the call, Sondland said Wednesday, he still believed that, contrary to what the president said, Trump still wanted Zelensky to announce investigations in order to get the military assistance and the White House visit that had been promised. After the hearing, HuffPost asked Jordan if he was just insisting that everyone take the president at his word. “The president said ‘no quid pro quo,’” Jordan said. “He wants Zelensky to do what he campaigned on, plain and simple, speaks for itself. And oh, by the way, that matches the facts, because he never announced that there was going to be an investigation.” Republicans ― who initially settled on the defense that, as long as there was no quid pro quo, there was nothing improper about wanting a foreign government to investigate the Bidens ― have now moved to a new stage: As long as Trump denied the quid pro or didn’t make it explicit, it’s fine. White House press secretary Stephanie Grisham issued a statement Wednesday where she clung to the idea that President Trump “clearly stated that he ‘wanted nothing’ from Ukraine and repeated ‘no quid pro quo’ over and over again.” “The U.S. aid to Ukraine flowed, no investigation was launched, and President Trump has met and spoken with President Zelensky,” Grisham continued. “Democrats are chasing ghosts.” That statement ignores a number of facts. For one, as Trump was saying he “wanted nothing,” he was also saying he wanted Ukraine to “do the right thing.” According to the rough transcript of the July 25 phone call, Trump told Zelensky to do him a “favor” and investigate Ukraine’s role in 2016 election interference. He also brought up “the other thing:” investigating the Bidens. Sondland said that a White House meeting and the security aid were conditioned on Ukraine announcing an investigation. Explaining his deductive reasoning on determining that it was a quid pro quo, Sondland said it was simply “2+2.” The aid only “flowed” to Ukraine after the existence of whistleblower’s complaint was made public. (You can read all about the timeline of when the aid was released here.) Furthermore, with questions about a quid pro quo already cropping up in the media, and the aid now headed to Ukraine, Zelensky canceled an interview with CNN where he planned to announce the investigations. Once there were reports of a whistleblower complaint, CNN host Fareed Zakaria said, “it became clear to us that the interview was off.” And finally, while Trump has met and spoken with Zelensky, the Ukrainian president didn’t get the meeting at the White House that he desired. Still, Republicans continue to pretend there could not have been a quid pro quo because the aid was eventually released, Zelensky met with Trump, and there have been no investigations. “It’s not 2+2,” Jordan said during the hearing. “It’s 0 for 3.”",
      "date": "11/20/2019 07:52 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9CWjyNtpdHnoA8mtsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610803/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fcnn-fox-news-legal-analysts-trump_n_5dd6422ae4b0fc53f20e11c2/RK=2/RS=Z8rmORpXKyOIq.YLPBj1I2bJ0l4-",
      "url": "Fox News, CNN Legal Analysts Nail The Significance Of Sondland Testimony On Trump",
      "subtitle": "Andrew Napolitano and Jeffrey Toobin both highlighted the importance of EU Ambassador Gordon Sondland’s impeachment revelations.",
      "author": "Lee Moran",
      "content": " CNN’s chief legal analyst Jeffrey Toobin and Fox News’ senior judicial analyst Andrew Napolitano agreed in separate broadcasts on Wednesday that European Union Ambassador Gordon Sondland’s congressional testimony in the House impeachment inquiry may prove damning to President Donald Trump. Sondland directly implicated Trump and top Trump administration officials in the Ukraine scandal during the public hearing. Toobin said “you can divide the Trump presidency into two periods, before Nov. 20th, 2019, and after, because now we know. I mean, now we know that every fantasy about how corrupt this administration was is actually true.” “The only question is, does anyone care? Do the Republicans care?” he added. Check out the clip here: Napolitano noted the significance of Sondland’s testimony by suggesting he had become “the John Dean of this testimony,” a reference to the former White House counsel to President Richard Nixon who ultimately turned on him to cooperate with prosecutors. Check out the clip here: Dean himself agreed Sondland’s testimony was in the same spirit of his, albeit not as comprehensive. “He wanted to tell the truth,” said Dean. “He thought that telling the truth and letting it come out was more important than any presidential relationship. It’s a big day in this presidency because the truth has come out about it.” Check out the clip here: Famed Watergate reporter Carl Bernstein, meanwhile, said Trump is a “corrupt president, and today’s testimony made clear just how corrupt he is.” Check out the clip here:",
      "date": "11/21/2019 03:44 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9CWjyNtpdHnoA8GtsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610803/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fgordon-sondland-ukraine_n_5dd55b6ee4b0e29d727d4fc9/RK=2/RS=vC53OjIXcvOkpVm3dl91Va0930w-",
      "url": "A GOP Ambassador Destroyed Republican Talking Points On The Ukraine Scandal",
      "subtitle": "Gordon Sondland, the ambassador to the EU, told Congress that “everyone was in the loop” on the Ukraine pressure campaign.",
      "author": "Amanda Terkel",
      "content": " The most damning testimony of the House impeachment hearings came on Wednesday, when a lifelong Republican chosen by President Donald Trump to be ambassador to the European Union eviscerated every talking point the GOP has put out about the Ukraine scandal. “Everyone was in the loop,” Sondland said of the campaign to pressure Ukraine into helping Trump politically. “We followed the president’s orders,” he added, saying there indeed was a “quid pro quo.” In his testimony Wednesday morning, Sondland made clear that it was widely known in the administration that Trump wanted Ukraine to do his bidding on political investigations, in exchange for favorable U.S. foreign policy treatment. Sondland’s testimony was incredibly damaging for Republicans. The ways they’ve tried to discredit the other witnesses or downplay the scandal went out the window with Sondland, and they struggled to lodge critiques that will stick. Some of the excuses Republicans have used thus far: Republicans have gone after other officials who have testified ― such as Bill Taylor, the acting ambassador to Ukraine, and George Kent, a State Department official responsible for Ukraine ― by saying that they didn’t witness key events. With other individuals who did have some firsthand knowledge, Republicans have dismissed them as being bit players who didn’t talk regularly to Trump. That doesn’t work with Sondland, who spoke regularly to Trump. Other witnesses testified that they understood that Sondland had regular access to the president, and Sondland himself underscored that in his testimony. When asked Wednesday whether he told Trump that Ukrainian President Volodymyr Zelensky “loves your ass,” Sondland replied, “Sounds like something I would say. That’s how President Trump and I communicate. A lot of four-letter words. In this case a three-letter.” Yet Trump spoke to reporters while Sondland was testifying, saying he didn’t know Sondland well: “I have not spoken to him much. This is not a man I know well. He seems like a nice guy though.” Pam Bondi, the new White House communications director for impeachment, went on TV and said Sondland was just a “short-term ambassador” to Ukraine. (He was never ambassador to Ukraine; he is ambassador to the EU.) Prior to last week’s House Intelligence Committee hearing with Taylor and Kent, Trump tweeted, “NEVER TRUMPERS!” Trump also said Jennifer Williams, an aide to Vice President Mike Pence who testified on Tuesday, was part of the same group. All denied that characterization. The “Never Trumper” moniker can’t be applied to Sondland. He’s a lifelong Republican who initially supported former Florida Gov. Jeb Bush in the 2016 Republican presidential primary but then readily got on board with Trump. He became an ambassador through a well-trodden practice used by both parties ― donating lots of money. Sondland contributed $1 million to Trump’s inauguration committee. Brent Bozell, a conservative commentator, tweeted that Sondland showed why the American people elected Trump to “get rid of people like Sondland.” Of course, Trump picked Sondland to be his ambassador to the EU. Bozell must have even realized how lame this attack was, and he deleted his tweet. There’s no question that Rudy Giuliani, Trump’s personal lawyer who has no government role, was operating in a highly unusual ― and inappropriate ― fashion in the Ukraine scandal. He was able to leverage U.S. foreign policy in ways meant to benefit only Trump politically and personally. Sondland, other witnesses testified, was part of this rogue operation. And there was the possibility, therefore, that they were acting on their own, without the knowledge of those at the top ― including Trump himself. Sondland shot down that theory Wednesday. He said it was “no secret” what they were doing. Among the officials Sondland named as knowing what was going on: Secretary of State Mike Pompeo; acting White House chief of staff Mick Mulvaney; Mulvaney’s senior adviser Rob Blair; Pompeo’s counselor Ulrich Brechbuhl; Lisa Kenna, the State Department executive secretary; John Bolton, Trump’s national security adviser at the time; Bolton’s deputy Fiona Hill; and Timothy Morrison, who replaced Hill. One of the biggest recent revelations in the Ukraine investigation is that David Holmes, a U.S. embassy official in Ukraine, overheard Sondland talking on the phone to Trump, telling him Zelensky “loves your ass,” to which Trump replied, “So he’s going to do the investigation?” When Holmes asked Sondland what Trump’s views on Ukraine were, Sondland reportedly said, “The president did not give a shit about Ukraine.” For him, it was all about the political investigations. The existence of the call seemed to put Trump more directly at the heart of the scandal, obsessed with using foreign policy for his political benefit. But Sondland, in his testimony Wednesday, said he barely remembered the call ― because it was so unremarkable. “I would have been more surprised if President Trump had not mentioned investigations,” he said. Yet on Wednesday, a key tactic seemed to be making it seem like Sondland didn’t know what was in Trump’s mind ― and also throwing Giuliani under the bus. Sondland said that when Trump told him and other officials on May 23 to “talk to Rudy,” he took that as an order to talk to Giuliani and follow his instructions on what to do about Ukraine. In other words, Giuliani spoke for Trump. But Republicans claim that what Trump wanted was still unknowable, because he never expressly told Sondland to hold up aid until Ukraine carried out the political investigations. “Sondland never testified that it was the ‘express direction’ of the President to pressure Ukraine or push a quid pro quo,” the Trump campaign said in an email sent Wednesday. Rep. Mike Turner (R-Ohio) accused Sondland of “made-up testimony.” This tactic has been more tailored for Sondland, who has been an unreliable witness and has changed his testimony since the time he first spoke to lawmakers behind closed doors. (It was tougher to pull off with Taylor, for example, who took meticulous contemporaneous notes.) Steve Castor, the GOP counsel questioning Sondland during the hearing, tried to make it seem like the ambassador simply doesn’t remember anything: “You don’t have records. You don’t have your notes because you didn’t take notes. You don’t have a lot of recollections. I mean, this is the trifecta of unreliability.” But Sondland said the reason he can’t recall as much is, in part, the fault of the administration, which has refused to let him view all his phone records, State Department emails and other documents. He said he was also told that he couldn’t work with his staff to pull together the relevant files. “My lawyers and I have made multiple requests to the State Department and the White House for these materials. Yet, these materials were not provided to me. They have also refused to share these materials with this committee. These documents are not classified and, in fairness, should have been made available. In the absence of these materials, my memory has not been perfect,” he said. “And I have no doubt that a more fair, open and orderly process of allowing me to read the State Department records would have made this process more transparent.”",
      "date": "11/20/2019 02:01 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9CWjyNtpdHnoA7mtsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610803/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fgordon-sondland-testify-ukraine_n_5dd54771e4b010f3f1d0c3ea/RK=2/RS=jBfCKRRBxaejn59mGh8tqHbvqpw-",
      "url": "Gordon Sondland Says He Kept Top Trump Admin Members Updated On Ukraine Pressure",
      "subtitle": "Ambassador Gordon Sondland testifies to a Houses panel Wednesday about his evolving accounts of the Trump administration’s dealings with Ukraine.",
      "author": "",
      "content": "WASHINGTON (AP) — The Latest on President Donald Trump and the House impeachment inquiry (all times local): 9 a.m. Ambassador Gordon Sondland says he kept top members of the Trump administration, including Secretary of State Mike Pompeo, in the loop about President Donald Trump’s pressure on Ukraine for investigations. In remarks to a House intelligence panel, Sondland tells lawmakers that it was well-established within the Trump administration that there was a quid pro quo involving Ukraine. He said the president’s personal lawyer, Rudy Giuliani, openly discussed how Trump wanted Ukraine to publicly announce investigations into the 2016 U.S. presidential election and into Burisma — the Ukraine gas company on whose board Biden’s son, Hunter, sat — as a prerequisite for a coveted White House visit for Ukraine leader Volodymyr Zelenskiy. Sondland said he laid out the issue in detail to members of State Department, Energy, and White House staff. Recipients included Pompeo and Mick Mulvaney, the acting White House chief of staff, he said. Everyone understood “Trump’s desires and requirements,” Sondland says. He added: “Everyone was in the loop. It was no secret.” Last month, Pompeo acknowledged for the first time he was on Trump’s July 25 call with the Ukrainian president, but disclosed no details and did not indicate he was kept up to date on the Ukraine pressure efforts. __ 12:12 a.m. Ambassador Gordon Sondland faces tough questions when he testifies to a Houses panel Wednesday about his evolving accounts of the Trump administration’s dealings with Ukraine. A newly revealed phone call with President Donald Trump shows Sondland, the U.S. ambassador to the European Union, more directly entangled than any witness yet in the Trump’s efforts to get Ukraine to investigate political rival Joe Biden and Democrats in the 2016 election. Sondland is a wealthy hotelier Trump tapped as his ambassador to the European Union. He is more directly entangled than any witness yet in the president’s efforts to get Ukraine to investigate political rival Joe Biden and Democrats in the 2016 election. Sondland’s closeness to Trump makes his appearance of particular concern to the White House as the historic impeachment inquiry reaches closer to the president.",
      "date": "11/20/2019 09:07 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9CWjyNtpdHnoA7GtsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610803/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2falexandria-ocasio-cortez-trump-bolivia_n_5dd7f892e4b0d50f328e8bbd/RK=2/RS=uVYE17MOuq4TWwuJmJUZxdqOPbk-",
      "url": "House Progressives Blast Trump For Embrace Of Right-Wing Bolivian Leaders",
      "subtitle": "The president’s tacit endorsement of unleashing the military on protesters could lead to “a full-blown humanitarian emergency,” the lawmakers warned.",
      "author": "Travis Waldron",
      "content": " WASHINGTON ― A group of progressive lawmakers that includes Reps. Ilhan Omar (D-Minn.) and Alexandria Ocasio-Cortez (D-N.Y.) slammed the Trump administration’s support for the right-wing leaders who have taken power in Bolivia following the ouster of socialist President Evo Morales, saying Friday that the White House’s “dangerously misguided” backing risks creating “a full-blown humanitarian emergency” in the South American nation. “We are troubled by statements from Administration officials, including President Trump, that welcome these developments in Bolivia that bear the hallmarks of a military coup d’état,” the group of lawmakers said in a letter drafted by Rep. Hank Johnson (D-Ga.), a progressive who has been outspoken on human rights issues in Latin America throughout his career in Congress. The letter was sent to Secretary of State Mike Pompeo on Friday. Morales, who was first elected in 2005, resigned on Nov. 10 amid pressure from Bolivia’s armed forces as protests erupted across Bolivia after a disputed October election, in which his opponents accused him of fraud. The Organization of American States, a regional body of governments from across the Americas, said in a preliminary audit that it had found “serious irregularities” in the election. Morales (who says he is the victim of a coup and has fled to Mexico), his supporters, and some independent groups have questioned the evidence behind the OAS findings. Morales’ decision to seek a fourth term — even after he initially lost a 2016 referendum asking Bolivians to alter constitutional term limits to allow him to do so — and the fraud allegations sparked the protests that led to his resignation. But his departure came two months before his current term would have ended in January. And his ouster paved the way for the rise of right-wing figures ― including Jeanine Áñez, a conservative senator who declared herself interim president ― to power. President Donald Trump welcomed Morales’ ouster as a “a significant moment for democracy in the Western Hemisphere,” and his administration immediately recognized Áñez’s legitimacy as interim leader. But since taking power, Áñez and her allies have threatened lawmakers from Morales’ Movement for Socialism party and journalists with prosecution while also unleashing the military, which they exempted from prosecution, to crack down on pro-Morales demonstrations. Protesters have accused the military of killing at least eight people during a demonstration last week. “We urge you to consider an immediate change in course and to take action to support democracy and human rights in Bolivia,” the lawmakers wrote. “While there is legitimate debate surrounding Morales’ decision to run for a fourth term, it is simply not acceptable for the U.S. administration to welcome the forced removal of a democratically-elected leader before the end of their mandate.” “Our government should call for the prompt restoration of constitutional order, and for an immediate end to all persecution and attacks targeting leaders and supporters of Evo Morales and his political party,” they said. “Additionally, we call for the adoption of protective measures for those facing threats.” Warning that “Bolivia’s escalating crisis threatens to spiral into violent internal conflict,” the progressives argued that the administration’s backing of the current Bolivian leadership “could well contribute to a further breakdown in the rule of law in Bolivia and a full-blown humanitarian emergency, with large migrant outflows.” “We strongly urge you to revise this approach and support the prompt restoration of constitutional order, dialogue between opposing political factions, fair and inclusive elections and respect for the human and cultural rights of all Bolivians,” they wrote. Although it was addressed to the Trump administration, the letter also marked the latest effort from progressive lawmakers to set themselves apart from Democratic leadership on foreign policy and human rights issues, particularly in the Americas. In March, progressives came out against the Trump administration’s decision to back Venezuelan opposition to socialist President Nicolas Maduro, who has become increasingly autocratic and authoritarian as an economic crisis has crippled his country. Millions of people have fled Venezuela, and Trump has aggressively supported efforts to remove Maduro from office by imposing economic sanctions and making thinly veiled threats of military force. Progressive lawmakers argued in March that Trump’s sanctions and threats of “American military-led regime change” would only “hurt ordinary people” and exacerbate Venezuela’s crises. Progressive Rep. Ro Khanna (D-Calif.) said at the time that the coordinated effort to challenge the White House even as top Democrats backed Trump’s strategy was a deliberate move to reshape foreign policy conversations within the party. Khanna was not among the 14 lawmakers who signed the Friday letter about Bolivia. The signatories were Reps. Raul Grijalva (D-Ariz.), Susan Wild (D-Pa.), Jan Schakowsky (D-Ill.), Jared Huffman (D-Calif.), Debra Haaland (D-N.M.), Jim McGovern (D-Mass.), Jesus “Chuy” García (D-Ill.), Bobby Rush (D-Ill.), Ayanna Pressley (D-Mass.), and Alan Lowenthal (D-N.Y.). Eleanor Holmes Norton (D), Washington D.C.’s representative to Congress, also signed the letter. Ocasio-Cortez and Omar have both previously called Morales’ ouster a coup. Sen. Bernie Sanders (I-Vt.). Sanders and Hawaii Rep. Tulsi Gabbard are the only Democratic presidential candidates to have done so. Pompeo, in a new statement Thursday, reiterated the United States’ support for Áñez’s transitional government and renewed condemnations of Morales and other party officials who Pompeo said were responsible for “egregious irregularities and manipulation of the vote” in October’s elections. But he also said the United States opposed crackdowns on the press and protesters. “We support robust press freedoms and peaceful assembly and protest. Violence, repression, and political intimidation have no place in a democracy,” Pompeo said. “We call on all parties to refrain from such violence, to observe the rule of law, and to respect the rights of all citizens to participate in building Bolivia’s future, whatever their views. Security services must respect the rights of peaceful protestors, and the Bolivian authorities must ensure accountability for any violations of the right of citizens.”",
      "date": "11/22/2019 02:43 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9CWjyNtpdHnoA6mtsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610803/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2ftrump-gordon-sondland-testimony_n_5dd57348e4b0fc53f20cb8bb/RK=2/RS=9NFGJ0wJeLsF1IqD6udMGLIJE_c-",
      "url": "Trump Bizarrely Tries To Spin Sondland's Damning Testimony As Positive",
      "subtitle": "Speaking to reporters outside the White House, the president read from handwritten notes claiming his innocence.",
      "author": "Ja’han Jones",
      "content": " President Donald Trump told reporters Wednesday that Ambassador Gordon Sondland’s testimony to the House Intelligence Committee earlier that day ― testimony that directly implicated Trump in a corruption scheme ― had in fact vindicated him, and that it was time for the impeachment hearings to end. “It’s all over,” Trump said of the impeachment proceedings. A photograph of Trump’s notepad showed phrases in his handwriting such as “I WANT NOTHING,” “I WANT NO QUID PRO QUO” and “THIS IS THE FINAL WORD FROM THE PRES OF THE U.S.” Sondland, the U.S. ambassador to the European Union, had described for investigators a conversation in which the president said he didn’t want anything from Ukraine in return for supplying aid to that country. But Sondland said repeatedly that in fact, the primary focus for Trump and his lawyer Rudy Giuliani was leveraging the aid to get Ukraine to announce investigations into former Vice President Joe Biden. Trump’s midday press appearance was a bizarre spectacle, one that gave little indication of the gravity of Sondland’s testimony implicating the president in a scheme to misuse his office. “Everyone was in the loop. There were no secrets,” Sondland said of Trump’s desire to pressure Ukraine into investigating his political rival. Sondland added that other Trump officials ― including Vice President Mike Pence, Secretary of State Mike Pompeo and acting White House chief of staff Mick Mulvaney ― were aware of Trump’s “desires and requirements.” “This is not a man I know well,” Trump said of Sondland. “He seems like a nice guy, though.”",
      "date": "11/20/2019 01:30 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9BNzwNtpdK10AbwhsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610800/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2ffox-news-neil-cavuto-donald-trump_n_5dd3b88ee4b0263fbc9a3cf1/RK=2/RS=9nTZruzw_UGtYrId.0aUEBbbMxg-",
      "url": "Fox News' Neil Cavuto Hits Donald Trump With A Reminder About How Journalism Works",
      "subtitle": "Cavuto also explained what constitutes “fake news” in his direct address to the president.",
      "author": "Lee Moran",
      "content": " Fox News host Neil Cavuto directly addressed Donald Trump on his “Your World” show Monday, telling the president that journalists have an obligation to question him, even if that invites his “wrath.” Journalists “aren’t entitled to praise you. We are obligated to question you, and to be fair to you,” said Cavuto. “We will. Even if it risks inviting your wrath. You are free to rage. All we are free to do is report and let the viewers decide.” Cavuto’s comments came in response to Trump’s weekend Twitter attack on his Fox colleague Chris Wallace. Trump called “Fox News Sunday” host Wallace “nasty & obnoxious” after he grilled Rep. Steve Scalise (R-La.) over the House impeachment inquiry into the president. “What makes something fake news?” asked Cavuto. “I would assume if the news being reported is fake or wrong and the person presenting that news knows it is fake or wrong, that is bad.” “But what if the news being reported is accurate, the facts are good, they just sound bad?” he said. “My colleague Chris Wallace has discovered again the president doesn’t distinguish.” Cavuto reminded Trump that he is “not the first president to say the media has it out for you. No less than press darling John F. Kennedy himself had his moments with the media.” “We can’t please all,” he added. “The best we can do as journalists is be fair to all, including you, Mr. President. That’s not fake doing that, what is fake is not doing that, what is fake is saying Fox never used to do that. Mr. President, we have always done that.” Check out the clip here: Cavuto similarly reminded Trump in August of the role of journalists. “First of all, Mr. President, we don’t work for you. I don’t work for you,” he said. “My job is to cover you, not fawn over you or rip you. Just report on you ― call balls and strikes on you.” “Hard as it is to fathom, Mr. President, just because you’re the leader of the free world doesn’t entitle you to a free pass,” Cavuto added. “Unfortunately, just a free press.” Check out that clip here:",
      "date": "11/19/2019 05:30 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9BNzwNtpdK10AbQhsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610800/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2faap-rocky-trump-impeachment-inquiry-sondland_n_5dd556cbe4b010f3f1d0f908/RK=2/RS=eUIJMuAsPZjs0qxuKPhd1RvYmi0-",
      "url": "No One Predicted That A$AP Rocky Mention During Trump's Impeachment Inquiry",
      "subtitle": "In both his opening statement and later testimony, European Union ambassador Gordon Sondland named the rapper as a topic of discussion on a call with Trump.",
      "author": "Jenna Amatulli",
      "content": " European Union ambassador Gordon Sondland delivered an explosive opening statement during President Donald Trump’s impeachment inquiry that included his revelation that “everyone” knew “Trump’s desires and requirements” on Ukraine ... and an A$AP Rocky mention? During Wednesday’s hearing, Sondland explained that he believed there was a quid pro quo at play between Ukraine and Trump, meaning that Ukrainians had to respond to Trump’s requests to get a White House call or meeting. As if the testimony weren’t enough of a bombshell, about two thirds of the way through, Sondland mentioned a popular rapper by name and sent social media into a tailspin. Sondland described a call he had with Trump on July 26, 2019. The ambassador was in Kyiv at the time and stated that he and the president did not discuss any classified information at that time. In clarifying what the call entailed, Sondland said: “Other witnesses have recently shared their recollection of overhearing this call. For the most part, I have no reason to doubt their accounts. It is true that the president speaks loudly at times. And it’s also true, I think we primarily discussed A$AP Rocky. It is true that the President likes to use colorful language.” The ambassador goes on to say that the call did not strike him as “significant.” Naturally, hearing a name like A$AP Rocky ― the artist behind hits like “F**kin’ Problems” and “Live Fast” ― during an impeachment inquiry is a bit ... jarring. The rapper was detained in Sweden after being charged with assault in July. At the time, Trump “offered to personally vouch for [Rocky’s] bail,” though Sweden has no bail system. On Wednesday, Sondland doubled down on the mention of the 31-year-old artist and said later in his testimony that his memory of the July 26 call with Trump was triggered by someone’s reference to A$AP Rocky. He claimed that discussing the rapper was the “primary purpose of the call.”  Here’s what the peanut gallery, AKA Twitter, had to say about the mentions:",
      "date": "11/20/2019 11:09 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9BNzwNtpdK10AawhsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610800/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fdemocratic-debate-2020-impeachment-sondland_n_5dd5f339e4b010f3f1d25757/RK=2/RS=QP0Pz_ajzBI3i44QesRZtwJwDGo-",
      "url": "Candidates Kick Off Fifth Democratic Debate By Addressing Impeachment Hearings",
      "subtitle": "The historic House impeachment inquiry of President Donald Trump got top billing at Wednesday night’s presidential debate.",
      "author": "Igor Bobic",
      "content": " Presidential candidates opened the fifth Democratic debate on Wednesday by addressing the public impeachment hearings that have gripped Washington this week with new revelations about President Donald Trump’s attempted quid pro quo with Ukraine. But even as they cheered the House impeachment inquiry and argued that Trump needed to be removed from office, most Democrats on the debate stage in Atlanta, Georgia, used the question about impeachment to pivot to their core campaign message. Sen. Elizabeth Warren (D-Mass.), for example, deftly tied the hearings to her recently released plan to tackle corruption. “He wrote a check for a million dollars and that tells us what is happening in Washington... We are not going to give away these ambassador posts to the highest bidder,” Warren said, referring to bombshell testimony from Trump donor turned European Union Ambassador Gordon Sondland earlier in the day. Sondland, who was appointed in 2017 after donating $1 million to Trump’s inauguration, delivered devastating testimony before the House Intelligence Committee on Wednesday morning that implicated Trump and a number of top administration officials in what he acknowledged was a “clear quid pro quo” scheme to exchange official acts for millions of dollars in U.S. government funds. South Bend, Indiana, Mayor Pete Buttigieg said Democrats need to move forward with the impeachment inquiry, but he also said they must be ready to bring the country together after Trump’s presidency. “We must confront Donald Trump for his wrongdoings. That means impeachment. But we must do more. I’m running to be the president who will stand amid the rubble of his presidency, pick up the pieces, and unify a divided nation,” Buttigieg said. He continued on that theme by noting that each Democratic presidential candidate is “running to be the president for that day the sun comes up and the Trump presidency is behind us, which will be a tender moment in the life of this country.” Former Vice President Joe Biden used the moment to tout his strength among people who view him as most able to beat Trump in 2020. “Donald Trump doesn’t want me to be the nominee, that’s pretty clear,” Biden said, referring to Trump’s pressure on Ukraine to investigate his family. He added that Russian President Vladimir Putin also “doesn’t want me to be president.” Sen. Kamala Harris (D-Calif.) tied impeachment hearings to her “justice” campaign platform and her biography as a former prosecutor in California. “We have a criminal living in the White House,” Harris said, before taking a swipe at Buttigieg, over his “tender moment” comment seconds earlier. “Until we get to that tender moment, justice is on the ballot.” Sen. Amy Klobuchar (D-Minn.), meanwhile, argued that Trump’s presidency is putting democracy at risk. “This is a president that not only with regard to his conduct with Ukraine, but every step of the way puts his own private interests, his own partisan interests, his own political interests, in front of our country’s interests, and this is wrong. This is a pattern with this man,” Klobuchar said.",
      "date": "11/20/2019 10:06 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9BNzwNtpdK10AaQhsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610800/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fwatergate-prosecutor-donald-trump-toast_n_5dd3aa81e4b082dae813716b/RK=2/RS=HaTT98ZGG6vFmNd0igt.wWQbxgI-",
      "url": "Watergate Prosecutor Predicts The Moment This Week That Donald Trump Will Be ‘Toast’",
      "subtitle": "Nick Akerman says an upcoming public hearing in the impeachment inquiry against Trump will prove pivotal.",
      "author": "Lee Moran",
      "content": " Former Watergate prosecutor Nick Akerman on Monday predicted Donald Trump will be doomed by EU ambassador Gordon Sondland’s upcoming public House testimony in the impeachment inquiry into the president. “Donald Trump is toast,” Akerman told CNN. “Sondland is going to come out and tell the whole story,” he predicted. “He’s going to detail it, he’s going to have documents to detail it, you’ve got lots of witnesses corroborating it.” “I mean there’s no question that they were trying to get the Ukrainian government to announce an investigation into (former Vice President) Joe Biden,” Akerman added. “And using money as appropriated by the U.S. Congress to do that. Pure bribery.” Sondland will testify on Wednesday morning. He has already walked back his initial closed-door claim that he didn’t recall any discussions about Ukraine announcing an investigation into the Bidens allegedly in exchange for withheld military aid. Akerman said Sondland has “got no choice here” but to “come clean” about his role and Trump. “Otherwise he’s gonna wind up like Roger Stone in federal prison, with Roger Stone as his roommate. I mean, he does not want that to happen,” Akerman explained, referencing the GOP strategist and longtime Trump associate who was on Friday found guilty on seven charges relating to lying to investigators probing Russian interference in the 2016 presidential election. Stone will be sentenced next year. “If I were his lawyer, I would be sitting on him pretty hard and making sure that he told everything he knew, every truthful bit of evidence just to make sure he doesn’t go down for Donald Trump,” Akerman, referring to Sondland, added. Check out the clip here:",
      "date": "11/19/2019 04:28 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9BNzwNtpdK10AZwhsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610800/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2feric-trump-wine-impeachment_n_5dd5c9e3e4b0fc53f20d8629/RK=2/RS=Z_YVq0A9HgYfxDYIEIhAGdAIwjM-",
      "url": "Eric Trump Burned For Using Impeachment Hearing To Sell Trump Wine",
      "subtitle": "One Twitter user said the wine “pairs well with bribery.”",
      "author": "David Moye",
      "content": " Eric Trump wasn’t exactly drunk with power during Ambassador Gordon Sondland’s testimony on Wednesday ― but he definitely thought about getting drunk. While Sondland was directly implicating President Donald Trump in a Ukraine shakedown, the president’s second-born son was figuring out how to make a buck off the whole impeachment situation. His solution was to push Trump wines. As you might expect, many Twitter users called out the dubious marketing stunt and Eric himself. Some people immediately thought of appropriate pairings. Some suggested a different spirit might be in order. Others were confused by the Trump wine tweet. And others just assumed Trump’s second son made a spelling error. One person wasn’t going to buy until they got a full accounting of the wine’s flavor profile.",
      "date": "11/20/2019 07:10 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9BNzwNtpdK10AZQhsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610800/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fsondland-trump-biden-corruption_n_5dd56744e4b0e29d727d792b/RK=2/RS=0AeawTF797AW2UrEV1e9lEG88gk-",
      "url": "Impeachment Testimony Reveals How Little Trump Cared About Corruption In Ukraine",
      "subtitle": "Trump wanted a TV announcement to bludgeon Biden, not an actual probe, EU Ambassador Gordon Sondland testified.",
      "author": "Paul Blumenthal",
      "content": " Gordon Sondland, U.S. ambassador to the European Union, testified on Wednesday that President Donald Trump cared most that Ukrainian president Volodymyr Zelensky publicly announce an investigation into former vice president Joe Biden and the company that employed his son, not that Ukraine actually conduct the probe. “He had to announce the investigations,” Sondland said during the House impeachment inquiry, referring to Zelensky. “He didn’t actually have to do them, as I understood it.” The point is essential in that it reveals that Trump did not care about corruption in Ukraine, as his GOP allies in Congress have attempted to argue﻿. Instead the president simply wanted a television clip that could be used to implicate a potential 2020 Democratic presidential opponent in a criminal investigation. “I never heard ... anyone say the investigations had to start or had to be completed,” Sondland said. He noted the only information he was provided was that Trump wanted Zelensky to make a public statement announcing investigations into Burisma, a Ukrainian natural gas company that employed Hunter Biden, and whether Ukraine, and not Russia, interfered in the 2016 election. The only reason that Sondland said he was given for this was that Ukrainian officials had previously made promises in private that they did not deliver. Sondland’s statements fit with other testimony from witnesses and evidence from call records that Trump never raised broader issues of corruption in Ukraine or actual anti-corruption policy in his conversations with Zelensky. Instead, he focused on specific investigations; one that could help him win the 2020 election, and another that could cloud the stain of how he won the 2016 election. A televised announcement by Ukraine could be extremely useful for the Trump campaign if Biden were to win the Democratic presidential primary to face the president in 2020. It could be referred to at rallies, used in television and internet advertisements, and Trump-friendly news organizations could use it in clips to make claims of corruption against Biden. This could allow Trump to rerun his 2016 playbook, where he used the FBI investigation into former Secretary of State Hillary Clinton’s use of a private email server to make broad claims of criminal corruption against her. The New York Times claimed at the time that the then-FBI director James Comey’s first announcement in July 2016 about the Clinton investigation provided a “ready-made attack ad” for Trump.",
      "date": "11/20/2019 11:50 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9BNzwNtpdK10AYwhsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610800/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2ftrump-texas-apple-plant_n_5dd5d2d0e4b010f3f1d23b41/RK=2/RS=Bw06YLkzG0_pEHXAPK2swvcZKvE-",
      "url": "Trump Boasted About A 'New' Apple Plant In Texas. It Opened In 2013.",
      "subtitle": "The president was touring a facility in Austin, Texas, with Apple CEO Tim Cook.",
      "author": "Nick Visser",
      "content": " President Donald Trump traveled to Austin, Texas, on Wednesday to tour a manufacturing plant with Apple chief executive Tim Cook, touting what he called a “new” facility that would bring high-paying jobs back to America. The only problem? The plant has been making Apple computers since 2013, long before Trump was elected. The president toured a facility run by an independent company called Flex Ltd. that assembles Apple’s expensive Mac Pro computers. During the tour, Trump suggested that his efforts to convince companies to relocate their manufacturing facilities back to the U.S. — and in particular, his relationship with Cook over the past few years — had paid off. “We’re seeing the beginning of a very powerful and important plant,” said Trump, who has long boasted about his efforts to convince manufacturers to come back to America. “Anybody that followed my campaign, I would always talk about Apple, that I want to see Apple building plants in the United States. And that’s what’s happening.” But that assertion is not true, and Cook did not correct Trump after he made the statements. The New York Times’ Jack Nicas noted shortly after the event that Apple has not, in fact, built any new plants in the U.S. since Trump’s election and that the vast majority of its products are still made overseas. The tech giant did release more details about its previously announced $1 billion campus in Austin that will house 5,000 white-collar employees beginning in 2022. But those roles will, by and large, not be manufacturing jobs. “With the construction of our new campus in Austin now underway, Apple is deepening our close bond with the city and the talented and diverse workforce that calls it home,” Cook said in a company statement. Trump repeated his falsehood on Twitter later in the day, saying, “Today I opened a major Apple Manufacturing plant in Texas that will bring high paying jobs back to America.” He also shared a video of his tour of the plant. Trump commended Apple for building the Mac Pro in the U.S. on Wednesday, saying that by doing so, Cook didn’t “have to worry about tariffs” that would affect the cost of the final product. That’s also false. The Verge notes that some Mac Pro parts are imported from China, and Apple has to pay tariffs on them before the devices are assembled in Texas. A new round of tariffs is set to go into effect on Dec. 15, and it will potentially affect the cost of a bevy of Apple products, including iPhones. Apple was flirting with the idea of moving production overseas earlier this year to lower the costs of the Mac Pro but said in September that the latest iteration of the computer would be assembled in Austin after all. The president also tweeted another confusing lie on Wednesday, saying House Speaker Nancy Pelosi (D-Calif.) had “closed Congress” on Wednesday, apparently pointing to the ongoing impeachment investigation into the Trump administration’s dealings with Ukraine. Congress was not closed. Many House lawmakers were holding those hearings. Meanwhile, the Senate advanced an important bill addressing the crisis of missing and murdered Native American women.",
      "date": "11/20/2019 09:07 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9BNzwNtpdK10AYQhsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610800/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2ftrump-tax-returns-law-california_n_5dd6e536e4b02648edb21d7b/RK=2/RS=ctQQgZkT0A13MVj2vKwL0I_O104-",
      "url": "California Supreme Court Strikes Down Tax Return Law Aimed At Trump",
      "subtitle": "The justices ruled that a new law requiring presidential candidates to release tax filings in order to appear on the California primary ballot was “invalid.”",
      "author": "Sarah Ruiz-Grossman",
      "content": " The California state Supreme Court ruled unanimously on Thursday against recent legislation that would have required all presidential candidates ― including President Donald Trump ― to release their tax returns before appearing on the state’s primary election ballot. The judges wrote in their opinion that one of the requirements under the new law “conflicts” with the state constitution ― which says a candidate “recognized” throughout the nation or the state cannot be barred from appearing on the ballot ― and is therefore “invalid.” California lawmakers originally passed this law, which was signed by Democratic Gov. Gavin Newsom in July, in the hopes of forcing the president to release his tax returns. The bill’s author, Democratic state Sen. Mike McGuire, has said that the legislation was designed to take aim at Trump. “These are extraordinary times and states have a legal and moral duty to do everything in their power to ensure leaders seeking the highest offices meet minimal standards,” Newsom said in a statement when he signed the law. “The disclosure required by this bill will shed light on conflicts of interest, self-dealing, or influence from domestic and foreign business interests.” Trump has long refused to release his tax documents, in defiance of a federal law that says Congress can have access to private tax information. Trump is the first president in four decades to not release his tax returns. Last month, a federal judge blocked the California law from going into effect, and the state then appealed that ruling. Thursday’s Supreme Court ruling is final.",
      "date": "11/21/2019 03:26 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9BNzwNtpdK10AXwhsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610800/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2ftrump-supporters-nixon-kimmel_n_5dd52667e4b010f3f1d062ef/RK=2/RS=4u7pCmV0m0vNnp2QOlktipKKYkU-",
      "url": "Donald Trump Fans Get Tricked Into Defending Richard Nixon Over Watergate",
      "subtitle": "They all fell for the Jimmy Kimmel prank.",
      "author": "Lee Moran",
      "content": " Jimmy Kimmel’s crew went out among Donald Trump’s supporters to canvas opinion about the president on Tuesday night. They asked people claiming to be fans of Trump what they thought of a bunch of White House scandals. But there was a twist. All of the events they quizzed them over actually involved disgraced former President Richard Nixon and the Watergate scandal that forced Nixon to resign the presidency. It didn’t seem to matter to them, though. Check out the clip above.",
      "date": "11/20/2019 07:31 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9IlXuNtpdOmAAONpsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610798/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2frobert-de-niro-donald-trump-three-terms_n_5dd5470be4b0e29d727d0dcf/RK=2/RS=3cUaZ1JGbqWZ3aBPK2a_EQYrh_g-",
      "url": "Robert De Niro Makes Ominous Prediction About How Donald Trump Could Serve 3 Terms",
      "subtitle": "The 22nd Amendment bars a president from serving more than two terms, but “The Irishman” star is nevertheless worried.",
      "author": "Lee Moran",
      "content": " Movie star Robert De Niro has a theory how President Donald Trump could end up staying in the White House for a third term. It involves Trump declaring war in order to remain in office past 2024. De Niro, star of Netflix’s upcoming film “The Irishman” ― who has previously called the president a “real racist,” a “wannabe gangster” and a white supremacist ― shared the idea in a preview of a new interview that The Daily Beast published online Wednesday. Just to be clear, the 22nd Amendment of the U.S. Constitution ― passed by Congress in 1947 after President Franklin D. Roosevelt’s election to a fourth term in 1944 ― limits presidents from serving more than two terms. But De Niro fears Trump may try to find a way to do so. The actor noted how Trump has often joked about being president for life. He said he thought that if Trump “became president for a second term he’d try to have a third term, and let smarter people manipulate it into getting us into some kind of altercation: a war.” Director Martin Scorsese, with whom De Niro worked on the Netflix movie, first suggested the idea. “The only other president who served a third term was Roosevelt because he was in a war, and this fool would go and start something,” De Niro explained. “This was what Marty Scorsese was saying, and I said, ‘Marty, I never thought of that. I never thought he’d go for a third term if there was a war or something.’” Read the full interview with The Daily Beast here. This story has been updated with a reference to the 22nd Amendment.",
      "date": "11/20/2019 09:50 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9IlXuNtpdOmAANtpsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610798/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2ffox-news-chris-wallace-donald-trump-testimony_n_5dd4f490e4b0e29d727c0e98/RK=2/RS=ad3_ntkDnIrcZ2fjVu04n8M0czw-",
      "url": "Fox News' Chris Wallace Nails Why Donald Trump Testifying Would Be A Terrible Idea",
      "subtitle": "The Fox host used an analogy about Prince Andrew and Jeffrey Epstein to make his case.",
      "author": "Lee Moran",
      "content": " Fox News host Chris Wallace used an analogy about Prince Andrew to explain why it would be an awful idea for Donald Trump to testify in the House impeachment inquiry, despite the president’s claim that he may do so. Trump on Monday tweeted: Wallace, on Tuesday’s broadcast of “America’s Newsroom,” explained why it would be “unwise.” “I would think that would be akin to Prince Andrew testifying about his relationship with Jeffrey Epstein, which one British critic said was like an airplane crashing into an oil tanker causing a tsunami that set off a nuclear explosion,” Wallace noted, in reference to the British royal’s controversial interview with the BBC over the weekend in which he attempted to defend his relationship with the late billionaire pedophile Epstein. “It’s an entertaining thing and it certainly got us all talking,” Wallace added. “But my guess is it’s not gonna happen and if it did, it would be a very controversial and unwise policy by the president.” Check out the clip here: CNN’s Anderson Cooper on Monday similarly expressed doubt that Trump would testify in the inquiry against himself. “If he doesn’t know that you and I know that he knows he isn’t going to ever testify, then he must think we are all idiots,” he claimed.",
      "date": "11/20/2019 03:46 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9IlXuNtpdOmAANNpsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610798/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2ffiona-hill-impeachment-inquiry_n_5dd6b96fe4b0e29d72808ce5/RK=2/RS=MSVylN8qJP6PN9RIQO75HrWbVyM-",
      "url": "Fiona Hill Shoots Down GOP Conspiracy Theories, Says ‘Our Nation Is Being Torn Apart’",
      "subtitle": "The former National Security Council official challenged theories that Ukraine, not Russia, meddled in 2016 election",
      "author": "Paul Blumenthal",
      "content": " Fiona Hill, the former top National Security Council official for Europe and Russia under President Donald Trump, warned the House Intelligence Committee against spreading what she called false conspiracy theories that Ukraine interfered in the 2016 election during her impeachment inquiry testimony on Thursday. “Some of you on this committee appear to believe Russia and its security services did not conduct a campaign against our country — and that perhaps, somehow, for some reason, Ukraine did,” Hill said. Committee Republicans have endorsed numerous unfounded theories that Ukraine interfered in the 2016 election. Specifically, Rep. Devin Nunes (R-Calif.) has suggested that the “black ledger” that revealed millions in hidden payments by the government of deposed President Viktor Yanukovych to Trump’s former campaign manager Paul Manafort is a potential forgery. Trump has also endorsed conspiracy theories that Ukraine, not Russia, hacked the Democratic National Committee servers and is presently hiding the server in Ukraine. These theories have all been disproven and Manafort was convicted in federal court of receiving illicit payments from Ukraine. On the July 25 call with Ukrainian President Volodymyr Zelensky, Trump asked Zelensky to “find out what happened with this whole situation with Ukraine, they say CrowdStrike,” referencing the private firm that investigated the DNC hack. Trump incorrectly claimed that CrowdStrike was funded by Ukrainian oligarchs and that the DNC server was in Ukraine. “The server, they say Ukraine has it,” Trump said. Hill described the theories pushed by committee Republicans as a “fictional narrative” that aims to implicate Ukraine and not Russia as the country that interfered in the 2016 election. She added that these disproven theories Trump floated to Ukrainian President Volodymyr Zelensky in the July 25 call were false. “Our nation is being torn apart,” Hill said. “Truth is questioned. Our highly professional, expert career foreign service is being undermined.” The conspiracy theories endorsed by Trump and committee Republicans are designed to muddy the waters about Russian interference in the 2016 election. Hill said that the Russian government supports these theories and that they have gained traction in some quarters of the U.S. independent of that support. She argued that the goal of Russia’s interference in 2016 and continued disinformation campaigns was to “delegitimize our entire presidency.” “The goal of the Russians was to really put whoever became the president [in 2016] … under a cloud,” Hill said. For Trump, that cloud is allegations that he was involved in the efforts by Russian intelligence to interfere in the election. But had former Secretary of State Hillary Clinton, who was the target of said interference campaign, won the election, Hill noted, “She too would have had major questions about her legitimacy.” Hill noted that representatives of other countries, including perhaps Ukraine, may have “had harsh words for candidates” in 2016, but these statements did not add up to a concerted campaign to influence the outcome of the election. “I refuse to be part of an effort to legitimize an alternate narrative that the Ukrainian government is a U.S. adversary, and that Ukraine, not Russia, attacked us in 2016,” Hill said. “These fictions are harmful even if they are deployed for purely domestic political purposes.”",
      "date": "11/21/2019 12:22 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9IlXuNtpdOmAAMtpsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610798/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fbarack-obama-donald-trump-chill-out_n_5dd7557ee4b0d50f328cb61c/RK=2/RS=M8u26bR3GZy5WKJvxZSLTKlihWk-",
      "url": "Obama Warns Democrats To 'Chill Out' And Focus On Trouncing Trump",
      "subtitle": "“The choice is so stark and the stakes are so high you cannot afford to be ambivalent,” the former president warned at a California fundraiser.",
      "author": "Mary Papenfuss",
      "content": " Former President Barack Obama told donors at a pricey Silicon Valley fundraiser Thursday that Democrats need to “chill out” about the crowded Democratic presidential field and be prepared to fully back the eventual nominee in order to beat Donald Trump in 2020. “The field will narrow and there’s going to be one person, and if that is not your perfect candidate ... I don’t care. The choice is so stark and the stakes are so high you cannot afford to be ambivalent,” Obama told about 100 people at a private home in Los Altos Hills, CNN reported. The former president’s advice followed his warning last month to the “politically woke” not to be such purists. Last week, he urged Democrats to be “rooted in reality.” The “average American doesn’t think we have to completely tear down the system and remake it,” he said. At the fundraiser, Obama cautioned that “flaws are magnified” during primaries and debates. “There will be differences,” but they are “relatively minor” compared to beating Trump, he argued. “Everyone needs to chill out about the candidates, but gin up about the prospect of rallying behind whoever emerges from this process, and making sure we’re hitting the ground running,” Obama urged. “The ultimate goal is to defeat a president and a party that has, I think, taken a sharp turn away from a lot of the core traditions and values and institutional commitments that built this country,” he said. Obama seemed pleased about the diversity of the Democratic field but acknowledged the challenges some candidates may face. “We have a number of women candidates, and we have one gay candidate, and those candidates will have barriers if they win the nomination, just like I did,” he said. Tickets for the event, which benefited the Democratic National Committee’s Democratic Unity Fund, ranged from $10,000 to $355,000. The top ticket-holders got to attend a VIP reception with Obama.",
      "date": "11/22/2019 12:07 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9IlXuNtpdOmAAMNpsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610798/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fdavid-holmes-offers-new-details-of-trump-and-sondlands-call-about-ukraine_n_5dd6b170e4b0e29d72805e72/RK=2/RS=vwwsSLozNk2sydJkR2DL3Wa5Lh4-",
      "url": "David Holmes Offers New Details Of Trump And Sondland's Call About Ukraine",
      "subtitle": "The State Department official overheard a conversation about investigations into the Bidens.",
      "author": "Sara Boboltz",
      "content": " David Holmes had “never seen anything like” it. Holmes, a State Department official with the U.S. Embassy in Ukraine, shared new details on Thursday about the phone conversation between President Donald Trump and U.S. Ambassador to the European Union Gordon Sondland that he overheard this summer at a restaurant in Kyiv. “This was a very distinctive experience,” Holmes told House investigators conducting the impeachment hearing, explaining how the moment stood out against the backdrop of his foreign service career. He recounted the July 26 episode, in which he was seated directly across the table from Sondland on an outdoor terrace with two other aides. His testimony fleshed out a clearer picture of Trump’s dealings with Ukraine, which kicked off the impeachment inquiry back in September. “Someone at a lunch in a restaurant making a call on a cellphone to the president of the United States, being able to hear his voice, his very distinctive personality — we’ve all seen him on television,” Holmes said. Holmes was able to hear much of the discussion simply because Trump’s voice was very loud, he said in his prepared remarks, confirming a previously reported detail. He said Sondland “held the phone away from his ear for a period of time, presumably because of the loud volume.” Trump, meanwhile, tweeted that he has “never” been able to hear a conversation not set to speakerphone, boasting that his hearing is “great.” At the restaurant, Sondland told the president that he was calling from Kyiv, at which point the president “clarif[ied]” that Sondland was calling from Ukraine, according to Holmes. (Kyiv is the capital city of Ukraine.) The ambassador then told Trump that Ukrainian President Volodymyr Zelensky “loves your ass,” Holmes said. (The remarks use an alternate spelling of Zelensky’s name.) Holmes continued: I then heard President Trump ask, “So, he’s gonna do the investigation?” Ambassador Sondland replied that “he’s gonna do it,” adding that President Zelenskyy will do “anything you ask him to.” Even though I did not take notes of these statements, I have a clear recollection that these statements were made. What Holmes heard stood out to him because of its relevance to his work. Just one day earlier, on July 25, Trump had asked Zelensky to “do us a favor” and look into the conspiracy theory that it was Ukraine, not Russia, that interfered in the 2016 election for the benefit of Hillary Clinton, not Trump. He also asked Zelensky to investigate Burisma, an energy company that once had Joe Biden’s son Hunter as a board member. Trump appeared to believe that the Bidens were involved in corruption in Ukraine ― and that an investigation announcement would hurt Joe Biden’s 2020 presidential campaign. Although Holmes did not read a transcript of the July 25 call until its public release in September, he had been hearing about the proposed investigations. For one, Trump’s personal attorney Rudy Giuliani had brought up the conspiracy theories on national television several times over the previous months. “[Sondland and Trump] were directly addressing something I had been wondering about, working on, for weeks and even months. A topic that had led to the recall of my former boss, the former ambassador,” Holmes said, referring to former U.S. Ambassador to Ukraine Marie Yovanovitch, who was abruptly fired earlier this year. Yovanovitch said in public testimony last week that she believed she was fired for pushing back on the Trump administration’s efforts to launch an investigation into the Bidens in Ukraine. According to Holmes, Sondland and Trump then pivoted the discussion to rapper A$AP Rocky’s legal troubles in Sweden, where he was held for assault. Sondland said Trump should “let him get sentenced, play the racism card, give him a ticker-tape when he comes home,” Holmes recalled. “You can tell the Kardashians you tried,” Sondland added, according to Holmes. After the call ended, Sondland told Holmes that Trump had been in a “bad mood,” as was “often the case early in the morning.” He went on to testify that Sondland agreed Trump did not “give an expletive” about Ukraine. “I asked why not,” Holmes said, “and Ambassador Sondland stated that the President only cares about ‘big stuff.’ I noted that there was ‘big stuff’ going on in Ukraine, like a war with Russia, and Ambassador Sondland replied that he meant ‘big stuff’ that benefits the President, like the ‘Biden investigation’ that Mr. Giuliani was pushing.” Holmes’ testimony ― concurrent with National Security Council adviser Fiona Hill’s ― is scheduled to be the last given this week in the impeachment inquiry, following public hearings with a number of other high-level officials.",
      "date": "11/21/2019 01:14 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9IlXuNtpdOmAALtpsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610798/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2flate-shows-donald-trump-impeachment-hearing_n_5dd63a2de4b0e29d727ef7d9/RK=2/RS=SP6WaMsbV9XCGI5AfaTG.ecS8aA-",
      "url": "Late Shows Unpack 'What Could Be Most Devastating Day' Of Donald Trump's Presidency",
      "subtitle": "Stephen Colbert, Samantha Bee, Seth Meyers, Jimmy Kimmel, Trevor Noah, Jimmy Fallon and James Corden all riffed on the latest impeachment inquiry developments.",
      "author": "Lee Moran",
      "content": " The comedians of late-night TV all riffed on the same theme on Wednesday. Namely, European Union Ambassador Gordon Sondland’s testimony during a public hearing in the impeachment investigation into Donald Trump in which he directly implicated the president and members of his administration in the Ukraine scandal. Samantha Bee of “Full Frontal” claimed to have “impeachment fever.” “The Daily Show with Trevor Noah” imagined Trump’s impeachment hearing audition: Jimmy Kimmel said it could have been “one of the most interesting and important days in the modern political history of our country” as he recruited comedian Jeff Ross to jump into character as Sondland. “The Late Show” host Stephen Colbert broke down Sondland’s bombshell in the latest installment of “Don and the Giant Impeach.” He also aired this spoof A$AP Rocky clip: Alex Wagner and John Heilemann, hosts of Showtime’s “The Circus,” also commented on the testimony with Colbert: Seth Meyers of “Late Night” unpacked what could have been “the most devastating day” of the Trump presidency. “The Tonight Show” host Jimmy Fallon reflected on “the wild day” in Washington: And “The Late Late Show” host James Corden cracked a “Real Housewives”-themed gag:",
      "date": "11/21/2019 02:47 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9IlXuNtpdOmAALNpsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610798/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fdavid-holmes-trump-impeachment-ukraine-sondland_n_5dd6a333e4b0e29d72802a0f/RK=2/RS=qve.d7yO.cY_KZu2AIHuN0seD3M-",
      "url": "Diplomat David Holmes Outlines Corruption, Hypocrisy Of Trump’s Ukraine Shakedown",
      "subtitle": "“This was a demand that President Zelensky personally commit, on a cable news channel, to a specific investigation of President Trump’s political rival.”",
      "author": "",
      "content": "WASHINGTON ― The career foreign service official who overheard President Donald Trump speaking with his donor-turned-ambassador about investigations that would benefit Trump’s political campaign said Thursday that the Trump administration’s effort to pull the Ukrainian government into American politics made United States government officials look like hypocrites. David Holmes, testifying before the House Intelligence Committee, pointed out the irony in the U.S. government pushing the Ukrainians to operate with integrity while the president of the United States and his personal attorney pushed Ukrainian President Volodymyr Zelensky to take actions to damage former Vice President Joe Biden, who Trump considered his chief political rival. “While we had advised our Ukrainian counterparts to voice a commitment to following the rule of law and generally investigating credible corruption allegations, this was a demand that President Zelensky personally commit, on a cable news channel, to a specific investigation of President Trump’s political rival,” Holmes testified Thursday. “They can recognize hypocrisy when they see it?” House Intelligence Committee Chairman Rep. Adam Schiff (D-Calif.) asked Thursday. “It’s hard to explain why we would do that,” said Holmes. It was Holmes who recalled hearing a phone call between Trump and Gordon Sondland, the Trump donor turned diplomat who others placed at the center of the impeachment scandal. This conversation came a day after Trump’s July 25 phone call with Zelensky, in which Trump pressed his counterpart to investigate Hunter Biden, the son of Trump’s 2020 presidential rival. Holmes told impeachment investigators on Thursday that Trump was talking so loudly on the call that Sondland had to hold the phone away from his ear. During the conversation, which took place at a restaurant in Ukraine, according to Holmes, Sondland told Trump that Zelensky “loves your ass,” and the U.S. president responded, “So, he’s going to do the investigation?” “He’s going to do it,” Sondland responded, according to Holmes. The phone call is yet more evidence that Trump was directly involved in pressuring the Ukrainian government to open investigations into the Bidens. During Wednesday’s impeachment hearing, Sondland said that “we followed the president’s orders” on Ukraine. Trump reacted in real time on Thursday morning as Holmes delivered a lengthy opening statement on Capitol Hill. The president argued on Twitter that it would be difficult to overhear a conversation while someone was not on speakerphone, at least from his personal experience. “Never have I been watching a person making a call, which was not on speakerphone, and been able to hear or understand a conversation. I’ve even tried, but to no avail,” 73-year-old Trump, who is known for talking loudly, wrote in a tweet, urging his followers to try for themselves. Holmes, meanwhile, testified that it was difficult to forget such a “distinctive experience.” “I’ve never seen anything like this in my foreign service career,” he said Thursday, referring to hearing the president’s conversation with Sondland. “Very colorful language was used. They were directly addressing something I had been working on for weeks, months.” Sondland did not recall the details of the conversation when asked about it on Wednesday, but he also didn’t dispute Holmes’ account. When asked about the “loves your ass” remark recalled by Holmes, Sondland said it sounded “like something I would say... That’s how President Trump and I communicate — a lot of four-letter words.” In her testimony before the committee, former Senior Director for Europe and Russia on the National Security Council Fiona Hill asserted that any talk that Russia did not target the U.S. during the 2016 elections “is a fictional narrative” promoted by Russian forces. Trump and his Republican defenders have repeatedly pushed the baseless theory that Ukraine was to blame instead. Thursday’s proceedings capped off the second week of public impeachment hearings that featured bombshell testimony from nine witnesses who shed new light on Trump’s attempted quid pro quo with Ukraine. Their accounts dismantled nearly every argument Republicans had mounted in defense of the president, implicating him and other senior Trump administration officials in the scheme. Despite this, Trump and GOP lawmakers continue to insist the president did nothing wrong by seeking dirt on a political rival by holding up financial assistance to Ukraine. The impeachment inquiry is expected to pause next week as Congress leaves town for the Thanksgiving holiday, and pick up again next month in the House Judiciary Committee.",
      "date": "11/21/2019 11:27 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9IlXuNtpdOmAAKtpsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610798/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2ftrump-fox-friends-kellyanne-conway_n_5dd80854e4b0913e6f6b8866/RK=2/RS=8.d4HWMIlq.g3CnN8jhryWNOvVc-",
      "url": "Trump Blames Kellyanne Conway For Turning Husband Into 'Total Whack Job'",
      "subtitle": "The president told “Fox & Friends” that she must have “done some bad things” to George Conway “because that guy is crazy.”",
      "author": "David Moye",
      "content": " It’s no shocker that President Donald Trump isn’t fond of George Conway, his constant Twitter critic and husband of White House strategist Kellyanne Conway. What is shocking is how far he was willing to go to express his displeasure during his already careening “Fox & Friends” interview on Friday morning. It began when co-host Ainsley Earhardt asked the president about George Conway’s recent assertion that Nikki Haley, the former U.S. ambassador to the United Nations, was setting herself up to be Trump’s next vice president. “First of all, Kellyanne is great,” Trump said. “She is married to a total whack job. She must have done some number on him. I don’t know what Kellyanne did to that guy because I don’t even know him. I met him for a second. The president continued to throw his loyal adviser’s husband and marriage under the bus. “He’s got to be some kind of a nutjob because she must have done some bad things to him because that guy is crazy,” Trump said. Eventually, he got around to saying, “Mike Pence is a great vice president — he’s our man.” George Conway responded to the president’s remarks with two tweets suggesting that people consider Trump’s legacy. The exchange can be watched here, and also below thanks to Haley, who, in a master class on shade, posted it on Twitter, making sure, of course, to “thank” the president for “putting the silly rumors to rest.”",
      "date": "11/22/2019 01:07 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9IlXuNtpdOmAAKNpsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610798/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fkennedy-advocated-kavanaugh-supreme-court_n_5dd73469e4b0d50f328c8a78/RK=2/RS=78ZIlpX_8H4HQdecLOVVE.DjaPM-",
      "url": "Anthony Kennedy Advocated For Kavanaugh To Fill His Supreme Court Seat, Book Says",
      "subtitle": "The former Supreme Court justice reportedly pulled President Trump aside in 2017, saying his former clerk should be added to the list of potential nominees.",
      "author": "Nick Visser",
      "content": " Former Supreme Court Justice Anthony Kennedy personally lobbied President Donald Trump to add Brett Kavanaugh to his list of potential replacements when he was preparing for his retirement, according to a new book set to be released next month. The Washington Post first reported details of a secret meeting between Kennedy and Trump in 2017, shortly after the then-justice swore in the president’s first appointee to the nation’s highest court, Neil Gorsuch. During the conversation, Kennedy reportedly told Trump he should consider adding Kavanaugh, one of his former clerks, to his list of potential nominees. Kavanaugh hadn’t been on Trump’s first two lists of candidates. The account will be published in Washington Post editor Ruth Marcus’ forthcoming book, “Supreme Ambition: Brett Kavanaugh and the Conservative Takeover,” which will be released on Dec. 3. Trump ultimately chose Kavanaugh as his second Supreme Court nominee, although the battle over Kavanaugh’s confirmation became one of the biggest flashpoints of Trump’s tenure in the White House up to that point. The judge’s nomination was highly contentious after his former schoolmate, Christine Blasey Ford, came forward with allegations that Kavanaugh sexually assaulted her at a party when they were growing up. Kavanaugh denied the allegations, breaking down in tears at times and angrily defending himself during his confirmation hearing. He was later confirmed by a near party-line vote of 50-48 in the Senate in 2018. Marcus also wrote that Kavanaugh had significant backing within the White House as Trump was considering the potential replacements for Kennedy’s seat. Both then-White House counsel Don McGahn and former President George W. Bush reportedly advocated behind the scenes for the judge. The author also wrote that an anonymous source told her Kavanaugh “had the most intense lobbying campaign inside and outside the White House.” “He had the biggest batch of fierce defenders I’ve ever seen in any kind of political fight in my life,” said the source, Marcus reported. That support for Kavanaugh was not universal, Marcus wrote, as some wondered if Kavanaugh wasn’t conservative enough. Others, including Trump’s daughter Ivanka Trump and son-in-law Jared Kushner, strongly advocated that the president choose another candidate after Ford’s allegations were made public. But Trump stood his ground and has continued to tout his tapping of Kavanaugh at campaign rallies as one of his most notable accomplishments in office. Read the Post’s full story on the book here.",
      "date": "11/21/2019 09:15 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9DtzsNtpdDNIAtklsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610796/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fpete-souza-donald-trump-notes-impeachment_n_5dd64f5ee4b0fc53f20e2a1e/RK=2/RS=98TEzH8Osh9gsc2oPSlSm.L4qWY-",
      "url": "Obama Photographer Taunts Donald Trump With Throwback Handwritten Notes Snap",
      "subtitle": "Pete Souza compared Trump’s notes with Obama’s.",
      "author": "Lee Moran",
      "content": " Obama-era White House photographer Pete Souza poked fun at Donald Trump on Instagram by comparing the current president’s handwritten notes to those of his predecessor. Souza on Thursday shared the now-viral image of Trump’s super-sized notes as he answered reporters’ questions on EU Ambassador Gordon Sondland’s impeachment hearing testimony with “an almost identical image I made of President Obama a few years ago.” Scroll across to see the difference: Souza called the picture of Trump’s notes, taken by Getty Images’ Mark Wilson, a “great storytelling image.” The photo itself became a meme on Twitter and also inspired this spoof emo-style song: Souza frequently resurfaces photographs he took during his time with the Obama administration to take aim at Trump (who he calls “comrade minus”) and his administration. “Nine years ago today: when the only concern was whether President Obama would try to drive the electric car he was sitting in during a demonstration at the NATO Summit at the Feira International de Lisboa in Portugal,” Souza captioned the image, below, earlier this week:",
      "date": "11/21/2019 04:20 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9DtzsNtpdDNIAtElsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610796/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2ftrump-pays-respects-to-army-officers-killed-in-afghanistan_n_5dd76646e4b0913e6f696c2e/RK=2/RS=9dc75iFDxS5QYUpVk6uTEkJNQ6c-",
      "url": "Trump Pays Respects To Army Officers Killed In Afghanistan",
      "subtitle": "Trump traveled to Dover Air Force Base to offer condolences to the families of Chief Warrant Officer 2 David C. Knadle, and Chief Warrant Officer 2 Kirk T. Fuchigami Jr., 25.",
      "author": "",
      "content": "DOVER AIR FORCE BASE, Del. (AP) — President Donald Trump paid respects Thursday to two Army officers who were killed when their helicopter crashed this week in Afghanistan, holding his salute until each of the flag-draped cases containing their remains were returned to their grieving families. Trump and his wife, Melania, traveled to Dover Air Force Base to offer condolences to the families of Chief Warrant Officer 2 David C. Knadle, 33, and Chief Warrant Officer 2 Kirk T. Fuchigami Jr., 25. The president and first lady led a group of dignitaries that included Joint Chiefs of Staff Chairman Mark Milley and National Security Adviser Robert O’Brien. Trump and members of the military saluted and civilians placed a hand over their hearts as a carry team of six white-gloved members of the Army’s Old Guard executed the delicate task of transferring the remains from a vehicle the military referred to as a ramp to a waiting vehicle, one case at a time. Trump has said witnessing the dignified transfer of service members’ remains is “the toughest thing I have to do” as president. As the final day of public hearings in the House impeachment inquiry wound down, Trump left the White House for the short flight to the Delaware military base, where the remains of service members killed abroad are returned to U.S. soil. Knadle, of Tarrant, Texas, and Fuchigami Jr., of Keaau, Hawaii, died Wednesday when their helicopter crashed as they provided security for troops on the ground in Logar Province in eastern Afghanistan. Both were assigned to Fort Hood, Texas. Wednesday’s crash brought this year’s U.S. death toll in Afghanistan to 19, excluding three noncombat deaths. The Taliban claimed responsibility for shooting down the helicopter, but the U.S. military has dismissed that as a false claim. The crash remains under investigation. Trump broke off peace talks with the Taliban in September after a bombing in Kabul that killed 12 people, including an American soldier. Trump and Afghan President Ashraf Ghani spoke on the phone Thursday, the White House announced, and both “agreed a reduction in violence is necessary to move the peace process forward” and for all-Afghan negotiations regarding a political settlement to be successful. The president also thanked Ghani for his support in seeking the release of two Western hostages the Taliban freed this week after holding them in captivity for more than three years, said spokesman Judd Deere. More than 2,400 Americans have died in the nearly 18-year war. Last month, as Trump sought to justify his unpopular decision to remove a small contingent of U.S. service members from northeastern Syria, he began to describe his experiences at Dover and argue for removing the U.S. from “endless wars” in the Middle East, which he campaigned on in the 2016 presidential race. The president has described the sight of cavernous aircraft pulling up on the base, doors opening, uniformed service members carrying flag-draped “transfer cases” and once-stoic parents breaking down. “Sometimes they’ll run to the coffin. They’ll break through military barriers,” Trump said at an unrelated White House event on Oct. 9. “They’ll run to the coffin and jump on top of the coffin. Crying mothers and wives. Crying desperately.” “And this is on these endless wars that just never stop,” he said. “And there’s a time and there’s a place, but it’s time to stop.” Nothing like the scene Trump described took place at Thursday’s ceremony. The families were kept out of sight of the news media. Trump was also joined by Deputy Defense Secretary David Norquist, Army Secretary Ryan McCarthy, Army Sgt. Major Michael Grinston and actor Jon Voight. Trump awarded the Oscar-winning actor the prestigious National Medal of Arts at a White House ceremony earlier Thursday. Voight said in Delaware that Trump invited him to come along if he wanted to. Voight said he did not meet the families but watched from a distance as the soldiers’ remains were transferred. He said he accompanied the president because “I just wanted to pay my respects, say a little prayer.” Thursday’s trip was Trump’s second to the Delaware military base this year, and his third visit there overall as president. Trump went to the base in January 2019 for the return of four Americans who were killed in a suicide bomb attack in Syria. He attended his first transfer service in February 2017, for the return of a Navy SEAL who was killed during a raid on an al-Qaida compound in Yemen. ___ Follow Darlene Superville on Twitter: http://www.twitter.com/dsupervilleap",
      "date": "11/21/2019 11:47 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9DtzsNtpdDNIAsklsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610796/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fdonald-trump-impeachment-kitchen-table-issues-atlanta-democratic-debate-2020-presidential-primary_n_5dd60d69e4b0e29d727ebbf9/RK=2/RS=rouXKhCg5B3db0pRqw.DSb3KPdI-",
      "url": "Donald Trump And Impeachment Cast Shadow Over Democratic Presidential Debate",
      "subtitle": "Time and again, moderators pushed candidates on how to handle Trump and the aftermath of his presidency.",
      "author": "Daniel Marans",
      "content": " Democratic presidential candidates have tried to avoid dwelling on President Donald Trump and the impeachment process on the campaign trail ― and voters in the early primary and caucus states have largely obliged them. But on Wednesday night, the president, the scandal rapidly engulfing his administration and the effect he has had on the country’s political culture exerted influence on the fifth Democratic presidential debate in Atlanta. More than in previous debates, the moderators ― from MSNBC and The Washington Post ― pushed the candidates back, time and again, to the matter of how to handle Trump and the aftermath of his presidency. And the candidates, prepared as they were to stress their preferred policy issues, found creative ways to bring the conversation back to their core message. Sen. Elizabeth Warren’s response to the first debate question about how she would cajole her Republican colleagues into throwing Trump out of office in an impeachment trial in the Senate was a case in point. After dispensing with the question quickly ― she would recommend that they read special counsel Robert Mueller’s report on Trump’s conduct ― Warren pivoted to her anti-corruption message. The senator from Massachusetts noted that the Trump administration’s European Union ambassador, Gordon Sondland, whose explosive testimony in the House on Wednesday prompted discussion of impeachment, had received his post because he donated $1 million to Trump’s inauguration. Warren reminded the audience that she has promised not to grant diplomatic posts to campaign donors and invited her fellow candidates to make that promise as well. “I asked everyone who’s running for president to join me in that, and not a single person has so far,” she declared. “I hope what we saw today during the testimony means lots of people will sign on and say we are not going to give away these ambassador posts to the highest bidder.” Other candidates, such as Sen. Amy Klobuchar of Minnesota, relished the opportunity to wax lyrical about the grand stakes of holding Trump accountable. “What this impeachment proceeding about is really our democracy at stake,” Klobuchar said. “This is a president that not only with regard to his conduct with Ukraine but every step of the way puts his own private interests, his own partisan interests, his own political interests in front of our country’s interest, and this is wrong.” After the exchange on impeachment, Trump reappeared in the debate several minutes later in the form of a discussion about polarization. Asked whether it was appropriate for supporters of Sen. Bernie Sanders (I-Vt.) to chant “Lock him up” about Trump at his rallies, Sanders declined to condemn such conduct. “The people of this country are catching on to the degree that this president thinks he is above the law,” Sanders said.  “And what the American people are saying, ‘Nobody is above the law.’” Former Vice President Joe Biden would not say if, once Trump is out of office, he would prosecute the former president or decline to do so to avoid reigniting the country’s partisan tensions. He insisted that it would be up to his Department of Justice, which would function independently. But, in keeping with his self-styled image as a healer and unifier, Biden condemned, unprompted, the chants of “Lock him up” heard at Sanders rallies. “Look, we have to bring this country together. Let’s start talking civilly to people,” Biden said. Thanks in part to the moderators’ crisp, personalized questions and balanced form of skepticism, the debate featured far fewer fireworks among the four poll leaders ― Warren, Sanders, Biden and South Bend, Indiana, Mayor Pete Buttigieg ― than previous rumbles. Warren, who has struggled for weeks to shake off questions about the evolving details of her “Medicare for All” plan, got a chance to refocus the discussion on what she sees as the benefits of it. And both Biden and Buttigieg made their case that her plan would be too coercive and unrealistic. But, unlike in previous debates, the exchange did not last more than a few minutes and did not devolve into an extended back and forth. Instead, candidates got the chance to discuss a number of other kitchen-table economic issues that had received shorter shrift in previous forums, including paid family leave, child care and housing. Warren, whose sweet spot is precisely in these areas, got the chance to discuss her wealth tax at length and how it would generate revenue for universal child care and preschool. “I’m tired of freeloading billionaires. I think it’s time that we ask those at the very top to pay more so that every single one of our children gets more,” she declared. The fast-moving yet substance-heavy format was particularly forgiving for candidates whose low standing in the polls gave them something extra to prove on Wednesday night. Sen. Kamala Harris of California got the chance to discuss her paid family leave plan, which she said was tailored to accommodate parents who have children later in life. The six-month duration of her new benefit, she said, is deliberately generous to account for the fact that parents of young children in their 30s and 40s may also be caring for their aging parents, and that this dual obligation falls disproportionately on women. “Many women are having to make a very difficult choice: whether they’re going to leave a profession for which they have a passion to care for their family, or whether they are going to give up a paycheck that is part of what that family relies on,” she said. Sen. Cory Booker of New Jersey, one of four candidates onstage Wednesday who has yet to qualify for the next debate in December, came in determined to make a splash. Although in previous showdowns he has stuck to a kind of Goldilocks liberalism somewhere to the left of Biden and to the right of Warren and Sanders, Booker leaned into the business-friendly inclinations that defined the earlier stages of his career. He cut Warren off during a discussion of her wealth tax, calling it “cumbersome” and insisting the country could raise revenue from the wealthy through other means. He also faulted Democrats for failing to adequately encourage entrepreneurship in favor of seeking to cut the superrich down to size. “We as Democrats have got to start talking not just about how we tax from a stage but how we grow wealth in this country amongst those disadvantaged communities that are not seeing it,” he said. His most memorable moment, though, was a progressive one: when he pressed Biden to account for his opposition to marijuana legalization, which Booker said disproportionately harms African Americans. Biden said on Saturday that he would allow states to proceed with legalization experiments but would refrain from legalizing it federally because of his concern that it is a “gateway drug” to the use of more serious substances. “I thought you might have been high when you said it,” Booker joked.  “Marijuana, in our country, is already legal for privileged people.” But it was Biden’s meandering response, defending his credibility on racial justice by pointing to the depth of his support among Black voters, that proved the most startling element of the exchange. Biden noted that former Sen. Carol Moseley Braun of Illinois has endorsed him but incorrectly called her the “only” Black woman to serve in the Senate. (She was the first, but not the only one.) Booker and Harris interjected. “The other one is here,” Harris said with a chuckle, referring to herself. In the end, though, the conversation invariably turned back to Trump, who has become something of a lens through which Democratic presidential hopefuls articulate their theories for effecting positive change. Warren and Sanders diagnose Trump as a symptom of underlying public disenchantment with a corrupt, rigged political system and economy, and promise to bring a fighting spirit and grassroots movement to bear on the ossified levers of power so government can work again for ordinary people. They see unity as the byproduct of this progress, which is likely to be more painful still, rather than a precursor. “If you want to be part of a movement that is not only going to beat Trump but transform America, that doesn’t have a super PAC, doesn’t do fundraisers at wealthy people’s homes, please join us at BernieSanders.com,” Sanders said in his concluding remarks. Biden, Buttigieg and Booker, by contrast, see their roles as calming agents whose first order of business would be easing the national acrimony that has escalated under Trump. Buttigieg, who spoke about the need for a president capable of unifying the country when the “sun comes up” and Trump is not president anymore, has been vague about how exactly he plans to overcome the combined forces of entrenched Republican opposition ― even if then the Senate is narrowly controlled by Democrats ― and the deep-pocketed resistance of corporate special interests to top Democratic priorities. He did not get any more specific on Wednesday night, falling back instead on his claim that “we are now in a different reality than we were even 12 years ago,” shortly before former President Barack Obama took office. “There is an American majority that stands ready to tackle big issues that didn’t exist in the same way, even a few years ago,” he said, while neglecting to note that bills that poll well routinely die in today’s hyper-partisan, special interest-infested Congress. But for perhaps the first time in any of the debates, the moderators pressed Biden to explain why exactly he expects Republican lawmakers, who continue to resist holding Trump accountable, to treat him any differently than they treated Obama. Biden responded by suggesting that he is the candidate best poised to create coattails for maintaining the Democratic majority in the House and regaining one in the Senate. “You have to ask yourself up here: Who is most likely to be able to win the nomination in the first place, to win the presidency in the first place?” he said. “And, secondly, who is most likely to increase the number of people who are Democrats in the House and in the Senate?” This article has been updated throughout with more comments during the debate.",
      "date": "11/20/2019 11:33 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9DtzsNtpdDNIAsElsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610796/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2ftrump-corruption-ukraine-republicans_n_5dd807e0e4b0d50f328ed693/RK=2/RS=MwfrbfUVqEn5vh2Wzk7bHaZzL3E-",
      "url": "Republicans Insist That No, Really, Trump Cares Deeply About Corruption Everywhere",
      "subtitle": "It’s not just about the Bidens in Ukraine, GOP lawmakers say.",
      "author": "",
      "content": "WASHINGTON ― A key Republican defense of President Donald Trump is that the cadre of diplomatic witnesses are simply mistaken that he tried to extort Ukraine into announcing a sham investigation of former Vice President Joe Biden. Their truth is that Trump was just fighting corruption. “President Trump had good reason to be wary of Ukrainian election meddling against his campaign and of widespread corruption in that country,” Rep. Devin Nunes (R-Calif.) said at Thursday’s impeachment hearing. But ask Republican lawmakers if they’ve ever heard Trump express an interest in rooting out corruption in other countries, or even mention corruption in Ukraine before Biden got into the 2020 Democratic presidential race this April, and their minds go blank. “If the subject was Ukraine, he’s expressed his concern about corruption in Ukraine, which everybody understood was endemic ― including [Ukrainian] President [Volodymyr] Zelensky, who won. So I haven’t talked to the president about other countries where that might have come up,” said Sen. Ron Johnson (R-Wis.), who serves as chairman of the Senate Foreign Relations Subcommittee on Europe and Regional Security Cooperation and as vice chair of the Senate Ukraine Caucus. “You mean other than what I’ve heard over the news? We’ve never had that discussion,” said Sen. Mike Braun (R-Ind.), another fierce ally of the president. In 2016, Trump campaigned on “draining the swamp” in Washington, shorthand for cleaning up the government and chasing away lobbyists. But he’s been one of the swampiest presidents of all time, refusing even to take the most basic step of divesting from his private business. When foreign dignitaries travel to Washington, they line Trump’s pockets by staying at his hotel. And he’s shown an affinity for autocratic leaders of nations where corruption is rampant, like Russia, North Korea, China, Saudi Arabia and Turkey, turning a blind eye to the way they run their governments. After Biden jumped into the Democratic primary in April, however, Trump lawyer Rudy Giuliani suddenly began planning a trip to Kyiv, seeking to push the Ukrainian government to pursue investigations helpful to Trump ahead of his reelection campaign in 2020. It was those investigations that Trump urged Zelensky to advance in their July 25 phone call ― the call that is now the subject of the House impeachment inquiry. Rep. Mike Conaway (R-Texas), a senior member of the House Intelligence Committee who has voiced deep skepticism of the Democrats’ impeachment inquiry this week, argues that Republicans don’t have to prove that Trump actually cares about corruption. “Corruption within any country should be rooted out and having two heads of state agree on that seems to be, on its face, fine. So we don’t have to prove anything else,” Conaway said. Rep. Jim Jordan (R-Ohio), who is one of the president’s biggest defenders in Congress, said no when asked if he could point to other examples of Trump fighting corruption. “The focus has been on what happened in Ukraine,” Jordan said, adding that the president is skeptical of foreign aid, that Ukraine is deeply corrupt and that Ukraine’s new president had pledged to clean house. “So you couple all that together.” Other Republicans highlighted instances of foreign or domestic policy changes ― such as the reorganization of the Department of Agriculture ― that were not primarily about corruption. Rep. Chris Stewart (R-Utah), another Intelligence Committee member, pointed to the president’s March announcement that he would cut foreign aid to Honduras, Guatemala and El Salvador to try to stop migrants from coming to the U.S. “You’ve got nearly failed states and the reason is corruption,” Stewart said. Rep. Steve Scalise (R-La.), the second-ranking Republican in the House, said the president held up the aid not just because of corruption, but because he wanted to signal to other countries that they needed to help Ukraine as well. “Germany was an example where he was saying, look, the United States is helping but other countries need to step up too and help Ukraine,” Scalise said. “It wasn’t only about corruption. It was also about having other countries do more of their fair share.” It turns out that other countries have together helped Ukraine more than the U.S. has, and the Trump administration knows it. On Thursday, David Holmes, a political counselor to the U.S. Embassy in Ukraine, told the Intelligence Committee that the embassy researched the burden-sharing question in August. They told the White House that since 2014, the U.S. has provided Ukraine about $3 billion in aid, while European Union nations have provided a combined $12 billion. “If the concern was that others were not spending what we were to support Ukraine, that showed a different story,” Holmes said.",
      "date": "11/22/2019 12:27 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9DtzsNtpdDNIArklsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610796/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2famy-klobuchar-democratic-debate-women_n_5dd66312e4b010f3f1d30ccc/RK=2/RS=v8cdU9S0QurRo9b_80rM_rZqV8I-",
      "url": "Amy Klobuchar Dings Donald Trump With Democratic Debate Quip About Nancy Pelosi",
      "subtitle": "Klobuchar delivered the zinger while calling out the higher standard that women are held to.",
      "author": "Lee Moran",
      "content": " Sen. Amy Klobuchar (D-Minn.) dinged President Donald Trump during Wednesday’s Democratic debate as she called out the higher standard that women are held to. “If you think a woman can’t beat Donald Trump, (House Speaker) Nancy Pelosi does it every single day,” said the Democratic presidential candidate, eliciting cheers from the audience. Klobuchar’s dig at Trump came after she was asked to clarify a previous claim that rival Democratic hopeful Pete Buttigieg (the mayor of South Bend, Indiana) would not, with his political experience, be on the debate stage if he were a woman. “First of all, I’ve made very clear I think that Pete is qualified to be up on this stage, and I am honored to be standing next to him. But, what I said was true. Women are held to a higher standard,” Klobuchar responded. “Otherwise, we could play a game called name your favorite woman president, which we can’t do because it has all been men and including all vice presidents being men and I think any working woman out there, any woman who is at home, knows exactly what I mean,” she added. “We have to work harder, and that’s a fact.” Twitter users described the Trump-Pelosi line as “damn good” and “excellent.”",
      "date": "11/21/2019 05:57 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9DtzsNtpdDNIArElsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610796/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fdonald-trump-impeachment-fundraising-shaub_n_5dd8a2c8e4b0913e6f6cb4cc/RK=2/RS=HpJZvIS6ZXoKLWMjto0s8HS1q_Q-",
      "url": "Former Ethics Chief Slams 'Preposterous' Trump Fundraising For His Senate 'Jurors'",
      "subtitle": "Trump is also calling GOP lawmakers, having lunch with them and opening up Camp David for fun weekends as part of his impeachment “charm offensive.”",
      "author": "Mary Papenfuss",
      "content": " Walter Shaub, the former head of the U.S. Office of Government Ethics, is dumbfounded that President Donald Trump is cranking up his fundraising efforts on behalf of senators who will likely soon serve as his “jurors” in an impeachment trial. “The accused is helping jurors raise money,” Shaub tweeted, referring to the president and lawmakers. “Does it get any more preposterous that that?” Shaub, who served under former President Barack Obama and Trump, was reacting to a story in Politico last month headlined: “Trump Lures GOP Senators on Impeachment With Cold Cash.” Politico reported that Trump was using his fundraising clout to aid loyal senators facing tough reelection battles and who are backing a Republican resolution condemning the impeachment investigation as “unprecedented and undemocratic.” Earlier this week, Trump was relaxed and smiling with his Republican critics Sen. Mitt Romney (Utah) and Sen. Susan Collins of Maine, among the only three Republican senators who aren’t backing the anti-impeachment resolution. Romney called lunch with Trump on Thursday “delightful” — even though the president addressed the impeachment issue, according to the senator. The Washington Post also reported Friday that Trump has launched a “charm offensive” on lawmakers who could decide his future. Part of that campaign is inviting them to “play” at Camp David. The idea to use the presidential retreat to woo House Republicans came from acting chief of staff Mick Mulvaney as the impeachment inquiry got underway, according to the Post. Since then, Mulvaney and other top officials have hosted weekend getaways for Republicans, complete with campfires, hiking and shooting the breeze. Trump often phones in to talk to visiting lawmakers, the Post reported. Trump has met with or reached out to 100 House Republicans since the impeachment process began, while 50 of the 53 Senate Republicans have attended a White House lunch. More than 40 House Republicans have made the trip to Camp David, according to the Post. Though lawmakers are often blown away by a visit to the historic spot, Trump doesn’t get it, according to the newspaper. When Mulvaney first suggested the Camp David trips, the Post reported, Trump asked: “Who would want to go there?”",
      "date": "11/23/2019 01:01 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9DtzsNtpdDNIAqklsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610796/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2ftrump-fox-and-friends_n_5dd7eaeae4b00149f71b3a6c/RK=2/RS=QKrvfuhk1oU1oRNIu9K4mxgfX7o-",
      "url": "Trump Pushes Debunked Ukraine Theory In Long, Rambling Call To 'Fox & Friends'",
      "subtitle": "The nearly hourlong phone call on the president’s favorite morning show devolved into a soliloquy.",
      "author": "Marina Fang",
      "content": " President Donald Trump on Friday pushed a false right-wing conspiracy theory roundly debunked by U.S. officials — including during this week’s House impeachment hearings — among a cornucopia of false and nonsensical claims he made during a nearly hourlong phone call on “Fox & Friends.” Trump seized on false reports that Ukraine hacked into the Democratic National Committee’s server during the 2016 election. (U.S. intelligence officials have repeatedly affirmed it was Russia who interfered in the 2016 election.) “A lot of it had to do, they say, with Ukraine. They have the server, right? From the DNC,” he said. “That’s what the word is.” In damning testimony on Thursday, former National Security Council official Fiona Hill repeatedly urged Republicans to stop pushing the conspiracy theory. “I refuse to be part of an effort to legitimize an alternate narrative that the Ukrainian government is a U.S. adversary, and that Ukraine, not Russia, attacked us in 2016,” Hill said. “These fictions are harmful even if they are deployed for purely domestic political purposes.” Friday’s nearly hourlong interview devolved into a soliloquy, which frequently occurs when Trump calls into “Fox & Friends,” Fox News’ morning program that is typically friendly toward him. Trump rambled and mentioned, often without context, some of his favorite targets, including (but not limited to): “shifty” and “sick puppy” Rep. Adam Schiff (D-Calif.), who’s leading the House impeachment inquiry; House Speaker Nancy Pelosi (D-Calif.), whom Trump referred to as “a bedbug”; former FBI Director James Comey, whom he called “a totally disgusting human being”; and “the two lovers,” former FBI staffers Peter Strzok and Lisa Page. Even the “Fox & Friends” hosts seemed perplexed at times, trying to squeeze in questions for the president and get him back on track — to little avail. Co-host Ainsley Earhardt repeatedly tried to shift the conversation to the 2020 campaign, but Trump frequently brought it back to his grievances over the impeachment proceedings. When Trump finally did field questions on the Democratic primary field, he suggested former Vice President Joe Biden might not “make it mentally. He’s off.” Trump also revived his racial slur against Sen. Elizabeth Warren (D-Mass.), referring to her as “Pocahontas.” At times, the hosts attempted to push back on his false claims or ask him to clarify. Co-host Steve Doocy asked Trump to provide a source for his spurious assertion that former President Barack Obama’s administration “spied on my campaign.” Trump would not name a source. Doocy also debunked Trump’s false claim that only the U.S. gives aid to Ukraine, one of his defenses against the July 25 call to Ukraine’s president, which is at the center of the impeachment inquiry. More than 50 minutes into Friday’s phone interview, after asking about the president’s health, co-host Brian Kilmeade suggested Trump call into the program every week as a form of “stress relief.”",
      "date": "11/22/2019 09:58 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9DtzsNtpdDNIAqElsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610796/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fjohn-bolton-twitter-white-house-departure_n_5dd82c74e4b00149f71c5f72/RK=2/RS=HUzfcwYhgD2Re5S87GAjmLpbTXc-",
      "url": "John Bolton Hints He's Ready To Spill His 'Backstory' On White House Departure",
      "subtitle": "Trump’s former national security adviser claimed that the White House had previously “suppressed” his Twitter account.",
      "author": "Antonia Blumberg",
      "content": " President Donald Trump’s former National Security Adviser John Bolton says he’s ready to share the “backstory” of his departure from the White House. Bolton took to Twitter on Friday to tease his forthcoming story, claiming the White House had previously “suppressed” his Twitter account to prevent him from speaking out about the details surrounding his resignation in September. “Glad to be back on Twitter after more than two months,” Bolton tweeted. “For the backstory, stay tuned........” It wasn’t immediately clear how or why the White House would have prevented Bolton from posting on the social media platform until Friday. The White House did not immediately respond to a request for comment. Trump fired Bolton in September, though the former national security adviser denied that report and claimed he had turned in his resignation voluntarily. “I informed John Bolton last night that his services are no longer needed at the White House,” Trump announced in a pair of tweets on Sept. 10. “I disagreed strongly with many of his suggestions, as did others in the Administration, and therefore ... I asked John for his resignation, which was given to me this morning.” Bolton was known for being a hawk on Iran, North Korea and Syria. His aggressive foreign policy approach and eagerness for war frequently clashed with Trump’s own approach for less military intervention. Lawmakers have called on Bolton to testify as part of the House’s impeachment inquiry into Trump. Bolton’s lawyer, Charles Cooper, has said Bolton would be willing to do so if a court rules he must, given that the White House has chosen not to cooperate with the inquiry. In a letter to the chief House lawyer earlier this month, Cooper said Bolton knows about “many relevant meetings and conversations” surrounding Trump’s communications with Ukraine. According to Cooper’s letter, which he provided to HuffPost, Bolton “was personally involved in many of the events, meetings, and conversations about which [lawmakers] have already received testimony, as well as many relevant meetings and conversations that have not yet been discussed in the testimonies thus far.” Bolton was reportedly concerned about Trump’s personal lawyer Rudy Giuliani’s efforts to pressure Ukraine to investigate former Vice President Joe Biden, one of the Democratic frontrunners for 2020, and his son Hunter. At one point, Bolton even ordered an aide to warn White House attorneys about Giuliani’s behavior. Bolton, however, failed to show up on Nov. 7 for his scheduled deposition by lawmakers in the impeachment inquiry. He is one of several current and former Trump administration officials who have not appeared for their closed-door depositions. Cooper said Bolton “stands ready” to testify if courts resolve the “conflicting demands of the Legislative and Executive Branches.”",
      "date": "11/22/2019 02:34 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "https://search.huffpost.com/click/_ylt=Awr9DtzsNtpdDNIApklsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1574610796/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fstephen-colbert-donald-trump-jingle-impeachment_n_5dd78a45e4b00149f719eba2/RK=2/RS=F3PUQFJu9VVz5yHTTMUjPniA7.U-",
      "url": "Stephen Colbert Goes Full 'Game Of Thrones' On Donald Trump And The GOP",
      "subtitle": "“The Late Show” also debuted a catchy jingle to explain the impeachment inquiry into the president.",
      "author": "Lee Moran",
      "content": " “The Late Show” host Stephen Colbert on Thursday called out TV anchors and political commentators who claim the public impeachment hearings against President Donald Trump have been difficult to follow. “Are you seriously claiming that it’s not easy for Americans to follow sagas with a lot of characters?” he asked. “Have you heard of ‘Game of Thrones’? For Pete’s sake, it was pretty popular.” Colbert later likened the House impeachment inquiry over the Ukraine scandal to HBO’s epic fantasy drama ― dinging Trump and Republican lawmakers in the process ― before using a catchy jingle to break it all down. Check out the clip here:",
      "date": "11/22/2019 02:30 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    }
  ]
}