{
  "articles": [
    {
      "title": "Trump’s Not Rolling With GOP Theory He Was ‘Joking’ About China Probing Bidens",
      "url": "https://www.huffpost.com/entry/trump-china-joke-republicans_n_5da00506e4b06ddfc5175d35",
      "subtitle": "Republicans defended the president’s suggestion that China should investigate Joe Biden as a joke. But Trump isn’t laughing.",
      "author": "Josephine Harvey",
      "content": " President Donald Trump was given a chance Thursday to say whether his suggestion that China investigate his political rival Joe Biden was a joke ― and he passed. Trump, asked by reporters on the White House lawn if he had meant his comments in jest, replied: “China has to do whatever they want. If they want to look into something, they can look into it. If they don’t want to look into it, they don’t have to.” He added: “Frankly, as far as I’m concerned, if China wants to look into something, I think that’s great. And if they don’t want to, I think that’s great too. That’s up to China.” Trump told reporters last week that China should start an investigation into Joe Biden and his son Hunter Biden. He made the comments amid impeachment proceedings prompted by his July 25 phone call with Ukranian President Volodymyr Zelensky, in which he requested that foreign government’s aid in digging up dirt on Biden. Multiple Republican lawmakers, when asked if they believed Trump’s China comments were appropriate, defended them as being a joke, including Sen. Marco Rubio (R-Fla.), Rep. Jim Jordan (R-Ohio.), Sen. Roy Blunt (R-Mo.), and Rep. Kevin McCarthy (R-Calif.). “Do you really think he was serious about thinking that China is going to investigate the Biden family?” Jordan said last week. McCarthy commented: “You watch what the president said, he’s not saying China should investigate.” The president’s exact words were: “China should start an investigation into the Bidens.” Trump’s response on Thursday did not suggest he was joking about China. CNN reported last week that Trump raised the topic of Biden’s political prospects during a June 18 phone call with Chinese President Xi Jinping, according to sources familiar with the call. The call record was stored on the same highly secure White House computer system used to house the summary of Trump’s Ukraine call. Trump’s entreaties to China followed GOP questions over Hunter Biden’s position on the board of a Chinese private equity fund in 2013, while his father was the vice president. He accompanied his father on an official trip to China during that time.",
      "date": "10/11/2019 06:39 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Trump Trashes Impeachment, Bidens, Media At Louisiana Rally",
      "url": "https://www.huffpost.com/entry/trump-louisiana-rally_n_5da13c16e4b06ddfc51a0ac2",
      "subtitle": "The president met a sympathetic audience in Louisiana.",
      "author": "",
      "content": "LAKE CHARLES, La. (AP) — President Donald Trump on Friday pressed his argument that the House impeachment inquiry is nothing more than a new attempt to overturn his election based on “a lot of crap.” Trump found a sympathetic audience in Louisiana, where an arena packed with his supporters roared at his profane denunciations of the proceedings hundreds of miles away in the nation’s capital. “They’ve been trying to stop us for more than three years with a lot of crap,” he said, referring to the investigation into Russian election interference that concluded earlier this year. “They know they can’t win on Election Day so they’re pursuing an illegal, invalid and unconstitutional, bulls―- impeachment,” the president thundered at his second political rally in as many days. Trump also pressed his unproven claims against Democratic presidential candidate Joe Biden and his son Hunter, who sat on the board of a Ukrainian gas company when Biden was vice president. Trump complained about a double standard in news media coverage. He said if any of his children were similarly accused, the media wouldn’t call the allegations unsubstantiated — “They would be saying, ‘Where’s the nearest cell?’” There has been no evidence of wrongdoing by either Joe Biden or Hunter Biden. House Democrats have opened an impeachment inquiry over Trump’s dealings with Ukraine, in which he asked that country’s president during a telephone call in July to investigate Biden. An intelligence community whistleblower complained that Trump was abusing his office for personal political gain. Trump insists he didn’t do anything wrong and has called the conversation with Ukrainian President Volodymyr Zelenskiy “perfect.” Zelenskiy has said he was not pressured by Trump. Trump claimed Democrats are “rage filled” and have opened the impeachment inquiry because they “have gone completely insane” in their “nonstop battle” to overturn the 2016 presidential election result. “Nancy Pelosi hates the United States of America, or she wouldn’t be doing this,” Trump said of the Democratic speaker of the House, who had long resisted calls to initiate impeachment proceedings. Pelosi has said “no one is above the law” and Trump must be held accountable for actions that she says jeopardize U.S. national security, the integrity of American elections and the Constitution. Trump came to Louisiana to unite a squabbling Republican Party against the Deep South’s only Democratic governor, hoping to keep John Bel Edwards from notching a primary win in Saturday’s election. Republican loyalties are split between two major candidates: Ralph Abraham, a third-term congressman and physician from rural northeast Louisiana, and Eddie Rispone, a businessman and longtime political donor from Baton Rouge who is making his first bid for office. Both Republican candidates claim long-term support from Trump. “Tomorrow, you’ve got to vote John Bel Edwards out,” Trump said, criticizing the Democrat as bad for the state. “If he doesn’t get 50%, then one of our two great candidates will win that.” The president is not endorsing either GOP candidate to maximize chances that Edwards will fall below the 50% vote threshold needed to avoid a runoff, according to a White House aide and a campaign aide, both of whom asked for anonymity because they were not authorized to discuss strategy. Trump plans to endorse whichever GOP candidate makes it to a runoff against Edwards, the aides said. In Louisiana, all candidates run against each other, regardless of party, on the same primary ballot. With polls showing Edwards well in the lead, national Republicans have bombarded the state with millions in advertising and visits from Trump, Vice President Mike Pence and Donald Trump Jr. to urge anti-Edwards votes and force a Nov. 16 runoff. Trump acknowledged the reality of college football season in the South and urged everyone to vote before they head to Saturday’s big matchup between Louisiana State University and Florida State. He said people should vote before they go to the game, otherwise they will feel guilty and “it will ruin your entire afternoon.” Trump called Edwards “a liberal Democrat who has sold you out,” even though Edwards isn’t the type of liberal with whom the president usually clashes. He described Abraham and Rispone, the two Republican candidates, as “pro-jobs, pro-worker, pro-family, pro-life, and they’re pro-Louisiana energy if that’s OK.” Trump also kept up a sports theme by inviting the winners of the 2019 Little League World Series to the stage. Trump met in the Oval Office earlier Friday with members of the Eastbank All-Stars and invited them to fly home aboard Air Force One. The team is based in suburban New Orleans. Trump said he had become accustomed to watching Japan win the event. “But this year you have the world champions,” he told the rally crowd before introducing the players one by one. ___ Associated Press writer Kevin Freking in Washington contributed to this report. __ Follow Darlene Superville and Melinda Deslatte on Twitter at: http://www.twitter.com/dsupervilleap and http://twitter.com/melindadeslatte",
      "date": "10/11/2019 11:05 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Hunter Biden To Resign From Board Of Chinese-Backed Firm",
      "url": "https://www.huffpost.com/entry/hunter-biden-to-resign-from-board-of-chinese-backed-firm_n_5da32e7de4b06ddfc51b91b8",
      "subtitle": "His attorney says Hunter Biden pledges to avoid conflicts of interest should his father be elected president.",
      "author": "",
      "content": "WASHINGTON (AP) — Hunter Biden is stepping down from the board of directors of a Chinese-backed private equity firm. That’s according to a statement from Biden’s attorney, George Mesires. Hunter Biden’s business dealings in China and Ukraine have become an issue in the 2020 presidential race with President Donald Trump and his allies pressing unproven corruption allegations again Hunter Biden and his father, Democratic presidential candidate Joe Biden. In a statement posted on Medium and first reported by Bloomberg News, Mesires says Hunter Biden intends to resign from the board of BHR Equity Investment Fund Management Co. by Oct. 31. The attorney says Hunter Biden pledges to avoid conflicts of interest should his father be elected president. Hunter Biden will also continue to keep his father out of his business affairs.",
      "date": "10/13/2019 10:12 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Ted Cruz: ‘Of Course Not’ Appropriate For Trump To Ask China To Investigate Biden",
      "url": "https://www.huffpost.com/entry/ted-cruz-denounces-trump-china-biden_n_5da364aee4b06ddfc51bf005",
      "subtitle": "“Foreign countries should stay out of American elections,” the Republican senator said.",
      "author": "Hayley Miller",
      "content": " Sen. Ted Cruz (R-Texas) on Sunday denounced President Donald Trump’s decision earlier this month to publicly urge China to investigate former Vice President Joe Biden, a front-runner in the Democratic presidential primary race. Asked during an interview Sunday with CBS’ “Face The Nation” whether he believes it’s appropriate for Trump to ask China to open such a probe, Cruz stammered for a few moments before saying “of course not.” “Elections in the U.S. should be decided by Americans and it’s not the business of foreign countries ― any foreign countries ― to be interfering in our elections,” he said. Trump drew heated backlash from Democrats and some Republicans on Oct. 3 when he told reporters on the White House lawn that China “should start an investigation into the Bidens” while discussing trade talks with the country. His comments echoed remarks he made to Ukrainian President Volodymyr Zelensky during a July phone call in which he urged the foreign leader to look into Biden and his son, Hunter, who served on the board of a Ukrainian gas company. The call became the subject of a subsequent whistleblower complaint filed by a U.S. intelligence official and later the centerpiece of the House’s ongoing impeachment inquiry into Trump. Many of Trump’s Republican defenders have claimed the president was only joking when he encouraged China to investigate the Bidens. But one of Trump’s China advisers, Michael Pillsbury, told the Financial Times that he received “quite a bit of background on Hunter Biden from the Chinese” following Trump’s remarks. CBS’ Margaret Brennan continued to press Cruz on Sunday, asking whether it had been appropriate for Trump to ask Ukraine to get involved. “Do you think that, say, the president’s personal attorney, Rudy Giuliani, who’s been talking about China, who’s been talking about Ukraine, do you want to hear him testify about this sort of shadow foreign policy?” she asked. Senate Judiciary Committee Chairman Lindsey Graham (R-S.C.) said last week that he wants Giuliani, who has been urging foreign officials to investigate the Bidens at the behest of Trump, to testify before his committee. “Listen, foreign countries should stay out of American elections,” Cruz, a member of the Senate Judiciary Committee, told Brennan. “That’s true for Russia, that’s true for Ukraine, that’s true for China ― that’s true for all of them. It should be the American people deciding elections.” He added that it would “make a lot of sense” for Giuliani to testify. Watch Cruz’s full interview with “Face The Nation” below. His comments about Trump’s request to the Chinese begin around the 4:30 mark.",
      "date": "10/13/2019 02:53 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Joe Biden: No Family Members Would ‘Have An Office’ In My White House",
      "url": "https://www.huffpost.com/entry/joe-hunter-biden-no-family-in-white-house_n_5da3ade3e4b06ddfc51c1b3e",
      "subtitle": "The 2020 Democrat’s comments at a UFCW forum came hours after his son Hunter Biden resigned from the board of a Chinese-backed firm.",
      "author": "Sanjana Karanth",
      "content": " Presidential candidate Joe Biden said Sunday that no family member of his would have an office in the White House or act as a diplomat under his potential administration. The Democrat’s comments at a United Food and Commercial Workers (UFCW) forum in Iowa were in response to an NBC reporter’s question of what kind of ethical guidelines Biden would create if elected president. The reporter referenced the candidate’s son, Hunter Biden, whose business dealings in China and Ukraine have been at the center of President Donald Trump’s attempt to investigate unsubstantiated allegations of corruption against the Bidens. “No one in my family will have an office in the White House, will sit in meetings as if they are a cabinet member, will in fact have any business relationship with anyone that relates to a foreign corporation or a foreign country,” the former vice president told reporters. “Period. End of story.” Biden appeared to be drawing a contrast with Trump’s children, some of whom have been involved either as senior advisers in the White House or as diplomats with foreign nations. The Democrat’s remarks came just hours after his son Hunter Biden announced his planned resignation from the board of a Chinese-backed private equity firm. Hunter Biden’s attorney, George Mesires, released a statement earlier Sunday that said the younger Biden intends to resign from the board of directors of BHR Partners by Oct. 31. The statement also said Hunter Biden promises to avoid conflicts of interest if his father is elected president, and will continue to keep the former vice president out of his business affairs. At the forum, Joe Biden continued to stress that he has not discussed his son’s business affairs with him, adding that he was not aware of what was in Mesires’ statement until he read it upon release. “What I’m not going to let you all do is let you take the focus off the problem,” Biden told reporters at the UFCW forum. “No one has asserted my son did a single thing wrong. No one has asserted that I’ve done anything wrong except the lying president. That’s the only thing. That’s the focus.” Hunter Biden had served on the board of Ukrainian gas company Burisma Holdings when Joe Biden was vice president, and stepped down from the position in April. The younger Biden’s attorney has maintained that no law enforcement agency has ever accused his client of wrongdoing during his time on the board. In a July phone call, Trump asked Ukrainian President Volodymyr Zelensky to investigate Hunter Biden’s work in the country while his father, now one of Trump’s political rivals, was vice president. Trump’s phone call, and his request that a foreign government interfere in the 2020 U.S. election, is part of what sparked the House’s impeachment inquiry into the president for abusing the power of his office to benefit his reelection campaign. Trump has repeatedly defended his actions and denied any wrongdoing, saying that the call was “perfect.” Biden announced last week that he believes Trump should be impeached. He was one of the last 2020 Democrats to say so.",
      "date": "10/13/2019 07:38 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Hunter Biden Says He Did Nothing ‘Improper’ In Ukraine, China Work",
      "url": "https://www.huffpost.com/entry/hunter-biden-interview_n_5da5a769e4b01c76560cc9cb",
      "subtitle": "Joe Biden’s son said he exercised “poor judgment,” however, by getting involved in something he compared to a “swamp.”",
      "author": "Hayley Miller",
      "content": " Hunter Biden, the son of former Vice President Joe Biden, denied doing anything “improper” in his work with Ukrainian and Chinese companies as President Donald Trump has repeatedly claimed without evidence. Biden told ABC News, in an interview that aired on Tuesday, that he never made a mistake “based on some ethical lapse,” but acknowledged he exercised “poor judgment” by getting involved in something he compared to a “swamp.” Hunter Biden on Sunday announced he was stepping down from his position as a director for Chinese investment company BHR Partners as Trump continues to accuse him and his father of corrupt activity in Ukraine and China. Trump has urged foreign leaders, including Ukrainian President Volodymyr Zelensky and the Chinese government, to investigate Hunter Biden and Joe Biden, his potential Democratic rival in the 2020 election. House Democrats launched an impeachment inquiry into the president after a whistleblower complaint alleged he repeatedly pressured Zelensky and may have withheld U.S. military aid as leverage. Trump claims Joe Biden, as vice president, called for the removal of a notoriously corrupt prosecutor in Ukraine for the purpose of impeding an investigation into Burisma, a Ukranian gas company where Hunter Biden served on the board of directors. There’s no evidence Joe Biden or Hunter Biden did anything illegal. Hunter Biden told ABC News repeatedly that he never discussed his business dealings in Ukraine and China with his father. Hunter Biden acknowledged that his last name helped him professionally, and that he likely wouldn’t have been asked to serve on Burisma’s board had he not been the vice president’s son. “In retrospect, look, I think that it was poor judgment on my part,” he told ABC News of his foreign business deals. “When I look back on it, I know that [I] did nothing wrong at all. However, was it poor judgment to be in the middle of something that is ... a swamp in many ways? Yeah.” He denied Trump’s claim that he raked in $1.5 billion from an investment deal in China, saying it has “no basis in fact in any way.” In recent weeks, Trump has gone after Hunter Biden during his political rallies and in appearances to reporters, bashing him for avoiding the media while his business dealings have been thrust into the national spotlight. “Where’s Hunter?” Trump tweeted several times over the last week. “I’m here,” Hunter Biden told ABC News. “I’m working and living my life.” Biden said he made a “mistake” in giving a “hook to some very unethical people to act in illegal ways to try to do some harm to my father,” an apparent reference to Trump and his personal attorney Rudy Giuliani’s push for foreign leaders to investigate his family. “Did I do anything improper?” Hunter Biden added. “No, not in any way. Not in any way whatsoever.” Watch ABC’s interview with Hunter Biden below:",
      "date": "10/15/2019 07:35 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Rich And Famous Kids Of Rich And Famous Politicians Are Appalled By Hunter Biden",
      "url": "https://www.huffpost.com/entry/famous-kids-politicians-hunter-biden_n_5da61504e4b002e33e76306f",
      "subtitle": "Nepotism! Well, I never.",
      "author": "Amanda Terkel",
      "content": " Republicans ― the party that elected a president who built his real estate empire thanks to his father’s help, allowed his children to run his company and gave his daughter and son-in-law top White House jobs ― are appalled by the nepotism going on in the Democratic Party, particularly in the Biden family. Taking their cues from President Donald Trump, Republicans have been hammering presidential candidate Joe Biden for his son’s business dealings in Ukraine and China. Trump has pushed the conspiracy theory that as vice president, Biden pressured Ukraine to fire the country’s chief prosecutor to prevent him from investigating a Ukrainian gas company with ties to Hunter Biden. Hunter Biden recently announced that he will resign from the board of a Chinese company by the end of the month amid the political maelstrom. He has insisted he never did anything illegal or improper, although he said in an interview with ABC that he probably showed “poor judgment” in joining the ventures. While Trump’s allegations about the Bidens are entirely baseless, Hunter Biden did seem to be taking advantage of his famous name to score lucrative positions with foreign companies. (There’s no indication he had any expertise in the Ukrainian energy industry otherwise.) Many people sincerely believe that there should be less nepotism in politics and it should be easier for people without connections to get jobs in government and elsewhere. But some of the people criticizing Hunter Biden and acting shocked about what happened have benefited from the same system. Ronna Romney McDaniel, the chairwoman of the Republican National Committee, went after Hunter Biden on Tuesday. McDaniel is the niece of Sen. Mitt Romney (R-Utah). Her grandfather was governor of Michigan, and both her grandmother and mother ran for Senate. Her father ran for attorney general of Michigan. Sen. Rand Paul (R-Ky.), who is the son of Rep. Ron Paul (R-Texas) and garnered much of his early political experience working on his dad’s campaigns, also felt like it would be “fair” to investigate Hunter Biden if Democrats wanted to go after Rudy Giuliani, Trump’s personal lawyer who was running a shadow foreign policy operation to personally benefit the president. “So if we want to investigate Rudy Giuliani’s financial dealings, by all means do it,” he said on MSNBC Tuesday. “But at the same time, you should, if you want to be fair, investigate Hunter Biden’s economic dealings in the Ukraine as well.” When host Stephanie Ruhle pressed Paul on whether that meant Ivanka Trump and Jared Kushner should also be scrutinized for how they got ahead, Paul went into how “both sides” are doing it. “If we want to go down the road of the politics of self-destruction of everybody, criminalize all politicians on both sides of the aisle and go after their family, yes. We can do that. But both sides are doing that,” he added. “Nobody should excuse themselves and say, ‘We’re holier than thou, Trump is evil.’” On “The View” Tuesday, Meghan McCain and Abby Huntsman did not feign indignation over Hunter Biden like McDaniel and Paul, but they did debate whether his interview on ABC helped his father’s presidential campaign. McCain is the daughter of the late Sen. John McCain (R-Ariz.) and Huntsman is the daughter of Jon Huntsman (R), the former governor of Utah. Fox News had Peter Doocy report on Hunter Biden Wednesday morning. Doocy is the son of “Fox and Friends” host Steve Doocy. The young Doocy, not coincidentally, was immediately hired by the network upon his graduation from college. And then, there was the tweet by Donald Trump Jr. on Tuesday. There’s not much more that can be said about the absurdity of this outrage. And for the record (because I know I will get emails and messages about this), I am not ― at least in any way I can tell ― related to the writer Studs Terkel. This story has been updated with Doocy’s segment.",
      "date": "10/15/2019 04:22 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Democrats Dismiss GOP Attacks On Hunter Biden",
      "url": "https://www.huffpost.com/entry/hunter-biden-trump-2020-democrats_n_5da64438e4b02253a2f9ecec",
      "subtitle": "Sen. Debbie Stabenow of Michigan called Republican hand-wringing about the former vice president’s son’s work overseas “the height of hypocrisy.”",
      "author": "Igor Bobic",
      "content": " WASHINGTON ― Democrats say they aren’t troubled by Hunter Biden’s business dealings overseas despite allegations that he cashed in on his father’s name while Joe Biden was vice president. “It’s the height of hypocrisy for any Republican right now ― given what the Trump family is doing ― to raise concerns about this,” Sen. Debbie Stabenow (D-Mich.) said Tuesday. Republicans have been hammering the younger Biden over his business dealings in Ukraine and China, where he served on several corporate boards, earning tens of thousands of dollars a month. President Donald Trump’s efforts to compel Ukraine to help investigate the Bidens were uncovered by a whistleblower complaint about Trump’s July 25 call to the Ukrainian president. Hunter Biden insisted he never did anything illegal or improper, even though he acknowledged in an interview with ABC that it was “poor judgment” on his part to join the businesses and that it was likely that his last name helped him professionally. He also announced that he will resign from the board of a Chinese company by the end of the month amid the controversy that appears designed to target his father’s 2020 presidential campaign. That didn’t stop people like Ronna McDaniel, the chairwoman of the Republican National Committee and the niece of Sen. Mitt Romney (R-Utah), from calling out Hunter Biden for nepotism on Tuesday. But she wasn’t the only GOP official with famous relations who took umbrage about nepotism in Washington. Sen. Rand Paul (R-Ky.), son of former Rep. Ron Paul (R-Texas), and Donald Trump Jr. also weighed in. But Senate Democrats, including Biden’s top allies in the upper chamber, said they were unbothered by the GOP’s concerns regarding Hunter Biden. “If you look at boards of directors all over the world, you’ll find all kinds of people connected to them,” said Sen. Dianne Feinstein (D-Calif.), who has backed Biden’s candidacy for president. “I served on them, my husband has served on them.” The California Democrat added: “Did the last name Biden help? Sure, it helps everywhere, I think.” Sen. Doug Jones (D-Ala.) said Hunter Biden did “pretty well” in responding to the questions surrounding his work overseas in his interview with ABC. “In hindsight, it was probably poor judgment but certainly nothing illegal,” Jones said. Sen. Tim Kaine (D-Va.), meanwhile, called it a “non-story.” “Much of what the Trump administration has said about Hunter Biden, according to the fact-checkers, is just completely false,” he added.",
      "date": "10/15/2019 07:28 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Biden Dodges Question About Son’s Ukraine Work, Talks About Trump And George Washington",
      "url": "https://www.huffpost.com/entry/joe-biden-debate-hunter-biden-ukraine_n_5da66ef2e4b002e33e76bfd4",
      "subtitle": "The former vice president responded during the Democratic debate that he was “proud” of his son Hunter’s judgment.",
      "author": "Jessica Schulberg",
      "content": " During Tuesday’s Democratic presidential primary debate, candidate Joe Biden was asked if it was a mistake for his son Hunter Biden to sit on the board of a Ukrainian gas company while Biden was the vice president and working on Ukrainian corruption issues. Biden dodged the question: He insisted he and his son did “nothing wrong,” that he was “proud” of his son’s judgment, that people should really be focused on President Donald Trump’s corruption, and something about George Washington. Trump’s request in a July 25 phone call that the president of Ukraine investigate the Bidens is what prompted Democrats to officially open an impeachment inquiry. As the debate moderator noted in his question, there is no evidence that the Bidens had a corrupt arrangement in Ukraine. But both Joe and Hunter Biden seem aware of the poor optics. The former vice president has said he would ban his family and anyone associated with him from being “involved in any foreign operation whatsoever” if he were elected president. And Hunter acknowledged Tuesday, hours before the debate, that he used “poor judgment” in taking the job. So it was reasonable enough when CNN’s Anderson Cooper asked Biden, “If it’s not OK for a president’s family to be involved in foreign businesses, why was it OK for your son when you were vice president?” But Biden ignored the question. “Look, my son did nothing wrong. I did nothing wrong,” he started, even though Cooper had already said there was no evidence of wrongdoing. “My son’s statement speaks for itself,” Biden said multiple times before veering off on a tangent about Trump and the Founding Fathers: What I think is important is we focus on why it’s so important to remove this man from office. On the 17th ― look, the fact that George Washington worried, on the first time he spoke after being elected president, that what we had to worry about is foreign interference in our elections. It was the greatest threat to America. This president on three occasions, three occasions, has invited foreign governments and heads of government to get engaged in trying to alter our elections. The fact is that it is outrageous. Rudy Giuliani, the president and his thugs have already proven that they, in fact, are flat lying. What we have to do now is focus on Donald Trump. He doesn’t want me to be the candidate. He is going after me because he knows if I get the nomination, I will beat him like a drum. Cooper tried again. “Your son Hunter today gave an interview and admitted that he made a mistake and showed poor judgment by serving on that board in Ukraine. Did you make a mistake by letting him? You were the point person on Ukraine at the time,” Cooper said. Biden again insisted he did nothing wrong — and said that he was “proud” of his son’s judgment. “Look, my son’s statement speaks for itself. I did my job. I never discussed a single thing with my son about anything having do with Ukraine. No one has indicated I have,” Biden said. “My son made a judgment. I’m proud of the judgment he made. I’m proud of what he had to say. And let’s focus on this. The fact of the matter is that this is about Trump’s corruption. That’s what we should be focusing on.”",
      "date": "10/15/2019 09:30 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Sanders, Warren Blast Joe Biden In First Major Clash Of Front-Runners",
      "url": "https://www.huffpost.com/entry/bernie-sanders-elizabeth-warren-joe-biden-clash-ohio-debate-2020-democratic-presidential-primary_n_5da68b0de4b002e33e76ee03",
      "subtitle": "The two progressive candidates tried to poke holes in the former vice president’s self-styled image as a pragmatist at the Democratic presidential debate.",
      "author": "Daniel Marans",
      "content": " More than two-thirds of the way into the Democratic presidential debate on Tuesday night, former Vice President Joe Biden took a casual swipe at his rivals without specifying whom he was speaking about exactly. “We can’t be running any vague campaigns. We’ve got to level with people,” Biden said. “I’m going to say something that is probably going to offend some people here, but I’m the only one on this stage who has gotten anything really big done.” When a CNN moderator pressed Biden to clarify which candidates he thought were being vague, he pointed first to his left at Sen. Elizabeth Warren (D-Mass.) and then to his right, at Sen. Bernie Sanders (I-Vt.), claiming they were both obfuscating about the cost of “Medicare for All.” What happened next was the most direct and contentious exchange among the three candidates ― the septuagenarian trio leading in the public polls ― thus far in the primary. Sanders and Warren both took Biden to task for what they argued were either policy mistakes that hurt ordinary people or exaggerations of his role in the passage of positive reforms. Sanders began by seizing on Biden’s insistence that he alone had shepherded “anything really big” into law. He drew a no-holds-barred contrast with Biden’s record on war, trade and bankruptcy reform, aiming to expose him as a false populist. “Joe, you talked about working with Republicans and getting things done. But you know what you also got done? And I say this as a good friend ― you got the disastrous war in Iraq done,” Sanders said. “You got a bankruptcy bill, which is hurting middle-class families all over this country, you got trade agreements, like NAFTA, PNTR with China done, which have cost us 4 million jobs.” Sanders and Biden subsequently had a brief back-and-forth about Medicare for All, with Biden insisting that adopting a single-payer system was not necessary for achieving universal coverage. Then it was Warren’s turn to answer Biden’s implicit charge that she is vague and impractical. She focused on her brainchild: the Consumer Financial Protection Bureau, part of the Dodd-Frank Wall Street reform law. “Following the financial crash of 2008, I had an idea for a consumer agency that would keep giant banks from cheating people. And all of the Washington insiders and strategic geniuses said, ‘Don’t even try because you will never get it passed,’” she recalled. “And sure enough, the big banks fought us, the Republicans fought us, some of the Democrats fought us. But we got that agency passed into law.” Warren promised to leverage her knowledge from that fight to use every lever in her power as president, including executive actions, to enact “structural reform.” “I know what we can do by executive authority, and I will use it,” she said. “In Congress, on the first day, I will pass my anti-corruption bill, which will beat back the influence of money and repeal the filibuster.” Biden tried to share in the credit for passing the law that created the CFPB. “I agreed with the great job she did, and I went on the floor and got you votes. I got votes for that bill!” he declared. “I convinced people to vote for it, so let’s get those things straight, too.” Warren wasn’t having it. “I am deeply grateful to President Obama, who fought so hard to make sure that agency was passed into law, and I am deeply grateful to every single person who fought for it and who helped pass it into law,” she responded, notably omitting Biden’s name. Amanda Terkel and Molly Redden contributed reporting.",
      "date": "10/15/2019 11:43 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Joe Biden Stole Credit From Elizabeth Warren In A Way That’s All Too Familiar To Women",
      "url": "https://www.huffpost.com/entry/joe-biden-elizabeth-warren-credit-taking_l_5da72b91e4b02253a2fbe909",
      "subtitle": "null",
      "author": "",
      "content": "",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Joe Biden Tells Trump: ‘Release Your Tax Returns Or Shut Up’",
      "url": "https://www.huffpost.com/entry/joe-biden-donald-trump-tax-returns_n_5da79655e4b0b5c9be48ab22",
      "subtitle": "The former vice president and 2020 candidate accused the president of “running the most corrupt government in the history of the United States of America.”",
      "author": "David Moye",
      "content": " Joe Biden lashed out at Donald Trump on Wednesday and demanded the president stop smearing him and his son Hunter. The former vice president was at a campaign stop in Columbus, Ohio, when he demanded of the president: “Release your tax returns or shut up.” The president, in a call on July 25 while military funds were being withheld, had asked Ukraine officials to investigate Hunter Biden’s past business connections in that country. The alleged quid pro quo request is now part of an impeachment inquiry being conducted by House Democrats. Biden, speaking to reporters, suggested keeping the focus on what Trump claims is massive political corruption. “Well, let’s talk about corruption,” Biden began. ”[Trump] is running the most corrupt government in the history of the United States of America, number one. Number two, he also is in a position where, as he talks about corruption, he is engaged in practices that, in fact, everyone around the world is looking and saying, ‘How in God’s name can this man be doing that while he’s president?’” Biden then addressed the president directly: “Mr. President, you want to talk about corruption. I’ve released 21 years of my tax returns. I entered as one of the poorest men in Congress, left one of the poorest men in government, in Congress and as vice president. I made no money while I was in there other than my salary. “Mr. President, even Richard Nixon released his tax returns. Mr. President, release your tax returns or shut up.” Biden then offered a theory on why the president has spent so much time going after him. “The reason why he is running after me is he knows I will beat him like a drum,” Biden said. “He understands that.” Biden then pointed the finger at Trump team members including personal lawyer Rudy Giuliani. “As I said, Rudy Giuliani and the henchmen, and Trump’s lawyers, how many of these folks are in jail?” Biden asked. “These are the president’s people, for God’s sake! This is a corrupt, thoroughly corrupt outfit.”",
      "date": "10/16/2019 07:09 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Ukraine Knew Trump Was Freezing Aid Over Biden, New York Times Reports",
      "url": "https://www.huffpost.com/entry/trump-ukraine-aid-biden-zelensky_n_5db097cfe4b0d5b789450445",
      "subtitle": "The report would blow a hole in Trump’s claims there couldn’t have been a quid pro quo arrangement.",
      "author": "Nick Robins-Early",
      "content": " Ukrainian officials knew for months that President Donald Trump was withholding key military aid to their country over demands that Ukraine investigate Trump’s political rival and 2020 candidate Joe Biden, The New York Times reported on Wednesday. The report, based on interviews and documents the Times obtained, directly contradicts Trump’s claim that there could not have been an improper quid pro quo arrangement because Ukrainian officials did not know the United States was withholding $391 million in military aid. Instead, top Ukrainian officials reportedly knew of the aid freeze as early as the first week of August ― just days after Trump requested Ukrainian President Volodymyr Zelensky to investigate Biden during a July 25 phone call. If Ukraine’s government knew of the delayed aid in August, it would blow a significant hole in the Trump administration’s denial that the president engaged in misconduct. According to a whistleblower and testimony to Congress, Trump and his allies pressured Ukraine to investigate Biden’s actions in Ukraine as vice president and his son Hunter’s business connections in the country. The report could also give more fuel to impeachment proceedings after a week that already included the top U.S. diplomat in Ukraine, Bill Taylor, testifying that Trump had indeed held up aid to force Ukrainian officials to target the Bidens. Trump and Giuliani have been obsessed with Biden’s role in Ukraine for some time ― after it became a conservative talking point﻿ that Biden had pressured Ukraine to fire a prosecutor to protect his son from investigation. (The prosecutor was, in fact, widely criticized for failing to stop corruption). Trump has also embraced a widely debunked conspiracy theory alleging a missing Democratic National Committee server being hidden in Ukraine. (There is no such server.) Trump brought up both on his July 25 call with Zelensky. Zelensky, a political outsider who won a landslide victory earlier this year, had worried about Trump pressuring Ukraine to investigate the Bidens even before he took office in May, The Associated Press reported on Wednesday. During a three-hour meeting on May 7, Zelensky and several of his advisers discussed how to handle Trump and his personal lawyer Rudy Giuliani’s demands that Ukraine investigate the Bidens. The Ukrainian leader’s fears appeared to be well-founded. Only two days after Zelensky and his advisers’ meeting, Giuliani told The New York Times that he would travel to Kyiv to push for an investigation into Biden and Ukrainian gas company Burisma Holdings, for which Hunter Biden served on the board of directors. Although he canceled that trip over public backlash, Giuliani continued to lead an intense effort to force Ukraine to launch the investigation. Trump wanted Zelesnky to “go to a microphone and say he is opening investigations of Biden and 2016 election interference,” ambassador Taylor told impeachment investigators on Tuesday. Taylor’s statements contradicted those of the U.S. ambassador to the European Union, Gordon Sondland, who testified that he only recently learned that Giuliani’s efforts in Ukraine may have related to pushing an investigation into Biden. Sondland’s explanation was already hard to believe, given the plethora of media coverage of Giuliani’s mission and Sondland’s role as one of the administration’s top diplomats. Following Taylor’s testimony, House Democrats sent a letter to the State Department on Wednesday requesting diplomatic cables, emails and other communications related to Trump’s attempts to get Ukraine to initiate investigations into the Bidens.",
      "date": "10/23/2019 03:14 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "In A Reversal, Joe Biden Wants A Super PAC",
      "url": "https://www.huffpost.com/entry/in-a-reversal-joe-biden-wants-a-super-pac_n_5db1fdc8e4b03285e87bf882",
      "subtitle": "Biden once said support from super PACs meant the middle class couldn’t trust a politician. Now, his cash-strapped campaign wants help parrying Trump’s attacks.",
      "author": "Kevin Robillard",
      "content": " Vice President Joe Biden’s campaign said Thursday it would welcome help from a super PAC, a total reversal from Biden’s stance at the beginning of the campaign and a decision reflecting his diminished financial position in the 2020 Democratic presidential primary. Many Democrats view super PACs, which can raise and spend unlimited sums and often rely on checks worth tens of thousands of dollars from wealthy donors for funding, as a malignant force that represents a big-money era of politics the party is nominally dedicated to ending. Democratic candidates for president in 2020 have largely avoided super PACs, but Biden’s shift could lead more candidates to tacitly back outside groups. (Super PACs are not legally allowed to coordinate directly with campaigns, but an unkind word from a candidate is often all that’s needed to deprive them of funding.) The Biden campaign said President Donald Trump’s false attacks on the former vice president made it necessary for it to welcome the help of a super PAC. Trump, the Republican National Committee and other GOP groups have spent more than $10 million attacking Biden, with much of that money aimed at the four early primary states of Iowa, New Hampshire, Nevada and South Carolina. “Donald Trump has decided that the general election has already begun,” Kate Bedingfield, Biden’s deputy campaign manager, wrote in an emailed statement. “He and his allies are already spending massive amount of money on paid television and digital advertising to intervene directly in Democratic primaries with the goal of preventing Joe Biden, the opponent that Trump fears most, from becoming the Democratic nominee.” “In this time of crisis in our politics, it is not surprising that those who are dedicated to defeating Donald Trump are organizing in every way permitted by current law to bring an end to his disastrous presidency,” she added. “Nothing changes unless we defeat Donald Trump.” Bedingfield said Biden would support a public campaign finance system and a constitutional amendment to overturn the Supreme Court’s Citizens United decision. Biden’s decision drew nearly immediate condemnation from his progressive rivals in the 2020 campaign. Adam Green, a top ally of Massachusetts Sen. Elizabeth Warren, said Biden was putting his reputation as a longtime ally of the middle class at risk. “By making big-money corruption the center of how he funds his campaign, Biden severely jeopardizes his legacy as Common Man Joe that he spent decades cultivating,” Green said. “If Biden cares about defeating Trump, he should not open the door to billionaires and corporations flooding the primary and should make clear he does not want his supporters to use big money to attack other Democrats.” The campaign of Vermont Sen. Bernie Sanders, who attacked Hillary Clinton over her support from super PACs during the 2016 presidential election, aimed a similar volley at Biden. “The former Vice President has been unable to generate grassroots support, and now his campaign is endorsing an effort to buy the primary through a super PAC that can rake in unlimited cash from billionaires and corporations,” Sanders campaign manger Faiz Shakir said. “That’s not how we defeat Trump. It’s a recipe to maintain a corrupt political system which enriches wealthy donors and leaves the working class behind.” Biden’s decision comes as he falls behind the other candidates in the money race, even though he still leads in much of the public polling. His campaign has just $9 million on hand, the fifth-highest total in the 2020 Democratic primary field. Sanders has $33.7 million in the bank, and Warren has $25.7 million. Even South Bend, Indiana, Mayor Pete Buttigieg and California Sen. Kamala Harris, who are both well behind Biden in public polling, have more campaign funds than he does. Biden has struggled to raise money online from small-dollar donors at the same pace as his competitors, and many of his donors have already given the federal maximum of $2,800. End Citizens United, a Democratic campaign finance reform group, criticized Biden for his reversal and said his fundraising struggles were no excuse. In a statement, it noted less than a month had passed since Biden last said he wouldn’t welcome a super PAC. At that time, Trump’s attacks on the former vice president had already begun. “The path forward for his campaign depends on Democratic primary voters trusting that they’d have more say in a Biden administration than big money donors. It is incredibly disappointing to see Vice President Biden completely reverse his position now that times are tough,” said Tiffany Muller, End Citizens United’s president. “This is exactly the time he needs support from real people the most. We urge him to reconsider this decision and disavow this super PAC.” While Biden’s campaign will dismiss much of the criticism aimed at his decision as coming from partisans who dislike his candidacy for ideological reasons or are backing his opponents, he can’t say the same of End Citizens United. The group, which has pressured all of the campaigns to reject single-candidate super PACs, is neutral in the 2020 presidential primary and helped many moderate Democratic candidates win House seats during the 2018 midterms. If a super PAC forms to back Biden ― and it would be shocking if one did not ― he would become the second candidate in the field to welcome an outside group accepting massive donations. Businessman Andrew Yang welcomed the support of a super PAC earlier this week. A super PAC has formed to support New Jersey Sen. Cory Booker, but he has said he doesn’t want the group’s help. Washington Gov. Jay Inslee embraced the support of a super PAC before he dropped out of the race in August. It’s not clear if Biden will appear at fundraisers for a super PAC. If a group begins raising and spending money during 2019, it will have to reveal its donors in January, before the first Democratic primaries in Iowa and New Hampshire. Biden has a long history as a campaign finance advocate, and has been fiercely critical of super PACs in the past. During an appearance on “PBS NewsHour” in 2018, Biden said he told Sanders not to create a super PAC during his 2016 run. “I’m the guy that told him, you shouldn’t accept any money from a super PAC, because people can’t possibly trust you,” Biden said at the time. “How will a middle-class guy accept you if you accept money?” This story has been updated with additional information.",
      "date": "10/24/2019 04:51 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Biden ‘Not Worried’ About Lackluster Fundraising: ‘I’m The Front-Runner’",
      "url": "https://www.huffpost.com/entry/joe-biden-not-worried-about-campaign-funds-im-the-frontrunner_n_5db3002fe4b0ea02257cd09e",
      "subtitle": "The former vice president started October with less than half the cash on hand reported by either Elizabeth Warren or Bernie Sanders.",
      "author": "Amy Russo",
      "content": " Former Vice President Joe Biden’s campaign entered October with less than half the cash of two Democratic presidential opponents trailing him in the polls, but he said he’s not concerned. “I [will] just flat beat them,” Biden told CBS’ “60 Minutes,” referring to Sens. Bernie Sanders (I-Vt.) and Elizabeth Warren (D-Mass.), in an interview set to air Sunday. “We’re on a course to do extremely well. I’m not worried about being able to fund this campaign. I really am not, truly.” The latest Federal Election Commission filings show Sanders with $33.7 million in cash on hand at the end of September, and Warren with $25.7 million. Both far surpassed Biden, who had just under $9 million. Even South Bend, Indiana Mayor Pete Buttigieg, who has been polling well below the top three, had $23.4 million. Polls show the still-crowded Democratic primary race has tightened as Warren has risen in the last month. Surveys released this week conflict on whether ﻿Biden or Warren leads the race. Biden brushed off that ambiguity, too, asserting it’s him. “I know I’m the front-runner,” he said. “Find me a national poll with a notable ― a couple exceptions. The last four that have come out. But look, this is a marathon.” A CNN survey conducted last week showed Biden 15 percentage points ahead of Warren. A Quinnipiac University survey conducted around the same time showed Warren 7 points ahead of Biden. Underscoring the uncertainty, a national HuffPost/YouGov survey taken last week shortly after the fourth Democratic debate found that 60% of Democratic voters and left-leaning independents said they believe Biden could win the general election, while 59% said the same of Warren.",
      "date": "10/25/2019 12:30 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Biden Says He’s Still ‘Front-Runner’ Despite Attacks Over Son’s Ukraine Work",
      "url": "https://www.huffpost.com/entry/joe-biden-talks-obama-endorsement_n_5db631bee4b006d491710f8c",
      "subtitle": "The former vice president also called Trump an “idiot” for refusing to recognize Russian attempts to influence the 2020 election.",
      "author": "Nick Visser",
      "content": " Former Vice President Joe Biden once again defended his son, Hunter Biden, during an interview with “60 Minutes” on Sunday, saying he didn’t do a “single thing wrong” and pledging that should he be elected none of his children would serve in his administration. “He’s a grown man,” Biden said. “I’ve never discussed my business or their business, I’ve never discussed them because they know where I have to do my job.” Biden made the comments to host Norah O’Donnell, who asked about the ongoing House impeachment investigation into President Donald Trump’s behavior. The former vice president has been at the center of the investigation into Trump’s alleged demand for a quid pro quo from the leader of Ukraine. Critics have accused the president of withholding nearly $400 million in military aid from the country unless it opened an investigation into Biden and his son, Hunter Biden, who served on the board of a Ukrainian energy company. Neither Biden has been accused of any wrongdoing, although they have been subject to false political ads claiming as much. Biden said Sunday once more that he hadn’t discussed Hunter’s work in Ukraine. But he said that should he be elected in 2020, none of his children would have an office in the White House or “sit in on Cabinet meetings.” The comments directly targeted Trump’s children, including Ivanka Trump and his son-in-law Jared Kushner, who hold senior roles in the administration. “Their actions speak for themselves,” Biden said. “What you should make it clear to the American public is the idea that everything you’re doing is for them.” The Trump campaign defended Ivanka Trump and Kushner last week after Biden’s remarks were first made public, saying the pair were “instrumental” in major administration decisions. Despite the unfolding scandal over Ukraine, Biden said he was still on top of the 2020 Democratic field, saying the country needed “somebody who on day one knows exactly what to do, can command the world stage.” “No one wonders whether I know a great deal about these issues in foreign policy and domestic policy. They’re things I’ve done,” he said, later adding: “I know I’m the front-runner. Find me a national poll with a notable couple exceptions. This is a marathon.” Biden also levied harsh criticism at Trump, calling the president an “idiot” for refusing to admit that the Russian government was attempting to, once again, influence American elections. “Everybody knows this, nobody doubts it,” Biden said. O’Donnell noted that Biden’s campaign had just under $9 million cash on hand while some of his rivals were sitting on much bigger war chests, including Sen. Bernie Sanders ($33.7 million) and Sen. Elizabeth Warren ($25.7 million). But the former veep said he wasn’t troubled by those figures, saying: “We’re on course to do extremely well. I’m not worried about being able to fund this campaign.” Biden also noted that he has asked former President Barack Obama not to endorse him in the 2020 presidential race, saying he wanted to win the Democratic nomination on his own merits. “I want to earn this on my own,” Biden said. “I asked him not to, he said okay. I think it’s better, I think he thinks it’s better for me.” He continued: “I have no doubt that when I’m the nominee he’ll be out on the campaign trail for me.”",
      "date": "10/27/2019 09:32 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Joe Biden Reportedly Snubbed At Catholic Communion Over Abortion Rights Stance",
      "url": "https://www.huffpost.com/entry/joe-biden-denied-catholic-communion-abortion_n_5db8ab61e4b0bb1ea370e52a",
      "subtitle": "A reverend at a South Carolina church allegedly refused to serve the former vice president Holy Communion.",
      "author": "Amy Russo",
      "content": " Former Vice President Joe Biden was reportedly denied Holy Communion over his stance on abortion rights during a Sunday morning visit to a South Carolina church. Father Robert Morey of Saint Anthony Catholic Church in Florence told the local Morning News that during the 9 a.m. Mass, he refused to serve the Democratic presidential candidate because “any public figure who advocates for abortion places himself or herself outside of Church teaching.” “I will keep Mr. Biden in my prayers,” he added. Morey did not immediately responded to HuffPost’s request for comment and Biden’s campaign declined to comment. The presidential candidate declined to directly address the matter in an MSNBC interview. “I’m not going to discuss that,” he said. “That’s just my personal life, and I’m not going to get into that at all.” Biden, a practicing Catholic, emphasized that he does not seek to impose his “religious beliefs which I accept based on church doctrine” on others. He has said that he personally opposes abortion, but he has evolved politically on the issue. In 1982, Biden voted for an amendment that would have allowed states to overturn Roe v. Wade, the landmark Supreme Court decision that legalized abortion nationwide. He has since reversed course, vowing to codify the ruling if elected and stating that “we must fight any and all attempts to overturn it.” Similarly, Biden once backed the Hyde Amendment that prohibits federal funds from being spent on abortions but announced his support for scrapping it earlier this year. “I can’t justify leaving millions of women without the health care they need,” he said at a June gala hosted by the Democratic National Committee. “If I believe health care is a right, as I do, I can no longer support [the amendment].” This has been updated to reflect that Biden’s campaign declined to comment.",
      "date": "10/29/2019 08:05 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Trump Jr.: I Wish I Was Hunter Biden So I Could Profit From My Dad’s Presidency",
      "url": "https://www.huffpost.com/entry/trump-jr-hunter-biden-fox-news_n_5dba601fe4b066da552bf690",
      "subtitle": "The president’s son has an estimated net worth of $200 million.",
      "author": "Josephine Harvey",
      "content": " Donald Trump Jr. says he wishes he could make millions off his father’s presidency ― like Hunter Biden. President Donald Trump’s son made his latest nepotism accusations against the former vice president’s son during an appearance on Fox News’ “Hannity” Wednesday night. “Imagine if your name was Hunter Biden,” host Sean Hannity said, in a nod to the fact that Hunter Biden landed a high-paying job on the board of Ukrainian gas company Burisma Holdings, despite limited experience in that industry. “I wish my name was Hunter Biden,” Trump Jr. replied. “I could go abroad, make millions off of my father’s presidency. I’d be a really rich guy. It would be incredible.” Trump Jr. has a reported net worth of $200 million. Trump Jr. has run the Trump Organization with his brother Eric Trump ever since their father assumed office. The brothers, who have had extensive foreign business dealings during their father’s presidency, have repeatedly accused Hunter Biden of leveraging his family name for personal gain during his father’s time in office. Earlier this month, Eric Trump argued in a statement to The New York Times that their foreign dealings were different from Biden’s because they were continuations of deals already in the works before the Trump presidency. Trump Jr.’s latest comments were made near the end of Hannity’s program as the Fox News personality again pushed an unfounded theory that former Vice President Joe Biden was a party to an inappropriate quid pro quo when he pushed Ukraine to dismiss a corrupt prosecutor who was investigating Burisma Holdings. The European Union and numerous Obama administration officials were all pushing for the prosecutor’s removal and multiple investigations have yielded no evidence of wrongdoing by the Bidens.",
      "date": "10/31/2019 03:25 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Bill O’Reilly Says Joe Biden Should Be Impeached After His Inauguration",
      "url": "https://www.huffpost.com/entry/bill-oreilly-sean-hannity-joe-biden-impeached_n_5dba9f8fe4b0bb1ea3750c6d",
      "subtitle": "The former Fox News host told Sean Hannity what he thinks should happen if Biden defeats Trump.",
      "author": "Ron Dicker",
      "content": " Disgraced former Fox News host Bill O’Reilly shared his lame fever dream of what should happen if Joe Biden were to win the Democratic nomination and then defeat President Donald Trump in 2020: “If Joe Biden is elected president, the day after he’s sworn in, he has to be impeached. For what he did in Ukraine, right?” the “United States of Trump” author said on Sean Hannity’s radio show Wednesday. (Listen to the audio clip, shared by Media Matters, below.) “Bingo, correct, correct,” Hannity chimed in. O’Reilly, 70, took his musing further. “So Biden goes out to the parade in Washington and, you know, he waves and everything, goes into the Oval Office and the next day he’s served with impeachment papers. ” To which current Fox News host Hannity replied: “You and I will be on the parade route. You can wear your Halloween costume of (House Intelligence Committee Chair Adam) Schiff (D-Calif.) and I’ll be holding up a sign “Impeach Biden.” Hear the sound of a dead horse being beaten? The two slogged through a revisiting of Trump and Co.’s debunked claim that Biden called for the firing of a Ukrainian prosecutor to further the business interests of Biden’s son there. Despite the lack of evidence, conservatives continue to float the accusation as the impeachment inquiry into Trump steams forward for his alleged pressuring of the Ukrainian president to investigate Biden. But at least the idea that O’Reilly, fired from the news channel in 2017 amid sexual misconduct allegations, even considered a Democratic victory in 2020 was promising.",
      "date": "10/31/2019 06:21 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Biden Hits Back At Criticism of Age: ‘See If I Have The Energy’",
      "url": "https://www.huffpost.com/entry/joe-biden-age-criticism-see-if-i-have-energy_n_5dbd8229e4b0d8b441cf8214",
      "subtitle": "The former vice president, 76, dismissed concerns over his series of campaign trail gaffes and jumbled statements.",
      "author": "Amy Russo",
      "content": " Former Vice President Joe Biden dismissed questions over his age following a New York Times report that called out his “uneven performances,” “gaffe-prone tendencies” and “verbal miscues.” “They went out and found people who said that,” he told PBS NewsHour’s Judy Woodruff in an interview that aired Friday. “I don’t doubt people said that... The overwhelming number of people haven’t worried about any miscue or not.” The 76-year-old declared himself a “gaffe machine” in 2018 when mulling a presidential bid, and has lived up to the label in recent months with a string of campaign trail slip-ups, including apparently forgetting what state he’s in and jumbling historic timelines. In August, Biden jokingly told an audience in New Hampshire that he was “not going nuts” as the foot-in-mouth moments piled up. Now, he’s telling the public to discern for itself whether he’s fit for office. “This is for the voters to decide,” he told Woodruff. “Take a look. Look at me. See if I have the energy. See if I know what I’m talking about, and make their judgement. It’s as simple and as complicated as that.” Though Biden is still leading the crowded pack of Democrats in most 2020 polls, his repeated fumbles, whether on the debate stage or elsewhere, haven’t gone unnoticed. Last month, Biden raised eyebrows during a CNN town hall on LGBTQ issues where he spoke about “gay bathhouses” and “round-the-clock sex” when attempting highlight how conversations on homosexuality have evolved within the past 15 years. When addressing America’s slaveholding past at the third Democratic presidential debate in September, which some candidates have considered rectifying with modern-day reparations, Biden talked about the importance of keeping “the record player on at night” to “make sure that kids hear words.” During that debate, former Housing and Urban Development Secretary Julián Castro appeared to take a shot at Biden’s age as the two sparred over health care reform, asking whether he was “forgetting already what you said just two minutes ago.” At least two other candidates ― South Bend, Indiana, Mayor Pete Buttigieg and Minnesota Sen. Amy Klobuchar ― later commented that Castro’s remark was a low blow. Still, Biden isn’t the oldest candidate in the race. Sen. Bernie Sanders (I-Vt.) is 78.",
      "date": "11/02/2019 11:36 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Biden Defends His ‘Vision’ Against Warren’s Indirect Attacks",
      "url": "https://www.huffpost.com/entry/joe-biden-vision-iowa_n_5dbe3cb6e4b0fffdb0f7d74e",
      "subtitle": "Former Vice President and 2020 presidential candidate Joe Biden tried to challenge his reputation as a moderate with small ideas.",
      "author": "",
      "content": "DES MOINES, Iowa (AP) — Bristling at Elizabeth Warren’s suggestions that he’s a milquetoast moderate with small ideas, presidential candidate Joe Biden countered Saturday that he offers a “bold” vision for the country and warned that Democratic primary voters should not get distracted by the party’s increasingly tense battle over ideological labels. It was a departure from Biden’s usual campaign speech and signaled perhaps a new phase of Democrats’ search for a nominee to take on President Donald Trump, with Warren, the leading progressive candidate, and Biden, the top choice for most moderates and establishment liberals, ratcheting up the intensity three months ahead of the Iowa caucuses. “The vision I have for this country, there’s nothing small about it. It is like going to the moon,” Biden told supporters in Des Moines, as he hit the high points of a policy slate that would increase the federal government’s spending and scope on everything from health care to the climate crisis. Without naming Warren, the former vice president said his ideas — such as a “public option” to compete alongside private health insurance, as opposed to Warren’s “Medicare-for-All” plan run altogether by the government — actually set the progressive standard in 2020 for a simple reason: They’re more achievable. “I’m not promising anything crazy,” Biden said. “But it’s a vision — a vision of how we can get things done.” With reporters afterward, Biden zeroed in on Warren’s estimated $20 trillion price tag for the first decade of single-payer insurance. “Getting that plan through, even in a Democratic Congress,” Biden predicted, “would be difficult.” Biden’s latest volleys came barely 12 hours after Warren used Iowa Democrats’ annual fundraising gala to draw sharp distinctions in the Democratic field, though she, like Biden, avoided naming opponents. “Anyone who comes on this stage and tells you to dream small and give up early is not going to lead our party to victory,” the Massachusetts senator told thousands of voters sporting t-shirts and waving signs as their preferred candidates took turns on center stage at a downtown Des Moines arena Friday night. Even if “some people in our party don’t want to admit it,” Warren argued, the nation is in “a time of crisis” not just because of Trump’s divisiveness but more so because of an economic and political system rigged against the working class. “If the most we can promise is ‘business as usual’ after Donald Trump,” Warren said, “then Democrats will lose.” The senator doubled-down Saturday, insisting in Vinson, Iowa, that sweeping plans are good politics and perhaps necessary to upend Trump. “We need big ideas to inspire people, to get them to turn out for the caucuses, to turn out and vote,” Warren said. Asked hours later, after an event in Dubuque, if she was suggesting candidates like Biden weren’t being ambitious enough, Warren responded: “Nope. I’m just out here talking about what I’m running on.” “I’m talking about my vision for what it means to build an America going forward that doesn’t just work for a thin slice at the top, but an America that works for everyone,” she said. Still, at the very least, Biden’s reaction suggests frustration over Warren’s apparent momentum, even as he and his aides maintain that his philosophical approach will be successful among both Democratic primary voters and the general electorate. Biden’s proposals, to be clear, put him to the left of recent Democratic nominees, including Hillary Clinton in 2016. But on most points, he falls short of the proposals on the left flank that Warren and her fellow progressive, Sen. Bernie Sanders, have set. Rather than obliterate private insurance, Biden touts a government plan to compete alongside private firms. Rather than government covering all four-year college tuition, Biden pushes two years a taxpayer-paid tuition. On climate, he backs most long-term goals of the left’s “Green New Deal,” but on a longer timeline and with an initially less aggressive crackdown on the fossil fuel industry. “It’s made to look like ‘Well, Biden is coming off with some moderate proposal,’” Biden said Saturday. “There’s nothing moderate about making sure everyone has health care. There’s nothing moderate about getting to net-zero emissions. There’s nothing moderate about fundamentally changing the school system in America so we can effectively complete in the 20th century.” The difference in his proposals, Biden argued: “I tell you straight up how we’re going to pay for it and how much it’s going to cost and how it’s going to get done.” The dynamics Biden faces were crystallized as young climate activists interrupted him and chided him for not doing enough to take on the oil and gas industry. “Let her speak,” the candidate said as his supporters tried to drown out one of the activists. Yet as the small group chanted, sang and ultimately departed, Biden grew more frustrated. “If you’ll notice, they left before I answered her question,” he said. “This is what is going on that’s wrong with our party right now. Everything is taken in contexts that are not accurate.” As his voice calmed, he sought again to widen his appeal. “The way we win is we unify, we come together as Democrats,” he said. “We all have basically the same hopes and dreams. The question is, practically, how we get there. But it’s not a lack of vision.” ___ Associated Press writer Will Weissert contributed to this report from Vinson and Dubuque, Iowa. ___ Follow Bill Barrow on Twitter at https://twitter.com/BillBarrowAP.",
      "date": "11/02/2019 10:42 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Joe Biden Fires Back At Elizabeth Warren For Questioning His Fidelity To Democrats",
      "url": "https://www.huffpost.com/entry/joe-biden-medium-essay-elizabeth-warren_n_5dc20be8e4b0f5dcf8fcd7a2",
      "subtitle": "The two have been sparring over their health care plans.",
      "author": "Lydia O’Connor",
      "content": " Former Vice President Joe Biden escalated his skirmish with Sen. Elizabeth Warren (D-Mass.) over their competing health care plans, writing in an essay Tuesday that she was taking a dangerous “my way or the highway” approach to the issue. In a post on Medium, the Democratic presidential hopeful also zeroed in on comments his rival made last week that he was “running in the wrong presidential primary” and “repeating Republican talking points” by criticizing her “Medicare for All” plan. Warren’s proposal is bolder and more progressive than Biden’s, but also more expensive. “The other day I was accused by one of my opponents of running in the wrong primary. Pretty amazing. On one level, it is kind of funny,” Biden wrote. “But at another level these kinds of attacks are a serious problem,” he continued. “They reflect an angry unyielding viewpoint that has crept into our politics. If someone doesn’t agree with you — it’s not just that you disagree — that person must be a coward or corrupt or a small thinker.” Biden, who pitches himself as more able to win over moderate voters in crucial swing states than Warren or the other major contenders in the Democratic race, emphasized throughout the piece that Warren’s comment “is no way to bring the country together. This is no way for this party to beat Donald Trump” in next year’s presidential election. Warren’s remarks came after Biden’s campaign launched an attack on her Medicare for All plan, accusing her campaign of using “mathematical gymnastics” to hide that its $21 trillion cost would require tax increases on the middle class. Biden, by contrast, is proposing an expansion of former President Barack Obama’s Affordable Care Act and allowing people to keep their private insurance if they want to. The two will face off over health care and other issues more at a Nov. 20 debate alongside that also will feature at least seven other candidates.",
      "date": "11/05/2019 08:32 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Fox News Politics Editor: Biden Would Beat Trump Tomorrow And It Wouldn’t Be Close",
      "url": "https://www.huffpost.com/entry/fox-news-chris-stirewalt-donald-trump-biden_n_5dc29c7ae4b08b735d629bf9",
      "subtitle": "Chris Stirewalt said Democratic presidential candidate Biden has “gotta be in Trump’s head a little bit.”",
      "author": "Lee Moran",
      "content": " Fox News politics editor Chris Stirewalt on Tuesday made a prediction about President Donald Trump’s current election chances. And, based on polling, Stirewalt claimed on “America’s Newsroom” that if an election was held tomorrow between Trump and potential 2020 Democratic candidate Joe Biden, then Biden would win. “And it wouldn’t be a very close race,” Stirewalt said, adding that Biden has got to be “in Trump’s head a little bit.” “But, what Republicans also know is they’re going to spend a billion dollars roughing up Joe Biden,” Stirewalt noted. “They have a lot of money, they are not spending it. Democrats are spending a lot of money on a contested primary,” he continued in video shared by Raw Story. “Trump has got a ton of money, he’s raising money at a fever clip because he doesn’t just get it from the millionaires and billionaires, he also gets it from is grassroots, popular supporters. Trump has all of this money and they are going to light up whatever Democrat emerges from this process.”",
      "date": "11/06/2019 06:09 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Joe Biden Tells K Street Fundraiser: GOP Will Have ‘Epiphany’ After Trump",
      "url": "https://www.huffpost.com/entry/joe-biden-k-street-epiphany_n_5dc332d9e4b00551388225e7",
      "subtitle": "“Mark my words. Mark my words.”",
      "author": "Amanda Terkel",
      "content": " Former Vice President Joe Biden attended a fundraiser in the heart of Washington’s lobbying world on Wednesday, criticizing Sen. Elizabeth Warren (D-Mass.) for being too aggressive and unwilling to give Republicans a chance. “With Donald Trump out of the way, you’re going to see a number of my Republican colleagues have an epiphany. Mark my words. Mark my words,” Biden said. On the same day Biden made his remarks, Senate Majority Leader Mitch McConnell (R-Ky.) was just a few blocks away at the White House, boasting about how he blocked Merrick Garland from getting a seat on the Supreme Court. Garland, of course, was nominated by then-President Barack Obama to fill a vacancy on the Supreme Court when Antonin Scalia passed away. McConnell successfully blocked Garland from even getting a hearing ― all long before Trump came into office. Biden spoke at Sidley Austin, one of the nation’s most powerful law firms literally located on K Street (which has long been shorthand for Washington lobbying). Sidley Austin also has a lobbying practice. Biden, like the rest of the major 2020 Democratic candidates, is not taking money from federal lobbyists. Biden has been going after Warren in recent days after she said he was “running in the wrong presidential primary.” Her comments came in response to Biden’s criticism of how she will pay for “Medicare for All.” Biden said the next president is going to inherit a “divided nation,” and he made the case that he, and not someone like Warren, can make it better. “It’s going to take two things: One is somebody who in fact, knows how to reach across the aisle and get things done,” he said. “Now the people that are running against me tell me I’m naïve, one said I should be in the Republican primary, God love her. That’s not the way you get things done, man. You don’t go in and tell people that they disagree there’s something fundamentally wrong with them.” The attendees applauded at Biden’s remarks. Biden has made these “epiphany” comments before. ″[T]he thing that will fundamentally change things is with Donald Trump out of the White House. Not a joke,” he said in May. “You will see an epiphany occur among many of my Republican friends.” This belief is central to Biden’s pitch: Trump is so bad, and Biden is so good at working across the aisle that bipartisan comity will just suddenly break out if he’s elected. Even in the Obama years, Biden was hopeful that Republicans would finally come around. In November 2012, he predicted that if Obama won a decisive reelection, he could get Republicans to work alongside the administration and that people would see the “fever break.” Republicans showed little willingness to work with Obama after his reelection. On clean energy, Republicans used a failed green energy startup, Solyndra, to question all of the administration’s energy initiatives and cast the president as corrupt. And Republican senators blocked Garland in 2016. Biden recently said he was open to a super PAC backing him. Those entities can raise and spend unlimited sums and often rely on checks worth tens of thousands of dollars from wealthy donors. Many of Biden’s opponents have shunned super PACs this cycle, and two of his progressive competitors ― Warren and Sen. Bernie Sanders (I-Vt.) — also don’t do high-dollar fundraisers.",
      "date": "11/06/2019 05:11 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Zelensky Was Set To Announce Biden Probe On CNN, Then Congress Pressed For Aid: Report",
      "url": "https://www.huffpost.com/entry/military-funds-ukraine-zelensky-cnn-joe-biden-trump_n_5dc4b937e4b02bf5793d2a1d",
      "subtitle": "The New York Times finds more evidence of a quid pro quo: Ukraine’s president was happily off the hook on the investigation once military funds were released.",
      "author": "Mary Papenfuss",
      "content": " Ukraine’s president was preparing to announce a groundless investigation into Joe Biden on CNN — against his better judgment — but managed to duck out of it when Congress pressed Donald Trump to release military aid he was withholding, The New York Times reported. The last thing President Volodymyr Zelensky wanted to do was become entangled in U.S. politics, the Times reported, but he was convinced that the only way he could finally get the appropriated $400 million in U.S. aid was to follow the president’s instructions for announcing an investigation of Biden and his son, according to interviews with Kyiv government officials. If the money wasn’t released by the end of the fiscal year in September, Ukraine risked losing it for good. Zelensky was determined to do what he had to do for the money, even though avoiding partisan U.S. politics was the “first rule of Ukrainian foreign policy,” the Times reported. Aides were arguing in favor of “bowing to what was demanded,” said Petro Burkovskiy, a senior fellow at the Democratic Initiatives Foundation with ties to Ukraine’s government, according to the Times. But the “cost was high,” he added. Trump reportedly expected Zelensky to make a high-profile statement about launching an investigation of his 2020 presidential rival. A top U.S. ambassador to Ukraine, William Taylor, testified before House members that Gordon Sondland, Trump’s appointed ambassador to the European Union, told him the military aid was dependent on Zelensky making a “public statement” about initiating an investigation of Biden. Sondland said that “President Trump wanted President Zelensky ‘in a public box’ by making a public statement about ordering such investigations,” Taylor testified. Zelensky agreed to an interview on CNN during which he was to reveal “investigations that would have played into domestic political affairs,” Taylor told lawmakers. But the military funds were released Sept. 11 after a congressional uproar, just two days before Zelensky was scheduled to appear on CNN. He quickly canceled, the Times reported. The Times story, as well as Taylor’s — and others’ — testimony sharply undercuts Trump’s argument that there was no quid pro quo in his withholding of funds and his July 25 phone call pressing Zelensky for an investigation into Biden and his son. The president, however, is now saying there’s nothing wrong with a quid pro quo using military aid to press Zelensky to investigate his political rival, which would predictably affect the 2020 U.S. presidential election. “The Zelensky team was ready to make this quid quo pro,” Burkovskiy told the Times. “They were ready to do this.”",
      "date": "11/07/2019 09:11 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Jill Biden Tells Trump To Back Off: ‘My Husband’s Going To Beat You’",
      "url": "https://www.huffpost.com/entry/joe-jill-biden-donald-trump-my-husbands-going-to-beat-you_n_5dcaf964e4b04a60650c10dc",
      "subtitle": "The wife of the former vice president and 2020 Democratic hopeful said Trump’s attacks won’t lead him to another term.",
      "author": "Amy Russo",
      "content": " Jill Biden is warning President Donald Trump that when it comes to attacking her husband and attempting to undermine his Democratic bid for the White House, he’s waging a losing battle. “He’s trying to distract the voters,” she told NBC News of Trump’s unsubstantiated corruption allegations against former Vice President Joe Biden and son Hunter. The matter is at the center of House Democrats’ impeachment inquiry into the president, which arose after the public learned Trump pressed Ukrainian President Volodymyr Zelensky to investigate the Bidens based on those unfounded claims. The White House was withholding American military aid from the country at the time, raising questions that the president attempted a quid pro quo. Jill Biden called Trump’s dealings with Ukraine “flat out wrong.” “The fact that he attacked my son, I have never seen that in other elections, that they go after children of the candidate,” she said. She then delivered a direct message to the president: “Stop it. My husband’s going to beat you. Because of your character and because of the strong character my husband has.” The Biden family has found itself repeatedly on the defensive against Trump’s evidence-free assertions, which have been launched in tweets, press conferences and campaign adds ― two of which CNN refused to air over “demonstrably false” content. Last month, Joe Biden, a leading contender among the crowded field of Democrats, addressed Trump’s smears in a Washington Post op-ed, calling him out for “using the highest office in the land to advance his personal political interests instead of the national interest.” “He slanders anyone he sees as a threat,” Biden wrote. “That is why is he is frantically pushing flat-out lies, debunked conspiracy theories and smears against me and my family, no doubt hoping to undermine my candidacy for the presidency.”",
      "date": "11/12/2019 03:01 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Bill Taylor Says Aide Was Told Trump Cared More About Biden Probe Than Ukraine",
      "url": "https://www.huffpost.com/entry/bill-taylor-aide-sondland-impeachment-inquiry-hearing_n_5dcc2d40e4b0d43931cde7b6",
      "subtitle": "The acting U.S. ambassador to Ukraine revealed the new information while testifying at the House impeachment hearings.",
      "author": "",
      "content": "WASHINGTON ― Acting U.S. Ambassador to Ukraine Bill Taylor, while testifying in an impeachment inquiry hearing Wednesday, revealed new information about President Donald Trump’s conversations about Ukraine. In his opening remarks to the House Intelligence Committee, Taylor said one of his staff members told him just last week about a conversation he had with Ambassador to the European Union Gordon Sondland the day after Trump’s July 25 phone call with Ukraine President Volodymyr Zelensky. Taylor said the staff member was at a restaurant with Sondland, who had donated $1 million to Trump’s inauguration committee and was appointed to his envoy role by the president, when Sondland called Trump on July 26. The staff member could hear Trump ask about “the investigations,” according to Taylor. He said Sondland told Trump the Ukrainians were ready to move forward. “Following the call with President Trump, the member of my staff asked Ambassador Sondland what President Trump thought about Ukraine,” Taylor testified. “Ambassador Sondland responded that President Trump cares more about the investigations of Biden, which [Trump’s personal attorney Rudy] Giuliani was pressing for.” Taylor suggested the House Intelligence Committee is following up on his staff member’s revelation. The aide is David Holmes, counselor for political affairs at the U.S. Embassy in Ukraine, according to NBC News and CBS News. The Intelligence Committee on Wednesday announced that he is scheduled to testify behind closed doors on Friday. White House press secretary Stephanie Grisham shrugged off Taylor’s new information about Trump’s alleged call with Sondland, calling it “hearsay.” “The latest ‘evidence’ is an anonymous staffer who told someone he overheard someone else talking to POTUS on the phone,” Grisham said in a statement to CNBC. “All the ‘evidence’ in this case is hearsay.” At a news conference later on Wednesday, Trump said he didn’t recall speaking with Sondland after his call with Ukraine’s president. “I know nothing about that,” Trump said. “First time I’ve heard it. ... I don’t recall. Not at all. Not even a little bit.” Taylor’s revelation about Trump’s call with Sondland came during the first day of public hearings in the House’s impeachment inquiry into Trump. Trump’s dealings with Ukraine, specifically his efforts to get Zelensky to commit to investigating Democratic presidential candidate and former Vice President Joe Biden, were the subject of a whistleblower complaint filed in August and are now the centerpiece of the ongoing impeachment inquiry. Sondland, who had no foreign policy experience prior to becoming ambassador, initially testified on Oct. 17 during a closed-door session before House investigators that he couldn’t recall having any discussions about Biden or taking part in any campaign to pressure Ukraine to investigate him. But Sondland significantly altered his story on Nov. 5 after Taylor and Army Lt. Col. Alexander Vindman contradicted his claims in their depositions. In his amended testimony, Sondland acknowledged that he was involved in Trump’s attempted quid pro quo with the Ukrainian government. He is slated to publicly testify in the impeachment inquiry on Nov. 20. This story has been updated with Trump comments. Antonia Blumberg contributed reporting.",
      "date": "11/13/2019 11:57 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Trump To Kim Jong Un: Joe Biden Is ‘Somewhat Better’ Than A Rabid Dog",
      "url": "https://www.huffpost.com/entry/trump-kim-jong-un-joe-biden-rabid-dog_n_5dd16881e4b0294748190af3",
      "subtitle": "North Korea said the former vice president should “be beaten to death with a stick” for calling Kim a “murderous dictator.”",
      "author": "Amy Russo",
      "content": " President Donald Trump responded to North Korea after its state-run news agency attacked former Vice President Joe Biden as a “rabid dog” who should “be beaten to death with a stick.” In a Sunday morning tweet addressed to North Korean leader Kim Jong Un, Trump expressed mild disapproval of the verbal assault, stating, “Biden may be Sleepy and Very Slow, but he is not a ‘rabid dog.’” “He is actually somewhat better than that, but I am the only one who can get you where you have to be,” the president said, ending his message by encouraging Kim to “get the deal done” on denuclearization. Virtually no progress has been made on the issue. On Thursday, the state-run Korean Central News Agency threatened the Democratic presidential candidate after he criticized Trump’s foreign policy and called Kim a “murderous dictator.” “Anyone who dare slanders the dignity of the supreme leadership of the [Democratic People’s Republic of Korea], can never spare the DPRK’s merciless punishment whoever and wherever,” it said. “And he will be made to see even in a grave what horrible consequences will be brought about by his thoughtless utterances.” The agency continued, “Rabid dogs like Biden can hurt lots of people if they are allowed to run about. They must be beaten to death with a stick, before it is too late,” adding that the former vice president’s demise would “be beneficial for the U.S. also.” Hitting back at the remarks, Biden’s campaign spokesperson Andrew Bates told The Associated Press that it was a sign of Kim’s fear of the 2020 hopeful. “It’s becoming more and more obvious that repugnant dictators, as well as those who admire and ‘love’ them, find Joe Biden threatening,” Bates said. “That’s because he’d restore American leadership in the world on day one by putting our security, interests and values at the heart of our foreign policy.” Unlike North Korea’s treatment of Biden, its regime has praised Trump, including after the ouster of former national security adviser John Bolton. Following Bolton’s departure in September, Kim Myong Gil, North Korea’s chief negotiator for denuclearization talks, reportedly applauded Trump’s “more practical point of view” in pushing out the “troublemaker who used to face everything out of his anachronistic way of thinking.” Trump has also spoken highly of Kim in the past, referring to the dictator as a “great leader” whose country has “a tremendous future.”",
      "date": "11/17/2019 11:56 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Joe Biden Worries Marijuana Is A ‘Gateway Drug,’ Won’t Yet Back Federal Legalization",
      "url": "https://www.huffpost.com/entry/joe-biden-marijuana-2020_n_5dd2b719e4b02947481b6cdc",
      "subtitle": "“There’s not nearly been enough evidence” on whether marijuana leads to other drug use, he said.",
      "author": "Igor Bobic",
      "content": " Former Vice President Joe Biden wants to see more data about the effects of marijuana use before supporting efforts to legalize it on the federal level. “The truth of the matter is, there’s not nearly been enough evidence that has been acquired as to whether or not it is a gateway drug,” the 2020 Democratic presidential contender said at a Nevada town hall on Saturday, according to Business Insider. “It’s a debate, and I want a lot more before I legalize it nationally. I want to make sure we know a lot more about the science behind it.” The majority of marijuana users do not go on to use other, more dangerous substances, according to the Centers for Disease Control and Prevention. But the agency said more research is needed to determine whether it is a “gateway drug.” Scientists have not yet found solid evidence of marijuana leading people to harder drugs more so than other readily available substances like alcohol or tobacco. Support for legalizing marijuana has grown steadily over recent decades ― according to a Gallup poll conducted last month, two-thirds of Americans favor such a policy. Medical use of the drug has been legalized in a majority of the 50 states, and in 11 of them and the District of Columbia recreational use is also permitted. But use and possession of marijuana remains illegal under federal law (even as enforcement of those prohibitions has become more lax). Biden said he supported marijuana use for medical purposes, as well as leaving it to individual states to decide whether to legalize recreational cannabis. “States should be able to make a judgment to legalize marijuana,” Biden said at the town hall. Most of Biden’s rivals in the 2020 Democratic primary race have said they would push to legalize marijuana on the federal level if elected president, including Sens. Cory Booker (N.J.), Elizabeth Warren (Mass.), and Bernie Sanders (Vt.). Senate Minority Leader Chuck Schumer (D-N.Y.), who would become majority leader if Democrats win control of the chamber next year, also supports decriminalizing cannabis on the federal level. Biden has faced criticism over his record of advocating laws that helped fuel the war against drugs and mass incarceration, including the controversial 1994 crime bill. That measure led to much harsher sentences for use and possession of an array of drugs, including marijuana, causing the U.S. prison population to balloon. Minority communities were hit especially hard by the crackdown.",
      "date": "11/18/2019 12:07 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Bernie Sanders’ Strength With Latino Voters Threatens Joe Biden’s Coalition",
      "url": "https://www.huffpost.com/entry/bernie-sanders-joe-biden-latino-voters_n_5dd2f0fae4b02947481c14b7",
      "subtitle": "States with large Latino populations are set to award huge numbers of Democratic delegates.",
      "author": "Kevin Robillard",
      "content": " LAS VEGAS — Vermont Sen. Bernie Sanders is threatening former Vice President Joe Biden’s lead with Latino voters in the 2020 Democratic presidential primary, with the winner set to potentially reap a huge collection of delegates that could prove crucial to deciding who emerges as the Democratic challenger to President Donald Trump. Both men held town halls in Las Vegas this weekend ahead of a Nevada Democratic Party dinner here on Sunday night, and both used the opportunity to highlight their support in the first state to vote with a significant Latino population. Biden is relying on support from Latino and Black voters to keep his campaign alive and collect large sums of delegates to the Democratic National Convention even if he struggles in the early primary states of Iowa and New Hampshire. Sanders’ strength with Latino voters is a direct threat to that strategy. “I think the Latino vote will be the single most important part of the delegate map for any candidate this year,” said Chuck Rocha, a top strategist for Sanders’ campaign. “We’ve made [Latino voters] a part of the general strategy. In other campaigns, it’s been an afterthought. We’re not doing that to prove a point. We’re doing it because it’s smart politics.” Rocha noted Latino voters are a growing presence in Iowa and South Carolina, and a key bloc in Nevada. But the real prize will come on Super Tuesday. Colorado, Texas and California ― all of which are more than 20% Latino, according to census data ― will combine for more than 700 delegates. And other Super Tuesday states, including Oklahoma, North Carolina and Virginia, are home to sizable Latino populations. Their electoral importance means basically every campaign is aggressively courting Latino voters. One of Massachusetts Sen. Elizabeth Warren’s first campaign trips was to Puerto Rico, and her campaign has hired Latino state directors in California, Texas and Florida. South Bend, Indiana, Mayor Pete Buttigieg, who is struggling with voters of color, has hired a Latinx outreach director based in Las Vegas. Former Housing Secretary Julián Castro, who would be the first-ever Latino major-party nominee, has escorted an asylum-seeker to a check-in with Immigrations and Customs Enforcement and is counting on Latinos to turn around his struggling campaign. Despite these efforts, public polling of Latinos generally shows Biden and Sanders in the lead. A Noticias Telemundo poll conducted in late October found Biden earning the support of 26% of Hispanic Democrats nationally, while Sanders collected 18% and Warren was at 10%. Every other candidate was below 5%. A Latino Community Foundation poll of Latino voters in California found 31% planned to vote for Sanders, while 22% are planning to back Biden and 11% will back Warren. Here in Nevada, a Nevada Independent poll found 33% of Hispanic voters in the state backed Biden, 24% backed Sanders and just 11% backed Warren. (One recent poll does break the Sanders vs. Biden duopoly: A Telemundo poll of Texas found Biden earning 33% of the vote of Hispanic Democrats in the state, with Warren at 16% and Sanders at 11%.) Sanders spent almost the entire weekend courting Latino voters, starting with a rally in East Los Angeles with the punk-funk band Ozomatli on Saturday, then with a candidate forum on Latino issues at a California Democratic Party event, and ending with a town hall on immigration at the East Las Vegas Community Center. The 400-person town hall, packed with college students and young adults, highlighted how Sanders’ support among Latinos is driven by ideologically motivated young people, who have dubbed him “Tio Bernie.” Sanders talked extensively about his new immigration plan, which includes the abolishment of both ICE and Customs and Border Protection in their current forms, a moratorium on deportations and the reversal of Trump’s travel ban and policy requiring asylum-seekers to apply from Mexico. “We will stop the demonization of undocumented people in this country,” Sanders told the crowd, calling both Trump a “racist” and a “xenophobe.” “We will not have agents of the federal government ripping tiny babies from the arms of their mothers.” Sanders has more than 80 Latino staffers across the early states and his Washington, D.C., headquarters, and both his political director and California state directors are Latino. Rocha said the staff diversity helps the campaign understand the differences between communicating with Latinos in Iowa, who are frequently recent immigrants, and Chicanos with a long history of activism in Los Angeles. And he noted young Latino staff members, including DACA recipients, helped Sanders craft his immigration plan. Will Lizarraga, a sales manager, was typical of the crowd at the town hall. Wearing a T-shirt bearing the logo of progressive YouTube show The Young Turks, Lizarraga cited Sanders’ long-term support for “Medicare for All” and other liberal policies. “It’s his track record,” Lizarraga said. “Even when I was a little kid, he was fighting for me.” Lizarraga, a U.S. permanent resident, is scheduled to get his citizenship sometime in February. He hopes to become a citizen in time to cast a ballot for Sanders at the Feb. 22 caucus. Rep. Lou Correa (D-Calif.), a member of the Congressional Hispanic Caucus who has endorsed Biden, gave a simple reason for backing the former vice president: He trusts him. Biden was the first candidate to meet with the CHC after launching his campaign, Correa said, and promised to “put his back into” passing comprehensive immigration reform. “He said ‘Absolutely, I’m your person. I’m going to put my political capital into backing immigration reform,’” Correa recalled. Biden is counting on that trust, formed over a long political career, to help him with Latinos. In his appearances both at a town hall and at the Nevada Democratic Party’s First In The West dinner, Biden began by mentioning his long history of campaigning in the state, dating back to former Senate Majority Leader Harry Reid’s first campaign for the Senate in 1986, and running up to his work to elect the Senate’s first-ever Latina, Catherine Cortez Masto, in 2016. “He has a record of being a consensus-builder,” said Correa, a moderate Democrat. “He’s the kind of guy who represents putting politics aside, who represents putting the partisan labels aside, who wants to get work done for the American people.” But Biden’s diverse coalition requires tending. While Sanders was able to spend virtually the whole weekend focused on Latino voters, Biden’s town hall took place at a majority-Black elementary school, and he flew to rural Elko for a town hall on Sunday afternoon. At the town hall in Las Vegas, Biden presented his more mainstream vision for immigration policy, promising to “immediately” reunite families at the border and work to protect DACA recipients and attacking Trump’s anti-immigration rhetoric. “He said, ‘I’m running to get rid of those Mexican rapists,’” Biden said at the town hall. “The words presidents speak matter.” Sanders, meanwhile, implicitly criticized Biden earlier in the weekend, saying at a Univision forum it was not necessary for the Obama administration to deport more than 3 million people. Of course, Sanders’ own record on immigration isn’t flawless: He opposed a 2007 comprehensive immigration reform bill because he objected to guest worker programs that he — and his labor unions — worried would create an underclass of workers.",
      "date": "11/19/2019 02:17 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Kurt Volker Says He Was Clueless That Trump’s Desire For Burisma Probe Was About Joe Biden",
      "url": "https://www.huffpost.com/entry/kurt-volker-testimony-trump-impeachment-ukraine_n_5dd448fce4b08a4325e3f569",
      "subtitle": "The former special envoy to Ukraine is one of many establishment Republicans who tried in vain to change the Trump administration from within.",
      "author": "",
      "content": "WASHINGTON ― Kurt Volker, President Donald Trump’s former special envoy to Ukraine, testified that he was oblivious to the connection between President Donald Trump’s desire for an investigation into the Ukrainian gas company Burisma and targeting former Vice President Joe Biden. Volker was trying to “thread the needle” between a Burisma investigation (which Trump desperately wanted and Volker believed could help convince him to continue supporting Ukraine) and a Biden investigation (which he says he knew would be “unacceptable”). “I now understand most of the other people didn’t see or consider this distinction,” Volker said of investigating Burisma and investigating the Bidens. “For them it was synonymous.” It’s common for Trump administration officials to believe that they can advance broad policy goals without becoming complicit in anything improper. An anonymous administration official has insisted to the public that they are working diligently to “preserve our democratic institutions while thwarting Mr. Trump’s more misguided impulses.” Respected national security officials like John Kelly, H.R. McMaster, and Jim Mattis all thought they could serve as the adults in the room. They all resigned after realizing the futility of that goal. Before Trump was elected president, Volker and friends joked that none of them would want to work in the Trump administration — but they each wanted the other to do it and serve as the voice of reason. Volker felt committed to Ukraine’s future and the fight against Russia, he said Tuesday. He hoped that he could get a skeptical Trump to support that effort by convincing the Ukrainians to give the president what he wanted. But Volker soon learned that the only way to get Trump on board was with what amounted to a demand that a country deeply dependent on U.S. military aid help advance the president’s personal political ambitions. Volker claimed that he thought there was a distinction between “Burisma” and “Biden,” and that he saw investigating them as “different ― the former being appropriate and unremarkable, the latter being unacceptable.” When U.S. Ambassador to the European Union Gordon Sondland brought up the investigations during a meeting with Ukrainian officials, it was an “eye-roll moment,” Volker said Tuesday. “In retrospect, I should have seen that connection differently, and had I done so, I would have raised my own objections,” Volker told the House Intelligence Committee in an open hearing on Tuesday afternoon. Volker later admitted that he “ knew that [Hunter Biden] had been a board member,” but said that he believed that investigating Burisma and investigating former Vice President Biden were “very different things.” Volker is the first of the “three amigos” at the center of the Trump-Ukraine scandal to testify in the impeachment inquiry ― Sondland will appear before the committee tomorrow, while Energy Secretary Rick Perry isn’t scheduled to testify. Volker texted a Ukranian official that they would set up a White House meeting after “President Z convinces trump he will investigate/‘get to the bottom of what happened’ in 2016.” Tim Morrison, a White House National Security Council official who testified alongside Volker, told lawmakers that he was hoping that Trump would have given Ukrainian President Volodymyr Zelensky more support in their phone call in July. Volker said that he didn’t think that the United States foreign policy should be focused on pursuing “conspiracy theories” he believed the Ukranians were floating. “I don’t think that raising 2016 elections or Vice President Biden or these things I consider to be conspiracy theories that have been circulated by the Ukrainians ― particularly the former prosecutor general ― they’re not things that we should be pursuing as part of our national security strategy with Ukraine,” Volker said. This article has been updated with Volker’s comment about Ambassador Gordon Sondland.",
      "date": "11/19/2019 05:53 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Biden Campaign Says Impeachment Hearings ‘Helpful’ To His 2020 Bid",
      "url": "https://www.huffpost.com/entry/joe-biden-impeachment-helpful_n_5dd59adce4b0fc53f20d30b7",
      "subtitle": "The proceedings remind voters “that Donald Trump doesn’t want to have to face Joe Biden at the ballot box,” a senior campaign official said.",
      "author": "Hayley Miller",
      "content": " ATLANTA ― The ongoing impeachment inquiry hearings on President Donald Trump’s dealings with Ukraine are bolstering former Vice President Joe Biden’s 2020 presidential bid, said senior officials with the Democratic candidate’s campaign. Biden campaign officials met with reporters Wednesday ahead of the Democratic presidential debate in Atlanta. Asked whether the former vice president has spent much time watching the impeachment hearings, a senior campaign official said no but that they’ve been “helpful.” “They’ve really reminded people of two things: One, that you have Trump administration officials testifying under oath that Vice President Biden did nothing wrong,” the official said. The official continued: “And two, you’re fundamentally reminding voters every day that Donald Trump doesn’t want to have to face Joe Biden at the ballot box and that’s why he’s being impeached in the first place.” The House’s impeachment inquiry centers on Trump’s efforts to get Ukraine to launch a political investigation into Biden and his alleged decision to use U.S. military aid to the country as leverage. The Biden campaign declined to discuss internal polling that may have demonstrated how impeachment is benefiting the former vice president, pointing to public polling and news headlines generally to show the “net benefit” to Biden’s campaign. As other Democratic candidates like Sens. Kamala Harris of California and Elizabeth Warren of Massachusetts have seen their support in the polls climb and then dip in recent months, Biden has remained the steady front-runner. Americans remain split on whether Congress should impeach and vote to remove Trump from office, according to a PBSNewsHour, NPR and Marist poll released Tuesday. The poll shows little change in public attitudes since the public hearings began last week. A Quinnipiac University poll of likely Democratic voters in South Carolina out this week showed Biden at 33% ― a 20-point lead over the rest of the Democratic pack. Sens. Warren and Bernie Sanders (Vt.) trail the former vice president with 13% and 11%, respectively.",
      "date": "11/20/2019 04:05 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Democrat Presses Gordon Sondland To Admit A Biden Probe Would Benefit Trump",
      "url": "https://www.huffpost.com/entry/maloney-sondland-biden-probe-benefit_n_5dd5b860e4b010f3f1d224b0",
      "subtitle": "The European Union ambassador repeatedly refused to answer Rep. Sean Patrick Maloney’s question during testimony in the House impeachment inquiry.",
      "author": "Lydia O’Connor",
      "content": " Rep. Sean Patrick Maloney (D-N.Y.) got into a heated exchange with Republican donor-turned-ambassador Gordon Sondland at Wednesday’s impeachment hearing when Sondland repeatedly refused to say who stood to gain from investigations into President Donald Trump’s political rivals. “Let me ask you something. Who would have benefited from an investigation of the president’s political opponents?” Maloney asked Sondland, the U.S. ambassador to the European Union who is under scrutiny for his role in shaping Trump’s Ukraine policy. The question was in reference to a call at the center of the impeachment inquiry in which Trump pressured Ukrainian President Volodymyr Zelensky to investigate former Vice President Joe Biden, his political rival, while discussing U.S. aid to Ukraine. Sondland dodged Maloney’s questions, saying, “I don’t want to characterize who would have and who would not have.” Maloney, growing visibly frustrated, asked him five more times to answer him until Sondland said: “I assume President Trump would benefit.” “There we have it,” Maloney said. “See, didn’t hurt a bit, did it?” Sondland’s testimony Wednesday has been largely damning to Trump, with Sondland admitting that the primary focus for Trump and his lawyer Rudy Giuliani was to leverage aid to Ukraine in order to get the country to investigate Biden, whose son once worked for the Ukrainian energy company Burisma, along with other conspiracy theories. “Everyone was in the loop. There were no secrets,” Sondland said of Trump’s pressure on Zelensky. Trump, meanwhile, attempted to characterize Sondland’s testimony as a positive, claiming he had been vindicated and that the impeachment hearings should come to a close.",
      "date": "11/20/2019 06:18 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Joe Biden Says He’d End Aid To Saudis, In Contrast To Obama",
      "url": "https://www.huffpost.com/entry/biden-saudi-arabia-democratic-debate_n_5dd6032be4b0fc53f20db9c3",
      "subtitle": "The former vice president said he’d make Saudi Arabia “a pariah” over its war in Yemen and the murder of journalist Jamal Khashoggi.",
      "author": "Travis Waldron",
      "content": " Joe Biden escalated his calls to end support for Saudi Arabia during Wednesday night’s Democratic primary debate, further separating himself from policies of former President Barack Obama’s administration, in which he served as vice president. Asked how the United States should respond to the brutal murder of former Washington Post journalist Jamal Khashoggi and Saudi Arabia’s ongoing war in Yemen, Biden said he would end arms supplies and turn the regime of Crown Prince Mohammed bin Salman into a global “pariah.” “I would make it very clear we were not going to in fact sell war weapons to them,” Biden said in response to a question from moderator Andrea Mitchell. “We were going to in fact make them pay the price and make them in fact the pariah that they are.” Biden said in May that he would end U.S. support for the Saudis’ war in Yemen, which has contributed to a massive humanitarian crisis in the country. The war has caused thousands of civilian deaths as well as widespread disease outbreaks and starvation epidemics across Yemen. Obama was called upon to end U.S. support for Saudi Arabia over the war, but he never did. Some top former Obama officials also called for end to U.S. support last year. Scrutiny of Saudi Arabia further intensified after the U.S. intelligence community and Turkish officials deemed Salman’s regime responsible for Khashoggi’s murder last year. Khashoggi, who was born in Saudi Arabia and was a prominent critic of Salman, was killed and dismembered after entering the Saudi consulate in Turkey in October 2018. President Donald Trump has continued supporting the regime’s war in Yemen, and he refused to condemn the Saudis for Khashoggi’s murder. “There is very little social redeeming value in the present government in Saudi Arabia,” Biden said Wednesday. “And I would also ... end subsidies we have, end sale of material to the Saudis who were going in and murdering children and murdering innocent people. They have to be held accountable.” Although it represented a break with Obama, Biden’s position is in line with those of congressional members of both parties, including the entire Senate Democratic caucus. The House and Senate have voted in favor of resolutions calling for an end to U.S. support for the war. Trump has blocked attempts to cut funding, and an effort to override his veto in May failed in the Senate. The four senators on the stage with Biden ― Elizabeth Warren (D-Mass.), Cory Booker (D-N.J.), Amy Klobuchar (D-Minn.) and Bernie Sanders (I-Vt.) ― have all voted in favor of ending aid to the Saudi regime. Sanders, a longtime critic of the Yemen war, sponsored the original legislation meant to curtail Saudi assistance.",
      "date": "11/20/2019 11:52 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Joe Biden Fumbled Disastrously After Cory Booker Called Him Out On Race",
      "url": "https://www.huffpost.com/entry/cory-booker-joe-biden-legal-marijuana_n_5dd609cae4b010f3f1d26de6",
      "subtitle": "The senator may have had the line of Wednesday night’s presidential debate while criticizing Biden for his opposition to legalizing marijuana.",
      "author": "Alanna Vagianos",
      "content": " When Sen. Cory Booker (D-N.J.) highlighted former Vice President Joe Biden’s unpopular position on marijuana during Wednesday night’s Democratic presidential debate, it was not a great moment for Biden. And it only got worse from there as the former vice president stumbled repeatedly over sensitive racial issues. Booker went after Biden for stating earlier this week that he would not initially support legalizing marijuana if he were to become president. Biden had said at a town hall in Nevada on Monday that he wants to see more data about the long-term effects of marijuana use before legalizing the drug at the federal level. Biden’s response to Booker quickly got strange when he began touting the support he’s received from the Black community. “I come out of the Black community in terms of my support. If you notice, I have more people supporting me in the Black community ― who have vouched for me ― because they know me,” Biden said, adding that he’s received support from three former chairs of the Black Caucus. Biden fumbled again when he said he’s received support from the “only” African American woman elected to the Senate. “That’s not true ... the other one is here,” Sen. Kamala Harris (D-Calif.) jumped in while throwing her hands up and laughing. Atlanta Mayor Keisha Lance Bottoms, a top Biden supporter, shrugged off the former vice president’s Harris flub, telling reporters after the debate that speaking in soundbites can be “difficult.” “He was there when Kamala Harris was sworn in so clearly he knows that there’s another African-American woman,” Bottoms said. Biden’s fumble came after a statement from Booker on how politicians often use Black voters as pawns in presidential elections. The New Jersey senator used a topic Black voters are passionate about to segue into the smackdown that left the former vice president tripping over his words. “I have a lifetime of experience with Black voters; I’ve been one since I was 18,” Booker said to laughter. “Black voters are pissed off and they’re worried. They’re pissed off because the only time our issues seem to really be paid attention to is when people are looking for their vote.” One issue that disproportionally affects the Black community is the criminalization of marijuana, Booker said. “This week I hear [Biden] literally say that ‘I don’t think we should legalize marijuana.’ I thought you might’ve been high when you said it. Because marijuana in our country is already legal for privileged people … the war on drugs has been a war on Black and Brown people.” Biden’s botched response to Booker was one of many gaffes the former vice president made during Wednesday night’s debate. He routinely stumbled over his words, fumbling several times throughout the two-hour event. Biden didn’t rescind his opposition to marijuana legalization but did say he would decriminalize marijuana and expunge any records of people arrested on marijuana charges. “I do think that it makes sense, based on data, that we should study what the long-term effects are for the use of marijuana,” he added. “That’s all it is.” At the town hall in Nevada, Biden did state that he supported medical marijuana and leaving it up to individual states to decide whether to legalize recreational marijuana. Asked about Biden’s awkward exchange with Booker, Symone Sanders, a senior campaign adviser to Biden, said the former vice president has been “clear on where he stands on the issue of marijuana.” She suggested Booker had simply been looking for a “moment” on the debate stage. “It’s silly season out there,” she told reporters after the debate. HuffPost’s Hayley Miller contributed reporting from Atlanta.",
      "date": "11/20/2019 11:53 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Joe Biden’s Reefer Madness",
      "url": "https://www.huffpost.com/entry/joe-bidens-reefer-madness_n_5dd6d7bae4b0ed5d31a2d983",
      "subtitle": "null",
      "author": "",
      "content": "",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Why Should Anyone Believe Gordon Sondland Didn’t Connect Burisma To Biden?",
      "url": "https://www.huffpost.com/entry/impeachment-hearing-testimony-sondland-volker_n_5dd6bca4e4b0fc53f20fa67c",
      "subtitle": "Does the EU ambassador read the news?",
      "author": "Nick Robins-Early",
      "content": " The second week of House impeachment hearings featured top diplomats and White House officials giving dramatic testimony about President Donald Trump’s effort to coerce Ukraine’s government into launching investigations that would damage political rival and 2020 candidate Joe Biden. But several key officials also gave contradictory or inconsistent accounts of events and their knowledge of the quid pro quo campaign, sometimes radically departing from their initial closed-door testimonies in what appeared to be attempts to limit their accountability in the scandal. United States Ambassador to the European Union Gordon Sondland’s testimony, for instance, was damning and implicated top Trump administration officials, but it was also self-serving with many glaring omissions. Sondland tried to maintain a veneer of innocence throughout the hearing, claiming that he acted in good faith at all times and didn’t know Trump’s push to investigate Ukrainian gas company Burisma had anything to do with Biden. (Biden’s son, Hunter, served on the board of Burisma.) House Intelligence Committee Chair Adam Schiff (D-Calif.) was incredulous that Sondland, who has previously claimed Ukraine was an important part of his portfolio, had no idea about Burisma and the Bidens ― especially given that Trump’s personal lawyer Rudy Giuliani was publicly advocating for an investigation into the company. “Apparently, a lot of people did not make the connection,” Sondland claimed. Former U.S. envoy to Ukraine Kurt Volker gave a similar excuse for not raising concerns about the quid pro quo effort toward Ukraine, claiming that he didn’t know that Burisma was tied to Biden and saying he only found out about it in late September. “I did not understand that others believed that any investigation of the Ukrainian company, Burisma, which had a history of accusations of corruption, was tantamount to investigating Vice President Biden. I drew a distinction between the two,” Volker said, claiming that in hindsight he should have made the connection. Former National Security Council aide Tim Morrison, too, claimed he had to Google what Burisma was due to his unfamiliarity with the company. But Morrison, Sondland and Volker’s denials are questionable given that Giuliani’s interest in Burisma and its link to Biden was front-page news in The New York Times as early as May 1, and for months Giuliani was openly calling on Ukraine to launch investigations that would damage Biden. The effort to pressure Ukraine over Burisma had been covered by numerous major media outlets, and had been floating around as a conservative talking point since at least early 2019. Sondland claiming he did not connect Biden to Burisma wasn’t the only time his account appeared to downplay his involvement in the quid pro quo effort, as he also contradicted other officials’ testimony regarding a July 10 meeting with Ukrainian officials at the White House. Sondland testified that his recollection of the meeting did not square with accounts from officials including Lt. Col. Alexander Vindman and former top National Security Council official for Europe and Russia Fiona Hill. Both stated that Sondland had talked about investigations with Ukrainian officials during the meeting, and Hill added that it was not credible Sondland could have been oblivious that investigating Burisma was essentially code for the Bidens. Hill testified again on Thursday that Ukrainian officials brought up their desire for a White House visit during a July 10 meeting. As national security adviser John Bolton tried to deflect from answering the Ukrainians, Sondland interjected with a reference to the quid pro quo arrangement. “Ambassador Sondland leaned in, basically to say, ‘Well we have an agreement that there will be a meeting if specific investigations are put underway,’” Hill said. “That’s when I saw Ambassador Bolton stiffen.” Hill testified that Bolton then immediately excused himself from the meeting. Bolton later instructed Hill to go to the National Security Council’s top lawyer John Eisenberg and tell him that Bolton was not involved in “whatever drug deal Sondland and [White House Chief of Staff Mick] Mulvaney are cooking up.” Hill took the “drug deal” to mean the exchange of investigations targeting Biden in exchange for a meeting with Trump. The July 10 meeting was an early source of discrepancies in the investigation, and Volker initially denied in his closed-door testimony last month that Sondland raised investigations in the July 10 meeting. But Volker changed his account this week after witnesses such as Hill brought up the meeting and evidence mounted that Volker, Sondland and Energy Secretary Rick Perry were part of a back channel to Ukraine that pushed for a quid pro quo. “The meeting was essentially over when Ambassador Sondland made a general comment about investigations. I think all of us thought it was inappropriate,” Volker said in his opening statement. “We asked you about that meeting during your deposition and you told us nothing about this,” Schiff asked Volker later in the hearing. “Why didn’t you tell us about this?”",
      "date": "11/21/2019 06:01 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Lindsey Graham Begins Senate Investigation Into The Bidens",
      "url": "https://www.huffpost.com/entry/lindsey-graham-senate-bidens_n_5dd70109e4b00149f7194f5a",
      "subtitle": "The GOP senator decided to indulge an unsubstantiated right-wing theory as the Trump impeachment inquiry marches on.",
      "author": "Sara Boboltz",
      "content": " Senate Judiciary Committee Chairman Lindsey Graham (R-S.C.) sent a letter to Secretary of State Mike Pompeo requesting documentation on former Vice President Joe Biden and his son Hunter’s work in Ukraine on Thursday, as the week’s public impeachment inquiry hearings in the House drew to a close. In his two-page letter, Graham asked for a number of call transcripts, notes and communications involving Joe Biden, former Ukrainian President Petro Poroshenko, former Secretary of State John Kerry, a former Ukrainian prosecutor and people connected to the Ukrainian energy company Burisma. While the impeachment proceedings target President Donald Trump’s dealings with current Ukrainian President Volodymyr Zelensky, Trump’s Republican supporters have attempted to steer the discussion toward the Bidens, claiming that the father-son pair were involved in Ukrainian corruption. The anti-Biden theory may stem from the work of right-wing columnist John Solomon, who has used his writing to elevate questionable sources. Although no evidence has emerged to support the theory, some Republicans are now loudly alleging that then-Vice President Biden pushed Ukraine to fire a prosecutor, who may or may not really have been investigating Burisma, in order to shield Hunter Biden, who served on Burisma’s board at the time. In fact, many officials back then ― including Republicans ― thought that the prosecutor in question was ineffective against corruption and that his office needed to be reformed. That was a view shared by the Obama administration and key European allies. Nevertheless, Graham made a tenuous connection between Hunter Biden and Ukrainian corruption in his letter. On the same day in 2016 that Ukrainian officials raided the home of Burisma’s founder, Graham wrote, Hunter Biden began following a State Department official on Twitter. Graham suggested that fact indicated that “the two may have initiated conversations regarding Prosecutor General [Viktor] Shokin’s investigation into Burisma.” The date was Feb. 4, 2016. In the weeks afterward, Graham wrote, Joe Biden held several phone conversations with then-President Poroshenko to discuss removing Shokin over allegations that he himself was corrupt. The prosecutor was removed on March 29, 2016. Graham’s request covers communications between the parties from the day Hunter Biden followed then-Deputy Secretary of State Tony Blinken on Twitter to the day of Shokin’s ouster. The senator did not specify a deadline for the materials’ delivery. In the ongoing impeachment inquiry, witnesses have bolstered allegations that Trump leveraged military aid and a coveted White House meeting to improperly pressure the current Ukrainian president to investigate the Bidens. Joe Biden is among the many Democrats seeking to take on Trump in the 2020 presidential election and several national polls have consistently shown Biden leading the president in hypothetical match-ups. Language has been adjusted to clarify allegations relating to Victor Shokin.",
      "date": "11/21/2019 06:10 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Lindsey Graham Opens Biden Investigation",
      "url": "https://www.huffpost.com/entry/lindsey-graham-opens-biden-investigation_n_5dd7e291e4b02c23f5b066ae",
      "subtitle": "null",
      "author": "",
      "content": "",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Joe Biden Is ‘Disappointed And Angered’ By Lindsey Graham’s Investigation",
      "url": "https://www.huffpost.com/entry/joe-biden-lindsey-graham-hunter-biden-investigation_n_5dd85117e4b0913e6f6c6363",
      "subtitle": "The South Carolina senator had once said the former vice president was “as good a man as God ever created.”",
      "author": "David Moye",
      "content": " Two words described Joe Biden’s reaction to the news that old friend Lindsey Graham had launched an investigation of him and of his son Hunter’s work in Ukraine: “disappointed” and “angered.” Graham’s investigation indulges an unsubstantiated right-wing theory that Biden pushed Ukraine to fire a prosecutor in order to shield Hunter, who was serving on the board of Burisma Holdings, a Ukranian natural gas company, at the time. Biden told CNN’s Don Lemon that he believed Graham was being coerced into doing the investigation. They have Graham “under their thumb right now,” Biden said. “They know he knows if he comes out against [Donald] Trump, he’s got a real tough road for reelection.” Biden didn’t mince words about how being investigated by a friend who once called him “as good a man as God ever created” made him feel. “Number one. I am disappointed, and, quite frankly I’m angered by the fact that he knows me,” Biden said. “He knows my son. He knows there’s nothing to this. Trump is now essentially holding power over him that even the Ukrainians wouldn’t yield to.” Biden predicts things aren’t going to end well for Graham. “Lindsey is about to go down in a way I think he’s going to regret his whole life,” Biden said, before addressing his old friend from the Senate personally. “Lindsey, I’m just embarrassed by what you’re doing ― for you! I mean, my lord,” Biden said. You can see the exchange below. CNN analyst Gloria Borger speculated at the end of the clip that Biden feels especially “betrayed” by Graham since one of his campaign arguments is that he will be able to work with Republicans.",
      "date": "11/22/2019 05:22 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Giuliani Crony Can Detail Nunes’ Meeting With Ex-Ukraine Official To Get Biden Dirt: Report",
      "url": "https://www.huffpost.com/entry/rudy-giuliani-lev-parnas-devin-nunes-joe-biden_n_5dd8a90ee4b0913e6f6cba16",
      "subtitle": "Lev Parnas’s lawyer says he’s willing to tell Congress that GOP Rep. Devin Nunes went to Vienna to talk to the prosecutor who was ousted over corruption issues.",
      "author": "Mary Papenfuss",
      "content": " Rudy Giuliani’s indicted associate Lev Parnas is prepared to tell Congress that Rep. Devin Nunes (R-Calif.) met with a former Ukrainian prosecutor who was ousted over corruption concerns in a bid to get dirt on Joe Biden, CNN reported Friday. A lawyer for Parnas, a Soviet-born American who has been indicted on federal campaign finance violations, said his client found out about the European meeting directly from the Ukrainian official. “Mr. Parnas learned from former Ukrainian Prosecutor General Viktor Shokin that Nunes had met with Shokin in Vienna last December,” attorney Joseph Bondy told CNN. Shokin was forced out of office by Ukraine’s Parliament in 2016 under pressure from the U.S. and other Western nations over concerns he was soft on corruption. As vice president at the time, Biden was active in pushing for Shokin’s ouster. Bondy also told CNN that Parnas worked to connect Nunes, the top Republican on the House Intelligence Committee, with other Ukrainians who allegedly could come up with negative information on former Vice President Biden and the Democrats. If true, Nunes would be the first member of Congress linked to gathering opposition research on President Donald Trump’s political rival from a former foreign official, CNN noted — and one with a score to settle with Biden, who had pushed for Shokin’s ouster. Nunes declined repeated requests from CNN to comment. The attorney told CNN that Parnas is willing to comply with a congressional subpoena for documents and testimony as part of its impeachment inquiry. Information could prove explosive for Nunes. Parnas worked with Shokin and Giuliani to peddle the baseless claims that Ukraine — not Russia — interfered in the 2016 election on behalf of the Democrats and that Biden’s actions in Ukraine were corrupt because his son was on the board of a Ukrainian company. Bondy indicated in a tweet that he is already talking to congressional leaders about Parnas’s cooperation with the impeachment investigation.",
      "date": "11/23/2019 12:25 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    }
  ]
}