{
  "articles": [
    {
      "title": "Mitch McConnell Plans To Change The Rules Again To Confirm Trump Judges",
      "url": "https://www.huffpost.com/entry/mitch-mcconnell-senate-rules-trump-judges_n_5ca0e902e4b0bc0dacaa2800",
      "subtitle": "The GOP leader, who blocked lots of Obama’s court picks, is ready to make it easier to confirm district judges now.",
      "author": "Jennifer Bendery",
      "content": " WASHINGTON ― He changed the rules to make it easier to confirm President Donald Trump’s Supreme Court picks. He tossed out Senate traditions to make it easier to confirm Trump’s circuit judges. So, naturally, Senate Majority Leader Mitch McConnell (R-Ky.) wants to adjust the rules again to make it easier to confirm the rest of Trump’s nominees to lifetime seats on federal courts. The Senate will vote this week to reduce its debate time for most nominees ― district court judges and lower-level executive nominees ― from 30 hours to two hours. This will not apply to Cabinet secretaries, Supreme Court nominees or circuit court nominees. Without a whiff of irony, McConnell, whose greatest legacy is denying a Supreme Court seat and dozens of other federal court seats to President Barack Obama, said Thursday that the rule change is necessary because of Democrats’ “unprecedented obstruction” of Trump’s nominees. “Obstruction for obstruction’s sake,” bemoaned McConnell, who was so Machiavellian about denying Obama the ability to confirm judges that he drove Republicans to block their own nominees and fueled a vacancy crisis on federal courts. It would take 67 votes to make the rules change. All 45 Democrats, along with the two independent senators who caucus with them, are expected to vote against it. But the 53 Republicans could still get it done if they invoke the so-called “nuclear option,” a more confrontational approach that would allow them to change the rules with a simple majority, or 51 votes. It’s not clear if McConnell is prepared to go nuclear to make the change, but he’s previously suggested that he is. Since Trump became president, McConnell has used the nuclear option to lower the vote threshold for confirming Supreme Court nominees from 60 to a simple majority. He’s also endorsed repeated violations of the “blue slip” rule, a Senate tradition of only moving forward with a judicial nominee when both of his or her home-state senators sign off on it. Those changes, along with his latest push to make another rule change, are all part of McConnell’s grand plan: to use Trump’s presidency to put piles of young, anti-abortion, anti-LGBTQ, anti-voting rights ideologues into lifetime federal court seats before Trump is up for reelection in 2020. “He just wants to confirm as many as possible in case Trump loses,” said Carl Tobias, a University of Richmond law professor and an expert on judicial nominations. McConnell and the White House have made filling circuit court vacancies their top priority so far, and they’ve had quite a run. The Senate has confirmed 37 circuit judges to date. That’s so many circuit judges ― more than any other president by this point in his first term ― that 1 in 5 seats on circuit courts is filled by a judge nominated by Trump. They’ve focused on circuit courts because these courts often have the last word in federal cases. The Supreme Court only hears about 100 to 150 appeals from the more than 7,000 cases that come before the nation’s 13 circuit courts each year. But now McConnell is turning his attention to district courts, where there are a whopping 129 vacancies. Democrats are likely to have more say in who the nominees are for these court seats, as Republicans appear willing to honor the blue-slip rule for them. “Many are less ideological and conservative than the circuit picks and are recommended by home-state senators who usually suggest them because they are competent to move the cases,” said Tobias. “For example, a number are magistrate judges or state court judges.” If Republicans succeed in changing the rules this week, they could conceivably fill most empty district court seats during Trump’s first term, leaving few to fill after 2020, when a Democrat might be in the White House. Senate Democrats aren’t thrilled by any of this, but there’s little they can do in the minority ― especially if McConnell keeps weakening the few tools afforded to them to block judicial nominees they don’t support. “McConnell’s approach has always been to manipulate Senate rules when it helps him and then change Senate rules when the tables turn,” Senate Minority Leader Chuck Schumer (D-N.Y.) said in a statement. “This is just another step in his effort to limit the rights of the minority and cede authority to the administration.”",
      "date": "03/31/2019 02:24 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "McConnell Won’t Say If Senate Would Confirm Herman Cain For Federal Reserve Board",
      "url": "https://www.huffpost.com/entry/mcconnell-wont-say-if-senate-would-confirm-herman-cain-for-federal-reserve-board_n_5cb08225e4b082aab084895d",
      "subtitle": "Three GOP senators — Utah’s Mitt Romney, Alaska’s Lisa Murkowski and North Dakota’s Kevin Cramer — told AP they’d likely vote against Cain.",
      "author": "",
      "content": "WASHINGTON (AP) — Senate Majority Leader Mitch McConnell declined to say Thursday whether he thinks his chamber would confirm Herman Cain to join the Federal Reserve board, casting doubt on the former Republican presidential candidate’s prospects should President Donald Trump advance him for the post. Asked if a Cain nomination would face problems, McConnell, R-Ky., noted that successful nominees must pass background checks and have a likelihood of confirmation. “And, as you know, some of my members have expressed concern about that nomination,” McConnell told reporters. “But as far as I know, it hasn’t been made yet.” Trump’s interest in potentially nominating Cain along with another political ally, conservative commentator Stephen Moore, has sparked questions among lawmakers from both parties in Congress about the president’s influence on the central bank. Fed Chairman Jerome Powell reiterated the importance of the Fed’s independence during a talk Thursday evening with House Democrats meeting in Virginia for their annual issues retreat, according to a source in the room unauthorized to discuss the private session. Powell told lawmakers that he saw his role as totally apolitical. He also said the Fed does not consider political pressure in its decision making, the source said. Another source in the room confirmed the remarks. The chairman fielded questions from lawmakers during a question-and-answer session in Lansdowne, but declined to comment on the president’s potential picks. Powell was Trump’s choice to lead the Fed, but the president has been critical of him for raising interest rates. Earlier Thursday, House Speaker Nancy Pelosi said elevating Cain and Moore to the Fed would risk politicizing the nation’s central bank and endangering the economy. “These two appointments to the Fed are the worst, ill-suited appointment that the president could come up with,” she told reporters. Three GOP senators — Utah’s Mitt Romney, Alaska’s Lisa Murkowski and North Dakota’s Kevin Cramer — told The Associated Press they’d likely vote against Cain. With Republicans controlling the Senate 53-47, it would take opposition from just four GOP senators to sink the nomination, assuming all Democrats are also “no” votes. As he did earlier this week, McConnell also sidestepped a question about whether he would back Cain or Moore, a Fed critic and former Trump campaign aide, for the board. Trump has said he will nominate both men. “We’ll see who’s actually nominated,” said McConnell. Cain has run into concerns by lawmakers from both parties that, as a Trump loyalist and deeply conservative political figure, he would threaten the Fed’s traditional political independence. Trump himself has taken a nontraditional approach to the Fed, repeatedly accusing it of mismanaging the economy by not pushing hard enough for low interest rates. The White House offered no fresh comment Thursday about Trump’s intentions, referring reporters to his earlier comments about Cain. Trump initially called Cain “a very terrific man” who would “do very well there.” But he said earlier this week that he didn’t know how Cain was faring in the vetting process and that Cain “will make that determination” whether to continue. Cain, former CEO of Godfather’s Pizza, ran for the 2012 Republican presidential nomination. He dropped out of the race after allegations of sexual harassment and infidelity, which he denied. Last year, in September, he helped found a pro-Trump super political action committee, America Fighting Back PAC, whose website says, “We must protect Donald Trump and his agenda from impeachment.” Cain formerly served on the board of the Fed’s Kansas City regional bank. He has also called for a return to the gold standard to control inflation, which most economists consider unworkable. Moore is a conservative commentator and another Trump political ally. ___ AP Congressional Correspondent Lisa Mascaro in Lansdowne, Virginia, and writer Darlene Superville in Washington contributed to this report.",
      "date": "04/12/2019 08:34 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell Proposes Raising Age For Tobacco Products To 21",
      "url": "https://www.huffpost.com/entry/mitch-mcconnell-raise-tobacco-age_n_5cb8878ae4b09dc528cee150",
      "subtitle": "The Senate majority leader appealed to farmers in his home state to grow more hemp.",
      "author": "Ryan Grenoble",
      "content": " While the political world focused on the Mueller report Thursday morning, Senate Majority Leader Mitch McConnell (R-Ky.) was back in his home state, telling farmers to plant more hemp. McConnell made the urging at a news conference in Louisville, where he announced plans for legislation to raise the nationwide minimum age to buy tobacco products to 21 from 18. He said he expected to introduce the measure in May to restrict access to all tobacco products, including e-cigarettes and vaping devices. “My legislation will be similar to the current system, where retailers have the responsibility to verify the age of anyone buying tobacco products — we’ll just raise the age from 18 to 21,” McConnell said in a statement. Military personnel would be exempt. Eleven states, in addition to Washington, D.C., and Guam, already have laws raising the purchasing age of tobacco products, according to the Preventing Tobacco Addiction Foundation. McConnell’s home state of Kentucky is not among those. An effort to raise the tobacco purchase age there failed in February amid concerns it might hurt the state’s already shrinking tobacco industry. Tobacco used to be a cash crop for Kentucky farmers, but that’s no longer the case. The state was expected to grow 57,000 acres in 2018, down from 200,000 acres in the 1990s, according to the National Agricultural Statistics Service. The state’s new bumper crop: hemp, which may turn out to be more profitable. Kentucky has been a leader in developing a hemp industry and McConnell has long been a prominent booster. He teamed with Democratic Sen. Ron Wyden of Oregon earlier this year to ask the U.S. Department of Agriculture to quickly finish regulations allowing the industry to operate. Tobacco use is the leading preventable cause of death and disease in the U.S., according to the Centers for Disease Control and Prevention. While cigarette smoking among middle school and high school students has been declining for seven years, e-cigarette use has soared. More than 20 percent of high schoolers vaped on a monthly basis in 2018. The Food and Drug Administration last year proposed reducing the amount of nicotine in cigarettes, which would reduce their addictiveness and harm to public health.",
      "date": "04/18/2019 12:30 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell Promises To Be The ‘Grim Reaper’ Of Progressive Policies",
      "url": "https://www.huffpost.com/entry/mitch-mcconnell-grim-reaper_n_5cbf217be4b05ff3a8c3c261",
      "subtitle": "null",
      "author": "",
      "content": "",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell Declares ‘Case Closed’ On Mueller Investigation",
      "url": "https://www.huffpost.com/entry/mitch-mcconnell-mueller-report-investigation-trump_n_5cd18ee4e4b0548b73600e86",
      "subtitle": "The Senate GOP leader urged Democrats to move on from investigating Donald Trump.",
      "author": "Igor Bobic",
      "content": " Senate Majority Leader Mitch McConnell (R-Ky.) says it’s time for Democrats to move on from special counsel Robert Mueller’s report and their own probes of President Donald Trump, and instead focus on “real challenges” facing the country. “They told everyone there had been a conspiracy between Russia and the Trump campaign. Yet on this central question, the special counsel’s finding was clear: Case closed,” McConnell said Tuesday. “This ought to be good news for everyone. But my Democratic colleagues seem to be publicly working through the five stages of grief.” “This investigation went on for two years,” he added. “It’s finally over.” Democrats have been calling for weeks to hear testimony from some of the biggest figures in Mueller’s report, including the special counsel himself and former White House counsel Don McGahn, who threatened to resign his post in 2017 after Trump attempted to pressure him to fire Mueller. In a tweet on Sunday, Trump said Mueller “should not testify” before Congress, even though he’d signaled last week that he would not stand in the way of such a hearing. House Democrats this week moved toward holding Attorney General William Barr in contempt for failing to turn over a complete, unredacted version of the Mueller report and its underlying evidence. The Justice Department, meanwhile, maintains that the House Judiciary Committee “lacks any legislative purpose for seeking the complete investigative files” and that it was inappropriate to “open up the entirety of the investigative file to congressional review.” McConnell defended Barr in his remarks Tuesday, calling him a “distinguished” public servant and accusing Democrats of “undermining the institution of the attorney general itself.” “The Democrats are angry,” McConnell said. “They seem to be angrier at Bill Barr for doing his job than they are Vladimir Putin.” Notably, McConnell did not touch on any details contained in the second half of the Mueller report on Trump’s extraordinary conduct as president. Mueller ultimately concluded it was not his role to determine whether Trump broke the law, but his report laid out 10 areas of potential obstruction of justice by the president. Senate Minority Leader Chuck Schumer (D-N.Y.) called McConnell’s comments an “astounding bit of whitewashing.” “It’s sort of like Richard Nixon saying ‘let’s move on’ at the height of the investigation of his wrongdoing. Of course he wants to move on. He wants to cover up,” Schumer said Tuesday, vowing to continue pressing for investigations. The Democratic leader also repeatedly hammered McConnell for not putting an election security bill on the floor, chiding Republicans for not taking seriously the threat of Russian interference in the 2020 election. Sen. Amy Klobuchar (D-Minn.) said last week that the Trump administration worked to block bipartisan legislation she co-sponsored with Sen. James Lankford (R-Okla.) intended to make elections more secure. “If Leader McConnell is ready to move on to serious things, then how about moving forward with legislation to protect our elections?” Schumer said.",
      "date": "05/07/2019 11:08 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell: ‘Case Closed’ On Mueller",
      "url": "https://www.huffpost.com/entry/mitch-mcconnell-case-closed-on-mueller_n_5cd1b202e4b0770fb2d5bc4e",
      "subtitle": "null",
      "author": "",
      "content": "",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell Broke From Precedent Again To Confirm A Trump Judge",
      "url": "https://www.huffpost.com/entry/mitch-mcconnell-trump-judges-senate-precedent_n_5cd30f57e4b07ce6ef798268",
      "subtitle": "For the third time in history, the Senate advanced a judicial nominee over the objections of both home-state senators.",
      "author": "Jennifer Bendery",
      "content": " While most of Washington was focused on a House hearing to hold Attorney General William Barr in contempt of Congress, Senate Republicans on Wednesday confirmed another one of President Donald Trump’s picks for a lifetime court seat ― and once again broke from precedent to get it done. The Senate voted 54-42 to confirm Joseph Bianco to the U.S. Court of Appeals for the Second Circuit, based in New York. Every Republican voted for him. All but two Democrats ― Sens. Doug Jones (Ala.) and Joe Manchin (W.Va.) ― opposed him. Sens. Cory Booker (D-N.J.), Amy Klobuchar (D-Minn.), Lisa Murkowski (R-Alaska) and Kirsten Sinema (D-Ariz.) did not vote. Bianco’s confirmation marks the third time in history that the Senate has confirmed a judicial nominee over the objections of both of a nominee’s home-state senators. Sens. Chuck Schumer and Kirsten Gillibrand, both New York Democrats, didn’t turn in their so-called “blue slips” for Bianco, which are literally blue pieces of paper that signal a senator is ready to move forward with a nominee from his or her home state. Traditionally, the Senate won’t move forward with a judicial nominee unless both blue slips are turned in. Some nominees have advanced with one turned in. “Another day, another partisan push by Senate Republicans for hard-right nominees to get lifetime appointments on the federal bench,” Schumer said in March, after the Judiciary Committee voted to advance Bianco over his objection. “I will be strongly opposing these nominations when they come to the Senate floor.” Majority Leader Mitch McConnell (R-Ky.) has overseen all three cases of the Senate breaking from this tradition. Earlier this year, he plowed ahead with confirming judges Eric Miller and Paul Matey to circuit courts over the objections of both of their home-state senators. Bianco, 52, is currently a district judge and a member of the conservative Federalist Society, which has been driving Trump’s judicial selection process by funneling nominees to the White House who oppose abortion rights, LGBTQ rights and voting rights. He’s also Trump’s 38th confirmed circuit court judge. That’s more circuit judges than any president has gotten by this point in a first term, and means that one in every six seats on the nation’s circuit courts is now filled by a Trump nominee.",
      "date": "05/08/2019 03:25 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell’s Campaign Team Is Selling Cocaine-Themed T-Shirts",
      "url": "https://www.huffpost.com/entry/cocaine-mitch-mcconnell-campaign_n_5cd40242e4b0db2524b6777c",
      "subtitle": "The #CocaineMitch tops are raising eyebrows.",
      "author": "Lee Moran",
      "content": " Cocaine overdose deaths may be rising in the U.S. But that isn’t stopping Senate Majority Leader Mitch McConnell’s (R-Ky.) reelection campaign team from raising money by selling a cocaine-themed T-shirt. Team Mitch, the official campaign Twitter feed for McConnell, shared images of the new $35 shirt online with the hashtag #CocaineMitch on Wednesday. The garment features a depiction of McConnell alongside what appears to be a cloud of coke dust. “Cartel Member,” is emblazoned on the back. A tweet posted by the campaign urged voters to “become an official member of the Cartel!” The “Cocaine Mitch” nickname went viral in 2018 after former coal baron Don Blankenship, who lost the GOP primary for the U.S. Senate in West Virginia, infamously called McConnell the term in a campaign ad. The moniker referred to reports that a ship belonging to a company owned by McConnell’s father-in-law was once found carrying about 90 pounds of the drug, reports The Washington Post. Team Mitch responded to Blankenship’s loss at the time with this post: The new T-shirt has sparked debate on Twitter, with some people accusing McConnell’s campaign of trivializing drug abuse and contradicting Republicans’ often hard-line stance on related issues. YASSSSSSSSSSSSSSSSS https://t.co/AloMtxWDGg",
      "date": "05/09/2019 07:32 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell And Tim Kaine Want To End Tobacco Sales To Anyone Under 21",
      "url": "https://www.huffpost.com/entry/mcconnell-kaine-tobacco-age-21_n_5ce38371e4b08770099384f8",
      "subtitle": "The senators pointed to a meteoric rise in vaping among teenagers.",
      "author": "Nick Visser",
      "content": " Senate Majority Leader Mitch McConnell (R-Ky.) and Sen. Tim Kaine (D-Va.) introduced new legislation on Monday that would raise the legal age to purchase tobacco products nationwide to 21. The bipartisan pair, who both hail from states that have relied on tobacco as a cash crop for generations, said their proposal is driven in large part by the dramatic increase in the use of e-cigarettes and vaping devices by teenagers. “We’ve heard from countless parents who have seen the youth vaping crisis firsthand, and together, Senator Kaine and I are addressing this public health crisis head-on,” McConnell said in a statement Monday announcing the Tobacco-Free Youth Act. “By making it more difficult for tobacco products to end up in the hands of middle school and high school students, we can protect our children and give them the opportunity to grow and develop into healthy adults. We’re ready for a national debate about the health of our children.” The senators cited figures from the Centers for Disease Control and Prevention that found 1.5 million more young people smoked e-cigarettes in 2018 than they did in 2017, a precipitous rise that researchers have called unprecedented. Vaping devices far outstripped other tobacco consumption methods, including cigarettes, cigars or smokeless tobacco. “Today, we are coming together to side with young people’s health. With this bipartisan legislation, Senator McConnell and I are working to address one of the most significant public health issues facing our nation today,” Kaine said in a statement. He called the increased age restrictions a “critical” effort to keep tobacco out of schools and “away from our children.” The proposed act does not have carve-outs that some health advocates had worried would be included. McConnell said last month he wanted the legislation to exempt military members, but the measure introduced Monday would apply to everyone. States would also not be prohibited from passing even tougher laws. Fourteen states and many cities have already raised the minimum age to purchase tobacco products. Many tobacco and vaping companies have already said they back the proposal to increase the federal sales age. Juul, which has seen a meteoric rise in sales and social clout in recent years, said in April it would support McConnell in his efforts when the plans were first announced. “Tobacco 21 laws fight one of the largest contributors to this problem — sharing by legal-age peers — and they have been shown to dramatically reduce youth usage rates,” Kevin Burns, Juul’s chief executive, told The New York Times last month. The proposal was cheered by health advocacy groups, including the American Heart Association, which said the legislation would “help remove tobacco from high schools altogether.” “We commend Majority Leader McConnell and Sen. Kaine for prioritizing the health of teens and young adults with a bill to raise the national sales age for tobacco products to 21,” Nancy Brown, the CEO of the American Heart Association, said in a statement. “We urge strong bipartisan support for this bill as written, and we call on lawmakers to reject any effort to add language that would weaken its impact or benefit tobacco companies.” McConnell touted his new proposal on the Senate floor Monday while explaining the importance of tobacco in Kentucky’s history, noting the new law would not be a “zero-sum choice between farmers and public health.” “We are proud of who we are,” the majority leader said, “But Kentucky farmers don’t want their children to get hooked on tobacco products while they’re in middle school or high school any more than any parents anywhere want that to happen.” He continued: “Kentucky is proud of what we make. But we also take pride in the health and development of our children. And the sad reality is that Kentucky has been the home to the highest rates of cancer in the country.”",
      "date": "05/21/2019 05:47 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Stephen Colbert Hits Mitch McConnell With Supreme Warning: ‘Payback’s A Mitch!’",
      "url": "https://www.huffpost.com/entry/stephen-colbert-mitch-mcconnell_n_5ce4ac9ee4b0547bd12ece78",
      "subtitle": "The “Late Show” host showed the Senate majority leader how his own past could come back to haunt him.",
      "author": "Ed Mazza",
      "content": " Stephen Colbert appears to be enjoying the irony of the latest legal twist in a court case involving President Donald Trump. Trump lost when he went to court to try to block a House committee from obtaining his financial records, and his attorney vowed to appeal to the D.C. Circuit Court of Appeals ― the chief judge of which is Merrick Garland, as Colbert pointed out. Then-President Barack Obama nominated Garland to the Supreme Court in 2016, but Republicans, led by Mitch McConnell, refused to hold a vote to confirm him. Trump nominated Neil Gorsuch for the high court after winning the 2016 election, and Garland returned to the D.C. Circuit Court of Appeals. “Brace yourself, Senator McConnell,” Colbert warned Tuesday. “Because payback’s a Mitch.”",
      "date": "05/21/2019 11:44 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "McConnell Bill Accused Of Being A Smoke Screen For Big Tobacco",
      "url": "https://www.huffpost.com/entry/tobacco-mcconnell-bill-smoking_n_5ce6b3b6e4b0db9c29944632",
      "subtitle": "Some advocates are worried that efforts to raise the legal smoking age to 21 are being used as a “Trojan horse” for large tobacco companies.",
      "author": "Igor Bobic",
      "content": " WASHINGTON ― Anti-tobacco advocates are raising alarms about a bill introduced by Senate Majority Leader Mitch McConnell (R-Ky.) and Sen. Tim Kaine (D-Va.) this week that would raise the legal age to purchase tobacco products nationwide from 18 to 21. While they support the overall goal of the legislation, some advocates worry that a provision in the bill essentially requiring each state to pass a law raising the tobacco-purchasing age to 21 ― on top of the federal statute ― would ultimately be used by tobacco companies to undermine rules governing the sale of certain products like flavored tobacco. McConnell and Kaine, who both hail from states that have relied on tobacco as a cash crop for generations, have pitched the bill as a way to help stem the dramatic increase in the use of e-cigarettes and vaping devices by teenagers ― a fast-growing share of the tobacco market that is projected to reach $47 billion by 2025. The senators cited figures from the Centers for Disease Control and Prevention that found 1.5 million more young people smoked e-cigarettes in 2018 than in 2017, a precipitous rise that researchers have called unprecedented. “By making it more difficult for tobacco products to end up in the hands of middle school and high school students, we can protect our children and give them the opportunity to grow and develop into healthy adults. We’re ready for a national debate about the health of our children,” McConnell said in a statement Monday announcing the Tobacco-Free Youth Act. The bill is backed by an unusual coalition made up of tobacco industry giants such as Altria and vaping company Juul, as well as major public health groups like the American Cancer Society, the American Academy of Pediatrics, the American Heart Association and the American Lung Association. Tobacco companies are touting the bill as evidence of their commitment to keeping tobacco products out of the hands of young people. But critics worry that by forcing states to raise their own laws (or else risk not getting federal substance abuse grants), the tobacco industry will be allowed to push poison pill provisions in cities and localities to block stricter rules on the use of tobacco. The fear of some lawmakers and advocates is that the industry is essentially executing a tactical retreat on the minimum age of buying tobacco amid growing pressure from the Food and Drug Administration in order to protect a growing and increasingly profitable share of the market. “We strongly urge Leader McConnell to join us in cleanly raising the tobacco age to save lives and prevent youth addiction, and work with us on additional efforts, including cracking down on kid-friendly flavors,” Sens. Brian Schatz (D-Hawaii) and Dick Durbin (D-Ill.) said in a statement this week. Vince Willmore, a spokesman for the nonprofit organization Campaign for Tobacco-Free Kids, echoed the Democrats’ concerns about the bill. He describing the efforts by tobacco companies to weaken regulations in states as a “Trojan horse.” “Forcing each state to pass their own law would create both the opportunity and the leverage for tobacco companies to add their special interest provisions,” Willmore added. Fourteen states and many cities have already raised the minimum age to purchase tobacco products. The tobacco industry and its allies have historically used ― and continue to use ― preemptive strategies to thwart regulations on smoking laws. Earlier this year in Arkansas, for example, the tobacco lobby successfully added a preemption measure that prohibits local governments from passing regulations related to tobacco sales onto a similar law that raised the tobacco-purchasing age to 21. Tobacco lobbyists have pushed “preemption” measures in other states as well. Juul, in particular, has deployed a small army of lobbyists focused on fighting proposals to ban flavored e-cigarette pods, which are popular with teenagers, as well as other enforcement measures, according to The New York Times. Kaine, however, told reporters on Wednesday that the bill would “absolutely not” allow states and localities to preempt other tobacco regulations. In fact, he said the legislation allows states to enact even stricter rules governing tobacco products. Raising the purchasing age from 18 to 21 “would be a big win for public health and I think everybody is coming to that position, which is great,” Kaine added. The Virginia senator, whose state includes the headquarters of Altria, argued that creating incentives for states to match federal law on the minimum purchasing age for tobacco would bolster enforcement in states because “if you have an administration that doesn’t care about enforcing the law, then the law is minimally enforced because state and local health officials don’t enforce federal laws.” The FDA already conducts enforcement of federal smoking laws under the Tobacco Control Act, which currently prohibits tobacco sales to anyone under 18. The government’s enforcement efforts of the law would be unchanged under the McConnell-Kaine legislation. The effectiveness of proposed FDA regulations governing e-cigarettes at certain stores is also under question in the age of the internet. Thirty-two percent of teens who bought their e-cigarette devices got them online, according to a recent study. Moreover, according to the same study, 64 percent of teens don’t buy their own devices at all ― they get them from friends or family members who have purchased them. A bill introduced by Sens. Dianne Feinstein (D-Calif.) and John Cornyn (R-Texas) earlier this year aims to address teen use of e-cigarettes by requiring an ID check upon delivery of e-cigarettes ordered online. Correction: A previous version of this story incorrectly characterized comments by a Campaign for Tobacco-Free Kids representative. Vince Willmore described efforts by tobacco companies using laws raising the legal smoking age to restrict other regulations on tobacco use as a “Trojan horse,” not the McConnell legislation itself.",
      "date": "05/23/2019 06:46 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "New Yorker Gives Trump ‘Enablers’ McConnell, Graham, Barr A Humiliating New Job",
      "url": "https://www.huffpost.com/entry/new-yorker-trump-mcconnell-graham_n_5ce76a55e4b05c15dea9cf3b",
      "subtitle": "The magazine calls out three of the president’s biggest boosters in Washington.",
      "author": "Ed Mazza",
      "content": " The New Yorker magazine has turned three of President Donald Trump’s biggest allies in the Republican Party into his shoeshine boys in next week’s cover image. The illustration by Barry Blitt shows Senate Majority Leader Mitch McConnell (R-Ky.), Sen. Lindsey Graham (R-S.C.) and Attorney General William Barr kneeling and polishing the president’s shoes: Blitt said he faced one challenge with the portrait: Assembling an image with the President’s enablers presented a problem: Who to include, who to leave out? I barely had enough room for the President himself. In any case, I expect there will be other opportunities to draw Devin Nunes, Matt Gaetz, Jim Jordan, Sean Hannity, etc., etc., etc.",
      "date": "05/24/2019 02:32 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell Says He’d Go After Supreme Court Vacancy In 2020: ‘We’d Fill It’",
      "url": "https://www.huffpost.com/entry/mitch-mcconnell-supreme-court-2020_n_5cedc377e4b0ae671058a60d",
      "subtitle": "The Senate majority leader blocked Merrick Garland’s nomination during the Obama administration in 2016, purportedly because it was an election year.",
      "author": "Nick Visser",
      "content": " Senate Majority Leader Mitch McConnell (R-Ky.) said Tuesday he would work to fill any Supreme Court vacancy in 2020, an election year, despite his efforts to scuttle Judge Merrick Garland’s nomination to the bench for that very reason in 2016. “Uh, we’d fill it,” McConnell said in response to an audience question during an event at the Paducah Chamber of Commerce in Kentucky on Tuesday afternoon. The lawmaker issued a small smile during his answer as guests in the room laughed. He continued: “The reason I started with the judges ... I mean, if you want to have a long-lasting positive impact on a country, everything else changes.” McConnell’s office did not immediately reply to HuffPost’s request for clarification of his remarks. The senator’s comments are notable, given his rhetoric during the final months of former President Barack Obama’s tenure in the White House. McConnell refused to hold any debate on Garland, Obama’s nominee to fill the vacancy created by the death of Supreme Court Justice Antonin Scalia in February 2016, saying no one should be considered until after that year’s presidential election. Filling the vacancy on the court ultimately fell to President Donald Trump, who named Justice Neil Gorsuch to the bench. McConnell has shifted his story in recent months, saying in an interview with Fox News last October that he didn’t want to “destroy” Garland, but was following “tradition in America.” “If you have ... a Senate of a different party than the president, you don’t fill a vacancy created in a presidential year,” McConnell told Fox News host Chris Wallace. “That went all the way back to 1888.” At the time, he declined to say if he would confirm a Supreme Court nomination in 2020 if Trump were in the midst of a reelection battle. In an interview with The New York Times earlier this year, McConnell called his blocking of Garland the most important thing he’d done in his political career, saying: “I think the most consequential call I made was before President Trump came to office.” “The decision not to fill the Scalia vacancy,” the senator said. “I think that’s the most consequential thing I’ve ever done.” McConnell echoed those sentiments on Tuesday and said he hoped his efforts to overhaul America’s judiciary will make a lasting mark on the country’s history. “What can’t be undone is a lifetime appointment to a young man or woman who believes in the quaint notion that the job of a judge is to follow the law,” McConnell said during the event. “So that’s the most important thing that we’ve done for the country, which cannot be undone.”",
      "date": "05/28/2019 08:14 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Harvard Constitutional Law Professor Unloads On ‘Flagrant Dickhead’ Mitch McConnell",
      "url": "https://www.huffpost.com/entry/harvard-law-professor-mitch-mcconnell_n_5cf0f6cce4b0e8085e381e5e",
      "subtitle": "Laurence Tribe used a blistering tweet to accuse the Republican Senate majority leader of hypocrisy over his plans to fill any Supreme Court vacancy next year.",
      "author": "Lee Moran",
      "content": " A Harvard constitutional law professor hit out at Mitch McConnell on Twitter after the GOP Senate majority leader revealed he would seek to fill any Supreme Court vacancy in 2020. Laurence Tribe accused McConnell of hypocrisy in a concise yet blistering tweet that has gone viral. McConnell infamously did not allow Merrick Garland, who was former President Barack Obama‘s Supreme Court nominee, a hearing in 2016 because he said it was too close to the presidential election. “Hypocrisy is McTurtle’s middle name,” wrote Tribe. “And his first and last name too.” “What a flagrant dickhead!” he added. Tribe has become a vocal critic of Trump and earlier this year sought an injunction against the president’s national emergency to secure funds to build a wall on the U.S.-Mexico border. Earlier on Thursday, Tribe also mocked Trump for claiming the word “impeachment” is “dirty,” “filthy” and “disgusting.”",
      "date": "05/31/2019 06:16 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Freshmen Dems Bash Mitch McConnell While Calling For A Senate Vote On Their Reform Bill",
      "url": "https://www.huffpost.com/entry/democrats-hr-1-mitch-mcconnell_n_5cf80235e4b0638bdfa39553",
      "subtitle": "H.R. 1 passed the House in March. But Majority Leader McConnell refuses to allow a Senate vote on it.",
      "author": "Paul Blumenthal",
      "content": " Nearly every freshman House Democrat sent a letter on Wednesday to Senate Majority Leader Mitch McConnell (R-Ky.) calling on him to bring the sweeping campaign finance and election reform bill passed by the House to the Senate floor for a vote. The For The People Act (H.R. 1) would create a system of publicly financed House elections, expand voting rights by mandating early voting and automatic voter registration, enhance election security and enact ethics reforms like requiring presidential candidates to disclose their tax returns. It passed the House on a 234-193 party-line vote on March 8. Sen. Tom Udall (D-N.M.) has introduced a companion bill in the Senate backed by every Senate Democrat. McConnell, a fierce opponent of campaign finance reform, has attacked the bill a “power grab” by the Democratic Party and refused to bring it to the Senate floor for a vote.  As majority leader, he is under no obligation to bring any piece of legislation to the Senate floor for a vote. The freshmen Democrats calling on McConnell to give their bill a vote in the Senate attacked McConnell as a “bought-and-paid-for” representative of the Washington elite on Wednesday at a press conference hosted by End Citizens United, a pro-campaign finance reform political action committee. “Mitch McConnell remains in the pockets of the special interests,” Rep. Max Rose (D-N.Y.) said. “He won’t even take a meeting with us,” Rose added. “At this point, I’m thinking the only way we can get a meeting with Mitch McConnell is if we take out our checkbooks and max out to him. That’s the only reason why he sits down with people cause he is bought-and-paid-for.” Rep. Sharice Davids (D-Kansas) said that McConnell “continues to defend a rigged system.” New Hampshire Rep. Chris Pappas (D) added: “Mitch McConnell doesn’t know what democracy looks like.” McConnell is even refusing to allow a vote on a piece of the For The People Act that would enhance election security by protecting election infrastructure from potential hacks or other interference, Rep. Tom Malinowski (D-N.J.) said. “He has no argument for holding up legislation to protect our democracy from foreign interference,” Malinowski said. “He is putting party over country.” These House freshmen won election in 2018 by running on issues like campaign finance reform and expanding voting rights. Those calling on McConnell to give the For The People Act a vote in the Senate had previously sent a letter during the 2018 campaign calling on House leadership of both parties to prioritize these issues. McConnell has promised not to bring this bill ― or practically any bill passed by House Democrats ― to the Senate floor. While Democrats want a vote on their bill, they also plan to use McConnell’s refusal in their 2020 election campaign to showcase their support for reforming Washington and the Republican Party’s opposition.",
      "date": "06/05/2019 03:51 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Jon Stewart Shreds ‘White Whale’ Mitch McConnell Over 9/11 Bill Response",
      "url": "https://www.huffpost.com/entry/jon-stewart-mitch-mcconnell-911-bill-first-responders_n_5d06bf5ae4b0985c419fae43",
      "subtitle": "“I want to make it clear that this has never been dealt with compassionately by Senator McConnell,” Stewart said on “Fox News Sunday.”",
      "author": "Amy Russo",
      "content": " Jon Stewart skewered Senate Majority Leader Mitch McConnell’s (R-Ky.) response to efforts to safeguard funding for 9/11 first responders, accusing him of acting without compassion for the victims. In a “Fox News Sunday” interview, the comedian addressed his now-viral speech before House lawmakers during which he shamed congressional leaders for dragging their feet when it comes to permanently reauthorizing the September 11th Victim Compensation Fund. Stewart took direct aim at McConnell during an interview with host Chris Wallace. “In terms of getting the 9/11 bills passed, Mitch McConnell has been the white whale of this since 2010,” he said, referring to his alleged attempt to use previous reauthorization of the funding stream as leverage to accomplish separate GOP initiatives. Stewart said Washington leaders’ “cynicism” was part of the reason the issue is fraught with emotion. On Tuesday, the former “Daily Show” host spoke to House Judiciary Committee members at a hearing on the Victim Compensation Fund. In February, the fund’s administrator announced that it is running out of money “to pay all current and projected claims at the same levels as under current policies and procedures.” The VCF “provides financial compensation for those who were physically injured or died as a result of an eligible 9/11-related illness,” according to its website. In some cases it may cover medical expenses for first responders who are sick and dying from illnesses believed to have been contracted as a result of the terror attacks. The separate World Trade Center Health Program is the primary line of coverage for medical claims. Stewart used the opportunity to call out legislators for “delay after delay after delay of searching for some must-pass bill to tuck their issue into because this Congress, this Senate didn’t think it was important enough to pass on its own.” “Let me tell you something: We are done with that,” he warned. Though the committee unanimously approved the bill in a scheduled vote the next day, McConnell said he hadn’t spent much time considering the measure. “Gosh, I hadn’t looked at that lately,” he said earlier in the day, according to NBC News. “I’ll have to. We’ve always dealt with that in a compassionate way, and I assume we will again.” Stewart dismissed the response altogether. “I want to make it clear that this has never been dealt with compassionately by Senator McConnell,” he said on “Fox News Sunday.” “He has always held out to the very last minute, and only then, under intense lobbying and public shaming, has he even deigned to move on it.” Before moving on to the Senate, the bill will need to pass a full House vote, which has been set for July, according to CBS New York. CLARIFICATION: This article has been amended to clarify that the Victim Compensation Fund is not the primary fund for medical claims.",
      "date": "06/16/2019 07:54 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell Says He’s Not Sure Why Jon Stewart Is ‘Bent Out Of Shape’ Over 9/11 Bill",
      "url": "https://www.huffpost.com/entry/mitch-mcconnell-jon-stewart_n_5d078c2be4b0304a1212e5fd",
      "subtitle": "The comedian blasted the Senate majority leader a day earlier for not doing enough to help 9/11 responders and their families.",
      "author": "Hayley Miller",
      "content": " Senate Majority Leader Mitch McConnell (R-Ky.) on Monday fired back at Jon Stewart after the comedian accused him of dragging his feet on legislation that would benefit first responders of the Sept. 11 terrorist attacks. Stewart, a longtime advocate for 9/11 responders, tore into Republican lawmakers during an interview with “Fox News Sunday” for their reluctance to reauthorize the September 11th Victim Compensation Fund (VCF), which is facing a significant funding lapse. “I want to make it clear that this has never been dealt with compassionately by Sen. McConnell,” Stewart told Fox News, referring to past VCF legislation. “He has always held out to the very last minute, and only then, under intense lobbying and public shaming, has he even deigned to move on it.” The hosts of “Fox & Friends” on Monday asked McConnell about Stewart’s criticism and why congressional votes on the fund often occur at the “last minute.” “Well, many things that Congress have at the last minute,” McConnell said. “We’ve never failed to address this issue. And we will address it again. I don’t know why he’s all bent out of shape.” Host Steve Doocy noted that Stewart was outraged that so few members attended a House subcommittee hearing about the bill last week, where he gave an emotional testimony about the needs of 9/11 responders and their families. Out of the subcommittee’s 14 members, just half showed up, CBS News reported. “Well, that frequently happens because members have a lot of things going on at the same time,” McConnell said. “It sounds to me like he’s looking for some way to take offense. There’s no way we won’t address this problem appropriately.” Asked if the VCF will be fully funded, McConnell said yes. The Never Forget the Heroes Act of 2019 would ensure the fund can deliver benefits to 9/11 responders for the next 70 years. Stewart has visited Capitol Hill several times in recent months to advocate on behalf of the fund’s beneficiaries. Roughly 45,000 people are suffering from at least one 9/11-related chronic health condition and more than 10,000 have been certified with a 9/11-related cancer, Stewart wrote in an op-ed for the New York Daily News in February. The Justice Department announced earlier that month that a lack of funding for the VCF would lead to compensation cuts as large 50 to 70 percent. A total of 835 awards have been reduced as of May 31, The Associated Press reported. “Your indifference is costing these men and women their most valuable commodity: time,” Stewart told lawmakers on Tuesday. “It’s the one thing they’re running out of.” The House Judiciary Committee unanimously approved the bill on Wednesday. Before heading to the Senate, the proposed legislation will need to pass a full House vote, which has been scheduled for July.",
      "date": "06/17/2019 10:30 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Fed-Up Jon Stewart Unloads On Mitch McConnell In Searing ‘Late Show’ Smackdown",
      "url": "https://www.huffpost.com/entry/jon-stewart-mitch-mcconnell_n_5d08426fe4b0886dd15dc9f9",
      "subtitle": "Former “Daily Show” host hits the Senate majority leader with a savage false apology.",
      "author": "Ed Mazza",
      "content": " Former “Daily Show” host Jon Stewart is firing back at Senate Majority Leader Mitch McConnell (R-Ky.), who this weekend shrugged off the former “Daily Show” host’s impassioned call for Congress to reauthorize the September 11th Victim Compensation Fund (VCF). “I don’t know why he’s all bent out of shape,” McConnell said on Fox News on Sunday. Stewart replied on “The Late Show With Stephen Colbert” on Monday night: “I’m bent out of shape for them. These are the first heroes and veterans and victims of the great trillions-of-dollars war on terror. And they’re currently still suffering and dying and still in terrible need.” Over the weekend, McConnell also said lawmakers who skipped Stewart’s visit to Capitol Hill last week probably just had other things going on. Stewart offered a mocking non-apology. “I feel like an asshole,” he said. “I didn’t mean to interrupt them with their jobs.” Stewart accused McConnell of using 9/11 heroes as political pawns and called on Congress to pass the act extending health care to the first responders of the 2001 terrorist attacks. Then he wondered what would happen if McConnell ever needed help in an emergency by offering up a blunt hypothetical:",
      "date": "06/17/2019 11:33 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Chuck Schumer: It’s Possible To Shame Mitch McConnell Into Action",
      "url": "https://www.huffpost.com/entry/mitch-mcconnell-chuck-schumer_n_5d09011ce4b06ad4d2567c06",
      "subtitle": "This tactic hasn’t worked well for Democrats in the past, though.",
      "author": "Igor Bobic",
      "content": " WASHINGTON ― It’s possible to shame Senate Majority Leader Mitch McConnell (R-Ky.) into action despite his record of blocking Democratic initiatives and nominations, Senate Minority Leader Chuck Schumer (D-N.Y.) said Tuesday. “It seems Jon Stewart is having an effect on him on the 9/11 bill, so yes, I think it’s possible,” Schumer told HuffPost during a news conference on Capitol Hill, referring to the former host of Comedy Central’s “The Daily Show.” Stewart, a longtime advocate for 9/11 responders, tore into McConnell last week during an interview on Fox News. He accused the Senate majority leader of slow-walking a bill that would authorize compensation for first responders and survivors still suffering from conditions related to the 2001 attacks on the World Trade Center. “Many things that Congress does happen at the last minute,” McConnell said Monday in response. “We’ve never failed to address this issue. And we will address it again. I don’t know why he’s all bent out of shape.” McConnell has not yet said when he’ll bring to the floor legislation that would permanently reauthorize the September 11th Victim Compensation Fund, which is nearing depletion and expires in 2020. Congress has previously dealt with the matter by attaching it to other must-pass bills. The Kentucky Republican has also steadfastly refused to allow votes on any Democratic bills passed by the House, including legislation on gun control, equal pay, lower prescription drug prices, and additional protections for preexisting health conditions. The blockade has frustrated many House Democrats, who have taken to accusing McConnell of turning the upper chamber into a “legislative graveyard.” Schumer, meanwhile, has repeatedly called on the GOP leader to bring to the floor legislation that would beef up election security following special counsel Robert Mueller’s report on Russian interference in the 2016 election. But on that matter, too, McConnell has refused to comply, calling such bills duplicative and unnecessary. Schumer told reporters Tuesday that Democrats will go to the floor to try to bring up election security bills by unanimous consent, requiring GOP senators to block them. He also said Democrats would push for additional election security funding in the upcoming budget and appropriations negotiations. But there’s little Democrats can actually do to force McConnell to allow a vote. Attempts to shame McConnell into action haven’t worked well for Democrats in the past. He refused to grant Merrick Garland, President Barack Obama’s Supreme Court nominee, a confirmation hearing. He also successfully blocked several of Obama’s proposed initiatives during his second term. What has moved McConnell, however, has been substantial pressure from other GOP senators. The debate over how to advance Democratic priorities if McConnell retains a majority in the Senate in 2020 has become an issue on the campaign trail. Former Vice President Joe Biden this week reiterated his belief in bipartisan cooperation but also said compromise is not always possible. “You have to go out and beat these folks if they don’t agree with you by making your case, and that’s what presidents are supposed to do, to persuade the public,” Biden said Monday at an event in D.C., adding that “you can shame people to do things the right way.” But one former Obama administration official disagreed. “Maybe you can shame people,” tweeted Alyssa Mastromonaco, who worked as White House deputy chief of staff. “You can’t shame McConnell. It would be dope to find a path to greater bipartisanship but this isn’t that path.”",
      "date": "06/18/2019 02:36 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell Says Obama’s Election Means We Don’t Need Reparations",
      "url": "https://www.huffpost.com/entry/mitch-mcconnell-rejects-reparations_n_5d094aa6e4b0f7b7442860b6",
      "subtitle": "“I don’t think reparations for something that happened 150 years ago for whom none of us currently living are responsible is a good idea,” McConnell said.",
      "author": "Amy Russo",
      "content": " Senate Majority Leader Mitch McConnell (R-Ky.) on Tuesday dismissed the idea of modern-day reparations for slavery, arguing that civil rights legislation and former President Barack Obama’s election show they are unnecessary. “I don’t think reparations for something that happened 150 years ago for whom none of us currently living are responsible is a good idea,” McConnell told reporters at a press conference. The senator then listed the ways in which he felt America’s slave-holding past has been addressed already. “We’ve tried to deal with our original sin of slavery by fighting a civil war, by passing landmark civil rights legislation. We’ve elected an African American president,” he said. “I think we’re always a work in progress in this country, but no one currently alive was responsible for that, and I don’t think we should be trying to figure out how to compensate for it.” On Wednesday, the House Judiciary Subcommittee on the Constitution, Civil Rights and Civil Liberties is slated to hold a hearing on reparations featuring testimonies from actor Danny Glover and author Ta-Nehisi Coates, who thrust the matter back into the national dialogue with his 2014 Atlantic essay “The Case for Reparations.” The hearing will fall on Juneteenth, the American holiday commemorating the emancipation of slaves. It is expected to cover HR 40, a bill sponsored by Rep. Sheila Jackson Lee (D-Texas) to establish a commission to study reparations and develop relevant proposals. However, in his Tuesday remarks, McConnell argued it would “be pretty hard to figure out who to compensate.” “We’ve had waves of immigrants as well who’ve come to the country and experienced dramatic discrimination in one kind or another, so no, I don’t think reparations are a good idea,” he said. According to the committee, Wednesday’s hearing will “examine, through open and constructive discourse, the legacy of the Trans-Atlantic Slave Trade, its continuing impact on the community and the path to restorative justice.” Reparations have become a hot topic among 2020 Democratic presidential hopefuls, many of whom have been pressed on whether they’d support the idea. So far, candidates including former Texas Rep. Beto O’Rourke, South Bend, Indiana, Mayor Pete Buttigieg, and Sens. Cory Booker (N.J.), Kirsten Gillibrand (N.Y.), Kamala Harris (Calif.), Amy Klobuchar (Minn.), Bernie Sanders (Vt.) and Elizabeth Warren (Mass.) have expressed support for either implementing reparations of some kind or at least considering them.",
      "date": "06/18/2019 06:38 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Ta-Nehisi Coates Rebuts McConnell’s Rejection Of Reparations",
      "url": "https://www.huffpost.com/entry/ta-nehisi-coates-rebuts-mcconnells-rejection-of-reparations_n_5d0a6d75e4b077af7c55f976",
      "subtitle": "null",
      "author": "",
      "content": "",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Ta-Nehisi Coates Calls Out Mitch McConnell At House Hearing On Slavery Reparations",
      "url": "https://www.huffpost.com/entry/ta-nehisi-coates-mitch-mcconnell-slavery-reparations_n_5d0a4f07e4b0f7b7442a8616",
      "subtitle": "Coates’ 2014 Atlantic essay “The Case for Reparations” is largely credited with bringing discussion of reparations back into the national spotlight.",
      "author": "Julian Shen-Berro",
      "content": " Writer Ta-Nehisi Coates called out Senate Majority Leader Mitch McConnell (R-Ky.) on Wednesday for his claim that it didn’t make sense to pay reparations for something that occurred more than a lifetime ago. “This rebuttal proffers a strange theory of governance: that American accounts are somehow bound by the lifetime of its generations,” Coates told a House panel discussing the possibility of reparations for slavery. He noted that the United States paid pensions to heirs of Civil War soldiers into this century and continues to honor treaties hundreds of years old. “We recognize our lineage as a generational trust, as inheritance, and the real dilemma posed by reparations is just that: a dilemma of inheritance.” McConnell argued against reparations when he spoke to reporters in a press conference on Tuesday. “I don’t think reparations for something that happened 150 years ago for whom none of us currently living are responsible is a good idea,” he said. “I think we’re always a work in progress in this country, but no one currently alive was responsible for that, and I don’t think we should be trying to figure out how to compensate for it.” Coates delivered his remarks Wednesday before a House Judiciary subcommittee in a hearing on H.R. 40, a bill that would create a commission to study and develop reparation proposals for African Americans. It was the first hearing held on slavery reparations in over a decade. “The Case For Reparations,” Coates’ 2014 essay for The Atlantic, is largely credited with bringing the issue back into the national spotlight. “Enslavement reigned for 250 years on this shore,” Coates said in his remarks. “For a century after the Civil War black people were subjected to a relentless campaign of terror — a terror that extended well into the lifetime of Majority Leader McConnell.” He spoke to the continued impact of slavery that occurred during McConnell’s lifetime: the execution of 14-year-old George Stinney in 1944; the blinding of Isaac Woodard by police in 1946; “a regime premised on electoral theft” in McConnell’s birth state of Alabama; the harassment and jailing of those who pushed for civil rights legislation. “That is the thing about Sen. McConnell’s ‘something,’” he said. “It was 150 years ago and it was right now.” Many 2020 Democratic presidential candidates have expressed support for the implementation or consideration of some form of slavery reparations, and House Speaker Nancy Pelosi has indicated support for the bill. If passed in the House, the bill is unlikely to find support in the Senate. “The question really is, not whether we will be tied to the ‘somethings’ of our past, but whether we are courageous enough to be tied to the whole of them,” Coates concluded.",
      "date": "06/19/2019 01:19 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell Will Be The Boogeyman Of The 2020 Elections",
      "url": "https://www.huffpost.com/entry/mitch-mcconnell-boogeyman-2020-elections_n_5d117739e4b07ae90da243b2",
      "subtitle": "Republicans and Democrats alike are trying to turn the senator from Kentucky into American politics’ ultimate antagonist.",
      "author": "Kevin Robillard",
      "content": " Democrats are preparing to make Senate Majority Leader Mitch McConnell a central villain of their push to win total control of Congress in 2020, an effort top advisers to the Kentucky Republican say will only further his efforts to become a conservative hero. “Mitch McConnell is a transcendent figure in American politics; he is a unifier. He unites everyone in hatred and animosity toward him, including Republicans,” said Matt Canter, a Democratic pollster at Global Strategy Group who recently conducted a survey that could guide Democrats’ anti-McConnell efforts. “He’s a walking, talking definition of what people hate about Washington and the corrupt political system today.” The focus on painting McConnell as corrupt and obstructionist, on display in early Democratic messaging, coincides with efforts by McConnell’s own advisers to portray him as a Grim Reaper slashing down progressive dreams as he runs for reelection in Kentucky. The dual pushes seem likely to ensure that McConnell’s record as the leader of the Senate is at the center of the 2020 elections, especially in the states that will ultimately determine who wins a majority of seats in the upper chamber. Republicans hold a 53-47 majority in the Senate, meaning Democrats need to win a net of at least three seats in 2020. The poll, paid for by the Democratic campaign finance reform group End Citizens United, surveyed 1,200 voters across twelve presidential battleground states. The initial result found Democrats with a 3 percentage point advantage on a generic ballot for Congress. After being exposed to messaging about McConnell, the Democratic advantage grew to 12 percentage points. That was more effective than messages about President Donald Trump (6 percentage points) or congressional Republicans overall (9 percentage points). McConnell’s approval rating among swing-state voters in the survey is just 26%, with 50% viewing him unfavorably. Among independents, just 18% view him favorably, and 58% have a negative opinion. In counties that swung from former President Barack Obama to President Trump, his approval rating is 25%, while 53% have a negative opinion. End Citizens United is presenting the findings to Democratic congressional leaders, as well as the Democratic Congressional Campaign Committee and the Democratic Senatorial Campaign Committee. But the anti-McConnell focus is already clear in early messaging from Democratic Senate candidates. Three highly touted Democratic Senate candidates ― Iowa’s Theresa Greenfield, Texas’ M.J. Hegar and Maine House Speaker Sara Gideon ― all focus on McConnell’s influence in their campaign launch videos. Hegar refers to her potential opponent, Sen. John Cornyn, as “that tall guy lurking behind Mitch McConnell in basically every single video.” “He calls himself ‘Big John,’ but he shrinks out of the way while Mitch McConnell gets in the way of anything actually getting done in our government,” Hegar says in the video. Gideon highlighted McConnell’s promise of financial support for GOP Sen. Susan Collins, while Greenfield claimed her opponent, Sen. Joni Ernst, voted with McConnell 99% of the time. While McConnell has been a prominent Democratic boogeyman since at least the start of Obama’s administration, the Democratic base is increasingly aware of McConnell after his starring roles in the blockade of Supreme Court nominee Merrick Garland and the successful nomination of Justice Brett Kavanaugh. The DSCC’s fundraising messages now focus heavily on McConnell. “When President Obama nominated Merrick Garland to the Supreme Court, Mitch McConnell didn’t even let him have a hearing,” reads one of the dozens of McConnell-centric Facebook ads the DSCC is running. “Now that Donald Trump is in power, Mitch McConnell is going NUCLEAR by changing the rules to pack our courts with extreme right-wing judges like Neil Gorsuch and Brett Kavanaugh on the bench instead.” Equally noteworthy is who Ernst and Hegar don’t mention in their videos: Trump. The use of McConnell but not the president (Trump won both Iowa and Texas by fairly substantial margins in 2016) shows how Democrats believe McConnell has become a fairly nonpartisan villain, a symbol of corruption and, as one strategist put it, “the least sympathetic man in Washington.” Democrats hope they can use McConnell’s reputation to turn even swing voters who still like and trust the president against the GOP. (The End Citizens United poll found swing voters were more likely to agree with Democratic arguments when they mentioned McConnell and the corrupting influence of money on politics.) Republicans, including close McConnell allies, say the veteran senator will be able to turn the Democratic attacks to his advantage as he runs for reelection in Kentucky, potentially against Democratic Air Force veteran Amy McGrath. “I think the left has turned him into a deity on the right. The more they highlight what he’s doing in the Senate, the more popular he becomes,” said Josh Holmes, a former McConnell chief of staff who remains one of the senator’s top political lieutenants. “Every time Donald Trump attacks Nancy Pelosi, it makes her stronger. When Democrats attack Mitch McConnell, it makes him stronger.” McConnell’s team has been playing up his status as a bête noire of the left. The senator himself told voters in Kentucky to “think of me as the Grim Reaper,” and his reelection campaign has been using “Cocaine Mitch,” the infamous nickname bestowed upon him by disgraced coal baron Don Blankenship, as a way to sell merchandise. He also eagerly announced his willingness to fill a Supreme Court seat in 2020 after using the election-year status of Garland’s nomination as a fig leaf for blocking it. “Oh, we’d fill it,” McConnell told a Kentucky questioner who asked about the plan for a possible Supreme Court vacancy. (CNN noted the senator “took a long sip of what appeared to be iced tea” before answering the question “with a smile.”) McConnell’s allies believe he’s been at his weakest when Trump and rank-and-file Republicans have questioned his effectiveness, such as when Obamacare repeal failed in the Senate in the summer of 2017. But they argue his work to push through Kavanaugh’s nomination has restored his approval rating among Republicans, making his reelection in Kentucky safer (no GOP primary challenger has emerged yet) and strengthening his hand when dealing with donors and candidates across the country. But Democrats and Republicans are now both emphasizing his skill and importance. (The portrait of McConnell as master manipulator and strategist ignores the aforementioned failure to repeal Obamacare, as well as his occasional electoral missteps.) Beyond the question of McConnell’s strength, Holmes also said he thinks it’s impossible for Democrats in states like Iowa and Texas to shift the conversation from the all-encompassing Trump to the relatively low-key McConnell. “When you can go after party leaders, you’re making a straight partisan play to solidify your base. But it doesn’t go further than that,” Holmes said. “With Donald Trump running for reelection, the idea that voters are going to ignore that and then pick and choose based on party leaders, that’s absurd to me.” The End Citizens United poll, conducted by Global Strategy Group, was an online survey of more than 1,200 voters in Arizona, Colorado, Florida, Georgia, Iowa, Michigan, North Carolina, New Hampshire, Nevada, Ohio, Pennsylvania and Wisconsin. The survey, part of a broader effort by End Citizens United to develop the best Democratic message on corruption and money in politics, also found that voters are evenly split between Trump and Democrats on who they can trust to crack down on corruption and the influence of money in politics. “This dynamic provides a clear opportunity for Democratic candidates to shape and win the debate, while also demonstrating the danger of ceding the issue to Republicans,” Global Strategy Group’s pollsters wrote in a memo. “Committing to enacting these policies and making these issues a focus of their campaigns will be critical for Democrats to win over persuadable voters in 2020.”",
      "date": "06/25/2019 09:00 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Adam Scott To Mitch McConnell: Don’t Use My Image, Unless It’s For ‘Humiliating Defeat’",
      "url": "https://www.huffpost.com/entry/adam-scott-mitch-mcconnell_n_5d13ae14e4b0e4556036a51d",
      "subtitle": "The “Parks and Recreation” star called out the Senate majority leader for using a GIF to react to an article about Trump’s Supreme Court plans.",
      "author": "David Moye",
      "content": " Actor Adam Scott isn’t mincing words: He doesn’t want Mitch McConnell to tweet out GIFs featuring his face under any circumstance except one. The “Parks and Recreation” star was livid on Wednesday after he discovered the Senate majority leader’s Twitter account had used Scott’s image in this tweet Monday. The tweet was in reaction to a story in The Hill in which Donald Trump said he’d fill a Supreme Court vacancy if one were to come up before the 2020 election. This would be a complete reversal from 2016, when Trump supported McConnell’s refusal to let the Senate consider Barack Obama’s nominee Merrick Garland for the court. McConnell had claimed the American people should decide because it was an election year. Scott was not happy that McConnell used a cheeky reaction shot of him to comment on the story and made his opinion known on Wednesday. McConnell’s camp responded to the suggestion of a “humiliating defeat” with a photo of a fictional newspaper article involving Scott’s “Parks and Recreation” character Ben Wyatt, a former small-town mayor who was impeached after bankrupting the community with a giant ice facility. Scott fired back with a real photo of McConnell back in the 1990s, posing in front of a Confederate flag. Others joined in, mostly to pile on McConnell’s camp:",
      "date": "06/26/2019 03:42 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "How Do You Deal With McConnell? Democratic Presidential Candidates Struggle To Say.",
      "url": "https://www.huffpost.com/entry/2020-democratic-presidential-debate-mitch-mcconnell_n_5d142905e4b0e45560374b18",
      "subtitle": "Much of the Democratic Party’s agenda hinges on the Senate Republican leader, even if Democrats manage to win back the White House in 2020.",
      "author": "Igor Bobic",
      "content": " The biggest villain at the first presidential debate of the 2020 campaign surprisingly wasn’t President Donald Trump. It was Mitch McConnell. The Republican Senate majority leader, who blocked scores of President Barack Obama’s initiatives and even his Supreme Court nominee, dominated discussion among the 10 Democratic presidential candidates who sparred on stage Wednesday night in Miami. Much of the Democratic Party’s agenda hinges on McConnell even if Democrats manage to win back the White House in 2020. Ambitious progressive proposals like “Medicare for All” or the Green New Deal, for example, stand little chance of becoming law given near-unanimous Republican opposition and the filibuster, the upper chamber’s long-standing supermajority requirement. That’s why MSNBC host Rachel Maddow asked candidates who participated in the first of two Democratic presidential debates on Wednesday how they planned to deal with the notoriously recalcitrant Kentucky Republican if they are elected president. It’s a tough question not only because of the sheer difficulty Democrats face in flipping the Senate but also because they would have to win seats in red states like Texas, Georgia and North Carolina, which they need to be able to enact big policy change. Few candidates had good answers. New York City Mayor Bill de Blasio, who enacted universal pre-K in his city, urged the Democratic Party to stop acting “like the party of the elites and be the party of the working people.” He urged Democratic candidates to campaign in red states in order to “put pressure on their senators to actually have to vote for the nominees that are put forward” by a Democratic president. Under McConnell, Republicans have confirmed dozens upon dozens of Trump’s judicial nominees ― including some rated extreme and unqualified to serve as a judge. Even vulnerable GOP senators like Cory Gardner of Colorado and Thom Tillis of North Carolina, who are up for reelection next year, have supported them. Sen. Elizabeth Warren (D-Mass.) confirmed she had “a plan” to deal with McConnell if he remains majority leader in 2020, echoing her favorite line on the campaign trail so far. But she, too, gave a weak answer, especially considering that so much of her policy agenda hinges on being able to pass things in the Senate. “Short of a Democratic majority, you better understand the fight still goes on,” Warren said. “It starts in the White House, and it means that everybody we energize in 2020 stays on the frontlines come January 2021. We have to push from the outside, have leadership from the inside and make this Congress reflect the will of the people.”  Sure, Democrats face a better Senate map in 2022. More GOP senators are retiring, especially from states Democrats consider increasingly winnable, such as Pennsylvania and Georgia. But that doesn’t account for what happens in 2021. Rep. John Delaney (D-Md.), who has advocated for accomplishing things in a bipartisan manner, said that “huge majorities” of Americans are needed in order to push through transformative changes in Washington. But he cautioned against fighting for liberal priorities like universal health care. “We need real solutions, not impossible promises,” Delaney said. “We need to put forth ideas that work.” Asked how he would get past McConnell, Sen. Cory Booker (D-N.J.) responded by highlighting his work helping pass a criminal justice reform bill in the Senate, an effort that was backed by an unusual coalition of both Democrats and Republicans, including Trump. “I have taken on tough problems that people said we cannot achieve it. I have been able to get things accomplished,” Booker said. Washington Gov. Jay Inslee, though, was the only candidate who, when asked about McConnell, touted his support for getting rid of the filibuster (Warren and Booker have also called for doing so). “We have to do that,” he said. “We are the first generation to feel the sting of climate change, and we are the last that can do something it. Our towns are burning and fields are flooding, and Miami is inundated. We have to understand this is a climate crisis.” As part of his strategy in taking on McConnell, Rep. Tim Ryan (D-Ohio) made an electoral argument that Democrats ought to appeal more to blue-collar workers in red states. “If you want to beat Mitch McConnell, this better be a working-class party. If you want to go into Kentucky and take his rear end out and Lindsey Graham out, you have to have a blue-collar party to go into the textile communities in South Carolina.” Democrats are preparing to make McConnell a central villain of their push to win back the Senate in 2020, focusing on painting him as corrupt and an obstructionist. Polling conducted by Democrats shows anti-McConnell ads are more effective among voters than messages about Trump or congressional Republicans overall. Three highly touted Democratic Senate candidates ― Iowa’s Theresa Greenfield, Texas’ M.J. Hegar and Maine House Speaker Sara Gideon ― have all focused on McConnell’s influence in their campaign launch videos. The question about how to handle McConnell has tripped up former Vice President Joe Biden as well. The ex-senator drew mockery from his former Democratic colleagues earlier this month when he claimed that Republicans would become more accommodating once Trump was out of office.",
      "date": "06/27/2019 12:09 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Nancy Pelosi Gives In To Mitch McConnell As House Passes Senate Version Of Border Aid Bill",
      "url": "https://www.huffpost.com/entry/nancy-pelosi-border-aid-bill_n_5d1525d5e4b07f6ca57a8e6f",
      "subtitle": "The House speaker didn’t have much of a choice after Senate Democrats overwhelmingly supported the Senate legislation.",
      "author": "Matt Fuller",
      "content": " WASHINGTON — In the end, House Speaker Nancy Pelosi had to cave. Faced with a rebellion from moderates in her own party — as well as Republicans in both chambers who wouldn’t give in to a single provision — Pelosi pulled a border aid bill on Thursday that many House Democrats preferred and passed the Senate version of the legislation 305-102, with 95 Democrats and seven Republicans voting no. On Tuesday, the House passed a bill aimed at addressing the humanitarian crisis involving undocumented immigrants detained at the border. The vote was mostly along party lines, 234-195. The next day, the Senate passed its own bipartisan version of the bill, drafted by Sens. Richard Shelby (R-Ala.) and Patrick Leahy (D-Vt.), in an overwhelmingly bipartisan vote, 84-8. In retrospect, that was the moment when Pelosi lost. The California Democrat said there was no chance the House would simply pass the Senate bill. Instead, she said Democrats would pass a new bill with only a few changes to the Senate legislation. Those changes would have put additional restrictions on how the administration could spend the about $4.5 billion in the bill and would mandate basic conditions for border detention facilities ― provisions that progressives fought earlier this week to make sure were in the House legislation. But about a dozen and a half moderates in the so-called Problem Solvers Caucus said they would vote no on the new Democratic bill. Republicans in the House had also shown a resolve to not go along with anything but the Senate bill, which President Donald Trump said was the only border aid measure he would sign. That left Pelosi without the votes to pass even her compromise legislation, and she was forced to pull the bill from floor consideration. From there, the only thing the speaker could do — if she wanted to pass a border bill before the July Fourth recess — was put the Senate bill up for a vote. “We will not engage in the same disrespectful behavior that the Senate did in ignoring our priorities,” Pelosi wrote in a letter to House Democrats on Thursday. “In order to get resources to the children fastest, we will reluctantly pass the Senate bill.” “The children come first,” Pelosi added. “At the end of the day, we have to make sure that the resources needed to protect the children are available.” Democrats were adamant that the children should come first, but not everyone was in agreement that Democrats should give in to Senate Majority Leader Mitch McConnell (Ky.) and other Republicans. Progressive Caucus Co-Chairman Mark Pocan (D-Wis.) asked in a tweet Thursday when the Problem Solvers Caucus had become “the Child Abuse Caucus.” “Wouldn’t they want to at least fight against contractors who run deplorable facilities? Kids are the only ones who could lose today,” Pocan said. Rep. Alexandria Ocasio-Cortez (D-N.Y.) also criticized the decision to pass the Senate bill, tweeting that “under no circumstances” should the House vote on the Senate bill without negotiations. “Hell no,” Ocasio-Cortez said. “That’s an abdication of power we should refuse to accept. They will keep hurting kids if we do.” But Pelosi’s decision to pass the Senate bill was an acknowledgment that no amount of time was going to make McConnell give in. The Senate majority leader was adamant that Republicans would not negotiate. “We did not, in the end, continue to play political games over this,” McConnell said. “They did. And it’s their problem to solve.” He noted that Pelosi had spent time on Thursday talking to Vice President Mike Pence about ensuring that at least some of the Democratic requests could be handled administratively. It’s unclear whether Pelosi received any assurances in that regard, but the guardrails to stop the administration from transferring funds to other border purposes or to establish standards for treating children detained at the border aren’t in the Senate bill.",
      "date": "06/27/2019 05:24 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell’s Stolen Supreme Court Seat Keeps Paying Dividends For GOP",
      "url": "https://www.huffpost.com/entry/mitch-mcconnell-supreme-court-obama-merrick-garland-neil-gorsuch_n_5d152a12e4b07f6ca57a98b5",
      "subtitle": "Conservative justices ruled 5-4 that extreme partisan gerrymandering is fine. Guess which party benefits the most?",
      "author": "Jennifer Bendery",
      "content": " WASHINGTON ― Republicans chalked up a major win on Thursday when the Supreme Court gave its blessing to extreme partisan gerrymandering. They largely have Senate Majority Leader Mitch McConnell (R-Ky.) to thank. The court’s 5-4 ruling broke down along partisan lines, with the five conservative justices holding the majority opinion. Republicans have done far more gerrymandering than Democrats in the past decade and currently have the power to draw many more congressional districts than Democrats. If this trend continues beyond the 2020 elections, the Supreme Court’s decision will effectively entrench GOP rule in states all over the country. We wouldn’t be here if it weren’t for McConnell, whose unwavering focus on remaking the nation’s federal courts to benefit Republicans ― democracy be damned ― is paying off. One of the court’s conservative justices, Neil Gorsuch, wouldn’t even be on the court if it weren’t for McConnell. Gorsuch filled a seat that was supposed to go to President Barack Obama’s nominee, Merrick Garland. But when that seat opened up in February 2016 after then-Justice Antonin Scalia died, McConnell announced he would block any Obama replacement. He and Senate Republicans spent the next year denying a hearing and a vote to Garland ― an unprecedented level of obstruction aimed at a sitting president ― and eventually let President Donald Trump fill the seat with Gorsuch in 2017. This was after McConnell changed the Senate rules to confirm Gorsuch, and after McConnell boasted that “one of my proudest moments” was looking Obama in the eye and telling him he would block his Supreme Court pick. If Garland had made it onto the court and Trump had only been able to fill one Supreme Court seat instead of the two he’s filled, Thursday’s ruling likely would have been the opposite: a 5-4 ruling that severe partisan gerrymandering is unconstitutional. That was certainly the opinion of the four liberal-leaning justices, who, led by Justice Elena Kagan, warned of the corrosive effect gerrymandering is having on American democracy. “Of all times to abandon the Court’s duty to declare the law, this was not the one,” Kagan wrote in a blistering dissenting opinion. “The practices challenged in these cases imperil our system of government. Part of the Court’s role in that system is to defend its foundations. None is more important than free and fair elections.” It’s impossible to quantify how far the ripple effects of McConnell’s stolen Supreme Court seat will reach. Gorsuch was the deciding vote in at least two major cases in 2018, when the court narrowly upheld Trump’s travel ban and, separately, upheld the rights of anti-abortion centers. Thursday’s decision means Republicans are poised to win more House and Senate seats going forward. It means it will be harder for federal courts to intervene in gerrymandering that intentionally deprives black people of political power, as long as people claim the district was drawn for partisan gain. It means McConnell’s calculation that prioritizing putting conservatives into lifetime federal court seats, even if they are embarrassingly unqualified, even if it requires blowing up the rules to do it, even if it means pretending your actions are guided by principles instead of bad faith arguments, will all be worth it. “McConnell, who knows that Republicans can’t win in a fair set of elections, has focused single-mindedly on stacking the deck for generations after he is gone, and the policies he represents have been rejected by voters,” said Norm Ornstein, a political scientist and resident scholar at the American Enterprise Institute, a Washington D.C., conservative think tank. Ornstein went on a Twitter tirade after the court’s ruling on gerrymandering, accusing the justices of giving too much leverage to Republicans at the expense of the public. “I see it as a true perversion of a Republican form of democracy,” he told HuffPost. “Citizens are supposed to choose their representatives and this is distortion in major ways.” McConnell told Capitol Hill reporters Thursday that he was pleased with the court’s decision. “There is no such thing as a nonpartisan gerrymander,” he said, citing Democrats winning the House in 2018 despite GOP-led redistricting efforts. “The problem is overstated.” He’s right that Democrats won more votes and flipped hundreds of seats in state legislatures in the 2018 elections. But they should have won more. Republicans won about 16 more U.S. House seats than expected and may have held onto as many as seven state House chambers thanks to those districts being drawn to give the GOP a built-in advantage, per a March 2019 analysis by The Associated Press. McConnell was an unexpected focus in Tuesday night’s Democratic presidential debate, where moderators asked each of the candidates how they would deal with him if elected president. None had a good answer. Igor Bobic contributed reporting.",
      "date": "06/27/2019 05:36 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell Weighs In On Nike Controversy: ‘I’ll Make The First Order’",
      "url": "https://www.huffpost.com/entry/mitch-mcconnell-nike-betsy-ross_n_5d1cb962e4b082e55373284f",
      "subtitle": "The Senate majority leader is calling on Nike to reverse its decision to pull its Independence-Day themed shoes featuring the “Betsy Ross flag.”",
      "author": "Julian Shen-Berro",
      "content": " Senate Majority Leader Mitch McConnell is calling on Nike to reverse its decision to pull its Independence Day-themed shoes, pledging that if they do, he will make the first purchase. The Air Max 1 USA featured prominent red, white and blue colors and depicted an American flag with 13 stars, commonly known as the “Betsy Ross flag,” on its heels. “If we’re in a political environment where the American flag has become controversial to Americans, I think we’ve got a problem,” McConnell told reporters at an event in Lexington, Kentucky, according to the Lexington Herald Leader. “I hope Nike either releases these shoes or some other shoe maker picks up the flag, puts it on a pair of shoes and starts selling it. I’ll make the first order.” Nike canceled production after Colin Kaepernick, a Nike endorser and former NFL quarterback, told company officials that he and others found the symbol offensive as it connected to an era of slavery in America. The flag, which features 13 stars referring to the 13 original colonies, was flown during a period of American history entrenched in the practice of slavery. Nike made Kaepernick the face of its “Just Do It” campaign in 2018, after he was widely criticized over his protest of police brutality against black Americans during the 2016-2017 NFL season, during which he kneeled during the national anthem. Kapernick was a free agent during the 2017-2018 season. Others have weighed in on Nike’s decision to pull the Independence Day-themed shoes. Arizona Gov. Doug Ducey (R) expressed his outrage in a series of tweets, and pulled financial incentives for Nike to build a new manufacturing plant in the state. “Arizona’s economy is doing just fine without Nike. We don’t need to suck up to companies that consciously denigrate our nation’s history,” he said. Laura Ingraham, a Fox News show host, called Nike’s decision “pathetic,” adding that neither she nor her family would ever purchase the company’s shoes again. MSNBC “Morning Joe” anchor Joe Scarborough denounced Nike on Twitter. “PC madness is accelerating just in time for 2020,” he said. “Trump feeds on your reflexive Wokeness.” But in an interview with CBSN, Democratic presidential candidate Julián Castro praised the shoe company’s decision. “I was glad to see that. And my hope is that they didn’t just do it to do it. They understand the significance there. And look, there are a lot of things in our history that are still very painful,” he said. “The Confederate Flag that still flies in some places, and is used as a symbol. And I believe we need to move towards an inclusive America that understands that pain.”",
      "date": "07/03/2019 11:37 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Chuck Schumer Urges McConnell To Pass Equal Pay In Honor Of U.S. Women’s Soccer Team",
      "url": "https://www.huffpost.com/entry/chuck-schumer-us-women-soccer-team-equal-pay_n_5d24086ae4b0583e48265ec1",
      "subtitle": "The Senate minority leader also invited the “extraordinary” World Cup champions to visit the U.S. Capitol.",
      "author": "Dominique Mosbergen",
      "content": " Lauding the “extraordinary” U.S. women’s national soccer team for its “excellence” and “heart,” Senate Minority Leader Chuck Schumer (D-N.Y.) extended an invitation on Monday to the World Cup champions to visit the U.S. Senate — saying “it would be my honor to host America’s winning team.” His invitation followed a similar gesture by House Speaker Nancy Pelosi (D-Calif.), who encouraged the women’s team to visit the U.S. Capitol “to celebrate your inspiring victory.” Speaking from the Senate floor, Schumer also urged his GOP counterpart, Senate Majority Leader Mitch McConnell (R-Ky.), and his other colleagues to pass equal pay legislation in honor of the victorious team. “They make us grapple with the deep unfairness in how female athletes are treated, and paid, compared to their male counterparts,” Schumer said in an apparent nod to the gender discrimination lawsuit filed by the U.S. women’s soccer team earlier this year. “Similarly. it’s an unfortunate reality that women in the workforce see their male colleagues paid significantly more for the same work.” Schumer said the U.S. women’s team, which bested the Netherlands for the FIFA Women’s World Cup on Sunday, had “shone a light on the fact that in our society women are simply not treated fairly because of their gender.” “Something needs to change here. What the U.S. women did was extraordinary, and they deserve to be compensated fairly. All women need to be compensated fairly, period,” the senator continued, before asking McConnell to introduce the Paycheck Fairness Act, approved earlier this year by the Democrat-led House, on the Senate floor. “How about the equal pay amendment that the House has passed? Why don’t we put it on the floor of the Senate in honor of the women who won the World Cup? Why don’t we do that, Leader McConnell?” Schumer said. As CNBC noted, however, McConnell ― who also congratulated the women’s team on its win and praised the players for their “grit and teamwork and talent” ― is unlikely to support the equal pay legislation, which he’s previously condemned as “just another Democratic idea that threatens to hurt the very people that it claims to help.” The GOP has voted at least four times to block the Paycheck Fairness Act from consideration since 2012, CNBC reported.",
      "date": "07/09/2019 12:22 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Blame Mitch McConnell If Saudi Arabia Escapes Accountability For Khashoggi And Yemen",
      "url": "https://www.huffpost.com/entry/saudi-khashoggi-yemen-accountability-congress_n_5d1fc257e4b0f3125683ef50",
      "subtitle": "House Democrats are beginning a process to mandate the first formal pressure on Saudi Arabia through a must-pass bill. Sen. McConnell will decide if it survives.",
      "author": "Akbar Shahid Ahmed",
      "content": " Congress is about to put historic pressure on Saudi Arabia for the gruesome murder of journalist Jamal Khashoggi, its devastating military campaign in its desperately poor neighboring country of Yemen and other excesses, such as the alleged torture and sexual assault of detained female activists ― unless Sen. Mitch McConnell (R-Ky.) and his lieutenants intervene. It’s a critical test of whether the U.S. can hold foreign partners accountable for repugnant and destabilizing behavior enabled by American security guarantees and a potentially telling moment for a Republican Party that presents its hawkish approach to global affairs as fundamentally moral. Over the next two weeks, the Democrat-controlled House will finalize its version of this year’s defense authorization act, a piece of legislation that’s often called “must-pass” because it greenlights continued funding for the military. Lawmakers skeptical of the Saudis are focused on three amendments to the bill: a yearlong ban on selling U.S. bombs to Riyadh and its chief partner in the bloody Yemen intervention, the United Arab Emirates; no more money for the two main aspects of U.S. support for that effort, intelligence-sharing and logistical help; and a requirement for the Trump administration to name all people it knows to be involved in the assassination of Khashoggi and place sanctions on them ― a move that would likely target people beyond the 17 Saudi officials already blacklisted for the murder and possibly affect even the de facto Saudi ruler, Crown Prince Mohammed bin Salman. Although many Democrats and a handful of Republicans have spent months criticizing the prince for his reported role in the killing and have spent years highlighting alleged war crimes and the development of the world’s worst humanitarian crisis in Yemen, Capitol Hill hasn’t yet formally penalized Saudi Arabia. It instead has advanced historic but largely symbolic measures to signal disapproval. President Donald Trump used an emergency declaration in May to torpedo the policy with the greatest real-world impact, a hold that Sen. Bob Menendez (D-N.J.) placed last year on $2 billion worth of weapons for the Saudis and the UAE. Angry with Trump’s disregard for legally enshrined procedure on arms sales and still eager to show Riyadh that misdeeds have consequences, members of Congress see the process of passing the defense bill as a way to force change. “I’m reasonably confident that we can get it done in the House,” said Rep. Tom Malinowski (D-N.J.), who authored the amendments on arms sales and sanctions. Support from mainstream Democratic leaders is bolstering Malinowski’s suggestions and Rep. Ro Khanna’s (D-Calif.) bill to defund U.S. assistance in Yemen. House Foreign Affairs Committee chair Eliot Engel (D-N.Y.), who’s usually been sympathetic to Saudi Arabia and other Persian Gulf nations competing with Iran, supports Malinowki’s amendments, and Rep. Adam Schiff (D-Calif.), who runs the House Intelligence Committee, has blessed Khanna’s plan, which will help weaken the common criticism that cutting off intelligence support for the Yemen campaign threatens important counterterrorism work. Rep. Jim McGovern (D-Mass.), who as chair of the House Rules Committee plays a big role in deciding what legislation gets considered, has long called for the U.S. to reassess its cozy relationship with the Saudis. There could be tweaks and snafus in the process of getting the amendments attached to the defense bill. One or all could be put up for a vote by the full House to signal strong support, including from Republicans, rather than simply passed in leadership’s package of scores of non-controversial additions. Other Saudi-related initiatives currently receiving less attention could attract sudden interest. And arguments between progressives and centrists over the total approved defense spending could delay passage of the overall legislation. But the real dispute will come when representatives of the two chambers gather to reconcile their versions of the defense bill and craft a compromise that can make it to Trump’s desk. This is the first time in this presidency that one of these measures has had to make it through a House and Senate controlled by different parties. Sen. Jim Inhofe (R-Okla.), who is a key Republican in the process as chair of the Senate Armed Services Committee, “doesn’t want to do anything related to Yemen,” said Kate Kizer, the policy director at the nonprofit Win Without War. “It’ll be a battle.” McConnell, Inhofe and other GOP power players on foreign policy, such as Sen. Jim Risch (Idaho), chair of the Senate Foreign Relations Committee, largely hew to Trump’s line that the U.S. relationship with the Saudis is too important to be derailed over matters like a high-profile murder in a diplomatic facility. Some influential members of the caucus, notably Sens. Todd Young (R-Ind.) and Lindsey Graham (R-S.C.), are resisting that kind of cynicism, but most Republicans are following McConnell’s cue. Come conference time ― when Inhofe, his counterpart Sen. Jack Reed (D-R.I.) and Reps. Adam Smith (D-Wash.) and Mac Thornberry (R-Texas) negotiate over the final form of the defense bill ― danger looms for the efforts to mandate a change of course by the Saudis and their allies. “Given McConnell does MBS’ and this White House’s bidding, I’m sure he’ll try to maneuver to keep these provisions out of the final bill [and]... steamroll the House,” a Democratic aide said on condition of anonymity, using a popular acronym for the Saudi prince. “Now with our new majority, we will have key Democratic leaders fighting to keep these provisions in.” Were Republicans to quash serious restrictions out of concern over U.S. national security and relationships in a strategic region ― or just to avoid angering Trump and big donors in the defense industry ― they would be shielding a dictator and encouraging his ilk to commit even more brutal excesses. They might not, of course, see that as a problem. The question for the fate of the monthslong congressional campaign for accountability is whether its proponents in the GOP are as serious about justice as they purport to be in public. So far, Risch has felt pressured enough that he has claimed he will offer his own road map for addressing Saudi behavior, but Young has struggled to advance a bill he and Menendez designed to alter Saudi behavior. McConnell’s office did not respond to a request for comment. For Democrats, what counts is how much they prioritize the measures during dealmaking as they throw their revitalized strength behind other major concerns, such as preventing a war with Iran and challenging Trump’s ban on transgender service members, and whether the party can keep its own disparate ideological factions united while securing the kind of limited GOP support it has had in the past on Saudi-related issues. Engel’s decision to support the weapon transfer ban was a striking turn that suggested a more assertive approach from leadership after he abandoned an effort to present a bill with a high-ranking Republican that would have been more lenient to the Saudis. His choice also reflects the party’s shifting dynamics: as Engel faces two primary challengers who are blasting him as a hawk, the 16-term lawmaker “has a new sense of urgency,” a peace advocate who is tied into congressional circles told HuffPost. Antiwar and human rights activists are closely watching whether Reed, the top Democrat on defense issues, will also indicate more support for their causes by fighting to keep an end to U.S. support for the Saudi-UAE Yemen campaign in the bill. (Last year, Trump responded to public pressure over the conflict by ending the clearest element of U.S. assistance: aerial refueling for the Arab states’ bombing sprees. But just months ago, the president vetoed successful bipartisan legislation to pull U.S. forces out of the war altogether.) Given the furor and discussions among senators of even tougher proposals targeting the Saudis, Republicans could see the Democratic amendments as relatively moderate and something they could support, said Malinowski, who entered Congress just six months ago and who was the main human rights official in President Barack Obama’s State Department. “I think there’s broad consensus among Democrats, including leadership, that we need to do something,” Malinowski said. “And significant concern on the Republican side as well.”",
      "date": "07/09/2019 05:45 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Amy McGrath Jumps Into Senate Race To Replace Mitch McConnell",
      "url": "https://www.huffpost.com/entry/amy-mcgrath-mitch-mcconnell-kentucky-senate_n_5d247979e4b0583e48274251",
      "subtitle": "The retired Marine lieutenant colonel and combat pilot previously challenged GOP Rep. Andy Barr in Kentucky’s 6th District.",
      "author": "Paige Lavender",
      "content": " Amy McGrath, a retired Marine lieutenant colonel and combat pilot, announced Tuesday she’s running against Senate Majority Leader Mitch McConnell (R-Ky.). McGrath tweeted a video marking the launch of her campaign, in which she describes writing a letter to McConnell as a 13-year-old girl, noting he never wrote her back. She claims “everything that’s wrong in Washington” started with McConnell, “who was elected a lifetime ago, and who has, bit by bit, year by year, turned Washington into something we all despise.” Within an hour of her tweet, McConnell’s campaign released an ad attacking her progressive beliefs. McGrath’s new ad echoes a similar spot she released when she challenged GOP Rep. Andy Barr ― who received an endorsement from President Donald Trump ― in Kentucky’s 6th District in 2018. Her announcement comes after months of speculation that she might run, including reports that Senate Minority Leader Chuck Schumer (D-N.Y.) actively recruited her for the race. McGrath is the first major Democrat to jump into the race against McConnell, who was last challenged by Kentucky Secretary of State Alison Lundergan Grimes in 2014.",
      "date": "07/09/2019 08:31 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell Deflects Attention From Slave-Owning Ancestors By Pointing To Obama’s",
      "url": "https://www.huffpost.com/entry/mitch-mcconnell-obama-slave-owner-relatives_n_5d24e1c8e4b07e698c41e262",
      "subtitle": "The Senate majority leader responded to a question about ancestors who owned slaves by saying, “I find myself in the same position as President Obama.”",
      "author": "David Moye",
      "content": " Say this about Senate Majority Leader Mitch McConnell: He’s consistent, especially when he has a chance to sneak in a dig at former President Barack Obama. That’s what the Kentucky senator did on Tuesday when he was asked for his reaction to an NBC News report that showed two of his great-great-grandfathers owned slaves, according to U.S. census records. All told, the two men, James McConnell and Richard Daley, owned at least 14 slaves in Limestone County, Alabama. McConnell snidely used the report to declare common ground with Obama. “You know, I find myself once again in the same position as President Obama,” McConnell said at a press conference. “We both oppose reparations, and we both are the descendants of slaveholders.” McConnell is correct about Obama’s position on reparations: During the 2008 presidential campaign Obama did speak out against offering them to the descendants of slaves. Instead, he said that the government should instead combat the legacy of slavery by improving schools, health care and the economy for all, according to The Associated Press. And while many 2020 Democratic presidential candidates have openly called for reparations, Obama stuck by his stance in a 2016 interview with Ta-Nehisi Coates. Of course, Obama’s stated reasons for opposing reparations have been practical and political considerations, whereas McConnell has simply argued that “no one currently alive was responsible for that.” As for Obama’s ancestors owning slaves, that’s also correct with a little more nuance. Back in 2007, an amateur genealogical researcher named William Reitwiesner published a history of Obama’s mother’s family suggesting the future president’s great-great-great-great grandfather George Washington Overall owned two slaves in Kentucky, The Guardian reported. In addition, Obama’s great-great-great-great-great-grandmother also owned two slaves. However, in 2012, Ancestry.com released a report linking the president to John Punch, America’s first documented African slave for life. CNN reported that the connection came not from Obama’s African-born father, but from his white mother. McConnell has used Obama to shut down any serious discussion of reparations in Congress. Last month, he said that civil rights legislation ― and Obama’s presidency ― prove reparations are unnecessary.",
      "date": "07/09/2019 04:58 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Amy McGrath To Challenge Sen. Mitch McConnell",
      "url": "https://www.huffpost.com/entry/amy-mcgrath-to-challenge-sen-mitch-mcconnell_n_5d2784f3e4b0060b11e96d70",
      "subtitle": "null",
      "author": "",
      "content": "",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell Says ‘All Of Us’ Should Cool It In Wake Of Trump’s Racist Tweets",
      "url": "https://www.huffpost.com/entry/mitch-mcconnell-donald-trump-racist-tweets_n_5d2e15fee4b085eda5a2ebf0",
      "subtitle": "The Senate majority leader stopped short of calling the president’s attacks on Democratic congresswomen racist.",
      "author": "Igor Bobic",
      "content": " WASHINGTON ― Senate Majority Leader Mitch McConnell on Tuesday responded to the controversy surrounding President Donald Trump’s onslaught of racist tweets by urging both sides of the aisle to avoid “overheated” rhetoric. The Kentucky Republican did not single out the president by name when making his first public comments on the Sunday tweets, in which Trump urged four women of color in Congress to “go back” to where they came from. But McConnell did call out Democrats in the House, including Speaker Nancy Pelosi (D-Calif.). “From the President to the Speaker, to the freshmen members of the House, all of us have a responsibility to elevate the public discourse. Our words do matter,” McConnell told reporters at a weekly press conference on Capitol Hill. Trump’s attacks, which he repeated to reporters Monday and continued on Tuesday, didn’t initially name the congresswomen he was targeting, but they were almost certainly Reps. Ilhan Omar, Rashida Tlaib, Alexandria Ocasio-Cortez and Ayanna Pressley, all outspoken freshmen who have recently butted heads with Pelosi. Trump’s comments elicited condemnations this week from Democrats ― and even some Republicans ― who agreed the tweets were, in fact, racist. Asked Monday if she thought Trump’s comments were racist, Sen. Joni Ernst (R-Iowa), a member of McConnell’s leadership team, said, “Yeah, I do.” But McConnell dodged the question on Tuesday, saying instead he did not believe the president himself is a racist. “We’re better off talking about the policies of our adversaries,” McConnell said, pointing to proposals supported by progressive House members he said would take the country down the wrong path. When asked if he’d be offended if his wife, Transportation Secretary Elaine Chao, who immigrated to the U.S. from Taiwan, were told to go back to where she came from, McConnell again dodged the question. “I’m a big fan of legal immigration,” he said, calling it “a fulfilling of the American dream.” Asked if he’d ever use the kind of language Trump has used, McConnell said, “I’m obviously a fan of legal immigration, it’s been a big part of my family for a quarter of a century.”",
      "date": "07/16/2019 04:09 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell Gets Another Democratic Challenger In Kentucky’s 2020 Senate Race",
      "url": "https://www.huffpost.com/entry/mitch-mcconnell-democratic-challenger-mike-broihier_n_5d30e2fae4b004b6adad3e02",
      "subtitle": "Farmer and military veteran Mike Broihier announced his bid to unseat the powerful Senate majority leader.",
      "author": "Sanjana Karanth",
      "content": " A Democrat who farms and previously worked as a rural newspaper editor has entered the race to try to upset Senate Majority Leader Mitch McConnell (R) in 2020’s general election, unveiling his campaign with a blunt video. Mike Broihier (BROY-er) announced his candidacy Thursday with the release of the video that begins with several people holding chalkboard slates with a noun written on them ― descriptors that include “Bitch,” “Thug,” “Hillbilly” and “Queer.” Broihier, a 57-year-old former Marine, in a voiceover says that McConnell uses “labels to reinforce old prejudices, to divide us, to maintain his grip on power.” The first-time candidate, who moved to Kentucky’s Lincoln County about 14 years ago to farm and worked as an editor at The Interior Journal newspaper, goes on to say he is running “to strip away the labels and strip Mitch McConnell of power.” He said the six-term incumbent has “refined the art of obstruction” and “throws the rules and 200 years of tradition onto the ash heap of history ― democracy be damned.” “As a Kentucky farmer, educator and small-town newspaper editor, I’ve developed a greater understanding and respect for the challenges and struggles Kentucky’s working families and rural communities face than Mitch McConnell ever has or ever will,” Broihier said in a separate statement. “Their lives, their stories are a part of me.” Broihier has embraced an unabashedly progressive platform for a solidly red state, telling The Louisville Courier-Journal that he supports abortion rights, background checks for all gun purchases, legalizing marijuana and the goal of closing the gender pay gap. In comments to The Associated Press, he denounced the migrant detention centers at the U.S. southern border and said he would have voted against the 2017 package of tax cuts that McConnell helped steer into law. Broihier is the second military veteran to emerge as McConnell’s potential Democratic opponent. Former Marine fighter pilot Amy McGrath, 44, who last year ran a strong but ultimately unsuccessful race for a House seat against a GOP incumbent, entered the race last week. Her candidacy attracted national attention due to her support from major party leaders, and her bid has already brought in millions of dollars in donations. But she stumbled out of the gate when she told the Courier-Journal that although she had concerns about Brett Kavanaugh during his confirmation hearing for the Supreme Court last fall, she “probably would have voted for him.” She walked back her comments hours later, tweeting, “Upon further reflection and further understanding of [Kavanaugh’s] record, I would have voted no.” Broihier told the AP that he absolutely would have voted against Kavanaugh ― who won confirmation on a largely party-line vote ― as well as any other judge “who just doesn’t accept the fact that the Supreme Court decided Roe v. Wade (the1973 case legalizing abortion) correctly.” McConnell’s office did not immediately respond to HuffPost’s request for comment, but his campaign posted a tweet Thursday morning saying, “Deleted scene from [Broihier’s] launch video.” The tweet included a photoshopped picture of McGrath holding a chalkboard slate with “Flip Flop” written on it. Broihier’s campaign quickly responded with a video citing McConnell’s “flip-flopping” about filling a Supreme Court vacancy in a presidential election year. He single-handedly blocked outgoing President Barack Obama from filling such a slot in 2016, citing the pending election, but recently said he would not follow that precedent next year as President Donald Trump seeks a second term. Broihier has characterized McGrath as the hand-picked candidate” of Washington’s Democratic establishment and that such backing matters little to Kentucky voters. The state’s primary vote is set for next May. Either Democrat faces an uphill battle against the 77-year-old McConnell. First elected in 1984, his clout in Congress ― and wife Elaine Chao’s post as Trump’s transportation secretary ― pays dividends for Kentucky in terms of federal spending. In 2014, Democrat Alsion Lundergan Grimes ― Kentucky’s secretary of state and a member of a well-known political family ― seemed poised to give him a closely contested race. McConnell defeated her by 15 percentage points. He also should benefit from sharing next year’s ballot with Trump, who carried the state in 2016 by almost 30 points.",
      "date": "07/18/2019 07:03 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Kentucky’s Only Congressional Democrat Has A Theory For How To Beat Mitch McConnell",
      "url": "https://www.huffpost.com/entry/kentucky-democrat-john-yarmuth-mitch-mcconnell_n_5d31cce7e4b004b6adaef8e9",
      "subtitle": "Boosting turnout in Kentucky’s blue cities may be Democrats’ only chance to unseat the unpopular Senate leader.",
      "author": "Travis Waldron",
      "content": " WASHINGTON ― Democrats’ narrow path to victory against unpopular Senate Majority Leader Mitch McConnell in 2020 runs not through longshot appeals to rural voters the party has lost but through massive turnout in Kentucky’s deep and increasingly blue urban centers, the state’s only Democratic congressman told HuffPost in an interview this week. “I would spend all my time [campaigning] in Louisville and Lexington,” Rep. John Yarmuth said. Kentucky’s two largest cities together are home to nearly a quarter of the state’s 4.5 million residents. Both have become reliable Democratic strongholds even as the state has become more and more red over the last two decades. Louisville, Lexington and Frankfort, the state capital, are always a focus for Democratic candidates running statewide in Kentucky, where any hope for victory requires racking up big margins across the three cities and in a handful of smaller blue counties before holding on for dear life in the rural, GOP-heavy parts of the state. But like many Democrats across the country, those candidates have also balanced their appeals to urban voters with attempts to woo back white, rural Kentuckians who’ve abandoned the party in droves as national Democrats have embraced more progressive positions on abortion, gun control, LGBTQ rights and other issues. In Kentucky, those rural voters often take priority in the eyes of statewide candidates. In her 2014 Senate race against McConnell, for instance, Kentucky Secretary of State Alison Lundergan Grimes, a Democrat, refused to say whether she had voted for President Barack Obama, a widely derided attempt to avoid alienating some voters that instead dampened early enthusiasm for her campaign. McConnell will enter the 2020 cycle as one of the least popular senators in the country, and his abysmal approval ratings in the Bluegrass State have tempted a number of potential challengers, including retired fighter pilot Amy McGrath, who raised more than $2 million in the first 24 hours after her campaign officially launched earlier this month. (Former Marine Mike Broihier and Steve Cox, a Louisville health care professional, have also entered the race.) McGrath focused heavily on rural voters when she ran for a House seat in 2018 in a district that includes both Lexington and Frankfort but also a number of rural counties surrounding them. That strategy lifted her to an improbable primary victory, but she lost to Republican Rep. Andy Barr in the general election. Her Senate campaign launched with a similar bent: In her first appearance on cable news after the launch, McGrath attempted to drive a wedge between McConnell and President Donald Trump, saying the senator had prevented the president from enacting parts of his agenda that rural Kentuckians supported. She also wavered on whether she would have voted to put Brett Kavanaugh on the Supreme Court, in what may have been an attempt to ingratiate herself to conservative anti-abortion voters in the state. McGrath changed her position on Kavanaugh hours later, and said she wouldn’t have voted for him, but her waffling seemed to reduce enthusiasm for her campaign. Meanwhile, McConnell had already used McGrath’s declarations that she is pro-choice and a progressive to brand her as too liberal for Kentucky. But even in rural areas, Yarmuth said, McGrath and other McConnell opponents should focus on the few pockets of reliably Democratic voters. “She spent a lot of money and time in those counties thinking that she could convert Republican votes, and she never did,” he said, of McGrath’s 2018 House race. And although Yarmuth agreed with that strategy at the time, he said, “that should be a lesson for her in a Senate race. She needs to spend her money where the gettable votes are, not thinking she can convert Republican votes.” Democratic chances are still slim. McConnell’s ability to amass and hold onto political power in Washington has always outpaced his popularity back home, and no Democrat has come within 100,000 votes of beating him since 1990. Much of his unfavorability, meanwhile, comes from his right, a problem that may be ameliorated by Trump’s presence on the ballot, given that the president’s popularity in Kentucky dwarfs that of his senior Senate ally. “I would say that if this were not a presidential year, Amy would be a favorite against Mitch,” Yarmuth said. “I think she can win, but with Trump on the ballot I don’t think she’s the favorite.” Yarmuth has never seriously considered a statewide bid, he said, and he has no interest in running against McConnell. But he doesn’t think it’s impossible for a Democrat to knock off the state’s highest-profile politician. “The people who’ve looked at it here have said, ‘A Democrat can win statewide, but it has to be a very surgical race,’” Yarmuth said. “And what they would say is, ‘You have to know exactly where your voters are, and you don’t waste any time on persuadables. You need to persuade the ones you know are going to vote for you [to] vote.’” Trump’s reelection bid may further blunt Democratic efforts to reach rural voters who have traditionally supported them: In eastern Kentucky, where McConnell has at times struggled, the president is popular even among registered Democrats. What may be a liability in the rural areas of the state could be a strength in its metropolitan areas, though. Trump may further hinder McConnell in Louisville and Lexington, where both are unpopular, and where Democrats have fared increasingly well in Senate, House, gubernatorial and presidential elections since McConnell launched his political career nearly four decades ago. McConnell hasn’t won Jefferson or Fayette counties, in which Louisville and Lexington are located, respectively, since 2002, and the last time either went for a Republican presidential candidate was 2004. Louisville, like many major metro areas, has become almost solidly blue over the last decade. Yarmuth, whose district encompasses almost the entirety of Louisville and Jefferson County, defeated a five-term Republican incumbent in 2006 and has not faced a serious challenge since. And in 2018, Louisville Democrats scored victories in city council and state legislative races even in the city’s more traditionally Republican-aligned areas. Trump will lose both counties by large margins in 2020, and Democrats in those areas may be further energized by Kentucky’s 2019 statewide elections, in which the party has a chance to defeat firebrand conservative Gov. Matt Bevin, who is now considered the most unpopular governor in the country. “Bevin is governor because Democrats didn’t turn out. Donald Trump is president because Democrats didn’t turn out in Michigan, Pennsylvania and Wisconsin,” Yarmuth said. “To me, that’s where elections are won and lost now. It’s who comes out to vote.”",
      "date": "07/19/2019 12:45 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Twitter Users Slam ‘Moscow Mitch’ After McConnell Kills Election Security Bills",
      "url": "https://www.huffpost.com/entry/moscow-mitch-mcconnell-russia-election-security_n_5d3b05abe4b0ef792e0b4c63",
      "subtitle": "The Senate majority leader blocked two measures to ward off foreign meddling amid ongoing concerns over the threat of Russian interference.",
      "author": "Amy Russo",
      "content": " Social media users lashed out against Senate Majority Leader Mitch McConnell (R-Ky.) on Friday with the nickname “Moscow Mitch” following his move to kill two election security bills. On Thursday, McConnell blocked a House measure that would have authorized $775 million to strengthen state election systems in addition to requiring paper ballots. He also quashed another proposal to require candidates, their campaign officials and their families to alert federal authorities if they’re offered aid from foreign governments ― something President Donald Trump himself has not committed to doing. The next morning, the hashtag #MoscowMitch began spreading on Twitter, appearing to have been sparked by MSNBC’s Joe Scarborough, who slammed McConnell in a fiery rant on his “Morning Joe” broadcast. “He is aiding and abetting [Russian President] Vladimir Putin’s ongoing attempts to subvert American democracy, according to the Republican FBI, CIA, DNI, intel committee,” he said. “All Republicans are all saying Russia is subverting American democracy and Moscow Mitch won’t even let the Senate take a vote on it. That is un-American.” Once the program aired, Scarborough’s jab at McConnell caught fire, even prompting actress Mia Farrow to jump in on the criticism. “We ALL need to wake up,” she wrote. “#MoscowMitch keeps killing any bill that will protect American democracy from Putin’s attacks.” On Wednesday, former special counsel Robert Mueller warned against continuing attempts at interference in U.S. elections during his testimony before the House Judiciary Committee and the intelligence committee, telling lawmakers it was happening in real time. “Many more countries are developing the capability to replicate what the Russians have done,” he said. “They’re doing it as we sit here.” Asked by Rep. Peter Welch (D-Vt.) whether candidates who are aware of foreign attempts to influence elections might now feel they have “no duty to report that to the FBI or other authorities,” Mueller said he fears it could be “the new normal.” On Tuesday, FBI Director Christopher Wray emphasized the threat of Russian meddling during a Senate Judiciary Committee hearing, stating that the country is “absolutely intent on trying to interfere with our elections.” “My view is until they stop they haven’t been deterred enough,” he added.",
      "date": "07/26/2019 11:47 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell Lashes Out At Critics Who Called Him A ‘Russian Asset’",
      "url": "https://www.huffpost.com/entry/mitch-mcconnell-russia-election-security_n_5d3f4edbe4b0db8affaca5fa",
      "subtitle": "The Kentucky Republican blocked two measures last week that would have beefed up election security.",
      "author": "Igor Bobic",
      "content": " Senate Majority Leader Mitch McConnell (R-Ky.) on Monday fired back at critics who accused him of being a “Russian asset” after he blocked legislation last week that would have strengthened U.S. election security. “I was called unpatriotic, un-American and essentially treasonous by a couple of left-wing pundits on the basis of bold-faced lies,” McConnell said in a speech on the Senate floor, denouncing the “shameful” attacks as “modern-day McCarthyism.” On Friday, MSNBC host and former GOP Rep. Joe Scarborough lit into McConnell after he blocked two election security measures. Democrats attempted to expedite passage of the measures via a unanimous consent request after Robert Mueller, the former special counsel, testified Wednesday about continued Russian meddling in U.S. elections. “He is aiding and abetting [Russian President Vladimir] Putin’s ongoing attempts to subvert U.S. democracy, according to the Republican FBI, CIA” and director of national intelligence, Scarborough said on MSNBC’s “Morning Joe.” “All Republicans are saying Russia is trying to subvert U.S. democracy, and Moscow Mitch won’t even let the Senate take a vote on it. That is un-American.” Dana Milbank, a columnist for The Washington Post, wrote a post Friday provocatively titled “Mitch McConnell is a Russian asset.” Milbank accused McConnell of being “unpatriotic” and “doing [Putin’s] bidding” by blocking election security legislation. A visibly riled McConnell responded in a blistering speech on Monday, calling Scarborough and Milbank “hyperventilating hacks” who’d distorted his record. “I’ve spoken at length about Russian interference... I worked to ensure hundreds of millions of dollars were sent to states to improve their defenses” from election interference, McConnell said, pointing to a bipartisan spending bill in 2018 that included $380 million for states to improve election security and technology. The Kentucky Republican listed a number of comments he’s made over the years calling for increased vigilance about the threat that Putin poses to the U.S. (He did not, however, mention his role undercutting an effort by the Obama White House to call out the Kremlin’s election meddling just before the 2016 presidential election.) McConnell claims the U.S. is sufficiently prepared to defend its election infrastructure ahead of 2020, even as federal officials continue to issue warnings about foreign influence operations from Russia and other countries. But his objection to election security legislation isn’t simply one of cost or feasibility. He often claims that federal regulations concerning how elections are run shouldn’t be the government’s responsibility at all. Democrats, on the other hand, believe that states and localities can’t respond to election meddling like the federal government can. For that reason, Sen. Ron Wyden (D-Ore.) argued last week for the need to institute “mandatory, nation-wide cybersecurity requirements” to election systems. “We would not ask a local sheriff to go to war against the missiles, planes and tanks of the Russian Army,” Wyden said in a bipartisan report released by the Senate Intelligence Committee on Russia’s election meddling. “We shouldn’t ask a county election IT employee to fight a war against the full capabilities and vast resources of Russia’s cyber army.” The report described how Moscow targeted election systems in all 50 states in 2016 — and how the states were woefully unprepared to respond to cyberattacks. But it recommended nevertheless that states should remain firmly in the lead on running their own elections.",
      "date": "07/29/2019 05:45 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "McConnell Criticizes ‘Moscow Mitch’ Label",
      "url": "https://www.huffpost.com/entry/mcconnell-criticizes-moscow-mitch-label_n_5d403932e4b0cb4382daf65d",
      "subtitle": "null",
      "author": "",
      "content": "",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez Gives Mitch McConnell A Semantics Lesson After His McCarthyism Gripe",
      "url": "https://www.huffpost.com/entry/alexandria-ocasio-cortez-mitch-mcconnell_n_5d412b95e4b01d8c97834e5f",
      "subtitle": "The freshman lawmaker has a few words about McConnell’s leadership skills.",
      "author": "Ed Mazza",
      "content": " Senate Majority Leader Mitch McConnell (R-Ky.) claims he was a victim of “McCarthyism” after critics dubbed him “Moscow Mitch” for blocking a bill to protect U.S. elections from Russian meddling. McConnell wrote on Twitter on Monday: On Tuesday, Rep. Alexandria Ocasio-Cortez (D-N.Y.) offered up a correction: Last week, McConnell blocked a bill passed by the House that would have authorized $775 million to help protect state election systems from Russian hacking and other threats. That action prompted critics to dub him “Moscow Mitch.” McConnell defended himself on the Senate floor by calling two of his critics “hyperventilating hacks.”",
      "date": "07/31/2019 03:42 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Democrats Call On Mitch McConnell To Reconvene Senate For Gun Vote",
      "url": "https://www.huffpost.com/entry/shooting-mitch-mcconell-guns-senate_n_5d470e3ae4b0ca604e33b6b9",
      "subtitle": "The upper chamber adjourned last week for its annual August recess.",
      "author": "Igor Bobic",
      "content": " Democrats on Sunday called on Senate Majority Leader Mitch McConnell (R-Ky.) to reconvene the upper chamber to vote on House legislation that would expand background checks for gun buyers in the wake of deadly mass shootings in Texas and Ohio over the weekend. “One awful event after another. Leader McConnell must call the Senate back for an emergency session to put the House-passed universal background checks legislation on the Senate floor for debate and a vote immediately,” Senate Minority Leader Chuck Schumer (D-N.Y.) said in a statement. Sens. Sherrod Brown (D-Ohio) and Bernie Sanders (I-V.t.) similarly urged McConnell to bring the Senate back into session following the shootings in El Paso and Dayton, which took place within 24 hours of each other. More than 30 people died and scores more were injured in the two shootings. The Senate adjourned last week for its annual August recess. No votes are scheduled until Sept. 9 and most lawmakers are meeting with constituents in their home states. Some also typically travel abroad during recess on congressional delegation visits to other nations. One Republican senator indicated Sunday he would be willing to go back to Washington to discuss gun violence. “I’d leave tonight, I’ll go tomorrow. It doesn’t matter to me, this is such an important issue and an issue that we sometimes only get part of the picture because of the mass shootings,” Sen. Tim Scott (R-S.C.) said in an interview with CBS’s “Face the Nation,” referring to the 2015 Charleston church shooting in his state. Earlier this year, the Democratic-controlled House passed a bill requiring background checks on all firearm sales in the country. But the measure has languished in the Republican-controlled Senate, with McConnell unwilling to bring it to the floor for a vote. In 2013, the Senate voted on a similar bill that would have expanded background checks to all gun purchases. It failed to reach the necessary 60-vote threshold to advance, however. Sen. Pat Toomey (R-Pa.), the author of the measure alongside Sen. Joe Manchin (D-W.Va.), on Sunday called on Congress to pass “bipartisan proposals such as my legislation with Senator Joe Manchin to expand background checks to all commercial firearm sales.” “While no law will end mass shootings entirely, it’s time for Congress to act to help keep our communities safer,” Toomey added in a statement. Other Republicans, such as Sen. John Cornyn of Texas, suggested the federal government has no good solution to stemming gun violence. “For every complex problem there is an answer that is clear, simple, and wrong. Sadly, there are some issues, like homelessness and these shootings, where we simply don’t have all the answers,” Cornyn tweeted Sunday. This article was updated after the death toll in the El Paso shooting increased Monday.",
      "date": "08/04/2019 02:15 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell Campaign Tweets Photo Of Opponent’s Name On Tombstone",
      "url": "https://www.huffpost.com/entry/mitch-mcconnell-tombstone-tweet-amy-mcgrath_n_5d4884dbe4b0ca604e36ac40",
      "subtitle": "His campaign manager said the photo featuring Amy McGrath’s name was a homage to a political cartoon that appeared in the Louisville Courier-Journal.",
      "author": "David Moye",
      "content": " Sen. Mitch McConnell’s campaign on Saturday tweeted out a photo showing mock tombstones with the names of former Supreme Court nominee Merrick Garland, socialism and the senator’s Democratic opponent. His opponent in the 2020 Senate race, Amy McGrath, wasn’t exactly pleased, and she noted that the tweet was posted shortly after a mass shooting in El Paso, Texas. Kevin Golden, the campaign manager for McConnell, wouldn’t comment when HuffPost asked whether the post was poorly timed. Instead, he said McGrath was being disingenuous in her response to the photo, which he said was based on a political cartoon printed in the Louisville Courier-Journal. “Our supporters built an homage to the Courier Journal cartoon at Fancy Farm and we posted their work,” he wrote in an email. “Amy McGrath has tweeted this very cartoon several times and it’s shameful that she’s pretending not to know exactly what it is referencing in order to politicize a tragedy.” This is the cartoon Golden was referring to: He added that the McConnell campaign sent many other tweets during St. Jerome Catholic Church Picnic in Fancy Farm, Kentucky. Golden’s comment that McGrath had shown support for the Courier-Journal’s cartoon, however, was itself disingenuous. McGrath retweeted the cartoon to criticize the Senate majority leader’s reaction to it.",
      "date": "08/05/2019 05:18 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell Asks For Bipartisan Fix For Shootings That Isn’t Gun Control",
      "url": "https://www.huffpost.com/entry/mitch-mcconnell-senate-bipartisan-shootings_n_5d48ab7fe4b01ae816c7334f",
      "subtitle": "As a bill for universal background checks languishes, the Senate majority leader has asked three GOP leaders to discuss solutions for gun violence.",
      "author": "Sanjana Karanth",
      "content": " Senate Majority Leader Mitch McConnell said Monday that he’s asked three GOP leaders to discuss bipartisan solutions to gun violence after two mass shootings over the weekend collectively left at least 31 people dead. The Kentucky Republican, who is notorious for blocking bipartisan legislation, said he’s spoken to Senate Judiciary Chairman Lindsey Graham (R-S.C.), Senate Commerce Chairman Roger Wicker (R-Miss.) and Senate Health, Education, Labor, and Pensions Chairman Lamar Alexander (R-Tenn.) to “engage in bipartisan discussions of potential solutions to help protect our communities without infringing on Americans’ constitutional rights.” McConnell said he asked Graham, Wicker and Alexander to come up with legislation “that can pass the Senate, pass the House, and earn the president’s signature.” “Partisan theatrics and campaign-trail rhetoric will only take us farther away from the progress all Americans deserve,” the GOP leader said, despite his own refusal to work with Democrats. McConnell has prided himself in being called the “grim reaper,” a nickname that stems from his long history of continuously blocking or killing progressive-leaning legislation in the Republican-controlled Senate, even if the bills have bipartisan support. Most notably this year, the senator has refused to bring a House-passed universal gun background checks bill to the Senate floor for a vote despite widespread bipartisan support for such legislation. After the mass shootings this past weekend, Democrats renewed their call on McConnell to reconvene the Senate ― which is currently in recess ― to vote on the background checks bill. Senate Minority Leader Chuck Schumer (D-N.Y.) criticized McConnell on Monday for failing to address the issue of gun control and continuing to refuse to put the background checks bill on the floor for a vote. “I believe it would pass,” Schumer tweeted. House Speaker Nancy Pelosi (D-Calif.) wrote a letter Monday to her Democratic colleagues saying that the House is continuing to press McConnell to pass the background checks bills and would come back from recess “if the Senate sends us back an amended bipartisan bill.” McConnell’s statement comes after he received Twitter backlash for his initial response on Sunday to the deadly shootings in El Paso, Texas, and Dayton,  Ohio. He echoed the tired and repetitive “thoughts and prayers” sentiment that Republican leaders put out after every tragedy that involves a gun. Critics slammed McConnell’s refusal to pass gun control legislation and started the hashtag #MassacreMitch, which went viral on Sunday. McConnell’s campaign also got called out for tweeting a photo — shortly after the El Paso shooting — of mock tombstones bearing the names of former Supreme Court nominee Merrick Garland, McConnell’s Kentucky Democratic opponent Amy McGrath and “socialism.”",
      "date": "08/05/2019 08:58 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Kimmel Shreds ‘Evil, Soulless Creep’ McConnell For Failing On Gun Control",
      "url": "https://www.huffpost.com/entry/kimmel-on-shootings-evil-soulless-mcconnell-senate-vote_n_5d491446e4b0244052e03625",
      "subtitle": "The “Jimmy Kimmel Live!” host called on Senate Majority Leader Mitch McConnell to take up the House’s gun legislation.",
      "author": "Josephine Harvey",
      "content": " Jimmy Kimmel had some suggestions for lawmakers on Monday after a tragic weekend of mass shootings in El Paso, Texas, and Dayton, Ohio. He called on “evil, soulless, old creep” Senate Majority Leader Mitch McConnell to allow the senate to vote on the bipartisan bill that would require universal background checks for gun owners. “He needs to drag his bony, grey ass back into work to vote on these bills,” he said. Kimmel also shared his thoughts on Donald Trump’s ridiculous response, which, unfortunately, was not a joke, and the president’s apparent failure to read the teleprompter at a press conference about the tragedies. “Nice work, Ron Burgundy.”",
      "date": "08/06/2019 04:44 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell’s Graveyard",
      "url": "https://www.huffpost.com/entry/mitch-mcconnells-graveyard_n_5d497a72e4b0676aab521cab",
      "subtitle": "null",
      "author": "",
      "content": "",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Republican Group Attacks Trump, Mitch McConnell In New Ad Running On Fox News",
      "url": "https://www.huffpost.com/entry/republican-ad-trump-mcconnell_n_5d4bc99ee4b09e7297412c8d",
      "subtitle": "The spot warns about the election security threat and urges the Senate to act.",
      "author": "Ed Mazza",
      "content": " Senate Majority Leader Mitch McConnell (R-Ky.) is getting hit by members of his own party in a new TV ad airing Thursday in Washington D.C., and in his home state. The spot urges voters to call McConnell and demand a vote on the election security bills he blocked last week. It also features a supercut of President Donald Trump dismissing the well-documented threat of election interference from Russia. The ad will run on “Morning Joe” on MSNBC and during “Fox & Friends” on Fox News in D.C. (the latter is known to be one of Trump’s favorite shows). Former Weekly Standard editor Bill Kristol shared the spot, which was created by Republicans for the Rule of Law, an organization in which he is a director: The bills, which are aimed at helping to protect against Russian meddling and other threats, include a $775 million measure passed by the House to strengthen state election systems. McConnell claimed the bills were unnecessary and said Trump had already taken action to protect elections. The ad also contains comments by Trump in which he not only claims Russia isn’t a threat, but admits he’d take dirt on a rival if Moscow offered it. “It’s not an interference,” Trump said in an ABC interview in June. “They have information. I think I’d take it.” Critics slammed McConnell for blocking the bills. “He is aiding and abetting [Russian President] Vladimir Putin’s ongoing attempts to subvert American democracy, according to the Republican FBI, CIA, DNI, intel committee,” Joe Scarborough said on his MSNBC show last week. “All Republicans are all saying Russia is subverting American democracy and Moscow Mitch won’t even let the Senate take a vote on it. That is un-American.” In response, #MoscowMitch began trending on Twitter, provoking an angry reaction from the senator. “I was called unpatriotic, un-American and essentially treasonous by a couple of left-wing pundits on the basis of bold-faced lies,” he said. “Our representatives should work to pass bipartisan legislation to deter future election meddling, secure our electoral system and encourage cybersecurity,” Republicans for the Rule of Law legal advisor Chris Truax said in a statement. “This is not a red or blue team issue. We all have a stake in free and fair American elections.”",
      "date": "08/08/2019 05:22 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "McConnell Wants To Consider Gun Background Checks In Fall, Won’t Reconvene Senate",
      "url": "https://www.huffpost.com/entry/mitch-mcconnell-consider-gun-background-checks_n_5d4d5bffe4b01e44e478e2c6",
      "subtitle": "Mitch McConnell told a Kentucky radio station that Trump called him Thursday morning and they discussed several ideas.",
      "author": "",
      "content": "WASHINGTON (AP) — Shifting the gun violence debate, Senate Majority Leader Mitch McConnell said Thursday he now wants to consider background checks and other bills, setting up a potentially pivotal moment when lawmakers return in the fall. The Republican leader won’t be calling senators back to work early, as some are demanding. But he told a Kentucky radio station that President Donald Trump called him Thursday morning and they talked about several ideas. The president, he said, is “anxious to get an outcome and so am I.” Stakes are high for all sides, but particularly for Trump and his party. Republicans have long opposed expanding background checks — a bill passed by the Democratic-led House is stalled in the Senate — but they face enormous pressure to do something after mass shootings in El Paso, Texas and Dayton, Ohio, that killed 31 people. McConnell, who is facing protests outside his Louisville home, can shift attention back to Democrats by showing a willingness to engage ahead of the 2020 election. “What we can’t do is fail to pass something,” McConnell said. “What I want to see here is an outcome.” McConnell said he and Trump discussed various ideas on the call, including background checks and the so-called “red flag” laws that allow authorities to seize firearms from someone deemed a threat to themselves or others. “Background checks and red flags will probably lead the discussion,” McConnell told Louisville’s WHAS-AM. He noted “there’s a lot of support” publicly for background checks. “Those are two items that for sure will be front and center as we see what we can come together on and pass.” Trump has been interested in federal background checks before — and tweeted Monday about them — only to drop the issue later, a turnaround similar to his reversal on gun proposals after the 2018 high school shooting at Parkland, Fla. The powerful National Rifle Association and its allies on Capitol Hill have long wielded influence, but the gun lobby’s grip on Democrats started slipping some time ago, and it’s unclear how much sway the NRA and other gun groups still hold over Republicans in the Trump era. House Speaker Nancy Pelosi and Senate Democratic Leader Chuck Schumer said Trump assured them in phone calls Thursday he will review the House-passed bill that expands federal background checks for firearm sales. In a joint statement, they said Trump called them individually after Pelosi sent a letter asking the president to order the Senate back to Washington immediately to consider gun violence measures. Schumer and Pelosi said they told Trump the best way to address gun violence is for the Senate to take up and pass the House bill. Trump, they said, “understood our interest in moving as quickly as possible to help save lives.” The politics of gun control are shifting amid the frequency and toll of mass shootings. Spending to support candidates backing tougher gun control measures — mostly Democrats — surged in the 2018 midterms, even as campaign spending by the NRA declined. NRA chief Wayne LaPierre said in rare public statement Thursday that some federal gun-control proposals “would make millions of law-abiding Americans less safe and less able to defend themselves and their loved ones.” The organization said proposals being discussed in Congress would not have prevented the mass shootings in Texas and Ohio that killed 31 people. McConnell has been under pressure from Democrats, and others, to bring senators back to Washington after the back-to-back weekend shootings. Earlier, more than 200 mayors, including those in Dayton and El Paso, urged the Senate to return to the Capitol. “Our nation can no longer wait,” they wrote. McConnell on Thursday rejected the idea of reconvening the Senate, saying calling senators back now would just lead to people “scoring points and nothing would happen.” Instead, the GOP leader wants to spend the August recess talking with Democratic and Republican senators to see what’s possible. Senators have been talking among themselves, and holding conference calls, to sort out strategy. “If we do it prematurely it’ll just be another frustrating position for all of us and for the public,” he said. The politics of gun violence are difficult for Republicans, including McConnell. He could risk losing support as he seeks reelection in Kentucky if he were to back restricting access to firearms and ammunition. Other Republicans, including those in Colorado, Maine and swing states, also would face difficult votes, despite the clamor for gun laws. GOP senators are also considering changes to the existing federal background check system, modeled on a law signed last year that improved the National Instant Criminal Background Check system, as well as increased penalties for hate crimes. While many of those proposals have bipartisan support, Democrats are unlikely to agree to them without consideration of the more substantive background checks bill. “We Democrats are not going to settle for half-measures so Republicans can feel better and try to push the issue of gun violence off to the side,” Schumer said Wednesday. Sen. Joe Manchin, a West Virginia Democrat who, along with Sen. Pat Toomey, R-Pa., is pushing a bill to expand background checks, said Trump’s support will be the determining factor in whatever gets done. “At this point in time leadership comes from President Trump,” Manchin said. ___ Associated Press writer Bruce Schreiner in Louisville, Kentucky, contributed to this report.",
      "date": "08/09/2019 08:00 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell Won’t Reconvene Senate On Gun Control",
      "url": "https://www.huffpost.com/entry/mitch-mcconnell-wont-reconvene-senate-on-gun-control_n_5d4dc2d8e4b00efe5c019428",
      "subtitle": "null",
      "author": "",
      "content": "",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Trump, McConnell Campaigns Sell Brett Kavanaugh Shirts To ‘Drive Liberals Crazy’",
      "url": "https://www.huffpost.com/entry/trump-mcconnell-campaigns-t-shirt-supreme-court_n_5d528c01e4b0cfeed1a2f1d3",
      "subtitle": "The T-shirts bear the slogan “Back-to-Back Supreme Court Champs” and feature the images of Trump and McConnell in silhouette.",
      "author": "Lee Moran",
      "content": " The reelection campaigns of President Donald Trump and Senate Majority Leader Mitch McConnell (R-Ky.) have released a T-shirt that is being promoted as a way to “drive liberals crazy.” The shirt bears the slogan “Back-to-Back Supreme Court Champs” and features the profile images of Trump and McConnell in silhouette. It celebrates the confirmations of conservative Supreme Court Justices Neil Gorsuch and Brett Kavanaugh, whose names are written on the sleeves. “President Trump and Senate Majority Leader Mitch McConnell just keep WINNING,” reads a post on the GOP’s WinRed fundraising platform, where the shirts are available in exchange for a minimum donation of $35. “They confirmed TWO conservative Supreme Court Justices in the last 2 years,” it adds. “We just launched these exclusive, limited-edition, Official Supreme Court Back to Back Champs T-shirts to celebrate our win and drive liberals crazy.” “Your contribution will benefit McConnell Senate Committee and Trump Make America Great Again Committee,” the post notes. The Republican National Committee is also hawking the shirts via its official Twitter account: Gorsuch secured his seat on the Supreme Court in 2017 after McConnell blocked former President Barack Obama’s nominee, Merrick Garland. McConnell later called it “one of my proudest moments.” Kavanaugh was confirmed last year despite allegations of sexual misconduct, all of which he denied.",
      "date": "08/13/2019 07:05 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Republican Group Urges GOP Senators To Stand Up To Mitch McConnell In Damning New Ads",
      "url": "https://www.huffpost.com/entry/republicans-mitch-mcconnell-election-ads_n_5d5cce2ae4b0d1e11369ce03",
      "subtitle": "The Senate majority leader is facing new pressure to act on stalled election security bills.",
      "author": "Ed Mazza",
      "content": " Senate Majority Leader Mitch McConnell (R-Ky.) is facing new pressure from his own party for blocking two election security bills. McConnell’s actions last month caused the derisive nickname #MoscowMitch to trend on Twitter as critics accused him of failing to give election officials the resources needed to fight expected Russian interference in the 2020 presidential election. Republicans for the Rule of Law, a GOP group highly critical of President Donald Trump, launched a campaign earlier this month demanding that the Senate leader allow a vote on the bills. But McConnell hasn’t relented, so now the organization is taking out TV spots in the home states of four key senators: Lindsey Graham (R-S.C.), Marco Rubio (R-Fla.) James Lankford (R-Okla.) and Roy Blunt (R-Mo.). The ads urge the senators to stand up to McConnell to get a vote on the stalled bills. Republicans for the Rule of Law said the ads will run on “Fox & Friends,” “Meet the Press” and “Fox News Sunday” in each senator’s home state as well as online. “Don’t let Mitch McConnell stand in your way,” the spots conclude. The videos mix news footage describing Russia’s 2016 interference with each senator’s own comments on the threat. “Russia’s interference is a threat to our democracy,” Graham said in the footage. “If we don’t hit them hard, we will be empowering Russia.” “I don’t think Vladimir Putin interfered in our election,” Rubio said in the spot slated to air in Florida. “I know he did.” Graham, Rubio and Lankford are all cosponsors of election security bills. Blunt has said he will not bring up the bills for a vote in the Rules Committee, which he chairs. The bills blocked by McConnell include a $775 million measure passed by the House that would shore up state election systems. McConnell has insisted that President Donald Trump is working to protect next year’s election and said the bills weren’t needed. Trump has also indicated that he’d accept dirt on a political rival from a foreign power. “They have information? he told ABC News in June. “I think I’d take it.”",
      "date": "08/21/2019 05:32 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "As #MassacreMitch Trends After Texas Shooting, Democrats Urge McConnell To Act",
      "url": "https://www.huffpost.com/entry/massacre-mitch-schumer-pelosi-mcconnell-gun-control-odessa_n_5d6b92d3e4b0cdfe057179a1",
      "subtitle": "Democratic leaders are pushing the Senate majority leader to take action on gun control legislation. “Enough is enough,” House Speaker Nancy Pelosi said.",
      "author": "Dominique Mosbergen",
      "content": " In the wake of yet another deadly mass shooting, Democratic leaders have urged Senate Majority Leader Mitch McConnell (R-Ky.) to do something about the “gun violence epidemic” in the United States by taking up legislation that would expand federal background checks on gun purchases. Senate Minority Leader Chuck Schumer (D-N.Y.) and House Speaker Nancy Pelosi (D-Calif.) pressed McConnell on Saturday to take action on H.R. 8, also known as the Bipartisan Background Checks Act of 2019. The bill — which seeks to close loopholes allowing private or online sales of guns and sales at gun shows without background checks — was passed by the Democratic-controlled House in February. McConnell has faced mounting pressure from Democratic lawmakers and others to bring the legislation to the Senate floor, but he has yet to do so. The majority leader “should bring up H.R. 8 the week Congress returns,” Schumer said in a Saturday night tweet, hours after a gunman went on a shooting rampage in West Texas, killing multiple people and injuring at least 21. Three officers were among those who were injured, police said. A 17-month-old baby was also wounded in the attack. “Enough is enough,” Pelosi said later in a statement. “Every day, the epidemic of gun violence inflicts a devastating toll in communities in every corner of our country, forcing far too many to endure heartbreak and tragedy.” “The Republican Senate must end its obstruction and finally pass the commonsense, bipartisan, House-passed gun violence prevention legislation that the country is demanding,” she added. Congress will reconvene on Sept. 9 after its summer recess. Other Democratic lawmakers, including Sens. Elizabeth Warren of Massachusetts and Kirsten Gillibrand of New York, also called on McConnell to do more. “America is done waiting for you,” Warren, a 2020 presidential contender, tweeted. Rep. Katie Porter (D-Calif.) appealed to McConnell to move on H.R. 8 as well as H.R. 1112, another gun control bill passed by the House in February that would require a gun dealer to wait 10 days to hear back from federal authorities about a potential buyer’s background check before moving ahead with a gun sale. The hashtag #MassacreMitch started trending on Twitter on Saturday as people called on the senator to take action against gun violence. The hashtag also went viral in August following back-to-back mass shootings in El Paso, Texas, and Dayton, Ohio.",
      "date": "09/01/2019 09:06 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "McConnell Says He’ll Only Allow Vote On Gun Legislation With Trump’s Backing",
      "url": "https://www.huffpost.com/entry/mitch-mcconnell-gun-legislation-trump_n_5d6e828de4b0cdfe05763012",
      "subtitle": "“If the president is in favor of a number of things that he has discussed openly and publicly — and I know that if we pass it, it’ll become law — I’ll put it on the floor,” the Senate majority leader pledged.",
      "author": "Igor Bobic",
      "content": " Senate Majority Leader Mitch McConnell (R-Ky.) reiterated Tuesday his position on bringing gun control legislation to the floor of the upper chamber, saying he will only do so if it has the backing of President Donald Trump, who would need to sign it before becoming law. The Kentucky Republican was asked about the matter during an interview with conservative radio host Hugh Hewitt following the latest mass shooting in Odessa, Texas, where a gunman killed at least seven people and injured 22 others in a drive-by rampage. That incident came less than a month after the deadly mass shootings in El Paso, Texas, and in Dayton, Ohio. “I said several weeks ago that if the president took a position on a bill so that we knew we would actually be making a law and not just having serial votes, I’d be happy to put it on the floor,” McConnell told Hewitt in the interview. McConnell said the Trump administration is “in the process of studying what they are prepared to support, if anything” on the topic of gun control, and that he expected to know the answer next week after the Senate returns from recess. “If the president is in favor of a number of things that he has discussed openly and publicly — and I know that if we pass it, it’ll become law — I’ll put it on the floor,” he added. The House passed a bill earlier this year that would require universal background checks for all gun purchases. It faces stiff opposition in the GOP-controlled Senate, however. Sen. Chris Murphy (D-Conn.), a vocal gun control advocate, has been in conversations with the White House about a potential deal on expanding background checks for gun purchases. He told reporters last month that he’s holding out hope for Trump to follow through on taking action on guns, despite his habit of making promises and then backtracking after facing resistance from his base. Some Senate Republicans also see a path forward on gun control legislation. “I have spoken with the president repeatedly and recently about this topic. He is very interested in doing something meaningful,” Sen. Pat Toomey (R-Pa.) said Sunday on ABC’s “This Week,” adding that his staff and the White House are “very seriously pursuing this.” Toomey co-sponsored a bipartisan background checks bill with Sen. Joe Manchin (D-W.Va.). That legislation failed to overcome a GOP-led filibuster in 2013. Trump’s position on background checks and other measures seeking to keep guns out of the hands of potentially dangerous people has varied widely in the last month, though. It’s also unclear whether he can stick to an endorsement of any potential deal on gun control after hearing from conservative news outlets and the National Rifle Association, the nation’s top gun lobby.",
      "date": "09/03/2019 12:36 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell Rails Against ‘Moscow Mitch’ Nickname: It’s ‘Over The Top’",
      "url": "https://www.huffpost.com/entry/mitch-mcconnell-moscow-mitch-nickname-over-the-top-smear_n_5d6ebd2fe4b09bbc9ef5d7a8",
      "subtitle": "The Senate majority leader voiced frustration over the moniker, given him for blocking two election security bills.",
      "author": "Amy Russo",
      "content": " “Moscow Mitch” has gained traction as a nickname for Senate Majority Leader Mitch McConnell, and the powerful Kentucky Republican is none too happy about that. In an interview Tuesday with conservative radio host Hugh Hewitt, McConnell decried the alliterative sobriquet given him by critics after he stymied Senate consideration of two election security bills. The label, he complained, is a political smear. “It’s modern-day McCarthyism,” he said. “Unbelievable for a Cold Warrior like me who spent a career standing up to the Russians to be given a moniker like that. It’s an effort to smear me.” Referring to a previous tag he had earned for thwarting other bills, he said, “You know, I can laugh about things like the Grim Reaper, but calling me Moscow Mitch is over the top.” In July, McConnell thwarted a House-passed measure that sought to authorize $775 million to fortify state election systems and require paper ballots for added security. He also blocked a separate proposal that would have required candidates as well as their staffers and family members to alert federal authorities if offered aid by foreign governments ― a measure sparked by the various revelations into Russian interference in the U.S. 2016 election. MSNBC host Joe Scarborough derided the senator the next day, dubbing him “Moscow Mitch” ― and the nickname was born. Within hours, it began trending on Twitter, even inspiring a song from rock musician Ben Folds, who performed the tune at a show in New York. It also followed McConnell home, with opponents chanting it as he tried to speak at a political picnic a few weeks ago in Fancy Farm, Kentucky. Continuing to voice his frustration over his inability to shake the tag, McConnell told Hewitt it’s a product of “what we’re up against with the hard left today in America.” Washington Post columnist Dana Milbank had also taken McConnell to task just after he senator blocked action on the election security bills, calling him a “Russian asset” in a searing op-ed. “Let’s call this what it is: unpatriotic,” Milbank wrote. “The Kentucky Republican is, arguably more than any other American, doing Russian President Vladimir Putin’s bidding.” A visibly enraged McConnell responded with a defensive Senate floor speech at the end of July, dismissing both Scarborough and Milbank as “hyperventilating hacks.” “It’s like an inflationary crisis, but with outrage instead of dollars,” he said. McConnell’s sensitivity to the nickname may stem in part from a potentially spirited Democratic challenge to his bid for a seventh term in the 2020 election. CORRECTION: This article previously misattributed the “Moscow Mitch” song to the Ben Folds Five; rather, it is by Folds as a solo artist.",
      "date": "09/03/2019 04:55 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Washington Post Editorial Sends Heartbreaking Message To Mitch McConnell About Gun Control",
      "url": "https://www.huffpost.com/entry/washington-post-editorial-board-mitch-mcconnell-message_n_5d6f7559e4b0cdfe0577f4ec",
      "subtitle": "The newspaper listed the names of hundreds of victims of mass shootings to urge the Senate majority leader to “do something.”",
      "author": "Lee Moran",
      "content": " The Washington Post editorial board on Wednesday listed the names of hundreds of mass shooting victims to send a powerful message to Senate Majority Leader Mitch McConnell (R-Ky.) about gun control. The full-page opinion piece — titled “Do Something, Mr. McConnell” — urged that “when the Senate returns from its Labor Day recess, it must act on guns.” “What if there was a mass shooting in the United States not once or twice or four or six times monthly, but every single day, a big one, the kind that electrifies social media and squats for days on Page 1 — would that be enough to move Senate Majority Leader Mitch McConnell from his insistent inertia on gun safety?” the editorial asked. “Would any volume of bloodshed convince the Kentucky Republican that Congress faces a moral imperative to act? Thirty-eight people were slain in three such shootings in August — in Dayton, Ohio, and El Paso, as well as West Texas — and still Senate Republicans and President Trump refuse to act,” it added. The editorial acknowledged that no single law would end America’s gun violence epidemic, but suggested banning the sale of military-grade assault weapons could “slow the growth of this list.” Read the full editorial here.",
      "date": "09/04/2019 05:02 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Ari Melber Points Out Mitch McConnell’s Double Standards On Nicknames",
      "url": "https://www.huffpost.com/entry/mitch-mcconnell-nicknames-ari-melber_n_5d70a874e4b011080459fae7",
      "subtitle": "McConnell may hate being called “Moscow Mitch,” but he’s not so particular about his other monikers.",
      "author": "Lee Moran",
      "content": " Senate Majority Leader Mitch McConnell (R-Ky.) may still be seething about his new “Moscow Mitch” nickname. But he isn’t so critical about his other monikers, as MSNBC’s Ari Melber pointed out on Wednesday’s broadcast of “The Beat.” Melber noted that McConnell previously agreed with House Speaker Nancy Pelosi’s (D-Calif.) claim that he was the “Grim Reaper” of the Senate, fundraised off the unfounded “Cocaine Mitch” insult bestowed upon him by a political rival and even embraced the epithet of “Darth Vader.” Check out the clip here:",
      "date": "09/05/2019 03:43 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Nancy Pelosi: ‘Grim Reaper’ McConnell May Have ‘Hell To Pay’ For Inaction On Guns",
      "url": "https://www.huffpost.com/entry/nancy-pelosi-grim-reaper-mitch-mcconnell-guns_n_5d76d5e4e4b0fde50c2ba294",
      "subtitle": "The House speaker warned the Senate majority leader that Democrats aren’t backing down on the matter.",
      "author": "Amy Russo",
      "content": " House Speaker Nancy Pelosi (D-Calif.) warned Senate Majority Leader Mitch McConnell (R-Ky.) that he may have “hell to pay” if the GOP fails to pass a universal background checks bill. “There isn’t anyone in this institution or anywhere else in public life whose political survival is more important than the survival of our children and the safety of our communities,” she said at a press conference Monday alongside Senate Minority Leader Chuck Schumer (D-N.Y.) and other Democrats. “We are not taking ‘no’ for an answer, and we are not going away.” Pelosi pointed out that the vast majority of Americans are in favor of background checks on all sales of firearms and outraged by Republican lawmakers’ inability to get on board with the measure. “What courage does it take to support legislation that will save lives?” she asked before taking a jab at McConnell, whom she called the “Grim Reaper.” “So here we are, once again asking the grim reaper, informing the Grim Reaper that these bills are alive and well in the public,” Pelosi said. “Some of the gun violence prevention groups have upped the ante even further to say that if this bill is not passed, Mitch McConnell and Republicans in the Senate and the president will have hell to pay,” Pelosi added. “So let’s save time.” Nan Whaley, the Democratic mayor of Dayton, Ohio, was also present at the conference, representing the city where a mass shooting killed nine people last month and injured 27 others. “I’m here on behalf of the citizens of Dayton who called us that night to do something,” Whaley said. “This is something that can be done, can be fast and will save lives.” The Dayton massacre came less than 24 hours after a gunman opened fire at a Walmart in El Paso, Texas, killing 22 people and injuring 26. The universal background checks bill cleared the House in February but has since stalled in the Republican-controlled Senate.",
      "date": "09/09/2019 07:54 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Nancy Pelosi Turns Reporter’s Gun Control Question Into A Repudiation Of Mitch McConnell",
      "url": "https://www.huffpost.com/entry/nancy-pelosi-reporter-question-gun-control_n_5d7a06dce4b06028fd377bd9",
      "subtitle": "“I’m getting very angry about the silliness of these questions,” the House speaker fired back in a video that’s now going viral.",
      "author": "Lee Moran",
      "content": " House Speaker Nancy Pelosi (D-Calif.) chided a reporter and swiftly turned her anger on Senate Majority Leader Mitch McConnell (R-Ky.) after being quizzed on gun control legislation. Tal Kopan, Washington correspondent for the San Francisco Chronicle, was scolded by Pelosi Tuesday after asking if she “had any regrets about not bringing the House back in August to keep the flame lit on gun violence.” “No, absolutely not,” Pelosi responded. “We did our jobs. The Senate was supposed to come back. Why don’t you all get that straight? The Senate did not come back to pass the bill.” Check out the video here: The Democratic-controlled House passed the Bipartisan Background Checks Act in February. McConnell, however, hasn’t brought the legislation to the Senate floor for a vote. “I’m getting very angry about the silliness of these questions,” Pelosi continued. “Lives are at stake. Sen. McConnell is standing in the way. We passed our bill in February. Members had events all over the country to ask him to bring up the bill.” “Don’t ask me what we haven’t done. We have done it,” she added. “If you are annoyed with my impatience, it’s because people are dying because Sen. McConnell hasn’t acted. Why don’t you go ask him if he has any regrets for all the people who died because he hasn’t acted?” Kopan later tweeted it was “the angriest” she’d seen Pelosi.",
      "date": "09/12/2019 05:38 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell Backs Election Security Funding After Blocking It Repeatedly",
      "url": "https://www.huffpost.com/entry/mitch-mcconnell-election-security_n_5d83c8e3e4b070d468c961e0",
      "subtitle": "The Republican Senate leader, who railed against the nickname “Moscow Mitch,” announced his support for $250 million in funds to beef up voting systems.",
      "author": "Igor Bobic",
      "content": " Senate Majority Leader Mitch McConnell (R-Ky.) on Thursday introduced an amendment that would give $250 million to the states to beef up their voting systems after months of criticism that he was standing in the way of attempts to strengthen election security. The amendment was successfully added to an annual spending bill by a bipartisan voice vote in the Senate Appropriations Committee, which the Kentucky Republican sits on. McConnell and other Republicans repeatedly blocked previous efforts from Democrats to strengthen election security. In August 2018, for example, nearly every Republican voted against adding $250 million to election security funding ahead of the midterms that year, maintaining that funds Congress previously allocated for the effort had not yet been spent. Democrats also sought to pass additional election security bills in June following special counsel Robert Mueller’s warning that Russia was laying the groundwork to interfere in the 2020 election. But McConnell blocked those as well, earning him the nickname “Moscow Mitch” from MSNBC host Joe Scarborough. The moniker seemed to hit a nerve with McConnell, who later condemned it as “modern-day McCarthyism” and an “over the top” smear on his career. McConnell maintained he was broadly opposed to all Democratic legislation concerning election security ― in addition to a major bill the Democratic-controlled House passed last year ― because of his concern it would give the federal government too much power over state election systems. He echoed that argument again on Thursday. “The Trump Administration has made enormous strides to help states secure their elections without giving Washington new power to push the states around. That’s how we continue the progress we saw in 2018 and that’s exactly what we’re doing,” McConnell said on the floor Thursday after announcing his support for the amendment. Even though House Democrats are requesting an additional $600 million in election security funding, their Senate counterparts welcomed the news that McConnell had moved closer to their position on the matter. “Thank God, he’s seen the light,” Senate Minority Chuck Schumer (D-N.Y.) said in a speech on the floor. “Maybe, just maybe, Republicans are starting to come around to our view.” Sen. Dick Durbin (D-Ill.), the No. 2 Democrat in the Senate, offered a more pithy response when informed by reporters of McConnell’s announcement. “No more invitations to the Kremlin for him,” Durbin quipped.",
      "date": "09/19/2019 03:44 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell Says He’d Have ‘No Choice’ But To Start Impeachment Trial",
      "url": "https://www.huffpost.com/entry/trump-impeachment-mcconnell-trial_n_5d921f51e4b0ac3cddac71e9",
      "subtitle": "“We’ll follow the Senate rules,” the majority leader said of the impeachment process.",
      "author": "Igor Bobic",
      "content": " U.S. Senate rules require the upper chamber to begin a trial if the House votes to impeach President Donald Trump, Senate Majority Leader Mitch McConnell (R-Ky.) said Monday. “We’ll follow the Senate rules,” McConnell told CNBC. “I would have no choice but to take it up.” The House launched a formal impeachment inquiry last week following a whistleblower complaint concerning a July phone call in which Trump repeatedly urged Ukraine’s president to initiate an investigation into his political rival Joe Biden and his son. Trump did so while holding up U.S. military aid to Ukraine. Some news outlets and pundits have speculated that McConnell could simply refuse to hold a trial, likening the move to his refusal to give President Barack Obama’s Supreme Court nominee Merrick Garland a confirmation hearing in 2016. McConnell reaffirmed Monday his hands would be tied on the matter of starting a trial, but he suggested it was within his power to determine its scope and length. The 1999 Senate trial of President Bill Clinton lasted about a month. “How long you’re on it is a whole different matter,” McConnell said, noting he could call a vote on a motion to dismiss, which would effectively amount to a vote to acquit Trump of wrongdoing. The Kentucky Republican also told CNBC he would not attempt to change Senate impeachment rules to avoid a trial, calling them “very clear.” The House scheduled five depositions beginning this week with State Department officials who would have knowledge of Trump’s engagements with Ukraine, the lower chamber’s first steps as they seek to build a case for impeachment. A majority of Americans said they believe Congress opening an impeachment inquiry into Trump is necessary, according to a CBS News poll released Sunday.",
      "date": "09/30/2019 12:21 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell Has No Thoughts On Trump Suggesting ‘Civil War’ Over His Impeachment",
      "url": "https://www.huffpost.com/entry/mitch-mconnell-trump-impeachment-civil-war_n_5d922701e4b0e9e76050b654",
      "subtitle": "The president also is throwing the word “treason” around a lot. NBD!",
      "author": "",
      "content": "WASHINGTON ― President Donald Trump’s rhetoric hit new levels of recklessness over the weekend as he suggested a civil war could break out and accused a top Democratic House member of treason as the impeachment investigation against him ramps up. But Senate Majority Leader Mitch McConnell (R-Ky.) doesn’t seem to have any problem with it. Asked specifically for comment on Trump’s escalating attacks over the past 48 hours, McConnell went ahead and changed the subject. “Look, what I want to do is spend our time accomplishing things for the American people,” the Senate GOP leader said in a Monday interview on CNBC. “The House wants to spend ― they spent the last three years harassing this president and I gather we’re going to get another chapter of that with the impeachment episode,” McConnell continued. “But we need to find other things that actually make a difference for the American people and try to accomplish as much as we can.” (McConnell’s words ring particularly hollow considering there are piles of House-passed bills sitting in the Senate going nowhere. His unwillingness to act on that legislation, or on Senate bills, is frustrating to some even in his own party.) In a series of tweets Sunday, the president quoted Dallas megachurch pastor Robert Jeffress, who said during an appearance on Fox News that if Democrats remove Trump from office, “it will cause a Civil War-like fracture in this nation from which this country will never heal.” On Monday morning, the president suggested in a tweet that House Intelligence Committee Chair Adam Schiff (D-Calif.), who will lead the impeachment investigation, ought to be arrested for treason. The penalties for treason include death. House Democrats could vote to impeach the president as soon as this year, but it wouldn’t remove him from office. That would only happen if the Senate subsequently votes to convict Trump of charges laid out in House articles of impeachment. It would take a supermajority to do that, or 67 senators ― meaning 20 Republicans would have to join the entire Democratic Caucus ― which seems unlikely. But McConnell said he would not try to prevent the trial from occurring. “We’ll follow the Senate rules,” McConnell said Monday. “I would have no choice but to take it up.” Trump has also suggested that an intelligence community whistleblower committed treason by using official channels to warn that Trump pressured the Ukrainian government to dig up dirt on Joe Biden, a top 2020 political rival. The whistleblower’s complaint, which says the president “is using the power of his office to solicit interference from a foreign country in the 2020 U.S. election,” is corroborated by a White House summary of the president’s July phone call with Ukrainian President Volodymyr Zelenksy. Only a couple of Republicans have dared to say the president is going too far with his rhetoric. “I have never imagined such a quote to be repeated by a President,” Rep. Adam Kinzinger (R-Ill.) tweeted in response to Trump’s Civil War post. “This is beyond repugnant.” Last week, Rep. Mike Conaway (R-Texas) warned about the president’s rhetoric without criticizing him directly. “Throwing the word ‘treason’ around is as dangerous has throwing the word ‘impeachment’ around,” Conaway told HuffPost.",
      "date": "09/30/2019 12:43 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell Criticizes Trump’s Syria Decision",
      "url": "https://www.huffpost.com/entry/mitch-mcconnell-trump-syria-turkey-kurds_n_5d9b7e38e4b0fc935edeabc2",
      "subtitle": "The Senate majority leader joined other Republicans who are speaking out against the president’s decision to withdraw U.S. troops from Syria.",
      "author": "Antonia Blumberg",
      "content": " Senate Majority Leader Mitch McConnell on Monday criticized President Donald Trump’s decision to withdraw support for Kurdish allies in northern Syria ahead of Turkey’s planned invasion of the region. The White House announced on Sunday that it would effectively allow Turkey to invade northern Syria by withdrawing U.S. troops from the region. The decision startled some members of Congress, including Republicans, who warned such a move could precipitate a genocide of the Kurds and lead to the return of the self-described Islamic State (also known as ISIS) in the region. “I urge the President to exercise American leadership to keep together our multinational coalition to defeat ISIS and prevent significant conflict between our NATO ally Turkey and our local Syrian counterterrorism partners,” McConnell said in a statement. Trump defended his decision, which he made against the recommendations of the Pentagon and State Department. “The U.S. has done far more than anyone could have ever expected, including the capture of 100% of the ISIS Caliphate,” the president falsely claimed in a Monday tweet. “It is time now for others in the region, some of great wealth, to protect their own territory.” Trump also tweeted that he would “totally destroy and obliterate” Turkey’s economy if the country took any action he considers “off limits” in the wake of the U.S.’s withdrawal. In a bipartisan statement, Sen. Mitt Romney (R-Utah) and Sen. Chris Murphy (D-Conn.) on Monday requested Trump send a representative to appear before the Senate Foreign Relations Committee to defend the move. “The Administration must come before the Senate Foreign Relations Committee and explain to the American people how betraying an ally and ceding influence to terrorists and adversaries is not disastrous for our national security interests,” the senators said. Sen. Lindsey Graham (R-S.C.), a frequent cheerleader of the president, called the decision “shortsighted” and “irresponsible” in a phone interview with “Fox & Friends” on Monday. House Speaker Nancy Pelosi (D-Calif.) in a statement called Trump’s decision “reckless” and “misguided.” “The President’s decision to withdraw U.S. forces from Northern Syria is a deeply disturbing development that betrays our Kurdish allies who have been instrumental partners in our mission to eradicate ISIS,” Pelosi said. “Despite what the President might say, ISIS remains a serious threat. This reckless, misguided decision undermines the efforts by our brave servicemembers and our allies to end ISIS’s tyranny.” This is a developing story. Check back for updates.",
      "date": "10/07/2019 02:16 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell Prepares For Impeachment Trial In The Senate",
      "url": "https://www.huffpost.com/entry/impeachment-senate-trial-mitch-mcconnell_n_5da76c3fe4b08e8f79038e79",
      "subtitle": "The chamber could take up articles of impeachment against President Donald Trump as early as next month.",
      "author": "Igor Bobic",
      "content": " WASHINGTON ― Senate Majority Leader Mitch McConnell confirmed Wednesday that the U.S. Senate will hold a trial if the House sends it articles of impeachment against President Donald Trump. The Kentucky Republican gave GOP senators a tutorial on the hypothetical process based on previous trials in the Senate at a weekly caucus lunch. The chamber could take up articles of impeachment against Trump as early as next month, depending on how fast the House advances its inquiry into the president. “Senators will not be allowed to speak, which will be good therapy for a number of them,” McConnell quipped to reporters after the meeting. As in the trial of President Bill Clinton, the Supreme Court’s chief justice would preside as judge. The senators, meanwhile, would act as the jurors. The proceedings would carry on six days a week (all except Sunday) until a final vote on conviction. However, McConnell has previously suggested it is within his power to determine the trial’s scope and length. Senators had many questions about the process on Wednesday, including how long it would last. Clinton’s impeachment trial lasted five weeks ― meaning Trump’s trial could take up the entire legislative work period between Thanksgiving and Christmas. “Every question you could imagine was probably asked so I did not ask any questions but I have to admit I was grateful for the civics lesson because it’s not something we deal with very often, thank God,” Sen. Kevin Cramer (R-N.D.) said. Many of the rules governing the trial, however, will depend on bipartisan agreement at its outset. During the Clinton trial, for example, both sides agreed that senators could call a vote on a motion to dismiss the articles, which would effectively amount to a vote to acquit Trump of wrongdoing. “[Then-West Virginia Sen. Robert] Byrd made a motion to dismiss two weeks in, but of course it was agreed upon by unanimous consent that he could make that motion, and it failed. Basic nerdy stuff like that that we actually kicked around,” Cramer added of the Senate GOP discussion. The House launched a formal impeachment inquiry last month following a whistleblower complaint concerning a July phone call in which Trump repeatedly urged Ukraine’s president to initiate an investigation into his political rival Joe Biden and his son Hunter. Trump did so while holding up U.S. military aid to Ukraine. The White House, however, has refused any cooperation with the House impeachment inquiry, blocking testimony from numerous Trump administration officials. Democrats warned that the refusal amounts to obstruction of justice. Republicans, including McConnell, have also spoken dismissively of the House impeachment inquiry, calling the way Democrats have conducted it unfair to the president. “Democrats have been engaged in a three-year-long impeachment parade in search of a rationale. Prominent House Democrats were promising impeachment at the very beginning of this presidency. Fairness and due process are not their objectives here,” McConnell said in a floor speech earlier on Wednesday. But McConnell declined to weigh in on the appropriateness of Trump’s phone call with the leader of Ukraine at his press conference Wednesday, saying only that Trump is “entitled to due process in the House.”",
      "date": "10/16/2019 04:45 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell: Trump’s ‘Nightmare’ Syria Withdrawal Threatens To Bring Terror Home",
      "url": "https://www.huffpost.com/entry/mitch-mcconnell-donald-trump-syria-turkey-isis-op-ed_n_5daa38a7e4b0f34e3a75a4de",
      "subtitle": "Pulling out of Syria is a “grave strategic mistake,” the Senate majority leader warned in an op-ed.",
      "author": "Mary Papenfuss",
      "content": " Senate Majority Leader Mitch McConnell (R-Ky.) lambasted President Donald Trump’s decision to pull U.S. troops from Syria in an op-ed Friday, calling the move a “grave strategic mistake” that threatens to bring “terror to our shores.” “The combination of a U.S. pullback and the escalating Turkish-Kurdish hostilities is creating a strategic nightmare for our country,” McConnell warned in The Washington Post. The events have “set back the United States’ campaign against the Islamic State and other terrorists. Unless halted, our retreat will invite the brutal Assad regime in Syria and its Iranian backers to expand their influence.” McConnell also noted that “we are ignoring Russia’s efforts to leverage its increasingly dominant position in Syria to amass power and influence throughout the Middle East and beyond. ... Predictably, our adversaries seem to be relishing these developments.” The Kentucky senator pointed to his experience working with three presidential administrations since the Sept. 11 terror attacks and learning that the threat from groups like the self-described Islamic State, also known as ISIS, “is real and cannot be wished away,” he warned. He pointed out that the U.S. is “not in this fight alone,” and has relied on local forces, including the Kurds, in the fight against ISIS. “Ironically, Syria had been a model for this increasingly successful approach,” McConnell noted. “We saw humanitarian disaster and a terrorist free-for-all after we abandoned Afghanistan in the 1990s, laying the groundwork for 9/11,” McConnell wrote. “We will see these things anew in Syria and Afghanistan if we abandon our partners and retreat from these conflicts before they are won.” Earlier this month, Trump agreed to cede the battlefield in northeast Syria to Turkey, which began attacking Kurdish residents of the region almost immediately. Read McConnell’s entire op-ed here.",
      "date": "10/18/2019 07:53 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell: Trump’s Lynching Tweet ‘Was An Unfortunate Choice Of Words’",
      "url": "https://www.huffpost.com/entry/mitch-mcconnell-trump-lynching_n_5daf55b2e4b0f34e3a7dcd77",
      "subtitle": "The Senate majority leader offered mild disapproval of the president’s offensive attack on the impeachment process.",
      "author": "Amy Russo",
      "content": " Senate Majority Leader Mitch McConnell (R-Ky.) offered lukewarm disapproval of President Donald Trump’s claim that the House impeachment inquiry is tantamount to a lynching, becoming one of a small handful of Republican lawmakers to publicly break with the president on that language. “Given the history in our country, I would not compare this to a lynching,” McConnell said Tuesday. “That was an unfortunate choice of words.” The senator then returned to criticizing the impeachment investigation. “It is an unfair process,” he said, “and a better way to characterize it would be to call it an unfair process and inconsistent with the kinds of procedural safeguards that are routinely provided for people in this kind of situation, either in court or in an impeachment process in our country.” Earlier in the day, Trump had once again aired his frustration over the impeachment proceedings. But this time, he took it a step further, tweeting that he is the victim of a lynching ― a term usually applied to the acts of terror against Black people that occurred primarily in the Jim Crow-era South. Though McConnell mildly criticized Trump’s statement on Tuesday, he refused to condemn the president’s series of racist tweets about Democratic congresswomen of color in July, merely stating that “all of us have a responsibility to elevate the public discourse.” The month before, McConnell dismissed the idea of modern-day reparations for slavery ― an idea that has been seriously considered by other lawmakers ― because “no one currently alive was responsible for that.” Besides, he said, civil rights laws and President Barack Obama’s election prove that reparations are not necessary. Shortly after, when NBC News reported that the senator’s ancestors were slaveholders, McConnell said he was “in the same position” as Obama because “we both oppose reparations, and we both are the descendants of slaveholders.” McConnell joins a relatively short list of Republicans who have scrutinized Trump’s recent comments, although some have responded more forcefully. “‘Lynching’ brings back images of a terrible time in our nation’s history, and the President never should have made that comparison,” Sen. Susan Collins (R-Maine) tweeted. House Minority Leader Kevin McCarthy (R-Calif.) told reporters that Trump’s words are “not the language I would use.” Conversely, Sen. Lindsey Graham (R-S.C.), a Trump loyalist on nearly all issues, doubled down on the president’s statement, claiming the impeachment inquiry “is a lynching in every sense.” Michael Steele, the former Republican National Committee chairman, took direct aim at both Trump and Graham on Twitter, sharing an image of a lynching. “Trump this is not happening to you and it’s pathetic that you act like you’re such a victim; but it did happen to 147 black people in your state Lindsey,” Steele wrote. White House deputy press secretary Hogan Gidley argued that Trump was “not comparing what’s happened to him with one of our darkest moments in American history,” despite the fact that the president’s tweet did exactly that.",
      "date": "10/22/2019 04:59 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell Contradicts Trump’s Claim They Spoke About His Ukraine Call",
      "url": "https://www.huffpost.com/entry/mitch-mcconnell-denies-trump-ukraine-call_n_5daf6ee4e4b08cfcc323f559",
      "subtitle": "The president said the Senate majority leader spoke with him and called it “the most innocent phone call he’s read.”",
      "author": "Josephine Harvey",
      "content": " Senate Majority Leader Mitch McConnell (R-Ky.) said he doesn’t recall any conversations with President Donald Trump about the Ukraine phone call ― contrary to the president’s claim that McConnell had said the call was completely “innocent.” “The president has said that you told him that his phone call with Ukrainian president was ‘perfect’ and ‘innocent,’” a reporter said to McConnell during a Capitol Hill press briefing Tuesday. “Do you believe that the president has handled this Ukrainian situation perfectly?” “We’ve not had any conversations on that subject,” McConnell responded. When asked if that indicated the president was lying about that claim, McConnell said “you’ll have to ask him. I don’t recall any conversations with the president about that phone call.” While speaking to reporters on the South Lawn on Oct. 3, Trump said that he and McConnell had spoken directly about the phone call, according to the official White House transcript of Trump’s remarks. “He put out a statement that said that was the most innocent phone call he’s read. And I spoke to him about it, too,” the president said. “He said, ‘That was the most innocent phone call that I’ve read.’ I mean, give me a break. Anybody that reads it says the same thing,” Trump added. McConnell had previously urged the White House to release the transcript of Trump’s July 25 phone call with Ukrainian President Volodymyr Zelenksy, according to two internal sources cited by The Washington Post. The call summary released by the White House was the catalyst for an impeachment inquiry looking at whether Trump withheld nearly $400 million in foreign aid to Ukraine unless Ukrainian officials investigated his potential 2020 presidential rival Joe Biden and his son Hunter Biden. It is illegal to solicit foreign involvement in U.S. elections, and investigations have yielded no evidence of wrongdoing by the Bidens.",
      "date": "10/22/2019 07:06 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell Contradicts Trump’s Ukraine Phone Call Claim",
      "url": "https://www.huffpost.com/entry/mitch-mcconnell-contradicts-trumps-ukraine-phone-call-claim_n_5db07cf7e4b0146fed6cdc14",
      "subtitle": "null",
      "author": "",
      "content": "",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Pallbearer Who Snubbed Mitch McConnell At Elijah Cummings’ Memorial Breaks Silence",
      "url": "https://www.huffpost.com/entry/pallbearer-snubbed-mitch-mcconnell-elijah-cummings-memorial-speaks_n_5db71a2be4b079eb95a7ac58",
      "subtitle": "Bobby Rankin told The Washington Post he refused to shake the Senate majority leader’s hand for personal reasons.",
      "author": "Amy Russo",
      "content": " A pallbearer at Rep. Elijah Cummings’ (D-Md.) memorial service at the Capitol last Thursday went viral for refusing to shake Senate Majority Leader Mitch McConnell’s (R-Ky.) hand. The defiant act instantly rocketed him to internet fame. Now, he’s speaking out about the snub. Bobby Rankin, Cummings’ close friend, told The Washington Post that he skipped over McConnell at the service as the senator waited with his hand extended because Rankin was reminded of his brother Jerry. Jerry served in the Marines and died of cancer last October after exposure to tainted water at Camp Lejeune in North Carolina. According to Rankin, Jerry never received the veterans benefits he had earned before his death. Rankin said he felt McConnell was partly to blame. “I could not put my hands in the man’s hand who refused to help somebody who served his country,” Rankin said in an interview with the Post, published Monday. “I couldn’t do it, because I was thinking about my brother.” Rankin said Cummings had “reached across party lines trying to help my brother get his military benefits” by contacting McConnell’s office. However, Rankin did not offer a clear explanation as to why Jerry didn’t receive the benefits or what role McConnell had in the matter, if any. McConnell’s office did not confirm to HuffPost whether the senator had worked on the issue, and has offered no details. A Twitter user filmed the snub while streaming Cummings’ service online, and her video has received more than 44,000 views. Cummings, the first Black lawmaker to lie in state at the Capitol, served as chair of the House Oversight Committee, one of three of the chamber’s panels helming an impeachment probe of President Donald Trump. The committee has also separately investigated potential power abuses by the Trump administration. Though Cummings received praise after his death for his ability to work with both parties, Trump called Cummings a “brutal bully” and labeled his Baltimore district a “rodent infested mess” in a racist Twitter rant over the summer. Cummings died at age 68 on Oct. 17 after facing “complications concerning longstanding health challenges,” his office said.",
      "date": "10/28/2019 03:28 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Anthony Scaramucci Predicts The Moment Mitch McConnell, GOP Senators Will Turn On Trump",
      "url": "https://www.huffpost.com/entry/anthony-scaramucci-senate-impeachment-support_n_5dc10fb0e4b03d0aacff4ba9",
      "subtitle": "The former White House communications director says one number will determine the president’s fate.",
      "author": "Ed Mazza",
      "content": " Anthony Scaramucci warned President Donald Trump that his Republican allies in the Senate may not be on his side for much longer. Scaramucci, who was fired after just 10 days as White House communications director in 2017, said on CNN that it comes down to numbers. Specifically, poll numbers. Scaramucci predicted that Senate Republicans would abandon Trump when support for impeachment and removal passed 60%. “Assuming that [Senate Majority Leader] Mitch McConnell has one more term left as a ‘senator,’ I don’t think he’s going to want to be in the minority,” Scaramucci said. “I think he will jettison President Trump the minute those differentials start to happen. And they are moving, they’ve moved 6 points in the last month.” That number will only rise as the impeachment process moves into public hearings. “And I think the bad news is yet to come for the president,” Scaramucci said. ”We’re just getting started.” That’ll lead to another swing in the numbers. “When this thing gets into the low 60s,” he said, whistling for emphasis, “these guys are gone.” Scaramucci remained a Trump defender for nearly a year after being ousted from the White House. But over the summer, he turned on his old boss and vowed to work against Trump’s reelection. See his full CNN interview below:",
      "date": "11/05/2019 04:44 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Critics Warn Trump, Mitch McConnell After ‘Blue Wave’ Victories: ‘You’re Next’",
      "url": "https://www.huffpost.com/entry/blue-wave-message-to-trump_n_5dc2643ee4b0f5dcf8fd36af",
      "subtitle": "“Blue Wave” trended on Twitter after Democrats made gains in the 2019 election.",
      "author": "Ed Mazza",
      "content": " Democrats flipped both houses of the Virginia legislature, made gains in statewide elections in the South, and may have even picked off a sitting Republican governor as Andy Beshear (D) declared victory over Gov. Matt Bevin in a close race in Kentucky. Earlier this week, President Donald Trump said the outcome of the Kentucky gubernatorial race would send a “big message” about himself. “If you lose, they’re gonna say ’Trump suffered the greatest defeat in the history of the world. This was the greatest,’” Trump said at a rally for Bevin. “You can’t let that happen to me!” Trump’s critics said there was another “big message” in the results, one about the 2020 election. They took to Twitter to celebrate gains for Democrats, especially in traditionally red areas, and to warn that Trump and his allies ― including Sen. Majority Leader Mitch McConnell (R-Ky.) ― could be facing uphill reelection battles next year:",
      "date": "11/06/2019 03:21 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Beating Mitch McConnell? Kentucky Democrats Have A Plan For That",
      "url": "https://www.huffpost.com/entry/mitch-mcconnell-senate-2020_n_5dc58831e4b00927b23220bc",
      "subtitle": "A surprise victory in last week’s governor’s race may kickstart a long, slow turn away from the GOP in the Bluegrass.",
      "author": "",
      "content": "HOPKINSVILLE, Kentucky — The confetti had barely hit the floor at Andy Beshear’s election night party on Tuesday when Democrats began proclaiming that his apparent defeat of unpopular GOP Gov. Matt Bevin should terrify Senate Majority Leader Mitch McConnell. “Mitch McConnell did not go to bed happy last night,” Kentucky state Senate Minority Leader Morgan McGarvey said of the top U.S. Senate Republican, who hopes to win a seventh term in Washington a year from now. “All I have to say is: Mitch, you’re next,” Amy McGrath, the retired Marine pilot who is running as a Democrat against McConnell, wrote in a fundraising email sent out just an hour after Beshear declared victory. Republicans in the state declared McConnell safe as he’s ever been. Kentucky voters hadn’t rejected the GOP, they insisted, but the “bad apple” in Bevin. The GOP won every other race on the ballot Tuesday night, even one for attorney general, an office no Republican has held since 1948. The dueling reactions in Kentucky mirrored the national mood. The Democratic Senate Campaign Committee saw it as proof that “Democrats are ready to compete everywhere and win tough races in 2020,” while Texas Sen. John Cornyn shrugged Beshear’s victory off as “unrelated to national politics.” Pundits on deadline saw the result as either a sign that McConnell should worry, or a total anomaly for a Democratic Party with no future in a deep red state. Both sides may be too sure of themselves. McConnell is deeply unpopular in the Bluegrass, just as Bevin was — the same poll that considered Bevin the least popular GOP governor in the nation ranks McConnell as the lowest-rated member of the Senate. But these days, the overwhelming majority of Senate races are won by the same party the state voted for in the last presidential election — Kentuckians chose Trump by 30 points in 2016, and will almost certainly vote for him again. No Senate majority leader, meanwhile, has lost a bid for reelection since 1952. And Kentucky has been trending steadily more Republican over the three decades of McConnell’s career — its last Democratic senator was reelected in 1992, and it hasn’t voted for a Democratic presidential candidate since 1996. Beshear’s victory also may not be as big of an anomaly as Republicans hope. The tone of conversations, both public and private, with Kentucky Democrats and activists changed after Tuesday: the nervy, almost forced optimism that barely masked a bleak outlook for the future found itself replaced by something close to real hope. While winning in Kentucky is still a long, uphill battle that requires nigh-perfect circumstances, they at least had proof of concept now. Beshear drew a map of Kentucky that, at least in the cities and suburbs, appeared similar to those of other states in the Trump era. And he did it all as an unapologetic Democrat. “This is the first time a modern Democrat beat a modern Republican in Kentucky,” said Dave Contarino, the executive director of Kentucky Family Values, a political action committee supported primarily by teachers and other labor unions. “This wasn’t some old-line, southern conservative Democrat. This was a pro-choice, pro-labor Democrat. I don’t want to overstate it, but it may suggest that we’re not as far off as some people think we are.” Democrats probably won’t win a Senate seat next year. But a high-profile Senate race could further rejuvenate a party trying to prove it’s still alive. ***** On the drive down Highway 68 near the Tennessee border, a hulking obelisk rises into the sunny sky to commemorate Jefferson Davis, the Confederate president who was born there in 1808. The monument went up a century later, during the Lost Cause years. It’s cast a shadow over Hopkinsville, one of the state’s Blackest cities, ever since. There’s a pretty strong conventional wisdom in Kentucky politics that for Democrats, beating McConnell or any other statewide candidate would require running up huge margins in Louisville, Lexington — and, as U.S. Rep John Yarmuth, a Louisville Democrat, told me this summer, “the few other pockets” of the state “where there are lots of Democrats.” “The people who’ve looked at it here have said, ‘A Democrat can win statewide, but it has to be a very surgical race,’” Yarmuth said. “And what they would say is, ‘You have to know exactly where your voters are, and you don’t waste any time on persuadables. You need to persuade the ones you know are going to vote for you [to] vote.’” Even knowing that, the party has struggled to get some of its most likely supporters to the polls, in part because they haven’t focused on them, and that’s especially true for voters in places like Hopkinsville, a city where 30 percent of the population is Black. Black voters in Hopkinsville have proven their power before. In 2016, organized efforts to turnout Black voters powered Democrat Jeff Taylor to victory in a special election that made him the area’s first-ever Black state representative. But Taylor lost in 2018 by roughly 400 votes, a margin that he said could have been swung had either Black voters or registered Democrats turned out in heavier numbers. The Black precincts in Hopkinsville, Taylor said, routinely rank among the lowest of all of Kentucky’s in terms of turnout, a problem that Taylor chalks up largely to apathy — and a lack of belief, among Black voters there, that the Democrats have anything to offer them. In West Louisville — where nearly three-quarters of the city’s Black population lives, and where turnout numbers are also typically lower than in other parts of the city — one activist told me that Democrats “only come here when it’s election time,” and that “none of them have addressed anything” on issues like gun violence, mass incarceration, or other issues at the forefront of Black voters’ minds. In 2015, when Democrats lost the governor’s mansion for just the second time since 1971, many of the Blackest precincts in west Louisville had turnout rates 10 points lower than the countywide rate. Neither the state nor national Democratic Party has “really invested in Black electoral work,” said Cassia Herron, the chairwoman of Kentuckians for the Commonwealth, a grassroots group that has more than 12,000 members across the state. “It always comes from somewhere else, if it comes at all.” Heron, who is Black, recounted a recent conversation with a middle-aged Black man from west Louisville about November’s governor’s race. “He’s a barber who runs his own business and has a college education, and he doesn’t vote. And he doesn’t plan to vote,” Herron said. “If we’re not investing in people like him, we’re missing a huge opportunity. They could move the electorate, but we’re just making the assumption that they’re going to vote Democratic.” Kentucky’s Black population is smaller than those in other southern states that have captured Democratic imaginations, but it’s still a powerful potential base. “When we show up to vote, the candidate we support wins,” Andre Carson, a Hopkinsville native who moved home three years ago and formed a group of local business leaders and residents to help bring more attention to the local Black community. “But we’ve got to see you after the election. We’ve got to see results,” Carson said. “[Black people] will come out and vote, but not in bunches for a guy they see once in three months, or if they don’t see results after the election.” That Kentucky Democrats haven’t shown up or put in the work necessary to turn out potential supporters isn’t a critique unique to Black voters — it’s a common description of the party’s problems across the commonwealth, where cities haven’t delivered the sort of margins they have for Democrats elsewhere, suburban counties haven’t trended in Democrats’ direction as quickly as they have nationally, and former Democratic strongholds have abandoned the party completely. During the governor’s race, the Beshear campaign, the Kentucky Democratic Party and the outside groups that supported them worked to change that. The KDP, under new chairman Ben Self, began rebuilding its infrastructure in 2017, after a bloodbath at the ballot box the year before nearly destroyed any hopes of a Democratic future in Kentucky, with the aim of building a “permanent campaign infrastructure” that would improve contact with voters, help more register to vote, drive them out once they did — and not immediately go away the minute a campaign cycle ended. Though they focused heavily on areas where Democrats had lost some standing, they also put an emphasis restating their case to base voters, too. Across the state, Beshear’s campaign and Democratic Party canvassers combined to knock on more than 1 million doors, and in parts of Louisville, Beshear’s campaign alone made as many as four canvassing passes. McGarvey, the Democratic senate leader, called it “the greatest get-out-the-vote effort I’ve ever seen” in the city, and Beshear replicated the strategy elsewhere, in the mountains of Appalachia, the northern suburbs of Cincinnati, and the farthest reaches of western Kentucky. Kentucky is also home to a number of grassroots organizations, new and old, that helped. Kentuckians for the Commonwealth, the grassroots group that has expanded across the state since it launched as an Appalachian-focused group 30 years ago, ran its own voter registration and canvassing drives. Teachers from KY 120 United, the group of 38,000 educators that sparked mass protests against Bevin last year, canvassed across the state; the Kentucky Education Association held events in nearly all 120 counties. Working America, the AFL-CIO’s campaign arm, said it knocked on more than 40,000 doors, talked to 13,500 voters and pushed its 114,000 members to vote through digital campaigns. For the first time in a long time, everyone from the state party to the campaign to the grassroots seemed to be on the same page. Black voters weren’t the only focus, but they were a big one — in Hopkinsville, Taylor credited Beshear’s efforts to reach out to Black residents and organizations. And, Kentucky Family Values, which backed Beshear, helped register more than 7,500 new voters in Louisville, where it focused its efforts on the western part of the city. (It also knocked on more than 300,000 doors and made a half-million phone calls.) Beshear also pledged to restore voting rights to 140,000 thousand ex-felons, a priority for civil rights groups in Kentucky, one of just three states that permanently bans them from voting. That policy has disenfranchised nearly one of every 11 voters in the state and had an especially large impact on Black adults ― 26 percent of whom are ineligible to vote, the highest rate in the nation. It didn’t always work. Beshear’s margin in Christian County, where Hopkinsville is located, was barely better than Democrats had achieved four years ago. But in other places, the impact was evident, even if demographic and precinct turnout data isn’t yet available — and weeks before the election, yard signs supporting Beshear, or at least opposing Bevin, were prominently displayed across the city’s West End. Turnout in the big cities dwarfed expectations, and boosted Beshear, who ran up a margin of nearly 135,000 votes in Lexington and Louisville alone — a huge performance relative to what Democrats have achieved there in recent election cycles. And with the help of state Rep. Rocky Adkins, a mountain populist who finished second to Beshear in the primary and campaigned alongside him during the general, Beshear won parts of Appalachia that some Democrats thought were gone for good. ***** If success in gubernatorial contests translated directly to victories in Senate races, McConnell never would’ve made it to Washington. Democrats have now won 11 of the past 13 governor’s races, but they’ve lost eight consecutive Senate races since 1992, and haven’t come within 100,000 votes of McConnell since 1990. It’s understandable that Republicans are skeptical that any of what Beshear built or accomplished in 2019 will affect 2020. But Democrats and their allies outside the party swear its replicable — in September, Self told me over coffee in his Frankfort office that the party’s aim was to roll staff, data and infrastructure straight from the governor’s race into the battle with McConnell. Some parts of Beshear’s map — especially the swaths of blue in southern Appalachia — may not translate to a federal race when Trump, who remains popular in Kentucky, replaces Bevin on top of the ballot. But Democrats hope that some of it will. Beshear won two northern Kentucky counties, just outside Cincinnati, plus Warren County in the west and Scott County just north of Lexington — four well-populated areas that have been solid red for decades but all look like the type of suburbs that have been trending away from the GOP and toward Democrats throughout the Trump era. The suburban east end of Louisville, which Republicans used to count on, has now delivered huge victories for Democrats in both 2018 and 2019. Bevin’s late-stage attempts to tie himself to Trump may have been a costly mistake. “The nationalizing of the campaign cost [Bevin] in the suburbs,” Contarino, the executive director of Kentucky Family Values, said. “And McConnell has a similar problem.” Warren County may not be a fluke. In 2018, Western Kentucky University history professor Patti Minter won a state House race there, and though Democrats have held her district for four decades, she ran an energetic campaign that supported LGBTQ rights, swore off corporate campaign donations, and never apologized for its outward progressivism. Some Democrats feared she’d cost them the seat; instead, she won by seven points. For the last three years, Democrats and their allies in Kentucky have been drawing lessons primarily from losses. But Minter’s win, followed by Beshear’s, in a county Democrats once couldn’t fathom would go their way generated hope that they can replicate the success, especially given that Trump isn’t as popular in Kentucky as he once was: Trump’s net approval rating, according to Morning Consult, has dropped 23 points in Kentucky since the beginning of his administration, from plus-34 to just plus-11. Nearly half of Kentuckians said they disapproved of the president in October. Heading into 2020, the dynamics in Kentucky still favor McConnell, barring a massive and unexpected change. And they’ll probably benefit Republicans in the state for at least another decade, said Scott Lasley, a Western Kentucky University political scientist and district vice chairman in the state GOP. Republicans hold supermajorities in both state legislative chambers, and Lasley’s guess is that it could take 30 years for Democrats to regain control of either. That’s not just GOP sentiment: “We can get it back,” Jeff Taylor, the former lawmaker from Hopkinsville, said of the state legislature, sounding as if he was trying to convince himself more than me. “But this is not happening overnight. It’s going to be a long time.” That sort of shift has happened before. Just ask McConnell, who has spent his 35 years in the Senate slowly and steadily building the Kentucky GOP into the machine it is today. “When I first started coming to western Kentucky frequently, the ratio in this state was two-and-a-half to one in favor of registered Democrats. Now it’s about 1.3 to 1 Democrat,” McConnell recounted at an event this spring. “Back then,” he continued, “there wasn’t one solitary [GOP] state senator or representative” in far western Kentucky. “Today, there is not a single Democratic state representative or state senator in that area. We’ve come a long way together. A long way.” McConnell’s long Bluegrass slog is proof that Democrats’ fight against the state party he has built will take more than one election to complete ― as Self, the party chairman, put it, Democrats are “looking not just toward the next election, but toward the next 20 years.” The race against McConnell will bring tens of millions of dollars into Kentucky — the national desire among progressive small dollar donors and the Democratic Party to knock off the country’s most unpopular Senator means McGrath or any other candidate could raise $50 million or more, especially if the race proves competitive. The cash and enthusiasm that comes with a high-profile Senate race could be vital to Kentucky Democrats’ efforts to restructure their party and start winning legislative seats again, as down-ballot candidates draft off the hope, energy and resources of the big-time Senate race — just as Beto O’Rourke’s 2018 Senate campaign did in Texas, where Democrats now have a chance to seize majority control of the state legislature. “We need to take every cent that comes here for the McConnell race, and use it to build up the grassroots,” one Kentucky Dem told me. “We need to use it to elect state legislative and city council candidates, and let that filter up to Amy McGrath. And if she wins, great.” That’s not just a big priority for the party, but to many of the activists who have helped boost it from the outside: “We still have a few scores to settle,” Nema Brewer, the public school employee behind the group that organized Kentucky’s teacher protests and turned educators into a powerful political force, said Wednesday of the teachers’ plans for future electoral work. As the teachers pushed back against GOP legislators who forced through the pension reform and school budget cuts that enraged educators and organized workers, “there were a few folks who were really ugly to us,” Brewer said. “And we’ve got a long memory.” ***** In early September, as I traversed Kentucky in search of any sign of a progressive pulse, I visited Minter in Bowling Green, where the Western Kentucky University history teacher has attempted to push her city — and by extension her state — forward on LGBTQ rights. Since 2013, Minter has gathered activists in Room 207 of Cherry Hall, the campus building where she teaches, for monthly meetings aimed at persuading the Bowling Green city council to pass a fairness ordinance — the name in Kentucky for an official measure to protect LGBTQ people from discrimination. The dozen activists in attendance were in the final planning stages, that night, for Bowling Green’s third annual Pride festival. But their attention was also focused across the state on Georgetown, a suburb of Lexington in Scott County, which had long supported Republicans but where the city council was voting on a fairness ordinance. The ordinance had been a top priority for organizers in Georgetown, I learned a few days earlier at a similar meeting there, after the city council voted it down by a single vote two years prior. They had spent the time since trying to persuade local residents and legislators to reconsider. Not so long ago, LGBTQ issues were untouchable for Democrats in Kentucky — in 2015, many Democrats thought that the national furor over Rowan County clerk Kim Davis’ refusal to sign same-sex marriage licenses had helped drive Republicans to the polls and elect Bevin governor. But now Georgetown was on the cusp of becoming the 10th Kentucky city to pass a fairness ordinance in the last five years; Democrats and LGBTQ activists had rallied, in 2018, to defeat Davis in her bid for reelection. Minter, meanwhile, had won election to her state house seat in Bowling Green — the seat of traditionally red Warren County — in 2018 just three weeks after marching with drag queens. Even in this deep red state where Democrats had lost almost everything, there were pockets where the fight to loosen the GOP’s grip on the Bluegrass was long underway. Minter’s foot tapped nervously on the hard tile floors of the empty hallway as she described how she won — recruited into the race by a new group that trains women to run for office, doubted by consultants, sure the whole time that Bowling Green “wasn’t as conservative” as everyone else claimed. Then a cheer went up in Room 207, and Minter turned and bolted back to the doorway. “Did we just win?” she shouted into the room. “We won!” Two months later, Rowan, Scott and Warren counties all voted for Andy Beshear. This piece has been updated with final voter contact numbers from Working America. CORRECTION: An earlier version of this article said Kentucky last elected a Democratic senator in 1988. However, Sen. Wendell Ford (D) was reelected in 1992, meaning Democrats have lost eight consecutive Senate races since then.",
      "date": "11/11/2019 05:45 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Kentucky’s Youngest Black State Lawmaker Wants To Challenge Mitch McConnell",
      "url": "https://www.huffpost.com/entry/charles-booker-mitch-mcconnell-kentucky-senate_n_5dc95c22e4b02bf579437897",
      "subtitle": "State Rep. Charles Booker, who backs Medicare for All and a Green New Deal, would join a busy Democratic primary field.",
      "author": "Travis Waldron",
      "content": " Kentucky state Rep. Charles Booker (D), who in 2018 became the state’s youngest Black elected lawmaker in nearly a century, announced Monday that he would test the waters for a 2020 campaign against U.S. Senate Majority Leader Mitch McConnell (R). Booker, whose legislative district spans Louisville, has been considering a run against McConnell for months. His decision to launch an exploratory committee comes just a week after the state’s Democratic attorney general, Andy Beshear, upset unpopular Republican Gov. Matt Bevin in a heated gubernatorial contest ― a win that has given Kentucky Democrats hope that they have a shot at ousting McConnell a year from now. Booker opened his electoral effort with a broadside against McConnell, who has been in the Senate since 1985 and is seeking a seventh term in 2020. (The Democratic lawmaker was born a month before McConnell won that first Senate election.) “You know the name of the man I’m talking about, but he doesn’t know your name,” Booker said of McConnell in a two-minute video that accompanied Monday’s announcement. “He doesn’t see you in the hospital bed, or in the checkout line, or at the safety drills in your classroom. He doesn’t see you at all.” Booker argued that Kentucky hasn’t benefited from the power McConnell has accrued over three-plus decades in Washington. “Since we sent Mitch McConnell to Washington, he’s become one of the richest politicians in America ― but Kentucky has been left behind,” Booker said in his Monday release. “The more power Mitch McConnell has gained in DC, the more we’ve lost here at home.” If he ultimately does run, Booker could become the first Black candidate to win a major party’s Senate nomination in Kentucky’s history. If he won the general election, he would be the first Black Democrat to win a statewide election in Kentucky. (Attorney General-elect Daniel Cameron (R) last week became the first Black candidate to win a statewide election independently in Kentucky. The first Black candidate to win any statewide election there was Lt. Gov. Jenean Hampton, who ran on the ticket with Bevin in 2015.) Booker would join a Democratic primary field headlined by former Lt. Col. Amy McGrath, the onetime Marine pilot who announced a run against McConnell in July. In Monday’s release, Booker painted himself as a progressive voice who could offer a new vision for Kentucky and pledged that his campaign would mark the launch of a “bold, unapologetic populist movement” in the Bluegrass State. The would-be candidate, who was raised in Louisville’s predominantly Black west end, said his experience growing up in poverty, acquiring student loan debt to graduate from college, and paying more than $1,000 a month for insulin as a diabetic has given him first-hand experience with some of the biggest issues facing voters. He would run on a platform that supports a Green New Deal to address climate change, a “Medicare for All” health care plan (a key issue in the Democratic presidential primary), poverty reduction, and support for workers and organized labor. “This isn’t the start of a campaign,” Booker said. “This is the beginning of a movement. A movement of the people taking on the powerful. A movement of Kentuckians whose voices haven’t been heard.” He is positioning himself as the Bluegrass version of the progressive insurgents who have filed to run in other key Senate races in Colorado, North Carolina and Texas. McGrath, who narrowly lost a congressional race against Rep. Andy Barr (R) in a central Kentucky swing district last year, was recruited into the race by the Democratic Senatorial Campaign Committee. Her campaign launch via a viral ad generated enthusiasm among national Democrats and progressives eager to take out McConnell; multiple Senate Democrats tweeted their support. And after proving herself a capable fundraiser in 2018, she is once again hauling in cash: McGrath raised nearly $11 million in the third quarter of this year, a record total for a Kentucky Senate candidate. But McGrath stumbled in the early days of her campaign when she appeared to cozy up to supporters of President Donald Trump and said she would have voted in favor of Brett Kavanaugh’s confirmation to the Supreme Court (a position she later changed). In Kentucky, her rocky start generated calls for potential primary opponents to jump into the race. Matt Jones, the host of a popular statewide sports radio show, is also considering a run against McConnell. Last week he suggested that the Kentucky GOP’s decision to file a complaint with the Federal Election Commission that led to his removal from the air may help push him into the race. This fall, Booker appeared alongside striking coal miners at the Blackjewel mine in Harlan, where employees fought for their final paychecks after the company suddenly went bankrupt. And in September, he appeared at a Youth Climate Strike event in Louisville. In the Kentucky state House, where the GOP holds a supermajority, Booker has sponsored legislation to automatically restore voting rights to felons who have completed their sentences, which is a priority of the incoming Beshear administration. Booker has also challenged Republican efforts to further restrict abortion rights in the state. During one abortion debate in 2018, a white GOP lawmaker told Booker to “sit down” as he spoke on the floor, an incident that Booker later suggested was fueled by racism and discrimination.",
      "date": "11/11/2019 02:16 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Even Mitch McConnell Is Telling Kentucky’s GOP Governor To Get Over His Election Loss",
      "url": "https://www.huffpost.com/entry/mitch-mcconnell-matt-bevin_n_5dca45f9e4b02bf579456736",
      "subtitle": "“Barring some dramatic reversal on the recanvass, we’ll have a different governor in three weeks,” the Senate majority leader said.",
      "author": "Nick Visser",
      "content": " Senate Majority Leader Mitch McConnell (R-Ky.) said Monday he was “sorry” the governor of his home state lost his reelection bid to a Democrat last week, but suggested it was time to move on and accept the results. Kentucky Gov. Matt Bevin (R) appears to have lost the election to Democrat Andy Beshear by a mere 5,000 ballots, but he has so far refused to concede. Instead, Bevin has demanded a recanvass of the votes, citing vague voting “irregularities” without evidence. McConnell didn’t seem to be having it during an event on Monday, saying Bevin had a “good four years,” but the election result was unlikely to change. “Barring some dramatic reversal on the re-canvass, we’ll have a different governor in three weeks,” the Senate leader told reporters, per The Associated Press. “My first election was almost the same number of votes that Beshear won by. We had a recanvass, added them up, it didn’t change and we all moved on.” The recanvass Bevin requested is scheduled for Thursday. Beshear has declared victory in the race, which could have dramatic implications for the state ranging from voting rights to public education. His inauguration is scheduled for Dec. 10. McConnell refused to say Monday if he was concerned about the blue wave that led to Bevin’s poor showing, simply saying “we’ll find out.” Democrats have already begun planning their campaign to unseat McConnell, who is up for reelection next year. “All I have to say is: Mitch, you’re next,” Amy McGrath, a retired Marine pilot who is running to unseat him, said in a fundraising email just hours after Beshear declared victory.",
      "date": "11/12/2019 05:17 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Dan Rather Accuses Mitch McConnell Of Being Part Of Donald Trump ‘Cult’",
      "url": "https://www.huffpost.com/entry/dan-rather-trump-cult-cnn-mcconnell_n_5dd1c6ede4b01f982f042034",
      "subtitle": "“Cults generally don’t end well,” Rather warned on CNN.",
      "author": "Mary Papenfuss",
      "content": " Legendary newsman Dan Rather on Sunday accused Senate Majority Leader Mitch McConnell (R-Ky.) of being part of the troubling “cult” of President Donald Trump. “Increasingly, President Trump’s support seems cultish,” Rather told Brian Stelter on CNN’s “Reliable Sources,” noting: “I’m not the only one making this observation.” It’s “all about him, it’s not about the policy, it’s not about the standards of politics,” he explained. “Cults generally don’t end well,” he said, echoing a tweet he posted Friday. Asked by Stelter if he considered McConnell part of the cult, Rather said: “The short answer is yes.” Rather said the question lawmakers have to decide for impeachment is if Trump tried to “bribe” a foreign government with military aid to investigate a political rival, and if he tried to “intimidate witnesses.” He added: “I’d say history is closing in on him, facts are closing in” on Trump. But Rather said he doubts the Senate will hold a “real” impeachment trial. The cult concept appears to part a growing narrative about the president’s pull on the Republican Party and his supporters. Sources told Vanity Fair for an article last week that conservative attorney George Conway, husband of White House counselor Kellyanne Conway, has complained that his wife is part of the Trump “cult.” Check out Rather’s comments in the video above.",
      "date": "11/17/2019 06:21 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "The Day Impeachment Threatens McConnell’s Senate Job Is The Day Trump Is In Big Trouble",
      "url": "https://www.huffpost.com/entry/trump-mcconnell-impeachment_n_5dd4728ae4b0fc53f20a672e",
      "subtitle": "The Senate majority leader is likely to abandon the president if it appears that keeping his role is more assured if Trump is gone.",
      "author": "S.V. Date",
      "content": " WASHINGTON — Is Mitch McConnell’s future as Senate majority leader in 2021 more assured with President Donald Trump at the top of the 2020 Republican ticket? Or with a President Mike Pence? Because while the president’s staff is focused on the ongoing impeachment proceedings in the House regarding his attempts to coerce Ukraine into helping his reelection efforts, Trump’s ultimate fate is more likely to hinge on the calculations of a single lawmaker from the other chamber, Kentucky’s McConnell. And although McConnell would certainly rather keep his control over the Senate and have a Republican in the White House, a number of Republicans predicted that, if Trump’s standing among voters were to fall even further, McConnell would choose his own political future over Trump’s. “I’m sure he’d prefer both. But, if he has to choose, yes, the Senate is his higher priority,” said one former top GOP congressional aide, who spoke on condition of anonymity to candidly assess McConnell. The former aide could not predict how low that approval rating would have to drop. “That’s the $64,000 question.” On Tuesday, as additional witnesses testified about Trump’s efforts to use $391 million in military aid as leverage to force Ukraine to announce politically useful investigations, McConnell told reporters: “It’s inconceivable to me that there will be 67 votes to remove the president from office.” The Constitution requires a two-thirds vote of those present to remove a president who has been impeached by the House. If all 47 Democrats were to vote that way, it would require 20 Republicans to vote with them for Trump to be forced out. “I think most Republicans are going to fall on a spectrum ranging from no big deal to moderately alarmed to believing this was very bad judgment ― but that it doesn’t rise to the level of impeachment,” said Scott Jennings, a GOP consultant in Kentucky and a former McConnell campaign aide. “I think the White House will need to give Republicans the latitude to express those varying opinions as long as they hold the line against votes to convict.” But Trump’s problem is that while he is feared by Republican senators — and likely less so now than he has been, given recent GOP losses in Kentucky and Louisiana governors’ races, despite his campaign visits — he is not particularly respected or liked. Former GOP Sen. Jeff Flake of Arizona said that if the Senate were to hold a secret ballot to convict Trump, “at least 35” Republicans would vote to do so. Which means that Republican senators’ loyalty to Trump likely goes no further than to the extent it benefits them politically — and they could well abandon him if it appears that doing so is more likely to ensure their own reelections. In the case of McConnell, the limits of his loyalty are more likely to be linked to the fates of the half dozen or so of his most vulnerable Republican members in the coming 2020 election. With that current 53-47 majority, if just four Republicans lose reelection, McConnell would no longer be majority leader — a title he has sought for decades. Meaning Trump’s fate will be less tied to his polling in safe, Trump-friendly states than to his approval numbers in places like Colorado, Maine, North Carolina and Arizona, where GOP senators are all facing challenging races. “If Trump is not removed, all those senators lose,” said William Weld, a former Massachusetts governor and a Reagan-era Justice Department official who is now running against Trump for the 2020 GOP nomination. He recalled the aftermath of the 1986 elections, when Republicans lost the Senate. “It’s such a feeling of powerlessness, and it’s one that Mitch has had in the past, and he doesn’t want to have it back,” he said. Former Illinois congressman Joe Walsh, who is also running for the 2020 GOP presidential nomination, said McConnell’s primary goal will be to keep Republican control of the Senate. “Everything else is a distant second to that,” he said. “They will dump Trump in a nanosecond if it helps the GOP retain the Senate. And remember, none of the Senate Republicans like or fear Trump. They fear his voters.” Rick Tyler, a Republican political consultant who worked for Texas Sen. Ted Cruz in the 2016 GOP primaries, said McConnell understands that the party is better off without Trump heading into the 2020 election. “McConnell will shrewdly play Trump’s game until a clear majority of voters in enough states that Republican senators need to hold to keep control turn on Trump,” Tyler said. “At that point, he will dump Trump.” Trump is facing an impeachment inquiry in the House after a whistleblower filed a complaint that the president was withholding congressionally approved military aid to Ukraine unless its leaders announced investigations politically useful to Trump’s 2020 reelection. According to witness testimony as well as the rough transcript of Trump’s July 25 phone call with Ukraine’s president, Trump demanded that Ukraine investigate former Vice President Joe Biden as well as support a conspiracy theory which falsely claims that Russian intelligence agencies did not help Trump win the 2016 election, but rather it was Ukrainian officials who framed Russia by using fake evidence. He made the military aid contingent on Ukraine publicly announcing the probes but then backed down after the White House learned that the whistleblower’s complaint on the matter was about to reach Congress. John Ryder, a former Republican National Committee member from Tennessee, said few people outside of Washington, D.C., are paying much attention to the impeachment hearings. He said Republicans in particular are wary of the new effort because of the long-running investigation into Trump’s relationship with Russia, which did not result in articles of impeachment or a prosecution of the president. “They’re suffering a little bit of ‘boy who cried wolf’ syndrome,” he said, adding that Trump’s approval ratings, after dipping a few points when House Speaker Nancy Pelosi announced the start of the impeachment inquiry, are back to the low 40s. He said that if the percentage of people approving of Trump starts falling to the low 30s, senators who currently back Trump will start to rethink that position. “If you move public opinion, you start to move senators,” he said. Igor Bobic contributed to this report.",
      "date": "11/19/2019 07:09 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell’s Inaction Gets A ‘Super’ Skewering By Mad Magazine",
      "url": "https://www.huffpost.com/entry/mitch-mcconnell-mad-magazine_n_5dd57286e4b010f3f1d15c15",
      "subtitle": "The humor magazine’s editors call the Senate majority leader “The Man of Stall” and say he is “able to block democracy in a single bound.”",
      "author": "David Moye",
      "content": " Mitch McConnell is getting a super-skewering from Mad magazine. The venerable humor publication will be releasing its annual year-end issue, featuring the “20 Dumbest People, Events and Things of 2019,” in the coming weeks and the Senate Majority Leader definitely qualified, according to editors. As this sneak peek shows, McConnell has a unique super power: being “able to block democracy in a single bound.” The year-end issue marks a new stage in Mad’s nearly 70-year history. Earlier this year, the magazine announced it will no longer publish new content monthly. However, a Mad spokesperson tells HuffPost that the publication is continuing on a bimonthly basis and all 2020 issues will include some new content. The new issue will be available to digital subscribers on Dec. 18. This has been updated with additional information from Mad magazine about the publication’s publishing plans.",
      "date": "11/20/2019 05:05 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    }
  ]
}