{
  "articles": [
    {
      "title": "Angela Merkel on Trump tweets: 'This is something that contradicts the strength of America'",
      "url": "https://www.usatoday.com/story/news/politics/2019/07/19/angela-merkel-trump-tweets-stand-solidarity-squad/1780005001/",
      "subtitle": "Angela Merkel on Trump tweets: 'This is something that contradicts the strength of America'",
      "author": "Rebecca Morin",
      "content": " WASHINGTON – German Chancellor Angela Merkel on Friday criticized President Donald Trump's \"go back\" tweets about four Democratic congresswomen of color, saying that the president's tweets contradict \"the strength of America.\" “People of very different nationalities have contributed to the strength of the American people, so these are … comments that very much run counter to this firm impression that I have,” Merkel said during an annual news conference in Berlin. “This is something that contradicts the strength of America.” \"I distance myself firmly from this and feel solidarity with the women who were attacked,\" she continued. Merkel is the second western leader in a day to speak out about the controversy sparked by Trump's remarks this week. On Thursday, Canadian Prime Minister Justin Trudeau called the \"send her back\" chants that broke out at a Trump rally \"completely unacceptable.\" More:Trudeau slams 'send her back' chant at Trump rally Throughout the week Trump has repeatedly blasted Reps. Alexandria Ocasio-Cortez, D-N.Y.,  Ayanna Pressley, D-Mass., Rashida Tlaib, D-Mich., and Ilhan Omar, D-Minn. The four lawmakers, who have become colloquially known as \"The Squad,\" are all American citizens. Omar immigrated from Somalia to the United States and is a naturalized U.S. citizen. The other three congresswomen were born in the U.S. Since then, the four congresswomen have come out against Trump's remarks, calling them \"racist.\" The House on Tuesday formally voted to condemn Trump's tweets as racist. During a Wednesday night rally, chants of \"send her back\" broke out as Trump criticized Omar. The president went on to slam the other three members of The Squad.  The chanting has been criticized by Democrats and some Republicans. More:What we know about the 'send her back' chants that erupted at Trump's North Carolina rally More:Trump employs familiar tactic in attacks on 'Squad': Distract and shift spotlight using racial rhetoric More:Supporters chant 'Welcome home, Ilhan' as Rep. Ilhan Omar receives thunderous Minnesota welcome Trump had initially distanced himself from the chant at his North Carolina rally on Thursday. But Friday after Merkel's remarks, Trump continued to attack The Squad, in particular, Omar. When asked about being unhappy about the chant, Trump said: \"No, you know what I’m unhappy with? The fact that a congresswoman can hate our country.\" The president and Merkel have had a tense relationship throughout Trump's tenure as president. Most recently, at Wednesday's rally Triump also referenced Merkel during his speech, saying that he had to badger her into paying her country's bills. The president has frequently complained about the amount of defense costs in Europe that the U.S. is shouldering, especially in regard to NATO. “There was a recent poll — Germany likes Obama better than Trump. A lot better. I said of course, because I’m making them pay their bills,\" Trump said. “I’m saying you got to pay. I say, ‘Angela, Angela, you’ve got to pay, Angela!’ Obama would go in, make a speech, leave. \"I go in, make a speech, I say, ‘Let me speak to Angela. Angela you’ve got to pay your bills, you’re way behind,\" he concluded. Contributing: Associated Press Like what you’re reading?:Download the USA TODAY app for more",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Illinois GOP group apologizes for offensive 'Jihad Squad' post about AOC, Omar, Tlaib and Pressley",
      "url": "https://www.usatoday.com/story/news/politics/2019/07/22/jihad-squad-illinois-republican-group/1792966001/",
      "subtitle": "Illinois GOP group apologizes for offensive 'Jihad Squad' post about AOC, Omar, Tlaib and Pressley",
      "author": "William Cummings",
      "content": " WASHINGTON – A movie poster mockup depicting Democratic Reps. Alexandria Ocasio-Cortez, Ilhan Omar, Ayanna Pressley and Rashida Tlaib as \"The Jihad Squad\" was shared on the Facebook page for a group of state Republican leaders last week before being taken down days later. The meme shared by the Illinois Republican County Chairman's Association depicts Omar with pursed lips and a shotgun, while Pressley is seen pointing a pistol with a grin. Tlaib is shown screaming in anger and Ocasio-Cortez is at center in a slinky red dress that tapers down to a ball of flames. \"Political Jihad is their game. If you don't agree with their socialist ideology, you're racist,\" reads the satirical tagline about the four congresswomen, who are often referred \"the Squad.\" The poster includes an image of the group's logo with its url beneath. The image is modified from the poster for the 2013 film \"Gangster Squad.\" Chicago Tribune reporter Rick Pearson shared the image on Twitter on Sunday afternoon. Hours later, the group's president, Mark Shaw, said it had been removed. \"A couple of days ago, an image which was not authorized by me was posted on the Facebook page of the Illinois Republican County Chairmen’s Association (“RCCA”). I condemn this unauthorized posting and it has been deleted. I am sorry if anyone who saw the image was offended by the contents,\" Shaw said in a statement. Shaw called the \"unauthorized\" post an \"unfortunate distraction from the serious debate surrounding the policies advocated by these four socialist members of the United States House of Representatives.\" \"Republican opposition to their proposed 'Green New Deal', elimination of all private health insurance, open borders and anti-Semitic posturing has nothing to do with these Representative’s races or religion,\" he said. Shaw said his group was conducting an internal review of its approval process for social media posts to make sure \"that any content posted in the future represents the 'big-tent' nature of the Republican Party.\" From 'Central Park Five' to 'the Squad':A dozen times Donald Trump has stoked racial tensions Fox News host Chris Wallace:'No question' Trump is 'stoking racial divisions' Tim Schneider, the chairman of the Illinois Republican Party said in a statement that he condemns \"evoking race or religion as the basis for political disagreement.\" \"Bigoted rhetoric greatly distracts from legitimate and important policy debates and further divides our nation,\" Schneider said. \"My intense disagreement with the socialist policies and anti-semitic language of these four congresswomen has absolutely nothing to do with their race or religion.\" Ocasio-Cortez, Omar, Pressley and Tlaib have been the target of verbal and Twitter attacks from President Donald Trump in the past week. His tweets telling the four women – all of them U.S. citizens and three of them born in the USA – to \"go back\" and fix their countries of origin before legislating in the U.S. led to a House resolution condemning the remarks as racist. And his rhetoric was seen as spurring a crowd to chant \"send her back\" when he tore into Omar at a rally in North Carolina on Wednesday. Michigan's Tlaib and Minnesota's Omar are the first Muslim women ever elected to Congress. Ocasio-Cortez of New York is the youngest women ever elected Congress and a self-described democratic socialist. Pressley is the first African-American woman elected to Congress from Massachusetts. Trump has denied his rhetoric intentionally played into old racist tropes about sending non-white Americans \"back where they came from.\" He said he meant that, based on their criticisms, they \"hate our country\" and \"If they don’t like it, let them leave.\" As evidence of their lack of patriotism, Trump and other administration officials – including Vice President Mike Pence – have pointed to comments from Omar that were condemned as anti-Semitic and Ocasio-Cortez's comparison of migrant detention facilities to concentration camps. But they have also falsely attributed other comments to the congresswomen or taken remarks out of context. Critics have also pointed out dissent is a normal part of political debate, that their criticism is about policy rather than country, and that Trump himself made similarly critical remarks about the U.S. during the Obama administration.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Pelosi after quarrels with AOC, Tlaib: 'You got a complaint? You come and talk to me about it'",
      "url": "https://www.usatoday.com/story/news/politics/2019/07/10/pelosi-after-feud-ocasio-cortez-talk-me-not-twitter/1693923001/",
      "subtitle": "Pelosi after quarrels with AOC, Tlaib: 'You got a complaint? You come and talk to me about it'",
      "author": "Christal Hayes",
      "content": " WASHINGTON – House Speaker Nancy Pelosi had a clear message for fellow Democrats Wednesday morning after party infighting with some of Congress' most popular new members, including Rep. Alexandria Ocasio-Cortez, spilled into public view and on Twitter. At their weekly breakfast, Pelosi told members of the Democratic caucus that they were a family and have to stick together, while also suggesting they keep their differences private. \"You got a complaint? You come and talk to me about it,\" Pelosi told the group, according to a source in the room. \"But do not tweet about our members and expect us to think that that is just OK.\" Pelosi's comments came in the aftermath of bitter party in-fighting with some of the most outspoken progressive members of her caucus: Reps. Ocasio-Cortez, D-N.Y.; Ilhan Omar, D-Minn.; Ayanna Pressley, D-Mass.; and Rashida Tlaib, D-Mich. Pelosi's quarrel with the four new freshman members, who each boast large followings on social media, reached a boiling point last month over sending emergency money to border agencies running migrant detention centers. 'Children come first':House passes $4.6 billion in aid for migrants at border after Pelosi caves to Republicans More:Alexandria Ocasio-Cortez, Ilhan Omar and Rashida Tlaib fire back at Nancy Pelosi's 'Twitter world' quip The feud went public, with Pelosi dismissing the four lawmakers in an interview with the New York Times and criticizing them for being the only members to vote against the original version of the spending bill. \"All these people have their public whatever and their Twitter world,\" Pelosi said, according to Maureen Dowd's column in the Times. \"But they didn’t have any following. They’re four people and that’s how many votes they got.\" The lawmakers quickly shot back. \"That public 'whatever' is called public sentiment,\" Ocasio-Cortez wrote on Twitter. \"And wielding the power to shift it is how we actually achieve meaningful change in this country.\" In her speech during the weekly morning breakfast on Wednesday, Pelosi seemed to call for peace. She said the fighting was playing \"into the hands\" of Republicans who want to see divisions. More:AOC criticizes CBP after report of secret Facebook group as agency opens investigation \"On a team you play as a team. If you want to be not on the team, that is OK because that is part of the team spirit – you just want to not play in that round,\" Pelosi said. She added, \"I hope there will be some level of respect and sensitivity for our – each individual experience that we bring to this caucus.\" She highlighted that the majority of members voted for the border aid bill late last month, sending $4.6 billion to facilities along the southern border. She said it was fine that she was the target of scrutiny after the House reluctantly passed a Senate version of the bill instead of pushing even further for added restrictions that Democrats said would mandate better care for migrants and children housed in the facilities. The House version of the funding bill with the restrictions was rejected by the Republican-led Senate. \"I take responsibility,\" Pelosi said, according to the source. \"You make me the target, but don’t make our Blue Dogs and our new Dems the target in all of this because we have important fish to fry.\" Contributing: William Cummings",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Donald Trump defends rally crowd that chanted 'send her back,' calling them 'incredible patriots'",
      "url": "https://www.usatoday.com/story/news/politics/2019/07/19/donald-trump-defends-rally-crowd-patriots-despite-chants/1781499001/",
      "subtitle": "Donald Trump defends rally crowd that chanted 'send her back,' calling them 'incredible patriots'",
      "author": "David Jackson",
      "content": " WASHINGTON – President Donald Trump Friday defended the crowd at his North Carolina campaign rally who days earlier chanted taunts of \"send her back\" against Somali-born lawmaker Ilhan Omar. Trump described the supporters at the Greenville, N.C. rally on Wednesday as \"incredible people\" and \"incredible patriots,\" a day after he disavowed the chants that were criticized by Democrats and Republicans alike. Trump has attacked Omar in recent days along with Reps. Alexandria Ocasio-Cortez of New York, Ayanna Pressley of Massachusetts and Rashida Tlaib of Michigan. The four freshman lawmakers – all women of color – are known as the \"Squad.\" The chant at the North Carolina rally echoed a tweet Trump posted on Sunday in which he said Omar and the three other members of the Squad should \"go back and help fix the totally broken and crime infested places from which they came.\" Distract:Trump employs familiar tactic in attacks on 'Squad': Distract and shift spotlight using racial rhetoric Trump said this week that he tried to stop the chant but video of the rally shows he stepped back from the lectern and allowed the crowd to continue the refrain nearly a dozen times. Omar is a naturalized U.S. citizen who arrived in the United States as a refugee at age 12. Ocasio-Cortez, Pressley and Tlaib were all born in the United States and are U.S. citizens. In his Friday comments, Trump said Omar was \"lucky to be where she is.\" He described the North Carolina stadium as \"packed\" and added that he could have filled it even more with \"10 times\" as many supporters. Trump spoke on the issue while taking questions following an Oval Office ceremony to mark the 50th anniversary of the Apollo 11 moon landing.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "AOC, Kellyanne Conway trade blows over the treatment of migrants in detention",
      "url": "https://www.usatoday.com/story/news/politics/2019/07/02/aoc-kellyanne-conway-trade-blows-over-migrant-detention-conditions/1630530001/",
      "subtitle": "AOC, Kellyanne Conway trade blows over the treatment of migrants in detention",
      "author": "Nicholas Wu",
      "content": " WASHINGTON – Rep. Alexandria Ocasio-Cortez, D-N.Y., and White House adviser Kellyanne Conway traded blows on Twitter Tuesday afternoon over the treatment of migrants in federal custody on the southern U.S. border. In a Tuesday morning Fox and Friends interview, Conway said that Ocasio-Cortez's claim that detained migrant women had drunk from toilets in a Border Patrol facility was \"outrageous.\" Ocasio-Cortez was part of a congressional delegation that traveled to the southern U.S. border to tour Border Patrol facilities Monday where children and families had reportedly been held in poor conditions. After her visit, she'd tweeted saying that \"Officers were keeping women in cells w/ no water & had told them to drink out of the toilets.\" Ocasio-Cortez later responded to Conway on Twitter, accusing the White House adviser of defending and muddying the \"clear and indefensible.\" More:AOC criticizes CBP after report of secret Facebook group as agency opens investigation More:'Children come first': House passes $4.6 billion in aid for migrants at border after Pelosi caves to Republicans Conway shot back later, saying that Ocasio-Cortez was \"all talk, no dollars,\" and noted that Ocasio-Cortez had voted against a recently passed humanitarian relief bill. Last week, following reports of poor detention conditions for migrants, Congress passed a $4.6 billion funding bill to provide humanitarian relief on the southern U.S. border. Ocasio-Cortez was one of 95 House Democrats to vote against the bill, citing concerns about a lack of protection for migrant families and children. President Donald Trump signed the bill into law on Monday. More:Like what you’re reading? Download the USA TODAY app for more",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Why are they called the 'Squad'? How four freshman Democrats got their group nickname",
      "url": "https://www.usatoday.com/story/news/politics/2019/07/23/squad-congress-how-aoc-omar-tlaib-and-pressley-got-name/1804557001/",
      "subtitle": "Why are they called the 'Squad'? How four freshman Democrats got their group nickname",
      "author": "Grace Hauck",
      "content": " President Donald Trump has been on a days-long Twitter tirade about four freshman congresswomen of color called the \"Squad.\" And while Trump's a fan of nicknames, he didn't come up with this one. Instead, the congresswomen gave it to themselves. The nickname refers to Democratic Reps. Alexandria Ocasio-Cortez, Ilhan Omar, Ayanna Pressley, and Rashida Tlaib. It started with a November Instagram post by then-representative-elect Ocasio-Cortez – a photo of the four congresswomen seated together, captioned \"Squad.\" “Someone said, ‘Oh you should do a hashtag or something #squadgoals’ and then it morphed into this thing,” Pressley told CBS in an interview last week. The 'Squad':The four congresswomen Trump told to 'go back' to other countries It's not just 'Rocket Man':Trump has long history of nicknaming his foes What started as a simple photo caption has grown into a broader talking point for the four congresswomen. On Monday at the national NAACP convention in Detroit, Tlaib said that the \"Squad\" is \"beyond just the four of us\" and that \"we need bold action.\" \"I can tell you, you are all the squad, trust me. If you support equity, you support justice, you are one of us,\" she said. \"The Squad is all of you.\" It's even an 82-year-old man from New Jersey, as it turns out. Last week, Rep. Bill Pascrell asked to be part of the \"Squad\" by responding to a tweet from satirical news site The Onion, which posted an article entitled \"82-Year-Old New Jersey Congressman Bill Pascrell Quietly Asks Ilhan Omar If He Can Be Part Of The Squad.\" Ocasio-Cortez gladly welcomed the congressman via Twitter. Referring to your friends as a \"squad\" or \"#squadgoals\" is common on social media. It's typically used as an aspirational term to highlight something you and your friends want to accomplish. Rapper Waka Flocka Flame has claimed ownership of the term \"squad,\" which he and rapper Gucci Mane have been including in their lyrics since the founding of their record label in 2007, according to Slate. The hashtag began to gain traction on social media in 2015, when Taylor Swift popularized the slogan during her world tour that year. Tlaib:'I'm not going nowhere, not until I impeach' Trump Poll:Many Americans have never heard of the 'the Squad' Waka Flocka Flame tweeted on the subject in 2015, when some began attributing the popularization of the term to Swift. Regardless of its origins, squad goals no longer just applies to Instagram. It's  become tied to  perhaps the four most visible freshman congresswomen in America. USA TODAY's William Cummings and Rebecca Morin contributed reporting. Follow Grace Hauck on Twitter @grace_hauck.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "AOC to DHS chief: Border agents shared 'Photoshopped images of my violent rape' in secret Facebook group",
      "url": "https://www.usatoday.com/story/news/politics/2019/07/18/alexandria-ocasio-cortez-homeland-security-kevin-mcaleenan-facebook-group/1769460001/",
      "subtitle": "AOC to DHS chief: Border agents shared 'Photoshopped images of my violent rape' in secret Facebook group",
      "author": "Christal Hayes",
      "content": " WASHINGTON – After a week fielding racist attacks from President Donald Trump, Rep. Alexandria Ocasio-Cortez questioned Acting Homeland Security Secretary Kevin McAleenan about the whereabouts of Border Patrol agents who threatened her in a secret Facebook group. The intense and personal line of questioning Thursday happened as McAleenan appeared before the House Oversight and Reform Committee to testify about his role in separating migrant children from their families and worsening conditions at the migrant detention centers along the southern U.S. border. He was also asked several times about a secret Facebook group of current and former Border Patrol agents that contained more than 10,000 members and included posts mocking migrants and the deaths of children in custody and suggesting harm to Democratic lawmakers. After the group's existence was revealed by a ProPublica report, McAleenan announced DHS was investigating the \"disturbing\" and \"inexcusable\" posts. \"Did you see the posts planning physical harm to myself and Congresswoman Escobar?\" Ocasio-Cortez, D-N.Y., asked McAleenan. \"Yes,\" he answered. \"And I directed an investigation within minutes of reading the article.\" \"Did you see the images of officers circulating Photoshopped images of my violent rape?\" Ocasio-Cortez continued. \"Yes I did,\" McAleenan responded. 'A kennel for dogs': Lawmakers hammer acting DHS chief Kevin McAleenan over migrant detention facilities McAleenan did not specifically say whether those Border Patrol agents were still on the job after Ocasio-Cortez, a freshmen lawmaker known for her progressive policies and large following on social media questioned whether they were still \"responsible for the safety of migrant women and children.\" He said several agents have been put on administrative duties while the investigation continues, saying \"I don't know which ones correspond to which posts and we've ordered cease and desist orders to dozens of more.\" McAleenan shot back after Ocasio-Cortez asked about whether the separating of children and families led to a \"dehumanizing culture\" within Customs and Border Protection. \"We do not have a dehumanizing culture at CBP,\" he said touting that the agency, \"rescues 4,000 people a year\" and is \"committed to the well-being of everyone that they interact with.\" He said the posts were \"unacceptable\" but \"I don't think it's fair to apply them to the entire organization or that even the members of that group believed or supported those posts.\" The hearing came after days of President Trump attacking Ocasio-Cortez and three other freshmen Democratic lawmakers, all women of color who are critical of his administration and its policies. It started Sunday when Trump sent a series of tweets suggesting Reps. Ocasio-Cortez, Ilhan Omar, D-Minn.; Ayanna Pressley, D-Mass.; and Rashida Tlaib, D-Mich., should \"go back\" to where they came from. The House passed a resolution condemning the racist comments on Tuesday as the president faced widespread criticism over the remarks, which he doubled down on at the White House and on Twitter throughout the week. He singled out the four women Wednesday evening during a rally in North Carolina and his supporters started chanting \"send her back\" as the president brought up Rep. Omar, who is originally from Somalia and became one of the first two Muslim women in Congress when she was elected in the 2018 midterms. Omar is a naturalized U.S. citizen. Trump distanced himself from the chants on Thursday, saying, \"I disagree with it\" and \"I wasn't happy with that message.\"",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Amazon fires back at Ocasio-Cortez’s claim that it pays workers ‘starvation wages’",
      "url": "https://www.usatoday.com/story/money/2019/06/17/amazon-responds-alexandria-ocasio-cortez-wages-claim/1481725001/",
      "subtitle": "Amazon fires back at Ocasio-Cortez’s claim that it pays workers ‘starvation wages’",
      "author": "",
      "content": "Amazon responded Monday to a comment by Rep. Alexandria Ocasio-Cortez, D-N.Y., that it pays warehouse workers “starvation wages,” saying in a tweet that it pays workers at least $15 per hour plus full benefits. In response to a question on ABC News’ “This Week” on Sunday about Amazon CEO Jeff Bezos, Ocasio-Cortez said whether Bezos is a billionaire is less of a concern to her than how the company’s policies impact Amazon warehouse workers. Ocasio-Cortez said she was concerned that Bezos’ “being a billionaire is predicated on paying people starvation wages and stripping them of their ability to access health care, and also if his ability to be a billionaire is predicated on the fact that his workers are taking food stamps.” Amazon tweeted a response to Ocasio-Cortez’s comments, saying: “Amazon is a leader on pay at $15 min wage + full benefits from day one. We also lobby to raise federal min wage.” Competitors coming for Prime:Two reasons it may be time to drop Amazon Prime Amazon’s head of communications, Jay Carney, later tweeted that Ocasio-Cortez should change the minimum wage law. Ocasio-Cortez was one of the most outspoken public critics of Amazon’s plan to move its second headquarters to Long Island City, in the borough of Queens, before Amazon pulled out. Amazon decided to raise its minimum wage to $15 an hour in 2018 after facing criticism for its pay disparity. In April, Bezos issued a challenge to other retailers to match Amazon’s pay and benefits. ©CNBC is a USA TODAY content partner offering financial news and commentary. Its content is produced independently of USA TODAY.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "There's a new front-runner in town: Elizabeth Warren. Just ask her Democratic rivals",
      "url": "https://www.usatoday.com/story/news/politics/2019/10/16/democratic-debate-elizabeth-warren-crowned-new-frontrunner-rivals/3987408002/",
      "subtitle": "There's a new front-runner in town: Elizabeth Warren. Just ask her Democratic rivals",
      "author": "Susan Page",
      "content": " Meet the new front-runner: Elizabeth Warren. National polls still show Joe Biden with an edge over the rest of the Democratic presidential field, but the folks most intensely attuned to the contest – that would be the rivals competing for the nomination – were targeting Warren Tuesday night at the fourth of the Democratic debates. Flattering, perhaps, but a focus that she never had to handle in the previous debates, and one that sometimes put the Massachusetts senator on the defensive as she dodged questions about whether her Medicare for All plan would result in higher taxes on the middle class and if her proposed “wealth tax” could fly. “I understand that this is hard, but I think as Democrats we are going to succeed when we dream big and fight hard, not when we dream small and quit before we get started,” Warren declared. Minnesota Sen. Amy Klobuchar responded with a pointed “reality check” on Warren. “I'm sorry, Elizabeth,\" Klobuchar said, although she didn't really sound sorry. \"I think we need to be honest here and tell the American people where we’re going to send the invoice.\" Winners and losers:Klobuchar, Buttigieg land some punches; billionaires on defense The debate didn’t fundamentally shape or reshape the Democratic race, perhaps something not even a forum that stretched for more than three hours could do. But the more frontal challenges to Warren on various issues by almost everyone else – Klobuchar, South Bend (Ind.) Mayor Pete Buttigieg, New Jersey Sen. Cory Booker, former Texas congressman Beto O'Rourke, California Sen. Kamala Harris, Hawaii Rep. Tulsi Gabbard, entrepreneur Andrew Yang – came amid new questions about whether Biden could be deposed as the moderate alternative to the party's liberal heroes, Warren and Vermont Sen. Bernie Sanders. And Sanders had a prize in his pocket that could boost him, rather than Warren, among voters on the left. During the debate, he teased that he would have a \"special guest\" at a campaign rally in Queens on Saturday. That turned out to be New York Rep. Alexandria Ocasio-Cortez, as The Washington Post quickly reported, one of the party’s most influential young liberal voices. All of the presidential candidates arrived on stage at Otterbein University in Ohio with things to prove: Biden about his family’s ethics. Sanders about his personal health. Warren about her political electability. And the other contenders, now polling in single digits, about whether they could break through – in some cases, whether they could even qualify for next month's debate, where the thresholds on fundraising and poll standing get higher. And when the debate was over? The political landscape for the debate was defined by this core question: Which candidate would be best able to defeat President Trump? That was the case Biden repeatedly tried to make for himself. He touted his age as a sign of wisdom and his experience as invaluable. \"I'm the only one on this stage that has gotten anything really big done,\" he said, citing the Violence Against Women Act and other legislation he helped enact while a senator from Delaware. That got Warren's attention. In the wake of the Great Recession, she noted, she had been instrumental in creating the Consumer Financial Protection Bureau, an idea she said skeptics had dismissed as unrealistic. Biden jumped in, saying he had rounded up votes for it. \"Let's get that straight,\" he said. Warren made it clear that wasn't how she saw it. Speaking slowly and with deliberation, she replied: \"I am deeply grateful to President Obama, who fought so hard to make sure that agency was passed into law.\" Sanders fired back at Biden, too. \"I say this as a friend,\" he said, \"but you got the Iraq war done.\" Biden vs. Warren:Two rivals debate whether party should strive for pragmatism or sweeping change The stage was crowded with a dozen Democrats, the biggest debate to date, sponsored by CNN and The New York Times. Warren scored an overwhelming win by one measure: Who got the most time to speak, in large part because the moderators repeatedly gave her time to respond to attacks. In the end, she spoke for close to 23 minutes, far longer than Biden, a distant second at about 16-1/2. Which seems only fair. After all, she is, apparently, the new front-runner.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Ocasio-Cortez on Biden segregationist comments: Booker doesn't need to apologize to Biden",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/06/20/alexandria-ocasio-cortez-booker-doesnt-need-apologize-biden/1512986001/",
      "subtitle": "Ocasio-Cortez on Biden segregationist comments: Booker doesn't need to apologize to Biden",
      "author": "Rebecca Morin",
      "content": " Rep. Alexandria Ocasio-Cortez, D-N.Y., said Thursday that Sen. Cory Booker does not need to apologize to Joe Biden after the New Jersey Senator criticized the former vice president's controversial comments about working with segregationist senators during his early years on Capitol Hill. Booker on Wednesday had asked Biden to apologize for praising his work with former Democratic Sens. James Eastland of Mississippi and Herman Talmadge of Georgia during a fundraiser at the Carlyle Hotel in New York, both of who fought against the civil rights movement and opposed the racial integration of schools. Biden, however, said that Booker \"knows better\" and should be the one to apologize. The former vice president added that he doesn't \"have a racist bone on my body.\" Ocasio-Cortez, who has been critical of Biden, weighed in on the debate on Thursday. \"For the record, Cory Booker does *not* owe Joe Biden an apology for pointing out that waxing nostalgic about working with segregationists is insensitive,\" she tweeted. \"'He knows better?' Really? What is 'better?' To stay quiet about it?\" she wrote. More:Biden: Booker should apologize after criticism of my comments on segregationists 'He is out of step':Backlash after Biden talks 'civility' with segregationist senators Booker campaign spokeswoman Sabrina Singh confirmed Booker and Biden spoke Wednesday night after the New Jersey Democrat appeared on CNN. “Cory shared directly what he said publicly — including helping VP Biden understand why the word 'boy' is painful to so many,” Singh said. “Cory believes that Vice President Biden should take responsibility for what he said and apologize to those who were hurt.\" The Biden campaign confirmed in an email that two candidates spoke. Ocasio-Cortez also warned that voter turnout in the 2020 election could be harmed by Biden's comments. Many of the Democratic wins in the 2018 midterms were driving by black voters, particularly black women, according to analysis from the NAACP. \"For folks saying we should gloss over this, I think it’s important to realize that we can’t risk depressed turnout in 2020,\" she wrote in a second tweet. \"The original remark is valid to ask about & have a discussion on or clarify - not dismiss. We should be compassionate toward each other, but not silent,\" she continued. Biden's comments defending his stance on civil rights came on Wednesday, which was Juneteenth — a day marked in many states and by African Americans across the country commemorating June 19, 1865, when blacks in Galveston, Texas, learned they were no longer slaves, almost two years after President Abraham Lincoln had issued the Emancipation Proclamation. A number of top lawmakers that are part of the Congressional Black Caucus have defended Biden, Politico reported. Ocasio-Cortez has previously criticized Biden for his \"middle-of-the-road approach\" on climate change, for his previous support of the Hyde Amendment, and believes that only a true progressive candidate could beat Trump. Biden has repeatedly touted as being moderate and working with both sides of the aisle, while maintaining that he is progressive. Despite her criticisms, Ocasio-Cortez has said she would support Biden if he was the nominee during an interview on ABC's \"This Week.\" She added that she still thinks the candidate that is picked as the Democratic nominee is \"going to be exciting to vote for, that all people, women, people of all genders, races, income levels, geographies feel excited and good about voting for.\" \"I think that it is absolutely important that we defeat Donald Trump,\" she said. Contributing: Aamer Madhani Like what you’re reading?:Download the USA TODAY app for more",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Donald Trump to GOP: Don't show 'weakness' by siding with Democrats on condemnation of tweets",
      "url": "https://www.usatoday.com/story/news/politics/2019/07/16/donald-trump-gop-dont-show-weakness-racism-claims-against-me/1741938001/",
      "subtitle": "Donald Trump to GOP: Don't show 'weakness' by siding with Democrats on condemnation of tweets",
      "author": "David Jackson",
      "content": " WASHINGTON – President Donald Trump urged House Republicans on Tuesday to oppose a resolution condemning him over racist tweets against four House congresswomen. \"The so-called vote to be taken is a Democrat con game,\" Trump tweeted. \"Republicans should not show 'weakness' and fall into their trap.\" Trump's latest tweets came as House Democrats were preparing a vote on a resolution that would condemn the president's comments about four progressive lawmakers, all of whom are women of color. Trump on Sunday suggested that the lawmakers \"go back\" to the countries they \"originally came from\" instead of telling Americans \"how our government is to be run.\" The four House members, all critics of Trump, are Reps. Alexandria Ocasio-Cortez, D-N.Y., Ayanna Pressley D-Mass., Rashida Tlaib, D-Mich., Ilhan Omar, D-Minn. All four are U.S. citizens. Several Republican lawmakers have distanced themselves from Trump's tweets, though in a news conference on Tuesday House GOP leaders stopped short of criticizing president's comments and instead criticized the Democrat congresswomen. Rep. Mike Turner, R-Ohio, wrote on Twitter that Trump's comments were \"racist and he should apologize. We must work as a country to rise above hate, not enable it.\" Sen. Pat Toomey, R-Pa., said Trump and the party should work to defeat Democrats on the merits of their ideas, not on their ancestry. “President Trump was wrong to suggest that four left-wing congresswomen should go back to where they came from,\" Toomey said in a statement. \"Three of the four were born in America and the citizenship of all four is as valid as mine.\" More:Pence aide defends Trump's 'go back' tweets by citing Elaine Chao's presence in Trump administration However, Rep. Kevin McCarthy, R-Calif., the top Republican in the House, told reporters he does not believe Trump's tweets were racist, adding that \"I believe this is about ideology. This is about socialism versus freedom.\" Protesting the House resolution during a Tuesday Twitter storm, Trump insisted his Sunday tweets \"were NOT Racist. I don’t have a Racist bone in my body!\"",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "NBA postpones media sessions in Shanghai amid China rift",
      "url": "https://www.usatoday.com/story/sports/nba/2019/10/09/nba-postpones-nets-lakers-media-sessions-in-shanghai/40286869/",
      "subtitle": "NBA postpones media sessions in Shanghai amid China rift",
      "author": "",
      "content": "NBA Commissioner Adam Silver told the Brooklyn Nets and Los Angeles Lakers on Wednesday that the league is still expecting them to play as scheduled this week, even while the rift between the league and Chinese officials continued in ways that clearly suggested the two planned games in Shanghai and Shenzhen were anything but guaranteed. The NBA called off scheduled media sessions Wednesday for both teams. At least two other NBA events to be held Wednesday before the start of the China games were canceled as part of the fallout that started after Houston Rockets general manager Daryl Morey posted a since-deleted tweet last week that showed support for anti-government protesters in Hong Kong. \"Given the fluidity of the situation, today's media availability has been postponed,\" the league said. The sessions were not rescheduled Wednesday, though having them on Thursday — game day in Shanghai — remains possible. Later Wednesday in Washington, a bipartisan group of lawmakers — including the rare alignment of Republican Sen. Ted Cruz of Texas and Democratic Rep. Alexandria Ocasio-Cortez of New York — sent a letter to Silver saying the NBA should show the \"courage and integrity\" to stand up to the Chinese government. They asked the NBA to, among other things, suspend activities in China until what they called the selective treatment against the Rockets ends. \"You have more power to take a stand than most of the Chinese government's targets and should have the courage and integrity to use it,\" the lawmakers told Silver. The NBA did not have any immediate comment on the letter, and it was unclear if Silver had even seen the document. In Shanghai, the mood surrounding the game that — if played — will feature LeBron James, Kyrie Irving and other big NBA names was anything but festive. An NBA Cares event that was to benefit the Special Olympics was called off, as was a \"fan night\" celebration that was to be highlighted by the league announcing plans to refurbish some outdoor courts in that city. And workers in multiple spots around Shanghai were tearing down large outdoor promotional advertisements for Thursday's Lakers-Nets game. The teams are also supposed to play Saturday in Shenzhen. Chinese smartphone maker Vivo has joined the list of companies that have suspended ties with the NBA for now, only adding to the uncertainty surrounding the China games. Vivo was a presenting sponsor of the games, and on Wednesday there was no reference to the game in Shanghai on the list of upcoming events scheduled at Mercedes-Benz Arena. Other firms such as apparel company Li-Ning announced similar moves earlier this week, as the rift was just beginning. Silver said Tuesday in Tokyo that he supports Morey's right to free speech. Several Chinese companies have suspended their partnership with the NBA in recent days, and Chinese state broadcaster CCTV said it will not broadcast the Lakers-Nets games. \"I'm sympathetic to our interests here and to our partners who are upset,\" Silver said. \"I don't think it's inconsistent on one hand to be sympathetic to them and at the same time stand by our principles.\" All around China, stores that sell NBA merchandise were removing Rockets-related apparel from shelves and many murals featuring the Rockets — even ones with Yao Ming, the Chinese great who played for Houston during his NBA career — were being painted over. Effects are already being felt in NBA arenas, in a pair of games featuring Guangzhou Loong Lions of the Chinese Basketball Association. After the playing of the Chinese national anthem in Washington on Wednesday before Guangzhou's game against the Wizards, one fan shouted, \"Freedom of expression! Freedom of speech! Free Hong Kong!\" Another fan shouted for a free Hong Kong from the second level during the second quarter. Minutes later, security approached one fan holding up a \"Free Tibet\" sign and another holding the Tibet flag. Security tried to take the sign, and the fan refused to give it up. Security then escorted them out of the seats. A similar scene played out in Philadelphia on Tuesday, also during a Guangzhou game. There, two fans were removed by arena security for holding signs and chanting in support of Hong Kong. The signs read \"Free Hong Kong\" and \"Free HK.\" The sentiment was not different from Morey's since-deleted tweet last week of an image that read, \"Fight For Freedom. Stand With Hong Kong.\" The 76ers and Wells Fargo Center, the team's home arena, released statements Wednesday confirming that the fan removal took place and explaining why. \"During the second quarter of last night's 76ers game, Wells Fargo Center security responded to a situation that was disrupting the live event experience for our guests,\" the arena's statement Wednesday said. \"After three separate warnings, the two individuals were escorted out of the arena without incident. The security team employed respectful and standard operating procedures.\" The NBA is not the first major corporation to deal with criticism from China over political differences. Mercedes-Benz, Delta Air Lines, hotel operator Marriott, fashion brand Zara and others also have found themselves in conflicts with China in recent years. After Morey's tweet was deleted, Rockets owner Tilman Fertitta said Morey does not speak for the organization. Joe Tsai, who recently completed his purchase of the Nets and is a co-founder of Chinese e-commerce giant Alibaba, has said the damage to the NBA's relationship with China \"will take a long time to repair.\" ___ Reynolds reported from Miami. AP Sports Writers Stephen Whyno in Washington and Dan Gelston in Philadelphia and Associated Press writer Yanan Wang in Beijing contributed to this report. ___ More AP NBA: https://apnews.com/NBA and https://twitter.com/AP_Sports",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "'The Squad': These are the four congresswomen Trump told to 'go back' to other countries",
      "url": "https://www.usatoday.com/story/news/politics/2019/07/15/who-is-the-squad-ocasio-cortez-omar-pressley-and-tlaib-make-mark/1732238001/",
      "subtitle": "'The Squad': These are the four congresswomen Trump told to 'go back' to other countries",
      "author": "William Cummings",
      "content": " They're young, charismatic and, as some of the most liberal members of Congress, have drawn President Donald Trump's scorn and rankled party leadership on both sides of the aisle. Most recently, the four freshmen minority congresswomen were seemingly the targets of a Twitter rant by Trump. \"Why don’t they go back and help fix the totally broken and crime infested places from which they came. Then come back and show us how it is done,\" he tweeted. They are \"the Squad.\" Reps. Alexandria Ocasio-Cortez, D-N.Y.; Ilhan Omar, D-Minn.; Ayanna Pressley, D-Mass.; and Rashida Tlaib, D-Mich., have collectively come to be known by that label since taking office in January. The four have found common cause on a number of issues, most recently by becoming the only Democrats to vote against the House version of a border funding bill that was backed by Speaker Nancy Pelosi. That act of rebellion prompted Pelosi to dismiss them as four people with a following in \"their Twitter world\" but no following on Capitol Hill. Ocasio-Cortez responded by telling The Washington Post that she thought Pelosi was \"singling out newly elected women of color.\" Trump weighed in on the Democratic infighting and defended Pelosi, saying, \"For them to call her a racist is a disgrace.\" And Sunday, Trump sparked outrage by appearing to tell the congresswomen – three of whom were born in the U.S. – to \"go back\" and fix the countries they \"originally came from\" before trying to make changes in the U.S. So who are the four congresswomen who make up \"the Squad?\" 'This is what racism looks like':Congresswomen react to Trump's 'go back' tweetstorm A self-described democratic socialist, Ocasio-Cortez won a major upset in New York's Democratic primary last year by unseating veteran Rep. Joe Crowley. And at age 29, she became the youngest woman ever elected to Congress. She was born in the Bronx to a father from the same New York City borough and a mother from Puerto Rico. She was working in a restaurant before she became a congresswoman and fighting for better pay for people in similar occupations has been a major part of her political platform. Sometimes referred to by her initials AOC, which also happens to be her Twitter handle, Ocasio-Cortez has earned a reputation as one of the most active users of social media in Congress. She is perhaps best known as one of the sponsors of the Green New Deal resolution, which called for the U.S. to reach net-zero greenhouse gas emissions along with other goals meant to mitigate the effects of climate change. AOC to Republicans:Stop fixating on Green New Deal and read it 'Broken' and 'horrifying':AOC, Joaquin Castro, lawmakers visit Texas border facilities Omar was born in Somalia. Her family fled that country's civil war when she was 8 years old and spent four years in a refugee camp in Kenya before arriving in the U.S. and settling in Minneapolis in 1997, according to her biography. Omar, 36, has sparked anger with her rhetoric criticizing the Trump administration and U.S. foreign policy since taking office. And she caused an uproar with her criticism of Israel and the influence of the pro-Israeli lobby, which many said played into anti-Semitic tropes. She and Tlaib were the first Muslim women elected to Congress and some critics have tried to use anti-Islamic rhetoric to paint her as dangerous or to tie her to Islamic extremists. Last week, Fox News host Tucker Carlson called Omar \"living proof that the way we practice immigration has become dangerous to this country.\" \"I believe as an immigrant, I probably love this country more than anyone that is naturally born,\" Omar said while speaking at a Netroots Nation event Saturday. Who is Rep. Ilhan Omar?:The Muslim lawmaker Donald Trump loves to attack More:New York man accused of threatening Rep. Ilhan Omar remains behind bars Pressley, 45, is the first African American woman to be elected to the Congress from Massachusetts. Like Ocasio-Cortez, she pulled off a major political upset in the Democratic primary last year, unseating 10-term Rep. Michael Capuano. According to the biography on her congressional webpage, she was born in Cincinnati and raised in Chicago by her mother, a community organizer. Her father struggled with addiction and was in and out of jail before going on to become an author. Pressley is a survivor of sexual assault who has openly discussed abuse she suffered as a child and being raped by an acquaintance in college. Her biography says, \"She believes that the people closest to the pain should be closest to the power and that a diversity of voices in the political process is essential to making policies that benefit more Americans.\" Rep. Ayanna Pressley to Kellyanne Conway:'Keep my name out of your lying mouth' Tlaib, 42, is the oldest of 14 children born in Detroit to Palestinian immigrant parents. Her father, who was born near Jerusalem, worked on the assembly line at the Ford Motor Co. plant. She stirred up controversy quickly after her arrival in Washington, using an expletive and vowing \"we're gonna impeach\" Trump on the night she was sworn in. And since taking office, she has been a leading advocate for the president's impeachment. Some right-wing critics have tried to use Tlaib's religion against her, painting her as un-American or a danger to the country. And, like Omar, she has been accused of anti-Semitism for her criticisms of Israeli policies toward the Palestinians. Trump:President slams Rep. Rashida Tlaib for Holocaust comments More:Six things about Rashida Tlaib, one of the first Muslim woman in Congress The four congressmen have embraced the Squad moniker – a term derived from hip-hop origins and later appropriated by Taylor Swift and the ever-shifting circle of celebrities around her to refer to a tight-knit group of people with common goals. On Sunday, Pressley tweeted that the Squad is about more than herself and three other congresswomen, but rather represents all those who embrace their progressive ideals. Contributing: Erin Kelly",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "'Headline was flawed': New York Times changed headline about Trump speech after backlash",
      "url": "https://www.usatoday.com/story/news/nation/2019/08/05/new-york-times-criticism-donald-trump-speech-headline/1929546001/",
      "subtitle": "'Headline was flawed': New York Times changed headline about Trump speech after backlash",
      "author": "Jordan Culver",
      "content": "  A photo of the front page of Tuesday's New York Times sparked immediate criticism on Monday night – including from several 2020 Democratic presidential candidates. The headline read \"Trump urges unity vs. racism.\" It comes after President Donald Trump addressed the nation after mass shootings in Dayton, Ohio, and El Paso, Texas, that killed nine and 22 people, respectively. The headline ran in the Times' first print edition and was changed in subsequent editions, The Times told USA TODAY in a statement Tuesday. The original headline didn't sit well with a number of Democrats. \"Let this front page serve as a reminder of how white supremacy is aided by – and often relies upon – the cowardice of mainstream institutions,\" tweeted Rep. Alexandra Ocasio-Cortez of New York. Defamation suit:Sarah Palin's lawsuit against New York Times back from the dead Start the day smarter:Get USA TODAY's Daily Briefing in your inbox New Jersey Sen. Cory Booker, who told CNN over the weekend that Trump was \"responsible for this,\" said via Twitter: \"Lives literally depend on you doing better, NYT. \"Please do.\" Fellow Democratic presidential candidates Kirsten Gillibrand and Beto O'Rourke – who called the headline \"unbelievable\" – also sounded off on Twitter. Even a New York Times contributor was taken aback by the headline. Op-ed contributing writer Wajahat Ali tweeted: \"I write for the NYT. This is a terrible headline.\" Trump has repeatedly faced criticism for his stance on immigration. He also recently tweeted four Democratic congresswomen should \"go back\" to the \"crime infested places from which they came.\" Trump's tweets were condemned as racist by the U.S. House of Representatives. The Times' headline was changed for the newspaper's next edition, reading \"Assailing hate but not guns.\" Ali tweeted appreciation: \"This one is on point! Thank you!\" \"The original headline was flawed and was changed for all editions of the paper following the first edition,\" Danielle Rhoades Ha, vice president of Communications for The Times, said in an emailed statement Tuesday. \"The headline in question never appeared online, only in the first print edition.\" As a result of the controversy, the hashtag #CancelNYT began trending on Twitter Tuesday afternoon as social media users expressed outrage about the headline. Many demanded the resignation of Times editors while pledging to unsubscribe from the paper and calling for others to do the same. Some have criticized the hashtag, arguing The Times buckled too easily by changing the headline under liberal pressure. Both front pages were shared by New York Times associate masthead editor Tom Jolly on Twitter.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "AOC is driving more social media traffic than any Democratic presidential candidate",
      "url": "https://www.usatoday.com/story/news/politics/2019/07/17/alexandria-ocasio-cortez-more-social-media-traffic-than-any-democrat/1762763001/",
      "subtitle": "AOC is driving more social media traffic than any Democratic presidential candidate",
      "author": "",
      "content": "NEW YORK – Judging by the social media metrics, it was a big week for the campaign of U.S. Rep. Alexandria Ocasio-Cortez. Oh, wait. She’s not running for president. But the Democratic representative from Queens dwarfed the Democrats who are actually seeking President Donald Trump’s job in a measurement of social media interactions with news articles by the tracking firm NewsWhip. The statistics were first reported by Axios. For the week that ended on Sunday, Ocasio-Cortez, known as AOC, had attracted 4.8 million such interactions, NewsWhip said. By comparison, all of the Democrats running for president reached a combined 6.5 million. California Sen. Kamala Harris had 1.2 million to lead the way, with Sen. Bernie Sanders, former Vice President Joe Biden and Sen. Elizabeth Warren getting around a million each. Race for 2020:Kamala Harris took money from law firm that represented Epstein on same day she blasted it Given how Trump’s tweets about Ocasio-Cortez and three of her colleagues have dominated the news since they were first made Sunday, that picture doesn’t appear likely to change much this week. “They can’t get a breath because all of the oxygen is gone,” said Fox News Channel’s Harris Faulkner on Wednesday. That would be a bigger concern if it wasn’t mid-July, squarely in the middle of vacation season and 16 months before the presidential election. But since it’s generally considered a goal of Trump supporters to have the liberal Ocasio-Cortez be top of mind when people think of Democrats, that indicates they are having some success. The next time for some concentrated attention for the Democratic candidates will come on July 30 and 31, when CNN will host the second presidential debate.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Climate activists glue themselves to Capitol entrances to pressure lawmakers",
      "url": "https://www.usatoday.com/story/news/politics/2019/07/23/climate-activists-glue-themselves-u-s-capitol/1811221001/",
      "subtitle": "Climate activists glue themselves to Capitol entrances to pressure lawmakers",
      "author": "Jason Lalljee",
      "content": " WASHINGTON – Sixteen protesters from the climate change activist group Extinction Rebellion glued themselves to underground shuttle entrances in the U.S. Capitol on Tuesday, resulting in the arrests of at least three. Using Gorilla Glue, the protesters affixed themselves to doorways in front of the subway entrances leading from the Cannon and Rayburn House office buildings to the Capitol, hoping to address congresspeople on their way to a House vote at 6:30 p.m. The protesters managed to remain until around 8 p.m. when U.S. Capitol Police began to remove and arrest them. Earlier this month, Reps. Alexandria Ocasio-Cortez, D-N.Y., and Earl Blumenauer, D-Ore., along with Sen. Bernie Sanders, I-Vt., introduced a resolution declaring a \"climate emergency\" and demanding a broad mobilization of resources to prepare for the impact of climate change. Extinction Rebellion protesters want to make sure that resolution passes. “Part of the protest is to force the U.S. to consider following in the U.K.’s footsteps of declaring a climate emergency,” said Kaela Bamberger, a media representative for Extinction Rebellion. “Part of the point in using civil disobedience is creating this situation where we disrupt business as usual for congresspeople and put pressure on Congress to demand a climate emergency and to see that resolution through the legislature.” That resolution is latest measure to be introduced by Ocasio-Cortez. Earlier this year the New York Democrat unveiled the Green New Deal, which a number of high-profile Democrats — many of whom are running for president — have endorsed. In April, members of Extinction Rebellion’s U.K. division blocked the Waterloo Bridge for more than a week, also gluing themselves to buildings and climbing on top of trains. Sadiq Khan, the mayor of London, met with the protesters and promised to consider a citizens’ assembly on climate change. Additionally, on May 1, in accordance with one of their demands, U.K. Parliament members declared a climate and environment emergency, becoming the first national legislature to do so. Heather Berube, age 34, who is a member of the Toxics Action Center in Maine, was one of the protesters who got arrested after gluing themselves to the Rayburn entrance. She took a bus to D.C. specifically to put pressure on lawmakers. More:2 years after hurricanes, Trump administration has OK'd only 9 projects for funding in Puerto Rico More:NAACP calls for Trump's impeachment saying he's 'unfit to serve as the president' “I just dedicate my life to making a better world for my kids,\" she said. “As climate change gets worse, it’s going to become more pressing for everyone.” Rep. Maxine Waters, D-Calif., encouraged the Rayburn protesters after encountering them by the entrance. “What’s the word?” she asked them, to which they shouted “climate change” in unison. “Say it louder,” she said — which they did — then offered them a shout of encouragement before walking off. Like what you’re reading?:Download the USA TODAY app for more",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "'Wrongfully detained' Texas teen who is a US citizen released after nearly a month",
      "url": "https://www.usatoday.com/story/news/nation/2019/07/23/immigration-texas-teen-detained-month-despite-u-s-citizenship/1810057001/",
      "subtitle": "'Wrongfully detained' Texas teen who is a US citizen released after nearly a month",
      "author": "John C Moritz Austin Bureau USA TODAY NETWORK",
      "content": " CORPUS CHRISTI, Texas – Immigration authorities released an 18-year-old American citizen late Tuesday who had been kept in federal custody for nearly a month after he and his brother were detained at a U.S. Customs and Border Protection checkpoint while en route from their home in South Texas to a soccer camp west of Fort Worth. The release came well after his lawyer presented federal authorities with the birth certificate that proves his U.S. citizenship, The Associated Press reported. The Dallas Morning News first reported that Francisco Erwin Galicia, 18, and his 17-year-old brother Marlon Galicia were detained June 27 at the checkpoint in Falfurrias about 80 miles from the Rio Grande. Marlon, who is not a U.S. citizen, agreed to be deported, but Francisco was held, attorney Claudia Galan of McAllen told the newspaper. Francisco Galicia was carrying a state-issued ID, which can only be obtained by producing a Social Security number and is only available to American citizens. Immigration debate:Trump campaign again draws Mollie Tibbetts' name into debate despite family's objections “I presented them with his original birth certificate and other documents and they ignored them,\" Galan told the Morning News. \"So now I’ve faxed over all the documents to the ICE agent handling the case. \"He’s going on a full month of being wrongfully detained. He’s a U.S. citizen and he needs to be released now.” Representatives of the U.S. Department of Homeland Security and U.S. Customs and Border Protection did not immediately respond to emails seeking comment. The Morning News report caught the attention of U.S. Rep. Alexandria Ocasio-Cortez, D-N.Y., who tweeted that federal authorities were \"detaining American citizens.\" \"How would you feel trapped in a border camp, where guards wear face masks because the human odor is so strong?\" Ocasio-Cortez said in her tweet. \"When we allow the rights of some to be violated, the rights of all are not far behind.\" Galicia was released from the South Texas Detention Complex in Pearsall, about 240 miles north of McAllen “I’m so thankful Francisco is free and he can sleep at home tonight and see his mom,” Galan said in the AP report. Until Saturday, neither she nor Galicia's family were aware of the teen's whereabouts. He was not permitted to call his mother, she said in published reports. Galan said Galicia did provide Border Patrol agents a wallet-sized birth certificate indicating he was born in Dallas. But he also had a Mexican tourist's visa, which also suggested he was a citizen of Mexico, she said. “At the time that his mother registered his birth certificate, she used a fake name,\" Galan told the McAllen Monitor. \"Because of that name on the birth certificate, she could never get him a passport, and she never corrected the birth certificate to get him a passport. Instead of doing that, she thought it would be easier to get him a tourist Visa listing him as being born in Mexico.\" John C. Moritz covers Texas government and politics for the USA Today Network in Austin. Follow him on Twitter @JohnnieMo.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Gun shop in North Carolina puts up billboard featuring the 'Squad'",
      "url": "https://www.usatoday.com/story/news/politics/2019/08/01/gun-shop-puts-up-billboard-ocasio-cortez-omar-tlaib-pressley/1892423001/",
      "subtitle": "Gun shop in North Carolina puts up billboard featuring the 'Squad'",
      "author": "Rebecca Morin",
      "content": " WASHINGTON – A North Carolina gun store owner took out a billboard advertisement focused on four Democratic congresswomen of color that makes reference to \"The 4 Horsemen\" and all but calls the four progressive lawmakers \"idiots.\" The lawmakers featured on the billboard are the same four Democrats — colloquially known as the \"Squad\" — who have drawn President Donald Trump's ire in recent weeks as he has leveled repeated racist attacks on them. Cherokee Guns, based in Murphy, N.C., posted a picture of the billboard on its Facebook page Sunday. The image has photos of Democratic Reps. Ilhan Omar of Minnesota, Alexandria Ocasio-Cortez of New York, Rashida Tlaib of Michigan and Ayanna Pressley of Massachusetts. Above the four women's photos, the billboard reads \"The 4 Horsemen Cometh are Idiots,\" and below it says \"Signed, the Deplorables.\" \"The 4 Horsemen\" is a biblical reference to the coming of the end of the world. In the Bible, the Four Horsemen of the Apocalypse are said to bring pestilence, war, famine and death. In addition, the sign references \"deplorables,\" a term that Hillary Clinton famously used in 2016 to describe some of Trump's supporters. 'It's breaking my heart':Greenville, NC, wrestles with fallout of Donald Trump's rally ‘Racist words ... giving me flashbacks.':Black Cincinnati residents brace for Trump rally following ‘racist’ comments In a separate post on Monday, the store said that it will be giving out bumper stickers bearing the same image. Trump several weeks ago tweeted for the four congresswomen to \"go back\" to their countries. Three of the four lawmakers were born in the United States and all four are U.S. citizens. The four Democrats have criticized Trump's comments as racist. The House of Representatives last month also condemned the president's tweets as racist. Trump has repeatedly denied that his comments about and attacks on the four women of color are racist. Following Trump's tweets, chants of \"send her back\" broke out at a rally in North Carolina when the president mentioned Omar. Trump initially denounced the chant, but later called the supporters at that rally \"patriots.\" Several top Democratic lawmakers called for more security for Omar and others after Trump's attacks and the chants that followed. Speaking to reporters Thursday before heading to a rally in Cincinnati — his first since the North Carolina rally, the president said he would prefer that his supporters not revive the chants. But Trump also suggested he was not sure he would be able to stop the chanting if it happened. 'I prefer they don't':Trump says he hopes Cincinnati rally crowd doesn't revive 'send her back' chant The advertising company responsible for the billboard, Allison Outdoor Advertising, said on Facebook Wednesday that it was going to take the billboard down, according to North Carolina's News Channel 9. The company has since deleted the post. It did not respond to request for comment from USA TODAY. Pressley on Tuesday criticized the billboard and called on Rep. Mark Meadows, who represents the district where the gun shop is located, to get involved. \"#Racist rhetoric from the occupant of the @WhiteHouse has made hate our new normal. We are still vulnerable,\" Pressley wrote on Twitter. \"@RepMarkMeadows – Cherokee Guns is in your district & you and I serve on a committee together. Here’s your chance to finally do the right thing.\" Like what you’re reading?:Download the USA TODAY app for more",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Ocasio-Cortez on planned Wayfair walkout: 'This is what solidarity looks like'",
      "url": "https://www.usatoday.com/story/news/politics/2019/06/25/aoc-wayfair-walkout-this-what-solidarity-looks-like/1562921001/",
      "subtitle": "Ocasio-Cortez on planned Wayfair walkout: 'This is what solidarity looks like'",
      "author": "Rebecca Morin",
      "content": " WASHINGTON – Rep. Alexandria Ocasio-Cortez, D-N.Y., praised workers from Wayfair, an online home goods website, for planning a walkout after the company sold furniture to an organization that is managing migrant camps along the U.S-Mexico border. \"Wayfair workers couldn’t stomach they were making beds to cage children,\" Ocasio-Cortez tweeted. \"They asked the company to stop. CEO said no.\" \"Tomorrow, they‘re walking out,\" she continued. \"This is what solidarity looks like - a reminder that everyday people have real power, as long as we’re brave enough to use it.\" Sen. Elizabeth Warren, D-Mass., who is a top-tier candidate in the 2020 Democratic field, also tweeted that she supports the walkout. \"I stand with the hundreds of @Wayfair employees who are planning to stage a walkout at their Boston headquarters tomorrow,\" she wrote. \"The safety and well-being of immigrant children is always worth fighting for. \" Wayfair employees are staging a walkout in Boston, Mass., on Wednesday after the company said it would not end its business relationship with BCFS, a government contractor that has been managing migrant camps at the border, according to several reports. Employees for the company learned last week that a $200,000 order of bedroom furniture was placed by BCFS for a facility in Carrizo Springs, Texas, the Boston Globe first reported. Friday, nearly 550 employees on Friday signed a letter to Wayfair executives asking that the company cease all business with contractors that operate detention camps for immigrants. \"We believe that the current actions of the United States and their contractors at the Southern border do not represent an ethical business partnership Wayfair should choose to be a part of,” the letter stated, according to the Globe, which obtained a copy of the letter. “At Wayfair, we believe that ‘everyone should live in a home that they love.’ Let’s stay true to that message by taking a stand against the reprehensible practice of separating families, which denies them any home at all.\" The walkout is set for Wednesday at 1:30 p.m. local time in Boston, the Washington Post reported. In addition, employees are calling on Wayfair to donate all profits made from the sale to BCFS to Refugee and Immigrant Center for Education and Legal Services, a Texas-based non-profit that provides legal services to immigrants. More:Federal appeals court orders more fact-finding on Trump administration's plan to add census citizenship question More:GOP Rep. Michael Burgess says migrant children in one detention center can leave 'at any time' This is not the first time Wayfair has sold furniture to a migrant center. According to the Post, the company sold to a facility in Tornillo, Texas, last September. That center has since been shut down. A Twitter account about the walkout was created, as well as a Facebook page. Wayfair and the organizers of the walkout have not responded to requests for comment. Another Democratic lawmaker has also responded to the media reports about the planned walkout. Rep. Ayanna Pressley, D-Mass., whose district includes Wayfair's headquarters, said she stands in solidarity of those walking out on Wednesday. \"We must actively #resist any & all efforts by this cruel, incompetent administration to cage children and separate families,\" she tweeted. \"I proudly stand in solidarity w/ the hardworking individuals at #Wayfair who are walking out in the name of #justice & humanity.\" Like what you’re reading?:Download the USA TODAY app for more",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "'SNL': Alec Baldwin's Trump skit jabs zealous rallygoers – with a cameo by an ISIS escapee",
      "url": "https://www.usatoday.com/story/entertainment/tv/2019/10/26/saturday-night-live-president-trump-alec-baldwin-new-mexico-rally/2477170001/",
      "subtitle": "'SNL': Alec Baldwin's Trump skit jabs zealous rallygoers – with a cameo by an ISIS escapee",
      "author": "Bill Keveney",
      "content": " “Saturday Night Live” opened this week's episode with a President Donald Trump skit – big surprise, huh? – but this Alec Baldwin outing was much better than some recent ones. The cold open of Saturday's episode, which was hosted by Chance the Rapper, packed in newsy items – Syria, ISIS, impeachment, tax returns – while throwing jabs at Trump, U.S. Sen. Lindsey Graham, former President Bill Clinton and the most zealous of Trump rallygoers. Refreshingly, it highlighted the talented “SNL” cast – supported by alums Darrell Hammond and Fred Armisen – rather than relying on the celebrity stunt-casting that has propped up some less-than-stellar presidential skits. The Trump sketch played off a September rally in New Mexico, but also referenced the real president's comment last week that a wall is being built in Colorado, a non-border state, a statement that is hard to parody. Surprise! Jason Momoa rips shirt open during cameo in Chance the Rapper's 'SNL' court skit More 'SNL':Chance the Rapper opens second hosting gig with song saluting No. 2's The gag was bolstered by a funny map that included Good America (mostly states that voted for Trump), Bad America (the Northeast, which didn't), Bad Mexico (which borders Colorado), New Mexico being north of Colorado and California, which did not vote for Trump, in the ocean. Trump got the devoted rally crowd going, asking what the impeachment inquiry really is? \"A witchhunt,\" they replied in unison. White House antics:Rudy Giuliani as Joker? A Ferris Bueller-esque Mike Pompeo? It's all in 'SNL's opening skit Baldwin's Trump is back:Alec Baldwin returns to 'SNL' as Trump stressing about impeachment; 'Kanye' ends friendship He then segued into, \"And there was no?\" \"No collusion!\" they shouted. \"No, the new one,\" Baldwin's Trump said, hinting at a phrase he has used to combat the impeachment inquiry. \"No quid pro quo,\" the crowd yelled. Baldwin's Trump was then praised by a bunch of fervent supporters he invited to the microphone. Cecily Strong played a woman whose T-shirt misspelled Trump's \"Make America Great Again\" slogan. When Trump mentioned the typos, she responded, \"No, this is taken verbatim from one of your tweets. Therefore, it's correct.\" She said the impeachment inquiry is \"a deep-state liberal conspiracy and everyone's in on it: The CIA, the FBI, the M-I-C, the K-E-Y, and the M-O-U-S-E.\" Aidy Bryant played another Trump devotee: \"I love you and I worship you as the one true white lord.\" When Trump said he might shoot the anonymous author of an upcoming Trump expose on Fifth Avenue, playing off a real Trump statement, Bryant's supporter offered him a gun. \"The Earth is flat and Beyoncé is white,\" she said, as Trump shooed her off. Pete Davidson, clad in black, was introduced as a young Trump supporter. The president asked if he was from New Mexico. \"ISIS,\" Davidson's character answered, echoing news of ISIS escapees in Syria. \"I was in a prison in Syria until last week when you freed me. So, I just wanted to say thank you for bringing jobs back – to ISIS. And I promise that I will make ISIS great again.\" \"Terrific. What a great guy,\" Trump responded. \"ISIS is back in a big way, folks. And we love that, don't we?\" Then, it was time for famous faces. Trump couldn't seem to identify Graham, one of his strongest supporters in Congress. \"Sorry, I thought you were a scoop of ice cream melting into a suit.\" \"I'm sweating profusely all the time,\" Kate McKinnon's jowly senator replied. \"Even my bodily fluids are trying to distance themselves from me.\" Facebook founder Mark Zuckerberg (Alex Moffat), who faced harsh questioning in Congress last week, was on hand, because \"he got his (behind) completely owned by AOC (New York congresswoman Alexandria Ocasio-Cortez), so it means he's one of us now.\" Trump tax returns:New York prosecutor says president can't block subpoena for financial records Trump thanked him for running \"our Russia campaign,\" with Moffat's awkward Zuckerberg replying \"Facebook isn't pro-Russia. It's just not anti-Russia.\" He then went on about a rigorous fact-checking review board – before Davidson's ISIS soldier said he was on the panel. Hammond's Clinton arrived, saying he just \"followed the party.\" When Trump said he was getting impeached, Clinton surmised it had something to do with a sex-related matter, as it was when he was impeached in 1998. \"No, it's not for that,\" Trump said. \"They don't mind when I do that.\" Finally, Trump introduced his \"new friend,\" Turkish President Recep Tayyip Erdogan. (The real president's decision to change U.S. policy in Syria after a call with the Turkish president has come under bipartisan criticism.) \"Erdogan and I are such good friends now,\" Trump said. \"It's like when Franco and Mussolini would take vacations together,\" Armisen's Erdogan responded, continuing the bromance banter. When Trump said he didn't have anything to gain financially from the decision, the pair got into a debate about how rich Trump really is. When Erdogan said Trump had $100 billion, Trump said, \"Not exactly, but it's definitely billions.\" \"He's being modest,\" Erdogan responded, setting up one last dig on a newsy item. \"I'm sure it's more than that. Show them your tax returns.\"",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "'Being someone’s daughter' not a 'qualification': Ocasio-Cortez slams Ivanka Trump's diplomatic role",
      "url": "https://www.usatoday.com/story/news/politics/2019/06/30/alexandria-ocasio-cortez-says-ivanka-trump-unqualified-diplomat/1611603001/",
      "subtitle": "'Being someone’s daughter' not a 'qualification': Ocasio-Cortez slams Ivanka Trump's diplomatic role",
      "author": "William Cummings",
      "content": " Rep. Alexandria Ocasio-Cortez sharply criticized Ivanka Trump's suitability as a U.S. diplomatic representative at last week's G-20 summit in Osaka, Japan, saying on social media that simply being the president's daughter does not make her qualified for the role. \"It may be shocking to some, but being someone’s daughter actually isn’t a career qualification,\" the freshman Democratic congresswoman from New York said in a tweet on Saturday night. \"It hurts our diplomatic standing when the President phones it in & the world moves on. The US needs our President working the G20. Bringing a qualified diplomat couldn’t hurt either,\" she added. Ocasio-Cortez's post included a link to a tweet featuring a viral video clip – which has more than 9 million views – of President Donald Trump's oldest daughter, and White House adviser, participating in a conversation with French President Emmanuel Macron, British Prime Minister Theresa May, Canadian Prime Minister Justin Trudeau and the director of the International Monetary Fund's director, Christine Lagarde. At G20, Trump tells Putin playfully:'Don't meddle in the election.' Putin laughs New strategy?:Trump criticized Kamala Harris at the G20, breaking a silence More:Donald Trump's future depends in part on Xi Jinping, Vladimir Putin, and Kim Jong Un The context of the 19-second video clip that was published on the official Instagram account of the French presidential palace is not provided, and the sound quality leaves some of the dialogue unintelligible. But it shows Macron making a comment about \"social justice\" to which Ivanka Trump nods and expresses agreement. \"As soon as you begin talking about the economic aspect of it, though, a lot of people start listening who otherwise wouldn't listen,\" May says. \"Yeah,\" Trump agrees. \"And the same with the defense side of it,\" which she says is \"male-dominated.\" Many Twitter users characterized the attempts by the president's daughters to join the conversation as embarrassing. A number of commentators noted an apparent eye roll from Lagarde as Ivanka Trump spoke. \"Your thoughts on this video, @IvankaTrump? Your thoughts on the French government releasing it for the world to see?\" tweeted actress and liberal activist Alyssa Milano. Edward Luce, a columnist for the Financial Times, wrote that Ivanka Trump \"inserting herself into an awkward circle of world leaders\" will be the \"abiding image\" of the G-20 summit. He noted the \"varying expressions of tortured politeness\" displayed by the European political figures as Ivanka Trump spoke, and said that \"Lagarde, in particular, was unable to conceal her irritation.\" \"America’s self-named 'First Daughter' is rarely out of the frame at global summits. Other Trump officials are almost invisible compared with Ms Trump, and her husband, Jared Kushner, the only two White House players who are thought to be immune from Mr Trump’s trademark phrase: 'You’re fired,\" Luce wrote. Some of Ivanka Trump's defenders pushed back against Ocasio-Cortez's criticism. They said it was ironic that Ocasio-Cortez, a bartender and the youngest woman ever elected to Congress, was criticizing someone as being unqualified. College professor Oliver McGee, a frequent guest on Fox News, accused Ocasio-Cortez of \"jealousy\" for Ivanka Trump's place  \"on the world stage\" and called her criticism \"petty & classless.\" \"Diplomat Ivanka is savvy in business & politics to dialogue with world leaders! Being a bartender is NOT a savvy qualification for Congress,\" McGee tweeted. \"Imagine lacking this much self-awareness. The bartender turned Congresswoman, called someone unqualified,\" the Students for Trump Twitter account replied to Ocasio-Cortez's post. \"She didn’t 'turn' Congresswoman,\" another Twitter user replied to Students for Trump's criticism. \"She campaigned, beat an entrenched politician, and she did it with grit and a vision. You may not like her views, but nothing was handed to her ... unlike Ivanka.\"",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Gun store owner puts up billboard mocking 'the Squad': 'The 4 Horsemen are idiots'",
      "url": "https://www.usatoday.com/story/news/nation/2019/07/31/gun-store-owner-mocks-aoc-tlaib-the-squad-on-billboards/1877967001/",
      "subtitle": "Gun store owner puts up billboard mocking 'the Squad': 'The 4 Horsemen are idiots'",
      "author": "",
      "content": "ASHEVILLE, N.C. – Along U.S. 64 in Murphy, North Carolina, a billboard advertising a gun store mocks \"the 4 Horsemen\" — U.S. Reps. Alexandria Ocasio-Cortez, Ilhan Oman, Rashida Tlaib and Ayanna Pressley. The \"Cherokee Guns\" tag at the bottom — it's a mile ahead on the right — almost seems like an afterthought. The Citizen Times spoke to a man who described himself as the owner of Cherokee Guns and identified himself only as \"Doc.\" The \"about\" section on Cherokee Guns' Facebook page lists Doc Wacholz as the store's 2012 founder. \"I'm not inciting any violence or being racist,\" Wolf said. \"It's a statement. It's an opinion.\" When asked why he chose to pair the congresswomen with his gun shop advertisement, Wacholz said, \"They're socialists, from my point of view. I also feel a couple of them, being Muslim, have ties to actual terrorists groups.\" 'Jihad Squad':Illinois GOP group apologizes for offensive post about AOC, Omar, Tlaib and Pressley Wacholz reiterated that his billboard is protected by free speech and said he paid about $250 a month to rent it. Allison Outdoor Advertising Inc., the owner of the billboard, doesn't screen the ads that renters display, said Danny Coleman, the account executive responsible for Cherokee County. \"As long as there's no vulgar stuff or stuff with kids,\" Coleman said. \"That's the only thing I could think of.\" At least three previous Cherokee Guns billboards involve words or images that mock Islam or Arab or Muslim Americans. In 2015, Wacholz rented a billboard that said \"Give me your tired, your poor ... Keep your Syrian refugees.\" “People on Facebook were saying it was ignorant or racist,” Wacholz told the Citizen Times in 2015, but “all the feedback I’ve gotten from people coming into my shop is completely positive. People have come in and tried to actually give me money just to keep the billboard up.” Online critics say this pairing — of guns and racial generalizations — is particularly worrisome in the wake of mass shootings committed by white supremacists. When asked whether he thought people might be less concerned if the billboard were a stand-alone political message without mention of guns, Wacholz said he \"hadn't considered it.\" \"If (Wacholz) were a business owner and a member of ours, we would try to discourage him,\" said Sherry Raines, executive director of the Cherokee County Chamber of Commerce. Raines noted Cherokee Guns' history of \"controversial\" advertisements. Murphy Mayor Rick Ramse did not respond to two calls for comment on July 30. Fact check:Trump’s false claims about Rep. Ilhan Omar And U.S. Rep. Mark Meadows did not respond to multiple requests for comment July 30. Murphy falls in his 11th Congressional District. Wacholz hasn't shied away from the publicity the billboard has attracted. According to a July 29 Facebook post on the Cherokee Guns account, Wacholz plans to offer a \"FOUR HORSEMEN COMETH STICKER.\" The post continues with instructions for would-be bumper sticker buyers: \"(E)at a piece of bacon ... tell us you're voting for Trump in 2020 ... then get your limited edition bumper sticker!!\" \"Snowflakes and Liberals are not eligible ... sorry,\" the post said.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Biden urges caution about policies of 'way left' Democrats, Ocasio-Cortez",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/07/05/joe-biden-urges-caution-policies-way-left-democrats-aoc/1660272001/",
      "subtitle": "Biden urges caution about policies of 'way left' Democrats, Ocasio-Cortez",
      "author": "Rebecca Morin",
      "content": " WASHINGTON – Former Vice President Joe Biden sounded a note of caution Friday about progressive Democrats and their policies, saying that Democratic voters are more \"center-left\" and not \"way left.\" During an interview with CNN broadcast Friday, Biden pointed to a number of moderate Democrats who won swing districts during the 2018 midterms. \"That's what this election is about. I'm happy to debate that issue and all those issues with my friends because guess what, look who won the races. Look who won last time out,\" Biden said. Throughout the Democratic presidential primary race, Biden has continued to tout his more moderate proposals as some other 2020 Democrats have announced their support for more left-leaning ideas, such as Medicare for all. Biden does not support Medicare for all. He said his plan includes keeping private insurance while allowing people to opt in to Medicare if they would like. The former vice president also downplayed last year's electoral victory by Rep. Alexandria Ocasio-Cortez, D-N.Y. \"By the way, I think Ocasio-Cortez is a brilliant, bright woman, but she won a primary,\" Bidden said. \"In the general election fights, who won? Mainstream Democrats who are very progressive on social issues and very strong on education and health care.\" More:Joe Biden says that he wasn't prepared for Kamala Harris' criticism on segregation and busing More:Elizabeth Warren's 35,000 selfies aren't just for kicks; they're a campaign strategy Ocasio-Cortez, 29, had a stunning upset during the 2018 primaries against former Democratic Rep. Joe Crowley, who served in the House for 10 terms. The district is predominately Democratic and Ocasio-Cortez won the general election with 78% of the vote. Since then, Ocasio-Cortez has become the face of the new progressive lawmakers elected to the House of Representatives. Sen. Bernie Sanders, who is also running for the Democratic presidential nomination, retweeted a clip of Biden's comments and said he was proud to work with Ocasio-Cortez. Sanders has endorsed the New York Democrat's Green New Deal. The two lawmakers have also introduced legislation that would impose a 15 percent interest rate cap on all consumer loans. \"I’m proud to be working with @AOC and so many other Democrats to pass Medicare for All, debt free college and a Green New Deal,\" he tweeted. \"This is the agenda America needs — and that will energize voters to defeat Donald Trump.\" Ocasio-Cortez retweeted Sanders and then added a thank to the Vermont senator: \"Thank you, @SenSanders. It’s an honor to work alongside you and the millions of other people fighting for education, healthcare, and a living wage as rights.\" However, during the 2018 midterms, many of the Democrats who flipped districts were more moderate. And those moderate Democrats helped the party flip key House districts from Republican hands, according to analysis from Vox. Biden described the Democratic Party as moderate. \"Look, it's center-left, that's where I am,\" he said. \"Where it's not is way left.\" Like what you’re reading?:Download the USA TODAY app for more",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "In California's 2020 primary, Latino voters could help Democrats defeat President Trump",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/11/14/california-primary-2020-latinos-show-up-defeat-donald-trump/2522987001/",
      "subtitle": "In California's 2020 primary, Latino voters could help Democrats defeat President Trump",
      "author": "Marco della Cava",
      "content": " SAN FRANCISCO – On a recent Sunday, Victor Garcia left his Silicon Valley apartment and traveled an hour north to attend a rally by Democratic presidential candidate Andrew Yang. Garcia, a 20-year-old political science major, is eager to vote both in the November 2020 election and in California’s moved-up primary on March 3. But as curious as he is about Yang, a passionate proponent of a monthly $1,000 Universal Basic Income payment, Garcia is still candidate-shopping. He wants to see which politician is most attuned to issues that concern the state’s growing Latino population. “This election is really important,” Garcia says as a largely youthful crowd gathers at Civic Center Plazain San Francisco ahead of Yang's speech. “That said, most candidates really aren’t reaching out to us yet.\" With California's earlier primary date giving the state newfound clout in choosing who takes on President Donald Trump, political experts say presidential hopefuls would do well to step up their courtship of the Golden State’s increasingly powerful Latino voters. According to the Pew Research Center, not only are Latinos the majority-minority, with 39% (or 15 million) of the state's 40 million residents, but they also represent roughly a third of the state’s eligible voters (at 7.7 million). While Latino voter turnout lags that of other ethnicities – 45% of Latino adults are likely to vote, compared with 68% of whites, according to the Public Policy Institute of California – those numbers have been shifting. In the 2018 midterms, contests that traditionally draw fewer voters than general elections, Latino voter turnout hit 36%, a doubling from 2014 that helped California Democratic candidates flip seven perennially Republican House seats. California Democrats gather:Here's what you need to know And Latino turnout expectations are heightened for the 2020 presidential election. At play not only are robust voter registration efforts aimed at a heavily Democratic constituency – 58% register as Democrats, compared with 15% who register as Republicans – but also a powerful resentment of Trump, whose disapproval rating hovers at 70% among Latinos, according to the Public Policy Institute of California. According to a Nov. 13 statewide Latino Decisions poll commissioned by the Latino Community Foundation, 74% of registered Latino voters say they plan to vote in the March 3 primary. Concerns about racism was cited by 76% of respondents. The poll also reveals that 31% planned to vote for Vermont Sen. Bernie Sanders, 22% for former Vice President Joe Biden and 11% for Massachusetts Sen. Elizabeth Warren. Former Housing and Urban Development Secretary Julian Castro came in at 9%, and California Sen. Kamala Harris was at 8%. “The message we want all Latinos to hear is that they have the power to determine who is going to run against Trump and who will win in November,” says Jacqueline Martinez Garcel, CEO of San Francisco- based Latino Community Foundation, which is working to get out the Latino vote across the state. “The political climate we are in has awoken a new generation of voters,” she says. “I hate the term sleeping giant, because we’ve been working, not sleeping. Now the candidates have to engage.” Democrats making a run for the White House will have an opportunity to lock in Garcia’s vote on Nov. 16 in Long Beach, California, site of a televised Univision forum that will include Harris, Warren, Sanders, Castro, South Bend, Indiana, Mayor Pete Buttigieg and entrepreneur Yang. The event represents a rare in-state gathering by candidates who by and large have been visiting California mostly for lucrative private fundraising trips. Many have so far focused their campaigning on Iowa and other early battleground states. In fact, Biden has skipped all events hosted by the state’s Democratic Party –  but has attended posh donor events up and down the state. He recently announced he would not be at the state’s party convention in Long Beach Nov. 15 through 17. Rounding out the Univision forum's field of eight – and serving as last-minute replacements for original invitees Biden, Warren and former Texas Congressman Beto O'Rourke, who ended his once-promising campaign Nov. 1 – will be billionaire Tom Steyer, New Jersey Sen. Cory Booker and Minnesota Sen. Amy Klobuchar. The cost of not grabbing the attention of Latinos across the state is high, says Mindy Romero, director of the California Civic Engagement Project at the University of Southern California’s Sol Price School of Public Policy. “A presidential candidate cannot win California without getting a very significant portion of the Latino population, so ignoring outreach here is a huge strategic mistake,” Romero says. USA TODAY reached out to the campaigns of all those initially invited to the upcoming Univision forum to talk about Latino voters in California. Yang’s team was the only one to arrange an interview. “As a child of immigrants, I appreciate that communities may have unique issues,” Yang tells USA TODAY in a makeshift greenroom just off Mission Street that by night is a chic cocktail bar. “But my campaign focuses on topics that affect all of us.” Yang says that by highlighting the coming negative effects of automation on retail, transportation and food service jobs, he is in fact directly addressing the concerns of Latino voters. “Many communities will be adversely affected by this coming economic natural disaster,” Yang says. “But those who will suffer the most will be people of color.” So who has the edge? A recent Telemundo poll of Latino voters nationally showed Biden leading with 26%, followed by Sanders at 18% and Warren at 10%. The next closest was Harris at 3%. But 36% of Latino voters said they were undecided. Those findings largely were borne out in conversations with a range of California Latino leaders, from the state’s top law enforcement official to a popular radio deejay. “Most Latinos certainly know who Joe Biden is, so he’ll get solid support, especially from the older generation,” says Xavier Becerra, the state's first Latino attorney general. His office has sued the Trump administration more than 60 times on a range of issues. Becerra says that for many Latino voters, name recognition is key. “Four years ago, I was campaigning for Hillary (Clinton) and Sanders was having a tough time gaining traction with Latinos, and now he’s way up there,” he says. “What that shows is Latinos, like others, want to know who you are before they turn to you.” Interest in Sanders and Warren indicates Latinos are “trending on the progressive side, which makes sense when you see the growth of younger voters,” Becerra says. Currently, 44% of eligible Latino voters are in the millennial age bracket, 18 to 33, according to Pew. Chuy Gomez, a longtime Bay Area radio broadcaster, often has the ear of younger Latino voters. “A lot of people I speak with want Bernie in,” Gomez says. “He speaks to the common folks, the workers. He’s anti-rich.” Assemblywoman Lorena Gonzalez, D-San Diego, who is also chair of the California Latino Legislative Caucus, has endorsed Warren. “She talks about bread and butter issues in a Midwest way, but it’s all about paying the rent, getting more power as a worker, and our community relates to those issues,” she says. When asked about Julian Castro, the lone Latino in the shrinking cluster of Democratic candidates, many say that while Latinos instantly relate to a man with a familiar last name and life story, that doesn’t necessarily mean he has their vote. “We want Castro in the race because he lives like us and represents us, so him being president is secondary to him just being on that stage,” Gonzalez says. “We should be an example for the nation. We were scapegoated by this president as a way to win the last election. So we want to help galvanize Latinos everywhere to vote.” Political pundits often like to talk about voters being driven largely by specific issues. But conversations with Latinos make it clear this is not a monolithic group. In fact, they hold a range of views, from progressive to conservative, and care about a rainbow of issues ranging from income inequality to climate change. “There is no issue that is not a Latino issue,” says Alex Padilla, California’s secretary of state who is also the first Latino to hold that position. “We want what everyone else wants. An opportunity for a good-paying job, access to health care, safe neighborhoods, affordable housing. Our dream is the American dream.” Padilla says many Latinos see that dream as increasingly under threat by the Trump administration, which has appealed to its base by attacking illegal immigration and calling for tougher security at the Mexican border. That, however, has served only to galvanize Latinos in a way that reminds Padilla of California’s Proposition 187, which was passed by the state’s voters 25 years ago this month. Prop 187 denied undocumented immigrants access to health care and education. Although a day later the proposition was ruled unconstitutional, it created a movement that eventually saw 1 million California Latinos become citizens and arguably launched the ethnic group on a path toward increased power at the polls. Latino political activists agree that while the debate over illegal immigration is deeply upsetting to Latinos, candidates would be making a mistake if they focused their messaging on this one topic. “It’s very important for these candidates to understand that it is not the case that if you know what one Latino wants, you know what we all want,” says Latino Community Foundation CEO Martinez Garcel. “For example, I’m a Dominican from New York, so when I hear AOC (progressive New York congresswoman Alexandria Ocasio-Cortez) speak, I don’t hear socialism, I hear policies that care about the poor,” she says. “You have to know who you’re talking to.” Another mistake for candidates would be displaying a level of sympathy that teeters into pity. “Sometimes presidential candidates don’t talk about Latinos in uplifting ways but just as victims, and we need to challenge that image,” says Sarah Souza, president of the San Francisco Latino Democratic Club, the first DACA recipient (Deferred Action for Childhood Arrivals), or \"Dreamer,\" to be appointed to the post. Souza, who originally is from Brazil, says candidates who push for access to home ownership and financial resources for Latinos will find a ready audience. “We want economic opportunities just like everyone else,” says Souza, adding that she supports Castro, Sanders and Warren. “They’re the most progressive and have an agenda that is for people of color, a group that has long been a target when it comes to economic equity.” For Alma Beltran, mayor of Parlier, California, just south of the agricultural mecca of Fresno, the upcoming primary and general election are about restoring opportunity and dignity to the lives of her 15,000 constituents – 98.8% of whom are Latino, including her and the entire City Council. Though times are tough in Parlier because of scarce economic opportunities and looming water quality issues, Beltran finds encouragement in the younger generation. “I talk to some people who will say ‘It won’t make a difference if I vote,’ but then I run into young people like my son, who is 17 and told me when he gets older he wants to run for office,” Beltran says. “You think maybe they don’t understand what’s going on, but they’re watching. They’re the people who will make a difference.” The crowd waiting for Yang at Civic Center Plaza is in fact mostly younger. Signs invariably tout the merits of his basic income plan, while most of the baseball caps say, \"MATH,\" a play off Trump's MAGA slogan that stands for Make America Think Harder. Marching with a smile is Eliana Jaramillo. Her large sign features a cartoon drawing of Yang as Uncle Sam, and in Spanish it reads, “Universal Basic Income: I want you to have $1,000 a month.” Jaramillo says she was drawn to Yang’s campaign specifically because that kind of stipend would have allowed her and her two children to flee an abusive relationship sooner. “I’m marching in the hope that other women don’t have to go through what I did,” she says. Nearby, Milo Alvarez bops up and down on his toes as he tries to get his infant son to sleep in his chest-mounted sling. “I was a Bernie fan, but now I like Yang because I love this idea of a universal basic income,” says Alvarez, a scooter repairman from Daly City just south of San Francisco. Alvarez reels off the other issues that are important to him, including health care and climate change. He says he doesn’t particularly mind if candidates don't appeal to him specifically as a Latino. “I care about the issues, which cut across a lot of ethnicities,” he says. Whether a broad political appeal, like that made by Yang, will be enough to woo California's Latino voters come the elections in March and November remains to be seen. California Secretary of State Padilla suggests it may not be. “You cannot compete in California without paying deep respect and responding to the Latino community,” he says. “Bottom line.” Follow USA TODAY national correspondent Marco della Cava: @marcodellacava",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "GOP embraces impeachment fight in 2020 ads, betting Trump inquiry will backfire on Democrats",
      "url": "https://www.usatoday.com/story/news/politics/2019/11/02/donald-trump-impeachment-republicans-embrace-fight-2020-ads/4114206002/",
      "subtitle": "GOP embraces impeachment fight in 2020 ads, betting Trump inquiry will backfire on Democrats",
      "author": "John Fritze",
      "content": "   WASHINGTON – President Donald Trump delivered a warning to Democrats during a raucous Minnesota rally last month: The impeachment inquiry, he predicted, would backfire in next year's election. \"The Democrats' brazen attempt to overthrow our government will produce a backlash at the ballot box,\" Trump said at the time. \"We will defeat them.\" Nearly a month later, as the White House prepares for the next phase of the investigation, the president's combative remarks in Minneapolis have emerged as a central theme in Republican advertising as groups loyal to Trump gamble that his woes will be an asset rather than a hindrance next November. Far from avoiding the impeachment inquiry, or the president’s now infamous call with Ukrainian President Volodymyr Zelensky, Republican groups are hammering vulnerable Democrats in digital and television ads for abandoning pocketbook issues in favor of what they describe as a relentless drive to remove Trump from office. Republican political strategist Ron Bonjean said GOP groups are moving away from attacking the impeachment process to accusing Democrats of playing politics. “You’re either defining this environment right now or you’re going to get defined by it politically,” Bonjean said. Trump’s campaign spent more than $1 million on Facebook ads in October that mentioned “impeachment,” according to an analysis by Bully Pulpit Interactive, a Democratic group. But while the Trump campaign was the largest player, it was far from alone. Senate Majority Leader Mitch McConnell, R-Ky., and the campaign arm of Senate Republicans spent nearly $200,000 on Facebook ads referring to impeachment during that same time. The Congressional Leadership Fund, a super PAC with ties to House GOP leaders, launched a new digital ad campaign soon after the House voted Thursday to formalize the impeachment investigation. The ads, aimed at Democratic-held districts Trump carried in 2016, tell voters that “your member of Congress just voted for impeachment!\" Explainer:What comes next in the Trump impeachment inquiry? With a sepia-toned photo of an angry-looking House Speaker Nancy Pelosi, the ads slam Democrats for focusing on impeachment at the expense of health care, the economy and infrastructure. The ad fails to mention the Trump administration made little progress on health or infrastructure during its first two years, when Republicans controlled both chambers of Congress. The anti-tax group Club for Growth, meanwhile, is running digital ads focused on impeachment in House districts in Virginia, California, Illinois and New Mexico. Those ads have embraced the theme that Democrats are giving up on “real problems” to focus instead on “impeachment, all the time.\" \"There’s a reason Pelosi has been hesitant to make impeachment official,\" said David McIntosh, the group's president. \"She knows the evidence doesn’t meet their charges and it will be a political liability.\" Underscoring that they believe the politics of impeachment are on their side, aides at the campaign arm for House Republicans sent packing boxes to House Democrats this week. The boxes were adorned with bows and a message that read \"Get packing!\" At the national level, the Trump and the Republican National Committee have spent more than $10 million on that message. Following the announcement of the impeachment inquiry, the RNC launched an anti-impeachment campaign called \"Stop the Madness,\" targeting House Democrats up for re-election in 2020. Trump’s campaign aired a television ad during the World Series this week that touted the economy and the recent U.S. special forces raid in Syria that killed Abu Bakr al-Baghdad. “He’s no Mr. Nice guy,” the ad’s narrator says of the president. “But sometimes it takes a Donald Trump to change Washington.” Similar messages are running in down ballot races as well. A campaign ad for Kentucky Gov. Matt Bevin, a Republican up for re-election on Tuesday, also cites impeachment, portraying Bevin's opponent, Democrat Andy Beshear, as a backward liberal whose “top supporters want to impeach our president.” A separate spot paid for by an affiliate of the Republican Governors’ Association goes further, claiming Bevin and Trump “are making Kentucky great again” while painting Beshear, the state’s attorney general, as part of the effort to bring Trump down. “Socialists in Washington want to impeach Trump and take us backward,” the narrator says as photos of an angry-looking Massachusetts Sen. Elizabeth Warren, Vermont Sen. Bernie Sanders and New York Rep. Alexandria Ocasio-Cortez appear on the screen. The effort comes as polling indicates the nation is as sharply divided on impeachment as it is on many other issues facing Congress. Nearly four in 10 Americans said Trump’s phone call with the Ukrainian president was itself an impeachable offense, according to a recent USA TODAY/Suffolk University Poll. Another 31% said there was nothing wrong with the conversation, echoing Trump’s insistence that his conversation with Zelensky was \"perfect.\" Just over 20% of Americans said the call was “wrong” but doesn’t rise to an impeachable offense. Democratic groups that engage in elections have, so far, been more reticent to bring up impeachment in their own advertising. Presidential candidate Tom Steyer, who in 2017 founded a grassroots effort to impeach Trump called Need to Impeach, has spent nearly $600,000 on Facebook ads mentioning the word “impeachment” this month, according to the Bully Pulpit analysis. That group is also airing television ads targeting four Republican senators – Sens. Susan Collins of Maine, Joni Ernst of Iowa, Cory Gardner of Colorado and Martha McSally of Arizona – in case a Trump impeachment goes to a Senate trial. Warren, a frontrunner for the Democratic nomination, doled out nearly $70,000 on Facebook ads referencing impeachment last month. \"It’s time for Congress to step up and begin impeachment proceedings,” one Warren ad bluntly says. “No president is above the law,” another reads. One of the largest pro-impeachment digital ad buyers isn’t a candidate at all but rather the executive of a Wisconsin-based spice company. Bill Penzey of Penzeys Spices, an outspoken Trump critic, spent nearly $500,000 on impeachment ads on Facebook last month. In a lengthy ad, Penzey describes Trump as a “liar” and a “cheater.” “Next time shorter,” the Penzey ad concludes, “and with recipes, too! I promise.” Read more:Wisconsin's Penzeys Spices raises $435,000 for Trump impeachment ads A Democratic strategist with knowledge of the party’s approach who spoke on condition of anonymity to discuss internal tactics said the lack of traditional Democratic groups engaging doesn’t reflect a party afraid to discuss the issue. Rather, the strategist said, Democrats don’t want to be accused of attempting to politicize the impeachment investigation. But that has left a void for Republicans to fill. “There are a lot of people out there who voted for Donald Trump to be president of the United States who feel that they’re basically taking the vote away,” said Mike Thompson, a 44-year-old Florida man whose East Lee County Republican Club recently took out a small ad on Facebook calling the House vote a “motivating” event for the GOP. “It’s time to get fired up and start pushing back.” Beto O'Rourke:Beto O'Rourke ends his bid for the presidency Jobs report:Trump boasts of 'blowout' 303,000 jobs report, leading economists to puzzle over his math",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Ocasio-Cortez thinks DHS should be abolished, and other items from her New Yorker interview",
      "url": "https://www.usatoday.com/story/news/politics/2019/07/10/ocasio-cortez-department-hs-should-abolished/1698439001/",
      "subtitle": "Ocasio-Cortez thinks DHS should be abolished, and other items from her New Yorker interview",
      "author": "Rebecca Morin",
      "content": " WASHINGTON – Rep. Alexandria Ocasio-Cortez has been outspoken about the Trump administration's treatment of migrants crossing into the U.S. via the southern border with Mexico and about undocumented immigrants living in the United States currently. The New York Democrat has repeatedly called for U.S. Immigration and Customs Enforcement (ICE) to be abolished. And now, Ocasio-Cortez says she thinks that the Department of Homeland Security, which has jurisdiction over ICE, should be eliminated as well. ‘They tore out a piece of my heart’:Migrant mother describes toddler’s illness, death In an interview with the New Yorker, the progressive lawmaker said she believes the core structure of ICE and the DHS \"are extrajudicial, that they lack effective oversight\" and \"it is baked into the core foundational structure of these agencies.\" When asked whether she would get rid of DHS, she said: \"I think so.\" \"I think we need to undo a lot of the egregious mistakes that the Bush Administration did,\" she said. \"I feel like it is a very qualified and supported position, at least in terms of evidence and in terms of being able to make the argument that we never should have created D.H.S., in the early 2000s.\" Amid intra-party bickering between House Speaker Nancy Pelosi and several freshmen congresswomen, including Ocasio-Cortez, the New York Democrat said she doesn't believe she really has a relationship with the House speaker. \"I think sometimes people think that we have this, like, we have a relationship,\" she said during the interview. When asked whether she does, Ocasio-Cortez said: \"Not particularly.\" \"Not one that’s, I think, distinguished from anyone else,\" she said. More:Pelosi after quarrels with AOC, Tlaib: 'You got a complaint? You come and talk to me about it' She added that the last time she spoke to Pelosi one-on-one was when the House speaker asked her to join the select committee on climate change. Ocasio-Cortez said she did not join the panel because she had several requests regarding the committee which were not accommodated: that the committee have a legislative mission that included drafting legislation by 2020, that it have subpoena power and that members of the select committee not take any money from the fossil fuel industry. In addition, she said that her committee assignments that she was ultimately given have been \"very intense and very rigorous.\" Ocasio-Cortez serves on the House Financial Services Committee and the House Oversight Committee. \"I was assigned to two of some of the busiest committees and four subcommittees,\" she said. \"So my hands are full.\" \"And sometimes I wonder if they’re trying to keep me busy,\" she added, laughing. In 2016, Ocasio-Cortez was an organizer for Bernie Sanders' presidential campaign. Now the Vermont senator is running again, but Ocasio-Cortez has not endorsed him just yet. However, she has worked on legislation with him and Sen. Elizabeth Warren, who is also seeking the Democratic presidential nomination. Ocasio-Cortez said she has been approached by several candidates seeking her endorsement. She said she tells them all the same thing: “I’m not endorsing anybody for some time.” \"I certainly don’t want to endorse anyone this year,\" she said, but she noted that she will likely make an endorsement before the Democratic nomination is locked in. \"You know, I think we need to have debates. I think we need to have a national conversation. And also, I need to do my job.\" Ocasio-Cortez also commented on former Vice President Joe Biden's and Sen. Kamala Harris' debate performance late last month. The freshman congresswoman said she thinks it was fair that Harris confronted Biden on his comments about working with segregationist Democrats during his time in Congress and about his stance on busing decades ago. More:Penalizing candidates who interrupt, and other changes coming to the Democratic debates \"I absolutely think she was fair,\" Ocasio-Cortez said of Harris. \"And I think this is also part of a larger discussion, and that issues of race and gender are not extra-credit points in being a good Democrat. They are a core part of the competencies that a President needs.\" However, the New York Democrat said that past criticism of Harris has been warranted and she wants to learn about the California senator's worldview. Ocasio-Cortez said that Biden's debate performance called into question whether he is capable of being president due to his age. \"His performance on the stage kind of raised some questions with respect to that,\" she said. Biden is 76 years old. However, if Biden is the Democratic nominee, Ocasio-Cortez said \"I will do what I can\" to help beat President Donald Trump in 2020. \"Well, we need to defeat this President.\" she told the New Yorker, \"And so, to the extent that I could be helpful in that, you know, I will do what I can.\" Like what you’re reading?:Download the USA TODAY app for more",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "'Once Upon A Time in Hollywood,' 9/11 first responders bill, Pelosi and Ocasio-Cortez meet: 5 things to know Friday",
      "url": "https://www.usatoday.com/story/news/2019/07/26/once-upon-a-time-in-hollywood-911-first-responders-pelosi-ocasio-cortez/1821363001/",
      "subtitle": "'Once Upon A Time in Hollywood,' 9/11 first responders bill, Pelosi and Ocasio-Cortez meet: 5 things to know Friday",
      "author": "",
      "content": "President Donald Trump is set to sign a bill at the White House on Friday that compensates 9/11 first responders who suffered illnesses, injuries and other medical problems as a result of their service. The measure supplies money for a compensation fund for firefighters, police officers and other emergency personnel who worked on the scene in New York City in the aftermath of the terrorist attacks of Sept. 11, 2001. The bill passed the Senate earlier this week by a margin of 97-2, despite attempts by Sen. Rand Paul, R-Ky., and Sen. Mike Lee, R-Utah, to offset the costs and add amendments. Trump will sign it into law during a ceremony with dozens of first responders, but one high-profile advocate won’t be there. Comedian and longtime first-responder activist Jon Stewart will reportedly be on vacation. After weeks of public friction, high-profile Democrats House Speaker Nancy Pelosi (California) and Rep. Alexandria Ocasio-Cortez (New York) are scheduled to meet face-to-face Friday in Washington, DC. Pelosi said she's \"looking forward\" to the meeting and Ocasio-Cortez added it is \"nothing too climactic.\" Signs of tension between the two have arisen since Ocasio-Cortez's arrival in January, but they appeared to boil over after Ocasio-Cortez and three other first-year congresswomen from the party's progressive wing known as the \"Squad\" were the only Democrats to vote against a version of a border funding bill that Pelosi promoted. Pelosi and Ocasio-Cortez have appeared to unify in recent days after President Donald Trump unleashed a series of racist attacks against the Squad. Prefer to listen? Check out the 5 things podcast Quentin Tarantino’s “Once Upon A Time in Hollywood,” hitting theaters Friday, fulfilling the promise of its title as a throwback fairy tale with two fictional showbiz buddies that just so happens to coincide with one of the most infamous killing sprees of the 20th century. Tarantino's vision of 1969 Hollywood feels authentic and alive, with a lot of that electricity running through leads Leonardo DiCaprio and Brad Pitt, plus an inspired, understated performance by Academy Award-nominated actress Margot Robbie as Sharon Tate. Robbie said she feels the weight of playing actress Tate, who was killed by the Manson family in 1969. “It was immensely important for me to honor Sharon’s generous spirit,” she said. Kathy Zhu, a vocal supporter of President Donald Trump, has been added to the program for a July 26 luncheon in Bloomfield Hills hosted by the Michigan Conservative Coalition. Miss World America stripped Zhu of her title and connection with the organization after officials learned about several posts on Zhu's Twitter account they deemed \"offensive, insensitive and inappropriate.\" Zhu has defended herself publicly in interviews, saying she stands by every tweet she has posted because she has never said anything wrong. ESPN TV and radio personality Dan Le Batard will return to his television show \"Highly Questionable\" Friday after  breaking the network's \"no pure politics\" policy a week ago with an on-air rant calling out President Donald Trump. Le Batard condemned the \"send her back\" chants that targeted Democratic congresswoman Ilhan Omar during a Trump rally in North Carolina and how ESPN has approached the subject since Jemele Hill's exit. Several days before that event, Trump tweeted that Omar and other progressive congresswomen of color should \"go back and help fix the totally broken and crime-infested places from which they came.\" Le Batard, 50, who is the son of Cuban immigrants, said the chanting \"felt un-American\" and he blamed Trump. He will also resume his hosting role on ESPN Radio's \"Dan Le Batard Show\" Monday.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez, Ilhan Omar and Rashida Tlaib fire back at Nancy Pelosi's 'Twitter world' quip",
      "url": "https://www.usatoday.com/story/news/politics/2019/07/08/ocasio-cortez-omar-tlaib-respond-pelosi-criticism/1671204001/",
      "subtitle": "Alexandria Ocasio-Cortez, Ilhan Omar and Rashida Tlaib fire back at Nancy Pelosi's 'Twitter world' quip",
      "author": "William Cummings",
      "content": " A group of freshman Democratic congresswomen responded on social media this weekend to criticism from House Speaker Nancy Pelosi, who dismissed them and \"their Twitter world\" in an interview with The New York Times. Columnist Maureen Dowd asked Pelosi about the opposition to a border funding bill from Reps. Alexandria Ocasio-Cortez, D-N.Y.; Ilhan Omar, D-Minn.; Ayanna Pressley, D-Mass.; and Rashida Tlaib, D-Mich. Pelosi said \"our bill\" was the best Democrats could do. She criticized the four liberal freshman – whom Dowd referred to as \"the Squad\" – for being the only members of their party to vote against the original version of the legislation passed by the Democratic-led House, which included some protections for migrant children. \"All these people have their public whatever and their Twitter world,\" Pelosi said, according to Dowd. \"But they didn’t have any following. They’re four people and that’s how many votes they got.\" The response was swift. \"That public 'whatever' is called public sentiment,\" Ocasio-Cortez fired back on Twitter. \"And wielding the power to shift it is how we actually achieve meaningful change in this country.\" 'Children come first':House passes $4.6 billion in aid for migrants at border after Pelosi caves to Republicans More:AOC criticizes CBP after report of secret Facebook group as agency opens investigation \"I don’t believe it was a good idea for Dems to blindly trust the Trump admin when so many kids have died in their custody,\" Ocasio-Cortez said, explaining her opposition to the legislation. \"It’s a huge mistake. This admin also refuses to hand over docs to Congress on the whereabouts of families. People’s lives are getting bargained, & for what?\" The House version of the border funding bill was rejected by the Republican-led Senate. Pelosi then capitulated and agreed to join the moderates in her party in passing the Senate version of the $4.6 billion bill. Ninety-five Democrats bucked their leader and voted against that version, with another 10 not voting. Pelosi said she \"reluctantly\" decided to back the Senate version of the bill because \"the children come first\" and the emergency funding was needed to get resources to help the mass of migrant children arriving at the U.S.-Mexico border. Pelosi told Dowd that the blame should go to Senate Majority Leader Mitch McConnell, R-Ky., whom she called \"authentically terrible.\" \"With all due respect, the press likes to make a story that is more about Democrats divided than the fact that Mitch McConnell doesn’t care about the children,\" she said. Migrant children's haunting drawings:'These children coming into our country need a voice,' doctor says The stuff of nightmares:Inside the migrant detention center in Clint, Texas 'They are run beautifully':Trump responds to report describing dangerous conditions at detention facilities Ocasio-Cortez's chief of staff Saikat Chakrabarti said on Twitter that the four Democrats had opposed Pelosi's version of the bill because they did not trust a promise he says McConnell made to Pelosi that he would pass the House version of the bill. \"Nah. It is deeper than that,\" Tlaib wrote in response to Chakrabarti's tweet. \"Why would we fund a broken system that rips children away from their parents, deny asylum seekers due process & fuels a racist ideology that dehumanizes people?\" Tlaib also retweeted two posts that fired back at Pelosi's comment to Dowd, including one from immigrants right advocate Greisa Martínez Rosas who said, \"The strategy is simple: Don’t fall for lies. Play to Win,\" and another from Washington Post reporter Jeff Stein that pointed out the \"pivotal policy proposals\" authored by each member of \"The Squad.\" Democratic divisions:Biden urges caution about policies of 'way left' Democrats, Ocasio-Cortez Stein's tweet was also shared by Omar, who responded to Ocasio-Cortez's post about Pelosi's comments with a cry of \"Patetico!\" – apparently referring to the Spanish word for \"pathetic.\" \"You know they’re just salty about WHO is wielding the power to shift 'public sentiment' these days, sis. Sorry not sorry,\" Omar tweeted. Ocasio-Cortez, the youngest woman ever elected to Congress, also took issue with Pelosi's dismissal of Twitter, saying the speaker would \"rather campaign like it’s 2008.\" \"I find it strange when members act as though social media isn’t important,\" she said before using emojis to slam conventional campaigning, which spends millions of dollars on television advertising. \"I haven’t dialed for dollars *once* this year, & have more time to do my actual job,\" Ocasio-Cortez tweeted. Exclusive:How Nancy Pelosi is leading divided Democrats through political turmoil More:Nancy Pelosi wants Trump 'in prison' but not impeached",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "'We need answers. Lots of them.': Congress calls for investigations after Jeffrey Epstein's death",
      "url": "https://www.usatoday.com/story/news/politics/2019/08/10/jeffrey-epstein-death-congress-members-call-investigation/1975275001/",
      "subtitle": "'We need answers. Lots of them.': Congress calls for investigations after Jeffrey Epstein's death",
      "author": "Nicholas Wu",
      "content": " WASHINGTON – Several members of Congress are calling for investigations following the apparent suicide of Jeffrey Epstein, the disgraced financier who faced federal sex trafficking charges before his death. Epstein was found \"unresponsive in his cell\" about 6:39 a.m. Saturday and given life-saving measures. He was later transported from Metropolitan Correctional Center in Manhattan to a hospital where he was pronounced dead, according to a statement by the MCC, which is part of the Federal Bureau of Prisons. The Bureau of Prisons said the FBI would be investigating the incident. Attorney General William Barr said he was \"appalled\" to hear about Epstein's suicide and added that Epstein's death \"raises serious questions that must be answered.\" Barr said the Department of Justice Inspector General would open an investigation in addition to the FBI investigation. More:Disgraced financier Jeffrey Epstein, awaiting sex trafficking charges, dead of apparent suicide More:Jeffrey Epstein 'misappropriated vast sums of money,' billionaire Leslie Wexner alleges Lawmakers want answers over what led to Epstein's death while reiterating the need to probe a controversial plea deal he struck with former Labor secretary Alex Acosta. Democratic Rep. Lois Frankel said Epstein's death did not mean the investigation into his controversial plea deal in 2007 would end. Frankel represents Palm Beach, Fla., where Epstein owned a home and where prosecutors say he sexually abused dozens of minor girls. \"With the obvious end to criminal proceedings against Epstein, it is important that the US House Committee on Oversight and Reform begin its investigation,\" she wrote, reiterating her prior calls for an investigation into Epstein's plea deal. Rep. Jared Huffman, D-Calif., said the \"Trump DOJ cannot be trusted to take it from here\" and called for an independent investigation into Epstein's death. Epstein had been accused of sexually abusing \"dozens of minor girls\" in his homes in Manhattan and Palm Beach from 2002 to 2005. A Miami Herald investigation in November 2018 revealed Acosta had been directly involved in negotiating a plea deal with Epstein's lawyers in 2007. Acosta had brokered a deal with Epstein that allowed him to avoid a longer prison sentence and federal sex-trafficking charges, a sentence many considered light. Epstein pleaded guilty to state felony prostitution charges and agreed to pay restitution to his victims, register as a sex offender and serve 13 months in county jail. While serving his jail term, Epstein was permitted to leave the jail to work for 12 hours a day, six days a week. More:Trump's Labor Secretary Alexander Acosta resigns amid Epstein plea fallout Facing backlash to the deal and calls to step down, Acosta resigned as President Donald Trump's Labor secretary shortly after Epstein was indicted again in July. Rep. Jackie Speier, D-Calif., also renewed her calls for an Oversight Committee investigation. \"Jeffrey Epstein was a serial child molester who evaded accountability because he was rich, powerful & well-connected,\" she wrote on Twitter. \"We need answers. Most importantly, we need justice for his victims. Oversight must investigate.\" Rep. Al Green, D-Texas, called Epstein's suicide an \"impossibility\" that needed further congressional investigation. \"When an impossibility occurs involving powerful people and possible criminality there must be an investigation to end speculation,\" Green wrote. \"Because the public has a right to know, I’m calling for a congressional investigation.\" More:'She should be shot': Ohio man charged after Facebook threat against Ocasio-Cortez Sen. Ben Sasse., R-Neb., sent a letter to Barr saying that the Department of Justice\"should not have allowed this to happen.\" \"His death not only deprives his victims of the opportunity to confront him in court and to see him held accountable for his crimes, but also makes it harder to unravel his ring and to hold accountable the many other powerful men who raped and exploited these children,\" Sasse wrote. Sasse asked Barr for answers about Epstein's suicide, confirmation of the Department of Justice investigations into his death, and for the immediate securing of other evidence related to the case. More:Was Jeffrey Epstein on suicide watch when he died? How safeguards aren't foolproof Rep. Jerry Nadler, D-N.Y., said he welcomed the Department of Justice and FBI investigations, as \"there are many questions that need to be answered in this case.\" Rep. Alexandria Ocasio-Cortez, D-N.Y., voiced concern about Epstein's death. \"We need answers. Lots of them,\" she wrote on Twitter. She then retweeted a post from former federal prosecutor Renato Mariotti, in which Mariotti says that the criminal probe into Epstein would conclude because \"no one else was charged in the indictment.\" Sen. Rick Scott, R-Fla., called on the Bureau of Prisons to \"provide answers on what systemic failures of the MCC Manhattan or criminal acts allowed this coward to deny justice to his victims.\" Contributing: Doug Stanglin, Kevin McCoy",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Remembering Atatiana Jefferson, Brexit talks, Emmett Till memorial: 5 things to know this weekend",
      "url": "https://www.usatoday.com/story/news/2019/10/19/atatiana-jefferson-brexit-uaw-general-motors-bernie-sanders-emmett-till/3986930002/",
      "subtitle": "Remembering Atatiana Jefferson, Brexit talks, Emmett Till memorial: 5 things to know this weekend",
      "author": "",
      "content": "A public memorial is scheduled  Saturday for Atatiana Jefferson, who was shot and killed by a Fort Worth police officer in her family's home on Oct. 12 as she played video games with her nephew. On Friday, Dallas County Probate Court Judge Brenda Hull Thompson issued a temporary restraining order sought by Marquis Jefferson, the father of Jefferson. According to the Associated Press, the father sought the order to gain control over the funeral arrangements of his daughter from his daughter’s aunt, Bonita Body. Officer Aaron Dean was arrested Monday on a murder charge and freed hours later on $200,000 bond. Dean allegedly shot Jefferson, 28, through a bedroom window while responding to a neighbor's call that her door was open late at night. A eulogy will be delivered by TD Jakes and the Reverend Al Sharpton will make special remarks, according to WFAA. Prefer to listen? Check out the 5 things podcast and subscribe for free on Apple Podcasts: The vandalized memorial for slain civil rights icon Emmett Till will be replaced with a bulletproof sign in a ceremony Saturday following outrage over a photo of three University of Mississippi students posing with guns in front of the bullet-riddled marker. The new sign, which will be placed at the spot where the 14-year-old's body was pulled from the Tallahatchie River, will be open to the public but protected by a gate and security cameras, the Emmett Till Memorial Commission said. Till, 14, was tortured and murdered in 1955. An all-white, all-male jury in Mississippi acquitted two white men accused of the slaying. The memorial sign has been targeted repeatedly by vandals since it was first erected in 2008. Rep. Alexandria Ocasio-Cortez, D-N.Y., plans to endorse Democratic presidential candidate Bernie Sanders and appear with him at an event this weekend. Nina Turner, a former state senator and current Sanders campaign national co-chair, said that Ocasio-Cortez was returning the favor for the groundwork Sanders' campaign had laid in 2016. Sanders promoted the rally, which will take place in Queens, New York, during Tuesday's debate, along with the promise of a \"special guest.\" Ocasio-Cortez's district includes part of Queens, though the rally would take place right outside her district. The endorsement by the outspoken progressive could help the Sanders campaign, which has recently lagged in polls amid the rise of Sen. Elizabeth Warren, D-Mass., and questions about Sanders' health after he had a heart attack. This weekend, British lawmakers will do something they have only done four times since the outbreak of World War II: Sit in the House of Commons on a Saturday.They will debate and then vote on Prime Minister Boris Johnson's new deal to leave the European Union that won the backing of the bloc's leaders. If Johnson wins the vote, he will claim victory over a Brexit process that led to the resignation of his two predecessors (David Cameron and Theresa May). But Johnson's ruling Conservative Party doesn't have a majority in Britain's 650-seat Parliament. In order to win support for his Brexit deal, he will be relying on votes from other parties and independent lawmakers — while his allies in Northern Ireland are opposed to a deal and the three main opposition parties have pledged to vote it down.The vote is expeted after mid-morning East Coast Time. Ratification meetings are expected to start Saturday after the UAW National General Motors Council reached a tentative agreement with General Motors.  GM and the UAW reached a proposed tentative agreement on a new, four-year contract Wednesday, the 31st day of a nationwide strike. The union appears to have won on many of its goals, including a path to permanent employment for temporary autoworkers, a faster route to top pay for workers hired after 2007. But the biggest obvious loss for the union is the continued closure of the Lordstown Assembly Plant in Ohio — a sore point that former Lordstown workers said would cause them to vote against the deal.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "T-minus one year",
      "url": "https://www.usatoday.com/story/news/2019/11/04/trump-impeachment-inquiry-e-jean-carroll-airbnb-mondays-news/4156362002/",
      "subtitle": "T-minus one year",
      "author": "Ashley Shaffer",
      "content": " It's been quite the Monday for President Donald Trump: He's being sued for defamation. He revived \"covfefe.\" And he seemed delighted by Nationals catcher Kurt Suzuki wearing a \"MAGA\" hat at the White House. It's Ashley. Here's the latest news to know. But first, presidential elections are coming in hot: We are officially one year away from the 2020 presidential election. Here's what to expect over the next few months. ☑️ The Short List newsletter is a snappy USA TODAY news roundup. Subscribe here! The committees overseeing the impeachment inquiry of Trump released hundreds of pages of testimony Monday from the former ambassador to Ukraine, Marie Yovanovitch, and a former State Department adviser, Michael McKinley. Their testimonies were the first in a series of transcripts that will be released from closed-door depositions that are part of the inquiry into whether Trump abused his office by soliciting foreign interference in U.S. elections. Yovanovitch said that before her ouster, Gordon Sondland, the U.S. ambassador to the European Union, gave her some advice: Tweet her support of Trump. Four hundred and sixty-two inmates in Oklahoma were set to be released Monday after a law signed this year retroactively reduced the sentences for individuals who committed low-level crimes. Friday, Gov. Kevin Stitt’s office processed the recommendations for final approval. It is the largest mass commutation – or reduction of a sentencing – in U.S. history since President Barack Obama released 330 federal prisoners on his last day of office. The manhunt for the killer or killers who opened fire on a Halloween party at a California Airbnb rolled into Monday after the death toll rose to five and the short-term rental industry faced a series of rule changes. Since the tragic shooting, Airbnb's CEO has vowed to crack down on \"party houses\" – though the definition of \"party houses\" remains uncertain. Now people are asking how. Columnist E. Jean Carroll filed a defamation lawsuit Monday against Trump, who she said raped her in a department store dressing room more than 20 years ago. Carroll, 75, first went public with the allegation against Trump in June, before the release of her book \"What Do We Need Men For? A Modest Proposal,\" which contains a description of the alleged assault. Trump denied the allegation and accused Carroll of inventing it to boost book sales. \"It should be sold in the fiction section,\" Trump said. The lawsuit claims Trump's statements damaged Carroll's reputation and caused her professional harm. Shia LaBeouf voiced a profound show of gratitude during his speech at the Hollywood Film Awards on Sunday. Accepting a screenwriting award for his autobiographical film, \"Honey Boy,\" LaBeouf thanked the Georgia police officer who arrested him for public drunkenness in 2017. \"I want to thank the police officer who arrested me in Georgia,\" said LaBeouf, who carried on speaking over laughs from members in the audience who thought he was joking. \"For changing my life.\" LaBeouf, who is now sober, used time during his court-ordered rehab after the arrest to write the script. 🚘 How close are we to seeing flying cars? 💰 Ready to invest in individual stocks? Ask these 5 questions. 🧀 You're probably grating your cheese wrong. This is a compilation of stories from across the USA TODAY Network.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "AOC calls out McConnell after photo shows 'Team Mitch' supporters 'groping and choking' cardboard cutout",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/08/06/aoc-criticizes-mcconnell-after-social-media-post-cardboard-cutout/1930780001/",
      "subtitle": "AOC calls out McConnell after photo shows 'Team Mitch' supporters 'groping and choking' cardboard cutout",
      "author": "Sarah Ladd",
      "content": " Rep. Alexandria Ocasio-Cortez criticized Senate Majority Leader Mitch McConnell on Monday night, joining many others who've taken swings at the senator over the past few days. But her criticism was for a different reason. Ocasio-Cortez tweeted a photo that had been circulating on social media and tagged the senator. The photo shows a group of young men holding a cardboard cutout of Ocasio-Cortez with one of them making a choking gesture at the throat and another gesturing to kiss her cheek. The handle of the person who originally shared the photo was blacked out, but the caption reads, at least in part, \"break me off a piece of that.\" \"Hey @senatemajldr,\" Ocasio-Cortez tweeted in response to the photo, \"these young men look like they work for you. Just wanted to clarify: are you paying for young men to practice groping & choking members of Congress w/ your payroll, or is this just the standard culture of #TeamMitch? Thanks.\" McConnell's camp told the Washington Post it does not condone the image. In a statement, McConnell campaign manager Kevin Golden explained that the high school boys in the photo were not campaign staff. \"It’s incredible that the national media has sought to once again paint a target on their backs rather than report real, and significant news in our country,” the statement said. The photo comes after Amy McGrath, who hopes to unseat the senator in November 2020, criticized McConnell for posting a photo of a tombstone with her name on it on Saturday. Another tombstone in the picture said, \"Green New Deal,\" a plan introduced by Ocasio-Cortez to tackle climate change. Reach breaking news reporter Sarah Ladd at sladd@courier-journal.com. Follow her on Twitter at @ladd_sarah.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Advocacy group releases leaked emails from White House adviser Stephen Miller to Breitbart",
      "url": "https://www.usatoday.com/story/news/politics/2019/11/12/emails-show-white-house-advisor-stephen-miller-tauting-white-nationalism/2582150001/",
      "subtitle": "Advocacy group releases leaked emails from White House adviser Stephen Miller to Breitbart",
      "author": "Savannah Behrmann",
      "content": " WASHINGTON – Stephen Miller, a senior White House policy adviser, pushed white nationalist material to staffers at Breitbart, a right-wing website, through 2015 and leading up to the 2016 election, according to a report published by the Southern Poverty Law Center. The report released by the SPLC is the first installment in a series. More than 900 emails between Miller and Breitbart were examined by SPLC’s Hatewatch. “More than 80 percent” of the emails “relate to or appear on threads relating to the subjects of race or immigration,” the report says. Miller is one of Trump’s main influences on immigration policies, including restrictions on travel from Muslim-majority countries and family separation policies at the southern border. More:Supreme Court leans toward Trump plan to end DACA program for nearly 700K undocumented immigrants \"Miller’s perspective on race and immigration across the emails is repetitious. When discussing crime, which he does scores of times, Miller focuses on offenses committed by nonwhites. On immigration, he touches solely on the perspective of severely limiting or ending nonwhite immigration to the United States,\" the nonprofit group wrote. Katie McHugh, a former Breitbart editor who leaked the emails to the SPLC, said, \"What Stephen Miller sent to me in those emails has become policy at the Trump administration.\" McHugh renounced her far-right views after being fired from the site in 2017 for anti-Muslim tweets. Some of the findings published by the SPLC include evidence that Miller pushed links from white supremacist site VDARE as an editorial basis for Breitbart articles, including links to articles about conspiracy theories such as \"white genocide,\" which claims nonwhite people are trying to eliminate the white race. Miller touted a French novel that warns of a migrant invasion. “The Camp of Saints” is a popular book among white nationalists and neo-Nazis. The report says Miller directed McHugh to “draw information” from articles published in \"American Renaissance,\" a white supremacist online publication, about crimes committed by minorities and immigrants. “It was after lunchtime. I was sitting at my desk with my MacBook, and as Miller was speaking, I was looking away … to better concentrate on what he was saying,” McHugh told Hatewatch. “Miller asked me if I had seen the recent ‘AmRen’ article about crime statistics and race. I responded in the affirmative because I had read it. Many of us (on the far right) had read it. I remember being struck by the way he called it ‘AmRen,’ the nickname.” More:'Anonymous' author warns that Trump 'will not exit quietly,' even if defeated or impeached Miller’s name appeared in \"American Renaissance\" as an author in 2005, according to the SPLC, when the site republished a piece he wrote for \"FrontPage Magazine,\" a far-right online publication. Hatewatch said Miller was angry at retailers who stopped selling Confederate flags after the Charleston church shooting when white supremacist Dylann Roof slaughtered nine African Americans in 2015. The SPLC highlighted Miller's mentions of President Calvin Coolidge, who signed the eugenics-era Immigration Act of 1924 that limited immigration from certain parts of the world into the USA, as a foundation for why the United States should stop immigration altogether. The SPLC noted that scholars said Hitler portrayed this policy in his book “Mein Kampf” as a potential model for Nazi Germany. Freshman Rep. Alexandria Ocasio-Cortez, D-N.Y., tweeted that Miller “has been exposed as a bonafide white nationalist” and called for him to resign. White House spokeswoman Stephanie Grisham said officials had not seen the report but called the SPLC “a far-left smear organization” whose members “libel, slander and defame conservatives for a living. They are beneath public discussion.” The SPLC wrote on Twitter that “the only appropriate response is to fire Stephen Miller. Hate doesn’t belong in the White House,” and it included a link to a petition. More:One sister has DACA status, the other doesn't. Their lives are worlds apart. Vermont Sen. Bernie Sanders, who is vying for the 2020 Democratic nomination, said Miller’s “white nationalist views are a danger to the American people. We are going to defeat this hateful administration and everything it stands for.” According to the SPLC’s report, Miller was successful in shaping multiple stories that appeared on Breitbart regarding race and immigration when Steve Bannon was executive chair of the site. Bannon later served as White House chief strategist in the Trump administration and as the chairman for Trump's 2016 campaign.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Two Louisiana police officers fired after Facebook post saying Ocasio-Cortez 'needs a round'",
      "url": "https://www.usatoday.com/story/news/politics/2019/07/22/two-louisiana-police-officers-fired-after-ocasio-cortez-facebook-post/1801628001/",
      "subtitle": "Two Louisiana police officers fired after Facebook post saying Ocasio-Cortez 'needs a round'",
      "author": "Rebecca Morin",
      "content": " WASHINGTON – Two Louisiana police officers were fired Monday, just days after one of them wrote in a Facebook post that Rep. Alexandria Ocasio-Cortez is a \"vile idiot\" who should be shot. Gretna, La., police officers Charlie Rispoli, who create the post, and Angelo Varisco, who liked the post online, were fired, police chief Author Lawson announced in a press conference Monday. \"These officers have certainly acted in a manner which was unprofessional, alluding to the violent act to be conducted against a sitting U.S. congressman, a member of our government, we're not going to tolerate that,\" Lawson said at the news conference, according to the New York Times. \"This incident, we feel, has been an embarrassment to our department.\" Rispoli, a 14-year veteran of the department, shared a blog post that falsely claims the New York Democrat said \"We pay soldiers too much,\" according to a screenshot of the post taken by The Times-Picayune/The New Orleans Advocate. What happened:Louisiana police officer's Facebook post says Alexandria Ocasio-Cortez 'needs a round,' report says More:President Trump's job approval rating reaches high mark in NPR/PBS/Marist poll after racist tweets \"This vile idiot needs a round,\" Rispoli's wrote in the post. \"And I don't mean the kind she used to serve,\" he added, referring to Ocasio-Cortez's time working as a bartender. The social media post and resulting firings came amid mounting concern for elected officials' safety in the current political climate. Ocasio-Cortez, along with Reps. Ayanna Pressley of Massachusetts, Ilhan Omar of Minnesota, and Rashida Tlaib of Michigan, have been the target of President Donald Trump's ire in the past week. He has repeatedly criticized the four progressive Democrats and called on them to \"go back\" to their countries. All four congresswomen are U.S. citizens, with three being born in the United States. Trump's comments led leading Democrats on Capitol Hill to inquire about additional security for Omar and other lawmakers. More:Tlaib: 'I'm not going nowhere, not until I impeach' Trump More:Geraldo Rivera on Trump 'go back' tweets: His critics 'were much more right than I' The New York Democrat just last week questioned Acting Homeland Security Secretary Kevin McAleenan about threatening messages about her – including Photoshopped images depicting her being rape – in a secret Facebook group for current and former Border Patrol agents. At Monday's press conference, Lawson said that both officers who were fired had worked the streets as patrol officers. However, Lawson said he did not think that Rispoli meant any harm and just got \"caught up in the heat of the moment.\" Contributing: William Cummings Like what you’re reading?:Download the USA TODAY app for more",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Taylor Swift's fight with Big Machine is getting support from Elizabeth Warren, AOC and Cher",
      "url": "https://www.usatoday.com/story/entertainment/celebrities/2019/11/16/taylor-swift-scooter-braun-drama-justin-bieber-elizabeth-warren-react/4214753002/",
      "subtitle": "Taylor Swift's fight with Big Machine is getting support from Elizabeth Warren, AOC and Cher",
      "author": "Sara M Moniuszko",
      "content": " Celebrities and politicians, including Democratic presidential candidate Elizabeth Warren, are weighing in on Taylor Swift's public fight with Big Machine Label Group. On Saturday, Warren commented on the singer's claims that her former label is blocking her from performing her old hits at the American Music Awards. \"Unfortunately, @TaylorSwift13 is one of many whose work has been threatened by a private equity firm,\" Warren tweeted. \"They're gobbling up more and more of our economy, costing jobs and crushing entire industries. It's time to rein in private equity firms — and I've got a plan for that.\" U.S. Rep. Alexandria Ocasio-Cortez shared a similar message on Twitter: \"Private equity groups’ predatory practices actively hurt millions of Americans. Their leveraged buyouts have destroyed the lives of retail workers across the country, scrapping 1+ million jobs. Now they’re holding @taylorswift13’s own music hostage,\" she tweeted. \"They need to be reigned in.\" Cher also voiced her support for Swift on Saturday, validating her fellow singer's complaints that she isn't getting fair access to or compensation for her own work. \"BABE, THIS (expletive) HAS BEEN HAPPENING SINCE (a) MILLION SELLING ARTISTS WERE PAID OFF WITH A CADILLAC & A BOTTLE OF JACK!! I'M SORRY,\" Cher tweeted, adding an emoji with a puzzled look next to music tycoon Scooter Braun's name. Developments between Swift and her music industry foes Big Machine Label Group owner Scott Borchetta and Braun escalated Friday. To recap: Swift took to Twitter on Thursday, claiming she's being asked to meet an onerous set of conditions if she wants to play a medley of her old hits at the American Music Awards show on Nov. 24, where she's being presented with the artist of the decade award. Swift says Borchetta and Braun, who purchased her extensive back catalog in June (to Swift's loudly expressed shock and horror), are blocking her from performing her old songs on television because \"they claim that would be re-recording my music before I'm allowed to next year.\" Big Machine says it's not so. In a statement provided to USA TODAY, the label said it was \"shocked\" to see Swift's statements \"based on false information.\" Later, Swift's spokeswoman, Tree Paine, shared an updated statement with USA TODAY, insisting that Borchetta and Big Machine \"flatly denied the request for both American Music Awards and Netflix.\" Who is Scooter Braun? A look at the man who became Taylor Swift's 'worst case scenario' More celebrities like Hayley Kiyoko, Adam Rippon, Cara Delevingne and Kathy Griffin have announced their support for Swift on social media since then. \"Who the (expletive) do these guys think they are?\" Griffin tweeted Saturday. \"You, Taylor, have gone through the proper channels. That cost a fortune of your hard earned money. You created your own content. They don't have talent, just greed. Stay the course.\" 'I won't let you fall':Taylor Swift, Shawn Mendes debut dreamy new lyrics in 'Lover' remix Justin Bieber, who is managed by Braun, appeared to take his and Borchetta's side on the matter, sharing (and later deleting) a TMZ article on his Instagram Story about Big Machine denying Swift's claims. Earlier this week, singer Halsey also shared a message on her Instagram Story about the matter. \"Not only are we looking at an awful business move ... but this is just mean. This is punishment. This is hoping to silence her from speaking about things by dangling this over her head,\" she wrote. Selena Gomez, a self-described best friend to Swift, also commented in a lengthy post to her Instagram Story, saying her heart is \"so heavy right now.\" \"It makes me sick and extremely angry,\" she wrote.\"...It's greed, manipulation and power. You've robbed and crushed one of our best song writers of our time an opportunity to celebrate all of her music with fans and the world.\" Gomez said she hoped there would be a change of heart over this \"unfortunate\" situation. And she issued fair warning: \"Taylor fights. She will never stop fighting.\" Contributing: Andrea Mandell and Hannah Yasharoff More:Scooter Braun says he had a 'friendship' with Taylor Swift prior to Big Machine drama More:Justin Bieber's longtime manager Scooter Braun praises his 'courage,' slams media coverage",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Louisiana police officer's Facebook post says Alexandria Ocasio-Cortez 'needs a round,' report says",
      "url": "https://www.usatoday.com/story/news/politics/2019/07/22/alexandria-ocasio-cortez-threatened-police-officer/1793131001/",
      "subtitle": "Louisiana police officer's Facebook post says Alexandria Ocasio-Cortez 'needs a round,' report says",
      "author": "William Cummings",
      "content": " WASHINGTON – A Louisiana police officer last week said in a Facebook post that Rep. Alexandria Ocasio-Cortez is a \"vile idiot\" who should be shot. A screenshot of the post by veteran Gretna police officer Charlie Rispoli was taken by The Times-Picayune/The New Orleans Advocate. In it, Rispoli shares a blog post that falsely claims the New York Democrat said \"We pay soldiers too much.\" \"This vile idiot needs a round,\" reads Rispoli's remarks above Ocasio-Cortez's image. \"And I don't mean the kind she used to serve,\" he adds, referring to her prior career as a bartender. Gretna Police Chief Arthur Lawson said the post was \"disturbing\" but did not believe Rispoli, who has been with the department since 2005, intended it as a genuine threat, The Times-Picayune reported. \"I will tell you this: This will not go unchecked,\" Lawson said, according to the newspaper. \"I’m not going to take this lightly and this will be dealt with on our end. It’s not something we want someone that’s affiliated with our department to make these types of statements. That’s not going to happen.\" The Gretna Police Department did not immediately respond to USA TODAY's request for comment. Rispoli's post comes amid mounting concern for elected officials' safety in an increasingly rancorous political climate. In June 2017, a man opened fire on a group of Republican members of Congress during their baseball team's practice in Virginia. Rep. Steve Scalise of Louisana was severely injured in the attack. Last week, Capitol Police Chief Steven Sund told lawmakers \"we continue to see the threat assessment cases we're opening continue to grow.\" In May, Ocasio-Cortez said she was regularly getting \"hateful messages\" and a \"flood of death threats.\" She said there was a connection between the threats and the reporting about her on conservative news media outlets and also blamed Fox News. On Thursday, Ocasio-Cortez, a fierce critic of the Trump administration's immigration policies, questioned Homeland Security head Kevin McAleenan over threatening messages directed at her – including Photoshopped images depicting her rape – on a secret Facebook group for Border Patrol agents. AOC to DHS chief:Border agents shared 'Photoshopped images of my violent rape' in secret Facebook group 'This puts me in danger':Rep. Alexandria Ocasio-Cortez blames GOP groups for death threats Ocasio-Cortez is one of four Democratic congresswomen, known as \"the Squad,\" who have been the target of sharp criticism from President Donald Trump. Trump has said Ocasio-Cortez and Reps. Ilhan Omar, D-Minn., Ayanna Pressley, D-Mass., and Rashida Tlaib, D-Mich., \"hate our country.\" The president has also suggested that the four congresswomen of color, all of whom are U.S. citizens and three of whom were born in the U.S., should return to their countries of origin and fix the problems there before trying to make legislative changes in the U.S. Omar has said she has faced an increase in death threats since she became a target of the president's ire. In April, a New York man was accused of saying he would \"put a bullet\" in Omar. That same month, a Florida man was arrested after he allegedly threatened several high-profile Democrats, including Tlaib and Omar, whom he said he wanted to throw off the Empire State Building. Trump and his family have been targeted as well. In May, a New Jersey man was arrested for allegedly saying he wanted to \"bomb Trump Tower,\" and two years before that a Michigan man was charged with threatening to assassinate Trump. And in February 2018, Donald Trump Jr.'s ex-wife, Vanessa Trump, was rushed to the hospital after opening a package containing a \"suspicious\" white substance that was later determined to be non-toxic. Those around Trump and his administration have also been confronted in public on a number of occasions. Last month, Eric Trump said an employee at a Chicago cocktail bar spat on him. In April, charges were dropped against a woman who White House counselor Kellyanne Conway says grabbed her and shook her by the shoulders. 'This is endangering lives':Ilhan Omar claims spike in death threats after Trump tweet Secret Service:Trump faces same number of threats as Obama More:Pipe bomb suspect Cesar Sayoc pleads guilty in spree aimed at Trump critics, including Obama, Biden",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez, Nancy Pelosi planning to meet one-on-one",
      "url": "https://www.usatoday.com/story/news/politics/2019/07/17/ocasio-cortez-pelosi-planning-one-one-meeting/1758102001/",
      "subtitle": "Alexandria Ocasio-Cortez, Nancy Pelosi planning to meet one-on-one",
      "author": "Rebecca Morin",
      "content": " WASHINGTON – House Speaker Nancy Pelosi and Rep. Alexandria Ocasio-Cortez are in talks to set up a face-to-face meeting with each other, amid intra-party tension between the two Democratic lawmakers. Pelosi spokesman Drew Hamill said Ocasio-Cortez's office reached out Tuesday afternoon for a one-on-one meeting. During an interview with New York Times columnist Maureen Dowd earlier this month, Pelosi downplayed four votes from a group of progressive Democrats against a border funding bill. Reps. Ocasio-Cortez, D-N.Y., Ayanna Pressley, D-Mass., Ilhan Omar, D-Minn., and Rashida Tlaib, D-Mich., all voted against the bill. The four congresswomen of color are colloquially known as \"The Squad.\" \"We are working to schedule this meeting,\" Hamill said of Pelosi meeting with Ocasio-Cortez, adding that the speaker's chief of staff has already met with the four chiefs of these offices. In an interview with CBS News broadcast Wednesday, Ocasio-Cortez said she \"absolutely\" wants to meet with Pelosi. More:New York businesswoman and Jamaican immigrant Scherie Murray launches campaign to unseat Ocasio-Cortez More:House votes to condemn Trump's racist tweets with support from only 4 Republicans Pelosi in the New York Times said of The Squad: “All these people have their public whatever and their Twitter world. But they didn’t have any following. They’re four people and that’s how many votes they got.” Since then, some members of \"The Squad\" have individually responded to the speaker's remarks on Twitter. That prompted Pelosi in a closed-door meeting to warn Democratic lawmakers that if any lawmaker had an issue within the party, they should come directly to her and not tweet about it. During an interview with the Washington Post last week, Ocasio-Cortez accused Pelosi of \"singling out of newly elected women of color.\" The next day, she told CNN that she \"absolutely\" did not believe Pelosi was racist. Since then, however, the tension between Pelosi and the Squad has been drowned out by days of tweets and attacks on the four progressive lawmakers by President Donald Trump. Trump on Sunday tweeted that the four lawmakers should \"go back\" to their countries, and has since doubled down several times on his attacks and criticisms of the Democrats. Three of the congresswomen were born in the United States. Omar immigrated to the U.S. over 20 years ago from Somalia and is a naturalized U.S. citizen. The House voted Tuesday to condemn Trump's comments as racist, by a 240-187 vote. During the CBS interview, Ocasio-Cortez said she did not believe there is a fracture in the Democratic Party. \"I think that just as there were members of Congress that did not vote for the speaker on the House Floor the day of our swearing-in, just as there are members who challenge her conclusions, who disagree with her, so do we from time-to-time,\" she said. \"But that does not mean that there is a fundamental fracture or a dehumanizing going on within our caucus.\" Contributing: Christal Hayes Like what you’re reading?:Download the USA TODAY app for more",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez welcomes New Jersey Democrat to 'The Squad'",
      "url": "https://www.usatoday.com/story/news/politics/2019/07/16/ocasio-cortez-new-jersey-democrat-youre-in-squad/1748643001/",
      "subtitle": "Alexandria Ocasio-Cortez welcomes New Jersey Democrat to 'The Squad'",
      "author": "Rebecca Morin",
      "content": " WASHINGTON – Rep. Alexandria Ocasio-Cortez is welcoming a new member to \"The Squad\": 82-year-old Rep. Bill Pascrell. The New Jersey Democrat asked Tuesday to be part of the outspoken group of House Democratic congresswomen who have been given their own moniker. Reps. Ayanna Pressley, D-Mass., Alexandria Ocasio-Cortez, D-N.Y., Rashida Tlaib, D-Mich., and Ilhan Omar, D-Minn., are the four freshmen lawmakers who have collectively become known as \"The Squad.\" Pascrell responded to a tweet from The Onion, a satirical website, that posted an article entitled \"82-Year-Old New Jersey Congressman Bill Pascrell Quietly Asks Ilhan Omar If He Can Be Part Of The Squad.\" 'We want to just fight':Democrats' attempt to condemn Trump's racist tweets through House resolution delayed More:George Conway, husband of Kellyanne Conway, calls Trump a racist in op-ed \"Well. How bout it @AyannaPressley @AOC @RepRashida @IlhanMN?\" Pascrell tweeted. Shortly afterward, Ocasio-Cortez gave her approval to the 82-year-old. \"You’re in, @BillPascrell!\" Ocasio-Cortez tweeted, with several emojis including a smiley face and heart. The exchange comes as President Donald Trump has repeatedly criticized \"The Squad\" in recent days. Over the weekend, Trump tweeted for the progressive lawmakers to \"go back\" to their country, a phrase often used in racist tropes. Three of the lawmakers were born in the U.S. Omar came to the United States as a refugee from Somalia more than 20 years ago and is a naturalized U.S. citizen. The president has doubled down on his comments several times since his initial tweets on Sunday. The four congresswomen held a press conference Monday denouncing Trump's comments, calling them \"racist,\" \"xenophobic,\" and \"bigoted.\" More:House GOP leaders refuse to condemn Donald Trump's racist tweets, say the uproar is 'all about politics' More:Trump triples down on his controversial tweets about 'The Squad.' Here's what we know Pascrell is one of many Democrats who have defended the congresswomen from Trump's attacks, saying that the president \"can't leave soon enough.\" Earlier this month, House Speaker Nancy Pelosi also criticized the congresswomen after they voted against a border funding bill. The speaker's statement sparked tension between The Squad and Pelosi, which has since been diminished following Trump's remarks as Pelosi and many Democrats have lined up in solidarity behind the four congresswomen. Like what you’re reading?:Download the USA TODAY app for more",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "'We don't have that many differences': Pelosi minimizes differences with Ocasio-Cortez",
      "url": "https://www.usatoday.com/story/news/politics/2019/07/26/pelosi-meeting-aoc-house-speaker-denies-tensions-lawmaker/1831077001/",
      "subtitle": "'We don't have that many differences': Pelosi minimizes differences with Ocasio-Cortez",
      "author": "Camille Caldera",
      "content": "   WASHINGTON – House Speaker Nancy Pelosi and Rep. Alexandria Ocasio-Cortez met face-to-face Friday after weeks of public friction between the two high-profile Democrats. \"It went very well,\" Pelsoi said after the meeting. When asked if she and Ocasio-Cortez resolved any of their differences, Pelosi replied, \"we don't have that many differences.\" The speaker wrote in a tweet later that the two met \"to discuss working together to meet the needs of our districts and our country, fairness in our economy and diversity in our country.\" Speaking later Friday at her weekly press conference, Pelsoi expressed \"some level of confidence, and actually joy\" at the diversity of the House Democratic caucus and its ability to unify around issues. \"Ever since I came here, we have engaged in differences of opinion in our caucus, and that is a good thing,\" Pelosi said. \"In our caucus, we have our differences. Respect that, instead of making a big issue of it. Respect that.\" The collegial tone after the meeting appears to be the latest iteration of the sometimes-contentious relationship between the speaker from California and the freshman lawmaker from New York, who has come to represent the progressive wing of the party. The two have have quibbled over both policies and tactics during their six months together in the House but recently appeared to unify after President Donald Trump made racist attacks against four minority members of Congress. Budget deal:Donald Trump's budget deal with Democrats passes House but conservatives pan it as reckless The pair condemned Trump’s tweets in which he told the four House Democrats, which included Ocasio-Cortez, to “go back and help fix the totally broken and crime infested places from which they came.” Pelosi said the tweets were “disgraceful and disgusting” and introduced a resolution to condemn the comments as racist. But before Trump's attacks, signs of tensions between the two had been visible from the time of Ocasio-Cortez's congressional orientation, when she joined a climate protest outside Pelosi's office. And they continued as Ocasio-Cortez disagreed with the speaker's cautious approach to pursuing impeachment proceedings against Trump, while Pelosi offered lukewarm support for Ocasio-Cortez's Green New Deal. Tensions appeared to boil over after Ocasio-Cortez and three other first-year congresswomen from the party's progressive wing were the only Democrats to vote against a version of a border funding bill that Pelosi promoted. '45 is a puppet':Trump appears in front of altered presidential seal saying '45 is a puppet' During an interview with New York Times columnist Maureen Dowd, Pelosi criticized Ocasio-Cortez, along with Reps. Ilhan Omar of Minnesota, Ayanna Pressley of Massachusetts and Rashida Tlaib of Michigan for voting against the bill. \"They didn’t have any following. They’re four people and that’s how many votes they got,\" Pelosi said. That article prompted Ocasio-Cortez and her chief of staff to criticize Pelosi and centrist Democrats on social media. Pelosi then called out Ocasio-Cortez and the other three freshman congresswoman in a caucus meeting. \"You got a complaint? You come and talk to me about it,\" Pelosi said, according to a source in the room. \"But do not tweet about our members and expect us to think that that is just OK.\" From impeachment to indictment:5 repercussions from Robert Mueller's testimony Ocasio-Cortez responded by saying it was “outright disrespectful” for Pelosi to repeatedly single out newly elected women of color, though she later tried to downplay any ill-will between herself and the speaker. On Thursday, Pelosi minimized reports of strain in her relationship with Ocasio-Cortez, saying, “We’re good, we’re good.\" “I don’t think there are tensions,\" she said. When asked about the meeting Wednesday, Ocasio-Cortez said, \"I don’t think I have a strong message for her.\" Rep. Ro Khanna, D-Calif, views the meeting between Pelosi and Ocasio-Cortez as a further sign of de-escalation. \"The speaker is our coach and leader, and (Ocasio-Cortez) is a star recruit freshman who’s capable of big plays,\" he said, \"so they should see that they both have a particular role to play on the team and ultimately the goal is for the team to win.\" Executions:Justice Department resumes capital punishment after nearly two decades, orders executions of five inmates Norman Ornstein, a resident scholar for the American Enterprise Institute, said Trump's comments \"actually brought Democrats together.\" \"They felt under siege in a completely vile way and that created a commonality,\" he said. \"It created an opening for a different kind of dialogue between the speaker and AOC.” Ornstein said the meeting is significant because \"the speaker doesn’t meet individually with a lot of members on a regular basis because she has so many other things going on.\" When Pelosi was asked at her weekly press conference if she and Ocasio-Cortez had buried the hatchet, Pelsoi replied, \"I don't think there ever was any hatchet.\" Contributing: Christal Hayes",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Climate Point: Marshall Islands fallout, and smog correlated to crime",
      "url": "https://www.usatoday.com/story/nletter/2019/11/15/climate-point-marshall-islands-fallout-smog-linked-crime/4193585002/",
      "subtitle": "Climate Point: Marshall Islands fallout, and smog correlated to crime",
      "author": "Janet Wilson",
      "content": " Welcome to Climate Point, your weekly guide to climate, energy and environment news. I'm Janet Wilson, writing to you from Palm Springs, Calif. Sometimes, a story stays with you. For me, that's this week's package from the L.A. Times on how the United States used the Marshall Islands and its people for nuclear weapons testing. Now a dome of radioactive waste left behind threatens residents anew because it could be swamped by rising seas due to climate change. Here are some other stories that may be of interest: Smog correlated to crime. That's the conclusion of a new Colorado State University study, which finds for every uptick in dirty air, there's an increase in violent assaults, per Jacy Marmaduke with the Fort Collins Coloradoan. Reducing smog and soot by 10% could save $1.4 billion in crime costs each year, the researchers say. Hard NOx. New satellite data show nitrogen oxide, a key smog ingredient, lingering. The kids are not all right. Drought and disease exacerbated by climate change are harming children's health worldwide, and that trend will worsen if we don't slash emissions to levels set in the Paris agreement, reports Doyle Rice with USA Today. No plan. Arizona climate summit highlights state's lack of planning, other woes. Home green home. What do public housing and climate change have in common? The Green New Deal. Presidential contender Sen. Bernie Sanders (I-Vermont) and Rep. Alexandria Ocasio-Cortez (D-N.Y.) this week unveiled a $180 billion plan to make housing cheaper and more environmentally friendly. As USA Today's Ledyard King tells us, the bill would repair and electrify all public housing with solar panels and other renewable energy. But chances of passage are dim. Get moving. Hundreds of Bureau of Land Management employees this week were given 30 days to agree to leave D.C. and move out west to new offices, or face losing their jobs, as Eric Katz with Government Executive reports. Oil man. President Donald Trump this week contradicted Pentagon officials who said the reason U.S. troops would remain in Turkey after all was to fight ISIS terrorists. \"We left troops behind only for the oil,\" Trump told reporters during a meeting with Turkish President Recep Tayyip Erdoğan at the White House, reports Politico's David Brown. Livid. Anger is propelling officials from California to Maine, including Chicago and New York City, to eye taking control of big, investor-owned electric utilities that have spent millions on executive bonuses while often ignoring critical maintenance, unleashing massive blackouts and raising customers' rates. I report for The Desert Sun. Butterfly blues. A Las Vegas ski area expansion, including miles of new mountain biking, skiing and hiking trails, threatens to leave a pretty butterfly.in the dust, reports Benjamin Spillman with the Reno Gazette Journal. The Mount Charleston Blue Butterfly was listed as endangered in 2013, and the plans to expand the popular outdoor area run right over its habitat, critics say. Going up. Last month was the second-hottest October since at least 1880, according to NASA data visualized by UC Irvine's Zack Labe. That's all for this week. For more climate, energy and environment news, follow me on Twitter @janetwilson66. You can sign up to get Climate Point in your inbox for free here.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Democrats call Stephen Miller 'white nationalist,' ask for resignation after SPLC report",
      "url": "https://www.usatoday.com/story/news/politics/2019/11/14/democratic-caucus-leaders-want-stephen-miller-resignation/4192405002/",
      "subtitle": "Democrats call Stephen Miller 'white nationalist,' ask for resignation after SPLC report",
      "author": "William Cummings",
      "content": " WASHINGTON – More Democratic lawmakers are calling for the resignation of senior White House adviser Stephen Miller following a report from the Southern Poverty Law Center that claimed leaked emails showed Miller promoted white nationalist literature to Breitbart from 2015 to 2016. The leaders of the Congressional Progressive Caucus, Congressional Black Caucus, Congressional Hispanic Caucus, and Congressional Asian Pacific American Caucus issued a joint statement on Thursday asking Miller to step down in light of the report. \"It’s clearer than ever that Stephen Miller is a far-right white nationalist with a racist and xenophobic worldview. His beliefs are appalling, indefensible, and completely at odds with public service,\" said the statement from Reps. Mark Pocan, Pramila Jayapal, Karen Bass, Joaquin Castro and Judy Chu. More:Advocacy group releases leaked emails from White House adviser Stephen Miller to Breitbart Their statement followed calls from other Democrats for Miller's resignation, including high-profile freshman lawmakers Reps. Alexandria Ocasio-Cortez of New York and Ilhan Omar of Minnesota. As the man often credited with crafting President Donald Trump's policies aimed at curbing both legal and illegal immigration, Miller has been a lightning rod for immigration rights activists. His critics have accused him of racism before and they now say the SPLC report proves they were right. More:Donald Trump Jr. slams Ilhan Omar for calling Stephen Miller a 'white nationalist' More:Stephen Miller's D.C. home a target of immigration policy protest \"As documented by the Southern Poverty Law Center, Stephen Miller has embedded himself in white nationalist doctrine for years, including promoting racist propaganda from fringe sites like VDARE and InfoWars,\" the Democratic caucus leaders said in their statement. \"And as the chief architect of the Muslim Ban and cruel family separation policies, Stephen Miller has spent the last three years turning his bigotry into policy –with President Trump’s blessing.\" The lawmaker statement said \"someone who writes, talks, and governs like a white nationalist is in fact a white nationalist\" and that such a person \"has no business serving in the White House.\" Former Breitbart editor Katie McHugh told the SPLC, \"What Stephen Miller sent to me in those emails has become policy at the Trump administration.\" The SPLC report said it looked at more than 900 emails that Miller – who was at that time an aide to then-Sen. Jeff Sessions, R-Ala. – sent from his official email to Breitbart editors between March 2015 to June 2016. The report said 80% dealt with issues of race and immigration, including some related to fears of \"white genocide.\" White House Press Secretary Stephanie Grisham told The Washington Post that she had not seen the report but said it was \"beneath public discussion\" and denounced the SPLC as \"an utterly-discredited, long-debunked far-left smear organization.\" Contributing: Savannah Behrmann Fox News host to Stephen Miller:'No question' Trump is 'stoking racial divisions' More:White House adviser Stephen Miller defends national emergency in heated exchange on Fox News",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "'You are likely breaking the law': AOC slams blog founder's threat to fire unionizing workers",
      "url": "https://www.usatoday.com/story/news/politics/2019/08/13/aoc-slams-barstool-sports-founders-threat-fire-unionizing-workers/2003902001/",
      "subtitle": "'You are likely breaking the law': AOC slams blog founder's threat to fire unionizing workers",
      "author": "Rebecca Morin",
      "content": " WASHINGTON – Rep. Alexandria Ocasio-Cortez, D-N.Y., on Tuesday criticized Dave Portnoy, the founder of sports blog Barstool Sports, after he threatened to fire any employee that was seeking advice on how to start a union. In a tweet Monday, Portnoy criticized employees at The Ringer, a sports and culture website, for trying to unionize. Portnoy linked to an article he previously wrote in 2015 when Gawker writers tried to unionize. \"I hope and I pray that Barstool employees try to unionize,\" he wrote in the 2015 post. \"I can’t tell you how much I want them to unionize. Just so I can smash their little union to smithereens. Nothing would please me more than to break it into a million little pieces.\" Rafi Letzter, a staff writer for Live Science, replied to Portnoy's tweet on Tuesday, saying his inbox is open to Barstool writers who want advice on starting a union. More:Chris Cuomo’s ‘nuts,’ Curt Schilling’s a ‘patriot’ and more from Trump's day on Twitter 'Make sure we win': Donald Trump mixes 2020 politics into Pennsylvania energy speech \"If you work for @barstoolsports and DM this man I will fire you on the spot,\" Portnoy replied to the tweet. Under the National Labor Relations Act, it is illegal for companies to fire or discipline employees for being involved with or trying to create a union. Ocasio-Cortez said that Portnoy is likely breaking the law with his tweet. \"If you’re a boss tweeting firing threats to employees trying to unionize, you are likely breaking the law &can be sued,in your words, 'on the spot,'\" she wrote in a tweet. \"ALL workers in the US have the protected freedom to organize for better conditions.\" The New York Department of Labor also pushed back against Portnoy's tweet. \"It is illegal to take any unfavorable action – including termination – against employees for union-related activities under the National Labor Relations Act,\" the department wrote on Twitter. \"New York is a proud union state. We say no way, no how to intimidation, threats and union busting.\" For his part, Portnoy responded to the New York congresswoman with a GIF. Like what you’re reading?:Download the USA TODAY app for more",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Trump impeachment hearing snatched by New Jersey drag queen: 'THIS is what Democracy looks like!'",
      "url": "https://www.usatoday.com/story/news/politics/2019/11/14/pissi-myles-reports-at-trump-impeachment-hearing/4189289002/",
      "subtitle": "Trump impeachment hearing snatched by New Jersey drag queen: 'THIS is what Democracy looks like!'",
      "author": "Alex Biese",
      "content": " WASHINGTON - Pissi Myles is in the house at the impeachment hearings of President Donald Trump. Myles, a New Jersey-based drag queen, caused a stir on social media when she arrived on Capitol Hill on Wednesday. “It’s a crazy day in Washington! I’m flipping my wig over the high-energy proceedings today,\" Myles told NBC News in its report on her appearance. \"Tensions are high, and the bar for who’s allowed in the Longworth House is very, very low.” Myles is reporting on the Trump impeachment hearing at the Longworth House Office Building for streaming channel Happs News, available on Twitter, Facebook and Instagram. Pompeo 'on shifting sand':Impeachment probe reveals his role in Ukraine pressure campaign Impeachment:How Democrats and Republicans are laying out their arguments With her arrival to the impeachment hearings on Trump's interactions with Ukraine, Myles caught the attention of many across social media on Wednesday. \"THIS is what Democracy looks like!\" tweeted \"Today Show\" reporter Alexander Kacala, while C-SPAN producer Annie Anderson told her Twitter followers that \"I have lost all of my power to be productive today as I am only interested in Pissi Myles sightings.\" The winner of Miss Fish NYC 2014 and Cycle 4 of Mimi Imfurst's Philly Drag Wars, Myles is the co-host of the podcast \"My Spooky Gay Family.\" Myles' impeachment coverage isn't the latest drag queen action in Washington, D.C., in recent days. U.S. Rep. Alexandria Ocasio-Cortez, D-N.Y., visited \"RuPaul's Drag Race\" Season Nine winner Sasha Velour when the performer's \"Smoke and Mirrors\" Tour played in our nation's capital on Monday night and raved about the show on Twitter. Follow Alex Biese on Twitter: @ABieseAPP Deval Patrick:Former Massachusetts governor enters 2020 presidential race The 'post-antibiotic era' is here:Drug-resistant superbugs sicken 2.8M and kill 35K each year",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "New York’s Alexandria Ocasio-Cortez youngest woman ever elected to Congress",
      "url": "https://www.usatoday.com/picture-gallery/news/politics/2018/11/07/new-yorks-alexandria-ocasio-cortez-campaign-trail/1911200002/",
      "subtitle": "null",
      "author": "",
      "content": "",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Twitter CEO says company will stop accepting political ads",
      "url": "https://www.usatoday.com/story/tech/2019/10/30/twitter-announces-ban-political-advertisements/4101824002/",
      "subtitle": "Twitter CEO says company will stop accepting political ads",
      "author": "Jefferson Graham",
      "content": "  WASHINGTON – Adding fuel to the fire in the highly controversial debate over free speech and politics on social media, the CEO of President Donald Trump's preferred outlet says the company will no longer accept political ads. \"We believe political message reach should be earned, not bought,\" said Twitter CEO Jack Dorsey, in a tweetstorm Wednesday. \"A political message earns reach when people decide to follow an account or retweet. Paying for reach removes that decision, forcing highly optimized and targeted political messages on people. We believe this decision should not be compromised by money,\" Dorsey continued. The ban will go into place in November. Dorsey wrote, \"We’re well aware we‘re a small part of a much larger political advertising ecosystem. Some might argue our actions today could favor incumbents. But we have witnessed many social movements reach massive scale without any political advertising. I trust this will only grow.\" Twitter's recent decision differentiates itself from other companies that have resisted the push to stop taking political ads. Facebook is currently in a debate over the spread of misinformation through ads from political campaigns. The social media company has reiterated it does not think it should be the gatekeeper of political speech. Several hundred Facebook employees have noted their disagreement with the decision in a letter to Facebook CEO Mark Zuckerberg. When Zuckerberg was recently testifying on Capitol Hill, Rep. Alexandria Ocasio-Cortez asked him if she could “run advertisements on Facebook targeting Republicans in primaries saying that they voted for the Green New Deal?” “Probably” was one of Zuckerberg responses. “I mean, if you’re not fact-checking political advertisements, I’m just trying to understand the bounds here, what’s fair game,” Ocasio-Cortez added. Dorsey clarified details about Twitter's thoughts behind the decision, stating that the company \"considered stopping only candidate ads, but issue ads present a way to circumvent. Additionally, it isn’t fair for everyone but candidates to buy ads for issues they want to push. So we're stopping these too.\" \"A final note. This isn’t about free expression. This is about paying for reach. And paying to increase the reach of political speech has significant ramifications that today’s democratic infrastructure may not be prepared to handle. It’s worth stepping back in order to address,\" Dorsey concluded. Former Secretary of State Hillary Clinton weighed in on Twitter, saying \"This is the right thing to do for democracy in America and all over the world. What say you, Facebook?\"",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "AOC criticizes ex-Democratic senator for advising Lyft in battle over California gig worker bill",
      "url": "https://www.usatoday.com/story/news/politics/2019/08/29/aoc-rips-barbara-boxer-helping-lyft-fight-california-bill/2158941001/",
      "subtitle": "AOC criticizes ex-Democratic senator for advising Lyft in battle over California gig worker bill",
      "author": "Savannah Behrmann",
      "content": " WASHINGTON -- Rep. Alexandria Ocasio-Cortez, D-N.Y. called out former Sen. Barbara Boxer, D-Calif., Thursday over her work opposing a California bill that would make it harder for companies to classify workers as independent contractors in many industries including those workers participating in the \"gig economy\" for services like Lyft and Uber. Boxer, who is advising Lyft, penned an op-ed in the San Francisco Chronicle earlier this week where she criticized the bill, writing, “Switching to an employee model will mean far fewer opportunities to drive.” Ocasio-Cortez responded on Twitter writing, “Fmr officials should not become corporate lobbyists, in letter or spirit. It’s an abuse of power + a stain on public service.” “I don’t care if it’s a Democrat doing it (both parties do). In fact, that makes it worse — we’re supposed to fight FOR working people, not against them,” she continued. The bill, California AB-5, takes aim at the titans of the \"gig economy\" such as Lyft, Uber, Doordash, and Postmates. If it became law, the bill they would make it more difficult for such companies to deny a number of legal protections to workers which they don't currently enjoy as independent contractors. Some 2020 Democrats presidential candidates have weighed in supporting the pro-worker legislation. Sen. Elizabeth Warren, D-Mass., wrote earlier this month in an op-ed in the Sacramento Bee, “I’m fighting for an America where everybody – even the biggest, richest and most well-connected companies – plays by the rules. Passing AB 5 gets us closer to that ideal.” A spokesperson for the Bernie Sanders campaign said that the senator “strongly supports AB5,” according to Cal Matters. Sen. Sanders has also specifically called for protections for the workers of ride-hailing services. Sen. Kamala Harris, D-Calif., also supports the bill. Ian Sams, a Harris campaign spokesman told Vice, “In our evolving economy, she believes it's critical we ensure a robust social safety net for all workers and support their right to join a union.” As for Ocasio-Cortez's beef with former lawmakers becoming lobbyists, she has joined forces with Sen. Ted Cruz, R-Texas, to draft legislation which would prohibit the frequent move on the behalf of many ex-Capitol Hill lawmakers.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "'She should be shot': Ohio man charged after Facebook threat against Ocasio-Cortez",
      "url": "https://www.usatoday.com/story/news/politics/2019/08/10/toledo-ohio-man-charged-after-post-facebook-ocasio-cortez/1975362001/",
      "subtitle": "'She should be shot': Ohio man charged after Facebook threat against Ocasio-Cortez",
      "author": "Nicholas Wu",
      "content": " WASHINGTON – Federal prosecutors announced on Friday that a 41-year-old Toledo, Ohio, man has been charged after making threats against Rep. Alexandria Ocasio-Cortez, D-N.Y., and illegal possession of ammunition. Ireland was charged with \"one count of being a felon in possession of a firearm, one count of being a fugitive in possession of a firearm and one count of making interstate threats,\" according to the Department of Justice. According to the criminal complaint, at the end of July, the U.S. Capitol Police received a report from a person who'd perceived a Facebook post from Timothy J. Ireland, Jr. as potentially threatening against Ocasio-Cortez. More:AOC says she gets death threats after organizations air 'hateful messages' about her More:AOC calls out McConnell after photo shows 'Team Mitch' supporters 'groping and choking' cardboard cutout “She should be shot. Can’t fire me, my employer would load the gun for me,” Ireland had written on Facebook, along with a link to a story about Ocasio-Cortez. On August 2, the Capitol Police called Ireland at a number found in public records and asked him if he made the post and if he owned firearms. The Capitol Police said Ireland told them he was \"very proud of that post he made,\" and admitted to owning firearms. Six days later, Capitol Police and the Bureau of Alcohol, Tobacco, Firearms and Explosives agents searched Ireland's house after obtaining a search warrant. They detained him at the scene and found seven rounds of ammunition inside his kitchen drawers – three rounds of .32 caliber ammunition and four rounds of .45 caliber ammunition. Ireland told agents he did not have a gun in his house but brought ammunition with him when he moved into the house. An FBI criminal background check of Ireland found he had two outstanding warrants for failure to appear charges in Florida and Georgia, which stemmed from a marijuana possession charge. The criminal complaint noted Ireland had also been convicted in 1996 of four felony counts of dealing in stolen property in Sarasota County, Fla. “There is absolutely no place in the marketplace of ideas for threats of violence against any person, especially those who are elected to represent the American people,” U.S. Attorney Justin Herdman said in a press release. “Disagreement on political issues cannot lead to acts of violence, and if it does, we will seek federal prison time.” More:Louisiana police officer's Facebook post says Alexandria Ocasio-Cortez 'needs a round,' report says Ocasio-Cortez has been outspoken about the number of threats that she receives as a high-profile member of Congress. \"I‘ve had mornings where I wake up & the 1st thing I do w/ my coffee is review photos of the men (it’s always men) who want to kill me,\" she wrote on Twitter at the end of May.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez's chief of staff, spokesman leave her congressional office",
      "url": "https://www.usatoday.com/story/news/politics/2019/08/02/alexandria-ocasio-cortezs-chief-staff-spokesman-leave-her-office/1906807001/",
      "subtitle": "Alexandria Ocasio-Cortez's chief of staff, spokesman leave her congressional office",
      "author": "Rebecca Morin",
      "content": " WASHINGTON — Rep. Alexandria Ocasio-Cortez's chief of staff, Saikat Chakrabarti, who has been criticized by some Democratic lawmakers, will be leaving the New York Democrat's congressional office to join an organization working on the Green New Deal, according to several reports. Corbin Trent, Ocasio-Cortez's communications director, will also be leaving the congressional office to join the congresswoman's 2020 reelection campaign. The Intercept first reported both staff moves. Trent, in a statement to The Intercept, said that Chakrabarti will work with a group called New Consensus, a nonprofit focused on climate issues and promoting the Green New Deal. Tulsi Gabbard: Bashar al-Assad is 'a brutal dictator, just like Saddam Hussein' Russia investigation:The final bill for former special counsel Robert Mueller's Russia inquiry: $31. 7 million “We are extraordinarily grateful for his service to advance a bold agenda and improve the lives of the people in NY-14,\" Trent said in the statement. \"From his co-founding of Justice Democrats to his work on the Ocasio-Cortez campaign and in the official office, Saikat’s goal has always been to do whatever he can to help the larger progressive movement, and we look forward to continuing working with him to do just that.\" Chakrabarti, who co-founded Justice Democrats -- a political organization that helped Ocasio-Cortez get elected -- was criticized last month by Democratic Rep. William Lacy Clay of Missouri. The comments came amid intra-party bickering between House Speaker Nancy Pelosi and Reps. Ayanna Pressley of Massachusetts, Ilhan Omar of Minnesota, Rashida Tlaib of Michigan and Ocasio-Cortez. More:Donald Trump’s picks for administration jobs keep dropping out with John Ratcliffe latest to go 'Self-inflicted wound':Trump signs budget bill as experts warn he's on track to add trillions to U.S. debt Clay called out Chakrabarti in July for a tweet where he compared moderate Democrats to \"new Southern Democrats\" that \"certainly seem hell bent to do to black and brown people today what the old Southern Democrats did in the 40s.\" The tweet has since been deleted. In a separate tweet, Chakrabarti said centrist Democrats \"still enable a racist system.\" “It shows you how ignorant and little history [Chakrabarti] knows, how ignorant he is to American history. How dare he,” Clay said at the time. The intra-party differences seemed cool once President Donald Trump began to target Ocasio-Cortez, Pressley, Omar and Tlaib -- colloquially known as the \"Squad\" -- with repeated racist attacks that were condemned by Pelosi, other Democrats, some Republicans and by a resolution passed in the House of Representatives. In an apparent effort to further defuse tensions, Pelosi and Ocasio-Cortez recently met one-on-one. And news of the departures of Trent and Chakrabarti broke a week later. Pelosi:'We don't have that many differences' Like what you’re reading?:Download the USA TODAY app for more",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez says tweets by her ex-chief of staff were 'divisive'",
      "url": "https://www.usatoday.com/story/news/politics/2019/08/08/alexandria-ocasio-cortez-ex-chief-staff-tweets-were-divisive/1957146001/",
      "subtitle": "Alexandria Ocasio-Cortez says tweets by her ex-chief of staff were 'divisive'",
      "author": "Rebecca Morin",
      "content": " WASHINGTON – Rep. Alexandria Ocasio-Cortez, D-N.Y., criticized her controversial ex-chief of staff's tweets about moderate Democrats, saying they were \"divisive.\" Ocasio-Cortez, however, maintained that she parted on good terms with Saikat Chakrabarti, during an exclusive interview with the New York Daily News posted Thursday. “I think it was divisive,” she told the Daily News. “I believe in criticizing stances, but I don’t believe in specifically targeting members.\" Chakrabarti resigned last week to join a group called New Consensus, a nonprofit focused on climate issues and promoting the Green New Deal. Corbin Trent, Ocasio-Cortez's communications director, also announced he was transitioning out of the congressional office to join the congresswoman's 2020 reelection campaign. Chakrabarti, who co-founded Justice Democrats — a political organization that helped Ocasio-Cortez get elected, was criticized last month by Missouri Democratic Rep. William Lacy Clay. More:Trump 'thinking very seriously' about commuting prison sentence for Rod Blagojevich The comments came amid intra-party bickering between House Speaker Nancy Pelosi and Reps. Ayanna Pressley of Massachusetts, Ilhan Omar of Minnesota, Rashida Tlaib of Michigan and Ocasio-Cortez. Clay called out Chakrabarti in July for a tweet where he criticized moderate Democrats who voted in favor of an emergency border funding bill, which Ocasio-Cortez, Omar, Tlaib and Pressley voted against. Chakrabarti compared centrist Democrats, known as the Blue Dogs, to \"new Southern Democrats\" that \"certainly seem hell bent to do to black and brown people today what the old Southern Democrats did in the 40s.\" The tweet has since been deleted. In a separate tweet, Chakrabarti said centrist Democrats \"still enable a racist system.\" “It shows you how ignorant and little history [Chakrabarti] knows, how ignorant he is to American history. How dare he,” Clay said at the time. Ocasio-Cortez told the Daily News that the tweet was deleted following an “internal conversation\" in her office after the tweet. More:Tucker Carlson's fellow Fox News host Shepard Smith says 'white nationalism is real' “We’ve corrected it,” she said. “He immediately took the tweet down.” In addition, Ocasio-Cortez said that the two \"had been discussing this transition before that whole incident happened.\" However, the announcement of the departure of Chakrabarti and Trent broke a week after Pelosi and Ocasio-Cortez met one-on-one in apparent effort to defuse tensions within the party. Prior to that meeting, the intra-party bickering seemed to cool after President Donald Trump began to target Ocasio-Cortez, Pressley, Omar and Tlaib — colloquially known as the \"Squad\" — with repeated racist attacks. Pelosi, many other Democrats and even some Republican condemned Trump's attacks on the four congresswomen. The House of Representatives also passed a resolution to formally condemn Trump's tweets calling on the four congresswomen to \"go back\" to their countries as racist. Like what you’re reading?:Download the USA TODAY app for more",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "'SNL' gives Trump impeachment hearings the 'Days of Our Lives' treatment",
      "url": "https://www.usatoday.com/story/entertainment/tv/2019/11/17/saturday-night-live-trump-impeachment-days-our-lives-spoof/4219650002/",
      "subtitle": "'SNL' gives Trump impeachment hearings the 'Days of Our Lives' treatment",
      "author": "David Oliver",
      "content": " Forget the Trump impeachment hearings – \"Days of Our Impeachment\" is where the real action is. With President Donald Trump's impeachment hearings well underway and the future of NBC's \"Days of Our Lives\" in question, it only made sense for \"Saturday Night Live\" to combine the two in a drama-filled opening sketch. \"The first soap where you can't imagine any of the people in it having sex,\" one tease of the new \"show\" read. The cast of characters included U.S. Rep Adam Schiff (Alex Moffat), U.S. Rep Jim Jordan (Mikey Day) and Ukraine ambassadors Marie Yovanovitch (Cecily Strong) and Bill Taylor (surprise guest Jon Hamm). \"I don't just kiss and tell,\" Hamm's Taylor said. \"I kiss and tell and I take notes.\" Kate McKinnon also made an appearance as Rudy Giuliani: \"Mercury's in retrograde, so my powers are at an all-time high.\" More 'SNL':  Harry Styles debuts new song 'Watermelon Sugar' and rocks painted nails, stuns fans Some of the other high jinks included U.S. Rep. Alexandria Ocasio-Cortez (Melissa Villasenor) making out with Taylor and European Union diplomat Gordon Sondland (Kyle Mooney) revealing he had amnesia. Kenan Thompson later showed up as Cleveland Browns defensive end Myles Garrett (spoofing the helmet-swinging incident that sidelined him for the season), who the fictional Trump pardoned.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Bernie Sanders laughs at idea of Jeff Bezos floating Michael Bloomberg's presidential run",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/11/10/bernie-sanders-aoc-react-to-jeff-bezos-michael-bloomberg-report/2555554001/",
      "subtitle": "Bernie Sanders laughs at idea of Jeff Bezos floating Michael Bloomberg's presidential run",
      "author": "Nick Coltrain",
      "content": " CORALVILLE, Iowa — When U.S. Sen. Bernie Sanders learned Saturday that Amazon owner Jeff Bezos reportedly asked fellow billionaire Michael Bloomberg about running for president, Sanders couldn’t contain his laughter to speak. U.S. Rep. Alexandria Ocasio-Cortez, who was in Iowa campaigning for Sanders, jumped in while Sanders composed himself. “Of course!” she said in an interview with the Des Moines Register. “They’ve got class solidarity. The billionaires are looking out for each other. They’re willing to transcend difference and background and even politics. \"The fact that Bill Gates seems more willing to vote for Donald Trump than anyone else tells you everything you need to know about how far they’re willing to go to protect their excess, at the cost to everyday Americans.” Sanders jumped in to joke that the two billionaires make for their own “strong grassroots movement.” More:Michael Bloomberg qualifies for Democratic primary ballot in Alabama “Jeff Bezos, worth $150 billion, supporting Mike Bloomberg, whose worth only $50 billion, that's real class solidarity,” Sanders said with a chuckle. “I’m impressed by that grassroots movement. We on the other hand have had over a million people contribute to our campaign, in millions of individual contributions averaging $16 a piece. That's what we get from working class people. So a little bit different approach to politics.” On the campaign trail, Sanders frequently says that Amazon raised its starting wage to $15 an hour after pressure from him. Earlier Saturday, at a Des Moines summit on the climate change crisis, Sanders criticized billionaires deciding to run for president just because they have tremendous wealth. He didn’t name Bloomberg then, but made his point clear in an interview. Extreme wealth inequality, coupled with lack of regulation — like unlimited political spending allowed under the Citizens United Supreme Court decision — is seeping deeper into politics via things like the “absurdity” of Bloomberg pondering a run, he said. \"He's deciding because he is worth $50 billion, he's going to run for president of the United States,” Sanders said. “He doesn't have to worry about coming into Iowa, he doesn’t have to worry about going to New Hampshire or Nevada or South Carolina. He's just going to spend, I suspect, hundreds of millions of dollars in media in California because he's a billionaire. So that's the corruption of the political system based on the kind of massive wealth inequality that exists right now.\" Sanders brought up Bloomberg when tying his “Green New Deal” — the stated theme behind Ocasio-Cortez’s visit to Iowa — to a broader \"class war\" Sanders sometimes describes on the campaign trail. \"When you talk about class warfare within the context of climate change, like Alexandria was just saying, the fossil fuels industry makes billions of billions of dollars in profits every single year, and the people who suffer the most are often lowest income people. But it's not just low income people. Family farmers in Iowa and agriculture in Iowa is going to be suffering.” The “Green New Deal” would create “millions of good paying jobs while we save the planet for our children,” Sanders promised. The $16.2 trillion proposal, spread over 10 years, aims to fundamentally remake the economy around renewable energy and decarbonization. Ocasio-Cortez, a lead sponsor of the “Green New Deal” in Congress, agreed with the class war framework. Oil companies knew in the 1970s that carbon emissions would lead to global temperature increases, she said, and prioritized profits over being part of the solution. \"The climate crisis is not impacting all of us equally,” Ocasio-Cortez said. “It's happening along class lines, so I think it's important to acknowledge the essential classism in the issue and how it's impacting us.\"",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Green New Deal: AOC, Bernie Sanders team up on bill to modernize public housing",
      "url": "https://www.usatoday.com/story/news/politics/2019/11/14/aoc-bernie-sanders-unveil-green-new-deal-bill-updating-public-housing/4190376002/",
      "subtitle": "Green New Deal: AOC, Bernie Sanders team up on bill to modernize public housing",
      "author": "Ledyard King",
      "content": " WASHINGTON – What do public housing and climate change have in common? The Green New Deal. As part of the sweeping progressive program to confront global warming, Sen. Bernie Sanders, I-Vermont, and Rep. Alexandria Ocasio-Cortez, D-N.Y., Thursday held a Capitol Hill news conference to unveil the first plank of the ambitious plan: a bill designed to make housing cheaper, safer and more environmentally friendly. The Green New Deal for Public Housing Act would set aside $180 billion over 10 years to repair existing apartments, upgrade health and safety features and eliminate carbon emissions. The measure would also provide money to electrify all public housing buildings with clean energy, add solar panels, and start powering apartments housing low-income Americans using renewable energy sources. Ocasio-Cortez said it was no accident that the first legislation to implement the Green New Deal would center on poorer communities in urban and rural areas where widespread droughts, powerful hurricanes and strong tornadoes pose the greatest threat. \"This is how we show that tacking the climate crisis is an opportunity for us to create an economic stimulus and an economic boon not just for Wall Street but for working people,\" she said at the news conference. Backers say the bill \"dramatically improves\" living conditions for nearly 2 million people living in roughly 1 million public homes. Sanders said the Green New Deal isn't \"just about climate change. It is an economic plan to create millions of good-paying jobs.\" Democratic pushback:After Green New Deal goes down, Democrats try less ambitious approach to climate change One of the co-sponsors of the public housing bill is Sen. Elizabeth Warren, D-Mass., who is vying with Sanders for the Democratic presidential nomination in 2020. The bill's prospects appear dim given that the Senate is currentcontrolled by Republicans and most House Democrats have yet to sign on to the Green New Deal. Thursday's announcement comes less than a month after Ocasio-Cortez endorsed Sanders for president, a move that was seen as a key boost for the Vermont senator struggling to overtake Warren and former Vice President Joe Biden in the polls. More:Scientists want to help save the Earth by storing carbon dioxide in the ground Unveiled earlier this year, the Green New Deal calls for shifting completely from fossil fuels to renewable energy in the coming years and prescribes a broad social justice platform that includes free housing, medical coverage and higher education for all Americans. Mocked by Republicans as a socialist program that would end air travel and demolish the economy, the program has also faced pushback by moderate Democrats who have argued for smaller steps such as having the U.S. rejoin the Paris accord on climate change.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Stefanik lauded by Trump for impeachment fight but draws Democrats' ire",
      "url": "https://www.usatoday.com/story/news/politics/2019/11/18/upstate-ny-rep-elise-stefanik-lauded-trump-impeachment-hearings/4231819002/",
      "subtitle": "Stefanik lauded by Trump for impeachment fight but draws Democrats' ire",
      "author": "Joseph Spector",
      "content": " ALBANY – Elise Stefanik made history in 2014 when she was elected at age 30 as the youngest woman to be elected to Congress. Now she is gaining new notoriety in Washington and the nation. The upstate New York Republican has become a staunch defender of President Donald Trump during the House's impeachment hearings, drawing his praise but also scorn from Democrats. \"A new Republican Star is born. Great going @EliseStefanik!,\" Trump tweeted Sunday morning. The ascension is perhaps an unlikely role for Stefanik, who has sought to be a moderate Republican in a district that stretches from Saratoga County to the Canadian border and whose voters backed Barack Obama twice before flipping to Trump in 2016. As the only Republican woman on the House Intelligence Committee, Stefanik, 35, has coveted the role of playing adversary to the Democratic-led impeachment proceedings. \"Thanks, @realDonaldTrump & EVERYONE for the outpouring of support!\" she wrote Sunday night on Twitter. \"I will continue to work hard to pursue the truth on behalf of my constituents. The Radical Left will continue their sick attacks on me but I’m proud to represent the people of NY21!\" How to stay updated on USA TODAY's impeachment coverage Democrats, however, have ripped Stefanik, leading to a frenzied stretch of campaign donations for her and her opponent Tedra Cobb ahead of next November's elections. \"This is about GOOD v EVIL, not politics NOT Democrat or Republican,\" state Sen. Alessandra Biaggi, D-Pelham, Westchester County wrote Friday on Twitter. \"Truly a disappointment for the state of NY to have one our representatives on the wrong side of history.\" Stefanik has landed national attention for her piercing questions of witnesses during the hearings and her biting critiques of Rep. Adam Schiff, the California Democrat who chairs the Intelligence Committee. On Friday, she noted President Barack Obama's administration also raised concerns with the service of Hunter Biden, the son of then-Vice President Joe Biden, being on the board of the Ukraine-based energy company Burisma Holdings Stefanik insisted the younger Biden’s work for Burisma is a vital point to raise. “And yet our Democratic colleagues and the chairman of this committee cry foul when we dare ask that same question that the Obama State Department was so concerned about,” Stefanik said. “But we will continue asking it.” Later, Rep. Devin Nunes tried to allocate time to Stefanik, but was disallowed by Schiff under House rules. “What is the interruption this time?” Stefanik responded. “This is the fifth time you have interrupted duly elected members of Congress.” Stefanik did criticize Trump, chiding him for tweets that targeted U.S. Ambassador to Ukraine Marie Yovanovitch while she was testifying. \"I disagree with the tweet,\" Stefanik told reporters. \"I think Ambassador Yovanovitch is a public servant, like many of our public servants in the foreign service.\" More:Impeachment hearing: Marie Yovanovitch calls Trump's attacks on her 'intimidating' As a minority party member, Stefanik is one of only 13 Republican women in the House. At one point, Republicans charged that Schiff was treating a woman lawmaker unfairly. “You are gagging the young lady from New York,” Nunes said when Schiff prohibited her from speaking. The Harvard graduate's aggressiveness has drawn plaudits from her colleagues. “She’s effective. She’s a great spokesperson,” Rep. John Ratcliffe, R-Texas, another member of the Intelligence committee, told the Associated Press. “And these issues are in her wheelhouse.” Republicans benefitted from having a woman lead the questioning of Yovanovitch, Rep. Val Demings, D-Fla., told the AP. Demings called Yovanovitch “a female witness who is a career foreign service officer with an impeccable record.\" So if Republicans \"want to badger her, it’s a better look when a woman has taken the lead on that.” The major stage for Stefanik has led to national media profiles about her rise. The New York Post noted that she and Rep. Alexandria Ocasio-Cortez, the liberal New York lawmaker, are both among the youngest members of Congress, but have few similarities. Ocasio-Cortez, who represents New York City and grew up in Yorktown, Westchester, bested Stefanik's record as the youngest woman elected to Congress in 2018 when she was elected at age 29. “I am proudly the opposite of AOC,” Stefanik told The Post. More:Trump draws backlash from GOP, Democrats over Yovanovitch tweet More:Alexandria Ocasio-Cortez compares Yorktown residency scrutiny to 'birther' attacks Stefanik's rise has led Republicans in New York to rally around her, while Democrats have used her prominence among conservatives to pounce on her re-election bid. Cobb announced Sunday she has surpassed $1 million raised, and Cobb received the backing of Star Wars icon Mark Hamill and celebrity Chrissy Teigen. \"I am happy to announce we raised $1 million dollars! It is impossible to express the feeling of gratitude I have tonight,\" Cobb wrote Sunday night on Twitter. \"Together we started something big but it’s not over yet.\" Support for Cobb led to a fight on Twitter when George Conway, a Trump foe and husband of Trump adviser Kellyanne Conway, called Stefanik \"lying trash. Please give to her opponent.\" Nikki Haley, former U.S Ambassador to the United Nations, responded Monday, \"This is absolutely uncalled for and disgusting. What is wrong with people? George Conway is the last person that can call someone “trash”. #Pathetic\" And Stefanik replied, \"The one thing I’ve NEVER been called in my life is TRASH. You need serious help. My opponent Taxin’ Tedra can have your sick mysogynist support.\" The barbs led Republicans to urge support of Stefanik, who is the first Republican to represent the district in 22 years, and to raise money for her re-election in 2020. She is just one of five Republicans among New York's 27 congressional members. The district stretches from the Capital region across the Adirondacks and has 47,000 more Republicans than Democrats. Local party leaders on Monday vowed in a joint letter their united support for Stefanik \"as she leads our country through this historic moment.\" More:Judge delivers blow to Donald Trump's quest to shield his tax returns More:Donald Trump ordered to pay $2M to charity to settle Trump Foundation lawsuit",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "AOC on DC statehood: 'Disenfranchisement' of DC rooted in the 'history of slavery'",
      "url": "https://www.usatoday.com/story/news/politics/2019/09/19/ocasio-cortez-disenfranchisement-d-c-rooted-legacy-slavery/2375336001/",
      "subtitle": "AOC on DC statehood: 'Disenfranchisement' of DC rooted in the 'history of slavery'",
      "author": "Nicholas Wu",
      "content": " WASHINGTON – Rep. Alexandria Ocasio-Cortez, D-N.Y. weighed in on D.C. statehood during a Thursday hearing on the issue and discussed the \"disenfranchisement\" of the District's people as rooted in the \"history of slavery.\" She opened her statement by talking about her family's roots in Puerto Rico, a U.S. territory, and how her family had lacked the right to vote in federal elections. \"I wish that upon no citizen of the United States of America,\" she said. \"Where the disenfranchisement of Puerto Ricans was rooted in the colonialist and imperialistic history that we've had in policies of the United States, the issue of D.C. statehood is rooted in a different evil in our history, which is the history of slavery in the United States,” she added. Ocasio-Cortez cited the disenfranchisement of the majority-minority city as \"upholding the injustice of the practices enacted during slavery.\" \"It is a profound injustice and a thick irony of our history that the people who fled here to the District of Columbia to free slavery because of the enlightenment of this community are now disenfranchised,\" she said, observing that the District was the first part of the Union to emancipate slaves. The hearing before the House Committee on Oversight and Reform was to debate a D.C. statehood bill, aptly named \"H.R. 51,\" in the first House of Representatives hearing on statehood since 1993. How does statehood work?:Will DC become the 51st state? Advocates to make their case in Congress with boost from Elizabeth Warren Other debate in the hearing surrounded practical matters like the governance of buildings like the Trump International Hotel, which is in a building still owned by the federal government, but would be included within the boundaries of the new state. Rep. Thomas Massie, R-Ky., asked about its fate. D.C. Mayor Muriel Bowser told him that all hotels would be included in the new state. The question drew derision from Rep. Jamie Raskin, D-Md., who joked that the hotel was the \"Washington Monument.\" \"It's amazing to me that the political rights of 700,000 people might be conditioned on the business interests of one man,\" said Rep. Jamie Raskin, D-Md.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    }
  ]
}