{
  "articles": [
    {
      "title": "Tax on. Tax off.",
      "url": "https://www.usatoday.com/story/nletter/short-list/2017/12/19/gop-tax-bill-amtrak-track-palin/967143001/",
      "subtitle": "Tax on. Tax off.",
      "author": "",
      "content": "The 'once in a generation opportunity' has to wait another day Three cheers for passing an epic tax overhaul bill were quickly silenced by three unlawful provisions. Here's what's happened: The House on Tuesday passed the most significant changes to the tax code in three decades. \"This is a once in a generation opportunity,\" said Senate Majority Leader Mitch McConnell, R-Ky. As House Republicans celebrated their first major victory, the bill was heading to the Senate for an evening vote and was likely to pass. But the Senate parliamentarian ruled that three minor provisions did not comply with strict budget rules and would have to be stripped out. That means the Senate will likely vote Tuesday night on a revised bill, and the House will have to vote again Wednesday to pass it. Then Republicans can deliver a $1.5 trillion package for President Trump to sign into law before Christmas, as he requested. Disturbing details emerge after weekend arrest of Sarah Palin's son The incident was first described as \"domestic violence,\" but more details reveal that Track Palin, son of former Alaska governor and vice presidential candidate Sarah Palin. was charged with beating up his father after breaking into his parents' house. Track Palin, 28, had said he wanted to retrieve his truck, but his dad, Todd Palin, said don't come over. The son told police he broke a window, disarmed his father and put him on the ground and hit him around the head, according to an affidavit by Wasilla police in Alaska. By the time police arrived, Todd Palin was bloodied and bruised. The son yelled at officers and “moved around in a strange manner” before being arrested without incident, the affidavit states. Track Palin is charged with felony first-degree burglary and misdemeanor fourth-degree assault. Sarah Palin has said her son suffers from PTSD from military service. He faced previous domestic violence charges in 2016. Heroes emerged amid chaos after Amtrak crash near Seattle An Eagle Scout and a surgeon driving on Interstate 5 became heroes when they stopped to help rescue and treat victims in Monday's deadly Amtrak derailment south of Seattle. Daniel Konzelman told The Seattle Times he saw broken ankles, head injuries, a lot of blood and passengers paralyzed with shock. The Scout tapped into his first-aid training and crawled through shattered train cars to help. Neurosurgeon Nathan Selden helped treat people at a medical triage tent. Three people died and dozens were injured when the train took a curve at 80 mph, exceeding the 30 mph limit. Automatic breaking equipment was installed on the tracks but was still being tested. Homeopathy: medicine or pseudoscience? The FDA is weighing in. Unregulated homeopathic treatments are on drugstore shelves next to traditional medicine, but they lack FDA approval and warning labels. Why? In 1988, the Food and Drug Administration decided that anything labeled as homeopathic didn't need agency approval. The FDA is partially reversing course now, saying it will scrutinize some homeopathic products. The agency will look at remedies aimed at vulnerable groups, such as infants and people who might be using them for life-threatening diseases like cancer. What is homeopathy? It aims to treat illnesses with diluted forms of substances that cause an illnesses' symptoms, and proponents like Gwyneth Paltrow have pushed them into the mainstream. Critics call it a potentially dangerous and unproven pseudoscience. What's more annoying than 'fake news'? The second most annoying phrase of the year was tweeted by President Trump 147 times: \"fake news.\" A Marist Poll found that 23% of Americans disliked the term, though \"whatever\" was deemed most annoying. Whatever. The other contenders for \"most annoying\" phrase/word: \"no offense, but\" (20%) \"literally\"  (11%) and \"you know what I mean\" (10%). The Marist Poll has surveyed Americans about annoying phrases for the past nine years. This year, Marist surveyed 1,074 people from Nov. 6-9, with a margin of error of 3 percentage points.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "From jokester to 'maverick,' John McCain is a study in contradictions",
      "url": "https://www.usatoday.com/story/news/politics/2018/04/03/jokester-maverick-john-mccain-study-contradictions/483145002/",
      "subtitle": "From jokester to 'maverick,' John McCain is a study in contradictions",
      "author": "",
      "content": "Editor's note: This is the first of an 18-chapter profile of Sen. John McCain, portions of which originally were published in October 1999 and March 2007. It has been updated and expanded. Read more about this project: John McCain’s American Story. For all the different names and titles worn by John McCain over the years — \"maverick\" perhaps being the best remembered — the decorated veteran, former prisoner of war, U.S. senator, presidential nominee and frequent talk-show guest is difficult to label. \"Complex\" is as good a place to start as any. Some might even say contradictory. McCain, who in 2015 became chairman of the influential Senate Armed Services Committee, has been hawkish on Afghanistan, Iraq, Iran, Kosovo, Ukraine, Syria and even North Korea. (The liberal magazine Mother Jones once published a map: \"All the Countries John McCain Has Wanted to Attack.\") Yet as a congressman, McCain voted against extending President Ronald Reagan's Marine mission in Lebanon. In the 1980s he vacationed in the Bahamas with savings-and-loan tycoon Charles Keating. In the 1990s he crusaded for campaign-finance reform. He ascended to Congress amid Reagan's first term and still calls himself a \"Reagan Republican.\" Two decades later, Democrats approached him about changing his party affiliation. He sparred frequently with Democratic President Barack Obama, and continues to do so with Republican President Donald Trump. He voted against President George W. Bush's sweeping tax relief package in 2001, but voted in 2006 to extend those tax cuts. He campaigned for re-election in 2016 on a vow to repeal the Affordable Care Act but gave a memorable thumbs-down on the Senate floor to a partisan GOP measure that would have eliminated key parts of the law, saying bipartisan cooperation and a return to regular order was needed to fix the U.S. health-care system. Then, a few months later, McCain fell in line with fellow Republicans to support a sweeping tax-reform package that some critics warned carried deficit concerns not unlike the Bush tax cuts. Running for president in 2000, McCain overtly appealed to independents, Democrats and centrist Republicans, promising to forge a new \"McCain Majority.\" He scorned powerful leaders of the Religious Right, denouncing Pat Robertson and Jerry Falwell as \"agents of intolerance.\" Then, in May 2006, McCain turned around and delivered the commencement address at Falwell's Liberty University in Lynchburg, Virginia. His 2008 presidential campaign theme was \"Common-sense conservatism.\" That campaign's slogan, \"Country First.\" But when it came to picking a running-mate — one of a presidential nominee's most important decisions — McCain chose Sarah Palin, the inexperienced, little-known Alaska governor who appealed largely to the far right and who, some say, was a harbinger of the far-right populism that ushered Trump into the White House. After he returned to the Senate following his loss to Obama, the contradictions continued. In his 2010 re-election race, McCain fended off anti-\"amnesty\" opponents on the right by hardening his stance on immigration, famously promising to \"complete the danged fence\" on the U.S.-Mexico border. By 2013, McCain was again leading bipartisan efforts to overhaul the nation's immigration system, helping to write the \"Gang of Eight\" bill that would have provided a pathway to citizenship for millions of undocumented immigrants who had settled in the country as well as make an unprecedented investment in border security. The Democrat-controlled Senate passed the legislation but the GOP-controlled House of Representatives refused to consider it. While some see cynical election-year maneuvering, McCain has maintained he never abandoned his support for comprehensive immigration reform, just emphasized the border-security part of it. In his 2016 Senate race, Democrats attempted to tether him to Trump, who made one controversial statement after another while on the campaign trail. It didn't work, but after months of saying he would support the GOP nominee, McCain withdrew his endorsement. The final straw for McCain was a vulgar recording of Trump talking about women in degrading ways. What gives? \"I think life is a series of contradictions,\" former McCain political consultant Jay Smith once observed. \"Life is complex. Who among us is so simplistic that you can just pigeonhole?\" Questions about his sometimes-prickly personality and temperament dogged him for years. He wrote in a memoir about how as a toddler he would get angry and would hold his breath until he blacked out. Yet longtime staff members, friends and even his ex-wife remain fiercely loyal to him. \"It's fun to be around him,\" said Deb Gullett, who cut her political teeth working for McCain before embarking on her own brief political career in the Arizona Legislature. \"He cuts up all the time. If you screw up, you feel worse about it than he does.\" McCain has described himself as a \"wise ass.\" His edgy and sarcastic sense of humor — even when it's schtick — helped cement his media image as a straight-talking \"maverick\" and made him a hit with late-night TV hosts such as Jay Leno, David Letterman, Conan O'Brien and Seth Meyers. Other times, his mouth has gotten him in trouble. Back when he entered politics, he once referred to the Arizona retirement community of Leisure World as \"Seizure World.\" During the Clinton administration, it was a joke about first daughter Chelsea Clinton's looks that prompted criticism. McCain isn't easy to figure out. And rarely predictable. John Sidney McCain III was born Aug. 29, 1936, in the Panama Canal Zone, the namesake of his father and grandfather, both distinguished four-star Navy admirals. In July 1967, McCain, a naval aviator, barely escaped death on the USS Forrestal in a fiery disaster that killed 134 of his shipmates and nearly sank the aircraft carrier in the Gulf of Tonkin. That October, his A-4 Skyhawk attack bomber was blown out of the sky over North Vietnam, landing him in a prisoner-of-war camp where he endured severe brutality and would spend more than five years. Those days seem long ago. \"I'm older than dirt, and I have more scars than Frankenstein\" was McCain's stock response to questions about his age during the 2008 presidential campaign. Had he won that race, McCain would have taken office, at age 72, as America's oldest president. Yet McCain kept an exhausting schedule for years following the 2008 race. In Congress, McCain earned the nickname \"White Tornado\" by working a relentless schedule. As late as May 2017, at age 80, McCain made the right-leaning news website Newsmax's list of the \"15 Hardest-Working Senators in America.\" During the 2006 congressional midterm campaign season, McCain stumped for GOP hopefuls in every state, appearing at 346 candidate and party events and raising $10.5 million. He flew nearly 138,000 miles. McCain seemed tireless in his unsuccessful 2008 presidential bid. Six years later he campaigned all over the country for fellow Republicans during the 2014 election cycle in which the GOP retook control of the Senate. He often unexpectedly turns up in war zones, where he visits the troops and gets a firsthand look at conditions on the ground. In May 2013, McCain made a surprise, and dangerous, visit to Syria to meet rebel leaders in that country's civil war. McCain has hiked nearly every trail in Arizona, from the well-known to the obscure. During a 1990s trip to Lake Powell, he led his party through a slot canyon where the water almost covered their heads. At the time, Gullett jokingly dubbed it \"the McCain Death March.\" But there have for years been ample signs that McCain is mortal. A scar from a serious 2000 skin-cancer operation still is visible on the side of his face. Aides often must comb McCain's hair before he goes on TV — his war-damaged shoulders prevent him from doing it himself. On July 14, 2017, McCain underwent an emergency craniotomy to address a blood clot that was later revealed to be associated with glioblastoma, a deadly form of brain cancer. As word of his grim diagnosis spread, a common refrain was that if anyone could beat such a grim diagnosis it would be McCain. “Never underestimate him,” said Chuck Coughlin, who moved to Arizona in 1986 to work as finance director for McCain’s first Senate campaign. “The guy has endured more s--t than anyone I’ve met in my life in terms of health issues.” McCain returned to the Senate just days after his brain cancer was disclosed, with a visible surgery cut above his eye. Here is a contradiction that probably stumps even McCain. He used to brag how his insurgent 2000 White House bid disrupted Bush's anticipated GOP coronation and how he spent the early part of Bush's first term as the president's No. 1 Republican rival. He has long criticized Bush's and former Defense Secretary Donald Rumsfeld's handling of the Iraq War and bucked the White House over the treatment of war-on-terror detainees at Guantanamo Bay. In the irony of ironies, McCain's presidential ambitions sank because they were largely anchored to Bush's failing poll numbers. McCain's and Bush's Iraq policy were closely linked, and opponents saddled McCain with the war and other assorted liabilities associated with Bush's presidency. Bush took McCain's suggestion to up the ante in Baghdad by announcing he would deploy another 21,500 troops. \"Knowing him, he's not going to back down on it for political reasons,\" Smith, his former political consultant who died in 2014, said of the Iraq strategy at the time. \"But like it or not, facts are facts, and upwards of 70 percent of the American people today are against our involvement in Iraq.\" When McCain's campaign was struggling in the Republican primaries after nearly going bankrupt, McCain embarked on a \"No Surrender Tour\" of the key early states. The tour, launched on Sept. 11, 2007, in Iowa, reflected McCain's belief in the need for victory in the Iraq War as well as his own indomitable spirit in the face of daunting poll and fundraising numbers and other political challenges. It laid the groundwork for his comeback to win the 2008 GOP nomination. Ultimately, McCain was unable to persuade Americans — Republicans, Democrats and independents — that they should replace an unpopular Republican president with another Republican. McCain's sixth Senate term — expected to be his final one, if his health allows him to complete it — could be his most consequential. His national stature and Armed Services Committee gavel, and freedom from re-election pressures, allows McCain to act as a Republican check on Trump, with whom he has publicly feuded on and off since 2015. McCain's deep appreciation for history prompted him to sound the alarm that the nationalist and isolationist sentiments of the Trump era suggest a failure to learn the lessons of the 20th century. In emotional October 2017 remarks while accepting the National Constitution Center's Liberty Medal, McCain attacked the worldview that called for the United States to relinquish its global leadership responsibilities. \"To fear the world we have organized and led for three-quarters of a century, to abandon the ideals we have advanced around the globe, to refuse the obligations of international leadership and our duty to remain 'the last, best hope of earth' for the sake of some half-baked, spurious nationalism cooked up by people who would rather find scapegoats than solve problems is as unpatriotic as an attachment to any other tired dogma of the past that Americans consigned to the ash heap of history,\" McCain said to cheers. McCain urged the United States to preserve its ideals at home and \"champion\" them abroad. \"We have done great good in the world. That leadership has had its costs, but we have become incomparably powerful and wealthy as we did,\" McCain said in the speech he delivered in Philadelphia. \"We have a moral obligation to continue in our just cause, and we would bring more than shame on ourselves if we don’t.\" Though McCain later said he wasn't talking specifically about Trump, the president seemed to take the comments personally. \"Yeah, well, I hear it, and people have to be careful because at some point I fight back,\" Trump said on Washington, D.C., radio station WMAL. \"I'm being very nice. I'm being very, very nice. But at some point I fight back, and it won't be pretty.\" McCain was unbowed. He had faced Trump's fury many times before, including when he snuffed the GOP Senate bid to undo the Affordable Care Act, or \"Obamacare,\" a top priority of Trump's. McCain had made a dramatic stand for something he had long called for: a return to the regular order and the bipartisan camaraderie of a Senate that seemed distant in an age of perpetual partisan gridlock. He said he still supported repealing and replacing Obamacare, which he maintains has failed in Arizona, but wants to do it by writing and debating legislation in the relevant committees — not crafting a bill behind closed doors with no input from the other party. McCain faulted the Democrats for passing the Affordable Care Act in 2010 without the GOP and argued that it would take Republicans and Democrats coming together to find a stable solution from the health-care sector. McCain likewise has showed courage in fighting his deadly brain cancer, undergoing chemotherapy and radiation treatment that eventually required him to use a wheelchair on Capitol Hill. In a September 2017 interview with CNN, McCain, 81, said he was \"getting the best treatment that anybody could get\" but also was celebrating his life. McCain told CNN's Jake Tapper how he hopes the American people will remember him when he's gone. \"He served his country,\" McCain said. \"And not always right. Made a lot of mistakes. Made a lot of errors. But served his country. And I hope you could add 'honorably.' \" NEXT CHAPTER:Destined for the Naval Academy Chapter 1: John McCain aA study in contradiction\nChapter 2: John McCain was destined for the Naval Academy\nChapter 3: John McCain was 'a very determined guy' as a POW\nChapter 4: John McCain's political ambition emerged after POW return\nChapter 5: John McCain's political career began after Arizona move\nChapter 6: Ever-ambitious, John McCain rises to the Senate\nChapter 7: John McCain 'in a hell of a mess' with Keating Five\nChapter 8: After Keating Five, John McCain faced new scandal\nChapter 9: John McCain becomes the 'maverick'\nChapter 10:'Ugly' politics in John McCain's 2000 presidential run\nChapter 11: John McCain was frequent foe of Bush in early years\nChapter 12: John McCain goes establishment for 2nd White House run\nChapter 13: John McCain had rough start to 2008 presidential race\nChapter 14: John McCain clinches 2008 GOP presidential nomination\nChapter 15: John McCain takes on Obama for president in 2008\nChapter 16: John McCain fails in second bid for president\nChapter 17: 'Complete the danged fence,' John McCain proclaims\nChapter 18: John McCain wins 6th term, reclaims 'maverick' label ",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Tax on. Tax off.",
      "url": "https://www.usatoday.com/story/news/2017/12/19/house-tax-bill-track-palin-amtrak/964549001/",
      "subtitle": "Tax on. Tax off.",
      "author": "",
      "content": "Three cheers for passing an epic tax overhaul bill were quickly silenced by three unlawful provisions. Here's what's happened: The House on Tuesday passed the most significant changes to the tax code in three decades. \"This is a once in a generation opportunity,\" said Senate Majority Leader Mitch McConnell, R-Ky. As House Republicans celebrated their first major victory, the bill was heading to the Senate for an evening vote and was likely to pass. But the Senate parliamentarian ruled that three minor provisions did not comply with strict budget rules and would have to be stripped out. That means the Senate will likely vote Tuesday night on a revised bill, and the House will have to vote again Wednesday to pass it. Then Republicans can deliver a $1.5 trillion package for President Trump to sign into law before Christmas, as he requested. The incident was first described as \"domestic violence,\" but more details reveal that Track Palin, son of former Alaska governor and vice presidential candidate Sarah Palin. was charged with beating up his father after breaking into his parents' house. Track Palin, 28, had said he wanted to retrieve his truck, but his dad, Todd Palin, said don't come over. The son told police he broke a window, disarmed his father and put him on the ground and hit him around the head, according to an affidavit by Wasilla police in Alaska. By the time police arrived, Todd Palin was bloodied and bruised. The son yelled at officers and “moved around in a strange manner” before being arrested without incident, the affidavit states. Track Palin is charged with felony first-degree burglary and misdemeanor fourth-degree assault. Sarah Palin has said her son suffers from PTSD from military service. He faced previous domestic violence charges in 2016. An Eagle Scout and a surgeon driving on Interstate 5 became heroes when they stopped to help rescue and treat victims in Monday's deadly Amtrak derailment south of Seattle. Daniel Konzelman told The Seattle Times he saw broken ankles, head injuries, a lot of blood and passengers paralyzed with shock. The Scout tapped into his first-aid training and crawled through shattered train cars to help. Neurosurgeon Nathan Selden helped treat people at a medical triage tent. Three people died and dozens were injured when the train took a curve at 80 mph, exceeding the 30 mph limit. Automatic breaking equipment was installed on the tracks but was still being tested. Unregulated homeopathic treatments are on drugstore shelves next to traditional medicine, but they lack FDA approval and warning labels. Why? In 1988, the Food and Drug Administration decided that anything labeled as homeopathic didn't need agency approval. The FDA is partially reversing course now, saying it will scrutinize some homeopathic products. The agency will look at remedies aimed at vulnerable groups, such as infants and people who might be using them for life-threatening diseases like cancer. What is homeopathy? It aims to treat illnesses with diluted forms of substances that cause an illnesses' symptoms, and proponents like Gwyneth Paltrow have pushed them into the mainstream. Critics call it a potentially dangerous and unproven pseudoscience. The second most annoying phrase of the year was tweeted by President Trump 147 times: \"fake news.\" A Marist Poll found that 23% of Americans disliked the term, though \"whatever\" was deemed most annoying. Whatever. The other contenders for \"most annoying\" phrase/word: \"no offense, but\" (20%) \"literally\"  (11%) and \"you know what I mean\" (10%). The Marist Poll has surveyed Americans about annoying phrases for the past nine years. This year, Marist surveyed 1,074 people from Nov. 6-9, with a margin of error of 3 percentage points.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Track Palin, son of former Alaska Governor Sarah Palin, arrested for domestic violence, other charges",
      "url": "https://www.usatoday.com/story/news/nation/2017/12/18/track-palin-son-former-alaska-governor-sarah-palin-arrested-domestic-violence-other-charges/960281001/",
      "subtitle": "Track Palin, son of former Alaska Governor Sarah Palin, arrested for domestic violence, other charges",
      "author": "",
      "content": "ANCHORAGE, Alaska – Court documents say Track Palin, the oldest son of former Alaska Gov. Sarah Palin, was arrested on charges related to domestic violence again. He was arraigned Sunday morning on three counts of felony burglary, misdemeanor reckless assault and misdemeanor criminal mischief. He remained jailed in Palmer, Alaska, as of Sunday afternoon. Track Palin previously faced domestic violence charges in 2016. Court records say he was suspected of punching his girlfriend, who then became concerned that Palin was going to shoot himself with a rifle. He took a plea deal that resulted in some of the charges being dismissed and he pleaded guilty to misdemeanor possessing a firearm while intoxicated. Attorney John Tiemessen, who said he represents Sarah Palin, acknowledged the arrest Sunday and asked for privacy. No attorney was listed for Track Palin.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Track Palin left his father, Todd, bleeding after breaking into home, according to police report",
      "url": "https://www.usatoday.com/story/news/nation/2017/12/19/track-palin-left-his-father-todd-bleeding-after-breaking-into-home-according-police-report/964018001/",
      "subtitle": "Track Palin left his father, Todd, bleeding after breaking into home, according to police report",
      "author": "",
      "content": "At first it was described as “domestic violence.” Now, disturbing new details have emerged in the weekend arrest of Track Palin, a son of former Alaska governor and vice presidential candidate Sarah Palin, including the allegation that he left his father, Todd, bloodied and bruised. Police were called to the home Saturday night by Sarah Palin, where her husband was found to be bleeding from cuts on his head, according to an affidavit by Wasilla Police Officer Adam LaPointe. Todd Palin told police the dispute began when his son, Track Palin, 28, called to retrieve his truck. Palin, 53, said he told his son not to come over but was told that he would come anyway to “beat his ass,” LaPointe wrote, according to the Anchorage Daily News. The elder Palin said he fetched a pistol to protect his family. Track Palin told police he broke a window, disarmed his father and put him on the ground and hit him around the head, the newspaper reported. LaPointe wrote that the senior Palins had left the home when police arrived and that Sarah Palin was visibly upset. According to the Los Angeles Times, Sarah Palin called police at 8:30 p.m. and said her son was \"freaking out and was on some type of medication.\" Track Palin yelled at officers, calling them “peasants,” and “moved around in a strange manner” for about 15 or 20 minutes before being arrested without incident, the affidavit states. He said he had “consumed a few beers.” He was arraigned Sunday and charged with felony first-degree burglary and misdemeanor fourth-degree assault. He was still jailed at Mat-Su Pretrial Facility as of Monday evening, according to the Times. More:Track Palin, son of former Alaska Governor Sarah Palin, arrested for domestic violence, other charges More:Sarah Palin's husband hurt in 'very serious' accident More:Sarah Palin says arrested veteran son suffered PTSD More:Sarah Palin endorses Donald Trump for president Court records did not immediately list an attorney for him, the paper reported. He is scheduled for a preliminary hearing next week. Todd Palin, reached by the Daily News, declined to comment about the incident, other than to say, \"We're fine. We're fine.\" On Sunday, the Palins' attorney, John Tiemessen, released a statement saying: \"Given the nature of actions addressed last night by law enforcement and the charges involved, the Palins are unable to comment further. They ask that the family's privacy is respected during this challenging situation just as others dealing with a struggling family member would also request.\" The Associated Press contributed to this story.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "What's in the whopping budget deal Congress just passed? A basket of goodies",
      "url": "https://www.usatoday.com/story/news/politics/onpolitics/2018/02/09/whats-whopping-budget-deal-congress-passed/322640002/",
      "subtitle": "What's in the whopping budget deal Congress just passed? A basket of goodies",
      "author": "",
      "content": "WASHINGTON – Congress passed a $400 billion budget deal Friday that busted through spending caps and suspended the debt limit for a year. It included money for disaster relief, opioid treatment and veterans, as well as a six-week spending package to keep the lights on at government agencies while a year-long spending bill gets drafted. The whopping 652-page document has plenty of additional provisions tucked in. Here are a few:  A number of tax breaks that expired at the end of 2016 will be renewed retroactively for 2017, so people can claim them on this year’s tax returns. Fiscal conservatives didn’t like the extension of the breaks because they said the point of the tax overhaul bill passed late last year was to do away with temporary, targeted tax breaks. The budget deal included them anyway. “There should now be no need to extend any expiring tax provision. If a provision wasn’t extended in the tax reform bill, Congress has already determined that provision’s long-term fate,” Taxpayers for Common Sense, an advocacy group, said in a statement. Some of the folks who will see tax benefits include owners of racehorses and motor sport entertainment complexes and certain types of energy production facilities. Senate Majority Leader Mitch McConnell, R-Ky., helped draft the budget agreement, and his home-state school will enjoy the benefits. The bill includes a provision to help a small school called Berea College, which does not charge tuition. The provision exempts schools that don’t charge tuition from having their endowments taxed. It was supposed to be in the tax bill that passed last year but was stripped out at the last minute. The bill includes language extending and expanding a tax credit to reward companies for practicing “carbon capture and storage,” an expensive process supporters say can extract up to 90% of the carbon dioxide emissions generated from the use of fossil fuels in producing electricity and other industrial processes. The measure had bipartisan support: Republicans like that the process helps industry extract hard-to-reach oil and natural gas deposits, and Democrats like it because of its potential to reduce carbon emissions that contribute to climate change. A controversial panel created by the Affordable Care Act to control Medicare costs was eliminated. The Independent Payment Advisory Board had not been operating because Medicare spending hadn't reached levels that would trigger the advisory group to make recommendations to Congress on how to cut costs. But it has been a political target since former vice presidential candidate Sarah Palin dubbed it a \"death panel,\" arguing it would lead to rationing of care. The bill accelerates changes made in the Affordable Care Act to reduce the amount of out-of-pocket costs a senior has to pay for drug coverage. The \"doughnut hole\" in Medicare's drug benefit will be eliminated one year earlier than it would have been under the ACA. Seniors with incomes of more than $500,000 a year (or $750,000 for a couple) will have to pay a greater share of their Medicare bills. Those highest income earners will owe 85% of program costs, instead of 80% under current law. Most Medicare beneficiaries pay 25%. Many health initiatives will get a boost, including $6 billion targeted to fight the opioid epidemic and fund mental health initiatives. The legislation extends the government's major health insurance program for lower-income children an additional four years beyond a six-year renewal Congress recently approved. The bill increases funding for community health centers, which serve lower-income patients. It delays Medicaid cuts to hospitals that serve large shares of poor people, adds funds to repair and rebuild veterans’ health clinics and boosts funding for medical research. Communities hit by last year’s hurricanes, wildfires and other disasters will benefit from more than $80 billion in disaster relief money. The bill replenishes the Federal Emergency Management Agency’s disaster fund with $23 billion for immediate response and adds $5 billion in Medicaid spending for Puerto Rico and the Virgin Islands. The Army Corps of Engineers gets more than $17 billion, mostly for projects aimed at reducing the risk of damage from storms. New funding will help rebuild homes, restock food banks, restart schools, compensate farmers for lost crops and repair small businesses and military installations. The bill lets churches and other religious organizations receive disaster assistance, which civil liberties groups said violates the Constitution. The bill spends more than $1 billion helping cotton and dairy producers who have complained that federal programs aren’t enough when market prices are low and production costs are high. Taxpayers for Common Sense called this a “wasteful and unnecessary bailout” that will set the stage for further increases when lawmakers rewrite all agriculture programs this year. The bill includes $20 billion that lawmakers said will be used for improving roads, water treatments plants, broadband in rural areas and energy infrastructure. The bill creates a special committee to recommend steps to help miners and other retirees with failing pension plans without damaging the federally managed Pension Benefit Guaranty Corp., a backstop for private pension plans. The committee is supposed to come up with a fix by the end of the year. ",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Barbara Bush: Lesser-known facts about former first lady",
      "url": "https://www.usatoday.com/story/news/politics/onpolitics/2018/04/17/barbara-bush-former-first-lady-facts/518930002/",
      "subtitle": "Barbara Bush: Lesser-known facts about former first lady",
      "author": "",
      "content": "The wife of America's 41st president and mother to its 43rd, Barbara Bush has been among the nation's most prominent and respected women for decades. USA TODAY looks at some facts about her life you may not be aware of. 1. She met her husband, George H. W. Bush, at a dance when she was just 16. He was then a senior at Phillips Academy in Andover, Mass. 2. Formerly Barbara Pierce, Bush is a distant relative to the country's 14th president, Franklin Pierce. 3. In the summer of 1943, during World War II, she worked at a nuts-and-bolts factory in Port Chester, N.Y., Bush wrote in her memoir. 4. In 1969, while her husband served in Congress, Bush began writing a column for Houston newspapers about life in Washington. 5. She wrote two children's books, C. Fred's Story and Millie's Book. Both were written from the perspective of a family dog. 6. In her memoir, Bush writes about hosting a wedding luncheon for the daughter of a close friend of Lyndon Johnson in 1970, which the former president attended. Although she said LBJ \"could not have been a better guest,\" she added that her daughter and a friend \"were in deep shock\" when Johnson snagged the newspaper from the family's front yard when he left. 7. In an interview with Larry King in 2010, she said of Sarah Palin: \"I sat next to her once, thought she was beautiful. And I think she's very happy in Alaska. And I hope she'll stay there.\" 8. She recounts in her memoir her irritation at Jane Pauley of the Today show who, during the 1980 New Hampshire GOP primary campaign, asked her during an interview, \"Mrs. Bush, people say your husband is a man of the '80s and you are a woman of the '40s. What do you say to that?\" The interview had to be reshot after the tape was ruined, Bush wrote. 9. While George Bush was ambassador to China, Secretary of State Henry Kissinger and his family visited the Bushes and had Thanksgiving lunch with them. Barbara Bush wrote in her memoir that she could tell during the visit they were being spied on by Chinese authorities. 10. She writes that she initially \"dreaded\" attending the 1980 Republican National Convention, but once there, she said she became \"very competitive.\" George Bush would ultimately be tapped during the convention by Ronald Reagan to be his running mate. More:Barbara Bush, former first lady and matriarch of Bush family, dies at 92 More:Barbara Bush on George H. W. Bush: 'Still in love with the man I married 72 years ago' More:Barbara Bush: Lesser-known facts about former first lady More:Spending a Mother's Day with Barbara Bush More:Barbara Bush: In her own words, from political prognostication to 'rhymes with rich'  ",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Student who hacked Sarah Palin's emails during 2008 campaign dies",
      "url": "https://www.usatoday.com/story/news/politics/2018/02/08/student-who-hacked-sarah-palins-emails-during-2008-campaign-dies/322013002/",
      "subtitle": "Student who hacked Sarah Palin's emails during 2008 campaign dies",
      "author": "",
      "content": "MEMPHIS — David Kernell, the University of Tennessee-Knoxville student who guessed his way into Republican vice presidential nominee Sarah Palin’s personal email account in 2008, died last week in California. He was 30. Kernell, son of Shelby County Schools board member and former Democratic state representative Mike Kernell, died of complications related to progressive multiple sclerosis (MS) late Friday or early Saturday, his family confirmed in a statement Thursday. David Kernell, once ranked in the top 10% of chess players in the U.S., was a 20-year-old economics major at UT when he guessed the security answers to enter Palin's Yahoo! account, changed the password to \"popcorn,\" and then posted the new password, family photographs and some emails on the online message board 4chan under the pseudonym \"Rubico.\" More:Judge rejects Sarah Palin lawsuit against The New York Times More:Sarah Palin, Ted Nugent and Kid Rock visit the White House Kernell, who read that Palin may have conducted official business as governor of Alaska on her personal account, failed to find politically damaging information about Palin, who was Sen. John McCain's running mate at the time of the hacking. The case earned the younger Kernell searing criticism from Palin and her fans, with Palin comparing the hacking to Watergate, the 1972 break-in at the Democratic National Committee that gradually led to President Richard Nixon's resignation. At the trial, Palin described the hacking as \"the most disruptive and discouraging\" moment of the campaign. But federal jurors and a judge took a softer view of the infiltration. In 2010, after all but one of the felony charges were dropped, he served 10 months in a minimum-security prison for obstruction of justice after destroying evidence from his computer. He also was convicted of a misdemeanor for illegally accessing Palin's email. Between all the charges, Kernell had faced a maximum of five years in prison, a $250,000 fine and three years probation. After exiting prison in 2011, Kernell was released from U.S. Probation Office supervision in 2013. In a page-long statement regarding his death, the family said Kernell was diagnosed with MS in 2014 and participated in clinical research trials at the Cedars-Sinai Neurosciences Research Center in Los Angeles to help develop cures and treatments for other victims of MS. \"David did not let (the Palin) incident define him,\" the family said. \"He returned to UT Knoxville to complete his economics degree and further refined his programming skills by helping his local community. He first volunteered his expertise to Tennessee Voices for Children, a child advocacy non-profit group. Later, he moved to California and worked to develop facial recognition software that could identify children at risk of abuse.\" Wade Davies, a Knoxville attorney who represented Kernell in the case, declined to comment, saying he wanted to speak to Kernell's mother first. Davies argued during the trial that what Kernell did was closer to a prank — and one that wouldn't have been prosecuted as zealously if the victim hadn't been a rising Republican star. Allan Bogle, host of the program Into the Deep on radio station WEVL-FM, said he knew Kernell through the Memphis Chess Club and that he grew up to be a \"very smart guy.\" Bogle said Kernell used the same \"Rubico\" pseudonym to post Palin's information on 4chan as he used to play Bogle in online chess. \"For a brief period of time he was the most famous chess player in the country,\" Bogle said of the coverage of the Palin scandal. Before stepping into the national spotlight, Kernell graduated in 2006 from Germantown High School in the Memphis suburb of Germantown, where two years earlier he won the Tennessee Open Scholastic Chess Championship. Besides chess, Kernell enjoyed spearfishing, free diving, rock climbing, and wilderness exploration and online gaming, the statement reads. Rep. Jim Coley, Barlett Republican and family friend, said David was a good man, like his father and grandfather, Sam Kernell, who fought in both World War II and the Korean War. \"David picked up his good virtues from his father and his grandfather,\" Coley said. \"I was very sorry to learn about David's death.\" Services are being planned in Newport Beach, Calif., and in Germantown. Endowments in David’s honor are being set up at the Memphis Chess Club, Cedars-Sinai Neurosciences Research Center, and the Tennessee Voices for Children. Contributing: Jamie Satterfield, Knoxville (Tenn.) News Sentinel. Follow Ryan Poe on Twitter: @ryanpoe ",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Can you be a conservative feminist? Experts and activists weigh in",
      "url": "https://www.usatoday.com/story/news/2018/03/06/can-you-conservative-feminist-experts-weigh/374061002/",
      "subtitle": "Can you be a conservative feminist? Experts and activists weigh in",
      "author": "",
      "content": "In the words of author bell hooks, \"feminism is for everybody.\" Feminism is broadly defined as the economic, social and political equality between the sexes, and there are many kinds — black feminism, Chicana feminism, intersectional feminism, radical feminism. But what about conservative feminism? At the start of Women's History Month, Ivanka Trump tweeted that \"we honor women's legacy of achievements,\" to which others on Twitter replied, \"who do you mean by 'we'?\" and \"achievements that your father is working to strip away.\" White House press secretary Sarah Huckabee Sanders has also come under fire. When she told reporters that President Trump's tweet about Sen. Kirsten Gillibrand was not sexist, many on social media — as well as mainstream media, including MSNBC host Mika Brzezinski — disagreed. Former Gov. Mike Huckabee defended his daughter, saying she \"represents women\" and \"deserves better from other women.\" Conservative commentators have called out \"Hollywood feminists,\" including Cher and Chelsea Handler, for mocking Sanders' appearance. These moments highlight the tension between conservative women and the mainstream feminist movement. While many conservative women don't identify as feminists, some advocate for their own version of feminism that they say better aligns with their beliefs — but what does conservative feminism look like? The feminist movement historically has had an identifiable list of policy goals — including access to legal abortion. In her introduction to feminist theory, hooks, a leading feminist author and activist, wrote that a woman could personally choose to never have an abortion while still supporting others' right to choose, but \"she cannot be anti-abortion and an advocate of feminism.\" However, there are women who identify as \"pro-life feminists.\" Even Hillary Clinton said she believes people can \"absolutely\" be pro-life and still be feminists. Activist Destiny Herndon-De La Rosa, founder of the pro-life group New Wave Feminists, said it's a shame that the mainstream women's movement hasn't welcomed them, but she doesn't need \"permission\" to call herself a feminist. \"I don't wait to be invited to parties,\" she said. \"I created this group because I saw something lacking in the feminist movement which constantly had me compromising.\" Herndon-De La Rosa found herself in the spotlight when her group was removed as an official partner of the 2017 Women's March because of its stance on abortion. She said she's regularly approached by pro-life women who say they didn't know they were \"allowed\" to call themselves feminists and \"now they're getting thrown into all these other issues, like rape culture.\" Outside of abortion, much of the rhetoric used by conservative feminists focuses on \"choice,\" or allowing women to support whatever policies they choose, regardless of whether or not they are \"feminist.\" At last year's Conservative Political Action Conference, Kellyanne Conway, the first woman to run a successful presidential campaign, said she doesn't consider herself a feminist \"in the classic sense\" because she said the movement is considered anti-male and pro-abortion. However, she continued, “there's an individual feminism, if you will, that you make your own choices ... that's really to me what conservative feminism, if you will, is all about.\" Similarly, Karin Agness Lips, founder of the Network of Enlightened Women, a national organization for conservative university women, said she also doesn't consider herself a modern feminist because the movement lacks clarity and is too extreme. Instead, she identifies as an \"opportunity feminist.\" She says this version of feminism prioritizes maximizing opportunities and choices for women, rather than seeing them as victims \"that need every interaction regulated.\" Opportunity feminism prioritizes equality of opportunity over equality of outcome, meaning that so long as women have the same opportunities as men in education, the workplace and politics, it doesn’t matter if they are represented in equal numbers. \"I'm hoping that that's going to be a way for conservative women to reclaim the feminist title,\" said Agness Lips. \"The left claims they are the women's empowerment movement and they're not. And our policies are actually better for women.\" Instead of policing who gets to use the term, feminists should focus on analyzing the policies put forth by those who claim to be feminists, said UCLA gender studies professor Juliet Williams. \"I think it's incredibly important for feminists to call out the contradictions,\" Williams said. \"If you're pitching a kind of feminism that works for you and people in your community, but is really exclusive or demeaning to people outside that community, how can that really claim to be a feminism?\" Williams said the heart of intersectional feminism is radical inclusivity. Many feminist policy goals are tied to the idea of intersectionality, or the understanding of how women's overlapping identities— including race, class, ethnicity, religion and sexual orientation — impact the way they experience oppression and discrimination. \"Conservative feminists\" simply don't advocate for the same structural and institutional changes that feminists historically have, said Ronnee Schreiber author of the book Righting Feminism: Conservative Women and American Politics. \"For them, there's a very narrow view of what feminism is and also a very ahistorical view,\" said Schreiber, department chair of political science at San Diego State University. \"Feminism isn't just about a personal identification. It's a political and historical movement.\" For more Women's History Month coverage, see women.usatoday.com You might also be interested in:    ",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "In new book, John McCain says 'anyone can become an American if they embrace our values'",
      "url": "https://www.usatoday.com/story/news/politics/2018/05/12/john-mccains-memoir-makes-final-plea-immigration-reform/604686002/",
      "subtitle": "In new book, John McCain says 'anyone can become an American if they embrace our values'",
      "author": "",
      "content": "In his forthcoming memoir, U.S. Sen. John McCain makes one more argument for immigration reform while taking swings at border hard-liners such as as President Trump, former Maricopa County (Arizona) Sheriff Joe Arpaio and Rep. Steve King of Iowa. McCain, the 81-year-old Arizona Republican who is fighting a deadly form of brain cancer, restates his case for overhauling the immigration system in The Restless Wave: Good Times, Just Causes, Great Fights and Other Appreciations. In a chapter titled Fighting the Good Fight, McCain praises U.S. Sen. Edward Kennedy, D-Mass., his late colleague and collaborator on comprehensive immigration reform in the mid-2000s. Kennedy died in 2009 of the same kind of brain cancer, glioblastoma, that McCain is fighting. The original McCain-Kennedy legislation, while unsuccessful, created the broad framework for subsequent bipartisan reform efforts: a pathway to citizenship for undocumented immigrants who have settled in the United States; border-security upgrades; and a foreign-worker program. \"We failed twice, and then once more after Ted had passed away, despite big majorities in both houses of Congress in favor of it,\" McCain and co-author Mark Salter write. \"I'd like to say I'll try again. But that is not up to me anymore. That's a harder disappointment than other defeats have been because first, it's something that most Americans want, and most members of Congress know is the right thing to do. \"But most of all, because it's something this country needs to do now, in this political moment, as old fears and animosities that have blighted our history appear to be on the rise again, exploited by opportunists who won't trouble their careers or their consciences with scruples about honesty or compassion for their fellow man,\" he adds. McCain:John McCain won't be buried with his father, grandfather at Arlington National Cemetery Read more:Meghan McCain wonders how White House staffer who mocked her dad can 'still have a job' He further emphasizes that \"anyone can become an American if they embrace our values. Anyone. You don't even have to speak the language. As a practical matter, you'll have an easier time of it here if you learn English. But even a common language isn't essential to assimilation. Not in this country.\" McCain, 81, pulls no punches against anti-\"amnesty\" activists and other reform foes and their policy proposals. Although McCain in a 2010 re-election ad famously called for completion of \"the danged fence,\" he argues that a Trump-style wall along the southern border \"isn't going to solve the problem\" and \"it might make it worse\" by diverting resources from \"more effective border security and enforcement.\" McCain uses an expletive (bulls--t) to describe the hard-line prescription to \"round up all the 'illegals' and deport them.\" He also suggests that racism motivates some opponents of immigration reform. \"There are politicians today who would have Americans believe that illegal immigration is one of the worst scourges afflicting the country,\" McCain and Salter write. \"Some who espouse that nonsense believe it to be true. ... Others are doing it for more sinister reasons they're reluctant to acknowledge publicly, including racial prejudice. Whatever their reasons, the cynical and the ignorant promotion of false information and unnecessary fear have the same outcome. Decent, hardworking people who mean no harm are blamed for crime, unemployment, failing schools, and various other ills, and become in the eyes of many the objects of hate and fear.\" McCain also vents his frustrations about those who have stood in the way of reforms such as the path to citizenship or guest-worker program. White House:'He's dying anyway': White House official mocked Sen. John McCain, reports say Trump aide:Trump aide who said John McCain is 'dying anyway' still has a job He takes swings at some of the harshest critics of illegal immigration, including former U.S. Rep. Tom Tancredo, a Colorado Republican who made the issue central to his short-lived run for the 2008 GOP presidential nomination, which McCain won. \"Once, when we were both in the same South Carolina restaurant, Tancredo sent my table an order of chips and salsa, meaning I'm not sure what,\" McCain recalls in the memoir. \"I guess he thought that since I didn't want to kick out of the country every Mexican-born immigrant, I must like chips and salsa.\" McCain blasts King, the anti-immigration congressman, as \"a backbench House Republican from Iowa\" who at times \"seems to go out of his way to offend as many people as he can with his crude insults of folks who came to this country for freedom and opportunity.\" McCain attributes Trump's narrow 2016 win in Arizona, where Hispanics are a political force, over Democratic rival Hillary Clinton partly to Trump's anti-immigrant rhetoric and to his controversial ally Arpaio, then Maricopa County's sheriff. Trump edged Clinton in the traditional red state by just 3.5 percentage points, while McCain handily won re-election to a sixth Senate term by about 12 percentage points. Maricopa County voters tossed Arpaio out of office. \"That isn't terribly surprising given his (Trump's) insulting references to unauthorized immigrants and the hard positions the state adopted in recent years to punish and apprehend them, exacerbated by the offensive statements and policies of Maricopa County's notorious former sheriff, convicted felon Joe Arpaio,\" McCain writes. Arpaio, now running for the Senate, was pardoned by Trump last year after a criminal contempt-of-court conviction in connection with a federal racial-profiling case. Asked for a comment, Arpaio said he wasn't inclined to \"overly criticize\" McCain. Sarah Palin:McCain admitting he'd rather have had Lieberman as running mate was 'gut punch' Joe Biden:Decency in Trump administration hit rock bottom with McCain dying 'joke' \"I've got a reaction, but let me say this: He has cancer, and my prayers have gone out to him,\" Arpaio told The Arizona Republic. \"But what he said in his book is wrong. I'm not a convicted felon. That means I can't vote, I can't carry a gun. This is a misdemeanor. Contempt-of-court is the same time you can get for a barking dog.\" McCain championed major pieces of immigration legislation in 2006, 2007 and 2013, but none became law. In the book, McCain complains of \"broadly popular, eminently fair, and workable\" immigration fixes getting \"buried\" in the Republican-controlled House of Representatives. In 2013, McCain and fellow members of the bipartisan \"Gang of Eight\" collaborated on a bill that balanced a massive investment in border security with a path to citizenship and an updated visa program for foreign workers. It passed the Senate by a big margin but stalled in the House, an outcome that McCain blames on the House's conservative Freedom Caucus. McCain writes in \"The Restless Wave\" that then-House Speaker John Boehner, R-Ohio, likely agreed with him on the issue but that the House GOP caucus \"is driven crazy by the incessant demands of the say-no-to-everything crowd otherwise known as the Freedom Caucus\" while \"more sensible Republicans are afraid of primary challenges.\" \"The bill was a balanced, conservative, scrupulously thorough and fair attempt to settle the immigration problem in a way that would satisfy economic needs, the interests of American workers, justice, and human decency,\" McCain wrote of the \"Gang of Eight\" bill. \"I'm proud it passed the Senate with a supermajority, 68 to 32, despite the furious protests of anti-reform senators. For them, every realistic attempt to address the issue will always be an 'amnesty bill,' no matter how rigorous and fair the path to legalized status for immigrants who have been here for years and will stay here the rest of their lives no matter what we do.\" Ben Domenech:John McCain is 'reflecting, in the end,' on his life, son-in-law says Immigration:Opponents of DACA program seek repeat trip from Brownsville, Texas, to Supreme Court McCain offers a few ideas that might help pass immigration reform. One is that Democrats regain control of the House. Another is that \"problem-solving House Republicans\" back a discharge petition, a procedural maneuver that could force a floor vote over House Republican leaders' opposition. A group of House Republicans is trying to take that route. Or those GOP leaders could work with Democrats to get around the Freedom Caucus. Not long after he was diagnosed with brain cancer, McCain announced his intention to revive comprehensive immigration reform on Capitol Hill. He mentions in The Restless Wave a bill that he co-sponsored with U.S. Sen. Chris Coons, a Delaware Democrat, but adds that he is not sure he has \"sufficient time left to see it all the way through.\" The McCain-Coons bill failed in the Senate in February. \"Like my friend Ted, I might have fought my last immigration battle,\" McCain writes in the book. Frank Sharry, executive director of the pro-reform organization America's Voice, said it's just a matter of time before McCain's dream of immigration reform becomes reality. \"Immigration reform is going to pass — it's only a question of when,\" Sharry said. \"For those people who get legalized under it, we should call those visas the 'McCain-Kennedy' visas. Because John McCain and Ted Kennedy both were more interested in the national interest than their party's short-term advantage. The border:Immigration arrests at southwest border creep up but still at historic low \"It's clear to the vast majority of Americans and to just about every expert who has studied this, that what they came up with in terms of the McCain-Kennedy bill is the solution,\" he continued. \"It's a combination of smart enforcement, flexible legal immigration and legalizing hardworking immigrants who are established here.\" Sharry remembered how he cut his teeth on the immigration-reform issue in the company of McCain and Kennedy. \"I didn't realize I was in the presence of greatness,\" Sharry said. \"I just thought that this was how senators worked. I only realized 20 years later how extraordinary and exceptional they were.\" McCain and Salter's The Restless Wave is set for publication on May 22.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sen. John McCain, American 'maverick' and political giant, dies at 81",
      "url": "https://www.usatoday.com/story/news/politics/2018/08/25/john-mccain-arizona-senator-died-brain-cancer/955220001/",
      "subtitle": "Sen. John McCain, American 'maverick' and political giant, dies at 81",
      "author": "",
      "content": "John McCain, who endured more than five years as a prisoner of war in Vietnam before becoming the 2008 Republican presidential nominee and serving Arizona for more than 30 years on Capitol Hill, died Saturday at age 81. McCain died at 4:28 p.m. MST, his office announced. His wife and other family members were with him. Destined to be remembered among the political giants of Arizona history, the six-term U.S. senator disclosed in July 2017 that he had been diagnosed with a deadly form of brain cancer called glioblastoma. Meghan McCain, his TV commentator daughter, wrote Saturday on Twitter: \"I love you forever - my beloved father.\" McCain was a two-time presidential candidate, losing the GOP nomination in 2000 to then-Texas Gov. George W. Bush and the general election in 2008 to then-Sen. Barack Obama. The unsuccessful White House bids were spotlight moments in a long political career that began with his election to the U.S. House of Representatives in 1982. After two terms, McCain ascended to the U.S. Senate in 1987, replacing legendary Republican U.S. Sen. Barry Goldwater, who in 1964 was the only other Arizonan to top the national ticket of a major U.S. political party. McCain was re-elected to the Senate in 1992, 1998, 2004, 2010 and 2016. He became Arizona’s senior senator in 1995 and chairman of the influential Armed Services Committee in 2015. Aug. 24:Sen. John McCain to discontinue medical treatment, family says Aug. 24:As Sen. John McCain discontinues treatment for brain cancer, what will his legacy be? Aug. 24:Outpouring of praise for Sen. John McCain follows announcement that he's ending cancer treatment Often called a maverick, McCain was a complicated personality and will be remembered as the most important political figure to emerge from Arizona in the past 50 years. He was ensnared by the “Keating Five” scandal of the late 1980s and was deemed by the Senate Ethics Committee to have demonstrated poor judgment by joining four Senate colleagues in meeting with federal thrift regulators on behalf of political benefactor Charles H. Keating Jr., a savings-and-loan tycoon and developer. It was in the wake of that scandal, in the 1990s and early- to mid-2000s, McCain's \"maverick\" reputation began to take shape, as he led fights for campaign finance reform and comprehensive immigration reform and against Big Tobacco. During his 2000 presidential run, McCain famously decried leaders of the Religious Right as “agents of intolerance,” a gutsy fight to pick for a Republican. In 2015, his own presidential ambitions in the past, McCain clashed with Republican Donald Trump in a public feud that extended into Trump’s time in the White House. On July 28, 2017, McCain sided with two other GOP senators and all Democrats and cast a crucial vote — a literal thumbs-down on the Senate floor — that stalled Republican efforts to roll back the Affordable Care Act, a top Trump priority. Unlike many of Trump’s GOP punching bags, McCain had the stature to go nose-to-nose with the president. At one point in the early 2000s, Democrats encouraged McCain to consider switching parties, and 2004 Democratic presidential nominee John Kerry approached him about serving as his running mate. But later, McCain veered to the right, a source of frequent frustrating to his previous admirers on the other side of the aisle. March 21:Slamming Putin call, McCain goes after Trump for 'congratulating dictators on winning sham elections' March 18:Meghan McCain shares new photo of Sen. John McCain Interactive:John McCain's American story Although some on the right sneered at what they viewed as McCain’s coziness with the national media — for years after his presidential run, he was a mainstay on the Sunday television public-affairs shows — McCain often kept local media at arm’s length and once wrote in a book that his long relationship with The Arizona Republic, the state’s largest newspaper, could fairly be described as “antagonistic.” However, the relationship with The Republic and other local media improved in later years. McCain also had a love-hate relationship with his media-promoted reputation as a maverick, relying on it or distancing himself from it as the political circumstances warranted. “That was a label that was given to me a long time ago,” McCain told The Republic in 2010. “I don't decide on the labels that I am given. I said I have always acted in what I think is in the best interests of the state and the country, and that’s the way that I will always behave.” McCain proved himself to be a thorn in the side of his GOP rival, Bush, at least early in the first term of Bush’s presidency. The McCain vs. Bush fight in 2000 had taken a bitter turn in the South Carolina primary, where McCain and his allies accused their conservative opponents of trying to smear him and his family. However, he and Bush reconciled as McCain geared up for his second presidential run. A classic Senate hawk, McCain was a senior member of the Senate Armed Services Committee and strongly supported Bush’s wars in Afghanistan and Iraq. McCain also was a champion of the surge strategy that Bush employed in Iraq in 2007. During the 2008 presidential race, McCain had to overcome the lingering distrust of many conservatives who resented his maverick record, which included votes against key Bush tax cuts as well as McCain’s successful push for bipartisan campaign-finance-reform legislation. His decision to gamble on the untested and little-known Alaska Gov. Sarah Palin as his running mate was cheered by the conservative wing of the Republican Party but may have hurt the GOP ticket among independent voters. However, McCain never had much of a chance of defeating Obama, given the political atmosphere of the time. Voters were widely dissatisfied with Bush, whose approval numbers were bad, and war fatigue had set in. If that wasn’t bad enough, the U.S. economy melted down in September 2008, making it unlikely that another Republican would succeed Bush. The political-science models pointed to a Democratic victory. March 13:Meghan McCain: Still no timetable for ailing father John McCain's return to the Senate March 4:Sen. John McCain, wife all smiles in springtime photo “You can't win with conditions this bad for the incumbent party,” Larry Sabato, director of the Center for Politics at the University of Virginia, said after the election. “And that's McCain's consolation: He did reasonably well under extremely difficult conditions. It was never meant to be.” Looking back at the race in an August 2017 interview with The Republic, McCain largely concurred, though he stressed that Obama deserves the credit for his victory. \"One, Barack Obama was a very, very strong candidate and that's the most important thing,\" McCain said. \"Second, when the stock market collapsed, it really sent us into a real drop. Third of all, I guess, Americans were ready for a change, too. “But I'd like to emphasize the first thing I said: Barack Obama was an incredibly impressive candidate and he did a great job campaigning,” he added. Two years after his White House defeat, the perception of McCain as an establishment moderate was still strong enough to attract a Senate primary challenger from the right: former six-term U.S. Rep. J.D. Hayworth, a professional broadcaster who was known as a fierce foe of illegal immigration. In the year of the conservative “tea party” uprising, McCain took no chances and greatly outspent Hayworth, destroying him in the process with an unrelenting barrage of hard-hitting TV campaign commercials. In one memorable ad aimed at Hayworth’s conservative base, McCain rebranded himself as a border hard-liner by calling for the completion of “the danged fence” between the United States and Mexico. After dispatching Hayworth in the primary, McCain effortlessly clinched a fifth Senate term in the 2010 general election. Feb. 28:Cindy and Meghan McCain hit back at President Trump for attacking ailing Sen. John McCain Feb. 8:Meghan McCain: Flu season concerns are keeping John McCain in Arizona Near the end of that term, McCain found himself feuding with celebrity-billionaire-turned-presidential-candidate Trump. In a notorious July 18, 2015, jab at McCain, Trump said McCain was “a war hero because he was captured” and that he liked “people that weren’t captured.” Trump also derided McCain as weak on immigration and border security. McCain returned the criticism on a number of issues, including Trump’s approach to foreign policy. In October 2016, McCain finally withdrew his endorsement of Trump after a 2005 recording surfaced of Trump talking about women in crude and vulgar ways. Their duels may have helped McCain in that they made Democrats’ election-year efforts to tether McCain to Trump, who had made a series of inflammatory comments, all but impossible. McCain effortlessly defeated U.S. Rep. Ann Kirkpatrick, and dramatically outperformed Trump, who also carried Arizona on Election Day but by a much slimmer margin. John Sidney McCain III was born Aug. 29, 1936, at the Coco Solo Naval Air Station in the Panama Canal Zone. His father, John S. McCain Jr., and grandfather, John S. “Slew” McCain Sr., would become the only father-son team of four-star Navy admirals in U.S. history. During World War II, Slew McCain was in charge of aircraft carriers fighting the Japanese in the Pacific and had a destroyer named in his honor in 1953. The youngest McCain followed in the footsteps of his namesakes, attending the U.S. Naval Academy in Annapolis, Maryland, and becoming a naval aviator. In July 1967, during the Vietnam War, McCain survived a fiery maritime disaster on the aircraft carrier USS Forrestal that killed 134 people and nearly sank the ship in the Gulf of Tonkin. McCain was getting ready to take off from the deck when another plane accidentally fired a Zuni missile and hit his plane or one next to it, spilling fuel. McCain was wounded by shrapnel and narrowly escaped death himself in the blaze that followed as bombs and planes began exploding. “The crew’s heroics kept her afloat,” McCain recalled in his 1999 memoir \"Faith of My Fathers.\" “They fought the inferno with a tenacity usually reserved for hand-to-hand combat. They fought it all day and well into the next, and they saved the Forrestal.” Feb. 2:John McCain decries memo release: 'We are doing Putin's job for him' Jan. 31:John McCain's son Jack says dad 'sounds better than the day before' On the 40th anniversary of his getting shot down over Hanoi, North Vietnam, McCain told The Republic that the Forrestal disaster may have affected him more deeply in the long run. “To be honest with you, the Forrestal fire seems to be a more impactful date I remember more than that of when I was shot down,” McCain said at the time. Surviving the Forrestal crisis — the “Inferno at Sea” as the Aug. 11, 1967, cover of Life magazine dubbed it and the worst naval disaster since World War II — was just the beginning for McCain. On Oct. 26, 1967, McCain was piloting an A-4 Skyhawk attack bomber that had taken off from the USS Oriskany when a missile blew off one of its wings. Seriously wounded, he was captured and would spend more than five brutal years as a POW. He refused early release, which was offered to him because he was the son of a Navy admiral and would have served North Vietnamese propaganda purposes. While in custody, McCain was routinely beaten and at one point confessed that he was a “black criminal” and an “air pirate,” which he would remember as a low point of his life. McCain finally was released, along with other POWs, in 1973. In 1977, McCain became the Navy’s liaison to the U.S. Senate, setting into motion his future career path as a politician. After returning to the United States, McCain’s first marriage to the former Carol Shepp fell apart, and the couple eventually divorced in 1980. He later married Cindy Hensley, daughter of a wealthy Arizona beer distributor. The two met in Hawaii. She was 17 years younger than he was. McCain retired from the Navy in 1981, and his new marriage brought him to the Phoenix area. The POW backstory was ready-made for a politician. In 1982, McCain ran for and won the seat being vacated by the retiring former U.S. House Minority Leader John Rhodes, R-Ariz. Though McCain was called a carpetbagger, he prevailed in a tough four-way GOP primary. He faced no serious competition in the general election. McCain pushed back on the charge that he was a political opportunist with no roots in Arizona. He said his Navy family was forced to move often. “As a matter of fact, when I think about it now, the place I lived longest in my life was Hanoi,” McCain said. McCain was somewhat lucky in his first U.S. Senate race in 1986. Veteran U.S. Rep. Bob Stump, R-Ariz., declined to run on the Republican side. Arizona Gov. Bruce Babbitt, a popular Democrat with presidential ambitions, also decided not to try for the retiring Goldwater’s seat. A self-inflicted political wound briefly made things interesting — McCain had made an ill-advised reference to Phoenix-area retirement community Leisure World as “Seizure World,” a place where 97 percent of the people voted and “the other 3 percent were in intensive care” — but he still wound up easily defeating Democratic opponent Richard Kimball. Dec. 26:John McCain and Jeff Flake stood up for U.S. values and unity: Arizona Republic editorial Dec. 20:McCain 'headed back to Washington' after the holidays, says Arizona governor “Occasionally, my sense of humor is ill-considered or ill-timed, and that can be a problem,\" McCain later conceded in his 2002 book, \"Worth the Fighting For.\" Early in his first Senate term, McCain and fellow U.S. Sen. Dennis DeConcini, D-Ariz., and three other senators participated in two April 1987 meetings with federal thrift regulators who were investigating California-based Lincoln Savings & Loan. The troubled business was part of Charles H. Keating Jr.'s financial empire. Keating had donated and helped raise money for both Arizona senators. The McCain family even vacationed with Keating in the Bahamas. Once the meetings were made public, McCain and DeConcini found themselves at the heart of a major national scandal that resulted in 23 days of Senate ethics hearings. “I was judged eventually, after three years, of using, quote, poor judgment, and I agree with that assessment,” McCain would later say. The federal government seized Lincoln Savings & Loan in April 1989 and prosecuted Keating for fraud. Dec. 18:Doctor: McCain's setback 'normal' during brain cancer treatment Dec. 17:Sen. John McCain returns to Arizona, will miss vote on tax bill Though DeConcini, who was determined to have acted inappropriately, would not run for a fourth term in 1994, McCain sought a second Senate term in 1992 and was able to overcome the Keating Five stigma. The controversy also didn’t do much to hinder his presidential runs in 2000 and 2008 and was largely forgotten during his later years in the Senate. \"It's ancient history,\" Bruce Merrill, the late Arizona State University professor emeritus and longtime political pollster, said of the scandal upon Keating’s death in 2014. \"It's amazing he (McCain) survived that, and I guess one could argue that his political skills brought him through that.” McCain had seven children, including television commentator and author Meghan McCain. His family lived in the central Phoenix area for years. Follow Dan Nowicki on Twitter: @dannowicki Dec. 14:McCain trying to 'get rested up' after cancer treatment, friends say Dec. 13:'The View': Joe Biden tells Meghan McCain, 'If anyone can make it, your dad can' Nov. 14:McCain blasts Army for considering recruits with history of self-mutilation, vows action Nov. 6:Sen. John McCain treated for cancer therapy side effects, tear in Achilles tendon Oct. 26:Opinion: John McCain's 50-year anniversary: Since Vietnam plane crash, an exceptional life Oct. 22:John McCain mocks Donald Trump’s deferment ‘bone spurs’ (without naming him) Oct. 20:John McCain memoir, 'The Restless Wave,' coming in April Oct. 19:Sen. John McCain to pay birthday visit to daughter Meghan McCain on 'The View' Oct. 17:Trump warns McCain. 'At some point, I fight back. And it won't be pretty' Oct. 16:Emotional Sen. John McCain blasts 'half-baked, spurious nationalism' Sept. 27:Meghan McCain calls report Trump mocked her dad 'abhorrent' Sept. 27:Opinion: John McCain ran on repealing Obamacare. He broke his promise. Sept. 24:Sen. John McCain: Doctors gave me 'poor prognosis' on cancer fight Sept. 22:John McCain says he is a 'no' on Graham-Cassidy bill, leaving Obamacare repeal in peril Sept. 22:Read Sen. John McCain's statement on why he opposes the Graham-Cassidy bill Sept. 18:Sen. John McCain reveals what really happened in the James Comey hearing Sept. 12:Sen. John McCain to maintain Senate schedule throughout brain tumor treatment Sept. 1:John McCain: President Trump is 'often poorly informed, can be impulsive' Aug. 14, 2017:After Obamacare vote, John McCain is more popular with Democrats than Republicans, poll says Aug. 10, 2017:In absence of White House Afghanistan strategy, John McCain proposes one of of his own Aug. 9, 2017:Wisconsin Sen. Ron Johnson suggests John McCain's health may have affected his Obamacare vote Aug. 3, 2017:McCain aims to revive immigration reform when he returns to Congress July 30, 2017:McCain's type of brain cancer vexes doctors, but emerging therapies are on the horizon July 28, 2017:John McCain will begin treatment for brain tumor Monday July 25, 2017:McCain, battling cancer, returns to Senate and casts critical health care vote",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "John McCain, battling brain cancer, tells Biden to stay in politics",
      "url": "https://www.usatoday.com/story/news/politics/2018/05/05/john-mccain-battling-cancer-tells-joe-biden-stay-politics/583593002/",
      "subtitle": "John McCain, battling brain cancer, tells Biden to stay in politics",
      "author": "",
      "content": "WASHINGTON — Sen. John McCain, the Arizona Republican who is battling brain cancer, encouraged former vice president Joe Biden to “not walk away” from politics, according to a report Saturday in the New York Times. Biden, a Democrat who hasn’t ruled out a run for president in 2020, visited with McCain last weekend, the New York Times and Associated Press reported. McCain, 81, has had a touchy relationship with President Trump. In a book and documentary set to be released this month, McCain will criticize the president for his hesitancy to accept refugees as well as the language he has used to praise autocrats like Russian President Vladimir Putin, according to several reports. In one possible sign of that strained relationship, the senator’s “intimates” told the White House that they intend to invite Vice President Pence to McCain’s funeral but not Trump, according to the Times. Trump also did not attend the funeral last month of former first lady Barbara Bush because of security reasons. Trump drew criticism from within his own party for saying during the presidential campaign that McCain was not a war hero. A former Navy pilot, McCain spent more than five years as a prisoner of the North Vietnamese. More:From jokester to 'maverick,' John McCain is a study in contradictions The book and film will also address McCain’s regrets for not choosing former senator Joseph Lieberman of Connecticut as his running mate in 2008, according to the Times. McCain instead chose former Alaska gov. Sarah Palin, a relative unknown at that time who became a star of the conservative movement but antagonized many others in the party. McCain acknowledges in the book, \"The Restless Wave,\" that he will not run for re-election. He describes himself as \"freer than colleagues who will face the voters again,\" according to excerpts made public last month. \"I can speak my mind without fearing the consequences much,\" he wrote. “Here John knows he’s in a very, very, very precarious situation, and yet he’s still concerned about the state of the country,” Biden told the Times in an interview. “We talked about how our international reputation is being damaged and we talked about the need for people to stand up and speak out.”",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "What will Sen. John McCain's legacy be?",
      "url": "https://www.usatoday.com/story/news/politics/2018/08/24/senator-john-mccain-legacy-vietnam-hero-gop-maverick/1084753002/",
      "subtitle": "What will Sen. John McCain's legacy be?",
      "author": "",
      "content": "PHOENIX – One word is sure to surface again and again as Sen. John McCain's legacy is detailed and debated. The \"maverick\" label defined the Arizona Republican's rise in national politics and his first presidential campaign in 2000. The description reflected a backstory of heroism and duty during the Vietnam War and fit McCain's efforts to lead bipartisan reforms of the campaign-finance and immigration systems. His central focus on Capitol Hill was national security, a bipartisan concern. And he eagerly sparred with presidents George W. Bush, Barack Obama and Donald Trump. ► Bio:John McCain's American Story: As seen by journalists who know him best\n► Aug. 24:Sen. John McCain stopping brain cancer treatments, family says\n► Aug. 13:Trump snubs McCain in defense policy bill that bears senator's name The maverick reputation suggested an independent streak that played well with some voters in his Senate and presidential runs. McCain himself would use it when it suited him politically. But it wasn't always a comfortable fit for McCain or even accurate. The former Navy captain and Vietnam prisoner of war could be a partisan brawler and GOP team player, too, much to the exasperation of his admirers in the Democratic Party and the Washington media. McCain distanced himself from the maverick label when it became a liability during his bid for the 2008 Republican presidential nomination and in his 2010 and 2016 Senate re-election races. But he never let it go completely, just as critics on the left would use it against him when they felt he wasn't living up to their idea of bipartisanship. \"That was a label that was given to me a long time ago,\" McCain said in 2010. \"I don't decide on the labels that I am given. I said I have always acted in what I think is in the best interests of the state and the country, and that's the way that I will always behave.\"\n\nIn a 2002 memoir, Worth the  Fighting For, McCain wrote that he worried \"the (maverick) act might be getting a little tired for a man of my years.\"\n\nBut 15 years later, at age 80, McCain settled the argument once and for all when, in the early hours of July 28, 2017, he gave a dramatic thumbs-down to GOP legislation to undo the Affordable Care Act, casting a decisive vote that stalled Republican efforts to gut Obamacare.\n\nThree days before that vote, in a memorable July 25 Senate floor speech, delivered at the height of partisan rancor over whether to repeal or save Obama's Affordable Care Act, McCain made a passionate case for the Senate to return to regular order and the civility and camaraderie for which the upper chamber once was known. \"The most revered members of this institution accepted the necessity of compromise in order to make incremental progress on solving America’s problems and to defend her from her adversaries,\" McCain said in the remarks, which came less than a week after the disclosure that he was battling a deadly form of brain cancer. ► Aug. 10:Jesse Jackson calls President Trump 'lying king,' praises 'hero' McCain\n► July 27:Meghan McCain says dad John McCain is 'hanging in' \"That principled mindset and the service of our predecessors who possessed it come to mind when I hear the Senate referred to as the world’s greatest deliberative body,\" he said. \"I’m not sure we can claim that distinction with a straight face today.\" In an August 2017 interview with The Arizona Republic, McCain said he was comfortable with people remembering him as the Republican maverick, but he added this: \"I also hope that they recognize what I've done on a lot of issues, especially national defense.\" In the legislative arena, McCain's work on the influential Senate Armed Services Committee – he became chairman in 2015 – and on defense policy were among his most lasting contributions. His namesake campaign-finance-reform bill, which sought to combat the pervasive influence of special-interest money in politics, became law in 2002. But the Supreme Court overturned key parts, including regulations on independent corporate and union spending on political advertising. ► July 26:In text to gov's lawyer, congressman expresses interest in McCain seat\n► July 13:What's next after John McCain's year with brain cancer? Critics argued the campaign-finance law backfired and actually worsened fundraising efforts because it weakened political parties and shifted power toless accountable and more extreme third-party organizations. The law also led to the 2010 decision in Citizens United v. the Federal Election Commission that greatly increased the influence of corporations, unions and outside groups on elections. One ramification, given Congress' failure to mandate disclosure, has been that certain politically active nonprofits can hide the source of their money. And despite years of trying, none of McCain's attempts to overhaul the immigration system became law. Sen. Jeff Flake, R-Ariz., agreed that national security is a big part of McCain's legacy. \"He has really helped shape our policy for a good amount of time, a quarter-century at least, in the Senate in terms of the post-World War II liberal international order with strong U.S. leadership and security arrangements and a focus on human rights.\" Former three-term Sen. Dennis DeConcini, D-Ariz., who served six years with McCain in the Senate from 1987 until DeConcini's 1995 retirement, said he and McCain often had ideological differences and disagreed about the use of earmarks to pay for projects for Arizona. But DeConcini said he always respected McCain's military service in the Navy. More recently, DeConcini said he admired the way that McCain was willing to stand up to Trump, his own party's president. McCain and Trump battled publicly almost from the time Trump launched his presidential campaign in summer 2015. McCain eventually withdrew his endorsement of Trump in October 2016 after a vulgar recording surfaced of Trump talking about women. ► July 10:McCain's illness could complicate Trump's Supreme Court pick\n► July 5:McCain's heart was with military July 4 as he battled brain tumor \"I considered him a maverick,\" DeConcini said of McCain. \"He went on his own trajectory on issues. He would not always support the Republican position, though he also could be very partisan, ... but that's understandable. \"I give him great credit for taking on Trump, not just because I am no fan of Trump's, but because that is really a courageous thing to do,\" DeConcini said. McCain's presidential runs in 2000 and 2008 elevated him in the national consciousness. During McCain's first bid for the Republican presidential nomination, Americans became acquainted with his personal story of being shot down over North Vietnam in 1967 and spending more than five years as a prisoner of war. McCain, the son and grandson of Navy admirals, refused early release because the military code of conduct demanded that POWs accept release only in the order in which they were captured. ► June 21:Meghan McCain: Trump's rally line about her father is 'gross'\n► June 19:McCain rips Trump's family separation policy McCain's scrappy, upstart 2000 presidential campaign and its reform platform were given little chance of victory but managed to throw the GOP establishment into a panic after his surprise upset of then-Texas Gov. George W. Bush in the New Hampshire primary. Anti-McCain forces descended on South Carolina to halt his momentum ahead of that state's primary. In a brutal contest that has entered the lore of U.S. political history, his opponents waged an all-out effort that included, in some cases, outlandish and vicious smears of McCain and his family. \"I will not take the low road to the highest office in this land,\" McCain said after his South Carolina loss. \"I want the presidency in the best way, not the worst way.\" Though McCain carried on to Michigan and Arizona, his campaign was mortally wounded. But even in defeat, he inspired some in his party. \"His run in 2000 was kind of the first inkling of the ability to run in an unorthodox way,\" said Sen. Marco Rubio, R-Fla., who would run for president in 2016. \"That was an unorthodox campaign against a favorite who ended up winning, but Sen. McCain, without any of the trappings of a traditional campaign front-runner, really gave future President Bush a run for his money.\" McCain and Bush remained at odds after Bush moved into the White House in 2001, with McCain famously opposing the GOP president's signature tax cuts in 2001 and 2003. After his experience in 2000, McCain had reinvented himself as the GOP-establishment favorite by the time he launched his 2008 presidential campaign seven years later. But financial troubles nearly upended his machine, and by summer 2007 McCain was running on a tight budget, preaching the need for victory in the unpopular Iraq War while stumping at town-hall-style events in Veterans of Foreign Wars meeting halls and similar venues all over Iowa, New Hampshire and South Carolina. ► June 17:Meghan McCain calls John McCain 'greatest father in the world'\n► June 5:Kelly Sadler, White House aide who reportedly mocked McCain, is out \"I'd rather lose a campaign than lose a war,\" McCain would say of the risk that his Iraq War stance posed to his political prospects. In what was seen as a major comeback, McCain won the GOP nomination over rivals such as former Massachusetts Gov. Mitt Romney, former New York City Mayor Rudy Giuliani and former Arkansas Gov. Mike Huckabee. Asthe party's nominee, McCain picked \"Country First\" as his slogan. But few political experts gave him much of a chance at defeating Democratic nominee Barack Obama – a fresh and exciting figure in U.S. politics – given the profound unpopularity of Bush and the war, and the financial crisis that threatened to wreck the economy. In the end, McCain's attempt to revive the \"maverick\" brand didn't changes voters' perceptions. His campaign and foreign policy were painted as extensions of Bush's presidency, and it stuck. Whether his pick of then-Alaska Gov. Sarah Palin, chosen to help shore up the conservative base that distrusted him, hurt or helped remains a matter of debate. But some blame McCain's choice of Palin for the rise of right-wing populism that eventually led to Trump's election in 2016. \"One, Barack Obama was a very, very strong candidate, and that's the most important thing,\" McCain told The Republic in an interview in August 2017. \"Second, when the stock market collapsed, it really sent us into a real drop. Third of all, I guess Americans were ready for a change, too. \"But I'd like to emphasize the first thing I said: Barack Obama was an incredibly impressive candidate, and he did a great job campaigning,\" he said. For some hard-right Republicans, McCain didn't hit Obama, the first African-American nominee of a major party, hard enough or often enough out of what they considered a fear of being tagged a racist. ► May 28:HBO's 'John McCain: For Whom the Bell Tolls' isn't a eulogy\n► May 17:In new memoir, McCain talks Trump dossier, not tapping Joe Lieberman McCain declined to make an issue of the Rev. Jeremiah Wright, Obama's former pastor in Chicago who had made a string of controversial political statements in his fiery sermons, including rejecting the slogan \"God Bless America\" for \"God Damn America.\" In another memorable moment, McCain corrected a woman at a town hall meeting who said she couldn't trust Obama because he was \"an Arab.\" \"No, ma'am. He's a decent, family man, citizen, that I just happen to have disagreements with on fundamental issues. And that's what this campaign is all about,\" McCain said. McCain's honorable campaigning seems quaint when viewed through the lens of Trump's 2016 scorched-earth assault on his Democratic rival, Hillary Clinton. Just eight years after McCain received the party's nomination, Republicans would chant \"Lock her up!\" at the Republican National Convention in Cleveland. But Rubio recalled McCain's exchange with the woman who said Obama was an Arab as \"an iconic moment\" in presidential campaign history. \"In the process of running in the 2008 election, there were multiple moments in that campaign where you saw him elevate above the moment and refuse to go in a direction that perhaps some wanted him to go,\" Rubio said. \"It was a testament to his character.\" McCain never settled his differences with the far-right wing of the Republican Party despite being the party's 2008 standard-bearer. At one point, Arizona party activists censured him as too liberal on issues such as immigration.  With his seniority and national profile, McCain's clout in the Senate grew. He got a reputation as a Senate heavyweight who could get things done. ► May 10:'He's dying anyway': White House official mocked McCain, reports say\n► May 9:John McCain: Senate should reject Gina Haspel for CIA director In 2015, McCain, the classic Senate hawk on foreign policy, got his Capitol Hill dream job, taking the Armed Services Committee gavel. As the panel's chairman, McCain was in his element, whether it was working to reform the Defense Department's weapons-acquisition process to curb waste, grilling Pentagon officials on policy or strategy or blasting disruptive anti-war demonstrators as \"lowlife scum\" as he ordered them out of the hearing room. \"This is a deeply passionate individual who has a sense of tackling injustice, whether it's the suffering in Syria or what (Russian President) Vladimir Putin has done,\" Rubio said. \"When he locks on, he's going to lock on. Very few things are going to move him off of it.\" The Cold War standoff between the United States and Soviet Union greatly influenced McCain's worldview. As a naval aviator, he was stationed on the nuclear aircraft carrier USS Enterprise off Cuba during the 1962 Cuban Missile Crisis, and he was a relentless critic of Putin, whom he often called a murderer and a thug. ► May 5:John McCain, battling brain cancer, tells Biden to stay in politics\n► April 3:From jokester to 'maverick,' John McCain is a study in contradictions Putin officially sanctioned McCain in 2014. A few years later, a Kremlin spokesman said McCain was known for his \"maniacal hatred towards our country.\" McCain urged the United States to stand up to Putin's threat: McCain's foreign-affairs outlook is set to live on through Arizona State University's McCain Institute for International Leadership, which the senator helped start in 2012 with unspent money from his 2008 presidential campaign. Through studying and debating world issues, the institute aims to groom new generations of global leaders and scholars. McCain's chairmanship of the Armed Services Committee was, like much of his work in the Senate, marked with a spirit of bipartisanship. He worked well with Sen. Jack Reed, D-R.I., the committee's ranking Democrat. The committee turned out annual defense authorization bills that would pass the Senate overwhelmingly. ► Feb. 28:Cindy, Meghan McCain hit back at Trump for attacking ailing senator\n► Nov. 17:Phoenix airport terminal may be named for Sen. John McCain \"That's because all these years I've developed all these relationships with these guys and women, that we trust each other,\" McCain told The Republic. Even before he became chairman, McCain was able to get many of his priorities included in the must-pass defense bill, including December 2014 language to allow a federal land swap needed for a massive copper mine near Superior, Arizona. The project is expected to provide jobs and an economic boost to the area. \"I think it has a lot to do with national security,\" McCain said at the time. \"This mine, when it's fully operational, will supply 25 percent of America's copper supply, and that is a national security issue.\" ► Oct. 22:John McCain mocks Trump’s ‘bone spurs’ deferment\n► Oct. 17:Trump warns McCain. 'At some point, I fight back. And it won't be pretty' As the committee's chairman, McCain made overhauling defense acquisition one of his biggest priorities. \"In the last three National Defense Authorization Acts, Sen. McCain has championed sweeping measures to reform, streamline and improve the defense acquisition system,\" Julie Tarallo, McCain's spokeswoman, said in November. \"There is a long way to go to ensure America's weapons systems are delivered on time and at cost.\" McCain's bipartisan efforts yielded mixed results on other issues. Even though McCain never sat on the Veterans' Affairs Committee, his fellow Senate Republicans tapped him as the lead negotiator on a VA reform bill that he developed with Sen. Bernie Sanders, I-Vt.,the committee's then-chairman. ► August 2017:McCain aims to revive immigration reform upon return to Congress\n► July 2017:McCain's brain cancer vexes doctors, but therapies are on horizon The compromise legislation rose from a nationwide scandal about wait times that unfolded at the Carl T. Hayden VA Medical Center in Phoenix. The failure of comprehensive immigration reform to become law after years of trying was perhaps his biggest disappointment. McCain worked on the issue for more than a decade. His belief in legislation that balanced border security with a foreign-worker program and a pathway to citizenship for millions of undocumented immigrants who have settled in the country hurt him politically with many anti-\"amnesty\" voters in his own party. ► July 2017:Senate narrowly defeats repeal of Obamacare as McCain votes no\n► July 2017:Sen. John McCain has brain tumor, doctors say A 2013 compromise he helped write as part of the bipartisan Gang of Eight, which also included Rubio, passed the Senate. But the Republican-controlled House of Representatives refused to consider it. McCain viewed the issue as crucial for his home state – and his party's future – and gave this advice to Arizona Republicans who refuse to budgeon the issue: ► July 2017:Sen. John McCain undergoes surgery for blood clot above eye\n► March 2017:John McCain is calming world leaders in the Trump era \"I would tell them to recognize that Arizona is a state that is undergoing change,\" McCain told The Republic. \"We have a growing Hispanic population. We have a growing influx of people from states like California. I think they've got to be attuned to the demographics of Arizona. \"We ought to understand that Arizona is a state that is changing and, arguably, for the better.\" Follow Dan Nowicki on Twitter: @dannowicki Chapter 1: John McCain is a study in contradiction\nChapter 2: John McCain was destined for the Naval Academy\nChapter 3: John McCain was 'a very determined guy' as a POW\nChapter 4: John McCain's political ambition emerged after POW return\nChapter 5: John McCain's political career began after Arizona move\nChapter 6: Ever-ambitious, John McCain rises to the Senate\nChapter 7: John McCain 'in a hell of a mess' with Keating Five\nChapter 8: After Keating Five, John McCain faced new scandal\nChapter 9: John McCain becomes the 'maverick'\nChapter 10: 'Ugly' politics in John McCain's 2000 presidential run\nChapter 11: John McCain was frequent foe of Bush in early years\nChapter 12: John McCain goes establishment for 2nd White House run\nChapter 13: John McCain had rough start to 2008 presidential race\nChapter 14: John McCain clinches 2008 GOP presidential nomination\nChapter 15: John McCain takes on Obama for president in 2008\nChapter 16: John McCain fails in second bid for president\nChapter 17: 'Complete the danged fence,' John McCain proclaims\nChapter 18: John McCain wins 6th term, reclaims 'maverick' label .",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Trump visits Scotland, World Cup final, Wimbledon: 5 things to know this weekend",
      "url": "https://www.usatoday.com/story/news/2018/07/14/world-cup-serena-williams-wimbledon-sacha-baron-cohen-bastille-day/778450002/",
      "subtitle": "Trump visits Scotland, World Cup final, Wimbledon: 5 things to know this weekend",
      "author": "",
      "content": "One of the most entertaining World Cups in history comes to a conclusion Sunday as France and Croatia face off with the world title on the line (11 a.m. ET, FOX or Telemundo). Croatia, which didn't officially join FIFA until 1992, will be playing in its first final after a dramatic extra-time win over England. As for France, Sunday's showdown in Moscow will mark the third time Les Bleus have reached final. So will France hoist the cup as they did in 1998? It might depend on 19-year-old French star Kylian Mbappe's devastating speed, gifted feet and finishing composure. Not sure who to root for? USA TODAY Sports weighed in with their predictions.  Hundreds of people are expected to protest Saturday as President Donald Trump visits Scotland. The last time Trump traveled to Scotland was in 2016, hours after the Brexit vote and shortly after he became the presumptive Republican presidential nominee. On Friday, Trump attempted to downplay the searing remarks he made to a London newspaper about British Prime Minister Theresa May and said he apologized to her for what he described as a \"fake\" story. The trip to Scotland is likely to be less dramatic, as he spends the weekend out of the spotlight ahead of the high-stakes summit with Russian President Vladimir Putin. Serena Williams may secure her 24th Grand Slam tournament win Saturday should she defeat Germany's Angelique Kerber at the Wimbledon women's singles final. A highly-anticipated match Saturday — even members of the British royal family will be in attendance — Kerber and Williams have met on the Wimbledon final court once before where Williams secured a 7-5, 6-3 win in 2016.  Williams has faced a different challenge this tournament — she's been open about her return to tennis after giving birth to her daughter, Alexis Olympia, 10 months ago and experiencing a tough delivery and tumultuous recovery. AC wrote, Charles edited Commemorated annually on July 14, Bastille Day marks the turning point in the French Revolution in which a group of Parisians stormed the Bastille Fortress to free political prisoners and arm themselves against the French military. This pivotal moment, serves as a symbol of the establishment of a republic and the destruction of an absolute monarchy. Last Bastille Day, President Donald Trump visited Paris for the celebrations as Saturday marks two years since a terrorist attack terrorized the Bastille Day festivities resulting in the death of more than 80 people.  Sacha Baron Cohen, well-recognized for his accents and notorious pranks, will return to television this weekend to debut his new half-hour series dubbed \"Who is America?\".  The seven-episode show appears to take a unique spin on exploring the political and cultural spectrum of America by \"tricking\" celebrities and cultural phenoms into interviews without their knowledge. On Tuesday, Sarah Palin posted on Facebook that she had fallen victim to the \"evil, exploitative, sick humor\" of Cohen who had disguised himself as a disabled U.S. veteran. The show will premiere on Showtime on Sunday at 10 p.m. ET.  Prefer to listen? Check out the 5 things podcast below and subscribe for free on Apple Podcasts:   Contributing: Associated Press   AMERIND Risk",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "In new memoir, John McCain talks Trump dossier, questioning Comey, not tapping Joe Lieberman",
      "url": "https://www.usatoday.com/story/news/politics/2018/05/17/takeaways-john-mccain-memoir/618316002/",
      "subtitle": "In new memoir, John McCain talks Trump dossier, questioning Comey, not tapping Joe Lieberman",
      "author": "",
      "content": "PHOENIX — U.S. Sen. John McCain provides new insights into his 2008 White House campaign against Barack Obama and tries to put the President Donald Trump era into focus in a new memoir set for release Tuesday. The Restless Wave: Good Times, Just Causes, Great Fights, and Other Appreciations is the third book in an autobiographical trilogy that includes 1999's Faith of My Fathers and 2002's Worth the Fighting For. McCain again reunites with his former Senate chief of staff and longtime co-author Mark Salter for the book, in which the six-term Arizona Republican senator also reflects on the Iraq War, the need for comprehensive immigration reform, and Trump's character. Here are five more takeaways from The Restless Wave. May 14:Meghan McCain says Sadler should have expected her 'he's dying anyway' remark to be leaked May 13:John McCain: Sen. Lindsey Graham says White House should apologize for aide's 'disgusting' remark McCain seems to believe that his garbled questioning of former FBI director James Comey during a June 8, 2017, hearing is related to his life-threatening glioblastoma, an aggressive form of brain cancer. McCain writes that he felt \"something was off\" after he returned from a multination overseas congressional-delegation trip. \"I didn't know exactly what,\" McCain writes. \"Fatigue mostly.\" May 12:In new book, John McCain says 'anyone can become an American if they embrace our values' May 12:Who is defending John McCain after White House aide's 'dying anyway' remark — who isn't? During the notorious Senate Intelligence Committee hearing, McCain at one point made a reference to \"President Comey.\" At the time, McCain had said he stayed up the night before watching an Arizona Diamondbacks game. Later, he told Esquire that his friend, U.S. Sen. Lindsey Graham, R-S.C., had emailed him a question to ask. However, the question dropped off the smartphone, and he tried to wing it by memory with disastrous results. \"Something happened between reading the question and asking it,\" McCain writes in his memoir. \"To this day, I'm really not sure what caused it. But as was widely noted at the time, I was incomprehensible. It was a high-profile hearing, carried live by the cable news networks. My strange performance was the focus of commentary on cable and fuel for Twitter. I felt embarrassed for myself and sorry for confusing Comey. It was one of the more mortifying experiences of my public career. Even now, I wince at the memory of it.\" May 11:Meghan McCain wonders how White House staffer who mocked her dad can 'still have a job' May 11:Donald Trump aide who said John McCain is 'dying anyway' still has a job It may be difficult to know definitively whether McCain's confused questioning of Comey was directly related to his brain cancer, but McCain writes as though he thinks it did. First, he tried to \"put the whole thing down to a bad bout of jet lag,\" McCain writes, but \"a small concern nagged at me\" ahead of his July 14 regular physical at Mayo Clinic in Scottsdale, Ariz. That medical visit revealed a need for immediate cranial surgery, which led to his brain-cancer diagnosis. McCain also gives his most complete version of his role in intrigue surrounding a dossier of salacious research and raw intelligence on Trump and his connections with the Russians. McCain previously acknowledged getting a copy of the dossier, which was authored by Christopher Steele, a former British MI6 officer, and giving it to the FBI, which already was aware of the material. May 11:John McCain won't be buried with his father, grandfather at Arlington National Cemetery May 11:Sarah Palin: McCain admitting he'd rather have had Lieberman as running mate was 'gut punch' \"I had an obligation to bring to the attention of appropriate officials unproven accusations I could not assess myself, and which, were any of them true, would create a vulnerability to the designs of a hostile foreign power,\" McCain writes in the book. \"I discharged that obligation, and I would do it again. Anyone who doesn't like it can go to hell.\" McCain confirms that he learned about the so-called Steele dossier from Sir Andrew Wood, a former British ambassador to Russia, while attending the November 2016 Halifax International Security Forum in Nova Scotia. McCain also speculates on why Wood and Steele sought him out. \"That's the first accusatory question in every budding conspiracy theory about my minor role in the controversy,\" McCain writes. \"The answer is too obvious for the paranoid to credit. I am known internationally to be a persistent critic of Vladimir Putin's regime, and I have been for a long while. Wood and Steele likely assumed that my animosity toward Putin, which I unapologetically acknowledge, ensured that I would take their concerns seriously. They assumed correctly.\" It's not news that McCain wanted to choose his friend Joe Lieberman, the Democrat-turned-independent senator from Connecticut, as his 2008 running mate. However, The Restless Wave gives McCain's inside account of how he wound up tapping then-unknown Alaska Gov. Sarah Palin instead. Picking Lieberman would have been perhaps McCain's most maverick move ever. But it also would have carried a huge risk of alienating the GOP's conservative base — which already was less than thrilled that McCain was that year's nominee — and possibly cause a revolt at the Republican National Convention in St. Paul. May 11:Decency in Trump administration hit rock bottom with McCain dying 'joke,' Biden says May 10:'He's dying anyway': White House official mocked Sen. John McCain, reports say McCain and Lieberman were allies on national security but parted ways on other key issues, including abortion rights. McCain's advisers talked him out of it. Rick Davis, McCain's campaign manager, and Steve Schmidt, a senior campaign adviser, pitched the conservative Palin to McCain as a veep possibility and, McCain writes, \"I was intrigued.\" A.B. Culverhouse, who was in charge of vetting running mates for McCain, called her a \"high risk, high reward\" choice. But Salter, a senior adviser and McCain's Restless Wave co-author, warned that Palin's \"scant exposure to national politics, and her self-admitted knowledge deficiency in national security issues, would undermine the experience advantage we had over Obama.\" Salter, who wanted McCain to pick Minnesota Gov. Tim Pawlenty, proved prescient: Palin's lack of political seasoning and feeble grasp of national and foreign-policy issues would prove to be a big liability in the presidential campaign. McCain critics continue to use his Palin choice to attack his judgment. May 9:John McCain: Senate should reject Gina Haspel for CIA director May 8:Orrin Hatch says he 'spoke out of turn' about McCain not wanting Trump at his funeral \"She stumbled in some interviews, and had a few misjudgments in the glare of the ceaseless spotlight and unblinking cameras,\" McCain writes. \"Those missteps, too, are on me. She didn't put herself on the ticket. I did. I asked her to go through an experience that was wearing me down, that wears every candidate down. I made mistakes and misjudgments, too.\" McCain's book also sheds light on another 2008 decision that in retrospect was ill-advised: his September 2008 return to Washington, D.C., as Congress was grappling with the financial meltdown. With the U.S. financial system in peril thanks to the subprime-mortgage crisis, McCain had already committed a major campaign gaffe that made him seem out of touch, saying that \"the fundamentals of our economy are strong.\" That remark was meant \"to say something encouraging that wouldn't contribute to the spreading panic,\" McCain says in The Restless Wave, but it \"proved colossally impolitic.\" May 6:John McCain is 'reflecting, in the end,' on his life, son-in-law Ben Domenech says May 5:John McCain, battling brain cancer, tells Biden to stay in politics McCain and his campaign advisers knew the housing-related crisis would doom any chance of victory unless McCain could somehow make it appear that he was part of the solution. Because his reaction to the financial turmoil \"wasn't cutting it,\" they \"hatched a plan,\" in McCain's words, to propose that he and Obama suspend their campaigns ahead of their first scheduled debate in Oxford, Miss., so the two candidates, in conjunction with the White House, could meet with House and Senate leaders to collaborate on a bipartisan \"rescue plan that could pass Congress.\" Obama and then-Senate Majority Leader Harry Reid, D-Nev., resisted McCain. \"We had the White House meeting. It was a waste of time,\" McCain writes. \"Harry and Speaker of the House Nancy Pelosi just stirred the pot, blaming the crisis on Republicans. Barack spoke briefly. I went in knowing the House Republican votes for the rescue package weren't there. ... When asked by President Bush to speak, I said I would defer to the House Republican leader. I should have hogged the floor a little. Minutes after the meeting ended, press accounts quoted anonymous sources claiming I hadn't had anything to offer.\" The Sept. 25, 2008, White House meeting was worse than a mere waste of time. It perpetuated a perception that McCain was clueless about the economy. \"Our gambit failed and that cost us support we couldn't afford to lose,\" McCain writes. \"I wish we hadn't tried it, but I'll be damned if I can think of anything else we might have done that could have gained us support or limited the damage the crisis was doing to our campaign, which we were pretty sure would prove mortal.\" McCain reaffirms his Republican pedigree against far-right detractors who have long-branded him a \"RINO,\" or Republican In Name Only. McCain writes in the book that Democrats, including the late U.S. Sen. Edward Kennedy of Massachusetts, courted him to switch parties in the aftermath of his 2000 loss in the Republican presidential primaries to then-Texas Gov. George W. Bush, who would go on to win the White House that year. May 1:John McCain in new book: 'I can speak my mind without fearing the consequences' April 29:McCain's son-in-law: 'John hugged me tonight. He asked me to take care of Meghan.' This happened at the height of McCain's \"maverick\" period, when he was a reliable thorn in Bush's side. McCain told The Arizona Republic last year that he never seriously considered abandoning the Republican Party. In the book, McCain acknowledges some \"hard feelings\" toward Bush after the 2000 election, but adds that he \"got over them a lot sooner than many people believed I had, and sooner than the lingering antagonism between our staffs had faded.\" While he disagreed with Bush on some key issues, such as his tax-cut package, McCain says he mostly agreed with Bush and found him likable. \"Last but not least, I was a Republican, a Reagan Republican,\" writes McCain, who first entered Congress while President Ronald Reagan held the Oval Office. \"Still am. Not a Tea Party Republican. Not a Breitbart Republican. Not a talk radio or Fox News Republican. Not an isolationist, protectionist, immigrant-bashing, scapegoating, get-nothing-useful-done Republican. Not, as I am often dismissed by self-declared 'real' conservatives, a RINO, Republican in Name Only. \"I'm a Reagan Republican, a proponent of lower taxes, less government, free markets, free trade, defense readiness, and democratic internationalism.\" Follow Dan Nowicki on Twitter:@dannowicki",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Mike Pence, 'Christian supremacist': 6 key takeaways from a new book",
      "url": "https://www.usatoday.com/story/news/politics/2018/08/23/mike-pence-book-calls-vice-president-christian-supremacist/1062696002/",
      "subtitle": "Mike Pence, 'Christian supremacist': 6 key takeaways from a new book",
      "author": "",
      "content": "WASHINGTON – Democrats may not like President Donald Trump, but do they want the alternative? “That is probably what we hear most from Democrats,” said Kevin Mack, lead strategist for the “Need to Impeach” President Donald Trump campaign. \" 'Well, if we get rid of Trump, then we end up with (Mike) Pence.' \" As Trump’s presidency became more endangered this week with the conviction or guilty plea of two of his former aides, a new book about the vice president will stoke concerns about Pence. In “The Shadow President: The Truth About Mike Pence,” on sale Tuesday, authors Michael D’Antonio and Peter Eisner cast Pence's background – congressman, Indiana governor, Trump VP – in a harsh light, arguing that “the most successful Christian supremacist in American history” is already functioning as a “kind of replacement president” and is preparing to “fashion a nation more pleasing to his god and corporate sponsors.” A flattering preview of the book by New York Times columnist Frank Bruni – that ran under the headline “Mike Pence, Holy Terror” – already has religious leaders and other Pence supporters accusing Bruni and the book’s authors of religious bigotry. Saying he’d “never heard such hatred poured out against such a good man,” evangelist Franklin Graham urged supporters to pray that God will put a “hedge of protection” around Pence and his family. More:Here's why powerful women don't use the 'Mike Pence rule.' Spoiler alert: They can't. The authors are not the first to raise alarms about who is waiting in the wings should Trump leave office – voluntarily or involuntarily. Arguing Pence has taken advantage of the chaos of the Trump administration to amass “enormous power” under the radar, the Human Rights Campaign launched a campaign earlier this year to highlight Pence’s record on issues important to the LGBTQ community. Former White House aide Omarosa Manigault Newman writes in her new memoir that Pence is biding his time until Trump resigns or is impeached. “As bad as you think Trump is, you should be worried about Pence,” she said on \"Celebrity Big Brother\" in February after leaving the White House. “He thinks Jesus tells him to say things.” Authors D’Antonio and Eisner are no fans of Pence. While Pence may have cited convicted Watergate conspirator Charles Colson as a “dear friend and mentor” because of the religious conversion Colson underwent in prison, the authors assert – without substantiation – that it’s “just as likely that Pence was drawn to Colson’s lingering aggressive tendencies.” They comment on Pence’s favorite movie by noting that he loved \"The Wizard of Oz\" “despite the feminist power of its main characters.” And Pence’s trademark “extreme niceness” is not benign in the authors’ eyes. Instead, Pence has “weaponized” his niceness as “a tool of persuasion and deflection.” While Trump is who he said he was, the authors write, Pence’s “pious and cautious exterior hid a desire for power equal to Trump’s.” The book asserts that many of Pence’s evangelical friends believed his ultimate purpose is to establish a government based on biblical law, what they called “Christian Dominionism.” But some of the examples of how religion has guided Pence as a policymaker leave out important details. For example, while the authors suggest religion is behind Pence’s rejection of policies to address climate change, they don’t factor in Indiana’s reliance on coal-fired power plants, a reason even some Democrats in Indiana opposed the Obama administration’s efforts to restrict greenhouse gas emissions. The authors paint a conflicting portrait of Pence’s abilities. They say he was the least qualified vice presidential candidate since Sarah Palin and Spiro Agnew, with his background as an “inept” legislator in Congress and a “middling\" governor who didn’t like to work hard and was more interested in the status of the job than the job itself. (Pence, they write, was the first governor to order up a collection of custom-embroidered clothes decorated with his name and the words “Governor of Indiana.”) Yet despite that lackluster background, the authors say Pence has been functioning as a kind of shadow president, “taking on so many domestic, foreign and partisan political assignments that he seemed more engaged in serious matters than the TV-addicted president himself.” More:Donald Trump will work mostly Senate races; Pence will focus mostly on the House, aide says More:10 takeaways from a new biography of Mike Pence There is one area where the authors and Pence’s supporters may agree. The book asserts that white conservative Christians, despite their “vast numbers and influence,” see themselves as victims. They cheer when Pence asserts, “No people of faith today face greater hostility or hatred than followers of Christ.” In fact, in reacting to the book as it was portrayed in Bruni’s column, former Pence spokesman Marc Lotter told the Christian Broadcasting Network that the column is indicative of the “never-ending attack on Christianity.” Conservative columnist Rebecca Hagelin wrote that the media is trying to discredit Pence “simply because he is a committed Christian.” Meanwhile, Mack of Need to Impeach has his answer ready for why those worried about a Pence presidency should still push to get rid of Trump. \"It’s kind of like saying, 'I have terminal cancer but I don’t want to deal with it because I might get diabetes,' \" he said. \"You have to deal with the first problem, and then we’ll deal with the second problem.\" ",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Nation's capital prepares a hero's welcome for late Sen. John McCain",
      "url": "https://www.usatoday.com/story/news/politics/2018/08/30/john-mccain-presidents-senate-colleagues-prepare-heros-welcome/1135122002/",
      "subtitle": "Nation's capital prepares a hero's welcome for late Sen. John McCain",
      "author": "",
      "content": "WASHINGTON – When Sen. John McCain left the nation's capital in December to celebrate Christmas and battle brain cancer in Arizona, friends and colleagues vowed he would return. For three tribute-filled days, their hopes will be realized – posthumously. McCain's casket landed at Joint Base Andrews in Maryland Thursday night. It will be a hero's welcome for the former Navy pilot who spent 5½ years imprisoned in Vietnam and a public servant who spent 36 years in a political career that took him from the House to the Senate and nearly to the White House – twice. The swashbuckling style that led to McCain's label as a maverick will give way to more decorous forms of affection, first inside the U.S. Capitol, then at Washington National Cathedral, and finally overlooking the Severn River at his beloved U.S. Naval Academy in Annapolis, Maryland. The 81-year-old's belief in the need for bipartisanship will be on display at the ceremonies and services, including a full-dress memorial during which the two presidents who vanquished him – Republican George W. Bush and Democrat Barack Obama – will speak. But even as he settles those old scores, one will remain: President Donald Trump, who had called McCain a \"dummy\" rather than a hero, was not invited. Vice President Mike Pence will speak at one event, and three members of Trump's administration will attend another. The events will be an occasion to recall the many highlights, and perhaps even the low moments, of a career that both enriched and enraged McCain's colleagues. On the high side, there was his successful, bipartisan effort to regulate the financing of political campaigns. His winning the Republican nomination for president in 2008 after being written off. His chairmanship of the Senate Armed Services Committee. On the low side, there was his early entanglement in the \"Keating Five,\" a group of senators scandalized after intervening on behalf of a failing savings and loan. His frustrated efforts to solve the nation's immigration crisis. His choice of Alaska Gov. Sarah Palin as his 2008 running mate and ultimate defeat in November. The pomp and circumstance in the nation's capital in essence started Thursday when McCain's body departed Arizona from Goldwater Air National Guard Base, named for former Sen. Barry Goldwater, who McCain replaced in 1987. Earlier in the day, he was eulogized at a Baptist church by former Vice President Joe Biden, whose son Beau died in 2015 from the same vicious disease. From the Joint Base Andrews military facility in Maryland, McCain will be taken to the U.S. Capitol, where he began his public service career in 1983. There he will lie in State on Friday, becoming only the 31st person to be so honored in 166 years – a list that includes Abraham Lincoln, John F. Kennedy, Ronald Reagan and unknown soldiers from the two world wars, Korea and Vietnam. Following an 11 a.m. EDT ceremony at which Pence, Senate Majority Leader Mitch McConnell and House Speaker Paul Ryan will speak, the public will be invited to pass by McCain's casket from about 1 to 8 p.m. – and later if necessary. On Saturday, a motorcade will take the late senator along Constitution Avenue to the Vietnam Veterans Memorial, where his widow, Cindy McCain, will lay a ceremonial wreath honoring those who lost their lives in the war that cost McCain his freedom. Then it will continue to Washington National Cathedral, where funeral services have been held for 15 presidents dating to William McKinley in 1901, and where former president Woodrow Wilson is buried. Others eulogized there include Eleanor Roosevelt, Neil Armstrong, Nelson Mandela and victims of the 9/11 attack. In addition to Bush and Obama, speakers at Saturday's service include former secretary of State Henry Kissinger, former Sen. Joe Lieberman and television commentator Meghan McCain, the late senator's daughter. The presidents and others are identified on McCain's website first as \"friend.\" Finally on Sunday, McCain will be moved not to Arlington National Cemetery – where his father and grandfather, both four-star Navy admirals, are buried – but to a spot overlooking the Severn River at the U.S. Naval Academy, beside his old Navy buddy, Charles \"Chuck\" Larson. Services there will be private and will include tributes from Sen. Lindsey Graham, R-S.C., McCain's closest friend in the Senate; former CIA director David Petraeus; and McCain's son Jack, a Navy helicopter pilot. McCain's last days in Washington included a stay at Walter Reed National Military Medical Center in nearby Bethesda, Maryland, to treat an infection stemming from treatment for glioblastoma, the most deadly form of brain cancer. By January, however, his return was rumored. \"We need his voice now more than ever,\" Graham mused. Happily for his allies and to the chagrin of his opponents, McCain didn't stop speaking out during his illness, even imparting a farewell statement delivered after his death Saturday afternoon. \"We weaken our greatness when we confuse our nationalism with tribal rivalries that have sown resentment and hatred and violence in all the corners of the globe,\" he said. \"We weaken it when we hide behind walls, rather than tear them down, when we doubt the power of our ideals, rather than trust them to be the great force for change they have always been.\" Now it will be left to his wife and seven children, along with his Senate colleagues and friends, to keep John Sidney McCain III's voice alive. They did so this week by urging well-wishers to send flowers to their local veterans hospital. By Wednesday, the Phoenix hospital had received four deliveries. \"His impact on America hasn’t ended. Not even close,\" Biden said Saturday. \"It will go on for many years to come.\" In Arizona:'We can be proud he was our senator': John McCain remembered at Arizona ceremony Reporter's recollections:What I learned about John McCain during 20 years covering him Raising hell:McCain wanted to 'raise hell' and leave it all on the field. Mission accomplished, Senator.    ",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin: McCain admitting he'd rather have had Lieberman as running mate was 'gut punch'",
      "url": "https://www.usatoday.com/story/news/politics/onpolitics/2018/05/11/sarah-palin-mccain-regret-running-mate-gut-punch/602569002/",
      "subtitle": "Sarah Palin: McCain admitting he'd rather have had Lieberman as running mate was 'gut punch'",
      "author": "",
      "content": "Former Alaskan governor Sarah Palin says she was hurt hearing Sen. John McCain regretted choosing her as his running mate in the 2008 presidential election but doesn't fully believe the claim. Speaking with NBC News and the Daily Mail, Palin, the former vice-presidential candidate, talked about her relationship with the Arizona Republican who is battling terminal brain cancer. McCain's new book, which chronicles his career and bid for president in 2008, reportedly includes his regret with not choosing Joe Lieberman, then an independent senator from Connecticut, as his running mate in the 2008 race, which he lost to Barack Obama. McCain writes in the book that advisers counseled him against choosing Lieberman because of his past as a Democrat. Palin said she doesn't believe the claim and thinks ghostwriters were behind it. \"I attribute a lot of what we're hearing and reading regarding McCain's statements to his ghostwriter or ghostwriters,\" she told the Daily Mail. \"I don't know all the details of his condition right now. It happens to me also where people speak for me and a bell is rung, and you can't un-ring the bell.\" More:John McCain won't be buried with his father, grandfather at Arlington National Cemetery More:'He's dying anyway': White House official mocked Sen. John McCain, reports say More:John McCain, battling brain cancer, tells Biden to stay in politics She said she wouldn't believe the claim \"unless I heard it from Sen. McCain myself,\" Palin said. Palin told NBC News she has always had respect for McCain and his \"maverick nature,\" adding she has stayed close with his family over the years. \"You know, it is kind of sad to hear that he and or someone speaking for him does have regrets,\" she told NBC News. \"I want to live my life without any regrets. And I hope that he finds that kind of peace and contentment also to be able to look back on decisions and realize, really, things work out the way that they’re supposed to work out.\" Palin's comments come as reports that a White House aide joked about McCain's death, igniting a firestorm of criticism across on both sides of the aisle. \"It doesn't matter, he's dying anyway,\" press aide Kelly Sadler said about McCain's opposition to CIA nominee Gina Haspel at a meeting of White House communications staffers, according to an unnamed source cited by The Hill's Jordan Fabian. Other outlets later confirmed the remarks. Meghan McCain, the senator's daughter and a host on ABC's The View, said on the show Friday that she didn't understand how the White House could be an environment where someone could make a comment like that and  \"can come to work the next day and still have a job.\" Follow Christal Hayes on Twitter: Journo_Christal ",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "John McCain services: Joe Biden, Barack Obama and George W. Bush to eulogize senator",
      "url": "https://www.usatoday.com/story/news/politics/2018/08/27/john-mccain-eulogies-joe-biden-barack-obama-and-george-w-bush/1114381002/",
      "subtitle": "John McCain services: Joe Biden, Barack Obama and George W. Bush to eulogize senator",
      "author": "",
      "content": "PHOENIX – Former Vice President Joe Biden will deliver a eulogy to his longtime friend John McCain at the senator's funeral in Arizona on Thursday. Last year, when the National Constitution Center awarded its Liberty Medal to McCain, a former prisoner of war during the Vietnam War, Biden bestowed the medal on McCain. And McCain's wife, Cindy, tweeted that her husband enjoyed a visit from Biden in late April. Biden shares another poignant link with McCain. His son, Beau, also died of brain cancer in 2015 at age 46. \"Joe Biden has been an incredible comfort to the family,\" said Rick Davis, who managed McCain's 2000 presidential campaign, at a news conference in Phoenix on Monday. Biden is known for his moving, emotional eulogies. He spoke in 2013 at the memorial service for the 19 firefighters who died fighting the Yarnell Hill Fire on June 30. During his remarks, Biden said this about the Granite Mountain Hotshots: \"Firefighting is not what they did. It's who they were,'' he said, and quoted an old saying, \"All men are created equal but then a few become firefighters.'' McCain will have two services in Arizona: He will lie in state at the Arizona Capitol on Wednesday, where members of the public can visit his casket, beginning at 2 p.m. Mountain Standard Time. A funeral is scheduled for 10 a.m. Thursday at North Phoenix Baptist Church. During Thursday's service, McCain's daughter, Bridget, will do a reading along with tributes from former Arizona Attorney General Grant Woods and Arizona Cardinals wide receiver Larry Fitzgerald. McCain was a die-hard Cardinals fan. After the Arizona service, McCain will be transported from Phoenix to Washington, D.C., where he will lie in state Friday at the U.S. Capitol. President Donald Trump said Monday he had asked Vice President Mike Pence to speak at the Capitol ceremony. On Saturday, the senator's family will gather at the U.S. Capitol and escort the late senator's body to the Vietnam War Memorial to lay a wreath. McCain's service will be at the Washington National Cathedral at 10 a.m. EDT. McCain had requested that former presidents George W. Bush and Barack Obama deliver eulogies at his service. Davis, the McCain family spokesman, confirmed on Monday that both former presidents will speak at his funeral. Joe Lieberman, a longtime friend and Democratic senator, and former Secretary of State Henry Kissinger will also speak. Bush was McCain's primary rival during the senator's unsuccessful 2000 presidential run. The senator eventually withdrew from the race after losing primaries to Bush on Super Tuesday. McCain later spoke in support of his former adversary. McCain took on Democratic candidate Obama in 2008, whose campaign of \"Hope and Change\" offered a clean break from Bush. McCain made the controversial pick of Alaska Gov. Sarah Palin as his running mate, and failed to connect with voters on the economy, the most important issue at the time. Obama won the popular vote, and in McCain's concession speech at the Arizona Biltmore, he graciously spoke of the significance of Obama's win and that he would not try again for the White House. Contributing: Yvonne Wingett Sanchez and Kelsey Mo, The Arizona Republic.   ",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Elon Musk's tweet on taking Tesla private now dogged by drugs claim from rapper Azealia Banks",
      "url": "https://www.usatoday.com/story/tech/talkingtech/2018/08/22/elon-musks-tweet-taking-tesla-private-now-dogged-drugs-claims-rapper-azealia-banks/1057815002/",
      "subtitle": "Elon Musk's tweet on taking Tesla private now dogged by drugs claim from rapper Azealia Banks",
      "author": "",
      "content": "LOS ANGELES — At least no one can ever accuse Elon Musk of leading a dull life. The ex-PayPal billionaire is busy engineering an electric car revolution (Tesla), leading a rocket company (SpaceX) and tunneling toward a high-speed mobility future (The Boring Company). But now he's in a soap opera that could have consequences for a reported Securities and Exchange Commission inquiry into Musk's recent tweets about taking Tesla private. It goes like this: Musk had been on the town of late with Grimes, the Canadian singer whose real name is Claire Boucher. The pair appeared together earlier this year at the fancy Met Gala ball in New York, and she allegedly was at his Los Angeles home when her friend, rapper Azealia Banks, visited to work on a planned music collaboration during the weekend starting Friday, August 10. But there had been a mix-up: Grimes and Musk were leaving for part of the weekend (Musk spoke at the DefCon cybersecurity conference in Las Vegas Friday night) while Banks was invited to stay on at the house.  That's when things got, well, strange. In a series of posts on Instagram a few days later, Banks described waiting around for Grimes to emerge at the Musk compound, likening it to being in the movie Get Out, which is about an African-American man who is attacked by whites. The rapper then wrapped a new accusation into her gripes about being stood up: that Musk had been dropping acid, or the psychedelic drug LSD. “I waited around all weekend while grimes coddled her boyfriend for being too stupid to know not to go on Twitter while on acid,” Banks was quoted by The New York Times as having written in a post that appears to have since been deleted. That's of interest largely because only days earlier, on Aug. 7, Musk shocked the markets and Tesla's stock price with a tweet that suggested he was considering taking his public car company private, and that he had the funding to do so. That unorthodox public trial balloon is what caught the attention of the SEC, which doesn't take lightly even the slightest hint of stock price manipulation. Tesla stock initially jumped on the tweet, but then dropped 9 percent Friday in its tumultuous wake. It has since regained some of those losses. On August 13, Banks told Business Insider that she saw Musk \"in the kitchen tucking his tail in between his legs scrounging for investors” after his tweet about taking Tesla private, adding, “He was stressed and red in the face.” Musk told tech website Gizmodo that he had never met Banks or “communicated with her in any way.” In a separate interview with the Times, he denied that the $420 target price to take Tesla private was chosen because of its link to the marijuana world — a nod to April 20 being Weed Day. Instead, he said a 20 percent premium to the price of Tesla stock at the time was $419, and he simply rounded up. \"It seemed like better karma at $420 than at $419,\" he said. He denied drugs were involved when he sent the tweet, but he did admit he had seen Banks -- at a distance. Banks is no stranger to public feuds. She's dueled with everyone from Russell Crowe and Rihanna to Cardi B and Sarah Palin. One casualty of this ongoing feud could be Musk's new relationship. He and Grimes have unfollowed each other on social media and he's deleted his Instagram account. Contributing: Andrea Mandell, Marco della Cava",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sturgis 2018 motorcycle rally kicks off with chrome, celebrities and costumes",
      "url": "https://www.usatoday.com/story/news/2018/08/04/sturgis-2018-motorcycle-rally-worlds-largest-motorcycle-event/906338002/",
      "subtitle": "Sturgis 2018 motorcycle rally kicks off with chrome, celebrities and costumes",
      "author": "",
      "content": "STURGIS, S.D. – The rumbling of thousands of V-twin engines says one thing: The annual pilgrimage known as the Sturgis Motorcycle Rally is officially underway. The 78th rally – it was started in 1938, but suspended during World War II due to gas shortages – is the world’s largest motorcycle event, drawing visitors from around the globe for 10 days. An estimated 500,000 people will participate in the rally that runs through Aug. 12. Participants are here to ride their motorcycles along the winding roads of the Black Hills, to shop for all manner of biker-related gear, and to bask in a gas-fueled two-wheeled celebration of all that is loud, fast and shiny. “Oh my gosh. It’s cool. Crazy. Wild,” said first-time visitor Diana Voakes, who lives in an RV with her husband. “I’m hear to see everything that Sturgis stands for.” Voakes started her Friday by posing for photos with a motorcycle rider before heading off down the sidewalk among families, Hells Angels and retired military veterans drawn to the rally. Many attendees are staying in sprawling encampments outside of the city, which has few hotels. Those campgrounds, which accommodate thousands, have their own concerts, bars and riding demonstrations. For many Americans, Sturgis conjures up images of an anything-goes motorcycle festival, where drugs flow, fists fly and nudity runs rampant. But the reality is that most attendees today are professionals with too much to lose if they get arrested. The top three professions at Sturgis are doctors, lawyers and accountants, city officials say. Doing the math makes that statistic easier to understand: New Harley-Davidson or Indian motorcycles start around $20,000, although high-end models can hit $50,000, and that’s before any real customization. Then there’s the logo-wear clothing, the gas, the insurance and even the ability to take a week’s vacation. Some longtime attendees complain the rally has lost its edge, that the rowdy, drunken and naked shenanigans that once filled the streets have given way to corporate sponsorships, licensed T-shirt vendors and insurance companies and lawyers flogging coverage. Indeed, first-time visitors might be excused for thinking the rally isn’t much more than an excuse to create one of the world’s largest open-air shopping malls. From booths lining the streets, licensed vendors are hawking leather ponytail holders, riding jackets, custom patches, and helmets for riders from states where they’re mandatory. Shoppers can buy shirts memorializing their attendance, have custom leather seats fitted and install Bluetooth communication systems to chat with fellow riders. And while Harley-Davidson riders make up the bulk of attendees, there are also plenty of Honda, Kawasaki and Indian bikes. All along the streets, open-fronted bars let drinkers watch the masses of leather-clad bikers stroll past, interspersed with the occasional woman wearing a bikini, thong and chaps. This year’s rally is drawing several celebrities, from reality TV star Richard Rawlings of “Fast N’ Loud” to former Alaska Gov. Sarah Palin. Among the musical acts this year are Foreigner, Kid Rock and Lynyrd Skynyrd. “It’s all commercial now. It’s a human zoo,” said Keith Eccles, a pinstriping and airbrush painter who’s been coming since 1978. “It’s so totally different.” But for first-time attendee Jacob Elliot, the spectacle borders on overwhelming – in a good way. Motorcycles rumble past continually as huge groups of riders arrive and depart town. Elliot, 20, rode down with his father from North Dakota on a father-son trip, and was instantly hooked: “I love it.\"",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Tributes to George H.W. Bush pour in from former presidents, world leaders and celebs",
      "url": "https://www.usatoday.com/story/news/politics/2018/11/30/tributes-george-h-w-bush/584630002/",
      "subtitle": "Tributes to George H.W. Bush pour in from former presidents, world leaders and celebs",
      "author": "",
      "content": "The 41st president of the United States, George Herbert Walker Bush, died on Friday, Nov. 30 at his Houston home. He was 94-years-old. As news of the World War II veteran's death spread across the globe, family members, politicians and pop culture celebrities expressed gratitude and paid tribute online to the life and legacy of the late president. In a statement on Twitter, his grandson George P. Bush said that H.W.'s most enduring legacy wouldn't be his public life, but the example he set for his family. \"He was more than a great man; he was a good man. His courage was matched by his compassion; and his dedication to country was equaled only by his devotion to his family,\" George P. Bush said. \"Gampy, we love you and we will miss you. But we will never forget you.\" The elder Bush was the son of a senator, Prescott Bush of Connecticut, and the father of Jeb Bush, the two-term governor of Florida, and George W. Bush, the two-term governor of Texas who went on to win two terms as president. Bush, who was 94, died just months after his wife Barbara. Early Saturday Jeb Bush tweeted, \"I already miss the greatest human being that I will ever know. Love you Dad!\" The 43rd president of the U.S., George W. Bush, released a statement on behalf of himself and his siblings: \"Jeb, Neil, Marvin, Doro and I are saddened to announce that after 94 remarkable years, our dear Dad has died. The entire Bush family is deeply grateful for 41's life and love, for the compassion of those who have cared and prayed for Dad.\" Former President Barack Obama said America had lost a \"patriot and humble servant in George Herbert Walker Bush\" in a statement released after the news broke. \"While our hearts are heavy today, they are also filled with gratitude. Our thoughts are with the entire Bush family tonight – and all who were inspired by George and Barbara’s example.\" Despite a contentious public relationship, President Donald Trump also mourned the loss, saying in a White House statement that \"through his essential authenticity, disarming wit, and unwavering commitment to faith, family, and country, President Bush inspired generations of his fellow Americans to public service—to be, in his words, 'a thousand points of light' illuminating the greatness, hope, and opportunity of America to the world.\" Speaker of the House Paul Ryan issued a statement saying that the elder Bush made the \"world safer and freer,\" calling the former president a war hero. \n\"Like so many Americans, I admired President Bush not only for how he served but for how he lived,\" Ryan said. Former President Jimmy Carter said that Bush's administration was \"marked by grace, civility, and social conscience.\" Former Vice President Dan Quayle shared a story about the impact Bush had on his family while the two served in the White House: \"I have often told my children 'If you want a role model in your life — look to President George Herbert Walker Bush. The world mourns the loss of a great American. But, it also celebrates a life well lived.' \" \"What a life... full of love of family... strong faith... nothing’s more important. God bless the Bush family at this sad time,\" former vice presidential candidate Sarah Palin said. While they were foes on the campaign trail in the 1990 election, former President Bill Clinton worked with Bush once they were both out of office on different humanitarian efforts. \"He never stopped serving,\" Clinton said in a joint statement with his wife, Hillary. \"I saw it up close, working with him on tsunami relief in Asia and here at home after Hurricane Katrina. His remarkable leadership and great heart were always on full display.” Former Vice President Joe Biden and his wife, Jill Biden, reflected on a time when Bush offered comfort to their family during a difficult time. \"When we went to Houston in 2015 to honor the doctors that cared for our deceased son Beau, President Bush insisted on coming out to see us.\" They called the elder Bush \"decent, kind, and welcoming,\" in a statement.\" Condoleezza Rice, who served as secretary of state under Bush Junior, called the senior president, \"the epitome of a public servant,\" in a statement on Facebook. From CEOs of major corporations and British royalty to pop culture figures who disagreed with Bush's politics, high profile world icons paid tribute to the former Republican president whose public life spanned longer than 50 years. \"We lost a great American,\" Apple CEO Tim Cook said on Twitter. Queen Elizabeth II reflected on her time with the man she referred to as a \"great friend and ally of the United Kingdom.\" In a statement Saturday, the queen referenced the late president's military service during World War II. \"It was with sadness that I learned of the death of President George H W Bush last night. Prince Philip and I remember our days in Texas in 1991 with great fondness. My thoughts and prayers are with President Bush's family and the American people. Arnold Schwarzenegger took to Twitter to offer condolences, reminding people to \"look up and offer him a silent thanks.\" Chaz Bono, an actor and son of singer and actress Cher, said in a Tweet that although he didn't agree with most of Bush's policies, he appreciates and respects his dedication as president. Other vocal liberal celebrities, including Ellen DeGeneres and Andy Cohen, took to social media to pay their respects. \"I will never forget George H.W. Bush and President Clinton meeting me in my old hometown of New Orleans to show support and raise money after Hurricane Katrina,\" Ellen tweeted. Cohen posted a photo on Instagram of the former President and his wife Barbara with the caption #RIP. Long before he was president, service was in his blood. Bush joined the Navy on his 18th birthday, months after the bombing of Pearl Harbor. After serving in World War II, he went to Yale and then moved his young family to Texas. There, he found his fortune in both the oil industry and politics. After serving as the chairman of the Harris County Republican Party in Houston, he lost his first U.S. Senate bid. He was then elected to the House of Representatives in 1966, where he served for four years before losing another campaign for the Senate. That loss seemed to serve him fine, though. President Richard Nixon appointed Bush as the United Nations ambassador and then brought him on to lead the Republican National Committee during Watergate. Following Nixon's resignation, Bush then named the chief of the U.S. Liaison Office in China by President Gerald Ford. He then went on to become director of the Central Intelligence Agency. Bush became Ronald Reagan's running mate in 1980, serving as vice president for the next eight years. When he won the presidency in 1988, he was ecstatic. ''We can now speak the most majestic words a democracy has to offer: 'The people have spoken,'\" he said after his victory. Funeral arrangements have not yet been announced.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "'A big one': 7.0 earthquake rocks Anchorage, Alaska; pipeline, flights, roads shut down",
      "url": "https://www.usatoday.com/story/news/2018/11/30/earthquake-strikes-near-anchorage-tsunami-warning-issued/2163178002/",
      "subtitle": "'A big one': 7.0 earthquake rocks Anchorage, Alaska; pipeline, flights, roads shut down",
      "author": "",
      "content": "A magnitude 7.0 earthquake struck Friday morning near Anchorage, Alaska, causing widespread damage, and alarming office workers who plunged under their desks. No deaths or injuries have yet been reported. Light fixtures fell, glass shattered, roadways collapsed and supermarket aisles were littered with fallen boxes, cans and jars. One man tweeted a photo of his toppled chimney and a local television station showed its studio filled with debris. A large section of an off-ramp near the Anchorage airport collapsed, marooning a car on a narrow island of pavement surrounded by deep chasms in the concrete. Several cars crashed at a major intersection in Wasilla, north of Anchorage, during the shaking, and about 10,000 were without power as of 4 p.m. local time, according to Matanuska Electric. Flights at the airport were suspended for hours after the quake knocked out telephones and forced the evacuation of the control tower. And the 800-mile Alaska oil pipeline was shut down while crews were sent to inspect it for damage. Anchorage’s school system canceled classes and asked parents to pick up their children while it examined buildings for gas leaks or other damage. Former Alaska governor and vice presidential candidate Sarah Palin tweeted, saying her family is intact but her \"house is not.\" \"This is a large earthquake, and there have been numerous aftershocks,\" said John Bellini, a geophysicist for the U.S. Geological Survey. He said the largest aftershock was a 5.7 magnitude quake about six minutes after the big one. The quake struck at 8:29 a.m. local time about 7 miles north of Anchorage, the USGS reported. Officials canceled a tsunami warning for coastal areas of southern Alaska. \"The bed started shaking, and everything was shaking so dramatically,\" Blair Braverman told CNN. \"People were running down the halls and banging on the doors to evacuate.\" Gov. Bill Walker said he had issued a disaster declaration. Besides widespread damage, the earthquake disrupted some communications and electrical service, the state’s Division of Homeland Security and Emergency Management said. As of 5 p.m. local time, businesses and residents started to settle back to some degree of normalcy. The operator of the trans-Alaska oil pipeline restarted the system after the earthquake shook Anchorage and the surrounding area. Alyeska Pipeline Service Company said it shut down the pipeline for about seven hours as a precaution. The company says it determined the pipeline was safe to restart after performing checks, but will continue to closely watch the system in the hours ahead. President Trump on Friday issued an emergency declaration for Alaska, which paves the way for federal agencies to help with relief efforts in the area. Jenni Hotch-Hill, 38, was at work at a hotel in midtown Anchorage when she felt the violent rumble. \"I could see the chandeliers swaying. The lobby fountain was spraying onto the ground. Some people were grabbing onto each other and running outside crying,\" the Alaska native said. The elevators at the hotel stopped running. She immediately left work to check on her family. The \"typical one hour commute took three,\" she said, because stoplights were out and roads and bridges were damaged. \"Normally when I feel an earthquake the ground moves like a wave and it feels somewhat predictable. This time it felt like the ground was being punched from under me.\" Brenekia Horne of Muldoon, a major neighborhood on the east side of Anchorage, said she thought the end had come. \"Death instantly crossed my mind and I started praying,\" said Horne, 24. She said she was dropping her son off at daycare when the earthquake occurred. \"I was having a conversation with my son's babysitter when it hit, midconversation. At first, I froze. The house started shaking, all the decorations fell off the wall and the TV tipped over.\" She said the daycare worker along with up to 10 kids scurried upstairs to wait out the quake. \"The kids took it better than we did. They were just confused about what was happening,\" she said. \"I've been thinking about it all day since. I just can't shake it.\" Ted Stevens Anchorage International Airport closed for damage assessment, but was gradually being reopened. As a precaution, the trans-Alaska oil pipeline, which runs 800 miles, was shut. The Anchorage School District canceled classes for its more than 100 schools and asked parents to pick up their kids when they could. President Donald Trump, who was briefed on the earthquake, tweeted that the federal government would \"spare no expense\" in helping Alaska through the quake's aftermath. Alaska averages 40,000 earthquakes a year, with more large quakes than the other 49 states combined. Anchorage has been hit hard before. A 1964 earthquake that registered 9.2, the largest ever in the U.S. and the second largest ever recorded, caused extensive damage to the city and resulted in 129 deaths. Corey Hester, the Executive Director of the Alaska Airmen Association, was awaken out of his sleep by the rumbling. “The bedframe in both of my bedrooms started jolting against the walls pretty violent and aggressively,” Hester said. After fumbling around to find his eyeglasses he grabbed a flashlight and surveyed the damage in his second-floor apartment. “There was minor structural damage to the sheetrock in the living room. Right up the road there’s a street with a pretty decent split it. Now, it serves as the resident speed bump, I suppose,” Hester said. Hester took to Facebook to share video of the carnage in his apartment. Shelves in the kitchen slid out of place, groceries fell out of the cupboard and picture frames fell off the shelves. One of the aftershocks hits midway through the 37-second clip causing pots and pans to rattle as a leather chair in the living room pulses up  and down on the hardwood floors. The video has garnered over 37,000 views within 5 hours. “The aftershocks were stronger than any of the other earthquakes I’ve experienced here in Alaska,” Hester said.  Contributing: The Associated Press",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Mysterious tale of Paul Whelan, American man accused of spying in Russia, steeped in contradictions",
      "url": "https://www.usatoday.com/story/news/world/2019/01/03/paul-whelan-russian-spy-novi-michigan-marines/2470833002/",
      "subtitle": "Mysterious tale of Paul Whelan, American man accused of spying in Russia, steeped in contradictions",
      "author": "",
      "content": "He traveled the world for business and for pleasure; that much is known about Paul N. Whelan, the Novi man the Russian government alleges was spying in Moscow when it arrested him Friday. The Russian Federal Security Service, known as the FSB, said Whelan, 48, was detained \"while on a spy mission\" and notified the State Department on Monday that it was holding him. He is being held in the Lefortovo Detention Facility in Moscow. The FSB offered no other details. If he's convicted of espionage, Whelan could face up to 20 years in prison. So how does an ex-Marine, who is allegedly visiting Russia to help a friend, get picked up as a spy? It's a case that has birthed countless theories and speculation not only about Paul Whelan, but also about America's complex relationship with Russia. More:Russia indicts American Paul Whelan on spying charges Government response to Whelan's case has been less-than-swift, and measured. U.S. Ambassador to Russia Jon Huntsman Jr., the former governor of Utah, visited Whelan on Wednesday at the Russian prison. He expressed support for Whelan and offered the help of the U.S. Embassy, a State Department spokesperson said. U.S. Secretary of State Mike Pompeo said Wednesday that \"if the detention is not appropriate, we will demand his immediate return.\" Whelan's travels brought him to Russia multiple times, said his brother, David Whelan, explaining that Paul Whelan is an ex-Marine who previously worked in global security for Troy-based Kelly Services and now works for BorgWarner, an Auburn Hills-based auto supplier. His brother said he'd traveled to Russia on Dec. 22 to help a friend from the Marines who was getting married in Moscow. The friend had asked Whelan to help his American family and friends get around in Russia. \"The friend asked if Paul could come and help because his family was going to Russia and hadn’t had a lot of experience there,\" David Whelan told the Free Press. \"Paul was there to help people tour the buildings and get around what can be a difficult country to navigate.\" Paul Whelan had planned to help the wedding party in Moscow through Tuesday Jan. 1. He was then scheduled to travel to St. Petersburg before returning home to Michigan on Jan. 6. But he disappeared on Dec. 28. His family said they didn't know what happened to him until Monday, when news reports trickled out saying he'd been arrested for espionage. Whelan never married and never had children, his brother said, but was very close to his parents, Rosemary and Edward Whelan. The elder Whelans live on a country road surrounded by farmland in Manchester, Michigan. The gated drive outside the home is marked, \"Dog playing in garden. Please stop and honk for entry.\" When a Free Press reporter honked, however, no one came to open the gate. Rather, lights were turned off inside the two-story gray-sided house, and blinds were pulled closed. A dog could be heard barking inside. An American flag hung limp from a pole in the yard beside an old red barn as freezing rain coated the ground. David Whelan, who lives in Newmarket, Ontario, north of Toronto, told the Free Press that the brothers, twins, grew up in Ann Arbor and graduated in 1988 from Huron High School. They have two other siblings, a brother and a sister. Other details about Whelan's past and his ties to Russia remain an enigma, and somewhat of a contradiction. Though David Whelan told the Free Press that his brother was \"absolutely\" innocent and said his service in the Marines and past work in law enforcement and global security make it hard for him to believe that Paul could have broken the law \"and certainly not breaking a law of espionage,\" there's evidence that Paul Whelan has previously run afoul of the law. The Marine Corps released Whelan's service record Wednesday, showing that he was convicted in a 2008 court-martial on charges related to larceny. According to his service record, he joined the Marine Reserves on May 10, 1994, and rose to the rank of staff sergeant in December 2004. Whelan was an administrative clerk and administrative chief and was deployed for the war against Iraq in 2004 and 2006. He was convicted at a special court-martial in January 2008 on several charges related to larceny involving writing bad checks and using someone else's Social Security number. He was given a bad-conduct discharge in December 2008 at the rank of private. Whelan's last place of duty was Marine Corps Air Station Miramar in California. While stationed in Iraq, Whelan was part of something called the Lamplighter’s Club, a group of service members who got together to enjoy good cigars. “It’s one of the unique pleasures that anyone can take advantage of, as everyone should take advantage of a fine cigar once in a while,” Whelan said in a 2007 interview posted on the 3rd Marine Aircraft Wing page of the Marine Corps website. Whelan also was part of “The Rest and Recuperation Leave Program,” which authorized 15 days of leave to service members on yearlong deployments to Iraq, according to another 2007 story on the website . The military paid for the travel and most service members chose to return home, but others could travel abroad. Whelan spent his two weeks in Russia, saying in the interview that the leave program “gives those of us who are single an opportunity to travel throughout the world wherever we want to go and experience the diversity of culture.” More: Tourist or American spy? Twin brother opens up More: Businessman: Here's why Russia nabbed Novi man accused of spying More:Accused spy Paul Whelan was discharged from Marines for bad conduct During his military career, Whelan received awards that included the Navy Meritorious Unit Commendation and Global War on Terrorism Expeditionary Medal. Novi District Court records show that Whelan was also involved in landlord-tenant disputes in 2007 over nonpayment of rent while he was on active service in the military. Court records also show a case was filed against Whelan in 2011 by a Norfolk, Virginia-based debt collector for $1,210.35. Whelan said he was a Chelsea police officer from 1988-2000, and also worked for the Washtenaw County Sheriff's Department, according to his testimony in a 2013 court deposition. Whelan was hired in 2001 by Kelly Services, a Troy-based company that offers consulting, temporary workers and workforce solutions to businesses around the world. He took a military leave of absence from Kelly Services, he testified, from 2003-2008, to serve in Iraq. At Kelly Services, his title was senior manager of global security and investigations. His job included campus security as well as electronic and IT-related security. He started working in early 2017 for BorgWarner, said company spokeswoman Kathy Graham. There, his job involves overseeing the security of facilities, assets owned by the company and its people, Graham confirmed. She noted that Whelan does not work in information technology, nor is he responsible for cyber security or industrial espionage duties as part of his job description for BorgWarner. While BorgWarner has customers all over the world and employs 29,000 people in the U.S., Europe and Asia, none of the company's international sites is in Russia, she said. Whelan also owns an online firearms company called Kingsmead Arsenal, according to business licensing records. Its address is the same as Whelan's apartment on Wellington Drive in Novi. He testified in the 2013 deposition that he has a federal firearms license. According to what to appears to be Paul Whelan’s profile on the popular Russian social media platform VKontakte, he posted “God save President Trump” — flanked by flag emojis — on Inauguration Day in 2016. A 2010 post referred to then-President Barack Obama as a “moron.” Another photo showed Whelan wearing a T-shirt of the Moscow soccer club Spartak. In March 2014, around the time of Russia’s annexation of Crimea, Whelan suggested that “Putin can have Alaska, as long as he takes Sarah Palin, too!” And a photo posted in August shows Whelan attending a security conference organized by the U.S. State Department. David Whelan disputes Russia’s allegation that his brother is a spy. Former CIA agent John Sipher agrees, saying Paul Whelan’s spotty military career would keep U.S. intelligence from hiring him for sensitive operations. “He absolutely does not fit the profile of someone we would use in a place like Moscow,” said Sipher, who once ran the agency’s Russia operations in Moscow. “Due to the oppressive level of counterintelligence scrutiny in Moscow, we do not put people without diplomatic immunity in harm’s way. Nor do we handle low-level intelligence collection operations in a place like Moscow.” Paul Whelan's arrest comes just a few weeks after Russian national Maria Butina agreed to cooperate with federal prosecutors; she pleaded guilty to conspiring to act as an agent for the Kremlin after working for years to infiltrate American political groups, including the National Rifle Association. Although some have speculated his arrest might be an attempt by the Russians to orchestrate a trade — Butina for Paul Whelan — his brother isn't willing to presume that's what is at play. \"People have looked for conspiracies and things or connections to Ms. Butina,\" he told the Free Press on Tuesday. \"But at the end of the day, it’s just hard to know. \"I think sometimes the geopolitical spectrum is a lot more complicated than that sort of trade-off. That could be what it was, but we’re trying not to focus on what the explanation might be, and are just trying to get him home.\" The Russian announcement of Paul Whelan's arrest came one day after President Vladimir Putin released a holiday greeting to President Donald Trump that stressed the importance of Russia-U.S. relations in \"ensuring strategic stability and international security.\" The one-sentence message also \"reaffirmed that Russia is open to dialogue with the United States on the most extensive agenda.\" U.S.-Russian relations have been battered by controversy despite Trump's frequent praise of Putin. Scores of Russian diplomats were expelled this year in response to the poisoning of a former Russian spy and his daughter in Britain that was linked to the Kremlin. And special counsel Robert Mueller's investigation of Russian interference in the 2016 U.S. election has brought scrutiny on communications between Trump's inner circle and Russian operatives. Aaron Retish, a Wayne State University professor who has taught modern Russian and Soviet history for 16 years, has been watching developments in the Whelan case. He said the timing of Whelan's arrest strikes him as odd, given Putin's recent request to meet with Trump again. \"You could see that there could be a potential upswing in U.S.-Russian relations, especially with the U.S. pulling out of Syria, which is also something that Putin praised,\" he said. “It’s an odd time to arrest someone, but you never know what is happening behind the scenes. This is also how Putin works. When you least expect it, something like this happens.” U.S. Rep.-elect Haley Stevens, D-Rochester Hills, who is set to take office on Thursday and whose district includes Whelan’s home and his company’s headquarters, said she has contacted the Whelan family. \"I am alarmed by Russia's detainment of one of my constituents, Paul Whelan,” she said. “I have been in touch with the Whelan family and I am committed to working with them to bring Mr. Whelan home. “Paul served our country as a Marine and law enforcement officer and we must ensure that Russia continues to meet its obligations under the Vienna Convention to provide U.S. officials access to Mr. Whelan. I am working with the State Department and will remain vigilant until Paul returns safely to his family in Michigan,” she added. The offices of U.S. Sen. Debbie Stabenow, D-Mich., and U.S. Sen. Gary Peters, D-Mich., had no comment on Whelan's arrest or his possible release. Detroit Free Press staff writers Todd Spangler, JC Reindl, Gina Kaufman, Phoebe Howard, the Associated Press and USA Today's Deirdre Shesgreen, Tom Vanden Brook and John Bacon contributed to this report.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sen. John McCain's 2008 running mate Sarah Palin not invited to his funeral, reports say",
      "url": "https://www.usatoday.com/story/news/politics/onpolitics/2018/08/30/john-mccain-funeral-sarah-palin-not-invited/1150484002/",
      "subtitle": "Sen. John McCain's 2008 running mate Sarah Palin not invited to his funeral, reports say",
      "author": "",
      "content": "Sen. John McCain's 2008 running mate Sarah Palin and other members of the Arizona Republican's failed presidential campaign were not invited to his funeral or other memorial services, according to multiple media reports. The former Alaska governor, campaign manager Steve Schmidt, adviser Nicolle Wallace and strategist John Weaver were all left off the guest lists for  McCain's memorial services, Politico reported, citing three unnamed sources. \"Out of respect for Sen. McCain and his family we have nothing to add at this point. The Palin family will always cherish their friendship with the McCains and hold those memories dear,\" a source close to the McCain family told CNN and NBC News. It was unclear who made the final decisions on the guest lists, Politico said. \"John McCain was my friend,\" Palin tweeted Saturday after McCain died from brain cancer. \"I will remember the good times. My family and I send prayers for Cindy and the McCain family.\" In another tweet Saturday, Palin said, \"Today we lost an original. Sen. John McCain was a maverick and a fighter, never afraid to stand for his beliefs.\" In McCain's memoir, \"The Restless Wave: Good Times, Just Causes, Great Fights, and Other Appreciations,\" which published in May, he said he wished he had picked Democrat-turned-independent Joe Lieberman as his running mate instead of Palin. Palin told the Daily Mail that hearing reports of that excerpt was like a \"gut punch,\" although she said she attributed it to \"ghostwriters.\" More:Nation's capital prepares a hero's welcome for late Sen. John McCain Politico reported that McCain became angry with Schmidt for his criticism of the decision to select Palin, even though Schmidt had been one of the advisers advocating her for the VP slot. Schmidt and Wallace cooperated with the authors of the 2009 book \"Game Change\" (which was made into and HBO movie), which painted Palin in a very unflattering light. Weaver, the man behind McCain's \"Straight Talk Express,\" left the campaign in 2007 when McCain's primary run appeared doomed. The move not to invite Palin did not sit well with some conservatives. \"I don’t get that,\" said \"Fox & Friends\" host Brian Kilmeade Thursday. “It doesn’t make any sense.” \"If she’s good enough to be VP, she’s good enough to be at the funeral,\" one former aide told Politico. A memorial service for McCain was held Thursday in Phoenix before his body was flown to Washington, D.C. He will lie in state in the Capitol on Friday and a funeral service will be held at the National Cathedral on Saturday. He will be buried Sunday at the Naval Academy in Annapolis, Maryland.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Incoming congresswoman Ocasio-Cortez reveals Jewish ancestry at New York Hanukkah event",
      "url": "https://www.usatoday.com/story/news/politics/onpolitics/2018/12/11/ocasio-cortez-reveals-jewish-ancestry/2275410002/",
      "subtitle": "Incoming congresswoman Ocasio-Cortez reveals Jewish ancestry at New York Hanukkah event",
      "author": "",
      "content": "Rep.-elect Alexandria Ocasio-Cortez surprised the crowd at a Hanukkah event in New York on Sunday with a revelation that she has Jewish heritage. After lighting the Hanukkah candles, the incoming Democratic congresswoman from New York said members of her family had been looking into their background in recent weeks and they discovered that some of their descendants were among a group of Jews who were persecuted during the Spanish Inquisition. \"One of the things a lot of people don’t know about Puerto Rico, and something we discovered ourselves, is that a long time ago, many generations ago, my family consisted of Sephardic Jews,\" Ocasio-Cortez said. It was the first time she had spoken publicly about her Jewish ancestry, she told Haaretz. \"The story goes that during the Spanish Inquisition, Jews were forced, on the exterior, to convert to Catholicism, but on the interior they continued to be who they were, continued to practice their faith,\" Ocasio-Cortez said. \"A strong group of people, who wanted to continue living life the way they wanted to live it, decided to get on a boat and leave Spain. Some of these people ended up in Puerto Rico.\" In the 15th century, Spain's monarchs ordered the estimated 300,000 Jews then living in the country to convert to Catholicism or leave. Those who fled are referred to as the Sephardic Jews, according to Haaretz. In a tweet, the Israeli news site said that Ocasio-Cortez is \"one of an estimated 65 million Latin Americans whose Sephardic roots can be traced back to the Expulsion of the Jews from Spain and Portugal a half millennium ago.\" After the candle lighting, Ocasio-Cortez joined in singing a song in Ladino, which the Stroum Center for Jewish Studies at the University of Washington calls \"the endangered language of Sephardic Jews.\" Anticipating criticism, Ocasio-Cortez tweeted the following day, \"Before everyone jumps on me – yes, culture isn't DNA. But to be Puerto Rican is to be the descendant of: African Moors + slaves, Taino Indians, Spanish colonizers, Jewish refugees and likely others.\" \"If anything, the stories of our ancestry give us windows of opportunity to lean into others, to seek them out, and see ourselves, our histories, and our futures, tightly knit with other communities in a way we perhaps never before thought possible,\" she tweeted. The event at the Jackson Heights Jewish Center was hosted by Jews for Racial and Economic Justice. More:Ocasio-Cortez decries congressional pay, vows to give interns 'at least' $15 an hour More:Sarah Palin mocks Ocasio-Cortez gaffe. Critics point to Palin's own history of errors More:Alexandria Ocasio-Cortez, new youngest Congresswoman, says she can't afford D.C. apartment ",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "'I can see 2022 from my house': Palin taunts Murkowski ahead of Kavanaugh vote",
      "url": "https://www.usatoday.com/story/news/politics/2018/10/05/sarah-palin-taunts-sen-lisa-murkowski-ahead-brett-kavanaugh-vote/1536750002/",
      "subtitle": "'I can see 2022 from my house': Palin taunts Murkowski ahead of Kavanaugh vote",
      "author": "",
      "content": "Alaska Sen. Lisa Murkowski, a crucial Republican swing vote in Brett Kavanaugh's confirmation to the Supreme Court, received a playful prodding from the former governor of Alaska on Twitter. \"I can see 2022 from my house,\" Sarah Palin tweeted on Friday afternoon, mentioning Murkowski. The tweet was widely viewed as a thinly-veiled threat to challenge Murkowski in her 2022 reelection campaign to the Senate. \"From my house\" references a 2008 Saturday Night Live sketch mocking Palin, then John McCain's running mate. To this day, many Americans believe it was Palin that said \"I can see Russia from my house\" when in fact the line was delivered by Tina Fey. Earlier this year, Palin expressed a willingness to run for public office again, according to The Hill. The publication reported that she told Fox News host Mark Levin in April that she was glad she joined the McCain ticket and would do it again \"in a heartbeat.\" On Friday Morning, Murkowski was the only Republican to vote against a procedural move advancing Kavanaugh's nomination. More:Sen. Susan Collins a 'yes' on Brett Kavanaugh, giving Republicans enough votes \"I believe that Brett Kavanaugh is a good man, I believe he is a good man. But it just may be that in my view he’s not the right man for the court at this time,\" she said Friday after the vote. “This has truly been the most difficult evaluation of a decision that I’ve ever had to make and I’ve made some interesting ones in my political career.” This isn't the first time Murkowski has faced the potential consequences of her votes. She lost the Republican primary to a Tea Party challenger in 2010, winning re-election with a write-in campaign instead. Contributing: Eliza Collins and Trevor Hughes, USA TODAY; Dan Nowicki, Arizona Republic ",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez embraces 'radical' label, says 'no question' Trump is racist",
      "url": "https://www.usatoday.com/story/news/politics/onpolitics/2019/01/07/ocasio-cortez-says-trump-racist/2499800002/",
      "subtitle": "Alexandria Ocasio-Cortez embraces 'radical' label, says 'no question' Trump is racist",
      "author": "",
      "content": "WASHINGTON – Rep. Alexandria Ocasio-Cortez continues to draw an unusually large amount of media attention for a freshman House member, this time calling President Donald Trump a racist during a wide-ranging interview Sunday on CBS' \"60 Minutes.\" \"The president certainly didn't invent racism. But he's certainly given a voice to it and expanded it and created a platform for those things,\" the New York Democrat told Anderson Cooper. \"Do you believe President Trump is a racist?\" Cooper asked. \"Yeah, no question,\" she replied. In response, the White House told \"60 Minutes\" that \"Ocasio-Cortez's sheer ignorance on the matter can't cover the fact that President Trump supported and passed historic criminal justice reform\"  and \"has repeatedly condemned racism and bigotry in all forms.\" At 29, Ocasio-Cortez is the youngest woman ever elected to Congress. Her social media skills are fierce, helping make the self-described democratic socialist a darling among the progressive crowd and a target for conservatives. Conservatives have gone after the newly-seated congresswoman for her rent woes, her clothes and, most recently, one apparently conservative-leaning Twitter user attermpter to embarrass her with a college-era dance video. The latest attempt backfired when social media users deemed the video adorable rather than scandalous and Ocasio-Cortez posted a fresh dance video in response. 'What world do we live in?':Stunned producer of Ocasio-Cortez dance video reacts to attention Ocasio-Cortez's first days in Congress:Treated as intern, clothing criticized Her critics have also flagged a number of Ocasio-Cortez's legitimate social media gaffes, including one in which she misstated the \"three chambers of government\" and some fuzzy math about Pentagon spending that earned her \"four Pinocchios\" from the Washington Post. More:Sarah Palin mocks Ocasio-Cortez gaffe. Critics point to Palin's own history of errors Ocasio-Cortez made the comment about Trump being racist in the context of defending mistakes like those. \"If people want to really blow up one figure here or one word there, I would argue that they're missing the forest for the trees,\" she said. \" I think that there's a lot of people more concerned about being precisely, factually and semantically correct than about being morally right.\" \"But being factually correct is important,\" Cooper reminded her. Ocasio-Cortez agreed, but added, \"whenever I make a mistake, I say, 'OK, this was clumsy,' and then I restate what my point was. But it's not the same thing as the president lying about immigrants. It's not the same thing at all.\" When asked to back up her assertion that the president is a racist, Ocasio-Cortez pointed to \"the words that he uses, which are historic dog whistles of white supremacy.\" \"When you look at how he reacted to the Charlottesville incident, where neo-Nazis murdered a woman, versus how he manufactures crises like immigrants seeking legal refuge on our borders, it's night and day,\" she said. More:Ocasio-Cortez's rise leaves outgoing Democrat Claire McCaskill 'confused,' report says Cooper asked her about her \"radical agenda,\" such as getting the country to zero carbon emissions and increasing taxes on the wealthy to as high as 70 percent. Ocasio-Cortez embraced the label. \"I think that it only has ever been radicals that have changed this country,\" she said. On Sunday, Rep. Steve Scalise, R-La., called off a Twitter debate with Ocasio-Cortez, citing her \"radical followers\" as the reason, after one of them wrote, \"snipe his ass\" in response to one of Ocasio-Cortez's replies. Scalise was badly wounded in a 2017 shooting by a politically-motivated gunman during a congressional baseball team practice. \"She got better aim than James Hodgkinson, that's for sure,\" replied another Twitter user, referring to the shooter. \"Kick his cane,\" tweeted another. \"Happy to continue this debate on the Floor of the People’s House, but it’s clearly not productive to engage here with some of your radical followers. #StayClassy\" Scalise tweeted. More:Incoming congresswoman Ocasio-Cortez reveals Jewish ancestry at New York Hanukkah event More:Ocasio-Cortez decries congressional pay, vows to give interns 'at least' $15 an hour ",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Joe Biden scented candles are so popular at this Delaware museum, they always run out",
      "url": "https://www.usatoday.com/story/news/2018/11/02/joe-biden-scented-candles-museum-other-swag/1856213002/",
      "subtitle": "Joe Biden scented candles are so popular at this Delaware museum, they always run out",
      "author": "",
      "content": "What do Joe Biden scented candles smell like? Certainly not Joe Biden, unless he walks around smelling like an orange all the time. The $22 candles are the best-selling item at the Delaware History Museum in Wilmington, regularly selling out thanks to still-strong home state \"Joementum\" even nearly two years after the former vice president left office. \"Customers think it's hilarious, and then everyone's like, 'What does Joe smell like?' and they have to open it and smell it,\" says Karen Kegelman, the museum's advancement officer. The museum started selling the candles about a year ago after spotting them on e-commerce website Etsy. Since the museum used to sell Joe and Jill Biden paper dolls, they decided the candles would be a good fit. The description of the candles is just about as goofy as the idea for the product itself: \"Your long search is finally over. You have acquired a Joe Biden scented candle, perhaps as a funny gift. Now the only thing standing between you and Joe Biden is ... well, basically all the same stuff as before. But at least now you have this great candle! \"The Joe Biden scented candle is more than just a candle that vaguely resembles Joe Biden. It’s also a friend, a confidante (at least as much as any other inanimate object), and a mentor (if you’re trying to be a candle). You’ll feel your hope and optimism being restored as you lift the lid and inhale the aroma of Biden’s favorite orange-flavored sports drink. (We won’t mention the brand name, but see if you can guess! Here’s a hint: It’s not Powerade.) \"You can even pay homage to Biden’s love of Amtrak by bringing it along on your next train ride! Trust us when we say that nothing is a bigger hit on trains than a lit candle* *You should not really trust us when we say this.\" And, yes, it's true that orange Gatorade is Biden's favorite drink. At least that's what he told Us Weekly in 2016. The candles sell for $22 each at both the museum and on Etsy, but the museum gets a few extra bucks for each one because they buy in bulk. (The museum doesn't have an online store, so you have to visit 504 N. Market St. next to The Queen to get them.) The museum isn't the only one buying in bulk. One museum-goer bought six of them, plunking down $132. \"All the staff here are big fans of Joe Biden and are endlessly amused by him,\"  Kegelman says of the possible 2020 presidential candidate, a past honoree of the museum's History Makers Award. \"Any time we see any fun Joe Biden merchandise, we think we need to get it for the store.\" As you might imagine, the Delaware History Museum isn't the only spot selling Biden swag. We spent a little too much time online and found these other goodies that are currently available. American Possibilities, the political action committee created by Biden last year, has an online store with five available products, including this one featuring one of his favorite words: malarkey. $25. Back in the day, Biden was all business in the front and party in the back. And, thankfully, his glorious mullet was preserved forever on this political button. $24.99. We all know Joe can scarf ice cream. This pin documents his love of the cold stuff. $11. If Joe spots you in Pep Boys or Brew HaHa! wearing this T-shirt, you'll surely get The Full Biden: An unusually close eye-to-eye conversation, a shoulder squeeze and a selfie or two. $25. Biden's PAC also sells this coffee mug, so you can wake up with both joe and Joe. $25. 'Memba when there was big buzz charging through the state because the guy many simply know as Joe was on track to become vice president? This button captures the moment. $11.65. Hey, that's us! The News Journal's 2008 front page from the day after Barack Obama and Biden beat John McCain and Sarah Palin is framed for display. $29.99. \"America’s future is so bright, Joe Biden needs sunglasses,\" reads the description of this Biden PAC tee. $25. If you want a Pete Souza official White House photo of Biden butt-flexing, then this is for you. (Jill, this one's for you!) Or you can just download it yourself from the Obama White House Flickr page for free. $7.98. Is that Joe at your backyard barbecue? Or maybe standing with your family next to the Christmas tree? Best part: There's zero chance he'll say something weird! $47.95. Remember back when plagiarism allegations would be enough to torpedo a presidential campaign? Biden does. President Donald Trump says, \"Hold my beer.\" $12.99. This coffee mug features 14 Biden heads. A Democrat's dream and a Republican's nightmare. $14.95. Joe Biden, Barack Obama & 'Detective Capriotti' star in murder mystery 'Hope Never Dies' Biden laments Trump-era tone, offers possible 2020 preview Contact Ryan Cormier of The News Journal at rcormier@delawareonline.com or (302) 324-2863. Follow him on Facebook (@ryancormier), Twitter (@ryancormier) and Instagram (@ryancormier).",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Who is Cindy Yang and how is she connected to Trump and the spa where Patriots owner was charged?",
      "url": "https://www.usatoday.com/story/news/politics/2019/03/09/spa-founder-linked-robert-kraft-prostitution-case-cindy-yang/3115702002/",
      "subtitle": "Who is Cindy Yang and how is she connected to Trump and the spa where Patriots owner was charged?",
      "author": "",
      "content": "A day spa that led to prostitution charges against New England Patriots owner Robert Kraft. A business consulting firm offering foreign companies access to President Donald Trump. One person helped found both: Li Yang, better known as Cindy Yang. Almost overnight, the Chinese entrepreneur went from unknown Florida resident to the center of attention with questions mounting about her businesses and political ties. The story seems to be only getting weirder. And it's all centered in a state known for its bizarre news. Here's everything we know about Yang and her businesses: Yang, 45, started a chain of Asian spas called Tokyo Day Spas throughout Florida, which included Orchids of Asia Day Spa that police say Kraft visited multiple times to solicit sexual favors. Kraft's charges resulted from a prostitution and sex-trafficking probe of similar businesses — where massage parlors doubled as venues for prostitution. About 300 others were charged in the probe. More:How Florida police snared nearly 300 — including Robert Kraft — at spas used for sex trafficking Authorities say they have footage of Kraft visiting the Jupiter, Florida, spa and receiving oral sex in January, just hours before the AFC Championship Game where he watched the Patriots beat the Kansas City Chiefs. Police detailed that many women who worked at the spas were Chinese and forced to live at the spas against their will. Yang, who was not charged in the investigation, told the Miami Herald that she had sold the spa before the scandal involving Kraft. The Herald reports that her family still owns several South Florida spas, and the Tokyo Day Spa chain has attracted police attention on allegations of similar prostitution activity. When talking with the Herald, Yang denied ever breaking the law but declined to answer questions about her knowledge of sex being offered at the spas. The Herald reported that Yang was not active in politics until the 2016 election and the rise of Donald Trump, noting records showed she hadn't voted in 10 years. But that changed after the 2016 election. Since Trump has taken the White House, Yang and her relatives have donated more than $42,000 to a Trump political action committee and more than $16,000 to Trump’s campaign, the Herald reported. On a now-deleted website for Yang's consulting business, she described herself as a \"member of the presidential fundraising committee.\" Yang also runs a consulting business that offers to sell Chinese clients access to Trump and his family at Mar-a-Lago, according to the company's website. Mother Jones, which broke the story Saturday, reported the company  — GY US Investments LLC — has a website, mostly in Chinese, that shows her and purported clients hobnobbing at the presidential retreat. It details Yang's vast network within the Trump administration and Republican Party — including photos with the president, his family, members of Congress and key White House aides — and offers businesses and individuals a window into that network. More:Founder of Florida spa tied to Robert Kraft case offered access to Trump and family at Mar-a-Lago to Chinese clients The company, founded in 2017 by Yang and her husband, Zubin Gong, describes itself as a consulting firm that helps businesses in America \"expand their brand image in the modern Chinese marketplace.” The website lists events where Yang and others at the company mingled with the president and members of his cabinet, such as Commerce Secretary Wilbur Ross and Transportation Secretary Elaine Chao. It boasts about opportunities for businesses and individuals where they can “have the opportunity to interact with the president” and other “political figures.” It lists various dinners and charity events where the company boasts it has \"arranged taking photos with the President\" and suggests it can set up a \"White House and Capitol Hill Dinner.\" The site lists a fluid calendar of events, most including Trump, and a phone number for interested businesses and parties to call. Scanning through Yang's Facebook page or her company website, one would think she was one of the most well-connected people in Washington. The Miami Herald was the first to uncover photos of Yang with Trump and other high-profile figures, finding on her Facebook page that she'd watched this year's Super Bowl at a party hosted by the president. Yang snapped a selfie photo with Trump from the Super Bowl watch party, held at the president's West Palm Beach country club, the Miami Herald reported. More:Founder of Florida day spa tied to Robert Kraft's prostitution case attended Trump's Super Bowl party, report says Trump, a longtime friend of Kraft and a Patriots admirer, is seen leaning back in his chair and smiling with Yang and another woman who are seated at a table behind the president in the blurry photo. They watched New England beat the Los Angeles Rams for the franchise's sixth championship. An array of additional photos were uncovered Saturday after Mother Jones discovered a deleted website for Yang's consulting business. A cached version of the website from the Internet Archive's Wayback Machine,shows Yang attending a number of galas, dinners and political events, even getting an invite to the White House for one event. The website shows photos of Yang with the president's family, including sons Eric Trump and Donald Trump Jr., top White House aide Kellyanne Conway, former Trump aide Sebastian Gorka and Fox News host Jesse Watters. Between photos posted on social media and on her website, Yang is photographed with nearly everyone in Trump's orbit, from prominent members of Congress such as Republican Rep. Matt Gaetz and former Alaska Gov. Sarah Palin to Trump's campaign manager Brad Parscale. The webpage also lists photos from a December 2017 fundraising event in New York City where Trump made remarks about trade with China and a recent trip he took to the country. The company wrote there was nearly 100 Chinese attendees at the event, “which marked the rise of Chinese political participation in politics.” The page includes photos of attendees with Trump and Conway, who is dubbed “the hero of Trump’s presidency” on the website. Yang is listed on her company's website as “one of the only guests in South Florida who was invited to the White House to celebrate” the Chinese New Year in 2018. Several photos of the event show Yang and others wearing what appears to be a White House-issued pass, which are given by security in order to gain access to the grounds. Contributing: Doug Stanglin, USA TODAY.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Founder of Florida spa tied to Robert Kraft case offered access to Trump and family at Mar-a-Lago to Chinese clients",
      "url": "https://www.usatoday.com/story/news/politics/2019/03/09/cindy-yang-spa-owner-runs-firm-sells-access-trump-maralago-report/3113441002/",
      "subtitle": "Founder of Florida spa tied to Robert Kraft case offered access to Trump and family at Mar-a-Lago to Chinese clients",
      "author": "",
      "content": "Cindy (Li) Yang, a Florida entrepreneur who founded a chain of spas and massage parlors that included the one where New England Patriots owner Robert Kraft was arrested recently for allegedly soliciting prostitution, also runs a consulting business that has offered to sell Chinese clients access to President Donald Trump and his family at Mar-a-Lago, according to the company's website. Mother Jones, which broke the story on Saturday, says Yang could not be reached for comment. The White House did not immediately respond to requests for comment.\n\nYang, a donor to the Republican Party and Trump campaign, popped up this week in photos showing her at a Super Bowl viewing party at the Trump-owned Mar-a-Lago that included a selfie with the president, the Miami Herald reported. According to Mother Jones, Yang's company — GY US Investments LLC — has a website, mostly in Chinese, that shows her and purported clients hobnobbing at the presidential retreat. While Mother Jones' examination on the website includes critical detail about a New Year's Eve gala at Mar-a-Lago, a cached version of the website using the Internet Archive’s Wayback Machine from August 2018, examined by USA TODAY, also confirms the key points of the magazine's story. It details Yang's vast network within the Trump administration and Republican Party — including photos with the president, his family, members of Congress and key White House aides — and offers businesses and individuals a window into that network. The company, founded in 2017 by Yang and her husband, Zubin Gong, describes itself as a consulting firm that helps businesses in America \"expand their brand image in the modern Chinese marketplace.” Mother Jones says the website stopped functioning the same day the Herald story was published about Yang and her connection to the spas. The website, mostly in Chinese, lists events where Yang and others at the company mingled with the president and members of his cabinet, such as Secretary of Commerce Wilbur Ross and Transportation Secretary Elaine Chao. It also lists photos with the president's family, including sons Eric Trump and Donald Trump Jr., top White House aide Kellyanne Conway, former Trump aide Sebastian Gorka and Fox News host Jesse Watters. It boasts about opportunities for businesses and individuals where they can “have the opportunity to interact with the president” and other “political figures.” It lists various dinners and charity events and a fluid calendar of events, most including Trump. One also listed Republican Committee Chairwoman Ronna McDaniel. According to Mother Jones, the company boasts it has “arranged taking photos with the President” and suggests it can set up a “White House and Capitol Hill Dinner.” The company listed one event in Ohio on May 4 where it advertises the opportunity to meet Trump and take a  “one-on-one photo” and get an autograph. During the event, Trump talked up the new Republican tax law and discussed relations with North Korea. The company included an array of photos showing Yang attending a number of high profile events, several of which were held at Mar-a-Lago in Palm Beach, Florida, and one held at the White House. During a May 2018 dinner for a “Lincoln Remembrance Day” event at Mar-a-Lago, the company boasted that “every member of the Florida political community” was “eager to participate” in the event since it was held at the “winter White House.” The company lists photos of Yang with former Alaska Gov. Sarah Palin and several of attendees with the president’s son, Donald Trump Jr. The webpage also lists photos from a December 2017 fundraising event in New York City where Trump made remarks about trade with China and a recent trip he took to the country. The company wrote there was nearly 100 Chinese attendees at the event, “which marked the rise of Chinese political participation in politics.” The page includes photos of attendees with Trump and Conway, who is dubbed “the hero of Trump’s presidency” on the website. Yang is described on the page as a “member of the presidential fundraising committee” and was listed as “one of the only guests in South Florida who was invited to the White House to celebrate” the Chinese New Year in 2018. Several photos of from the event show Yang and others wearing what appears to be a White-House issued pass, which are given by security in order to gain access to the grounds.   The website says Yang has been “settled in the United States for more than 20 years” and is a member of the “Presidential Fundraising Committee.” According to the Herald, Yang is a registered Republican, and since 2017 she and her relatives have donated more than $42,000 to a Trump political action committee and more than $16,000 to Trump’s campaign. Yang, according to the Miami Herald, says she is no longer in the spa business and in 2013 sold Orchids of Asia Day Spa, the massage parlor where authorities say Kraft was caught on camera paying for sex on the morning of the Jan. 20 AFC Championship game. Kraft, who has denied the charge, is a close friend of Trump's and frequent visitor to Mar-a-Lago. Yang was not charged in the anti-human-trafficking operation last month that shut down 10 Asian day spas in Florida, none of which are registered to her or her family. Investigation:How Florida police snared nearly 300 — including Robert Kraft — at spas used for sex trafficking More:Why is there only one human trafficking charge in Florida massage parlor busts?  AMERIND Risk provides peace of mind with our comprehensive suite of coverage products. Click to learn more! Sponsored by AMERIND Risk",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin mocks Ocasio-Cortez gaffe. Critics point to Palin's own history of errors",
      "url": "https://www.usatoday.com/story/news/politics/onpolitics/2018/11/20/sarah-palin-mocks-alexandria-ocasio-cortez/2068506002/",
      "subtitle": "Sarah Palin mocks Ocasio-Cortez gaffe. Critics point to Palin's own history of errors",
      "author": "",
      "content": "Progressive Democrat Alexandria Ocasio-Cortez is quickly becoming the most recognizable face among Congress' incoming freshman class. From participating in a climate change protest at House Minority Leader Nancy Pelosi's office to being mistaken for an intern and wondering if she can afford an apartment in Washington, the incoming New York representative has been getting a level of media attention that could make veteran lawmakers green with envy. On Monday, the self-described democratic socialist drew some attention of the negative sort when conservative critics pounced on a video in which she refers to the \"three chambers of Congress\" and the \"three chambers of government,\" which she says are the \"presidency, the Senate and the House.\" It was unclear if she meant to refer to the three branches of government, which would be the executive, legislative and judicial. One of the conservatives who piled on Ocasio-Cortez was the 2008 Republican vice presidential candidate, Sarah Palin. \"YIKES: Ocasio-Cortez Fumbles Basic Civics TWICE In 1 Statement,\" the former Alaska governor tweeted, along with a link to a story on her website about Ocasio-Cortez's gaffe. But Twitter users were quick to say that Palin had little right to be critical given her own well-documented history of mistakes, misstatements and misunderstandings, which includes a claim that she had foreign policy credentials because Russia was near Alaska and a reference to our \"North Korean allies.\" In response, Ocasio-Cortez tweeted that Republicans should focus on her argument rather than \"waiting to chop up word slips that I correct in real-tomd,\" adding a typo to her woes. In another tweet, she said two \"fallen GOP Vice Pres candidates\" had now gone after her. (She later clarified the other was Al Gore's running mate, Joe Lieberman, whom she considers a Republican.) and she compared Palin's tweet to \"grandpa emails\" from 2008.  This weekend, Ocasio-Cortez also drew some more media attention with a tweet proposing to swap the Columbus Day federal holiday for one on Election Day. On Saturday, the woman is about to become the youngest person serving in Congress at 29 wondered, \"How is Columbus Day a holiday but Election Day not?\" Daily Mail editor David Martosko quipped that Ocasio-Cortez \"hasn't even started the job yet and she's already angling for more vacation days.\" In response, she tweeted that she disagreed \"that Americans get too much vacation time\" and said Americans get less time off than people in most other developed nations.\" \"I am willing to compromise by eliminating Columbus Day to give Election Day off,\" she said. \"See? I can be pliant.\" \"One of the requirements of public service should be a sense of humor,\" Martosko tweeted back. Ocasio-Cortez's first days in Congress:Treated as intern, clothing criticized More:Ocasio-Cortez says Fox News segment on her rent struggles mocked the middle class More:On her first day of orientation on Capitol Hill, Alexandria Ocasio-Cortez protests in Pelosi's office  AMERIND Risk",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "How Joe Biden's life, full of tragedy and triumph, led to one more run at the presidency",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/04/22/joe-biden-president-2020-trump-election/3538191002/",
      "subtitle": "How Joe Biden's life, full of tragedy and triumph, led to one more run at the presidency",
      "author": "",
      "content": "WILMINGTON – Joe Biden might not be done making history after all. The gregarious politician, who climbed from a county council seat to the U.S. Senate before serving two terms as vice president, wants to occupy the White House himself. The 76-year-old is expected to announce this week he will run for the nation's top job for a third time, entering a crowded field of Democratic contenders who want to challenge President Donald Trump. If elected, he would be the oldest president ever inaugurated. Biden, who has often paraphrased Irish poet James Joyce by saying, “When I die, Delaware will be written on my heart,” has been defined by his blue-collar roots, dating back to his Scranton, Pennsylvania, upbringing as one of four children in an Irish Catholic family. He is equally at ease chatting up Delawareans while shopping as he is pressing and persuading world leaders, living by the words his mother Jean would often repeat to a young Joe: “You’re not better than anybody else, but nobody is better than you.” After a pair of failed presidential runs, Biden’s second act as President Barack Obama’s No. 2 catapulted him into a new position of power, with the president agreeing Biden would be “the last guy in the room” for every major decision. Biden and his unshakable authenticity found much wider fame with Obama. He spawned an endless stream of internet memes and late night talk show appearances while becoming a must-have selfie when spotted in public, which is often, especially back home in Delaware. He is seen by many as the Everyman politician and not just because of his glad-handing. It's also for decisions like having the U.S. Secret Service hang back when he makes his rounds at hometown spots like a Capriotti’s sandwich shop, Brew HaHa! coffeehouse or University of Delaware football games. Simply known as “Joe” wherever he roams in the nation’s second smallest state, he always leaves an impression. That was him delivering the commencement address at Delaware State University in 2016, lingering in a downpour to take photos with as many of the 700 graduates as wanted one. And that was also him in 1977 when Wilmington’s Mary Hartnett was the victim of a purse-snatching, when Biden saw her running and screaming. Biden followed the young thief in his car, jumped out, ran through a couple of backyards and hopped a few fences before the kid threw down her pocketbook. But Biden's long public career gives opponents material that could haunt his campaign. His handling of the 1991 Anita Hill testimony during the Clarence Thomas Supreme Court nomination hearings has not held up well in the #MeToo era. As chairman of the Senate Judiciary Committee, he was blamed for what critics saw as accusatory questioning of Hill by the panel's 14 male senators when she detailed her allegations that Thomas had sexually harassed her. Recently, Biden expressed regret over how it played out. “To this day I regret I couldn’t come up with a way to give her the kind of hearing she deserved,” he said. As he prepared to enter the 2020 presidential race, Biden has been faced with allegations from several women who said his style of physical contact made them uncomfortable. He released a video saying he would be more \"mindful and respectful of people's personal space.\" Throughout his career, the same flowing tongue that made him a relatable figure to voters also led to a tendency for frequent verbal gaffes. Currently leading the Democratic field in several polls, Biden will face a tough fight from the left wing of the party, a group skeptical of his record on issues such as criminal justice reform. Known for bipartisan friendships, Biden's recent description of Vice President Mike Pence as a \"decent guy,'' didn't sit well with staunch Democrats. The right is likely to go after his cautious military policy – including his opposition to the raid that killed Osama Bin Laden – and his connections to the Obama administration. Politics aside, Biden has seen his share of tragedy. The loss of his wife and daughter in an accident in the 1970s and four decades later losing a son to cancer have provided very public and authentic glimpses into Biden. It's safe to say, there's more to Joe Biden than a big smile, aviator glasses and outgoing personality. \"Failure at some point in your life is inevitable,'' he said at the 2008 Democratic National Convention in Denver. \"But giving up is unforgivable.\" Here is a look at Biden's life and career ahead of his expected presidential run. No one will argue Biden doesn't wear his heart on his sleeve. But it's for good reason. His adult life has been marked by tragedy, starting in 1972 when his wife of six years, Neilia, and 13-month-old daughter Naomi were killed in a car crash that also injured sons Hunter and Beau. The accident came a little more than a month after Biden, then 29, scored a major upset against Republican incumbent Sen. J. Caleb Boggs, a statewide officeholder for 26 years. Biden had become the fifth-youngest U.S. senator in history. It was Dec. 18, 1972 – seven days before Christmas – when the family’s Chevrolet station wagon collided with a tractor-trailer loaded with corncobs at the intersection of Limestone and Valley roads in Hockessin, Delaware. Heartbreaking photos by News Journal photographer Fred Comegys showed the devastation. The station wagon was left as a pile of twisted metal and glass with the windshield lying on the mangled hood, the driver’s side rear door rammed inside the car and the left rear wheel ripped off. The front of the tractor-trailer was crushed, rippled like accordion bellows. Media reports noted campaign materials left over from Biden’s still-fresh upset victory were strewn across the intersection, giving police the first inkling that it was the Biden family car. The family’s Christmas tree was also among the wreckage. After the collision, the station wagon screeched for 150 feet, spinning backward and striking a row of evergreen trees and a highway sign. Biden was in Washington, D.C., interviewing potential staffers. Neilia was to join him in the nation’s capital the next day to finalize the purchase of a home there. He flew home on a rented plane and went straight to the hospital. She was 30. Biden had celebrated his own 30th birthday a month before. With his sons hospitalized, Biden wasn’t expected at the memorial service for Neilia and little Naomi. But he attended, staring down unspeakable grief as he stood beside the colorful stained-glass windows of St. Mary Magdalen Catholic Church on Concord Pike in Talleyville. In front of a crowd of 650, he spoke candidly about his “two girls.” Only 18 days after the accident, Biden was sworn in as a U.S. senator. Instead of taking his oath in the hallowed halls of the U.S. Capitol, Biden placed his left hand on a Bible held by Neilia’s father Robert Hunter, and raised his right in the chapel of Wilmington Hospital, then called Delaware Division. Three-year-old Beau looked on from his hospital bed, which was wheeled in because his left leg was still broken and elevated. Beau remained at the hospital for several more weeks. Two-year-old Hunter wore a checkered jacket, having been discharged previously. He suffered a slight skull fracture in the crash. In his 2008 book “Promises to Keep,” the elder Biden detailed the harrowing time, saying he could understand how deep despair could lead some to “just cash it in” and how “suicide wasn’t just an option, but a rational option.” He wrote, “But I’d look at Beau and Hunter asleep and wonder what new terrors their own dreams held and wonder who would explain to my sons my being gone, too. And I knew I had to fight to stay alive.” Biden decided to remain home in Wilmington and commute daily to Washington on Amtrak, which he continued to do until he joined Obama in D.C. in 2009. That’s when he moved into the official vice president's residence at Number One Observatory Circle, still visiting his home state regularly. He remarried in 1977 to Jill Biden and the couple had one child, Ashley, in 1981. Forty-two years after the deaths of Neilia and Naomi, Delaware would once again grieve alongside Biden when Beau, then 46, succumbed to an aggressive brain tumor. The May 2015 death of the Delaware Army National Guard major and former state attorney general who had announced he was going to run to be Delaware’s 74th governor dealt Biden another tragedy to overcome with the world watching. The image of Biden’s usual megawatt smile was replaced by a stiff downturned mouth at Wilmington's St. Anthony of Padua Church, looking as if he was trying to swallow his grief. Biden’s right hand was on his heart, just below an American flag pin. His left was wrapped around the right hand of his now-fatherless 11-year-old granddaughter Natalie. Less than four months later, Biden’s emotional interview with “The Late Show” host Stephen Colbert left eyes wet nationwide. Bare and poignant, Biden said, “My son was better than me. He was better than me in every way.\" He recounted Beau’s final months with terminal cancer and how his weakened son would speak of concern for his father, saying, “Promise me you're going to be alright.” Biden himself had a pair of cranial aneurysms in 1988, the first of which was nearly fatal. At one point a priest was brought in to deliver last rites. He underwent a pair of surgeries that year to repair the damage. In the years between his family tragedies, Biden rose to become one of the most influential senators on Capitol Hill, chairing a pair of powerful committees, including the Senate Foreign Relations Committee (2001-2003 and 2007-2009) and the Senate Judiciary Committee (1987-1995). He pushed for NATO intervention in the Bosnian War in the mid-1990s, which was marked by ethnic cleansing and genocide. The intervention led to a 1995 peace agreement and the prosecution of war crimes. In 1994, he pushed the passage of both the largest crime bill in U.S. history and the $1.6 billion Violence Against Women Act, which he had drafted. In 1997, he helped negotiate a chemical weapons ban. Those years put Biden on a first-name basis with every American politician of note, along with nearly every world leader, eventually placing the self-described “workhorse, not a show horse” in a prime position to be picked by the far less experienced Obama. On Aug. 23, 2008, Biden was officially announced as Obama’s running mate as local and national media camped outside his Delaware home. It was momentous redemption for the two-time presidential election loser and also a gleaming moment of pride for Delaware, with both state Democrats and Republicans cheering his selection. Biden’s years of watching Washington, D.C., from the inside, combined with his blue-collar appeal and sturdy campaign skills, helped Obama make history with Biden’s \"white hair waving like a flag of experience,\" The News Journal wrote at the time. The workhorse was in full stride during the campaign against Sen. John McCain and Alaska Gov. Sarah Palin in the 74 days between his selection and Election Day. He led about 90 rallies and fundraisers as he crisscrossed the country, stumping everywhere from ice cream stands and burger joints to college gymnasiums and retirement villages, visiting more than 20 states and doing more than 200 media interviews. Most political commentators said Biden decisively won a nationally televised debate with Palin, after he frequently highlighted her lack of foreign policy knowledge. Four years later, he also earned praise for his debate against Republican Vice Presidential nominee Paul Ryan, during which he grinned and grimaced derisively at his much younger opponent. He also famously replied to one of Ryan's criticism of the Obama administration with a now trademark Biden catchphrase: \"Malarkey!\" During his time representing the First State, he never faced a serious threat of being voted out. Not in 1978, 1984, 1990, 1996, 2002 or 2008. He garnered between 58 to 63 percent of the vote in each re-election race, a testament to his support. As Biden campaigned with Obama in 2008, Carol E. Hoffecker, a Delaware historian and author of “Democracy in Delaware,” placed Biden’s position in state history thusly: “No one else except Caesar Rodney, who was there at the founding of the nation, is historically more significant than Joe Biden.” After the pair defeated McCain and Palin on Nov. 5, 2008, Obama’s East Coast whistle-stop tour in a 1930 Pullman car en route to the inauguration in Washington, D.C., pulled into Wilmington Train Station. Two years later, it would be renamed the Joseph R. Biden Jr. Railroad Station. Thousands swarmed the train on that 19-degree day to send off the state’s most favored son, along with the president-elect. \"I would stand in Antarctica to watch this,\" 10-year-old Zoi Council told The News Journal. Three days later, Supreme Court Justice John Paul Stevens swore Biden in as 1.8 million people, the largest inauguration crowd in American history, looked on in freezing temperatures. Biden reveled in his active role in the administration. He oversaw the 2009 economic stimulus and the draw-down of troops in Iraq in 2010 while also negotiating down-to-the wire fiscal agreements. Some historians ranked Biden among the most active American vice presidents. In 2012, The Atlantic magazine published a story headlined: \"Joe Biden: The Most Influential Vice President in History?\" But some of Biden’s policy choices subjected him to criticism. In particular, some hawkish foreign policy leaders criticized what they saw as Biden’s lack of faith in the military. Former Defense Secretary Robert Gates wrote Biden had been wrong about “nearly every major foreign policy and national security issue over the past four decades.” Biden argued against the now-legendary raid that killed Osama Bin Laden in Pakistan. He opposed the military’s call for a surge of new troops in Iraq in 2007, as well as a similar surge in Afghanistan in 2012. In Biden’s final days as vice president, Obama shocked the 36-year public servant in the White House’s State Dining Room with the nation’s highest civilian honor, the Presidential Medal of Freedom. \"For your faith in your fellow Americans, for your love of country and for your lifetime of service that will endure through the generations, I'd like to ask the military aide to join us on stage,\" Obama said, revealing the surprise honor. With swollen eyes, Biden accepted, turning his back to the crowd to regain his composure while wiping away tears: “I don't deserve this, but I know it came from the president's heart.” A month prior, Democrats and Republicans in the U.S. Senate had paid tribute to him on the Senate floor as an emotional Biden looked on from the presiding officer's chair. The tributes were scheduled to last an hour, but went on for more than two. \"There's a reason 'Get Joe on the phone' is shorthand for 'time to get serious' in my office,\" Senate Majority Leader Mitch McConnell of Kentucky said. For all his accomplishments and honors, Biden has also had missteps and setbacks. His 1988 presidential campaign was torpedoed by plagiarism accusations after he failed to credit a speech by British politician Neil Kinnock at an August Democratic debate at the Iowa State Fair. (He had cited Kinnock in previous speeches.) Three years later, Biden presided over the Senate Judiciary Committee during the Clarence Thomas confirmation hearings. Critics, especially in the wake of the #MeToo movement, faulted him for the aggressive questioning of Hill. Biden has since said he owed Hill an apology, adding that he believed her. Before Obama selected him, Biden said the Chicago senator was the first “mainstream African-American (presidential candidate) who is articulate and bright and clean and a nice-looking guy.” Obama brushed off the comment saying he knew what was in Biden’s heart and pointed to Biden's history of fighting racial inequality. But that same famously loose mouth, which political opponents used to paint him as a buffoon, he also used to his advantage. In 2007, at a Democratic debate, he quipped that Republican presidential candidate and former New York Mayor Rudy Giuliani only mentions three things in a sentence: “a noun, a verb and 9/11.\" As in 1988, he lost the 2008 presidential primary, which was won by his future boss, Obama. After 2½ months of campaigning in Iowa to meet a presumably attainable goal of a third or fourth place finish against a field of six, he was trounced. Biden finished fifth with less than 1 percent of the vote behind Obama, former vice-presidential candidate John Edwards, Clinton and New Mexico governor Bill Richardson. It was a devastating blow and it was written on the faces of his family, who stood behind him teary-eyed as he announced the end of his campaign that night. Biden was born in 1942 in industrial Scranton, the first of four children for Jean and Joe Biden, a car dealership manager. Biden was 11 when the family moved 135 miles south to Claymont, another blue-collar town just over the state line. It was there where his working-class upbringing continued, filled with moments like when his mother fashioned cuff links out of nuts and bolts because he didn’t have any for an eighth-grade dance. Jean Biden trained him how to counter any taunts from classmates by diffusing the situation, telling him to ask them, “You don’t have a pair of these?” After living in an apartment in the Brookview neighborhood off Philadelphia Pike, the family moved to a split-level home in Brandywine Hundred. It was there that Biden overcame the stutter that earned him the callous nickname of “Joe Impedimenta,” as he wrote in “Promises to Keep.” “I was going to beat the stutter. And I went at it the only way I knew how: I worked like hell. Practice, practice, practice. I would memorize long passages of Yeats and Emerson, then stand in front of the mirror in my room on Wilson Road and talk, talk, talk,” wrote Biden, whose encouraging father called him “Champ.” After graduating from Archmere Academy in Claymont, Biden became a true Blue Hen, earning a bachelor’s degree at the University of Delaware, double majoring in history and political science. After he met Neilia while on spring break in the Bahamas in 1964, the two began dating. She attended Syracuse University, and that is where Biden would go to get his law degree. He graduated in 1968, two years after they married in upstate New York. The Bidens returned to Delaware, where he worked as a law clerk and public defender before starting his own firm, originally called Biden and Walsh. But law was not for the 6-foot former University of Delaware football halfback. By 1969, he was running as a Democrat for a seat on New Castle County Council, winning in a Republican-leaning district. He served for two years before taking on Boggs and the political machine the incumbent had built over the years as a U.S. representative and two-term Delaware governor. The underdog campaign lacked the funds and experience to win, most thought. Managed by Biden’s sister Valerie, who would later manage more campaigns and grow into a political confidant, the campaign overcame poor early polls and upended Boggs by 3,000 votes. A month later, the station wagon holding Biden's family was struck and his Senate career officially began in that Wilmington hospital chapel crammed with media. Senate Secretary Frank Valeo traveled to Delaware from Washington for the swearing-in ceremony. Pale, but smiling, Biden became the first U.S. senator in decades to take the oath of office away from the Senate chamber. But he made clear that his surviving family was his priority — a priority that led him to forgo a presidential run in 2016 after Beau's death. “I make this one promise,” he said to the media after the swearing in. “If in six months or so, there’s a conflict between me being a good father and a good senator … I promise you I will contact [the governor] … and tell him to get another senator. “[The boys] can’t get another father.” In the end, he pushed on, using the advice his father regularly gave him as a child: “Champ, when you get knocked down, get up.” While an anguished Biden decided against running for president in 2016, he never stayed down. And now with the 2020 election looming, he's heeding those words from his father. It's time to get up and fight one final round. Matthew Albright and Karl Baker of the Delaware News Journal contributed to this story. Compiled and written by Ryan Cormier. This story includes information, reports and writings from The News Journal archives.  OVERCOMING CHALLENGES Biden is known for his gift of gab, but in high school he was nicknamed \"Joe Impedimenta\" for his stutter. He says he overcame it by standing in front of a mirror at night, reciting Yeats and Emerson. Biden has said he considers his stutter \"the greatest gift God ever sent my way\" because it gave him insight. In 1988, Biden was absent from the Senate for seven months after undergoing two surgeries for near-fatal brain aneurysms. FAMILY TRAGEDY In December 1972, just before his first Senate term began, Biden's first wife, Neilia, and their 13-month-old daughter, Naomi, were killed in a car accident that also injured the couple's sons, Beau and Hunter. On May 30, Biden lost 46-year-old Beau, Delaware's former attorney general, to brain cancer. DECADES OF SENATE SERVICE Biden was just shy of his 30th birthday when he was first elected to represent Delaware in the Senate. He went on to serve 36 years, earning the nickname \"Amtrak Joe\" for commuting between Wilmington and Washington every day by train. Biden served stints as chairman of both the Judiciary and Foreign Relations committees. He counts among his legislative accomplishments the Violent Crime Control and Law Enforcement Act of 1994, which put 100,000 more police officers on the street and established the Violence Against Women Act to target domestic violence and rape. However, criminal justice reform advocates now say the legislation contributed to today's high incarceration rates that have disproportionately affected minorities. Biden also presided over the hearings in 1991 that vetted Clarence Thomas' nomination to the Supreme Court. SOMETHING BORROWED? Biden dropped a presidential bid in September 1987 after reports he had plagiarized a speech by British Labour Party Leader Neil Kinnock. That led to reports of other unattributed remarks and revelations that as a law school student, Biden wrote a paper that drew heavily from a law review article he cited only once. In that case, the Delaware Supreme Court Board on Professional Responsibility later concluded Biden hadn't violated any rules. CAPITOL HILL NEGOTIATOR Biden was an unusually active vice president, partly because of his longstanding relationships with Capitol Hill lawmakers. He was the Obama administration's go-to guy for negotiating down-to-the-wire agreements on fiscal issues, including proposals to extend the Bush-era tax cuts, legislation to increase the nation's borrowing limit, and a strategy for avoiding the \"fiscal cliff\" of spending cuts and tax increases in 2013. After the December 2012 shootings in Newtown, Connecticut, Obama put Biden in charge of a gun violence task force. GOING OFF SCRIPT Biden has a history of unscripted remarks that sometimes have gotten him in trouble. In 2007, Biden called Obama the first \"mainstream, African-American (candidate) who is articulate and bright and clean and a nice-looking guy.\" Three years later, at the ceremony to sign the Affordable Care Act into law, microphones picked up Biden whispering to Obama \"This is a big f---ing deal!\" In 2012, Biden said on “Meet the Press” that he was \"absolutely comfortable\" with same-sex marriage, upstaging Obama's plans to announce his own support for gay marriage.  Born: Nov. 20, 1942 in Scranton, Pennsylvania Education: Bachelor's degree from University of Delaware, 1965; law degree from Syracuse University, 1968 Religion: Roman Catholic Family: Wife, Jill; four children (son Beau died in 2015 and daughter Naomi died in 1972), five grandchildren Home: Greenville Career experience: Practicing attorney, 1968-1972; served on New Castle County Council, 1970-1972; elected to the U.S. Senate, 1972; re-elected to the U.S. Senate, 1978, 1984, 1990, 1996 and in 2002 for the term ending Jan. 3., 2009. Elected as vice president of the United States in 2008, serving from 2009 to 2017. U.S. Senate committees: Chairman of the Senate Foreign Relations Committee from 2001-2003 and 2007-2009, and the Senate Judiciary Committee from 1987-1995.   AMERIND Risk",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "She was kidnapped in Uganda. They want $500K.",
      "url": "https://www.usatoday.com/story/news/2019/04/03/american-kidnapped-mueller-report-joe-biden-wednesdays-top-news/3352705002/",
      "subtitle": "She was kidnapped in Uganda. They want $500K.",
      "author": "",
      "content": "Joe Biden reconsiders his personal bubble, and House Democrats try to pry the Mueller report out of William Barr's hands. Let's get into Wednesday's top news. But first, a bedtime story: Do you sleep on the same side of the bed every night? This couple swap sides randomly, and Twitter is obviously freaking out about it. A massive search-and-rescue effort is underway in Uganda after an American tourist and her local guide were ambushed and kidnapped by four armed men demanding a $500,000 ransom, Ugandan police said. The attack took place Tuesday in the Queen Elizabeth National Park, a sprawling wildlife refuge 200 miles from the capital, Kampala. The American was identified by police as Kimberley Sue Endecott, 35, from California, who was taken along with her Ugandan driver when their vehicle was ambushed by the gunmen, Reuters reported. The House Judiciary Committee voted Wednesday to authorize a subpoena for special counsel Robert Mueller’s full report and evidence, potentially setting up a historic legal clash with the Justice Department. The panel voted to authorize subpoenas for evidence from several of President Donald Trump’s former advisers, including strategist Steve Bannon, communication director Hope Hicks and Chief of Staff Reince Priebus. Though the committee didn't issue the subpoenas immediately, it's the first step by Congress to try to force Attorney General William Barr to release Mueller’s entire confidential report about Russian interference in the 2016 election. Former Vice President Joe Biden vows to be \"more mindful and respectful\" of personal space in a video response Wednesday to allegations of inappropriate conduct. In a video, the potential 2020 presidential candidate promises to be more \"mindful and respectful\" of people's personal space. At least four women accused him of unwanted touching and kissing. Biden, who is considering a bid for the White House in 2020, said his touching was all about making a \"human connection.\" TV favorites such as \"Madam Secretary,\" \"Blindspot\" and \"The 100\" could be canceled this season – but your vote could help save them. USA TODAY's 22nd annual Save Our Shows survey asks you to pick which of 26 series deserve another season – and which should be canceled for good. Speak now, or potentially lose \"The Passage\" forever. They've captured our imaginations for decades, but nobody had actually photographed a black hole – until now. Next Wednesday, scientists will unveil humanity's first photo of a black hole, the European Space Agency said. The photo will be of \"Sagittarius A,\" a supermassive black hole at the center of the Milky Way. Aren't black holes, well, black, and thus invisible? Yes – therefore the image we're likely to see will be of the \"event horizon,\" the edge of the black hole where light can't escape. This is a compilation of stories from across the USA TODAY Network. Want this snappy news roundup right in your inbox every night? Sign up for \"The Short List\" newsletter here.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "2020 Democrats shy from 'socialist' label. Not Bernie Sanders",
      "url": "https://www.usatoday.com/story/news/politics/2019/06/12/bernie-sanders-debate-over-democratic-socialism-key-2020-campaign/1431323001/",
      "subtitle": "2020 Democrats shy from 'socialist' label. Not Bernie Sanders",
      "author": "",
      "content": "WASHINGTON – As some Democratic presidential candidates are pushing back on blistering criticism from President Donald Trump that their party has become \"socialist,\" Sen. Bernie Sanders on Wednesday doubled down on his embrace of the label. Touting his \"democratic socialism\" approach to politics as the best way to address income inequality, the U.S. senator from Vermont sought to rebrand the controversial term during a high-profile address – even as some within his party worry that a leftward lurch could hurt Democrats in states like Ohio, Pennsylvania and Wisconsin next year. \"Over 80 years ago, Franklin Delano Roosevelt helped create a government that made transformative progress in protecting the needs of working families,\" Sanders said. \"Today, in the second decade of the 21st century, we must take up the unfinished business of the New Deal and carry it to completion.\" Trump has labeled the entire Democratic field socialist and has repeatedly warned that a Democratic president would embrace policies that led to economic ruin in Venezuela. In a crowded field of nearly two dozen candidates – and a strong desire to beat Trump in November – the criticism has resonated with some. \"I fundamentally disagree that we should do away with the democratic, regulated capitalism that has guided this country for over 200 years,\" said former Colorado Gov. John Hickenlooper, a Democat who is also seeking the presidential nomination. \"This position is shared by many of my Democratic colleagues, but for some reason, our party has been hesitant to express their opposition to democratic socialism.\" More:Bernie Sanders to defend democratic socialism in face of attacks Jim Kessler, executive vice president at the center-left think tank Third Way, said the socialist tag, if it sticks, could be damaging to Democrats. In November, both Trump and the Democratic nominee will be fighting for swing voters not tied rigidly to ideology. “We have never elected a national Democrat to the White House who is far to the left,” Kessler said. “Walter Mondale won one state. George McGovern won two. We are whistling past the graveyard if we think that's changed.” More:Trump looks to pin 'socialism' label on Democrats before 2020. Will it stick? For a nation that became the global counterweight to the Soviet Union after World War II, the term \"socialism\" has long been used as a stand-in for \"communism,\" and it has been viewed as anathema to American politics. Sen. John McCain and his running mate, Alaska Gov. Sarah Palin, used the word during the 2008 presidential campaign to attack Barack Obama's income tax proposals. During the 2016 Democratic primary, Hillary Clinton sought to use the S-word against Sanders, indicating she had heard from party officials who were \"concerned\" about the his policies. Clinton, who ran as a centrist, won the nomination, but it was Sanders who fired up much of the Democratic base. Sanders acknowledged opponents would continue to use the term socialism as a “slur.” “I have faced and overcome these attacks for decades,” Sanders said. Fifty-one percent of U.S. adults say socialism would be a bad thing for the country, and 43% say it would be a good thing, according to a Gallup poll published last month. That marks a sharp contrast with a Roper/Fortune survey in 1942 that found 40% describing socialism as a bad thing, 25% a good thing and 34% not having an opinion. Sanders stands alone among the field of nearly two dozen major Democratic presidential candidates to identify as a “democratic socialist.” Sanders defined the philosophy as not shaped by Marxism but rather embracing the ideals of President Roosevelt's New Deal. In practice, that has meant endorsing \"Medicare for all,\" which would allow the government-run Medicare program for seniors to provide health insurance for every American. Sanders has supported free or debt-free college tuition, paid for by taxpayers, and the ambitious Green New Deal to curb climate change. \"Economic rights are human rights,\" Sanders said. \"And that is what I mean by democratic socialism.\" Like what you’re reading? Download the USA TODAY app for more",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    }
  ]
}