{
  "articles": [
    {
      "title": "Education Secretary Betsy DeVos proposes controversial changes to campus sexual misconduct rules, narrowing definition of sexual harassment",
      "url": "https://www.usatoday.com/story/news/nation/2018/11/16/betsy-devos-proposes-changes-campus-sexual-misconduct-rules/2023775002/",
      "subtitle": "Education Secretary Betsy DeVos proposes controversial changes to campus sexual misconduct rules, narrowing definition of sexual harassment",
      "author": "null",
      "content": "Education Secretary Betsy DeVos released a controversial proposal Friday to overhaul how schools across the country address sexual misconduct complaints, narrowing the definition of what sexual harassment is on campus and reinforcing \"due process\" rights for students accused. The rule creates three categories for harassment, including \"Unwelcome conduct on the basis of sex that is so severe, pervasive and objectively offensive that it effectively denies a person equal access to the school’s education program or activity;\" \"quid pro quo harassment,\" like a school employee \"conditioning an educational benefit\" on a person's sexual conduct; and sexual assault. Under Obama-era guidelines, sexual harassment was defined more loosely as \"unwelcome conduct of a sexual nature.\" The proposal legally requires schools to respond to complaints when they are filed with Title IX coordinators at schools or an official authorized to take action. Schools are only legally required to respond if the alleged incident occurred on campus or on areas overseen by the school, leaving out, for example, study abroad programs. One of the most striking changes would allow for the accused to cross-examine accusers during sexual misconduct hearings, although it would be carried out through a representative to avoid confrontation between students.   The proposed guidelines also dictate \"the importance of supportive measures\" for the accused and the accuser. This can include academic course adjustments, counseling, no-contact orders, dorm room reassignment, leaves of absence and class schedule changes for the accused or the accuser, according to the Department of Education. Accused students would be presumed innocent during the disciplinary process and given the right to review all evidence a school collects. DeVos said the overhaul would make Title IX grievance complaints more transparent and reliable for all parties. \"Every survivor of sexual violence must be taken seriously, and every student accused of sexual misconduct must know that guilt is not predetermined,\" DeVos said in a statement Friday. The Department of Education's plans have already drawn criticism from lawmakers and organizations that advocate on behalf of sexual assault survivors. Rep. Joe Kennedy, (D-Mass.) slammed the cross-examination provision of the guidelines in a tweet Thursday. \"No survivor should be cross-examined by his or her accused rapist,\" Kennedy said. The National Women's Law Center also called the rules \"potentially devastating,\" because the organization says it would \"undermine many of Title IX's essential protections.\"  Fatima Goss Graves, CEO of the NWLC, said in a statement that the draft rules create a more dangerous environment \"for all students and more schools will shield harassers and rapists.\" The proposed guidelines did draw support from some lawmakers. Sen. Lamar Alexander (R-Tenn.) applauded it for bringing \"much needed clarity\" to the federal rules governing sexual misconduct on campuses. \"The Department’s approach seems to balance fairness and support for survivors,\" Alexander said in a statement. The proposed rules will be subject to public comment for 60 days prior to being finalized.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Betsy DeVos' sexual assault rules draw ire from survivors, echo recent court rulings",
      "url": "https://www.usatoday.com/story/news/politics/2018/11/16/department-education-sexual-assault-survivors-betsy-devos/2026026002/",
      "subtitle": "Betsy DeVos' sexual assault rules draw ire from survivors, echo recent court rulings",
      "author": "null",
      "content": "Morgan McCaul knows what impact Betsy DeVos' proposed overhaul of campus sexual assault investigations would have on victims. In mid-January, McCaul went to a podium in a mid-Michigan courtroom and faced Larry Nassar, the former Michigan State University and USA Gymnastics doctor who sexually assaulted her and hundreds of other female athletes over decades. It was incredibly stressful and traumatic, she says. But Nassar, or his lawyers, couldn't question McCaul. \"I truly can’t imagine the overwhelming fear that facing him with the possibility of interrogation would bring,\" she told the Detroit Free Press Friday morning. \"Every shred of emotion and anxiety that I felt seeing my abuser at his sentencing was under ideal circumstances. I got tremendously lucky.\" So when she looks at the proposed rules put forth Friday by the Department of Education, she says she knows what's behind the changes. The new guidelines, which now enter a 60-day comment period, would narrow the definition of what sexual harassment is on campus and reinforce \"due process\" rights for students accused. \"I believe the new Title IX procedures defined by the Department of Education accomplish exactly what they set out to do: impose further strain on survivors of sexual assault and alleviate institutions of their responsibility to protect students and their safety,\" McCaul said.   The new rules aren't likely to be adopted until 2019 at the earliest, so they wouldn't take full effect until 2020. Under guidelines from President Barack Obama's administration, sexual harassment was defined more loosely as \"unwelcome conduct of a sexual nature.\" DeVos' proposal creates three categories for harassment, including \"unwelcome conduct on the basis of sex that is so severe, pervasive and objectively offensive that it effectively denies a person equal access to the school’s education program\"; harassment in exchange for something, like a school employee's tying an educational benefit to a person's sexual conduct; and sexual assault. The proposal limits who must respond to sexual assault complaints: Title IX coordinators at schools or an official authorized to take action. Schools would only be required to respond if the alleged incident occurred on campus or on areas overseen by the school, leaving out, for example, study abroad programs. Key to the proposed changes are requirements that universities hold live hearings on accusations and allow representatives for the accused and accuser to cross-examine the other party. That section of the ruling perfectly matches a ruling this fall in the U.S. Sixth Circuit Court of Appeals. In that case, which involved the University of Michigan, the court ruled emphatically that the only way to be fair would be to have both sides face off. McCaul's comments and feelings were echoed by groups and victims' rights advocates from across the country. “This rule abdicates the responsibility to protect every student’s right to safety on campus. It tells academic institutions that they needn’t bother helping to protect students; they won’t be liable,\" said American Federation of Teachers President Randi Weingarten in a statement. \"These changes once again demonstrate that students are not DeVos’ priority.\" The proposed rules, said Shilpa Phadke, vice president of the Women’s Initiative at the Center for American Progress, favor students accused of sexual misconduct. They will, she said, \" dissuade students from reporting sexual misconduct.\" More:Why sexual assault survivors are fuming over rumored college guidelines by Betsy DeVos U.S. Senator Lamar Alexander, R-Tennessee, who chairs the Senate’s education committee, stood by the rules. \"The Department’s approach seems to balance fairness and support for survivors,\" he said in a statement. Many of the nation's colleges and universities currently use a model where a single investigator conducts separate interviews of the person making the accusation and then the person accused. The two sides don't have a chance to ask questions unless they appeal a decision. In a court case this fall, a University of Michigan student was thrown out of school after being found to have violated the school's sexual misconduct code. He sued, alleging the university did not give him his due process rights. The appeals court agreed and was emphatic in writing about what it wanted to see. \"Due process requires cross-examination in circumstances like these because it is 'the greatest legal engine ever invented' for uncovering the truth,\" the court wrote. \"Without the back-and-forth of adversarial questioning, the accused cannot probe the witness’ story to test her memory, intelligence, or potential ulterior motives.\" DeVos said her rule changes would make sure the process is fair. “Throughout this process, my focus was, is, and always will be on ensuring that every student can learn in a safe and nurturing environment,” she said in a statement. “Every survivor of sexual violence must be taken seriously, and every student accused of sexual misconduct must know that guilt is not predetermined. “We can, and must, condemn sexual violence and punish those who perpetrate it, while ensuring a fair grievance process. Those are not mutually exclusive ideas. They are the very essence of how Americans understand justice to function.” More:The conversation that is not happening about campus sexual assault The proposed rules would bar the accuser and the accused from directly questioning each other. The back and forth would have to be done through representatives. But that raises a whole set of issues, said Karen Truzwoski, a Michigan attorney who is currently representing women in two federal lawsuits against Michigan State University. \"I support due process for all parties as it's done fairly,\" she said. \"A hearing can be OK if it's done just for fact-finding and not trying to discredit the other side. I just have a problem when you start getting defense attorneys involved. And what if one side can't afford an attorney? \"It just opens a can of worms, and I don't think anyone has thought through just how big a can it is.\" Marina Pitofsky of USA TODAY contributed to this report. Follow David Jesse on Twitter: @reporterdavidj USA TODAY’s education coverage is supported by a grant from the nonprofit Bill & Melinda Gates Foundation, which has no involvement in editorial decision-making.  ",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Betsy DeVos' staff denies rumor she's leaving education secretary job",
      "url": "https://www.usatoday.com/story/news/politics/2018/11/12/betsy-devos-education-secretary-job/1979775002/",
      "subtitle": "Betsy DeVos' staff denies rumor she's leaving education secretary job",
      "author": "null",
      "content": "WASHINGTON — Education Secretary Betsy DeVos says she's not going anywhere with Democrats taking control of the U.S. House in January, despite rumors to the contrary. But if she stays, her life is almost certainly going to get a whole lot tougher. On Monday, in response to a question about rumors circulating that DeVos, a Michigan billionaire, Republican backer and former school-choice advocate in the state, might be looking at stepping down, her press secretary, Liz Hill, knocked down the suggestions. \"The rumors are just that …rumors,\" Hill wrote in an email to the Free Press. \"The Secretary has no plans of stepping down.\" There is almost universal agreement, however, that DeVos — who has made only rare appearances on Capitol Hill to testify with Republicans in charge of both chambers of Congress — is going to be asked a lot more questions in the future. It also means that departmental policies on issues such as civil rights, school choice, sexual assault investigations, transgender students' access to bathrooms and student loan repayment are all going to come under close scrutiny. And if a Democratic-led U.S. House doesn't have the power to force the Senate to enact changes, it can — and likely will — try to force that chamber's hand on votes and repeatedly call DeVos before key committees to question her. Educators' unions are already looking forward to the change: A day after the midterm elections last week, the National Education Association put out a statement saying the shift \"will serve as an important check on President Trump and Education Secretary Betsy DeVos.\" And the American Federation for Teachers said Monday it is \"hopeful that in a Democratic House, (expected new chairman U.S. Rep.) Bobby Scott’s committee can now exercise oversight over Betsy DeVos’ agenda.\" The publication Education Week noted that a Democratic takeover of the House Committee on Education and Workforce  means \"increased oversight of U.S. Secretary of Education Betsy DeVos.\" DeVos — a philanthropist and state party official who had no education background when Trump nominated her — has been controversial in the office since Day One. She was confirmed in February 2017 on a tie-breaking vote in the Senate by Vice President Mike Pence. Besides pushing school choice proposals, she has criticized efforts to provide additional funding to under-performing schools; proposed rules that would decrease the number of investigations into allegations of sexual harassment and assault, and said she wouldn't stand in the way of school districts using federal funds to purchase firearms for protection. She was also roundly criticized for flubbing a question on CBS's \"60 Minutes\" when she said she had no idea whether Michigan's schools were better or worse off because of her school choice efforts. During her confirmation hearing, she was also drubbed for seeming to not know details about some programs and for suggesting —jokingly — that some districts might need access for firearms to protect them from grizzly bears. Read more: Betsy DeVos flubs question on Michigan schools on '60 Minutes' Betsy DeVos says confirmation fight was 'a bit of a bear' She has been a focal point of anger against the Trump administration since taking office, as well, and for her security detail, which is expected to cost some $8 million in the next year. DeVos, however, has earned praise  — including from those who believe that changes in sexual assault investigation policies will provide more of a balance to the rights of the accused. Writing for the Thomas B. Fordham Institute, an education research organization in Washington, President Michael Petrilli said DeVos overcame a bumpy start and \"grew into the role as secretary.\" The question is whether she decides to stay and face a Democratic House certain to hold her to a different standard. \"The question facing Secretary DeVos is whether to participate in these show trials,\" he wrote last week. \"She has another option ... She can choose to step down and gracefully exit a thankless, no-win scene.\" Petrilli went on to say she should do so, arguing it will \"take some wind\" out of Democrats' attacks and deny teachers unions a talking point headed into the next Congress and the 2020 election. Contact Todd Spangler at 703-854-8947 or at tspangler@freepress.com. Follow him on Twitter at @tsspangler. ",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "After losing court battle, DeVos to cancel $150 million in student loan debt",
      "url": "https://www.usatoday.com/story/news/education/2018/12/13/education-secretary-betsy-devos-cancels-student-loan-debt-150-m/2307266002/",
      "subtitle": "After losing court battle, DeVos to cancel $150 million in student loan debt",
      "author": "null",
      "content": "The Education Department said Thursday it will cancel $150 million in federal student loan debt, despite Secretary Betsy DeVos' efforts to overhaul the Obama-era policy. DeVos proposed restricting \"borrower defense\" claims filed by former students whose schools closed or made false promises, but has to carry out regulations after court rulings sided with students. Three months ago, a federal judge ruled that DeVos' attempts to kill the 2016 regulations were illegal, Politico reported. The judge also rejected for-profit colleges' bid to stop the policy in October. The department said Thursday it will forgive loans for about 15,000 borrowers whose schools closed, preventing them from finishing their programs. About half of those borrowers attended Corinthian Colleges, a for-profit educational chain that closed its campuses in 2015. They will account for $80 million of the automatically discharged loans, while borrowers whose schools closed between Nov. 1, 2013, and Dec. 4, 2018, will account for the other $70 million. Related:Student loans: Borrowers could face tighter federal standard for debt forgiveness Related:As financial burden rises, college students question value of education Affected borrowers will begin receiving email notifications from the department on Friday, the department's press release said. Discharges may take longer than 90 days to complete, however, and loan holders will tell borrowers what specific loans were forgiven. Previously, DeVos argued that the debt forgiveness was too lenient, lacking sufficient borrower proof requirements. The department said proposed changes would reduce frivolous claims and allow colleges to respond to borrower allegations.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Betsy DeVos undergoes surgery after breaking bone in bike accident",
      "url": "https://www.usatoday.com/story/news/politics/2019/01/04/education-secretary-betsy-devos-undergoes-surgery-after-bike-accident/2487718002/",
      "subtitle": "Betsy DeVos undergoes surgery after breaking bone in bike accident",
      "author": "null",
      "content": "Education Secretary Betsy DeVos was recovering Friday after undergoing surgery to repair a broken bone suffered in a cycling accident. A department spokeswoman says DeVos is resting at home after the Thursday surgery. She is expected to recover fully. The spokeswoman did not immediately answer questions about the accident or the nature of DeVos’ injury. A schedule released by the department says only that DeVos has no public events this week. She splits time between Washington and her home state of Michigan. The spokeswoman said DeVos will be staying in daily contact with the department while she recovers.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "DeVos' Title IX proposal for investigating sexual assault is already policy at some colleges. Hearings are traumatic for both sides.",
      "url": "https://www.usatoday.com/story/news/education/2019/02/15/department-of-education-sexual-assault-college-title-ix-betsy-devos/2849214002/",
      "subtitle": "DeVos' Title IX proposal for investigating sexual assault is already policy at some colleges. Hearings are traumatic for both sides.",
      "author": "null",
      "content": "The email offered the Western Michigan University student what she saw as a no-win choice. She could go to a hearing and let the male students she had accused of sexually assaulting her ask her questions, trying to discredit her. Or she could decline to attend and watch them walk away without any punishment. \"It literally killed my heart,\" she told the Detroit Free Press. \"The need to test me – it was very discouraging to me.\" Her choice could become common in the nation's colleges and universities as higher education institutions transform the way they investigate claims of sexual assault, thanks to pending changes in federal rules. The rules are simply a proposal now from the Department of Education, led by Secretary Betsy DeVos. More than 100,000 comments on the proposal have been left with the department. Due to technical difficulties during the public comment period, the department decided to open the comment period for one more day. Comments will be accepted here Friday. Experts say it could take months for the final rules to come out, and there's no guarantee the mandate for live hearings with cross-examinations would end up in the final version. However, DeVos is known to favor the hearings. Even if the rules don't change, schools in states covered by the 6th U.S. Circuit Court of Appeals are mandating the cross-examinations, forced to do so by a series of court rulings, including a landmark one involving the University of Michigan. Out is the old way of investigating – the so-called single-investigator model, where a single university employee or outside expert interviews the accuser, the accused and any witnesses separately and then writes up a report. In is a new model where either side can get a live hearing, with direct cross-examination by the parties involved. More:DeVos draws fire for proposed overhaul of sexual assault rules governing campuses \"Due process requires cross-examination in circumstances like these because it is 'the greatest legal engine ever invented' for uncovering the truth,\" the 6th Circuit wrote in a September 2018 ruling. \"Without the back-and-forth of adversarial questioning, the accused cannot probe the witness’ story to test her memory, intelligence, or potential ulterior motives.\" The Western Michigan University student said the assault happened in September 2017. Among the questions she was asked at her hearing: What did she talk about with her friends as they met up with the male students who allegedly assaulted her? Had she actually consented to the sex and was just making up her story? What was the conversation in the bedroom before, during and after the assault? Then she was asked to demonstrate the position she was in when she was assaulted. The student said she was terrified and unsure about what would happen. But she wanted to see the male students held accountable, so she persevered. The hearings aren't just stressful for those making the accusation – they are also taxing for those accused of a sexual assault, said Justin Dillon, a former federal prosecutor whose Washington D.C. firm KaiserDillon represents accused students and has handled dozens of hearings. He warns his clients the hearings are going to be emotional. \"The complainant is probably going to cry,\" he said he tells his clients, \"but don't let that throw you.\" Some of his male clients also cry. \"They are just so overwhelmed,\" he said. \"They have to be ready for it to be very emotional. Crying is fine.\" What's not fine is reacting with anger. \"You can't look pissed off,\" he said. More:Students afraid to study abroad under Title IX proposal When it came time for her Nov. 8 hearing, the Western Michigan student – whom this article is not naming because USA TODAY does not identify sexual assault survivors without permission  – went to the campus' Title IX offices, located toward the edge of campus. \"We had no idea how the school would orchestrate the cross-examination of my client by the boys who assaulted her,\" said the woman's attorney, Megan Bonanni. \"I felt confident about her emotional state, but I could not prepare her for the process. ... I coached her to maintain her confidence, reminded her that the truth will shine through. She was nervous but confident. The only real anxiety was being confronted by the accused.\" The offices included a small conference room and an open reception area. Getting into the right rooms took time and coordination as university officials tried to handle logistics so the female student wouldn't run into the male students she was accusing in the hallway or reception area. A consultant was brought in to run the Nov. 12 hearing. Each side was in different rooms. As each side was cross-examined, they were brought into the room with the hearing officer, while the other side watched via video. Witnesses came into the room with the hearing officer and were questioned by the officer and both sides. The female student was able to be in the room with two female witnesses, while the accused watched and asked questions via video. The two parties switched when the witnesses for the accused were questioned. Each side could have a lawyer or adviser with them, but the lawyers couldn't talk during the proceedings to ask questions. Most of the questions had to be submitted in advance; however, follow-up questions were allowed, with the knowledge that the hearing officer could veto any question asked by either side. While the attorneys weren't allowed to ask questions, they could consult with their clients. The woman's attorney, Bonanni, scribbled questions on notepaper and also whispered into her ear as the female student asked questions. The attorney was not allowed to consult with her client when she was answering questions from the students she had accused. Throughout the three-hour hearing, documents were referenced and a university attorney would deliver them to each side. That slowed down the pace of the hearing but kept each side separate. \"It was very traumatizing,\" the female student told the Detroit Free Press a month or so after the hearing. \"The questions that they asked me were respectful but painful. I had to attend, or the boys would be found not responsible.\"  The female student says she was having consensual sex with one male student when another male joined in. She said she did not consent to having sex with him. The student said the school itself did the best job it could to make her comfortable. \"It's just hard to have to answer questions from the people who assaulted you,\" she said. Two weeks after the hearing, the female student got another email from the school. This one had encouraging news for her – it had found in her favor, saying the preponderance of evidence showed she had been sexually assaulted. There's a very simple reason for having hearings, say those who are accused of sexual assault and those who work with them. \"As anyone who’s done even a single trial would tell you, there is no better way to test someone’s truthfulness – regardless of which side they’re on – than through cross-examination,\" said Dillon, whose law firm has done scores of hearings in many states. \"It’s all fine and good to come in with a story, but how you respond when pressed is what really matters.\" The challenge is how much to press, and who's allowed to do the pressing.    In most hearings, both sides are limited to asking previously submitted questions, with some allowance for follow-up questions.    Dillon has been in a lot of different hearings. They all seem to have about the same setup: a main room with the panel or hearing officer and some sort of private room nearby for each side. Inside the main room, the setup can vary, including sometimes having some sort of room divider placed between the two sides so they can hear each other, but not see each other. The hearings often start with opening statements – the accuser often goes first, then the accused. Each side then questions. Then come witnesses. Finally, there's some sort of final statement from each side. Lawyers for each side will drill and prewrite statements and questions for their clients. But come time for follow-ups, and it's time to do some quick talking. “I’m scrambling to write questions so my guy can hand them in and we can get them asked,\" he said. Questions are generally thought through beforehand – both those that Dillon's clients are going to ask and those that they are going to answer. But don't get a picture of students yelling at each other or up in each other's faces. \"There's no meaningful confrontation,\" Dillon said, adding that hearing officers often soften the questions or shrink the line of questioning. \"There are no hard questions. If anything, the panels are super nice to the accuser. Everyone is asked very open-ended questions.\" For most of the nation's universities, a mandate to implement live hearings with cross-examination could still be months away. Last fall, DeVos proposed rule changes to Title IX to mandate hearings and cross-examination in sexual assault cases. Those rules were then open for comment until Jan. 30. Approximately 100,000 comments were made on the proposed rules, and the education department will have to go through all of them before deciding whether to continue the process of mandating changes.   Dillon isn't surprised most of the comments sent to the education department are negative. \"Accused students simply don’t have the same option to participate publicly in this conversation,\" his firm wrote in its comments on the rules. \"If an accused student is found responsible, people reason, they must have done it. If they’re found not responsible, then many people believe that they did it and the school mishandled the case. \"If you publicly identify yourself as a 'falsely accused rapist,' most people either won’t hear or will ignore the first two words.\" Dillon's firm is supportive of the addition of hearings. \"No change will do more to ensure that these hearings are fair. In our experience, schools often fail to challenge an accuser’s testimony in any meaningful way. They simply don’t ask hard questions. We have seen far too many cases where, for example, a series of text messages provides strong evidence of the accused student’s innocence – but the investigator or the panel never asks a single question about them.\" Schools in Michigan, Ohio, Kentucky and Tennessee  – the states covered by the 6th Circuit Court of Appeals – have to make the changes now, thanks to the court ruling. That court ruling came out of a case involving the University of Michigan, where a male student sued in federal court. The case centered on a sexual encounter at a fraternity party. The male student was eventually thrown out of school. The student then sued the university, alleging his due process rights weren't granted. A lower court ruled against him, but he appealed. His argument was that the university already gave students accused of every other type of misconduct the right to a hearing and cross-examination.   \"U-M respectfully submits that the 6th Circuit got it wrong,\" University of Michigan President Mark Schlissel wrote in a post on UM's website on Jan. 29. \"Even as we comply with the current law, we continue to believe that having experienced, fair hearing officers posing questions to all parties and witnesses based on input from both sides is the best way to determine the truth and minimize harm to all students involved.\"   Follow David Jesse Twitter: @reporterdavidj If you or a loved one has experienced sexual assault, you can reach the National Sexual Assault Hotline at +1-800-656-4673 or chat online at online.rainn.org.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "America's students deserve freedom to choose their education options: DeVos, Cruz, Byrne",
      "url": "https://www.usatoday.com/story/opinion/2019/02/28/trump-school-choice-students-education-options-scholarships-tax-credits-column/3002868002/",
      "subtitle": "America's students deserve freedom to choose their education options: DeVos, Cruz, Byrne",
      "author": "null",
      "content": "What should determine the quality of a child’s educational experiences? Her family income? His home address? The luck of the draw? Or should every child in America — regardless of those things a student cannot control — have opportunities to learn in places and grow in ways that work best for him or her? We believe that every student deserves a great education, because we believe that every student has the innate potential to change the world, if given opportunities. Today, too many young Americans are denied those opportunities. The numbers tell a grave story. We’re 24th in reading, 25th in science and 40th in math when compared with the rest of the world. That’s not because our students aren’t capable of being No. 1. They are. But our government’s antiquated approach to education limits their ability to achieve their true potential. A series of administrations on both sides of the aisle have tried to fill in the blank with more money and more control, each time expecting a different result. Just keep trying to fix the same problem the same way over and over again, and then try to tell us you’re not insane. Read more commentary: Teachers strike for higher pay because administration and benefits take too much money Superintendent helps poor, sick student, gets forced out. Can my school district hire her? The internet is sowing mass confusion. We must rethink how we teach kids every subject. What’s really missing in education is what makes America great: freedom. We propose that students should be free to learn in ways that work for them, no matter where they pursue their education or how they learn. That’s why on Thursday we are putting forward a historic investment in America’s students: the Education Freedom Scholarships and Opportunity Act. Education Freedom Scholarships would annually give hundreds of thousands of students across the country opportunities to find the right fit for their education. The program would offer a dollar-for-dollar federal income tax credit for contributions to nonprofit organizations that provide scholarships for individual elementary and secondary school students. These scholarships would most benefit America’s forgotten students who would finally have opportunities to pursue the best education for them in ways that rich, powerful and connected families always have. We recognize that each student is unique and deserves an education personalized for them. Scholarships could help students access a whole menu of opportunities, including dual enrollment, special education services, advanced or elective courses not available in their assigned school buildings, transportation to out-of-zone opportunities, among many others. All Americans need to be equipped for successful careers, and vital workforce preparation is in high demand. That’s why students could use scholarships to access career and technical education and apprenticeships, as well. The key element of the proposal is freedom for all involved. Eligible students, families, teachers and schools, as determined by their states — all can participate at will and any can elect not to participate if that’s the better choice for them. This is what freedom is all about. In the State of the Union address, the president called on Congress to “pass school choice for America’s children.” The Education Freedom Scholarships proposal is a powerful way to achieve this goal. The highly paid school union bosses will falsely argue that is an attack on public education. That couldn’t be further from the truth. This program won’t take a single cent from local public school teachers or public school students. In fact, some states may choose to use the scholarships to enhance and improve already existing public school options. Our proposal only requires one thing: Students and parents must be empowered to make decisions. America’s families — not entrenched special interest groups — should decide how education dollars are spent for their own children. For our part, we refuse to tell any student trapped in a failing school or one that just isn’t working for them and say, “No, you don’t deserve the chance to go to a different school. We need to preserve the system.” Because education isn’t about school systems. It is about school children. Our country needs students to be freed to pursue the education that will unlock their potential and unleash their creativity so they — and generations after — can achieve unlimited success. And no child should have to wait for another generation of adults to get this right. Betsy DeVos is the secretary of Education. Ted Cruz is a Republican senator from Texas. Republican Bradley Byrne represents Alabama in the House of Representatives. Follow them on Twitter: @BetsyDeVosED, @tedcruz and @RepByrne ",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "'I have overridden my people': Trump says he will keep Special Olympics funded, undercutting DeVos",
      "url": "https://www.usatoday.com/story/news/politics/2019/03/28/president-trump-restoring-funding-special-olympics/3302983002/",
      "subtitle": "'I have overridden my people': Trump says he will keep Special Olympics funded, undercutting DeVos",
      "author": "null",
      "content": "WASHINGTON – President Donald Trump said he would jettison a proposal to slash funding for the Special Olympics, undercutting Education Secretary Betsy DeVos and the budget proposal he signed. \"The Special Olympics will be funded. I just told my people I want to fund the Special Olympics,\" Trump said he left the White House en route to a political rally in Grand Rapids, Mich. \"I have overridden my people. We're funding the Special Olympics.\" Trump's remarks came after widespread criticism targeted DeVos' budget proposal to eliminate funding for the program, which is designed to help children and adults with disabilities. DeVos’ proposed $17.6 million cut for the Special Olympics was included in the $4.75 trillion federal budget that President Donald Trump’s administration sent to Congress earlier this month. Trump, in his comments on Thursday, offered no additional information about whether his administration will commit to funding the entire $17.6 million Special Olympics had been getting and whether it will be protected from future proposed reductions. After Trump made the announcement, DeVos thanked the president and said they see \"eye to eye\" on this, adding she pushed him to change his stance on funding the program. More:Five things to know about the federal budget process More:Betsy DeVos wants to cut Special Olympics $$ and people are outraged: What we know now Karen Pence, wife of Vice President Mike Pence, also voiced her support after Trump's remarks, saying on Twitter:  \"Love the @SpecialOlympics!\" Karen Pence led the U.S. delegation to this year's Special Olympics World Games in the United Arab Emirates. It is not just Special Olympics facing the budget ax. Trump seeks dramatic across-the-board spending cuts to domestic programs for the coming fiscal year. An exception: the military, which would get a 5 percent increase under his proposal. “Get rid of the fat, get rid of the waste,” Trump had instructed his Cabinet. DeVos, however, proposed additional funding for a few programs, including charter schools and a tax credit for individuals and companies that donate to scholarships for private schools. DeVos said she had to make some hard decisions after the president demanded across-the-board cuts and has had to defend her cuts to members of Congress, where she's faced days of being grilled. Earlier Thursday, DeVos—a wealthy Republican donor and former school choice advocate—was on Capitol Hill again defending the proposed cut to the Special Olympics to a Senate Appropriations subcommittee. During that hearing, she sharply criticized comments on the proposed cut by U.S. Sen. Richard Durbin, D-Ill., as a \"shameful\" and \"disgusting\" political ploy. \"I've given a portion of my salary to Special Olympics,\" said DeVos, raising her voice as Durbin tried to interrupt her with more questions about the cut. \"Let's not use disabled children in a twisted way for your political narrative. That's just disgusting and is shameful.\" Durbin responded that proposing to eliminate $18 million out of a $64-billion Education Department budget for something as beloved as Special Olympics \"is shameful, too.\" He added that whoever approved the proposed cut should get \"a special Olympic gold medal for insensitivity.\" More:'Get rid of the fat': Why Betsy DeVos' plan to slash Special Olympics funding probably won't happen More:Betsy DeVos: Special Olympics questions from Congress are 'disgusting' The education secretary has explained her rationale by saying the Special Olympics is a private organization – not a federal program – that is better supported by philanthropy. The cuts have not gone into effect yet and did not have a strong chance of passing in Congress. The budget is just a proposal, a way for the Trump administration to spell out its spending priorities for the coming year. Trump’s budget was basically dead the moment it arrived at Congress. And, given the political support that the Special Olympics has in Congress, there's virtually no chance that lawmakers will let the proposed cuts to the program stand. Contributing: Todd Spangler, Detroit Free Press",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Special Olympics chairman responds to DeVos, says DOE-funded work 'critical' to education",
      "url": "https://www.usatoday.com/story/news/politics/2019/03/28/special-olympics-chairman-shriver-department-of-education-funded-work-critical/3296668002/",
      "subtitle": "Special Olympics chairman responds to DeVos, says DOE-funded work 'critical' to education",
      "author": "null",
      "content": "The chairman of Special Olympics International responded to proposed federal budget cuts on Wednesday, saying the work the money supports is \"critical\" to education. Timothy Shriver added that the lessons taught in schools through Education Department-funded programs \"are critically the responsibility not just of the volunteer sector but of our elected leaders.\" His response came two days after President Donald Trump's Education Secretary Betsy DeVos caused a stir when she defended a $17.6-million federal funding cut to the Special Olympics. DeVos argued the organization would be better supported through philanthropy, adding: \"We had to make some difficult decisions with this budget.\" Shriver said the Department of Education, along with state agencies and local authorities, contracts with the Special Olympics to provide educational services in schools that support children with special needs. The program supporting Special Olympics athletes, rather, is \"built on the backs of volunteers and philanthropists. This is not the work being funded by the United States Department of Education.\" Charter schools:Betsy DeVos calls for more charter schools even as they spark investigations across the country Betsy DeVos:Deep cuts to Special Olympics, student programs warrante DeVos' defense drew backlash from activists and athletes, who emphasized the importance of the Special Olympics. But DeVos accused \"the media and some members\" of twisting facts. \"The Special Olympics is not a federal program. It’s a private organization. I love its work, and I have personally supported its mission,\" she said. \"But given our current budget realities, the federal government cannot fund every worthy program, particularly ones that enjoy robust support from private donations.\" Follow Sean Rossman on Twitter: @SeanRossman  ",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "'Get rid of the fat': Why Betsy DeVos' plan to slash Special Olympics funding probably won't happen",
      "url": "https://www.usatoday.com/story/news/politics/2019/03/28/special-olympics-why-proposed-budget-cuts-unlikely-happen/3297779002/",
      "subtitle": "'Get rid of the fat': Why Betsy DeVos' plan to slash Special Olympics funding probably won't happen",
      "author": "null",
      "content": "WASHINGTON – Education Secretary Betsy DeVos ignited a firestorm with her proposal to eliminate federal funding for the Special Olympics, but something has been largely overlooked amid the furor. The cuts are unlikely to happen. Ever. Here are five things you should know about the federal budget and the Special Olympics controversy: DeVos’ proposed $17.6 million cut for the Special Olympics was included in the $4.75 trillion federal budget that President Donald Trump’s administration sent to Congress earlier this month. It’s not just Special Olympics facing the budget ax. Trump seeks dramatic across-the-board spending cuts to domestic programs for the coming fiscal year. An exception: the military, which would get a 5 percent increase under his proposal. “Get rid of the fat, get rid of the waste,” Trump instructed his Cabinet. DeVos said she had to make some hard decisions after the president demanded across-the-board cuts. For DeVos, a supporter of school choice, those decisions meant eliminating federal funding for Special Olympics – a program designed to help children and adults with disabilities – while spending millions more on charter schools. The Education secretary explained her rationale by saying that the Special Olympics is a private organization – not a federal program – that is better supported by philanthropy. “I love its work, and I have personally supported its mission,\" she said. \"But given our current budget realities, the federal government cannot fund every worthy program, particularly ones that enjoy robust support from private donations.\" It’s not the first time DeVos targeted the Special Olympics. She has proposed eliminating funding for the program in her two previous budget proposals. Both times, the proposal went nowhere. Why the outrage? Supporters of the Special Olympics were predictably furious over the proposed cuts. Vermont Sen. Bernie Sanders, an independent who’s seeking the Democratic nomination for president, called the cuts “unbelievable” and promised to “get our national proprieties straight” if he gets to the White House. Rep. Barbara Lee, D-Calif., labeled the proposed cuts “appalling” and said she couldn’t understand why DeVos would go after disabled children in her budget. Timothy Shriver, chairman of Special Olympics International, said the work the federal money supports is \"critical\" to education and that the lessons taught in schools through Education Department-funded programs \"are critically the responsibility not just of the volunteer sector but of our elected leaders.\" Probably not. Because the president’s budget is just a proposal, a way for the administration to spell out its spending priorities for the coming year. Lawmakers have their own ideas about how federal dollars should be spent, and since they seldom line up closely with the president’s vision, Congress usually shelves the president’s budget proposal and writes its own. The process becomes even more complicated when an opposing party is in charge, as it is this year. Democrats led by Speaker Nancy Pelosi control the House for the first time in eight years, while Republicans still hold the Senate and the White House. Trump’s budget was basically dead the moment it arrived at Congress. And, given the political support that the Special Olympics has in Congress, there's virtually no chance that lawmakers will let the proposed cuts to the program stand. Various congressional committees are holding hearings on the president’s budget proposal. DeVos, in fact, appeared before a House subcommittee this week to defend the administration’s proposals to cut funding from education programs. The House and the Senate will each try to pass their own version of the budget before the new fiscal year begins Oct. 1. Then negotiators from the two chambers will piece together the final spending plan that Congress will send to the president. Trump must either sign the budget or veto it. If he vetoes the bill, Congress will start over and try to come up with a budget that will win presidential approval. A presidential veto has its risks, though. Failure to reach a consensus on the budget could lead to another government shutdown – a prospect that the White House and Congress want to avoid after the fiasco of the 35-day government shutdown earlier this year. More:Cuts to Special Olympics draw fire: What we know now about Betsy DeVos' plan ",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Betsy DeVos wants to cut Special Olympics funds and people are outraged: What we know now",
      "url": "https://www.usatoday.com/story/news/nation/2019/03/28/special-olympics-cuts-what-we-know-now-betsy-devos-plan/3297220002/",
      "subtitle": "Betsy DeVos wants to cut Special Olympics funds and people are outraged: What we know now",
      "author": "null",
      "content": "Education Secretary Betsy DeVos' proposal to eliminate federal funding for the Special Olympics has drawn strong reaction on Capitol Hill and beyond. The $17.6 million would be a small part of $7 billion in proposed cuts that would trim department spending by about 10 percent. DeVos, however, seeks additional funding for a few programs, including charter schools and a tax credit for individuals and companies that donate to scholarships for private schools. \"We are not doing our children any favors when we borrow from their future in order to invest in systems and policies that are not yielding better results,\" DeVos said Tuesday in prepared testimony before a House subcommittee considering the Department of Education's budget request for the next fiscal year. Special Olympics supports over 5 million athletes, 1 million coaches and volunteers and more than 100,000 competitions each year in about 170 countries. Special Olympics also provides educational programs for thousands of schools. Rep. Barbara Lee, D-Calif., called the proposed cut \"appalling,\" adding that she \"can’t understand why you would go after disabled children in your budget.\" Sen. Roy Blunt, R-Mo., chairman of the Senate subcommittee over the education budget, said flatly that the \"appropriations bill will not cut funding for the program.\" At a Senate hearing Thursday, DeVos acknowledged she did not personally authorize the reduction. Sen. Dick Durbin, D-Ill., suggested that whoever approved the proposed cut should get \"a special Olympic gold medal for insensitivity.\" Julie Foudy, former captain of the U.S. women's soccer team, tweeted: \"You need to only spend .01 minute watching these @SpecialOlympics athletes perform to understand the power of this program.\" Pittsburgh Steelers cornerback Joe Haden tweeted: \"This is so wrong on so many Levels! I will continue to spend my time and resources with the @SpecialOlympics now more than ever. I’m Literally sick 2 my stomach!!!!!\" Devos said Special Olympics is able to raise more than $100 million every year in private money. There are dozens of worthy nonprofits that support students and adults with disabilities that \"don't get a dime of federal grant money.\"  The federal government cannot fund every worthy program, particularly ones that successfully fund-raise, she said. She added that the government supports the nation's 7 million students with disabilities through a $13.2 billion budget request that matches the level appropriated by Congress. \"It is unacceptable, shameful and counterproductive that the media and some members of Congress have spun up falsehoods and fully misrepresented the facts.\" Timothy Shriver, chairman of Special Olympics International, said the traditional Special Olympics program funded by philanthropy involves 500,000 U.S. athletes every year. The Education Department, in partnership with state Departments of Education and local education authorities, provides funds for contracts with Special Olympics, he said. Those deals provide educational services in schools, supporting the development of children with special needs and \"teaching of critical, social and emotional skills such as grit, perseverance and inclusion,\" he said. Contributing: Sean Rossman and Todd Spangler, USA TODAY NETWORK; The Associated Press",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Betsy DeVos calls for more charter schools even as they spark investigations across the country",
      "url": "https://www.usatoday.com/story/news/education/2019/03/27/charter-school-betsy-devos-school-choice/3251111002/",
      "subtitle": "Betsy DeVos calls for more charter schools even as they spark investigations across the country",
      "author": "null",
      "content": "The first charter school in Nevada – I Can Do Anything High School – is set to close this spring. Ohio's largest charter, which has 12,000 online students, shut down last winter after a crackdown on its suspicious attendance figures. To help pay state fines, the school auctioned off everything from ballpoint pens to a singing Big Mouth Billy Bass wall plaque. In New Jersey, the charter system is making real estate investors rich. They use federal money to build school buildings, then rent them to charter schools for a hefty profit. The IRS has stepped in, reviewing the practice. More from New Jersey: Across the USA, charter schools face a reckoning. After charters spread rapidly for a generation, under few rules or little oversight in many states, the pace of growth is slowing. Politicians  call for more regulation for the schools, which use taxpayer money but have private operators. The political winds have shifted as well, killing the kind of bipartisan agreements that allowed charter schools to blossom. Start the day smarter:Get USA TODAY's Daily Briefing in your inbox  When schools experiment, some will fail, said Education Secretary Betsy DeVos, a champion of charter schools. \"Charter schools are great options for thousands of students, and the demand for more of them remains very high,\" DeVos said Tuesday during a congressional hearing. \"We need more of them, not fewer.\" Rep. Rosa DeLauro, D-Conn., who chairs the House subcommittee where DeVos testified, shot back that DeVos' office had been \"asleep at the wheel\" when it came to looking after how states oversaw their charter schools. \"It seems to me that charters have enormous flexibility, and there seems to be no one overseeing how that flexibility translates into federal dollars,\" DeLauro said. Outside Washington, the rollback on charters is well underway. The Los Angeles school board, the nation's second-largest, called for a statewide moratorium on new charter schools. In Minnesota – the first state to legalize charters, in 1991 – the growth in schools declined in 2017, even as the number of children attending charters has increased. In Nashville, Tennessee, the school board hasn't approved a new charter in two years, since anti-charter officials swept into office. Just 355 new charter schools opened nationwide in the 2016-17 school year, the fewest in a decade, according to the National Alliance for Public Charter Schools, an advocacy group. Charters enroll a small proportion of the nation's public school students: just 6 percent. But the schools have always received outsize attention because they pledged to succeed where other schools failed, particularly in urban centers. They were designed to foster innovation and to offer parents more options beyond traditional schools. \"Charters were horribly messianic in their narratives about how they were going to change the world and make it more equitable,\" said Tim Knowles, former head of the Urban Education Institute at the University of Chicago. \"In reality, some were great, and some were about the same as regular public schools, and some were much worse.\" Charter schools are public schools that are privately managed, usually by nonprofit companies. The schools are given freedom from some state rules in exchange for meeting performance targets spelled out in their contract, or charter. Many charters choose to operate longer school days and employ stricter rules around student behavior and academics than what traditional schools can legally enforce. In a number of urban cities, charters have outperformed their public school counterparts, research shows. In other cases, the schools have opened, then closed a couple of years later – or even in the middle of the academic year. Vulnerable students hop from school to school, losing the stability they need. New rules and accountability measures seek to stop that instability. But the rules stifle people who want to start new schools, some charter proponents say, thwarting the very innovation the schools were designed to foster. “That’s contrary to the original idea of charter schools, which was to allow citizens or teachers or parents to solicit expertise or develop their own idea, and then we’d give them flexibility to pursue that idea,” said Jeanne Allen, founder of the Center for Education Reform, a pro-charter group. Other charter supporters welcome efforts aimed at increasing quality. Todd Ziebarth, a senior vice president at the National Alliance for Public Charter Schools, noted that lawmakers in Ohio, Arizona and Texas have taken steps to close chronically underperforming charters. \"Many of those schools probably shouldn't have been open to begin with,\" he said. More from New Jersey investigation: In Arizona, politicians legalized charter schools without ever having set foot inside one. That was 1994, and politicians were reeling from the outcry over low-performing public schools. Only two other states – Minnesota and California – had allowed the schools by then. The untested plan was popular from the start, as applications for charters flooded in. Some critics noted problems. Schools, low on money for buildings, had to cook up other ways to raise money and find space. The “competitive” model politicians had envisioned meant a system where some schools were winners and some were losers: The first charter school to file for bankruptcy came in 1996. Still, proposals to overhaul charters made little headway in a Legislature that shifted increasingly to Republican control. Over the next two decades, charters grew to enroll about 16 percent of the state’s students and consumed 27 percent of the state's education money. Some carved out a reputation for academic excellence. Basis Charter Schools, founded in Tucson, Arizona, routinely topped rankings of America’s best schools by U.S. News and World Report. But questions remained. Basis, for instance, supplemented low teacher pay with donations from parents, while the for-profit parent company pocketed millions of dollars from Arizona taxpayers. An Arizona Republic investigation found that operators of several charter schools found ways to turn the taxpayer money into private profits. Last year, as Arizona's teachers walked out over low pay and declining money for public schools, scrutiny of charters increased. The state’s Republican attorney general expressed outrage at some of the private payouts, declaring “I can’t believe it’s not a crime.” Republican Gov. Doug Ducey, long a supporter of charter schools, finally threw his support behind the idea of financial changes. A Republican state senator sponsored an overhaul bill. Charter schools always had built-in opposition from public school teachers and their unions. As part of their contracts, the independent schools receive freedom to hire their own staff. Most charter schools are not unionized. This year, opposition from unions exploded in walkouts and strikes. Los Angeles teachers forced their district's pro-charter-school board to vote to oppose the expansion of charters. West Virginia teachers derailed plans to open the state's first charter schools. In Chicago, unionized teachers staged the nation's first strike at a charter. Union members' voices may seem louder because many of charter schools' traditional allies have gone silent. For most of a generation, a large percentage of Democrats backed the schools. Wall Street liberals invested in them, urban Democrats praised the options they afforded disadvantaged students, and Presidents Bill Clinton and Barack Obama supported them as avenues for school reform. Those Democrats formed coalitions with Republicans, who chafed at the bureaucracy of school districts and teacher unions. As the country became more polarized, those coalitions dissolved. Liberals say charters have held down teacher pay and siphoned taxpayer money away from traditional schools, hurting their students. Fuel for the left includes the pro-school-choice stances of President Donald Trump and DeVos. “The unions could not have asked for a better gift in a president and (education) secretary to use as weapons against the charter school movement,” Ziebarth said. “They play into the caricatures.\" Even though the opposition has gained momentum, charters aren't going away. They continue to expand in parts of the country. In New Orleans, virtually all public schools are run by charter organizations. In El Paso, Texas, a push from business leaders will bring a flood of charters in the next five years. The federal government gives hundreds of millions of dollars to states to help them start charters; last year's winners included Arizona, Colorado, New York, Michigan and North Carolina. The 2020 budget request for the Department of Education calls for boosting federal money for charter schools by $60 million. And in some states, calls for tightening rules on charter schools may wind up being more talk than action. In Arizona, where tough questions pushed even the most pro-charter politicians to support changes, a Republican-sponsored bill this year suggested more oversight for how the schools spent public money. It would have been the most significant change to the state’s charter system in 25 years. But moves to scrutinize private contracts were shut down. The bill, after passing the state Senate, was single-handedly killed by the House speaker. Arizona’s laissez-faire charter system avoided a crackdown again. Correction: A previous version of this story incorrectly characterized the contraction among charter schools in Minnesota. In 2017, nine charter schools closed, while only three new ones opened. Contributing: Craig Harris, Anne Ryman, The Arizona Republic; Siobhan McAndrew, Reno Gazette-Journal; Jason Gonzales, The Tennessean; Jessie Balmert, The Cincinnati Enquirer; Sara Sanchez, El Paso Times; Jean Rimbach, AbbottKoloff, NorthJersey.com; Kelly Ragan, The Coloradoan Education coverage at USA TODAY is made possible in part by a grant from the Bill & Melinda Gates Foundation. The Gates Foundation does not provide editorial input.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Opinion: Betsy DeVos doesn't get why Special Olympics matter",
      "url": "https://www.usatoday.com/story/sports/columnist/brennan/2019/03/27/betsy-devos-doesnt-get-why-special-olympics-matter/3292081002/",
      "subtitle": "Opinion: Betsy DeVos doesn't get why Special Olympics matter",
      "author": "null",
      "content": "Eunice Kennedy Shriver has been gone for nearly 10 years, but this week, in the face of an appalling lack of understanding from the Trump White House about the national value of inspiration and courage, she just might be more powerful than she has ever been. The Trump administration has made a mistake for the ages by completely eliminating funding for Special Olympics, $18 million in all – about the cost of five of President Donald Trump’s golf trips to Mar-a-Lago. It has defunded the most visible and recognizable symbol of inclusion for those with intellectual disabilities not just in this country, but around the world. Undaunted amid the furor over her decision, U.S. Secretary of Education Betsy DeVos doubled down Wednesday. “The Special Olympics is not a federal program,” she said in a statement. “It’s a private organization. I love its work, and I have personally supported its mission. Because of its important work, it is able to raise more than $100 million every year. There are dozens of worthy nonprofits that support students and adults with disabilities that don’t get a dime of federal grant money. But given our current budget realities, the federal government cannot fund every worthy program, particularly ones that enjoy robust support from private donations.” Let’s take DeVos at her word. Let’s hope that outrage will turn into donations. And let’s hope that Special Olympics will more than make up for what it has lost to continue to carry on its vital mission. The best result in this chaos of her own making would be for DeVos to rethink her budget and reinstate Special Olympics funding, or for Trump to realize how horrible this looks and right this wrong. NFL PLAYER'S UNIQUE ROLE:Steelers' Joe Haden works to introduce flag football to Special Olympics But that would require them to understand something they likely cannot grasp: how attached Americans have become to Shriver’s magnificent idea of giving those with intellectual disabilities the chance to train and compete in sports, while at the same time teaching everyone else about the fight against intolerance, exclusion and bullying. This isn’t a blue state or a red state issue. This isn’t about politics. It’s about the remarkable message of acceptance that Special Olympics carries around the world, including at the just-completed World Games in Abu Dhabi. You know who would have taken Trump and DeVos to task on this point better than anyone else? Eunice Kennedy Shriver. Fueled by a fierce anger over the way those with intellectual disabilities were hidden away by the rest of society, and inspired by the struggles and challenges of her older sister Rosemary, Shriver founded Special Olympics in 1968. The organization has grown into one of the great success stories of our times. Special Olympics supports more than 5 million athletes, 1 million coaches and volunteers and more than 100,000 competitions each year in more than 170 countries. Earlier this month, the 2019 World Games, televised by ESPN, brought together 7,500 athletes from 195 nations for a week of competition. I was very fortunate to get to know Shriver and spend time with her over the course of a decade or so in Washington, D.C. I’ll never forget sitting next to her at a Special Olympics tennis match on the campus of George Washington University about 30 years ago. When the competitors began making uncharacteristic mistakes, she shifted in her chair. She was not happy. \"They are better than this,\" she said to me, shaking her head. \"I know the crowd is sympathetic, but these athletes are better than they're playing, and I wish the people here could see that.\" She never looked at Special Olympians as those to be pitied, and well understood the importance of what the spectators were seeing that night. Then, as now, it was all about the message that was being sent by these valiant athletes to the rest of us. There is no one who understood that better than Shriver. Against her, even now, Trump and DeVos don’t stand a chance.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Betsy DeVos: Deep cuts to Special Olympics, student programs warranted",
      "url": "https://www.usatoday.com/story/sports/highschool/2019/03/26/betsy-devos-funding-cuts-special-olympics-warranted/39260497/",
      "subtitle": "Betsy DeVos: Deep cuts to Special Olympics, student programs warranted",
      "author": "null",
      "content": "WASHINGTON — Education Secretary Betsy DeVos on Tuesday defended deep cuts to programs meant to help students and others, including eliminating $18 million to support Special Olympics, while urging Congress to spend millions more on charter schools. \"We are not doing our children any favors when we borrow from their future in order to invest in systems and policies that are not yielding better results,\" DeVos said in prepared testimony before a House subcommittee considering the Department of Education's budget request for the next fiscal year. It was the first time that DeVos, a wealthy former Michigan Republican Party chairwoman and school choice advocate, had been called before a Democratic-led panel in the U.S. House to explain President Donald Trump's spending priorities. While proposing to add $60 million more to charter school funding and create a tax credit for individual and companies that donate to scholarships for private schools, DeVos' budget proposal would still cut more than $7 billion from the Education Department, about 10 percent of its current budget. President Trump proposed a $4.7 trillion overall budget this month with an annual deficit expected to run about $1 trillion. It calls for eliminating billions in grants to improve student achievement by reducing class sizes and funding professional development for teachers as well as cutting funds dedicated to increasing the use of technology in schools and improving school conditions. In many cases, DeVos said the purpose of the grants has been found to be redundant or ineffective. In the case of the $17.6 million cut to help fund the Special Olympics, a program designed to help children and adults with disabilities, DeVos suggested it is better supported by philanthropy and added, \"We had to make some difficult decisions with this budget.\" \"Do you know how many kids are going to be affected by that cut?\" asked U.S. Rep. Mark Pocan, D-Wisconsin, while also pointing out a recent report by a nonprofit group that concluded the U.S. government has spent as much as $1 billion on charter schools that never opened or they closed because of mismanagement or other reasons. DeVos has been a longtime supporter of charter schools — independently run, publicly funded schools that typically aren't as closely regulated as traditional schools — and school choice for public school students, arguing that parents should be able to put their children into the schools of their choice and that funding should follow them. Many public school supporters have argued that government support of charter schools and private schools can undermine traditional schools, which educate most students. U.S. Rep. Rosa DeLauro, D-Conn., who is chairwoman of the subcommittee that held the hearing, called the budget proposal \"cruel and reckless,\" saying it \"will hurt the middle class and low-income families that most need our help.\" \"How can you support this budget? I mean that genuinely,\" she said. \"As secretary of the Department of Education, how can you support, even boast, about taking 10 percent … away from our teachers and students?\" It's unlikely that any of the major reductions, or any major proposals to boost school choice, are headed towards passage, however. Even with the Republican in the majority in the U.S. House the last two years, most of DeVos' strongest proposals for cuts or spending were turned back. Now with Democrats in the majority, they are far less likely to gain traction. Follow the Detroit Free Press' Todd Spangler on Twitter @tsspangler.  ",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Betsy DeVos: Special Olympics questions from Congress are 'disgusting'",
      "url": "https://www.usatoday.com/story/news/education/2019/03/28/betsy-devos-special-olympics-education-department/3299367002/",
      "subtitle": "Betsy DeVos: Special Olympics questions from Congress are 'disgusting'",
      "author": "null",
      "content": "WASHINGTON — A Democratic senator's questions about a proposal to cut money from Special Olympics were a \"shameful\" and \"disgusting\" political ploy, Education Secretary Betsy DeVos said Thursday. Her remarks came as U.S. Sen. Richard Durbin, D-Ill., criticized the proposal to eliminate $18 million in grants for the private nonprofit Special Olympics. Durbin got DeVos to acknowledge that she did not personally authorize the reduction to Special Olympics, which provides popular programs to children and adults with disabilities. She didn't say who approved the proposed cut, which is included in her agency's $64 billion budget proposal. The back-and-forth happened as DeVos testified before a U.S. Senate subcommittee on the Education Department's budget request. Will it happen?:Probably not. Here's why DeVos said the reduction was one of the many tough decisions her department had to make to cut some $7 billion overall to student and teacher programs, even as she proposed increasing funding for charter schools by $60 million. \"I've given a portion of my salary to Special Olympics,\" said DeVos, raising her voice as Durbin tried to interrupt her with more questions about the cut. \"Let's not use disabled children in a twisted way for your political narrative. That's just disgusting and is shameful.\" Durbin responded that proposing to eliminate $18 million out of a $64 billion Education Department budget for something as beloved as Special Olympics \"is shameful, too.\" He added that whoever approved the proposed cut should get \"a special Olympic gold medal for insensitivity.\" Allllll the outrage:Opposition from professional athletes, politicians, you name it If it follows trends in recent years, Congress is unlikely to accept the deep cuts to Special Olympics and other programs in the Education Department. For the last three years, the Trump administration has proposed cuts, including those to popular programs, suggesting that they are needed to reduce spending, only to see Republicans and Democrats alike in Congress reject them. On Wednesday, DeVos' office suggested media reports were misrepresenting the cut — which set off a firestorm of criticism. At the same time, the office said the elimination of the grant was necessary and the lost funding could be made up by charitable giving. At Thursday's Senate hearing, U.S. Sen. Patty Murray, D-Wash., said she was disappointed by the proposed cut, along with others to programs for after-school care and students with special needs. \"You said this is about tough choices, but at the same time you’re asking money for charter schools,\" Murray said to DeVos, a longtime supporter of providing choices to traditional public schools. \"This isn’t about tough choices. This is about you prioritizing your agenda over children with special needs.\" Special Olympics responds:Our work is 'critical' to education Opinion:Betsy DeVos doesn't get why Special Olympics matter DeVos said she has always been supportive of children with special needs and to suggest otherwise is wrong. The Education Department did not immediately respond to a question about how much DeVos donates to Special Olympics, but the New York Times reported last year that DeVos was donating her $199,700 salary to four charities, including Special Olympics, splitting the amount equally. That would mean she donates just under $50,000 a year from her salary to Special Olympics. DeVos, a former Michigan Republican Party chairwoman and wealthy Republican donor, also defended the cuts on Tuesday, in testimony before a U.S. House subcommittee. Follow Todd Spangler on Twitter: @tsspangler",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "A look at Betsy DeVos, Trump's Education secretary",
      "url": "https://www.usatoday.com/picture-gallery/news/politics/2017/02/23/a-look-at-betsy-devos-trumps-education-secretary/98299622/",
      "subtitle": "A look at Betsy DeVos, Trump's Education secretary",
      "author": "null",
      "content": "",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "High school journalists were blocked from Betsy DeVos event. So, they wrote about it",
      "url": "https://www.usatoday.com/story/news/nation/2019/04/22/betsy-devos-visit-shut-out-lexington-student-journalist/3541119002/",
      "subtitle": "High school journalists were blocked from Betsy DeVos event. So, they wrote about it",
      "author": "null",
      "content": "LOUISVILLE, Ky. - High school journalists who were barred last week from a roundtable event with U.S. Secretary of Education Betsy DeVos in Kentucky have made national news after calling out the event's lack of openness. \"We are student journalists who wanted to cover an event in our community featuring the Secretary of Education, but ironically, we couldn’t get in without an invitation,\" the students said in an editorial in their newspaper at Paul Laurence Dunbar High School, a public school in Lexington. The editorial caught the attention of local and national news outlets. The Washington Post wrote a piece about how the student's turned their travails into the story. In the students' piece, \"No Seat at the Roundtable,\" the  newspaper's two editor-in-chiefs said they were waved away the morning of April 17 when an event bouncer learned they hadn't RSVP'd to the event. The roundtable, hosted by the Bluegrass Community & Technical College in Lexington, focused on a a possible federal tax credit scholarship. 'Yeah, how is that illegal?':Kid reporter confronts officer who threatened to arrest her near Arizona-Mexico border DeVos' department is proposing \"Education Freedom Scholarships,\" which would offer up to $5 billion in annual federal tax breaks to those choosing to donate to state-based scholarship programs. Beyond their own problems attempting to enter the event, the students questioned the 11 a.m. Wednesday timing of the event, saying it's an inconvenient time for teachers and students to attend. The editorial questioned why only one student, who attends a private school in Louisville, had a seat at the table. \"... As students, we are the ones who are going to be affected by the proposed changes discussed at the roundtable, yet we were not allowed inside,\" the students, Olivia Doyle and Abigail Wheatley, wrote. And as the Courier Journal reported last week, while many state education officials and school-choice supporters attended, no public school employees were included in the roundtable. Charter schools:Betsy DeVos calls for more charter schools even as they spark investigations across the country What we know:Betsy DeVos wants to cut Special Olympics funds and people are outraged \"The bottom line is that we do not think that it is fair to have a closed roundtable about education when it affects thousands of Kentucky teachers, students, and parents,\" the students wrote. A media advisory on the education department's website included press contacts and noted reporters needed to have RSVP'd for the event by 8 a.m. on the day of the events. The students say they learned of DeVos' visit the day before and started making plans to attend. But when they arrived at the public school campus for the event they knew was open to reporters, the students said, a man wearing a college badge told them they needed an invitation to attend. The Lexington Herald-Leader reported that U.S. Department of Education Press Secretary Liz Hill said no one on DeVos' staff knew that student journalists were trying to get into the event. \"We welcome student journalists and would have been happy for them to be in attendance,\" she said. \"We are looking into what, if any, miscommunication might have happened between other staff on site for the event.” Follow Matthew Glowicki on Twitter: @MattGlo ",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Betsy DeVos: It's not about me, it's about students",
      "url": "https://www.usatoday.com/story/news/education/2019/05/06/betsy-devos-education-secretary-schools/1120719001/",
      "subtitle": "Betsy DeVos: It's not about me, it's about students",
      "author": "null",
      "content": " BALTIMORE — While the media may focus on U.S. Education Secretary Betsy DeVos, she told the nation's education reporters Monday that the focus should be on students and families. \"As much as many in the media use my name as clickbait or try to make it all about me, it’s not,\" she said. \"Education is not about Betsy DeVos nor any other individual.\" Defining herself as a conservative with a distrust of government, DeVos used her appearance at the Education Writer's Association annual conference to promote her Education Freedom Scholarships and to continue her call for a redefinition of public schooling. \"It should surprise no one that I am a common-sense conservative with a healthy distrust of centralized government,\" she said. \"Instead, I trust the American people to live their own lives and to decide their own destinies. That’s a freedom philosophy.\" For DeVos, a wealthy former Michigan Republican Party chairwoman whose Cabinet term has been marked with controversy, that means giving students and families the choice to move between schools. She says this will force traditional public schools to innovate and get better. Betsy DeVos roundtable:High school journalists were blocked from Betsy DeVos event. So, they wrote about it What we know:Betsy DeVos wants to cut Special Olympics funds and people are outraged It's a familiar mantra for DeVos, who pushed the establishment of charter schools in Michigan and helped to push an unsuccessful school vouchers ballot question in Michigan. She has proposed an Education Freedom Scholarship, which would use private scholarships to allow students who couldn't normally afford it to go to private schools. It ties in with DeVos' broader philosophy. \"Let’s stop and rethink the definition of public education,\" she said. \"Today, it’s often defined as one type of school, funded by taxpayers, controlled by government. But if every student is part of 'the public,' then every way and every place a student learns is ultimately of benefit to 'the public.' That should be the new definition of public education.\" DeVos furthered her push for school choice under questioning from New York Times reporter Erica Greene. \"More choices and more freedom in education will ultimately mean better schools overall, even a neighborhood traditional public schools,\" DeVos said. \"Having the ability to direct where resources go on the child or family level helps families become wise consumers.\" During the question-and-answer period with the reporters, a Michigan-based reporter asked DeVos about Detroit schools and the charter schools in the city, which have a generally poor record, as does the Detroit traditional school system and why DeVos hadn't visited the city to talk to families about the schools. DeVos was instrumental in pushing Michigan's charter school law, including through political action groups and donations to Michigan legislators. DeVos said she had been to Detroit schools before she was Education secretary. She also said she doesn't think Michigan has true education \"freedom.\" She added that she hoped that would change. Teacher of the year:Kentucky's 2019 teacher of the year shuns White House visit in protest of Trump Campus sexual assault:Students accused of sexual assault are suing colleges — and winning most of the time DeVos was also asked about private, for-profit companies that run charter schools and make profits off doing so, sometimes by skirting laws. DeVos said all public schools — charter and traditional — must follow laws, but said the bigger thing to focus on is why there are waiting lists in many places for charter schools and why more of those schools aren't available. In other news, DeVos said: Follow David Jesse on Twitter: @reporterdavidj ",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Betsy DeVos used personal email for work in 'limited' cases, according to internal investigation",
      "url": "https://www.usatoday.com/story/news/nation/2019/05/20/betsy-devos-emails-investigation-limited-personal-accounts/3748270002/",
      "subtitle": "Betsy DeVos used personal email for work in 'limited' cases, according to internal investigation",
      "author": "Kristin Lam",
      "content": "Education Secretary Betsy DeVos used her personal email accounts for government business in \"limited' cases and did not always properly save messages, according to an internal investigation released Monday. The report said DeVos sent or received fewer than 100 messages on four personal email addresses during her first 15 months in office, joining other Trump administration officials in improper email practices. DeVos sent six emails on private accounts, including five about official business. according to the report. Investigators could not prove she followed federal law on saving official emails created on personal accounts. “We did not identify any instances where the secretary forwarded emails from her personal accounts to her department email accounts,” the report said. It added that “the secretary’s emails related to government business were not always being properly preserved.” Charters:DeVos calls for more charter schools even as they spark investigations across the country Betsy DeVos:It's not about me, it's about students Department rules forbid employees from using personal emails for work except when their government accounts are unavailable. In those cases, employees must forward the messages to their work accounts within 20 days. In all, the Education Department's Office of Inspector General concluded there was no evidence of “active or extensive” use of DeVos’ personal email. Her office told investigators it was taking “additional steps to identify and preserve” emails in her personal accounts. Most of the fewer than 100 emails linked to DeVos' personal accounts were from the first six months of 2017, soon after DeVos took office, the inquiry found. Most were also from a single unidentified person recommending candidates for agency jobs. Ironic twist:Now Trump's team has to deal with private email questions Report:Ivanka Trump sent hundreds of messages from personal email account, according to report The report noted other emails were from people who congratulated DeVos or offered other job advice. House Democrats requested the review in October 2017, but the inspector general’s office said it began work “well into 2018” because of staffing challenges. Other Trump administration officials who have faced questions about private emails include Ivanka Trump, Jared Kushner, former chief of staff Reince Priebus and former senior adviser Steve Bannon. Contributing: The Associated Press",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "51 attorneys general call on Betsy DeVos to cancel up to 42,000 disabled veterans' student debts",
      "url": "https://www.usatoday.com/story/news/politics/2019/05/25/attorneys-general-ask-devos-cancel-student-debt-up-42-000-disabled-vets/1235996001/",
      "subtitle": "51 attorneys general call on Betsy DeVos to cancel up to 42,000 disabled veterans' student debts",
      "author": "Nicholas Wu",
      "content": "WASHINGTON — In a letter sent to Education Secretary Betsy DeVos on Friday evening, 51 attorneys general called on the Education Secretary to automatically cancel disabled veterans' student debt, something that is not currently done by the Department of Education. \"We write to...urge the Department of Education to take prompt action to satisfy its statutory mandate to discharge the student loans of veterans who are permanently and totally disabled or otherwise unemployable,\" wrote the attorneys general. \"As a nation, we have a moral obligation to assist those who have put their lives on the line to defend us.\" The group included attorneys general from 47 states, three territories, and the District of Columbia. Alabama, Arizona, and Texas did not sign on. More:Buttigieg's huge student debt Three fast facts:Robert F. Smith gift to Morehouse highlights burden of student loan debt In April last year, DeVos announced a new partnership between the Departments of Education and Veterans Affairs that would match borrowers in the Department of Education's records system with disabled veterans in the Department of Veterans Affairs records system. People deemed eligible for loan discharges would be mailed a letter including an application for \"totally and permanently disabled\" (TPD) status. Under the Higher Education Opportunity Act of 2008, if student borrowers die or become permanently disabled, they are eligible to have their loans forgiven, so a successful granting of TPD status would allow for the complete discharge of student loans. The attorneys general argued that automatically canceling the student debt would benefit veterans whose severe disabilities might prevent them from filling out the necessary forms. Like what you’re reading?:Download the USA TODAY app for more Education Department spokesperson Liz Hill told Politico that “while ‘automatic discharge’ may seem like a simple solution, there are long-term impacts we want all veterans to have the chance to consider before their loans are discharged.” Hill also cited \"potential state and local tax liabilities\" that could burden veterans after their loans were forgiven and veterans' potential inability to take out other student loans in the future if their current ones were forgiven. Anticipating this criticism, the attorneys general wrote that \"we think it likely that most borrowers would prefer to have one hundred percent of their outstanding loans discharged, even if this resulted in an increase to their state tax bill,\" though they considered adding a way to opt out of the automatic loan forgiveness. According to a FOIA request filed by Veterans Education Succes, an advocacy group, with the Department of Education, more than 42,000 veterans are eligible for TPD status, but fewer than 9,000 people had applied as of the beginning of May 2018, More than 25,000 eligible veterans were in default.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "A worthless degree? Betsy DeVos wants to change rules for which colleges stay open, close",
      "url": "https://www.usatoday.com/story/news/education/2019/06/21/college-closing-accreditation-betsy-devos-u-s-department-education/1505318001/",
      "subtitle": "A worthless degree? Betsy DeVos wants to change rules for which colleges stay open, close",
      "author": "Chris Quintana",
      "content": "Going to Brightwood College in the 2018 fall semester was supposed to be a safe bet. So thousands of students enrolled across the country. For those students and others, a degree is supposed to be a lifeline. They sink in time and money that could be spent in the workforce, all for the prospect of higher earnings and a more fulfilling career. But Brightwood students’ investment didn’t pay off. What’s more, a regulatory group had signed off on the college’s programs – only to change its mind. Accreditation, as it’s called, is meant to prevent predatory or shoddy schools from leading students astray. And the Accrediting Council of Independent Colleges and Schools had given its signal to students that Brightwood was a worthwhile investment. Yet in December 2018, the agency revoked the accreditation of Education Corp. of America, which ran the Brightwood locations and other colleges across the country. The closures of dozens of institutions followed swiftly. Students had spent the time and money but still had no degrees and no clear path forward. Don't be one of them:A college closed, leaving thousands without a degree. How to keep it from happening to you Many of them still struggle. In a Facebook group for students of the closed college, some commiserate over what they call worthless degrees. Others try to give advice about how to get their student loan discharged or receive their transcripts. What’s more, the Accrediting Council of Independent Colleges and Schools had a checkered history itself. President Barack Obama's administration had moved to strip it of its powers to OK school programs, but after a legal battle, President Donald Trump's administration undid that move. The Education Corp. of America colleges were just some of the institutions that suddenly closed in recent years. ITT Tech closed in 2016. Corinthian Colleges did the same in 2015. Both had been accredited by ACICS. The accrediting group said it gave multiple warnings, but the colleges weren't able to meet its standards. What happened?:The trouble at for-profit colleges, in 5 graphs Now, the Education Department is looking to change the arcane and bureaucratic process of accreditation. Education Secretary Betsy DeVos  and accreditors of universities say new rules will ultimately allow colleges to offer programs more quickly and effectively. That means students landing a job in fields that are hiring, they say. “With these reforms, our nation’s colleges and universities can spend more time and effort on serving students and less time, energy, and money focused on bureaucratic compliance,” DeVos said in a statement. Critics of the newly proposed rules say they would make it easier for shady colleges to operate for longer and with less federal oversight. Many colleges are already doing a poor job of preparing students, said Clare McCann of the think tank New America. Giving them more latitude under the guise of innovation may lead to students taking chances on junk programs, she argued. “What these regulations really do is make it so it is much harder to hold those schools accountable,” McCann said. If anything, the government should hold these agencies to a higher standard, she said. The public has until July 12 to give feedback on the proposed changes. Here’s what you should know. Did your college close? Why Brightwood College, Virginia College closed — and what students should do To receive federal money, universities must meet the quality standards of an accrediting organization. According to the Education Department, these agencies ensure schools have “qualified instructors, an adequate curriculum, and necessary support services” for students. In other words, they’re meant to prevent students from ending up with worthless degrees. Accreditation can essentially be seen as a seal of quality for students, the government and even future employers. And students atunaccredited colleges can’t access federal money in the form of student loans. The government doesn’t directly accredit schools, but the Department of Education does decide who is and isn’t fit to be an accreditor. The new rules were agreed upon by department officials, accreditors, college leaders and students during several negotiation sessions. Among the changes, the proposed rules would allow colleges to offer new programs with less scrutiny from accreditors. The idea is that colleges could see a hole in the workforce and quickly come up with a new degree or credential to fill it. Accrediting agencies and for-profit colleges like this proposed change. Under the current rules, it may take months to make changes to a program’s curriculum, said Judith Eaton, president of the Council for Higher Education Accreditation. The group is made up of 3,000 colleges, and it focuses on accreditation. The new rules, she argued, would mean a less onerous process for accreditors when dealing with the federal government. And, she said, the new rules may make it so that universities feel free to experiment with, for example, new credentialing programs or increased online courses. If a college or accrediting group abused the new rules, the Education Department should crack down quickly, she said. The proposed rules would also allow schools that have failed to meet accreditation standards up to four years to fix their problems – double the previous amount of two years. The rationale? These changes sometimes take a long time, and allowing the university to fix a problem may lead to more students graduating. Closing an underperforming college right away, in contrast, may leave those students without an education and nowhere to go to finish their degree. That is a change welcomed by Nicholas Kent, a vice president at Career Education Colleges and Universities, a group of for-profit colleges. Critics have said the measure may allow bad colleges to do more damage, but Kent called that description “disingenuous,” saying different programs will have different needs. A nine-month certificate program, he said, will need less time to fix a problem compared with a 6-year-doctoral program. And he said accreditors are not required to give four years to everyone. Instead, they have the discretion to do so, and they can set up other check-ins. But allowing a bad institution to operate longer may mean more students attend the failing institution, wasting time and money. And it could cost taxpayers more money because the school could continue to get federal grants and loans, Antoinette Flores, an associate director at the liberal Center for American Progress, has argued. Plus, she said, the proposed rules could make it easier for outside entities to buy failing colleges. The Department of Education wants to limit a new owner's liability. “In practice, that means we’re never going to see any of these institutions going away,” Flores said. “That increases the likelihood we’re recycling failed, toxic assets in the system, and we’re never really getting rid of the lowest performances.” Want to review the proposed rules yourself?  Visit the Federal Register, where the proposal is available in its entirety. The period for public comment ends July 12, so if you have an opinion, file it on the Federal Register's website. Any rule changes would follow the public comment period. Education coverage at USA TODAY is made possible in part by a grant from the Bill & Melinda Gates Foundation. The Gates Foundation does not provide editorial input.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Student loans: Betsy DeVos rule change means college students must fight for loan forgiveness",
      "url": "https://www.usatoday.com/story/news/education/2019/08/30/college-student-loans-loan-forgiveness-betsy-devos-department-of-education/2168669001/",
      "subtitle": "Student loans: Betsy DeVos rule change means college students must fight for loan forgiveness",
      "author": "Chris Quintana",
      "content": "WASHINGTON – The U.S. Department of Education issued new rules late Friday that could make it more difficult for students to get federal loan forgiveness  if they attended colleges that close suddenly. The rules, which have been known as \"borrower defense,\" have been the subject of controversy for much of Betsy DeVos’ turn as education secretary. She has long sought to overturn the 2016 rules from former President Barack Obama's administration on the grounds that it was too easy for students to seek loan forgiveness. The new rules would require student borrowers to provide more evidence that they had been misled about the college’s outlook and, as a result, can’t find employment. It also shifts more of the responsibility onto students to vet the colleges they attend. “I called for this regulatory reset more than two years ago, as it became clear the old rules just weren’t working,” DeVos said in a news release. “We believe this final rule corrects the wrongs of the 2016 rule through common sense and carefully crafted reforms that hold colleges and universities accountable and treat students and taxpayers fairly.” The new rules apply to loans issued on or after July 1, 2020. The department said the changes would save roughly $11 billion over the next decade – in part because the feds would forgive fewer loans. DeVos is pushing the changes while the national discussion about student loans has never been louder. The nation has about $1.6 trillion in student loan debt, and several Democratic presidential hopefuls have rolled out student loan forgiveness into their platforms. One plan:How much does Warren's debt forgiveness plan cost? A lot. Upping the stakes: What's different about Bernie Sanders' student loan plan? It would help more rich people Critics were quick to voice their concerns on Friday, warning borrowers might struggle to get the Education Department to agree to forgive their loans. The Project on Predatory Student Lending went so far as to say it would have to sue to prevent the rules from taking effect. The department argued the new rules would save taxpayer money while still protecting those who might have been genuinely defrauded. The department also said the new rules discourage borrowers from making false claims in an attempt to game the system. Among the many changes in the 846-page document, borrowers now must apply for loan forgiveness if their college closes suddenly. Before, they were automatically eligible for forgiveness. (The window for applying for forgiveness after a school closes has been extended to 180 days instead of the prior 120.) Groups of people – such as whole classes at a college that’s closing – no longer can file for forgiveness, as they had been able to in the past. Borrowers will also have to provide evidence they searched for a job, including emails that would confirm they had applied for work or attended a career fair. A version of the borrower-defense rules had been in place since 1995, but they weren’t widely used until 2015. That’s about the same time the for-profit Corinthians College closed abruptly, leaving thousands of students with millions in debt. The DeVos department has argued the Obama administration expanded the rules to serve these students. As of March 2019, roughly 180,000 applications for debt forgiveness were awaiting approval, despite court rulings in 2018 ordering the department to act. DeVos has spent much of her time as education secretary focusing on school choice for children. Her emphasis in the higher education sector has been reducing regulations. Critics have said these moves disproportionately benefit for-profit colleges. Earlier this summer, DeVos’ department repealed a rule that would have barred federal money to institutions that burden their graduates with high levels of debt compared with their actual earnings. DeVos has also pushed to loosen the federal rules surrounding college accreditation. The department argued less bureaucratic rigmarole will mean colleges can more quickly place students in high-demand jobs, while critics have said laxer standards could leave students more indebted with worthless degrees. For-profits have attracted close public scrutiny in recent years due to the high-profile and sudden closure of several institutions. In addition to Corinithians, ITT closed in 2016 and the Education Corp. of America’s 75 campuses shut their doors in 2018. Most recently, Argosy University closed earlier this year, leaving thousands of students in the lurch. Education coverage at USA TODAY is made possible in part by a grant from the Bill & Melinda Gates Foundation. The Gates Foundation does not provide editorial input.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Education Secretary Betsy DeVos held in civil contempt for violating judge's order on student loan collection",
      "url": "https://www.usatoday.com/story/news/education/2019/10/24/betsy-devos-contempt-violating-order-student-loans/4091621002/",
      "subtitle": "Education Secretary Betsy DeVos held in civil contempt for violating judge's order on student loan collection",
      "author": "Savannah Behrmann",
      "content": "President Donald Trump’s education secretary, Betsy DeVos, and the Education Department were held in civil contempt by a federal judge on Thursday for violating an order to stop collecting loan payments from now-defunct Corinthian College. The Department of Education had been ordered to stop collecting on the federal loans of students who attended the school, which closed in 2015. However, the department disclosed it had continued to garnish wages and seize tax returns of thousands of borrowers. Others had erroneously paid money toward loans. The federal judge also imposed a $100,000 fine for violating the order. The government will pay the fine, not DeVos personally, Politico reported. In a statement posted to Twitter, the Department of Education said it was \"disappointed in the court's ruling.\" \"We acknowledged that servicers made unacceptable mistakes,\" the department said. \"Betsy DeVos directed FAFSA to take immediate action to help every impacted borrower. As of today, FAFSA has taken the actions needed to make every impacted borrower whole.” A worthless degree? Betsy DeVos wants to change rules for which colleges stay open, close Sallie Kim, a federal magistrate judge in California, said, “Defendants have not provided evidence that they were unable to comply with the preliminary injunction, and the evidence shows only minimal efforts to comply with the preliminary injunction,” she issued in 2018, which ordered the Department stop collecting the loans. \"Here, there is no question that Defendants violated the preliminary injunction,” the court order reads. “There is also no question that Defendants’ violations harmed individual borrowers who were forced to repay loans.” Kim said she was leaving open the possibility that if DeVos and the Education Department “fail to comply” with the order, the court would “impose additional sanctions, including the appointment of a Special Master to ensure compliance with the preliminary injunction.” In a written order issued earlier this month, Kim said: \"I am not sending anyone to jail yet, but it’s good to know that I have that ability.” Contributing: Chris Quintana, USA TODAY",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "No, Betsy DeVos is not going to jail",
      "url": "https://www.usatoday.com/story/news/education/2019/10/08/betsy-devos-jail-sallie-kim-department-of-education-corinthian-college/3912609002/",
      "subtitle": "No, Betsy DeVos is not going to jail",
      "author": "Chris Quintana",
      "content": "Education Secretary Betsy DeVos is unlikely to go to jail, but the internet might have you think otherwise. The furor online stems from a case involving the now-defunct Corinthian College, a for-profit college that closed in 2015. The U.S. Department of Education had been ordered to stop collecting on the federal loans of students who attended the school. But the departmentdisclosed it had continued to garnish wages and seize tax returns of hundreds of borrowers. Others had erroneously paid money toward the loans when they didn't have to. The judge's order is part of a lawsuit by former students at Corinthian College, who are suing the department with the hope of discharging their student loans. Colleges keep closing:Their students are left without degrees. How to keep it from happening to you Sallie Kim, a federal magistrate judge in California, admonished the department on Monday during a hearing. Among her remarks, she said: \"I am not sending anyone to jail yet, but it’s good to know that I have that ability.” Some interpreted those remarks as though DeVos herself might be facing jail time. And several news outlets ran headlines linking DeVos to time behind bars. In a written order issued Tuesday, Kim wrote the court would consider if “a finding of contempt, or monetary sanctions, or both are warranted.” Her order does not mention jail time. Contempt of court can end in fines or jail time, but people usually obey the court's rule before that. It's hard to see DeVos doing otherwise. In fact, the judge has already given DeVos an out. In her Tuesday ruling, Kim asked both the Education Department and the former Corinthian students to submit responses to the possibility of a contempt order. She also asked them to give some ideas of how the department could \"remedy\" its illegal collection of student loan payments from the former students and ensure it didn't happen again. Angela L. Morabito, the press secretary for the Education Department, said the agency does not comment on ongoing litigation, and that  \"we are working to faithfully comply with the judge’s orders in this case.\" And in previous court filings, the department wrote it was letting borrowers know about the error and issuing refunds. During her tenure as President Donald Trump's education secretary, DeVos has always attracted fierce controversy. She has become especially reviled by critics on the left for her support of school choice and for rolling back federal regulations in higher education. Education coverage at USA TODAY is made possible in part by a grant from the Bill & Melinda Gates Foundation. The Gates Foundation does not provide editorial input.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    }
  ]
}