{
  "articles": [
    {
      "title": "Track Palin, son of former Alaska Governor Sarah Palin, arrested for domestic violence, other charges",
      "url": "https://www.usatoday.com/story/news/nation/2017/12/18/track-palin-son-former-alaska-governor-sarah-palin-arrested-domestic-violence-other-charges/960281001/",
      "subtitle": "Track Palin, son of former Alaska Governor Sarah Palin, arrested for domestic violence, other charges",
      "author": "null",
      "content": "ANCHORAGE, Alaska – Court documents say Track Palin, the oldest son of former Alaska Gov. Sarah Palin, was arrested on charges related to domestic violence again. He was arraigned Sunday morning on three counts of felony burglary, misdemeanor reckless assault and misdemeanor criminal mischief. He remained jailed in Palmer, Alaska, as of Sunday afternoon. Track Palin previously faced domestic violence charges in 2016. Court records say he was suspected of punching his girlfriend, who then became concerned that Palin was going to shoot himself with a rifle. He took a plea deal that resulted in some of the charges being dismissed and he pleaded guilty to misdemeanor possessing a firearm while intoxicated. Attorney John Tiemessen, who said he represents Sarah Palin, acknowledged the arrest Sunday and asked for privacy. No attorney was listed for Track Palin.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Track Palin left his father, Todd, bleeding after breaking into home, according to police report",
      "url": "https://www.usatoday.com/story/news/nation/2017/12/19/track-palin-left-his-father-todd-bleeding-after-breaking-into-home-according-police-report/964018001/",
      "subtitle": "Track Palin left his father, Todd, bleeding after breaking into home, according to police report",
      "author": "null",
      "content": "At first it was described as “domestic violence.” Now, disturbing new details have emerged in the weekend arrest of Track Palin, a son of former Alaska governor and vice presidential candidate Sarah Palin, including the allegation that he left his father, Todd, bloodied and bruised. Police were called to the home Saturday night by Sarah Palin, where her husband was found to be bleeding from cuts on his head, according to an affidavit by Wasilla Police Officer Adam LaPointe. Todd Palin told police the dispute began when his son, Track Palin, 28, called to retrieve his truck. Palin, 53, said he told his son not to come over but was told that he would come anyway to “beat his ass,” LaPointe wrote, according to the Anchorage Daily News. The elder Palin said he fetched a pistol to protect his family. Track Palin told police he broke a window, disarmed his father and put him on the ground and hit him around the head, the newspaper reported. LaPointe wrote that the senior Palins had left the home when police arrived and that Sarah Palin was visibly upset. According to the Los Angeles Times, Sarah Palin called police at 8:30 p.m. and said her son was \"freaking out and was on some type of medication.\" Track Palin yelled at officers, calling them “peasants,” and “moved around in a strange manner” for about 15 or 20 minutes before being arrested without incident, the affidavit states. He said he had “consumed a few beers.” He was arraigned Sunday and charged with felony first-degree burglary and misdemeanor fourth-degree assault. He was still jailed at Mat-Su Pretrial Facility as of Monday evening, according to the Times. More:Track Palin, son of former Alaska Governor Sarah Palin, arrested for domestic violence, other charges More:Sarah Palin's husband hurt in 'very serious' accident More:Sarah Palin says arrested veteran son suffered PTSD More:Sarah Palin endorses Donald Trump for president Court records did not immediately list an attorney for him, the paper reported. He is scheduled for a preliminary hearing next week. Todd Palin, reached by the Daily News, declined to comment about the incident, other than to say, \"We're fine. We're fine.\" On Sunday, the Palins' attorney, John Tiemessen, released a statement saying: \"Given the nature of actions addressed last night by law enforcement and the charges involved, the Palins are unable to comment further. They ask that the family's privacy is respected during this challenging situation just as others dealing with a struggling family member would also request.\" The Associated Press contributed to this story.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Bristol Palin's husband, Dakota Meyer, files for divorce, cites 'conflict of personalities'",
      "url": "https://www.usatoday.com/story/life/people/2018/02/13/reports-bristol-palin-husband-files-divorce/335457002/",
      "subtitle": "Bristol Palin's husband, Dakota Meyer, files for divorce, cites 'conflict of personalities'",
      "author": "null",
      "content": "Bristol Palin's husband of less than two years has filed for divorce, according to People and TMZ. Dakota Meyer, a former U.S. Marine and Medal of Honor recipient, attempted to keep the media glare at bay by using only his and Palin’s initials in the court documents, which People obtained and posted Wednesday. The reason for their separation? \"Discord or conflict of personalities ... that destroys the legitimate ends of the marriage relationship and prevents any reasonable expectation of reconciliation,” the documents state. The paperwork was filed on Jan. 29 in a Travis County court in Austin. Meyer, 29, and Palin, 27, married in June 2016 and have two young daughters together, Atlee Bay, 9 months, and Sailor Grace, 2. After initially calling off their wedding, Palin and Meyer married six months after Sailor's birth, following public arguing over the collapse of their engagement in 2015, plus paternity and child-support issues. Meyer is still featured in a family photo on Palin's website, and one day ago Palin appeared cheery on her Instagram account, wishing her mother, former Alaska governor Sarah Palin, a happy birthday. On Jan. 7, Meyer posted a family photo on his Instagram with the caption, \"What matters.\" But in recent pictures on the couple's Instagram accounts, neither is wearing a wedding ring. Palin also has a 9-year-old son, Tripp, from her relationship with Levi Johnston. Since announcing her teenage pregnancy during her mother's 2008 vice presidential run, Palin has fashioned herself as a voice of conservative Christian values. On her website, she describes herself as \"Pro Life, Pro God, and Pro Guns.\" A recent post railed against the cancellation of a father-daughter dance in New York City over a new gender-neutral policy. \"Again and again, liberalism actually hurts girls,\" she wrote. A rep for Palin had no comment when reached by USA TODAY.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Student who hacked Sarah Palin's emails during 2008 campaign dies",
      "url": "https://www.usatoday.com/story/news/politics/2018/02/08/student-who-hacked-sarah-palins-emails-during-2008-campaign-dies/322013002/",
      "subtitle": "Student who hacked Sarah Palin's emails during 2008 campaign dies",
      "author": "null",
      "content": "MEMPHIS — David Kernell, the University of Tennessee-Knoxville student who guessed his way into Republican vice presidential nominee Sarah Palin’s personal email account in 2008, died last week in California. He was 30. Kernell, son of Shelby County Schools board member and former Democratic state representative Mike Kernell, died of complications related to progressive multiple sclerosis (MS) late Friday or early Saturday, his family confirmed in a statement Thursday. David Kernell, once ranked in the top 10% of chess players in the U.S., was a 20-year-old economics major at UT when he guessed the security answers to enter Palin's Yahoo! account, changed the password to \"popcorn,\" and then posted the new password, family photographs and some emails on the online message board 4chan under the pseudonym \"Rubico.\" More:Judge rejects Sarah Palin lawsuit against The New York Times More:Sarah Palin, Ted Nugent and Kid Rock visit the White House Kernell, who read that Palin may have conducted official business as governor of Alaska on her personal account, failed to find politically damaging information about Palin, who was Sen. John McCain's running mate at the time of the hacking. The case earned the younger Kernell searing criticism from Palin and her fans, with Palin comparing the hacking to Watergate, the 1972 break-in at the Democratic National Committee that gradually led to President Richard Nixon's resignation. At the trial, Palin described the hacking as \"the most disruptive and discouraging\" moment of the campaign. But federal jurors and a judge took a softer view of the infiltration. In 2010, after all but one of the felony charges were dropped, he served 10 months in a minimum-security prison for obstruction of justice after destroying evidence from his computer. He also was convicted of a misdemeanor for illegally accessing Palin's email. Between all the charges, Kernell had faced a maximum of five years in prison, a $250,000 fine and three years probation. After exiting prison in 2011, Kernell was released from U.S. Probation Office supervision in 2013. In a page-long statement regarding his death, the family said Kernell was diagnosed with MS in 2014 and participated in clinical research trials at the Cedars-Sinai Neurosciences Research Center in Los Angeles to help develop cures and treatments for other victims of MS. \"David did not let (the Palin) incident define him,\" the family said. \"He returned to UT Knoxville to complete his economics degree and further refined his programming skills by helping his local community. He first volunteered his expertise to Tennessee Voices for Children, a child advocacy non-profit group. Later, he moved to California and worked to develop facial recognition software that could identify children at risk of abuse.\" Wade Davies, a Knoxville attorney who represented Kernell in the case, declined to comment, saying he wanted to speak to Kernell's mother first. Davies argued during the trial that what Kernell did was closer to a prank — and one that wouldn't have been prosecuted as zealously if the victim hadn't been a rising Republican star. Allan Bogle, host of the program Into the Deep on radio station WEVL-FM, said he knew Kernell through the Memphis Chess Club and that he grew up to be a \"very smart guy.\" Bogle said Kernell used the same \"Rubico\" pseudonym to post Palin's information on 4chan as he used to play Bogle in online chess. \"For a brief period of time he was the most famous chess player in the country,\" Bogle said of the coverage of the Palin scandal. Before stepping into the national spotlight, Kernell graduated in 2006 from Germantown High School in the Memphis suburb of Germantown, where two years earlier he won the Tennessee Open Scholastic Chess Championship. Besides chess, Kernell enjoyed spearfishing, free diving, rock climbing, and wilderness exploration and online gaming, the statement reads. Rep. Jim Coley, Barlett Republican and family friend, said David was a good man, like his father and grandfather, Sam Kernell, who fought in both World War II and the Korean War. \"David picked up his good virtues from his father and his grandfather,\" Coley said. \"I was very sorry to learn about David's death.\" Services are being planned in Newport Beach, Calif., and in Germantown. Endowments in David’s honor are being set up at the Memphis Chess Club, Cedars-Sinai Neurosciences Research Center, and the Tennessee Voices for Children. Contributing: Jamie Satterfield, Knoxville (Tenn.) News Sentinel. Follow Ryan Poe on Twitter: @ryanpoe ",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin: McCain admitting he'd rather have had Lieberman as running mate was 'gut punch'",
      "url": "https://www.usatoday.com/story/news/politics/onpolitics/2018/05/11/sarah-palin-mccain-regret-running-mate-gut-punch/602569002/",
      "subtitle": "Sarah Palin: McCain admitting he'd rather have had Lieberman as running mate was 'gut punch'",
      "author": "null",
      "content": "Former Alaskan governor Sarah Palin says she was hurt hearing Sen. John McCain regretted choosing her as his running mate in the 2008 presidential election but doesn't fully believe the claim. Speaking with NBC News and the Daily Mail, Palin, the former vice-presidential candidate, talked about her relationship with the Arizona Republican who is battling terminal brain cancer. McCain's new book, which chronicles his career and bid for president in 2008, reportedly includes his regret with not choosing Joe Lieberman, then an independent senator from Connecticut, as his running mate in the 2008 race, which he lost to Barack Obama. McCain writes in the book that advisers counseled him against choosing Lieberman because of his past as a Democrat. Palin said she doesn't believe the claim and thinks ghostwriters were behind it. \"I attribute a lot of what we're hearing and reading regarding McCain's statements to his ghostwriter or ghostwriters,\" she told the Daily Mail. \"I don't know all the details of his condition right now. It happens to me also where people speak for me and a bell is rung, and you can't un-ring the bell.\" More:John McCain won't be buried with his father, grandfather at Arlington National Cemetery More:'He's dying anyway': White House official mocked Sen. John McCain, reports say More:John McCain, battling brain cancer, tells Biden to stay in politics She said she wouldn't believe the claim \"unless I heard it from Sen. McCain myself,\" Palin said. Palin told NBC News she has always had respect for McCain and his \"maverick nature,\" adding she has stayed close with his family over the years. \"You know, it is kind of sad to hear that he and or someone speaking for him does have regrets,\" she told NBC News. \"I want to live my life without any regrets. And I hope that he finds that kind of peace and contentment also to be able to look back on decisions and realize, really, things work out the way that they’re supposed to work out.\" Palin's comments come as reports that a White House aide joked about McCain's death, igniting a firestorm of criticism across on both sides of the aisle. \"It doesn't matter, he's dying anyway,\" press aide Kelly Sadler said about McCain's opposition to CIA nominee Gina Haspel at a meeting of White House communications staffers, according to an unnamed source cited by The Hill's Jordan Fabian. Other outlets later confirmed the remarks. Meghan McCain, the senator's daughter and a host on ABC's The View, said on the show Friday that she didn't understand how the White House could be an environment where someone could make a comment like that and  \"can come to work the next day and still have a job.\" Follow Christal Hayes on Twitter: Journo_Christal ",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Bristol Palin confirms 'Teen Mom OG' casting, is 'excited' to join MTV's reality show",
      "url": "https://www.usatoday.com/story/life/tv/2018/07/20/bristol-palin-mtv-teen-mom-og/806143002/",
      "subtitle": "Bristol Palin confirms 'Teen Mom OG' casting, is 'excited' to join MTV's reality show",
      "author": "null",
      "content": "Bristol Palin is headed to MTV's \"Teen Mom OG.\" The daughter of the former Governor of Alaska Sarah Palin will join the upcoming season of the series about women who gave birth at a young age, an MTV spokesperson confirmed to USA TODAY Friday. Palin confirmed the news herself in an Instagram also posted Friday. \"I am excited to join MTV's 'Teen Mom OG,'\" Palin wrote in the caption of a photo depicting her, her three children and a film crew. \"I look forward to sharing my experiences and hope that I can help others on their journey.\"  Palin, now 27, was pregnant when her mother ran for vice president of the United States on the Republican ticket during the 2008 presidential election. Palin was 18-years-old in December 2008 when she gave birth to her first child, Tripp Johnston, whose father is Palin's former fiancé Levi Johnston. Palin has two additional children with Dakota Meyer: Sailor Grace Meyer, 2 and Atlee Bay Meyer, 1. Palin and the 30-year-old Maine vet wed in June of 2016. Though Meyer reportedly filed for divorce in January citing \"discord or conflict of personalities,\" the pair hinted that they might've reconciled through recent and affectionate Instagram posts. Palin is no stranger to reality television, having starred in the Lifetime series \"Bristol Palin: Life's a Tripp\" (2012) and competed on Season 11 of \"Dancing with the Stars\" (2010). For \"Teen Mom OG,\" Palin will join cast members Maci Bookout, Catelynn Lowell and Amber Portwood when the show returns, Entertainment Tonight and Deadline report. More:'Teen Mom' star Farrah Abraham arrested for attacking Beverly Hills Hotel security guard More:Sarah Palin slams Showtime's statement on Sacha Baron Cohen: 'They continue to deceive' More:Whoopi Goldberg shuts down Jeanine Pirro for saying she has 'Trump Derangement Syndrome'      ",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin incensed over being 'duped' by Sacha Baron Cohen, calls his humor 'evil'",
      "url": "https://www.usatoday.com/story/life/tv/2018/07/10/sarah-palin-incensed-over-being-duped-sasha-baron-cohen/773585002/",
      "subtitle": "Sarah Palin incensed over being 'duped' by Sacha Baron Cohen, calls his humor 'evil'",
      "author": "null",
      "content": "Sarah Palin is the latest public figure to be tricked by notorious prankster and film star Sacha Baron Cohen, and she's not taking it lightly. Sunday, the British comedian is launching a new half-hour series, \"Who Is America?\" (10 EDT/PDT) on Showtime, and the seven-episode show appears to target politicians, tastemakers and cultural phenoms - without their knowledge. Palin was one of them. \"Yup - we were duped. Ya’ got me, Sacha. Feel better now?\" Palin wrote on Facebook Tuesday. \"I join a long list of American public personalities who have fallen victim to the evil, exploitive, sick \"humor\" of the British 'comedian' Sacha Baron Cohen.\" Palin goes on to explain she was duped into believing she would be honoring veterans during a “legit Showtime historical documentary,” for which Cohen \"had heavily disguised himself as a disabled US Veteran, fake wheelchair and all.\" Cohen, she wrote, subjected her to an interview full of \"disrespect and sarcasm - but finally (I) had enough and literally, physically removed my mic and walked out, much to Cohen’s chagrin.\" Palin, who brought her daughter to the shoot, challenged Showtime to air the footage, but asked those behind the production to donate all proceeds to a charitable group that supports veterans. (Proceeds may be hard to pinpoint; Showtime is a pay channel that does not air commercials.) \"Mock politicians and innocent public personalities all you want, if that lets you sleep at night, but HOW DARE YOU mock those who have fought and served our country,\" she wrote. \"Truly sick.\" Palin also accused Cohen's production team of \"purposefully\" dropping them off at the wrong Washington airport, \"knowing we’d miss all flights back home to Alaska.\" Showtime had no comment. But in Monday's announcement of the series, network president David Nevins called Cohen \"the premier provocateur of our time, but not for the sake of ‘gotcha’ moments. Behind the elaborate setup is a genuine quest for the truth about people, places and politics.\" Cohen, 46, previously explored America in the guise of Borat, a sexist Kazakh journalist, and Brüno, a flamboyant Austrian fashion reporter, on HBO's \"Da Ali G Show\" and two stand-alone movies. Contributing: Jayme Deerwester",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin slams Showtime's statement on Sacha Baron Cohen: 'They continue to deceive'",
      "url": "https://www.usatoday.com/story/life/tv/2018/07/16/sacha-baron-cohen-showtime-reject-sarah-palins-duped-criticism/790649002/",
      "subtitle": "Sarah Palin slams Showtime's statement on Sacha Baron Cohen: 'They continue to deceive'",
      "author": "null",
      "content": "Sarah Palin has responded strongly to Showtime's insistence that comedian Sacha Baron Cohen did not pose as an injured veteran to land a Palin interview. Palin took to Twitter Tuesday to call Showtime's statement \"more BS,\" a day after the cable network released it. The statement insisted that Baron Cohen \"never presented himself as a veteran of the U.S. military\" during the booking process or during the interview for his new show \"Who Is America?\" \"They continue to deceive as they have from day 1,\" Palin responded on Twitter. \"They continue to defend (and pay) a man...\" Palin initially started the media storm last week claiming on Facebook she had been \"duped\" for the \"sick\" interview.  The former vice presidential candidate wrote she was interviewed by Baron Cohen \"heavily disguised as a disabled US Veteran, fake wheelchair and all.\" The British comedian posed as one of his new characters, Billy Wayne Ruddick Jr., Ph.D. The Showtime statement Monday called Palin's claim part of \"widespread misinformation over the past week\" about the Ruddick Jr. character — who was first revealed on the show's premiere episode Sunday interviewing Senator Bernie Sanders from a motorized scooter. More:Sarah Palin incensed over being 'duped' by Sacha Baron Cohen, calls his humor 'evil' The first show featuring Ruddick Jr. proved Palin's claims were incorrect, according to Showtime. \"Baron Cohen did not present himself as a disabled veteran, and viewers nationwide who watched the premiere on Sunday can now attest to that,\" the network statement said. More:Sacha Baron Cohen's 'Who is America?' lures politicians into supporting guns for toddlers Also:Sarah Palin incensed over being 'duped' by Sacha Baron Cohen, calls his humor 'evil' In Sunday’s episode, Baron Cohen's Ruddick Jr. was asked by Senator Sanders if he was disabled, and he stated that he is not, but uses a scooter to conserve his energy. \"And contrary to her claims he did not appear in a wheelchair,\" the release said. \"In both the interview with Governor Palin and the interview with Senator Sanders, he did not wear military apparel of any kind.\" Baron Cohen had previously responded to Palin's claim from a @BillyWRuddick Twitter account in character. He wrote, \"I did NOT say I was a War Vet, I was in the service - not military, but United Parcel.\" Baron Cohen has duped politicians on the right and the left in his new show with new characters who include extreme liberal Dr. Nira Cain-N’Degeocello, freed criminal artist Ricky Sherman and anti-terror expert Erran Morad. If you love television and love talking about it even more, USA TODAY Life’s Yes, I'm Still Watching is here for you. Join our Facebook group to discuss all things TV with our critic Kelly Lawler.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sen. John McCain's 2008 running mate Sarah Palin not invited to his funeral, reports say",
      "url": "https://www.usatoday.com/story/news/politics/onpolitics/2018/08/30/john-mccain-funeral-sarah-palin-not-invited/1150484002/",
      "subtitle": "Sen. John McCain's 2008 running mate Sarah Palin not invited to his funeral, reports say",
      "author": "null",
      "content": "Sen. John McCain's 2008 running mate Sarah Palin and other members of the Arizona Republican's failed presidential campaign were not invited to his funeral or other memorial services, according to multiple media reports. The former Alaska governor, campaign manager Steve Schmidt, adviser Nicolle Wallace and strategist John Weaver were all left off the guest lists for  McCain's memorial services, Politico reported, citing three unnamed sources. \"Out of respect for Sen. McCain and his family we have nothing to add at this point. The Palin family will always cherish their friendship with the McCains and hold those memories dear,\" a source close to the McCain family told CNN and NBC News. It was unclear who made the final decisions on the guest lists, Politico said. \"John McCain was my friend,\" Palin tweeted Saturday after McCain died from brain cancer. \"I will remember the good times. My family and I send prayers for Cindy and the McCain family.\" In another tweet Saturday, Palin said, \"Today we lost an original. Sen. John McCain was a maverick and a fighter, never afraid to stand for his beliefs.\" In McCain's memoir, \"The Restless Wave: Good Times, Just Causes, Great Fights, and Other Appreciations,\" which published in May, he said he wished he had picked Democrat-turned-independent Joe Lieberman as his running mate instead of Palin. Palin told the Daily Mail that hearing reports of that excerpt was like a \"gut punch,\" although she said she attributed it to \"ghostwriters.\" More:Nation's capital prepares a hero's welcome for late Sen. John McCain Politico reported that McCain became angry with Schmidt for his criticism of the decision to select Palin, even though Schmidt had been one of the advisers advocating her for the VP slot. Schmidt and Wallace cooperated with the authors of the 2009 book \"Game Change\" (which was made into and HBO movie), which painted Palin in a very unflattering light. Weaver, the man behind McCain's \"Straight Talk Express,\" left the campaign in 2007 when McCain's primary run appeared doomed. The move not to invite Palin did not sit well with some conservatives. \"I don’t get that,\" said \"Fox & Friends\" host Brian Kilmeade Thursday. “It doesn’t make any sense.” \"If she’s good enough to be VP, she’s good enough to be at the funeral,\" one former aide told Politico. A memorial service for McCain was held Thursday in Phoenix before his body was flown to Washington, D.C. He will lie in state in the Capitol on Friday and a funeral service will be held at the National Cathedral on Saturday. He will be buried Sunday at the Naval Academy in Annapolis, Maryland.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "'I can see 2022 from my house': Palin taunts Murkowski ahead of Kavanaugh vote",
      "url": "https://www.usatoday.com/story/news/politics/2018/10/05/sarah-palin-taunts-sen-lisa-murkowski-ahead-brett-kavanaugh-vote/1536750002/",
      "subtitle": "'I can see 2022 from my house': Palin taunts Murkowski ahead of Kavanaugh vote",
      "author": "null",
      "content": "Alaska Sen. Lisa Murkowski, a crucial Republican swing vote in Brett Kavanaugh's confirmation to the Supreme Court, received a playful prodding from the former governor of Alaska on Twitter. \"I can see 2022 from my house,\" Sarah Palin tweeted on Friday afternoon, mentioning Murkowski. The tweet was widely viewed as a thinly-veiled threat to challenge Murkowski in her 2022 reelection campaign to the Senate. \"From my house\" references a 2008 Saturday Night Live sketch mocking Palin, then John McCain's running mate. To this day, many Americans believe it was Palin that said \"I can see Russia from my house\" when in fact the line was delivered by Tina Fey. Earlier this year, Palin expressed a willingness to run for public office again, according to The Hill. The publication reported that she told Fox News host Mark Levin in April that she was glad she joined the McCain ticket and would do it again \"in a heartbeat.\" On Friday Morning, Murkowski was the only Republican to vote against a procedural move advancing Kavanaugh's nomination. More:Sen. Susan Collins a 'yes' on Brett Kavanaugh, giving Republicans enough votes \"I believe that Brett Kavanaugh is a good man, I believe he is a good man. But it just may be that in my view he’s not the right man for the court at this time,\" she said Friday after the vote. “This has truly been the most difficult evaluation of a decision that I’ve ever had to make and I’ve made some interesting ones in my political career.” This isn't the first time Murkowski has faced the potential consequences of her votes. She lost the Republican primary to a Tea Party challenger in 2010, winning re-election with a write-in campaign instead. Contributing: Eliza Collins and Trevor Hughes, USA TODAY; Dan Nowicki, Arizona Republic ",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin mocks Ocasio-Cortez gaffe. Critics point to Palin's own history of errors",
      "url": "https://www.usatoday.com/story/news/politics/onpolitics/2018/11/20/sarah-palin-mocks-alexandria-ocasio-cortez/2068506002/",
      "subtitle": "Sarah Palin mocks Ocasio-Cortez gaffe. Critics point to Palin's own history of errors",
      "author": "null",
      "content": "Progressive Democrat Alexandria Ocasio-Cortez is quickly becoming the most recognizable face among Congress' incoming freshman class. From participating in a climate change protest at House Minority Leader Nancy Pelosi's office to being mistaken for an intern and wondering if she can afford an apartment in Washington, the incoming New York representative has been getting a level of media attention that could make veteran lawmakers green with envy. On Monday, the self-described democratic socialist drew some attention of the negative sort when conservative critics pounced on a video in which she refers to the \"three chambers of Congress\" and the \"three chambers of government,\" which she says are the \"presidency, the Senate and the House.\" It was unclear if she meant to refer to the three branches of government, which would be the executive, legislative and judicial. One of the conservatives who piled on Ocasio-Cortez was the 2008 Republican vice presidential candidate, Sarah Palin. \"YIKES: Ocasio-Cortez Fumbles Basic Civics TWICE In 1 Statement,\" the former Alaska governor tweeted, along with a link to a story on her website about Ocasio-Cortez's gaffe. But Twitter users were quick to say that Palin had little right to be critical given her own well-documented history of mistakes, misstatements and misunderstandings, which includes a claim that she had foreign policy credentials because Russia was near Alaska and a reference to our \"North Korean allies.\" In response, Ocasio-Cortez tweeted that Republicans should focus on her argument rather than \"waiting to chop up word slips that I correct in real-tomd,\" adding a typo to her woes. In another tweet, she said two \"fallen GOP Vice Pres candidates\" had now gone after her. (She later clarified the other was Al Gore's running mate, Joe Lieberman, whom she considers a Republican.) and she compared Palin's tweet to \"grandpa emails\" from 2008.  This weekend, Ocasio-Cortez also drew some more media attention with a tweet proposing to swap the Columbus Day federal holiday for one on Election Day. On Saturday, the woman is about to become the youngest person serving in Congress at 29 wondered, \"How is Columbus Day a holiday but Election Day not?\" Daily Mail editor David Martosko quipped that Ocasio-Cortez \"hasn't even started the job yet and she's already angling for more vacation days.\" In response, she tweeted that she disagreed \"that Americans get too much vacation time\" and said Americans get less time off than people in most other developed nations.\" \"I am willing to compromise by eliminating Columbus Day to give Election Day off,\" she said. \"See? I can be pliant.\" \"One of the requirements of public service should be a sense of humor,\" Martosko tweeted back. Ocasio-Cortez's first days in Congress:Treated as intern, clothing criticized More:Ocasio-Cortez says Fox News segment on her rent struggles mocked the middle class More:On her first day of orientation on Capitol Hill, Alexandria Ocasio-Cortez protests in Pelosi's office ",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "'Gut punch': Sarah Palin embarrassed she wasn't invited to John McCain's funeral",
      "url": "https://www.usatoday.com/story/news/politics/2019/04/03/sarah-palin-getting-disinvited-sen-john-mccain-funeral-gut-punch-good-morning-britain/3350531002/",
      "subtitle": "'Gut punch': Sarah Palin embarrassed she wasn't invited to John McCain's funeral",
      "author": "null",
      "content": "Sarah Palin called it a \"gut punch\" to be \"publicly disinvited\" to Sen. John McCain's funeral last year. Palin, the former Alaska governor, was McCain's running mate in the 2008 presidential election and was the first woman nominated by the Republican Party to be vice president. In a television interview on \"Good Morning Britain\"on Monday, Palin said she was surprised to find she was on the list of people who had been close with McCain who didn't get an invite to the funeral. \"They didn't have to embarrass me and embarrass others,\" she said. \"And it wasn't just me, it was other good people in our campaign back in 2008 who were very, very loyal to Senator McCain.\" Cindy McCain:Late senator's wife tweets aggressive message she received about husband, Meghan McCain McCain-Trump feud:What's driving the feud? War record, Obamacare among the themes In \"The Restless Wave,\" his final memoir, out in April 2018, McCain, R-Ariz., said he regretted choosing Palin as his running mate. He said he wished he had gone with his friend former Sen. Joseph Lieberman, I-Conn. But in the same book, McCain defended Palin. \"She stumbled in some interviews, and had a few misjudgments in the glare of the ceaseless spotlight and unblinking cameras,\" McCain wrote. \"Those missteps, too, are on me. She didn't put herself on the ticket. I did. I asked her to go through an experience that was wearing me down, that wears every candidate down. I made mistakes and misjudgments, too.\" Palin attributes the ridicule she faced during and after the 2008 race to a poorly run presidential campaign. The GOP ticket lost to Democrats Barack Obama and Joe Biden. \"They were looking for someone to blame for the really crappy type of campaign they ran,\" she said. \"And I was a scapegoat. So that's just in the past, though. Sometimes you win, sometimes you learn, and I certainly learned through that.\" Palin said she and the six-term senator had \"a perfectly fine relationship,\" and their families got along. She said she corresponded with Meghan McCain, McCain's daughter, expressing her condolences about McCain's illness, a deadly form of brain cancer. McCain died Aug. 25. \"I heard it from the media – I didn't hear it from him – that he was disappointed,\" Palin said. While he was alive, McCain was always complimentary of Palin in his public remarks. \"Sarah and I have maintained a very close and warm relationship,\" he told The Arizona Republic in 2014. Follow Alexis Egeland on Twitter @alexis_egeland.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin's defamation lawsuit against New York Times back from the dead",
      "url": "https://www.usatoday.com/story/news/nation/2019/08/06/new-york-times-faces-reinstated-sarah-palin-defamation-lawsuit/1931916001/",
      "subtitle": "Sarah Palin's defamation lawsuit against New York Times back from the dead",
      "author": "null",
      "content": "NEW YORK — An appeals court has revived a defamation lawsuit Sarah Palin brought against The New York Times. The 2nd U.S. Circuit Court of Appeals restored the lawsuit Tuesday, saying Palin must be allowed to collect evidence to support her claims. Still, it said Palin's burden of proof was high to show the Times acted with actual malice when it published an editorial titled \"America's Lethal Politics\" in 2017. The onetime Republican vice presidential nominee sued over the editorial published after a gunman opened fire on Republican lawmakers in Virginia, wounding U.S. Rep. Steve Scalise. The Times' editorial was corrected twice when readers complained it appeared to blame a political action committee belonging to Palin for \"political incitement.\" A Times' spokesperson says the newspaper is disappointed and will vigorously fight the lawsuit. 'Headline was flawed':New York Times changed headline about Trump after backlash",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Citing 'incompatibility,' Sarah Palin's husband wants divorce, according to reports",
      "url": "https://www.usatoday.com/story/news/politics/2019/09/09/documents-appear-show-sarah-palins-husband-wants-divorce/2268107001/",
      "subtitle": "Citing 'incompatibility,' Sarah Palin's husband wants divorce, according to reports",
      "author": "Savannah Behrmann",
      "content": "WASHINGTON -- It appears Todd Palin, the husband of former Alaska Gov. and 2008 Republican VP nominee Sarah Palin, is filing for divorce, the Associated Press and the Anchorage Daily News reported Monday. The court documents appear to show that Todd Palin asked to dissolve the 31-year-marriage, citing “incompatibility of temperament between the parties such that they find it impossible to live together as husband and wife,” according to the Anchorage Daily News. The documents use their initials instead of full names: T.M.P against S.L.P, respectively, as Todd’s middle name is Mitchell and Sarah’s is Louise, the AP reported. The documents accurately cite the Palins' marriage date as August 29, 1988, and the birthdates for the couple correspond as well, the AP also reported. The documents also list a child under initials T.P.V.P born April 18, 2008, also according to the AP. The youngest Palin child, Trig Paxson Van Palin, was born that day. The rest of the couple's children are over the age of 18. Sarah Palin rose overnight to national prominence when John McCain tapped her to run as his VP in 2008 on the GOP ticket against Barack Obama and Joe Biden. The divorce filing was first reported by Anchorage blogger Craig Medred and the Anchorage Daily News.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin through the years",
      "url": "https://www.usatoday.com/picture-gallery/news/politics/2017/02/21/sarah-palin-through-the-years/98214318/",
      "subtitle": "Sarah Palin through the years",
      "author": "null",
      "content": "",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    }
  ]
}