{
  "articles": [
    {
      "title": "Isabel Toledo, fashion designer who made Michelle Obama's inauguration ensemble, dies at 59",
      "url": "https://www.usatoday.com/story/entertainment/celebrities/2019/08/26/isabel-toledo-dies-designed-michelle-obamas-inauguration-ensemble/2123141001/",
      "subtitle": "Isabel Toledo, fashion designer who made Michelle Obama's inauguration ensemble, dies at 59",
      "author": "null",
      "content": "NEW YORK — Isabel Toledo, the Cuban-American fashion designer with an avant-garde flair who created former first lady Michelle Obama's standout lemongrass-colored sheath dress and matching overcoat for her husband's 2009 inauguration, has died. She was 59. Toledo died of breast cancer, her studio said in an email. Further details were not immediately available. Though she presented her first collection in 1985, Toledo's work grabbed attention after Obama wore some of her looks at the inauguration, including the lemongrass shift dress in wool and lace. Born in Cuba, Toledo arrived in West New York, N.J., as a teenager, later attending but not graduating from fashion college. She met her Cuban-born husband, the fashion illustrator and painter Ruben Toledo, in high school. An avid seamstress from a young age, Toledo attended New York's Fashion Institute of Technology and Parsons School of Design, where she studied painting, ceramics, and fashion design. She was an independent designer but served briefly as creative director for Anne Klein. On the day of President Barack Obama's inauguration, Jan. 20, 2009, Toledo, her husband and their team were stunned to see the new first lady wearing one of her creations. “We’re levitating – we really are,” Ruben Toledo told WWD, minutes after watching Obama on TV. The husband-wife team tuned in surrounded by their staff in their New York showroom. They had not known what Obama planned. “We had no idea. We hoped she would wear something because she has bought Isabel’s clothes before. We never know what’s going to happen,” he said. “It’s just another shock, but a great shock.” The fashion world began mourning on social media. \"The fashion world has lost today a rainbow of talent and joy. RIP my friend Isabel Toledo. You and your husband Ruben inspired of all us. You created magic and showed us how love is the most powerful tool to create fantasy. Today is a sad day,\" posted Elle magazine editor and Project Runway judge Nina Garcia. The Toledos were known as an art couple as much as a fashion couple; eventually they became a true power couple in the design world as the embodiment of the intersections between fashion and art. \"What matters is to have free expression always,\" a philosophy they said they learned after meeting Andy Warhol by accident in 1977. Several of their museum exhibits focused on this theme: In 2000, \"Isabel and Ruben Toledo: A Marriage of Art and Fashion,\" opened at Kent State University Museum. For an exhibit that opened at the Detroit Institute of Arts in December, they created clothing, sculptures, paintings and illustrations for a show, titled “A Labor of Love,” that highlighted the synergy between fashion and art. She designed clothing to complement permanent artworks already on display in the museum’s galleries, and he painted and illustrated accompanying imagery to works like Diego Rivera’s famous Detroit murals. The result was a \"charmingly eclectic exhibition imbued with humor and pathos, in which the Cuban-American couple riffed on everything from the Diego Rivera \"Detroit Industry\" murals to art in the Egyptian and Early American galleries,\" said Michael H. Hodges, the Detroit News' fine arts writer. In \"Synthetic Cloud,\" sky-blue dresses with puffy tulle skirts were suspended above a sculpture by Donald Judd and a Frank Stella geometric painting. The effect is like “a soft, poetic mist floating above you,” Ruben Toledo told New York Magazine's The Cut. “They become like flowers floating up in the sky.” For the fashion world, Isabel Toledo was a low-key designer who shunned the limelight and cared more about craft and construction than the lure of fame. But at the Fashion Institute of Technology, museum director Valerie Steele considered her a \"genius.\" In 2009, the FIT museum featured a mid-career retrospective of Toledo's work, \"Fashion from the Inside Out.\" On the wall at the entrance to the exhibit was a quote from the designer: \"I never thought of myself as a designer. I'm a seamstress.\" Contributing: Maria Puente, USA TODAY",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Barack Obama's game-worn high school basketball jersey up for auction",
      "url": "https://www.usatoday.com/story/sports/highschool/2019/07/27/barack-obama-high-school-basketball-jersey-auction/39815723/",
      "subtitle": "Barack Obama's game-worn high school basketball jersey up for auction",
      "author": "null",
      "content": "Long before President Barack Obama ran the Oval Office, he ran the high school basketball court. His game-worn No. 23 jersey from the Punahou High School (Honolulu) 1978-79 championship team is up for auction at Heritage Auctions. The starting bid was $25,000. As of Saturday afternoon, it sat at $26,000. Heritage estimates it could sell for as much as $100,000. The jersey, white with blue print, has Punahou and the number on the front in large print. The back has the number, and the sides have two blue stripes around a yellow one. It is slightly faded and has small stains, according to the auction site. According to Heritage, the jersey was saved by \"consignor Peter Noble, three years behind Obama at Punahou, (who) had worn the same number '23' jersey while on the junior varsity team.\" Obama has remained involved in basketball since high school. During his presidency, he regularly shared his March Madness picks, and he recently partnered with Toronto Raptors general manager Masai Ujiri and Ujiri's foundation, Giants of Basketball, to help spread basketball to youth in Africa. Now, you can be part of the bidding to acquire a jersey from the 44th president's youth. The auction ends Aug. 17.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Happy 58th birthday, Barack Obama! The former president's life in pictures",
      "url": "https://www.usatoday.com/picture-gallery/life/2019/08/04/president-obama-barack-58-birthday/1895580001/",
      "subtitle": "Happy 58th birthday, Barack Obama! The former president's life in pictures",
      "author": "null",
      "content": "",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "More than 260,000 people sign petition to rename street in front of Trump Tower after Obama",
      "url": "https://www.usatoday.com/story/news/politics/2019/08/14/petition-aims-rename-trump-tower-new-york-city-streets-obama/2006420001/",
      "subtitle": "More than 260,000 people sign petition to rename street in front of Trump Tower after Obama",
      "author": "Nicholas Wu",
      "content": "A petition on MoveOn.org to rename a New York City street in front of Trump Tower after former President Barack Obama has attracted more than 260,000 signatures. The petition, addressed to New York City Mayor Bill de Blasio and the City Council, requests that \"the stretch of Fifth Avenue between 56th and 57th Streets be renamed 'President Barack H. Obama Avenue.'\" Trump Tower is at 725 5th Avenue. \"I honestly started it as a joke,\" Elizabeth Rowin, the petition's organizer said to Newsweek. \"I saw a comedian joke about how it would make Trump so mad if it was named after former President Obama and thought why not.\" The petition is unlikely to succeed, though. According to a 2012 city video outlining New York City's street renaming rules, the honoree must be deceased and have the support of a petition signed by 75% of the local residents. Obama, while out of political office, is not deceased. Furthermore, the local community board has placed a moratorium on street renaming, District Manager Wally Rubin told USA TODAY. “I am sure the conditions can be changed,” Rowin told Newsweek when the outlet asked her about the city's prohibitions on renaming streets after living people. Rowin added that “These laws are arbitrary and can be worked around.” The tactic of renaming a street after a figure's political opponent is not uncommon. In Washington, D.C. petitioners had the street in front of the Russian embassy named after murdered opposition leader Boris Nemtsov. Petitioners have also advocated for the street in front of the Saudi Arabian embassy to be named after murdered journalist Jamal Khashoggi.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Obama recommends Toni Morrison and other authors in summer reading list",
      "url": "https://www.usatoday.com/story/news/politics/2019/08/14/barack-obama-pays-tribute-toni-morrison-summer-reading-list/2015715001/",
      "subtitle": "Obama recommends Toni Morrison and other authors in summer reading list",
      "author": "Rebecca Morin",
      "content": "WASHINGTON – A week after Toni Morrison passed away, former President Barack Obama offered a unique tribute to the revered, award-winning author: recommending her body of work to his millions of followers online. Obama shared his 2019 summer reading list Wednesday on Instagram, where he chose to highlight Morrison's collected works. Morrison, the first African American woman to win the Nobel Prize for Literature, died last week at the age of 88. In 2012, Obama awarded Morrison the Presidential Medal of Freedom, which is the nation's highest civilian honor. More:Toni Morrison, Nobel Prize winner, author of 'Beloved,' dies at 88 In the caption of his post, Obama wrote that it was a list of \"a few books I've been reading this summer, in case you're looking for some suggestions.\" \"To start, you can't go wrong by reading or re-reading the collected works of Toni Morrison,\" he wrote in the caption of the list he shared on Instagram. \"Beloved, Song of Solomon, The Bluest Eye, Sula, everything else — they're transcendent, all of them. \"You’ll be glad you read them,\" he added. Last week following the announcement of her death, Obama wrote in a tweet that Morrison \"was a national treasure, as good a storyteller, as captivating, in person as she was on the page,\" More:Cardi B to Bernie Sanders: 'What are we going to do about wages in America?' \"Her writing was a beautiful, meaningful challenge to our conscience and our moral imagination. What a gift to breathe the same air as her, if only for a while,\" he continued in the tweet. In addition to Morrison's collected works, 10 other books made Obama's 2019 summer reading list: Like what you’re reading?:Download the USA TODAY app for more",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "The first film from the Obamas’ production company is fantastic; here's what to expect next",
      "url": "https://www.usatoday.com/story/entertainment/movies/2019/08/21/obamas-first-netflix-film-here-what-expect-next/2071794001/",
      "subtitle": "The first film from the Obamas’ production company is fantastic; here's what to expect next",
      "author": "Carly Mallenbaum",
      "content": "If their first film from is any indication, more fantastic movies and shows are on the way from former President Barack and Michelle Obama's new production company. The Obamas launched Higher Ground Productions last spring in partnership with Netflix, promising a company that would \"harness the power of storytelling\" and touch on \"issues of race and class, democracy and civil rights, and much more.\" \"American Factory,\" the first title from Higher Ground, is available now on the streaming service. It manages to make good on the Obamas' pledge, which is a promising sign for what's to come. The documentary, which won a directing award earlier this year at Sundance Film Festival, tells the story of how a Chinese billionaire opens a glass factory in a former General Motors plant in Dayton, Ohio, and hires both American and Chinese people to work there. The film looks at how their cultures clash (with the Chinese workers getting lessons in how Americans are overconfident and need to be praised), how the workers are taken advantage of by management (they're convinced not to join a union for the security of their jobs) and how automation could take many of their jobs. Through the emotional stories of some of the workers, and even the billionaire chairman himself, the documentary winds up being funny, shocking, upsetting and eye-opening. The film works well without a central narrator, allowing the people themselves to tell their stories. There's also plenty of How did they get that?! insider footage, courtesy of Dayton-based co-filmmakers Julia Reichert and Steven Bognar. At almost two hours, the documentary doesn't drag. Instead, it sets an impressive precedent for the Obamas' forthcoming projects. What else does Higher Ground have in the works? Here's what's planned so far: A new drama series about the fashion world: \"Bloom\" will show the struggles faced by women of color in post-World War II New York. It's written and produced by Academy Award winner Callie Khouri (\"Thelma & Louise\"). A biopic about Frederick Douglass: Higher Ground plans to adapt the Pulitzer Prize-winning biography \"Frederick Douglass: Prophet of Freedom\" into a movie about the abolitionist and statesman who was born into slavery. An anthology series about unnoticed deaths: \"Overlooked\" will be a scripted show adapted from The New York Times' column of the same name that looks to correct the issue of obituaries primarily being written about white men. A traveling kids' food show: \"Listen to Your Vegetables & Eat Your Parents\" is a half-hour preschool series from creators Jeremy Konner (“Drunk History”) and Erika Thormahlen that will tell the story of food. A Michael Lewis nonfiction series: The show will be based on \"The Fifth Risk: Undoing Democracy,\" the book by the best-selling \"Moneyball\" and \"The Big Short\" writer about everyday heroes safeguarding the nation. A documentary about camp for disabled teenagers: \"Crip Camp\" will tell the story of how a ramshackle summer camp down the road from Woodstock transformed young lives in the early '70s. Coming to Netflix:Ryan Murphy's 'The Politician,' 'Between Two Ferns' movie and more",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Evoking 1968, Joe Biden asks New Hampshire voters: What if Barack Obama had been assassinated in 2008?",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/08/23/joe-biden-n-h-what-if-barack-obama-had-been-assassinated-2008/2101949001/",
      "subtitle": "Evoking 1968, Joe Biden asks New Hampshire voters: What if Barack Obama had been assassinated in 2008?",
      "author": "Savannah Behrmann",
      "content": "WASHINGTON -- Joe Biden, the former vice president and current front-runner in the sprawling Democratic primary field of more than 20 candidates, asked a curious question of New Hampshire voters at Dartmouth College on Friday: What if Barack Obama had been assassinated? During a discussion of mental health and school shootings at a health care town hall in Hanover, the former VP turned to his collegiate days, and spoke of the assassinations of his “political heroes,” Martin Luther King Jr. and Robert F. Kennedy, who were assassinated within weeks of each other. Biden said, \"My senior semester, they were both shot and killed. Imagine what would have happened if, God forbid, if Barack Obama had been assassinated after becoming the de facto nominee. What would've happened in America?\" The comments were reported on by multiple media outlets, including the New York Times, NBC, the Associated Press and the Washington Post. The startling question came a day after Biden posted on Twitter posted about when Obama asked him to become his running mate in 2008. The 76-year-old served as Obama’s vice president for the entirety of Obama's time in the Oval Office from 2009-2017. Only three days earlier at an event in Iowa, Biden initially misspoke, saying that Kennedy and King had been shot “in the late 1970’s” instead of 1968. Of Biden's New Hampshire comments Friday, the New York Times reports he was trying to make a point about becoming politically aware and motivated in the turbulent times of the 1960s and 1970s, discussing the deadly Kent State shootings during a Vietnam War protest in 1970. He successfully ran for Senate in 1972 when he was 29 years old. Biden also said Friday he was accused of being gay decades ago because he supported women's rights, referring to the Equal Rights Amendment. \"An entire generation was energized. We finally finished the Voting Rights Act. We finally got the Civil Rights Act back on the road. We finally were in a position where we started to begin the women’s movement, and began to treat women — I remember because I was such a big supporter of the E.R.A. in 1972, quote — to show you how things have changed, thank God — 'Well, you know why Biden is for the E.R.A., he’s probably gay.' Not a joke,\" Biden recalled. During a campaign event in Nashua, N.H., on Monday, Dr. Jill Biden, Biden's wife and the former second lady, said that Democrats should vote in the upcoming primaries and caucuses for who will ultimately beat President Donald Trump even if they don't agree fully with all of Joe Biden's policy stances. “I know that not all of you are committed to my husband, and I respect that,” she said. “But I want you to think about your candidate, his or her electability, and who’s going to win this race.” Biden is seeking the Democratic nomination for president for a third time after two failed runs in 1988 and 2008.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Donald Trump re-ups desire for Russia to join G7, says Putin 'outsmarted' Barack Obama",
      "url": "https://www.usatoday.com/story/news/politics/2019/08/26/donald-trump-russia-g-7-vladimir-putin-outsmarted-barack-obama/2121185001/",
      "subtitle": "Donald Trump re-ups desire for Russia to join G7, says Putin 'outsmarted' Barack Obama",
      "author": "John Fritze",
      "content": "BIARRITZ, France – President Donald Trump doubled down on his support Monday for Russia returning to the G-7, telling reporters gathered for the group’s annual meeting that he isn’t concerned about the political blow back of such a move on him. Russia had been a member of the group – which at the time was known as the G-8 – but was ousted in 2014 because of its annexation of Crimea. Trump has repeatedly floated the idea of bringing Russia back into the fold to ease negotiations on global issues. Trump dismissed the notion that he would face criticism for advocating for Russia. Much of his presidency has been overshadowed by questions about Russian involvement in the 2016 election on his behalf. An investigation by special counsel Robert Mueller found that neither Trump nor his campaign conspired with those efforts. \"I don't do things for political reasons,\" told reporters Monday. \"Is it good? Probably not. Maybe it is,\" Trump said of allowing Russia to join the group of the most industrialized countries. \"A lot of people say having Russia – which is a power – having them inside the room is better than having them outside the room.\" Minutes later, Trump re-upped a claim that Russia was dropped from the group because Russian President Vladimir Putin had \"outsmarted\" then President Barack Obama. \"He was outsmarted,\" Trump said. The decision to expel Russia was backed not only by the U.S. but also by the group's other six member countries. The G-7 includes the United States, Canada, France, Germany, the United Kingdom, Japan and Italy. Trump has repeatedly heaped praise on Putin, telling a Russian television reporter as recently as June that Putin is \"a great guy,\" despite the conclusion of U.S. intelligence agencies that Russia interfered in the 2016 presidential election.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Kentucky coach John Calipari plays 'greatest round of golf' with Obama",
      "url": "https://www.usatoday.com/story/sports/ncaab/sec/2019/08/26/college-basketball-kentuckys-john-calipari-barack-obama-play-golf/2121526001/",
      "subtitle": "Kentucky coach John Calipari plays 'greatest round of golf' with Obama",
      "author": "Sarah Ladd",
      "content": "Kentucky basketball coach John Calipari went golfing over the weekend with former President Barack Obama and his fans couldn't get enough. Calipari — coach Cal — posted photos with Obama on the green Friday and wrote that the two played a round of golf and spent four hours talking in the golf cart at Farm Neck Golf Club at Martha's Vineyard, a favorite spot for presidents to tee off and a longtime favorite of Obama's. \"‪It was the greatest round of golf that you could ever play and all I can say is that he is a really serious golfer!\" the Kentucky coach wrote in an Instagram and Facebook post. \"He played well!‬\" The post got around 25,000 reactions on Facebook with fans both elated and upset. Later, Calipari posted that Robert Wolf, who worked in the Obama administration on the Economic Recover Advisory Board, had set up the golf match. Wolf tweeted a photo of himself and Calipari Saturday and wrote, \"And can you believe this guy @UKCoachCalipari also sank the putt on 18 & happily took my money - ouch.\" The former president and the Kentucky coach go way back. In 2010, Obama called Calipari to talk about the Kentucky Wildcats' Hoops for Haiti fundraiser in which the team raised more than $1 million during a basketball tournament to donate to relief efforts after a 7 magnitude earthquake ravaged the country. In 2012, after Kentucky won the national title, Calipari visited the White House and Obama. Calipari has also met with Kentucky Gov. Matt Bevin, President George Bush, President Bill Clinton, Sen. Majority Leader Mitch McConnell, House Speaker Nancy Pelosi and Kelly Craft. He told the Courier Journal in 2017 that when he has a chance to meet with presidents, he will. \"If I’ve got a chance to do it, I’m going to sit down with the president, whoever that president might be.\"",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Barack Obama's playlist has a hot girl summer vibe with Lizzo, Beyonce and The Rolling Stones",
      "url": "https://www.usatoday.com/story/news/nation/2019/08/24/barack-obamas-summer-playlist-has-bops-beyonce-lizzo-and-others/2108325001/",
      "subtitle": "Barack Obama's playlist has a hot girl summer vibe with Lizzo, Beyonce and The Rolling Stones",
      "author": "Olivia Sanchez",
      "content": "Barack Obama gave the internet a glimpse into his post-White House life Saturday when he took to Twitter to list his top summer jams. The 44th president of the United States shared a 44-song summer playlist packed with new and old hits. In a tweet, he said the songs are a sampling of what he and wife Michelle Obama have been listening to as the summer winds down. The power couple gets down to oldies like \"I've got you under my skin,\" by Frank Sinatra and \"Brown eyed girl\" by Van Morrison, while also keeping up with their Gen Z daughters, with nods to \"Señorita\" by Camila Cabello and Shawn Mendes, \"Old Town Road,\" by Lil Nas X and Billy Ray Cyrus, and \"Juice\" by Lizzo. The pop-filled playlist also features Drake and Rihanna, Ella Fitzgerald and The Black Keys. Obama also included several hopeful anthems, including \"Hold On (Change is Coming)\" by Sounds of Blackness, and \"I'll Be Around\" by The Spinners. His tweet drew responses from supporters who praised his mainstream musical tastes. Several recording artists highlighted by the the former president also weighed in. \"WE’RE FRIENDS NOW I DONT MAKE THE RULES!!!\" Lizzo tweeted to Obama. GoldLink, an underground rapper from Washington, D.C., tweeted, \"Thank You, Mr. President.\" Lizzo seems to be popular among several 2020 Democratic presidential hopefuls — Kirsten Gillibrand has used \"Good As Hell\" as her walkout song at some rallies, and shared a video of her dancing to the song on her campaign bus. The popular song also makes an appearance on Cory Booker's campaign rally playlist, according to a musical analysis from The New York Times. Obama's playlist features other artists that can also be heard at various campaign rallies — he appears to share a fondness for Stevie Wonder with California Sen. Kamala Harris, and a love for The Rolling Stones with Beto O'Rourke of Texas and President Donald Trump.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Lizzo is 'NOT OK' after Barack Obama tweets about her following her rant on ageism in politics",
      "url": "https://www.usatoday.com/story/entertainment/celebrities/2019/08/24/barack-obama-tweeted-lizzo-and-she-not-ok-bernie-sanders/2108710001/",
      "subtitle": "Lizzo is 'NOT OK' after Barack Obama tweets about her following her rant on ageism in politics",
      "author": "Sara M Moniuszko",
      "content": "Lizzo just took a DNA test and she is 100 percent \"NOT OK.\" In a thread the singer posted to Twitter on Saturday about her thoughts on ageism in the presidential race, she mentioned Barack Obama was the first president she ever voted for – and then, much to her surprise, Obama tweeted about her. The former president listed Lizzo's track \"Juice\" as one of the songs he and his wife, former first lady Michelle Obama, have been listening to this season in a \"Summer Playlist 2019\" he shared to his followers. \"The first President I could ever vote for was Obama. I was so proud of my right to vote and I will never take it for granted. I love us,\" she wrote. \"I’m not sure who I’m voting for yet, but it for damn sure isn’t Trump.\" Then, just hours later, she realized Obama mentioned her in his list. \"I TWEETED THIS AT 10:26AM AND ONE HOUR LATER PRESIDENT  @BarackObama TWEETED ABOUT ME!!!\" she wrote, expressing her excitement in all caps. \"WE’RE FRIENDS NOW I DONT MAKE THE RULES!!!\" She also shared a fan's message about the Obama tweet with a status update. \"IM NOT OK !!!!!!!!\" Lizzo wrote. Earlier in her Twitter thread, Lizzo ranted about ageism in the political sphere. \"I hear a lot of about Bernie Sanders being 'too old' to run or be president... but we’ve currently got a 73-year old in office so drop the ageism (expletive) and just listen to what he’s got to say,\" she tweeted, referring to Sanders, a Vermont independent, and President Donald Trump, a Republican. She also called Sen. Elizabeth Warren, D-Mass., a \"dope candidate.\" \"I’m just sayin we worried bout the wrong things let’s just listen to the policies and stop talkin bout the (expletive) that don’t matter ya know,\" she noted. She then clarified that she wasn't making any official endorsements with her tweets. \"It’s a call to action for us to focus and get unified as a party... we need to figure out how to get trump out of office and it ain’t by talkin about Bernie Sanders’ age,\" she said. 'I just took a DNA test...':Twitter loves Hillary Clinton's 'epic' 'Truth Hurts' tweet More Lizzo: The flute-playing singer is back in the studio with a 'really different' sound",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Corden endorses Barack Obama Avenue in Best of Late Night",
      "url": "https://www.usatoday.com/story/opinion/best-of-late-night/2019/08/19/corden-endorses-barack-obama-avenue-best-late-night/2050388001/",
      "subtitle": "Corden endorses Barack Obama Avenue in Best of Late Night",
      "author": "Eileen Rivers",
      "content": "What better road for President Donald Trump to live on than one named after his predecessor? A group of New Yorkers is petitioning Mayor Bill de Blasio to rename part of Fifth Avenue, more specifically the part that houses Trump Tower, after former President Barack Obama. Petitioners are looking for 450,000 signatures before they submit the petition and they're getting scarily close to that goal. In fact, they got one step closer last week, after late-night comic James Corden said he would add his signature to the mix. Corden even suggested an interesting name for the next cross street. Take a look at today's Best of Late Night, above, to find out how that stretch of road might plague the president. And what's Obama reading this summer? The late-night comics discuss. After you watch our favorite jokes, vote for yours in the poll below. Follow Eileen Rivers on Twitter @msdc14.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Zach Galifianakis regrets asking Obama this 'Between Two Ferns' question",
      "url": "https://www.usatoday.com/story/entertainment/movies/2019/09/21/behind-scenes-between-two-ferns-celebrity-interviews/2368839001/",
      "subtitle": "Zach Galifianakis regrets asking Obama this 'Between Two Ferns' question",
      "author": "Carly Mallenbaum",
      "content": "\"Between Two Ferns: The Movie\" on Netflix (streaming now) presents a star-studded probable finale to the viral internet reign of the absurdist Funny or Die show of the same name, sending host Zach Galifianakis and his parody public-access series on a road trip. But before the series, which began more than 10 years and 20 episodes ago, takes its signature plants out of the spotlight, we asked for some dirt. Galifianakis and the film's director, Scott Aukerman, took USA TODAY behind the ferns for some insider tidbits about the series, from jokes that barely survived, stars that almost were on the show and a back story on the show's problematic theme song. Though Galifianakis plays a contemptuous interviewer unafraid to ask celebrities inappropriate questions in “Ferns,” in real life the comedian refused certain jokes. That is, until Aukerman convinced him otherwise. For example, Galifianakis balked at asking Natalie Portman: “You shaved your head in 'V for Vendetta,' did you also shave your V for vagina?” “I thought that that question was too much. I actually asked them to edit that out,”  Galifianakis says. After that interview, the “Ferns” co-creators developed a “good cop/bad cop” dynamic, as Aukerman puts it. “He reads the paper and goes, ‘Oh, I'm not going to say this,’ and then looks to me,\" and Aukerman will adamantly insist Galifianakis ask the question. This happened in 2014 when he interviewed Barack Obama and asked, “How does it feel to be the last black president?” “Ferns” rules require guests to come on the show without knowing the questions beforehand. When the camera rolls, Galifianakis improvises and riffs on prewritten questions. Celebrities just have to react. Ahead of the 2016 presidential election, Hillary Clinton’s camp wanted the nominee to do a “Ferns” interview, but “they didn't want to do it the way that we normally do,” with Clinton going into the interview blind. Aukerman refused and Clinton ultimately agreed to his terms. But her team was scared about how it would turn out. “People get really worried about (the interview), and then you put it out and they love it,\" Auckerman said. “We asked Bernie Sanders to do one and he said no,” says Galifianakis, who appreciated that the politician wouldn't try to win over voters with an off-brand comedy video. “I respected him so much for that.” Less than appreciated: When representatives ask to get their celebrity client on the show, and the star ultimately passes after planning has begun. According to Aukerman, that happened with Oprah Winfrey and Elton John. The Obama jokes had to be cleared by his speechwriters beforehand. “That's the one that we sort of struck a compromise,\" says Aukerman, who understood that an exception could be made for the commander in chief. And when it came to the 2011 Jennifer Aniston interview, Galifianakis ultimately felt bad about the plan to surprise her with a Brad Pitt lookalike on camera. He asked her beforehand if she was OK with it, and, as Aukerman recalls, “She, I think rightly, was like, ‘It's not that I don't think it's funny. It's just anything that continues this conversation about me and Brad Pitt just prolongs me having to talk about it.’ And so we said no.” Fun fact: The “Between Two Ferns” theme is actually taken from a certain famous 1976 Robert De Niro movie. Aukerman didn't know that 11 years ago, when the music became part of the first “Ferns” episode. “I thought it was elevator music,” says Aukerman. “It was a low-budget show and we couldn't write music for it.\" He had no idea the music was from “Taxi Driver” and would ultimately cost so much money to use. “It's literally been a problem for 10 years.\" 'Between Two Ferms':Zack Galifianakis reveals celeb questions that (maybe) went too far Netflix in October:Meryl Streep, Eddie Murphy, Paul Rudd, Cardi B, more 'Kominsky'",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "'Fair maps': Barack Obama launches new initiative to help take on partisan gerrymandering",
      "url": "https://www.usatoday.com/story/news/politics/2019/08/26/barack-obama-launches-initiative-take-partisan-gerrymandering/2127235001/",
      "subtitle": "'Fair maps': Barack Obama launches new initiative to help take on partisan gerrymandering",
      "author": "Savannah Behrmann",
      "content": "WASHINGTON -- Former President Barack Obama announced a new initiative to combat partisan redistricting on Monday, an issue that he says he has made a priority from his \"2008 campaign until now.\" \"The movement for fair maps will determine the course of progress on every issue we care about for the next decade. And we can’t wait to begin organizing when the redistricting process starts in 2021. We need to build this movement from the ground up – right now,” a webpage for the new project, says quoting Obama According to thewebsite, the project -- named \"Redistricting U\" --  \"is a free, in-person organizing training initiative\" that sends \"trainers to cities to train volunteers, giving them the tools to impact the redistricting process in their state and empower them to be leaders in the movement for fair maps.” The All On The Line website describes the broader organization as a national campaign launched to “restore fairness to our democracy and ensure every American has an equal say in our government.” The All On The Line campaign began after Organizing for Action, an Obama political organization, merged with his former Attorney General Eric Holder's group, the National Redistricting Action Fund. The merged organization, the National Democratic Redistricting Committee (NDRC), launched the All On The Line campaign. In July 2018, Obama appeared in a view released by the NDRC  and said that \"rethinking the way we draw our congressional districts\" is vital to American democracy. \"It's why your district might be shaped like a corkscrew. But it’s also how a party gains more seats, while winning fewer votes. Which isn’t fair,” Obama said. Despite growing concern about partisan redistricting among Democrats and progressives -- including at the highest echelons of the Democratic Party with the likes of Obama and Holder -- the Supreme Court ruled in late June that partisan election maps are constitutional despite their one-sided nature. “How do you decide where the line is between acceptable partisanship and too much partisanship?” Chief Justice Roberts said from the bench in announcing the 5-4 opinion he'd penned, joined by the court's other conservatives.“At some point, it should occur to you that what you’ve been asked to do is not judging at all.\" More:Supreme Court says federal courts cannot strike down partisan gerrymandering The chief justice said the challengers from North Carolina, seeking to overturn a map drawn by the state's Republicans, and Maryland, seeking to overturn a map drawn by the state's Democrats, asked for “an unprecedented expansion of judicial power” that would have broad consequences. “There will be no end to the litigation,” he said. But Justice Elena Kagan decried the ruling on behalf of the court's four liberals. \"Of all the times to abandon the court's duty to declare the law, this was not the one,\" she said. \"The practices challenged in these cases imperil our system of government.\" Contributing: Richard Wolf",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Migrant children held by the Obama administration still suffering 5 years later",
      "url": "https://www.usatoday.com/in-depth/news/nation/2019/09/23/migrant-children-2014-american-immigration-crisis-obama-trump/2025687001/",
      "subtitle": "Migrant children held by the Obama administration still suffering 5 years later",
      "author": "null",
      "content": "",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Michelle Obama follows up bestselling 'Becoming' memoir with guided journal",
      "url": "https://www.usatoday.com/story/entertainment/books/2019/10/07/michelle-obama-announces-new-book-becoming-memoir-companion-journal/3896361002/",
      "subtitle": "Michelle Obama follows up bestselling 'Becoming' memoir with guided journal",
      "author": "Anika Reed",
      "content": "Michelle Obama is back with a new project, one year after her bestselling memoir \"Becoming\" flew off the shelves. Her new guided journal, \"Becoming: A Guided Journal for Discovering Your Voice,\" will be a companion piece to her critically-acclaimed memoir and features an \"intimate introduction\" from Obama herself. Fans won't have to wait long for the former first lady's latest literary endeavor: The journal will be available Nov. 19 for $19.99. The guided journal is filled with \"more than 150 inspiring questions and quotes that resonate with key themes in Mrs. Obama’s memoir and that are designed to help readers reflect on their personal and family history, their goals, challenges, and dreams, what moves them and brings them hope, and what future they imagine for themselves and their community,\" according to a release on the book from publisher Penguin Random House. \"Becoming,\" which was published in November 2018, dominated book sales in 2018, landing the No. 1 spot on the USA TODAY’s year-end top 100 best-selling books. 'Becoming' Michelle Obama:Even the queen's shoes hurt, and 5 more things we didn't know \"Becoming\" gave insights into Obama's life in the White House, her marriage to former President Barack Obama and her role as a mom to daughters Malia and Sasha. She and her husband have had full schedules, with the former first lady embarking on a nationwide book tour while becoming the most admired woman in the world. The couple also launched Higher Ground Productions last spring in partnership with Netflix, promising a company that would \"harness the power of storytelling\" and touch on \"issues of race and class, democracy and civil rights, and much more.\" Michelle Obama's 'Becoming':5 poignant moments from book tour launch with Oprah",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Donald Trump says Democrats should look into Barack and Michelle Obama's books, Netflix deals",
      "url": "https://www.usatoday.com/story/news/politics/2019/09/16/trump-look-into-barack-obama-michelle-obama-book-netflix-deals/2347036001/",
      "subtitle": "Donald Trump says Democrats should look into Barack and Michelle Obama's books, Netflix deals",
      "author": "Jeanine Santucci",
      "content": "WASHINGTON -- In a series of tweets Monday, President Donald Trump criticized Democrats for their inquiries into his administration, and called for a shift in focus to former President Barack Obama's business moves. Instead of investigating reports suggesting that Trump is using his presidency to enrich his businesses, Democrats should look at Obama's book and Netflix deals, the president said. \"I have a better idea. Look at the Obama Book Deal, or the ridiculous Netflix deal,\" Trump tweeted. The former president and former first lady Michelle Obama launched a film production company in partnership with Netflix last spring, reportedly a \"high eight-figure deal,\" according to CNN. They also secured book deals worth $60 million each, according to reports. Michelle Obama's book \"Becoming\" was published last year and quickly became a best seller. \"House Judiciary has given up on the Mueller Report, sadly for them after two years and $40,000,000 spent - ZERO COLLUSION, ZERO OBSTRUCTION. So they say, OK, lets look at everything else, and all of the deals that 'Trump' has done over his lifetime. But it doesn't... work that way,\" Trump tweeted. Trump has previously called for an investigation into Barack Obama's book deal, despite it not being unusual for commanders in chief to publish books after their time in office. Former presidents Bill Clinton, George W. Bush and Ronald Reagan all authored books after their terms ended, for example. In July Trump told reporters, \"Let's look into Obama the way they've looked at me from day one... They could look into the book deal that President Obama made. Let's subpoena all of his records.\" The tweets Monday come after Democrats have sounded the cry for an impeachment investigation, fueled by allegations that Trump has obstructed justice and is profiting off of his time in office. Recently Vice President Mike Pence came under scrutiny for staying at a Trump-owned resort on an official trip to Ireland, and Trump was slammed for suggesting that next year's G-7 summit be held at one of his resorts in Florida. Trump has repeatedly claimed that his time in office has not benefited his personal wealth or that of his companies. \"I will, and have always expected to, lose BILLIONS of DOLLARS... for the privilege of being your President,\" Trump also tweeted Monday.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "'Zombieland 2' raises the stakes with Terminator zombies, Obama's 'Beast' limo and Elvis",
      "url": "https://www.usatoday.com/story/entertainment/movies/2019/10/17/zombieland-double-tap-includes-terminator-zombies-obama-beast-limousine/3972213002/",
      "subtitle": "'Zombieland 2' raises the stakes with Terminator zombies, Obama's 'Beast' limo and Elvis",
      "author": "Bryan Alexander",
      "content": "LOS ANGELES – There are times you need to nut up or shut up. If you're bringing back the beloved \"Zombieland\" to theaters, you'd better amp up what we didn't know we needed in an undead action comedy: President Barack Obama's killer \"Beast\" limousine, Elvis and Terminator zombies. (And Bill Murray somehow rising from the dead after his tragic death in the original would be cool, too). Director Ruben Fleischer conjures all that with the return of the most dysfunctional family to roam the zombie apocalypse – Woody Harrelson's Tallahassee, Emma Stone's Wichita, Jesse Eisenberg's Columbus and Abigail Breslin's Little Rock – in \"Zombieland: Double Tap\" (now in theaters). \"Raising the stakes is always a good thing for a sequel,\" says Fleischer. The original 2019 movie depicted a devastating viral outbreak that brought zombie global domination and four bickering survivors together, bonding over great kills. But the virus has mutated over the decade, to create stronger, more oppressive zombies who earn the Terminator-inspired moniker T-800s. Bill Murray is alive! How the tragic 'Zombieland' victim ended up in the sequel Zombie killing hits the White House:'Zombieland: Double Tap' first trailer \"They are harder-to-kill, relentless zombies that stop at nothing. And it causes everyone concern as they learn how to meet the new threat,\" says Fleischer. This required better zombie thespians, well above the typical drooling norm for shambling undead types in lesser productions. \"Our first T-800 was a dancer stunt guy who had strong physical control of his body (and was) able to do those movements that seemed inhuman,\" says Fleischer But the T-800s aren't the only new creatures roaming the land. The evolving disease has created whole other undead categories, include \"The Homer\" (moronic even by zombie standards), \"The Ninja\" (skilled at moving and fighting) and \"The Hawking\" (dangerously smart). \"All of this makes the zombie landscape more compelling,\" says Fleischer. With the greater threat comes the need for greater vehicles, including the original \"Beast\": Tallahassee gets his hands on the monster Cadillac limousine that protected President Obama with a 5-inch thick armor plating of steel and bulletproof glass. The neglected \"Beast\" comes with the group's new home, a deserted White House. Tallahassee's upgrades include a zombie-clearing plow, machine-gun mount and decorative bullhorns. \"It resembles Obama's car to a T but it turns into the ultimate 'Mad Max' zombie-killing machine,\" says Fleischer. \"It's one of the perks of moving into the White House.\" Fun fact: The filmmakers actually took over two leftover presidential limos from the 2013 White House action flick \"Olympus Has Fallen,\" then promptly destroyed the cars while filming \"Zombieland 2.\" One was gloriously finished off by the monster truck Big Fat Death, which rolls up on the limousine during a righteous, random moment of carnage. \"We've killed this 'Beast' from future movies, unless there's a true post-apocalyptic movie needing detritus,\" says Fleischer. Amid the other film's disturbing revelations, \"Zombieland 2\" goes for full heartbreak. Brace yourself. Elvis Presley's famed Graceland has been torched. On the bright side, many of The King's artifacts, right down to his blue suede shoes, are on display at the Hound Dog Hotel, run by newcomer Nevada (Rosario Dawson). Elvis lore and the undead are a heaven-sent match, enhanced by a zombie bludgeoned by guitar and Harrelson's character riffing about his love of the icon in a moment of real-life truth. Tallahassee dresses the part, does a right-on impression and even sings \"Burning Love.\" Mercy.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Barack, Michelle Obama celebrate 27th wedding anniversary: 'It’s getting better all the time'",
      "url": "https://www.usatoday.com/story/entertainment/celebrities/2019/10/03/barack-obama-michelle-obama-share-27-anniversary-messages/3855250002/",
      "subtitle": "Barack, Michelle Obama celebrate 27th wedding anniversary: 'It’s getting better all the time'",
      "author": "Anika Reed",
      "content": "Barack and Michelle Obama are going strong! The former first couple swapped celebratory messages on social media to commemorate their 27th wedding anniversary. The Obamas, who share daughters Malia and Sasha, wed on Oct. 3, 1992. The country's former commander-in-chief invoked the spirit of the Beatles in his anniversary salute to his wife Thursday, taking to Instagram to share a photo of the two of them from behind, rocking baseball caps and looking off into the sunset in an embrace. Though the former president is known for being a man of many words, he kept things short and sweet in his post. \"Like the Beatles said: It’s getting better all the time,\" he wrote in the post. \"Thanks, babe, for 27 amazing years!\" The \"Becoming\" author shared a photo of the couple laughing near the water, opening up about the \"magic\" that connects them. \"27 years ago, this guy promised me a life full of adventure. I’d say he’s delivered,\" she wrote on the Instagram post. \"Here’s to our next chapter of becoming empty nesters and discovering what’s next—while still feeling the magic that brought us together all those years ago. Happy anniversary, Barack.\" And the Obamas show no signs of slowing down. They launched Higher Ground Productions last spring in partnership with Netflix, promising a company that would \"harness the power of storytelling\" and touch on \"issues of race and class, democracy and civil rights, and much more.\" The former first lady also beat out Angelina Jolie and Oprah Winfrey as the most admired woman this summer, according to a July poll by YouGov. Duchess Meghan chats with Michelle Obama:gets her to dish about Malia and Sasha Most admired woman:Michelle Obama beats out Angelina Jolie, Oprah Winfrey, poll says",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Obama at Elijah Cummings funeral: 'It falls on us to continue his work'",
      "url": "https://www.usatoday.com/story/news/politics/2019/10/25/live-elijah-cummings-funeral-coverage-barack-obama-bill-clinton-speak/4088642002/",
      "subtitle": "Obama at Elijah Cummings funeral: 'It falls on us to continue his work'",
      "author": "Rebecca Morin",
      "content": "Obama: 'It falls on us to continue his work' Delivering the final tribute of the service, former President Barack Obama recounted the boost Cummings gave him during his presidency, especially during the tougher times. “There is something about his voice that just made you feel better,” Obama said. “That deep baritone. A prophetic voice.” More than once during his presidency, when the economy was struggling to pull out of a recession, or when health care legislation seemed dead in Congress, Obama said he would watch Cummings rally his colleagues. Cummings would tell them that the cost of doing nothing isn’t nothing, and folks would remember why they entered public service. “He would remind all of us that our time is too short not to fight for what’s good, and what is true and what is best in America, Obama said. “And now it falls on us to continue his work.” Listening to Cummings’ daughters talk about their father reminded Obama that he wants his own daughters to know that being a strong man includes being kind. “You’re not a sucker to have integrity and to treat others with respect,” he said. While the title “honorable” is conferred on “all kinds of people” who get elected to public office, Obama said, the difference in Cummings’ case was that he “was honorable before he was elected.” “There’s a difference. There’s a difference if you were honorable and treated others honorably outside the limelight,” Obama said. “As president, I knew I could always count on Elijah being honorable and doing the right thing.” The four-hour service ended with a prayer and a hymn led by the choir that spoke of leaning on God in times of grief and pain. The thousands in the audience held hands with those beside them, even strangers who they’d just met, and sang along before watching Cummings’ flag-draped casket carried out. Bill Clinton: 'How did he do that?' Former President Bill Clinton, who was impeached by a Republican House and saw his wife Hillary regularly slammed by GOP lawmakers, praised Cummings for being able to reach across the aisle when many in Congress do not. “He actually made, in one of the most partisan periods in our country’s history, a lot of Republican friends,” he said, speaking to a crowd that included Cummings’ pal, North Carolina conservative Rep. Mark Meadows. “Why did he do that? How did he do that?” “I think he did it because everybody could see the real deal,” Clinton continued. “His heart was in it. No matter how hard he fought and how passionately he argued, he tried to treat everybody the way he wanted to be treated, the way he thought Americans should be treated.” Cummings, Clinton said, offered the country a lesson in these hyper-partisan times: “You know you can’t run a free society if you have to hate everybody you disagree with.” It was Cummings during a House Oversight and Reform Committee hearing he was chairing earlier this year that helped calm a potentially explosive moment involving Meadows and Rep. Rashida Tlaib, D-Mich.. At a February hearing that featured testimony from President Donald Trump's ex-attorney Michael Cohen, Tlaib accused Meadows of a “racist” act by bringing a black Trump administration official to the hearing. Cummings, trying to diffuse the situation, thanked Meadows and called him one of his best friends on the committee. \"I know that shocks a lot of people,\" he said while adding that he did not think Tlaib meant to call Meadows racist. \"I can see and feel your pain. I feel it. And I don't think Ms. Tlaib intended to cause you that, that kind of pain and that kind of frustration,\" Cummings told Meadows. Clinton seemed to bring that moment up during his remarks Friday, recalling that Cummings was “so proud” that he could help resolve the personal spat.” Eiljah Cummings' wife: 'He was a man of soul and spirit' Describing her husband’s final days, when he was in a lot of pain, Maya Rockeymoore Cummings said her husband kept saying he was tired and ready to go. The staff at Johns Hopkins wanted to give him “sunshine therapy.” They rolled his bed to the roof of the hospital, where helicopters land, and he looked out over the inner harbor, his beloved south Baltimore where he grew up, and other parts of the city. “Boy, have I come a long way,’’ he said. Cummings said her husband’s fights for what he believed in weren’t easy, especially in his final months when Trump repeatedly attacked him and his district. While Rep. Elijah Cummings already carried himself with grace and dignity in public settings, Maya Rockeymoore Cummings said, the attacks hurt him. “He was a man of soul and spirit,” she said. “He felt very deeply.” Cummings said her husband would’ve objected to lying in state at the Capitol yesterday, the first African American to do so. But, she added, that was a necessary part of his funeral. “We needed to make sure that he went out with the respect and the dignity that he deserved,” she said, eliciting a standing ovation from the gathering as her voice rose. “This was a man of the utmost integrity. Do you hear me?....He wanted to make sure that we left a society worthy of our children.” 'An ordinary man doing an extraordinary job' Joe Alexander, a former aide who called Cummings his mentor, said Cummings straddled two worlds – inner Baltimore and the halls of Congress. “He always said he was an ordinary man doing and extraordinary job,” Alexander said. “However, he was not an ordinary man. He was a brilliant man. He was born to lead and he served for all the right reasons.” Another mentee, Lean Wen, the former Baltimore health commissioner, said the city needed Cummings’ moral authority to overcome the stigma of opioid addiction so it could be treated like the disease that it is. Wen named her now 2-year-old son after Cummings, a tribute that made him cry. During their last conversation, Wen told him how blessed she was to have had his mentorship. He replied that he was the blessed one, “because you are part of my destiny as I am a part of yours.” “He challenged us to be better and we are all better for knowing him,” Wen said. “May we be worthy of you and may you rest in peace.” 'You can call my dad and ask him' Jennifer Cummings thanked her father for giving her pride and confidence in being black – and for teaching her how to stand up to bullies. Being told by him that she was beautiful may sound basic and “like a no-brainer,” she said. But her dad, who insisted on buying her brown dolls, wanted her to know that rich, brown skin was just as beautiful as alabaster or any shade of the rainbow. She recounted a time when she was called ugly by another kid on the elementary school playground. “My daddy says I’m beautiful,” she responded. Then she pulled out of her small purse that was otherwise filled with rocks a business card. “You can call my dad and ask him,” she added. Cummings, her daughter said, did not suffer fools. “And you taught me not to either,” she said. Hillary Clinton: 'He kept reminding us, life is no dress rehearsal' Former Secretary of State Hillary Clinton said it’s no coincidence that the late Rep. Elijah Cummings shared a name with the Old Testament prophet Elijah, who used the power and wisdom God gave him “to uphold the moral law that all people are subject to.” In remarks that seemed a thinly veiled reference to President Donald Trump, Clinton got a huge applause from the mourners when she said that Cummings, like that Old Testament prophet, “stood against corrupt leadership of King Ahab and Queen Jezebel.” “And he kept reminding us, life is no dress rehearsal,” she said. Clinton said Cummings had the simple philosophy that no matter how daunting a problem seems, there’s always something each person can do, even if it seems small. Toward the end of his life, Cummings begged the American people to pay attention to what was going, Clinton said. \"'When we’re dancing with the angels, the question will be asked,' he said, in 2019, 'what did we do to make sure we kept our democracy intact?,'\" Clinton said. She ended with paraphrase of a poem Cummings recited in his first speech to Congress and would repeat to himself as many as 20 times a day as a reminder to make the most of every moment on Earth. “I have only just a minute. Only sixty seconds in it,” the poem begins. “Just a tiny little minute, but eternity is in it.” Pelosi: Cummings was our 'North Star' House Speaker Nancy Pelosi had plenty of nicknames for Rep. Elijah Cummings: Mentor. Master of the House. North Star. Mr. Chairman. Pelosi, D-Calif., spoke about the late Maryland Democrat's role as a mentor to incoming lawmakers. “As we know from the Old Testament, there is a tradition to leave a seat at the table for Elijah. He might show up,” she said. “Our Elijah always made a seat at the table for others. He made a seat at the table for children who need education, for even new members of Congress so he could mentor them. For all who wanted to be part of the American Dream. Elijah himself personally lived the American Dream and he wanted everyone else to have that opportunity and many seats at the table.” Cummings was a close advisor, someone she said she looked to for direction and whose candor was always welcome “whether we asked him or not.” “He held himself to a high standard,” she said. “And that’s why I called him the North Star of Congress, our guiding light.” An all-star audience of mourners Elijah Cummings can still draw a powerful crowd. Two ex-presidents, a former first lady, presidential candidates, former cabinet members and countless members of Congress - of both parties - showed up to pay their respects. Barack Obama and Bill and Hillary Clinton headlined the group but here are some of the others who came: 'He was a good man' Thousands stood outside for hours in brisk, 50-degree weather, waiting to pay respects to Rep. Elijah Cummings, who died Oct. 17 at age 68. The line snaked throughout the front of New Psalmist Baptist Church in Baltimore, where Cummings' funeral was held Friday. The church holds a maximum of 4,000 people, and employees warned that many would not be able to get inside. The ceremony, which will include remembrances by former Presidents Barack Obama and Bill Clinton, started at 10 a.m. EST. Mary Roary told her friend Carla Fennell that she hoped she had enough tissues as the pair waited to say goodbye to Cummings, who represented parts of Baltimore in Congress for 23 years. The women both had fond memories of the longtime congressman, including once when Fennell says Cummings helped her, a single mother, find a job. “He was a good man. It’s clear from looks at this line,” she said motioning toward the massive number of people in line. 'Enough is enough':The moments that defined the career of Rep. Elijah Cummings His death, both women said, is bringing together people during a moment in history where Americans and politicians couldn’t be more divided. “He has always had this way of bringing people together and he’s doing it even after death,” Roary said. “This shows us we all don’t have an endless amount of time on this earth.” Outside the church, a massive American flag was hoisted up by two fire truck ladders. Visitors walking into the Baptist church we’re greeted by church elders and pastors welcoming each person. Many took photos of a large blanket with Cummings’ face and an American flag that was hung up just outside the hall. Many swayed or sang along with their arms raised in the air to Baptist worship music and traditional hymns. As a video played documenting Cummings’ life, from his time as young boy to his career in Washington, many grabbed tissues to wipe their eyes. Original story: WASHINGTON – Rep. Elijah Cummings' legacy and life will continue to be honored Friday morning, as former Presidents Barack Obama and Bill Clinton and former Secretary of State Hillary Clinton are set to speak at the late-congressman's funeral. Cummings laid in state in Statuary Hall Thursday, making him the the first black lawmaker to do so in the Capitol. Cummings, who represented portions of Baltimore, died last week at 68 due to complications related to longstanding health issues. In addition to Obama and the Clintons, House Speaker Nancy Pelosi, D-Calif., and former Rep. Kweisi Mfume, who Cummings succeeded in a special election in 1996, will give remarks at Cummings' funeral. The funeral will be held at the New Psalmist Baptist Church, where the late-congressman worshiped for nearly 40 years. A public viewing will take place at 8 a.m. ET and the funeral will take place at 10 a.m. Obama spokeswoman Katie Hill said in a tweet Wednesday night that the former president was asked by Cummings' widow, Maya Rockeymoore Cummings, to \"deliver remarks about the remarkable life and legacy of one of this country’s finest public servants.\" Cummings was an early supporter of Obama's 2008 presidential run and was personal friends with the former president. Obama said in a statement following Cummings death last week that the Maryland Democrat showed the \"necessity of good people stewarding\" the checks and balances within the United States' democracy. \"Steely yet compassionate, principled yet open to new perspectives, Chairman Cummings remained steadfast in his pursuit of truth, justice and reconciliation,\" Obama said in the statement. \"It's a tribute to his native Baltimore that one of its own brought such character, tact and resolve into the halls of power every day.\" Bill Clinton in a statement last week said Cummings \"was a resounding voice of moral courage who fought the good fights for the people of Baltimore.\" In a statement last week, Hillary Clinton said Cummings was \"a man of principle who championed truth, justice and kindness. He fiercely loved his country and the people he served.\" Friday's funeral follows several days of memorials for Cummings. Mourners paid respects to Cummings on Wednesday as his body lay in repose at Morgan State University, a historically black college in Cummings' district. He served on the school's Board of Regents for 19 years. On Thursday morning, family, friends and lawmakers on both sides of the aisle gathered on Capitol Hill to pay tribute. Pelosi, Senate Majority Leader Mitch McConnell, Senate Minority Leader Chuck Schumer and Rep. Mark Meadows were among several attendees who made remarks Thursday. Meadows, R-N.C., passionately described his friendship with Cummings, his eyes glistening as he held back tears. \"Some had classified it as an unexpected friendship,\" Meadows said of their bipartisan relationship in a highly partisan era. \"But for those of that know Elijah, it’s not unexpected.\" Cummings casket was open to the public to view following the memorial service. Hundreds lined up Thursday afternoon to say their final goodbyes to the late-congressman. Contributing: William Cummings",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Barack and Michelle Obama make list of Hollywood's 'most powerful' entertainers for first time",
      "url": "https://www.usatoday.com/story/entertainment/celebrities/2019/10/16/obamas-debut-hollywoods-most-powerful-entertainers-list/3997389002/",
      "subtitle": "Barack and Michelle Obama make list of Hollywood's 'most powerful' entertainers for first time",
      "author": "Maria Puente",
      "content": "Who wouldn't take their calls? That is the ultimate measure of one's power in Hollywood. Or at least that's the way The Hollywood Reporter put it when the Tinsel Town trade mag put former President Barack Obama, 58, and former first lady Michelle Obama, 55, at Number 50 out of 100 on its annual list spotlighting Hollywood's most powerful entertainment industry figures. Not bad for neophyte media moguls, even if they did spend eight years in the White House. Since leaving the presidency, the Obamas have successfully scaled both the publishing and entertainment worlds, inking multi-million-dollar deals to publish their memoirs (her \"Becoming\" is already a boffo best-seller, and another book is on the way), and another partnership with Netflix to produce films and TV shows on inspirational stories through their newly launched Higher Ground Productions. President Donald Trump, who never misses a chance to criticize his predecessor, has noticed, calling on Democrats to investigate the Obamas' business moves instead of whether he's using his presidency to enrich his businesses. \"I have a better idea. Look at the Obama Book Deal, or the ridiculous Netflix deal,\" Trump tweeted last month. But Hollywood has noticed, too, and approves. \"The former president and first lady kicked off 2019 with a Sundance acquisition – documentary \"American Factory,\" which premiered to strong reviews on Netflix in August en route to an awards-season run,\" The Hollywood Reporter enthused. \"If their first film from is any indication, more fantastic movies and shows are on the way,\" predicted USA TODAY. Other projects in the works include adaptations of David W. Blight's Frederick Douglass biography and Michael Lewis' \"Fifth Risk,\" and \"Bloom,\" a post-World War II-era show about fashion. And don't forget their podcasts deal with Spotify, which will see them develop and lend their voices to select podcasts exclusively for the platform. The new 100 list, announced Wednesday, is The Hollywood Reporter's fourth annual compilation of the most powerful people in entertainment. The magazine is touting it as \"the most diverse\" list ever, with the Obamas as the most notable newcomers. Disney Chairman & CEO Bob Iger holds onto the top spot on the list, with other power players such as ViacomCBS Chairman Shari Redstone (No. 4); actress Zendaya (No. 95); WarnerMedia CEO and AT&T President and COO John Stankey (No. 6); actor-producer Dwayne Johnson (No. 39); and Oprah Winfrey (No. 15). The magazine's editors spend months compiling the list, based on \"the size and reach of a person's purview, the success of projects since the previous year’s list, the power to get a project made (company ownership helps) and the ineffables: heat, clout and intangible indicators of influence gleaned from conversations with top insiders (not to mention The Hollywood Reporter's daily reporting).\" The full list will appear in the Oct. 16 issue of The Hollywood Reporter and on THR.com.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "'This is another bald faced lie': Ex-Obama officials blast Grisham's claim they left 'you will fail' notes",
      "url": "https://www.usatoday.com/story/news/politics/2019/11/20/former-obama-officials-deny-stephanie-grisham-claim/4247001002/",
      "subtitle": "'This is another bald faced lie': Ex-Obama officials blast Grisham's claim they left 'you will fail' notes",
      "author": "William Cummings",
      "content": "WASHINGTON – Former Obama administration officials strongly disputed White House Press Secretary Stephanie Grisham's claim that they left nasty notes behind for President Donald Trump's incoming team after the January 2017 inauguration. \"We came into the White House – I'll tell you something – every office was filled with Obama books, and we had notes left behind that said, 'you will fail,' 'you aren't going to make it,'\"Grisham said Tuesday during an interview with conservative radio host John Fredericks, whose eponymous network labels itself \"America's Godzilla of TRUTH!\" \"Really?\" Fredericks asked her. \"Yes, in the press office there was a big note taped to a door that said 'you will fail,'\" she said. She called the alleged notes \"sad\" and \"pathetic,\" but said it was \"something we're used to.\" \"Thankfully, the campaign trained\" us \"to be tough and to fight,\" she said. \"This is another bald faced lie,\" tweeted former national security adviser Susan Rice after CNN correspondent Abby Phillip shared Grisham's claim on Twitter. Rice was not the only person to serve under former President Barack Obama who took issue with Grisham's allegation. \"This is a lie,\" tweeted Ben Rhodes, a deputy national security adviser under Obama. \"If this happened, I also don’t think the entire Trump staff would wait 3 years to tell us.\" He said it was \"sad to see\" Grisham \"fall this far.\" \"Produce the notes that back this up,\" said former Obama adviser Valerie Jarrett. \"I cannot imagine a single one of my former colleagues who would do this.\" Jarrett said that from Obama \"on down, we all tried to help facilitate a smooth and orderly transition, just as President Bush and his team had done for us.\" \"This is absolutely not true,\" said Chris Lu, a former deputy secretary of Labor. \"Obama repeatedly and publicly praised Bush cooperation during 2009 transition, and pledged we would provide same cooperation to whoever followed us. And that’s what we did,\" he said, before adding, \"If Grisham is correct, why has it taken 3 years to come out?\" Former speechwriter Jon Favreau said if Obama staffers had left spiteful messages, they would have been more creative. \"It's appalling that she thinks our notes would have been that lame,\" he tweeted. Cody Keenan, another former Obama speechwriter, joked that he \"left an iPhone charger if anybody's seen it, but no, nobody left unimaginative notes written at a sixth-grade level.\" \"I mean, if they read the 'how to do your job' memos and briefing books we actually left, they’d at least know how to write a coherent speech, vet their appointees, and maybe fewer of them would be indicted or heading to jail,\" Kennan added. In the radio interview, Grisham said that when the Trump team leaves the White House – \"in six years\" – \"I fully intend to leave a note in my predecessor's drawer saying 'good luck to you.'\" \"I don't care if it's a Dem or a Republican, \" she said. \"You're serving the country. It's the highest honor in the world. If these people couldn't recognize and stay above that, that was on them.\" Grisham initially served as the spokeswoman for first lady Melania Trump. Her predecessor, Joana Rosholm, the former press secretary for first lady Michelle Obama, shared the letter she left for Grisham. \"Welcome to the small family of White House Staffers, past and present. The bond we all share transcends politics,\" Rosholm wrote. \"I want you to know that I am always available if you have questions, just as Mrs. Bush's staff was for us. No question is too big or too small.\" Reporters who covered the 2017 White House transition also disputed Grisham's claims. \"I was in the West Wing on the evening of January 20, 2017, talking to several incoming Trump officials as they moved into their offices,\" tweeted ABC News correspondent Jonathan Karl, along with pictures from the White House that day. \"I saw no offices 'filled with Obama books' and nobody mentioned 'you will fail' notes,\" he said. Josh Earnest, who served as Obama's last White House press secretary, left a note for his successor, Sean Spicer, that said, \"It is not hard for me to set aside my political views, and genuinely root for you to succeed in this role,\" according to an image of the letter shared by NBC News. \"I don’t know why everyone is so sensitive!\" Grisham later said in an email to Politico in which she tried to walk back her claims. She said she only thought of the alleged notes \"as a kind of a prank, and something that always happened.\" She said she \"certainly wasn't implying every office had that issue.\" \"In fact, I had a lovely note left for me in the East Wing, and I tracked the woman down and thanked her,\" Grisham said. She said she was only talking about \"our experience in the lower press office,\" sharply throttling back on her radio interview claim. One former Trump administration official supported Grisham's claim. \"Stephanie is correct that there were nasty grams left in the press office,\" tweeted Michael Short, who briefly served as senior assistant press secretary before resigning in July 2017.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Photo of Trump watching al-Baghdadi raid compared to Obama watching bin Laden operation",
      "url": "https://www.usatoday.com/story/news/politics/2019/10/27/situation-room-photos-out-trump-watching-abu-bakr-al-baghdadi-raid/2478527001/",
      "subtitle": "Photo of Trump watching al-Baghdadi raid compared to Obama watching bin Laden operation",
      "author": "Jeanine Santucci",
      "content": "The White House released photos they said show President Donald Trump watching the U.S. raid that killed Islamic State leader Abu Bakr al-Baghdadi unfold. Trump announced the U.S. operation on Sunday morning. Trump said Sunday that he watched as U.S. forces cornered al-Baghdadi in a dead-end tunnel, where the ISIS terrorist detonated a vest he was wearing, killing himself and several others. No U.S. forces were lost, Trump said. The photo shows national security adviser Robert O'Brien, Vice President Mike Pence, Trump, Secretary of Defense Mark Esper, Chairman of the Joint Chiefs of Staff Mark Milley and Deputy Director for Special Operations on the Joint Staff Marcus Evans. They all face the direction of the camera, appearing to watch the raid. \"The U.S. personnel were incredible,\" Trump said. \"I got to watch  much of it.\" Trump said that his view from the Situation Room was \"as though you were watching a movie.\" Trump described al-Baghdadi running in the tunnel, \"whimpering and crying and screaming all the way.\" The president said that al-Baghdadi \"died like a dog.\" Trump also suggested that the footage of al-Baghdadi's death should be released so that his followers can see how he died. It's not USA TODAY's policy to run White House hand out images. An exception was made in this case because of the newsworthiness of the image. Twitter users compared the White House photos to those taken during the operation that killed Osama bin Laden in 2011, ordered by former President Barack Obama. One iconic photo taken during that attack was taken by then-White House photographer Pete Souza. It shows Obama, former Vice President Joe Biden and former Secretary of State Hillary Clinton with other members of the national security team. During his announcement, Trump suggested that al-Baghdadi's death was more significant than that of bin Laden. Son of Osama bin Laden \"Hamza bin Laden was a big thing, but this is the biggest there is. This is the worst ever. Osama bin Laden was very big but Osama bin Laden became big with the World Trade Center,\" Trump said. \"This is a man who built a whole, as he would like to call it, a country, a caliphate. And was trying to do it again.\" In 2012 Trump repeatedly tweeted that Obama should not be given credit for the operation against bin Laden.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Joe Biden tells activist, 'You should vote for Trump,' over criticism of Obama deportations",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/11/22/joe-biden-tells-immigration-activist-you-should-vote-trump/4273814002/",
      "subtitle": "Joe Biden tells activist, 'You should vote for Trump,' over criticism of Obama deportations",
      "author": "Jeanine Santucci",
      "content": "Democratic presidential candidate Joe Biden told an attendee at a South Carolina town hall Thursday evening, \"You should vote for Trump,\" after being criticized for deportations during the Obama administration. The immigration activist had started off by translating questions asked in Spanish by another attendee, who asked if the former vice president would stop all deportations immediately upon taking office if elected. Biden responded, \"No. I will not stop all deportations. I will prioritize deportations, only people who have committed a felony or serious crime.\" The activist, identified by a CNN reporter as Carlos Rojas, later continued by telling Biden he had volunteered for former President Barack Obama's campaign in 2008, but was disheartened by the number of deportations during his presidency. More:Undocumented immigrants on edge as Trump immigration policy calls for more deportations \"The fact is that over those eight years, there were 3 million people that were deported and separated from their families,\" Rojas said. Cutting Rojas off, Biden said, \"You should vote for Trump. You should vote for Trump.\" \"No, no. I'm not going to do that,\" Rojas responded. Biden said that those who commit felonies should be deported. \"No matter what happens, somebody who commits murder should be deported.\" He continued to say that there will be no family separations under his administration, to which some audience members said \"That's a lie.\" Crowd members chanted \"Not one more deportation,\" preventing Biden from continuing to speak for several moments. Vermont Sen. Bernie Sanders, another 2020 candidate, commented on Twitter Friday: \"Joe Biden may not want the votes of those concerned about immigrant rights, but I do. Join our movement for justice.\" Fact check:Did the Obama administration separate families? The Obama administration is heavily criticized for its high levels of deportations, with the defense that individuals who committed crimes were prioritized for deportation. When asked during a primary debate whether he and Obama had made a mistake, Biden said that comparing their administration to Trump's is \"outrageous.\" \"The president did the best thing that was able to be done at the time,\" Biden said of Obama, also touting the Deferred Action for Childhood Arrivals program. In his campaign, Biden is an advocate for immigration reform in the U.S. In a larger conversation about his stances on various issues, Biden has told USA TODAY that he does not support decriminalizing border crossings, as some other 2020 candidates including Sanders do. \"I don’t believe crossing the border should be decriminalized, but unlike the Trump Administration, I will make sure that U.S. immigration law is enforced humanely,\" Biden said. Debate analysis:Which Democrat can defeat Donald Trump?",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Michelle Obama's new journal guides fans to write their own 'Becoming'",
      "url": "https://www.usatoday.com/story/entertainment/books/2019/11/18/michelle-obama-best-selling-memoir-becoming-gets-guided-journal/4201784002/",
      "subtitle": "Michelle Obama's new journal guides fans to write their own 'Becoming'",
      "author": "Mary Cadden",
      "content": "Michelle Obama is giving readers a chance to discover their own voices and their own stories through journaling. “Becoming: A Guided Journal for Discovering Your Voice” (Clarkson Potter) is the journal companion to her best-selling memoir \"Becoming,\" last year's top-selling book on USA TODAY's best-selling books list. Out nationwide on Tuesday, the guided journal, which includes more than 150 quotes and prompts (and even a \"Becoming\" playlist) from the former first lady, has already garnered a great deal of media attention, including being featured as a bonus pick on Oprah Winfrey’s coveted list of \"Favorite Things.\" Obama writes in the journal's introduction: \"I hope you'll use this journal to write down your experiences, thoughts, and feelings, in all their imperfections, and without judgement. ... Writing is a way to process, to understand, to grow, and yes, to remember.\" Obama reflects on her own experience with journaling, which she did briefly in her 20s when her relationship with now-husband and former president Barack Obama was getting more serious and she was contemplating a new career. She writes, “It was a tumultuous time filled with change, and I found that dedicating time to writing my thoughts down helped me navigate all the transitions.” Obama would not put pen to journal again until she began writing her memoir, during which she was “transported back to that earlier version of myself.” This begat the question she poses in her introduction: “Why didn’t I journal more?” More:'Becoming' Michelle Obama: Even the queen's shoes hurt, and 5 more things we didn't know More:Oprah Winfrey reveals her favorite things for 2019: Here are the most and least expensive items With that revelation, Obama created a journal to help readers reflect on their own personal journey. Because as Obama writes in her introduction, “We don’t have to remember everything. But everything we remember has value.” To give readers an idea of what to expect, we’ve selected five of our favorite quotes with prompts from Obama, beginning with arguably one of her most famous. When they go low, we go high. How do you put this phrase into practice? I had nothing or I had everything. It depends on which way you want to tell it. Where we come from has such a strong effect on the person we are. Describe the neighborhood you grew up in. What was special about it? What was challenging? How did it shape who you are today? I’ve learned that it’s harder to hate up close. Describe a recent conversation you had with someone who did not share your history or perspective. How did you navigate the conversation? Everyone on earth is carrying around an unseen history, and that alone deserves some tolerance. What major historical events affected your family – whether in the distant past or more recently? If you don’t get out there and define yourself, you’ll be quickly and inaccurately defined by others. How have others tried to define you in the past and how do their perceptions differ from the person you know you are?",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "'That's not bringing about change': Obama advises 'woke' young people not to be so judgmental",
      "url": "https://www.usatoday.com/story/news/politics/2019/10/30/barack-obama-tells-woke-youth-get-over-quickly/4095362002/",
      "subtitle": "'That's not bringing about change': Obama advises 'woke' young people not to be so judgmental",
      "author": "William Cummings",
      "content": "Former President Barack Obama has a message for the \"politically woke\" crowd that has become prolific on social media in recent years: Get over it. Obama called out young progressives for being too ideologically rigid and judgmental during an interview Tuesday moderated by \"Grown-ish\" star Yara Shahidi at the Obama Foundation Summit in Chicago. \"This idea of purity and you're never compromised and you're always politically woke and all that stuff, you should get over that quickly,\" the two-term Democrat said. \"The world is messy. There are ambiguities. People who do really good stuff have flaws. People who you are fighting may love their kids and share certain things with you.\" Obama said he has particularly noticed the trend on college campuses he has visited with his daughter Malia. He described it as a \"danger\" that is \"accelerated by social media.\" He said some young people appear to think that the way to bring about change \"is to be as judgmental as possible about other people, and that's enough.\" Criticizing people on Twitter for doing something wrong or for a poor choice of words gives those critics a sense of self-satisfaction, he said. \"Then I can sit and feel pretty good about myself because, man, you see how woke I was, I called you out,\" Obama said. \"That's not activism. That's not bringing about change. If all you're doing is casting stones, you're probably not going to get that far. That's easy to do.\" The comments were widely applauded on social media in a rare moment of bipartisan agreement. Conservative Fox News host Tomi Lahren said it was good to hear Obama \"standing up for our rights and our values of the First Amendment.\" Lahren said Obama's comments made some people \"remember that we used to think Barack Obama was bad,\" but in contrast to today's Democratic leaders, \"Obama is looking like the voice of reason.\" \"That's when you know the Democratic Party has gotten this bad,\" she said. \"Dear 2020 Dems: Listen to Obama. It's important,\" tweeted John Schindler, a national security columnist for the New York Observer. University of New Mexico psychology professor Geoffrey Miller tweeted that Obama went after \"the cheap-talk virtue-signaling at the heart of woke online cancel culture.\" Miller was censured by UNM in 2013 for a tweet that was deemed insensitive to overweight people. \"Monty Python\" actor John Cleese said, \"I very much like what Obama says about 'woke.'\" \"Truer words have never been spoken,\" said drag queen Monét X Change, a former contestant on \"RuPaul's Drag Race.\" \"Obama is right, but he's not criticizing \"cancel culture\" alone (whatever you think that is),\" tweeted Tablet magazine writer Yair Rosenberg. \"He's criticizing attempts to force normal people into black-and-white good/evil boxes, because most humans are more complicated than that and shouldn't be reduced to their worst tweet.\" Although most responded positively to Obama's remarks on Twitter, Mother Jones' Ben Dreyfuss said the 44th president \"must be getting 'ok boomer'd' hard on ticktock.\"",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Barack Obama, Bill and Hillary Clinton to attend Elijah Cummings' Baltimore funeral",
      "url": "https://www.usatoday.com/story/news/politics/2019/10/24/elijah-cummings-funeral-barack-obama-and-hillary-clinton-speak/4081679002/",
      "subtitle": "Barack Obama, Bill and Hillary Clinton to attend Elijah Cummings' Baltimore funeral",
      "author": "William Cummings",
      "content": "Former Presidents Barack Obama and Bill Clinton, and former Secretary of State Hillary Clinton will attend Rep. Elijah Cummings' funeral in Baltimore on Friday as the nation bids farewell to the Maryland Democrat who served on Capitol Hill 23 years. Spokeswoman Katie Hill confirmed that Obama would attend in a tweet Wednesday night. She said Cummings’ widow, Maya Rockeymoore Cummings, asked Obama to \"deliver remarks about the remarkable life and legacy of one of this country’s finest public servants.\" Cummings, 68,  died last week of complications related to longstanding health issues. He had previously been treated for heart and knee issues, according to The Associated Press and had cancer, The Baltimore Sun reported. \"Michelle and I are heartbroken over the passing of our friend, Elijah Cummings,\" Obama said in a statement after the congressman's death. \"As Chairman of the House Oversight Committee, he showed us all not only the importance of checks and balances within our democracy, but also the necessity of good people stewarding it.\" Cummings was a personal friend of Obama's and was an early supporter of his 2008 presidential run. 'Enough is enough':The moments that defined the career of Rep. Elijah Cummings More:Elijah Cummings to lie in state at US Capitol Thursday The funeral will be held at the New Psalmist Baptist Church, where Cummings worshiped for nearly 40 years. In addition to Obama and Hillary Clinton, House Speaker Nancy Pelosi, D-Calif., and former Rep. Kweisi Mfume will join Rockeymoore Cummings, Cummings' brother and his daughters as speakers at the funeral, according to Reuters and The Washington Post. Cummings won Mfume's House seat in a special election in 1996 after Mfume left Congress to become president of the National Association for the Advancement of Colored People. Last week, Bill Clinton said Cummings \"was a resounding voice of moral courage who fought the good fights for the people of Baltimore.\" Hillary Clinton said Cummings was \"a man of principle who championed truth, justice and kindness. He fiercely loved his country and the people he served.\" The former House Oversight and Reform Committee Chairman will lie in state in the U.S. Capitol on Thursday. On Wednesday, mourners paid respects to Cummings as his body lay in repose at Morgan State University, a historically black college in Cummings' district. Cummings served on the school's Board of Regents for 19 years. More:How Elijah Cummings' unexpected death could affect the impeachment inquiry Contributing: The Associated Press",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Pete Buttigieg clarifies views on the Obama administration after criticism for a viral misquote",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/11/11/pete-buttigieg-praises-barack-obama-after-misquote-went-viral/2560389001/",
      "subtitle": "Pete Buttigieg clarifies views on the Obama administration after criticism for a viral misquote",
      "author": "Jeanine Santucci",
      "content": "Pete Buttigieg, the mayor of South Bend, Indiana, and 2020 presidential candidate, sought to clarify his views on the administration of former President Barack Obama Monday after facing criticism for a since-corrected report in which he appeared to refer to the \"failures\" of that administration. On Twitter, Buttigieg said that his \"appreciation of the great leadership of Barack Obama comes from a very personal place.\" The original article, published by the Los Angeles Times over the weekend, included a Buttigieg quote that seemed to blame Obama for the election of President Donald Trump. It was corrected on Monday with the accurate quote: \"I think the failures of the old normal help explain how we got Trump.\" On Twitter, the reporter who wrote the article said the mistake happened because the comment by Buttigieg happened with a noisy background, causing the reporter to mishear the recording while transcribing at a rally. \"I deeply regret the mistake When we make errors we own them. This one really hurts because it went viral,\" journalist Evan Halper said. Buttigieg said he appreciates the reporter's \"swift and honest correction.\" In an interview with NBC News on Monday, Buttigieg expanded on his reaction to the correction and praised Obama further. \"The reality is, despite what this president says, journalists take their obligation very seriously to make sure everything they print is accurate, and you saw that in how quickly that correction took place,\" Buttigieg said. \"The achievements of the Obama administration affected me personally in many ways, including the ability to serve openly, and I'm an admirer of President Obama,\" he added. Buttigieg, a veteran, came out as gay in 2015. The military's official \"don't ask, don't tell\" policy on gay people serving in the armed forces was ended by Obama. The misquote was shared widely on social media and was picked up by multiple media outlets because of its newsworthiness; most 2020 Democratic candidates have taken to praising Obama. Though some 2020 hopefuls appeared to criticize the former president during primary debates for his signature health care policy, the Affordable Care Act, and on immigration, they have been sure to express appreciation for Obama's legacy. Q and A:Democratic presidential candidate Pete Buttigieg shares his views on current issues Former Vice President Joe Biden has been a staunch defender of the Obama-Biden administration, even under criticism, though he has sought to avoid taking the blame for some of the more criticized actions at times. “You can't have it both ways,” New Jersey Sen. Cory Booker said to Biden at a debate in July. “You invoke President Obama more than anybody in this campaign. You can’t do it when it's convenient and dodge it when it's not.\" Primary debate:'#ThanksObama': 2020 Democrats walk back Obama criticisms Buttigieg's campaign has drawn some comparisons to Obama's on the trail by voters. He told the Des Moines Register that those comparisons are \"flattering.\" \"I think there's some overlap, certainly, between the style that he brought, and what I'm trying to offer,\" said Buttigieg, who campaigned for Obama in Iowa in 2007. On the stump:Pete Buttigieg says he offers style and message parallels with Barack Obama's Iowa campaign The LA Times' misquote of Buttigieg resulted in criticisms from those who saw it as alienating to a Democratic base that still largely supports the Obama administration. (Obama is rated as the best president by Americans during their lifetimes, according to a 2018 report from Pew Research Center.) Former Obama Cabinet secretary and 2020 candidate Julián Castro also initially called out Buttigieg on Twitter but deleted that tweet after the correction. \"I regret that the original (quote) was spread widely,\" Castro said. In a recent USA TODAY/Suffolk University poll, Buttigieg held his own against front runners Biden, Massachusetts Sen. Elizabeth Warren and Vermont Sen. Bernie Sanders. He also surged in a poll conducted among Iowa caucusgoers last month, putting him in reach of Biden and Warren. And a recent Quinnipiac poll put him only behind Warren in a virtual four-way tie in that state. Contributing: Rebecca Morin, Aamer Madhani, USA TODAY and Barbara Rodriguez, Des Moines Register",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "How much sway do past Democratic nominees have? Unless you're Barack Obama, not much.",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/11/01/obama-endorsement-influence-voters-clintons-less-so/4099794002/",
      "subtitle": "How much sway do past Democratic nominees have? Unless you're Barack Obama, not much.",
      "author": "Susan Page",
      "content": "Once they won the Democratic presidential nomination. But do their endorsements matter now? Unless your name is Barack Obama, not really. A national USA TODAY/Suffolk Poll asked likely Democratic voters whom among the party's past presidential nominees would have the most influence on their vote today. Two-thirds named former president Obama, who moved out of the White House almost three years ago. Obama hasn't endorsed anyone so far, including his former vice president, Joe Biden. Kate Pritchard, 63, a retired teacher from Durango, Colorado, is supporting New Jersey Sen. Cory Booker at the moment, but she's not sure he can go the distance. If Obama were to endorse a candidate, she would back that person. \"That would be very powerful,\" she said in a follow-up interview after being called in the survey. In the poll, 11% cited former president Jimmy Carter, who at age 95 is still building houses and doing other good works, as influential with them. But all the other former nominees registered in single digits. The only other nominee to win the White House, Bill Clinton, was named by just 6%. Hillary Clinton, the party's standardbearer the last time around, also was cited by 6%. Al Gore, the 2000 nominee, was named by 3%, and Michael Dukakis (1988), John Kerry (2004) and Walter Mondale (1984) by 1% each. Asked whom would have the least influence on their vote, Dukakis ranked first, at 23%, and Hillary Clinton was second, at 18%. USA TODAY/Suffolk Poll: Biden's lead narrows in turbulent Democratic field Hillary Clinton created a firestorm last week when she called one of the 2020 contenders, Hawaii Rep. Tulsi Gabbard, \"a favorite of the Russians.\" That brought denials from Gabbard and a divided judgment by Democratic voters. In the poll, 46% said Hillary Clinton should continue to speak out about issues important to her. Precisely the same number, 46%, said she shouldn't inject herself into the 2020 election. The poll of 399 likely Democratic primary and caucus voters, taken by phone from Oct. 23-26, has a margin of error of plus or minus 4.9 percentage points. USA TODAY/Suffolk Poll:Who's sticking with Trump amid troubles? His base",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Pete Buttigieg says he offers style and message parallels with Barack Obama's Iowa campaign",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/11/01/election-2020-pete-buttigieg-tries-to-draw-parallels-to-barack-obamas-first-iowa-campaign/4130193002/",
      "subtitle": "Pete Buttigieg says he offers style and message parallels with Barack Obama's Iowa campaign",
      "author": "Barbara Rodriguez",
      "content": "DES MOINES – It was the beginning of an outdoor town hall for Pete Buttigieg in mid-October, and the shivering crowd watched Matt McCoy jump on stage to help introduce the Democratic presidential candidate. McCoy, a Polk County supervisor who has endorsed the South Bend, Indiana, mayor, was on the elevated platform for mere moments before he compared Buttigieg to President Barack Obama. The crowd cheered so loudly in response they appeared to temporarily forget the 30-degree temperature. \"He was going to launch his campaign from Iowa,\" McCoy said in recalling Obama's 2007 effort in the first-in-the-nation caucus state. \"And here we are again tonight with that feeling in the air. That opportunity for change.\" As the field of 2020 presidential hopefuls descends on Iowa this weekend for several cattle call events, many are seeking to stand out at Friday's Liberty and Justice Celebration. Buttigieg, in particular, is looking to break out at the Iowa Democratic Party fundraiser, once known as the \"Jefferson-Jackson Dinner,\" by drawing parallels to Obama's historic Iowa campaign. The dinner is credited with propelling Obama toward his first-place finish in the Iowa caucuses in early 2008, a point that Buttigieg's campaign reminded his supporters. \"It was the moment that changed everything for the Obama campaign and, ultimately, for the country,\" read a Buttigieig fundraising email this week from Larry Grisolano, a former adviser for Obama in 2007 who now works for the Buttigieg campaign. \"That same moment for Pete, and for America, is this Friday night.\" Buttigieg himself has nodded to Obama's first Iowa campaign for months. \"I'm asking you to spread something that I know went out of style a little bit in American politics: And it's hope,\" Buttigieg said at the Oct. 12 town hall where McCoy spoke. \"Hope\" became synonymous with the former president's 2008 race to the White House. \"Because running for office is an act of hope. Organizing for somebody running for office is an act of hope. Voting is an act of hope,\" Buttigieg said in October. People who show up to Buttigieg's events in Iowa often draw Obama comparisons. According to those potential caucusgoers, Buttigieg is uniquely suited to bring people together following the presidency of Donald Trump. \"We were for Obama, and we're for Pete,\" said Connie Bergman, a 76-year-old retiree from Ames who went to a Buttigieg town hall on the Iowa State University campus on Oct. 16 with her husband, Al. Buttigieg told the Des Moines Register in an interview that he's heard the Obama comparison on the trail and it's \"flattering\" because he believes Obama \"was a great president.\" \"I think there's some overlap, certainly, between the style that he brought, and what I'm trying to offer,\" said Buttigieg, who campaigned for Obama in Iowa in 2007. Buttigieg said there are obvious similarities with what he needs to do in Iowa and what Obama accomplished back then. Buttigieg, who has had to overcome a lack of name recognition at the start of the election cycle, has climbed the polls and become a top fundraiser. Buttigieg now has one of the largest operations in Iowa, with more than 100 staffers in the state and more than 20 field offices. \"Another thing I have in common with him,\" Buttigieg said in referencing Obama. \"As somebody who's not been on the national political scene for a very long time ... the best way that my campaign can demonstrate that we're ready to win, and ultimately win the presidency, is to start with a very good showing here in Iowa.\" George Rankin, 55, who traveled to Iowa from Washington State in September with his wife, Emilie, for the Polk County Steak Fry, ended up following Buttigieg that weekend for the candidate's multi-day bus tour. The couple traveled to Iowa in 2007 to see Obama. \"He's got that 'it' factor that Obama had,\" said the 65-year-old Emilie Rankin. \"... an ability to describe issues in a way that people can understand, but in depth.\" The Rankins think Buttigieg can win Iowa like Obama, and they highlighted that no one back then knew who Obama was, either. “We had an Obama sticker ...,\" George Rankin recalled about their appreciation for Obama in 2007. “And someone came up and said, ‘What’s an Obama?’ So we’ve been through this process.” Barbara Rodriguez covers health care and politics for the Register. She can be reached by email at bcrodriguez@registermedia.com or by phone at 515-284-8011. Follow her on Twitter @bcrodriguez. Your subscription makes work like this possible. Sign up at DesMoinesRegister.com/Deal.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Eddie Murphy says 'Dolemite Is My Name' (and Obama's urging) spurred his return to stand-up",
      "url": "https://www.usatoday.com/story/entertainment/movies/2019/10/03/eddie-murphy-return-dolemite-is-my-name-snl-standup-tour/3847160002/",
      "subtitle": "Eddie Murphy says 'Dolemite Is My Name' (and Obama's urging) spurred his return to stand-up",
      "author": "Bryan Alexander",
      "content": "LOS ANGELES – Eddie Murphy is suddenly everywhere again bringing the laughter. Just don't call it a comeback. The 58-year-old comedian is stepping up on the big screen in grand 1970s pimp attire as real-life comedy pioneer Rudy Ray Moore for \"Dolemite Is My Name\" (now streaming on Netflix). The movie's roll-out is accompanied by a barrage of high-profile entertainment events that have Murphy fans giddy. There's his return to \"Saturday Night Live\" as host on Dec. 21 before Murphy undertakes a national stand-up comedy tour for the first time in three decades. The laughs continue with a sequel to 1988's \"Coming to America,\" set for a 2020 release. Review:Eddie Murphy's 'Dolemite Is My Name' is his greatest-hits role, and we are here for it Prolific fatherhood:Eddie Murphy welcomes his 10th child, a baby boy Max, with Paige Butcher Impressive, yes. But the chilled-out Murphy insists it's all about finally pushing himself off the supremely comfortable couch longtime girlfriend Paige Butcher had specially built for him at home, on which he has luxuriated for the last six years or so. \"People are saying, 'You’re back! It’s a comeback!' \" says Murphy, going to into excited fan voice while sitting beside his \"Dolemite\" and \"Coming 2 America\" director Craig Brewer. \"I’m like, no, I’m not trying to do a comeback. I’ve just been enjoying sitting on the couch so much. A few years ago, I was like, 'I could sit on this couch and stay here watching 'Little Women: LA' and their exploits.' \" \"Dolemite\" provided the dynamite that sparked the push off the couch to the stage. The feel-good biopic about Moore's efforts to break into outrageous comedy and low-budget movies was a natural segue into more humor – certainly more than his last film, the little-seen 2016 drama \"Mr. Church.\" in which he played a family caretaker. In further divine signs, \"Dolemite\" even allowed for Murphy's couch belly to be required playing Moore, a middle-age man referred to as \"doughy\" in the film. It's a  Murphy shows off with unfettered confidence in \"Dolemite.\" \"After a while, you start to grow on the couch, and it’s like whoooa,\" Murphy says. \"Usually before a movie, I have to get my body together. But this was perfect. It’s like I went all the way Method.\" Murphy is all about the comfort, talking about his deep admiration for the period clothes, but dislike of wearing the dreaded platforms. (\"They are a young man's shoes,\" he scowls.) The costume designer had a pair of sneakers custom-made for Murphy to resemble platforms. \"Still, every day I would come to Eddie and be like, 'Here’s what the day is about,' \" says Brewer. \"And his first question was always, 'Will you be seeing my feet?' \" As \"Dolemite\" came together, Murphy became inspired to make his return to \"SNL,\" stoked by his brief 40th anniversary appearance, which left Murphy hungry for more at night's end. \"Then it was like, 'Hey, everybody, it would be fun to do a sketch.' \" \"Dolemite\" opened the door to a repeat visit, and Murphy says he'll bring back his beloved \"SNL\" characters this time, including Gumby, Mister Robinson and Buckwheat. President Barack Obama provided key encouragement, meeting Murphy before the star received his Mark Twain Prize for American Humor in 2015. Obama asked him two questions: What kind of hair rinse was he using? \"And 'When are you doing comedy again?' \" says Murphy, stepping into Obama's serious voice. \"I was like, 'That’s your question?' When you go into the Oval Office and the president asks when are you doing stand-up, it’s time to do some jokes.\" Murphy is vowing a less-brash return to the stage than his R-rated '80s routine, but still taking material from his own life. \"The last time I did stand-up, I had no kids, I had never been married and I was 27 years old,\" says Murphy. \"I’m 58. I have 10 kids. I’ve been married and divorced. So I have so much stuff to talk about.\" The final push is \"Coming 2 America.\" Of the 40 movies he has starred in, Murphy says the story of his naive African Prince Akeem attempting to pose as a regular American is the one that resonates most with his fans. Akeem returns to America as king in the sequel, which is halfway through filming and reunites the core cast – including James Earl Jones, who just shot his scenes. Murphy is the only one who's really aged, he insists. \"I pull this all together when I see people, but if you saw me on the couch, I would be unrecognizable,\" he deadpans. Don't expect the comedy onslaught to continue. The former box-office juggernaut says his days of doing two or three movies a year will never happen again. It's too much work, and he's over it. \"I cannot imagine being an old dude and you get a call for 6 a.m. pickup,\" Murphy says. But the current spate of work will provide a strong end to a chapter in his storied career. If he's is inspired, Murphy can take interesting projects on. Or if he wants to chill out with bad reality TV, that's OK, too. \"I’m going to leave knowing the last things I did were really funny and successful. In the event I never got off the couch again, it's a nice way to leave it.\"",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Obama: Democrats need to 'chill out’ about crowded 2020 field",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/11/21/obama-democrats-need-chill-out-crowded-2020-field/4265507002/",
      "subtitle": "Obama: Democrats need to 'chill out’ about crowded 2020 field",
      "author": "Savannah Behrmann",
      "content": "WASHINGTON – President Barack Obama has a message for Democrats regarding 2020: chill out. Speaking at a fundraiser in California, the former president attempted to address anxieties over the crowded field of candidates, saying, “Everyone needs to chill out about the candidates, but gin up about the prospect of rallying behind whoever emerges from this process.” Democratic debate: Here are the winners and losers from the November stage His comments come days after he advised \"politically woke\" young people not to be so judgmental, and for Democrats to be \"rooted in reality.\" \"The average American doesn’t think we have to completely tear down the system and remake it. And I think it’s important for us not to lose sight of that,\" Obama said last Friday. His latest message comes one day after 10 Democratic candidates took the stage in Atlanta for the fifth primary debate. Overall, there are still 17 candidates in the race. Former Massachusetts Governor Patrick Deval made a late entry when he announced last week he was running. Former New York Mayor Michael Bloomberg has also teased the idea. Here's the real Democratic debate: Which one can defeat Donald Trump? Obama continued to warn donors to remember that \"flaws are magnified\" during primaries and debates. \"There will be differences,” among the candidates he reiterated, but that they are \"relatively minor\" compared to beating Trump. “The ultimate goal is to defeat a president and a party that has, I think, taken a sharp turn away from a lot of the core traditions and values and institutional commitments that built this country,” he stated. He continued to note the diversity of the 2020 field of candidates, saying, \"We have a number of women candidates, and we have one gay candidate, and those candidates will have barriers if they win the nomination, just like I did,\" nodding at the fact that he was the first African American to win a major party's nomination, and then later, the presidency. \"The field will narrow and there's going to be one person and if that is not your perfect candidate and there are certain aspects of what they say that you don't agree with and you don't find them completely inspiring the way you'd like, I don't care. The choice is so stark,\" Obama stated bluntly when comparing the potential candidate against President Donald Trump. Tickets for the Silicon Valley event, which benefitted the DNC's Democratic Unity Fund, ranged from $10,000 to $355,000, with the highest-paying donors attending a \"VIP reception\" with Obama. Other attendees for the event included Golden State Warriors player Steph Curry and his wife, actress Ayesha Curry.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "'Be rooted in reality': Barack Obama urges moderation to 2020 Democratic presidential contenders",
      "url": "https://www.usatoday.com/story/news/politics/2019/11/16/barack-obama-urges-moderation-2020-democratic-contenders/4213180002/",
      "subtitle": "'Be rooted in reality': Barack Obama urges moderation to 2020 Democratic presidential contenders",
      "author": "Nicholas Wu",
      "content": "Former President Barack Obama, speaking before a crowd of Democratic donors in Washington, D.C., urged caution and moderation to the current field of Democratic presidential contenders. \"The average American doesn’t think we have to completely tear down the system and remake it. And I think it’s important for us not to lose sight of that,\" Obama said to the audience, the Associated Press reported. Obama did not mention any candidates specifically, but the remarks come as two of the most progressive candidates in the Democratic primary field, Sen. Elizabeth Warren, D-Mass., and Sen. Bernie Sanders, I-Vt., have pitched themselves among the top-polling contenders, and another candidate, former Massachusetts Gov. Deval Patrick, entered the race promising a more moderate platform. Deval Patrick:Why Deval Patrick thinks he has a shot in the 2020 Democratic primary \"There are a lot of persuadable voters and there are a lot of Democrats out there who just want to see things make sense. They just don’t want to see crazy stuff. They want to see things a little more fair, they want to see things a little more just. And how we approach that I think will be important,\" Obama continued. The remarks were hosted by the Democracy Alliance, which touts itself as the \"largest network of donors dedicated to building the progressive movement in the United States.\" Former Georgia gubernatorial candidate Stacey Abrams was also featured at the event. The former president also took a swipe at \"views\" that exist on \"left-leaning Twitter feeds,\" calling on candidates to be \"rooted in reality.\" \"Even as we push the envelope and we are bold in our vision, we also have to be rooted in reality and the fact that voters, including the Democratic voters and certainly persuadable independents or even moderate Republicans, are not driven by the same views that are reflected on certain, you know, left-leaning Twitter feeds,\" he said. Obama on 'woke' culture: Obama advises 'woke' young people not to be so judgmental Contributing: The Associated Press",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "A look at Barack Obama's post-presidential life",
      "url": "https://www.usatoday.com/picture-gallery/news/politics/2017/04/21/a-look-at-barack-obamas-post-presidential-life/100750778/",
      "subtitle": "A look at Barack Obama's post-presidential life",
      "author": "null",
      "content": "",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Michelle Obama shares new Thanksgiving photo with Barack and all grown-up Malia and Sasha",
      "url": "https://www.usatoday.com/story/entertainment/celebrities/2019/11/27/barack-obama-michelle-share-new-thanksgiving-photo-malia-sasha/4323984002/",
      "subtitle": "Michelle Obama shares new Thanksgiving photo with Barack and all grown-up Malia and Sasha",
      "author": "Cydney Henderson",
      "content": "The Obama girls are all grown-up! Former First Lady Michelle Obama took to Instagram Wednesday to share a family portrait of herself, husband Barack Obama and their two daughters, Malia, 21, and Sasha, 18, ahead of the Thanksgiving holiday. \"From our family to yours, #HappyThanksgiving!\" she captioned the Instagram snapshot, which has received over 2.7 million likes. The portrait features a casual Barack in a plaid shirt with the top buttons undone, while Michelle opted for a flowy patterned dress for the occasion. However, Malia and Sasha, who entered the White House at ages 10 and 7 respectively, caught everyone's attention with their mature looks. Both women are off to college. More: Michelle Obama's new journal guides fans to write their own 'Becoming' Thursday will mark the Obama's third Thanksgiving Day since leaving the White House. And when it comes to any Thanksgiving beef  – and, we aren't talking about the holiday brisket – Barack offered some friendly advice on squashing any squabbles. He tweeted: \"Before arguing with friends or family around the Thanksgiving table, take a look at the science behind arguing better. And it'll never hurt to try this: 'Listen to people, get them to think about their own experience, and highlight your common humanity.'\" More: Oprah is going on tour with guests Michelle Obama, Lady Gaga, JLo, Dwayne Johnson and more",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    }
  ]
}