{
  "articles": [
    {
      "title": "In McConnell’s boyhood town where his family owned slaves, the reparations debate thrives",
      "url": "https://www.usatoday.com/story/news/politics/2019/07/14/mitch-mcconnell-family-benefited-from-slavery-for-generations-records-show/1727557001/",
      "subtitle": "In McConnell’s boyhood town where his family owned slaves, the reparations debate thrives",
      "author": "null",
      "content": "ATHENS, Ala. – Senate Majority Leader Mitch McConnell was born about 40 miles from his great-great-grandfathers’ Alabama cotton farms, worked by slaves 100 years before. Like so many long-standing Southern white families, McConnell's forebearers built their wealth with free slave labor and cheap land. Two of his great-great-grandfathers owned more than a dozen slaves, census records reviewed by the USA TODAY Network show. The Kentucky Republican has known of his family's slave-owning past since at least 1994, when he wrote a letter to a Limestone County judge requesting information about his great-great-grandfather James McConnell, a slave owner, and the settlement of his ancestor's estate. But his 2016 memoir, “The Long Game,” contains no mention that the \"colorful McConnells” he wrote about owned slaves, NBC reported. As a child during segregation, McConnell lived on the white side of Athens, where black residents were only allowed to visit for work and were typically paid very low wages. While Kentucky's senior senator has consistently condemned slavery and racism throughout his long political career, his vocal opposition to slavery reparations in any form has fueled the growing national debate about whether African Americans deserve restitution for enduring centuries of economic exploitation. \"I don’t think reparations for something that happened 150 years ago when none of us currently living are responsible is a good idea,” McConnell said in June. “We’ve tried to deal with our original sin of slavery by fighting a civil war, bypassing landmark civil rights legislation. We’ve elected an African-American president.” Mitch McConnell:Obama's ancestors owned slaves, too McConnell’s remarks, which made national headlines, came the day before a rare congressional hearing in which Democratic leaders and celebrities sought support for a bill that would establish a committee to “study and consider a national apology and proposal for reparations.” McConnell did not respond this week to a USA TODAY Network request for additional comment about why he opposes reparations despite the lasting economic damages African Americans suffered from slavery and segregation. Records about the McConnell family shed light on the history of the region that residents say is still shaped by the legacy of slavery. The senator’s family history could be a case study in the way many whites built lasting wealth in part by exploiting the labor of enslaved African Americans. The enduring legacy of that history lies in the balance sheets, supporters of reparations contend. On average, black Americans own roughly one-tenth of the amount of wealth that white families do, according to Federal Reserve statistics. David Malone, whose family has roots as deep as the McConnell family in the Limestone County area of northern Alabama, believes reparations are a good idea. Malone's great-grandparents were slaves, and he remembers his grandparents, who were sharecroppers, telling him how white farmowners kept them poor and in debt. \"I know it would be almost impossible to pay everybody related to slaves,\" Malone said. \"When you think of how many people’s lives were lost working for nothing for 400 years, I would agree it should be done. But how it should be done I don’t know.\" See also:McConnell responds to report his ancestors owned slaves In northern Alabama, the McConnell family’s slave-owning history is a common one among longtime white families. His maternal and paternal great-great-grandparents, James McConnell and Richard H. Daley, moved from North Carolina and Virginia during the “Alabama Fever” years in the early and mid-1800s, census records show. They were farmers and may have brought slaves with them when they moved, as many white families did. It was a boom period for the cotton industry, fueled by the revolutionary invention of the cotton gin in 1793, and Alabama had plenty of cheap, fertile land. In 1838, James McConnell, Mitch McConnell’s paternal great-great-grandfather, bought more than 600 acres, according to Limestone County property records. The lush land was near the Tennessee River in the northwesternmost corner of Alabama, on the Tennessee state line. \"In that time, the Tennessee River was raging, and there was fertile land that you could pretty much buy for nothing,” said James Walker, a local historian and retired teacher whose ancestors were slaves and sharecroppers in the area. \"Alabama became a state in 1819, and the Civil War started in 1861. So, for 40 years or so, slavery was big in Limestone County. Slaves outnumbered the whites.\" In 1850, about 17,000 people lived in Limestone County, Alabama, and 8,500 were slaves, said county archivist Rebekah Davis. \"There were a few very wealthy planter families that came here from Virginia and the Carolinas who owned a very large number of slaves,\" Davis said. \"There’s still a lot of black Malones in this county because there was a white Malone who owned lots and lots of slaves. It’s still the most common black name in Limestone County.\" Davis, part of a group working to preserve the only black school in Limestone County for decades after the Civil War, said economic disparities persist, but she doesn’t support paying reparations for the decisions of people who lived more than 100 years ago. In some cases, descendants of slaves have prospered, she noted. The Bridgeforth family of Limestone County is one of America’s most successful black farming families. \"They did have to start one foot behind, and the black section of town is economically depressed,\" Davis said. \"But I don’t think you can equitably say: ‘Your ancestor was worth this much.'\" After NBC News reported that McConnell's great-great-grandfathers had owned 14 slaves, he responded by pointing out that President Barack Obama’s ancestors also were slave owners. \"You know, once again I find myself in the same position as President Obama,\" he said. \"We both oppose reparations, and both are the descendants of slaveholders.\" A USA TODAY Network review of census documents and local property and accounting records show that slave ownership was passed down through generations and persisted in the McConnell family through the Civil War. Richard Daley, McConnell’s maternal great-great-grandfather, reported owning five young female slaves in the 1850 U.S. Census Slave Schedule. But he said that four \"mulatto,\" or mixed race, slaves – ages 20, 18, 4 and 2 – were escaped fugitives. One 22-year-old black woman remained at his farm, the document shows. In the 1860 census, Daley reported owning another five slaves – a 30-year-old \"mulatto\" female, an 11-year-old \"mulatto\" female and two \"mulatto\" boys ages 7 and 10 or 12. They also escaped, according to the document, but one 39-year-old black female slave remained. The names of slaves and receipts of sale transactions are difficult to trace. Slaves either moved with families from other states into Alabama or were purchased at auctions in Montgomery. Josiah and Jane Daley, the parents of Richard Daley, also owned slaves, according to Limestone County Chancery Court records from the mid-1800s. A property dispute mentions their two female slaves, 10-year-old Nancy and 20-year-old Eliza. James McConnell, whose farm was next to Daley’s, had four female \"mulatto\" slaves ages 25, 4, 3 and 1 who all escaped, according to the 1860 census. But, after the Civil War broke out, James McConnell had numerous slaves, according to his accounts the USA TODAY Network reviewed. Mitch McConnell requested some of those records in 1994, nine years after he was first elected to the U.S. Senate. \"I have been researching my family history and would appreciate your assistance,” he wrote in a letter to the Limestone County Archives. “I would like information relating to the settlement of the estate of James McConnell.” The file the senator requested documented James McConnell’s purchases and sales, administered by his son, Andrew. It served as his will and included a list of heirs to receive payments upon his death. In 1860, James McConnell paid $4 for boots, $1.40 for “lady shoes,” $3 for two bushels of wheat, 75 cents for a long-handle shovel, and $3 for “1 fine hat,” records show. The accounts also included slave sales during and after the Civil War. On April 15, 1863, the ledger noted: \"To amount received on sale of slaves Confederate state money $1,500.\" At the time, the area was occupied by Union Army troops, which included two local black infantry regiments. After the war, in March 1867, James McConnell recorded: “To amount received of Elledge by way of compromise of the balance of the amount due on sale of slaves $235.” Mitch McConnell’s family’s prominence is still apparent in Athens, where he lived until the third grade, when his family moved for better opportunities. The McConnell Funeral Home that his grandfather bought during the 1918 influenza epidemic is still operating. And McConnell's great-uncle served as Limestone County probate judge from 1928 to 1946. But there are clear indications that success and equality have come much more slowly for African Americans in Athens. There is only one black-owned business downtown: The Sweetest Thing Tea Room. Black obituaries and funeral notices only recently began being added to the county archives, where white families have long had their loved ones' information recorded. \"Slavery still affects the fortunes of African Americans. On one side of town, there are immaculate lawns and houses with two-car garages,\" said Walker, the local historian. \"On the other side of town, you’ve got rundown shacks and terrible lawns.\" Walker remembers segregated water fountains, restrooms and movie theaters. “It was terrible,” he said. “I never went in the white restroom, but, in the colored restroom, there was paper on the floor, and it was never clean.” Walker’s great-grandfather escaped slavery and became a soldier before establishing his own farm. But the family struggled, and after graduating from Morehouse College, Walker faced a choice of farming cotton or going into the military. He joined the Army in the Vietnam War and retired about two decades later as a lieutenant colonel. He went on to teach African American history. \"The Jewish people received reparations from the Holocaust, and Japanese people received money for their internment during World War II,” said Walker, who supports reparations. \"This country is built primarily on the backs of African Americans. And the primary difference between African Americans and European Americans today is economics.” Meanwhile, Mitch McConnell’s former home with its large windows, porch and white picket fence stands on a tree-lined street near the town square. A neighbor across the street remembered playing with water guns with McConnell as children, according to an Athens News Courier article. Richard Martin, who is white and about the age as the 77-year-old Kentucky senator, remembers segregation differently. His family also has deep roots in Limestone County. “When I was a little boy, we had a little club and initiation was you had to drink out of a black fountain,” Martin said. “We thought it was something, that we were tough. \"I was the little white boy who had everything. We had African American folks working for us. But segregation cheated me, too.\" Martin said he didn’t make any black friends until he joined the Army, and he wishes it had happened earlier. Martin opposes the idea of reparations. But he serves on the board working to preserve the former all-black Trinity High School, which was founded by a missionary in 1865 and provided the rare opportunity for black children to get an education. It’s now a community and event center. Nowadays, race relations are mostly cordial in Limestone County but for a few rare blowups. Cotton is still a popular crop to farm in the area, but technology has replaced the need for most human labor. In April, a brawl erupted at Athens High School after a parent started a \"Black Lives Matter\" chant on campus. When police responded, a fight broke out. A video showed officers hitting several students. The incident prompted gossip around town for a few days, locals said. But they viewed it as an outlier. Limestone County Probate Judge Charles Woodroof, who holds the title McConnell’s great-uncle once had, shares a similar family history. His family moved from Virginia to farm the cheap land in the 1800s, and they owned slaves. But to Woodroof, reparations are an archaic idea. \"I vaguely remember a couple of situations where there might have been two water fountains,\" Woodroof said. \"I know from being in this position and being an attorney here that a lot of people have been highly successful – both African Americans and whites. \"We’re so many generations beyond that. It was part of our history, and we learned it in school. But I don’t experience it.” But for many descendants of slaves in the area, reparations would bring some long-overdue economic justice, they say. “It would mean that somebody has finally agreed that we deserve something, and I would give it to my grandkids,” said Malone, whose relatives were slaves and sharecroppers. \"My grandmother never taught me to hate. But she was treated so bad by the white man. So, she told me: ‘Watch him. Don’t trust him, because if there’s something you’ve got that he wants, he will beat you out of it.'\" Follow Sandy Mazza on Twitter: @SandyMazza.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "5 things to know about Amy McGrath vs. Mitch McConnell in the 2020 Kentucky Senate race",
      "url": "https://www.usatoday.com/story/news/politics/2019/07/09/mitch-mcconnell-amy-mcgrath-what-know-us-senate-2020/1681432001/",
      "subtitle": "5 things to know about Amy McGrath vs. Mitch McConnell in the 2020 Kentucky Senate race",
      "author": "Phillip M. Bailey",
      "content": "Democrat Amy McGrath has entered the 2020 U.S. Senate contest against Republican incumbent Mitch McConnell, which sets up a possible horserace in increasingly conservative Kentucky. McGrath, a former fighter pilot, ran for Congress last year against U.S. Rep. Andy Barr, R-Ky., but came up short despite the Democratic \"blue wave\" that gave them a House majority. McConnell is the most powerful Republican in Congress and has built a war chest that has overwhelmed challengers for more than 30 years. He is fighting to keep control of the Senate as President Donald Trump gears up for his own reelection. Here's what to know. McGrath, 44, is a former Marine fighter pilot with 89 combat missions. She is married to Erik Henderson, a former military service member who is lifelong Republican. They have three children. After serving more than two decades in the military, McGrath, who hails from Georgetown, Kentucky, soon returned to run for Congress. Her campaign began with an announcement video taped in front of a fighter jet and wearing her bomber jacket, which went viral. The story of wanting to be a fighter pilot helped propel McGrath past then-Lexington Mayor Jim Gray, who was the national party's preferred candidate. She beat him by a near-landslide margin in the 2018 primary. Kentucky Senate race:Amy McGrath says she will take on Mitch McConnell in 2020 US Senate race McGrath talked about her military service as much as anything else during that contest, such as how she earned the call sign of \"Krusty\" as an aviator. She said it came from the TV show \"The Simpsons\" and came from the way her curly hair stuck out the sides of her flight suit cap. \"I did not appreciate the name Krusty at first,\" McGrath tweeted. \"In fact, I hated it, which of course sealed the deal for it to become my official call sign. Over the years, I have begun to embrace ‘Krusty' (as I've heard much worse call signs given to others). So there you go.\" National and state Republicans are prepared to defend McConnell at all costs. The importance of having him in control of the Senate, where the GOP holds a 53-47 majority, has come into focus more as Democrats seized the House last November. McConnell has blocked many of the House Democrats more ambitious liberal proposals, such as making Election Day a federal holiday. He has also vowed to keep the door shut on other plans such as Medicare for all and the Green New Deal that progressive advocates are pushing for in 2020. \"If I'm still the majority leader of the Senate, think of me as the Grim Reaper,\" McConnell said in April. \"None of that stuff is going to pass. None of it.\" Previously:Who won the Democratic presidential debate? It might be Mitch McConnell McConnell also has singlehandedly ushered in a wave of conservative judges to the federal bench. In 2014, when he was the minority leader, he said Kentucky was better served by having him in leadership. Now, as majority leader, he is arguing that he serves middle America as a whole, and he will point to the results of the U.S. Supreme Court and other lower courts as why that role needs to continue through 2020. Conversely, Democrats have painted McConnell as a self-interested politician who cares more about enriching himself and accumulating more personal power than he does about average Kentuckians. In recent weeks, several reports have surfaced questioning the relationship and ethics surrounding deals and projects involving the senator and his wife, Elaine Chao, who serves as U.S. Transportation secretary. Senate Democratic Leader Chuck Schumer, of New York, and other left-leaning groups had been beseeching McGrath to run since last November. In May, Jon Soltz, chairman of VoteVets, said she “is the one who has what it takes\" to defeat McConnell. “She’s a Marine fighter pilot who’s not afraid of much especially the special interests who will do what it takes to beat her,” he said in an email to supporters. “That’s why it’s so important she knows we’re with her.” Last year:Donald Trump blasts Amy McGrath as an 'extreme liberal' in Kentucky The thinking is that McGrath, who wasn't the national party's choice for Congress last year, now has the national name recognition to mobilize donors as much as voters. McGrath raised roughly $8.6 million when she ran for Congress last year, which was $3 million more than U.S. Rep. Andy Barr did. During the 2018 election, she emphasized the need to protect pieces of the Affordable Care Act, acknowledged the impacts of climate change and called for restoring respect in American leadership. Republicans have alluded that they will counter with a playbook from 2018, and remind voters that McGrath couldn't pull off a victory in the more moderate central Kentucky congressional district. Speaking on MSNBC, McGrath described herself as a moderate saying she cringed that the Democratic presidential candidates have crawled too far to the left. She said she opposes taking away private health insurance as part of a \"Medicare for all\" plan or subsidizing health insurance \"for illegal immigrants.\" Obamacare:Affordable Care Act threatened as Trump administration, GOP states fight US House, Democratic states in court McConnell's squad will likely focus on audio leaked from a Massachusetts fundraiser, in which McGrath boasted her liberal credentials. “I am further left, I am more progressive, than anyone in the state of Kentucky,” she said at the time. Trump proved to be an asset when McGrath was last on the ballot in a race where Democrats thought they could take a congressional seat. The stakes will be even higher next year, as McConnell, the majority leader, hopes to utilize Trump's popularity to shield his own. Trump has a net approval of plus 16 points, according to the polling firm Morning Consult. McConnell, conversely, is the least popular U.S. senator in the country, according to the same surveys. He has a net approval of negative 16 points. US Senate 2020 race:What to know about Mitch McConnell's Senate reelection bid in Kentucky Team Mitch launched its first advertisement with a three-minute production that featured Trump heaping praise on McConnell for being \"Kentucky tough\" during the tumultuous confirmation of Justice Brett Kavanaugh, who was appointed to the high court despite being accused of sexual assault as a student. When Trump reportedly questioned if Republicans were committed to getting Kavanaugh across the finish line, McConnell reportedly told the president there was no wavering, and that the he was \"stronger than mule piss.\" If McGrath gets within striking distant of McConnell, who has raised $2.1 million thus far, it will be no surprise if he asks and receives a swoop in from Air Force Once. Democrat Steven Cox, a health care professional from Madisonville, is in the race and others could still enter the race despite McGrath being anointed by the national party. Sports radio host Matt Jones isn't afraid to speak out as the voice behind a statewide media empire around University of Kentucky sports. He has expressed interest in running for U.S. Senate but has complained the Democrats have tried to lock him out of the race. \"The national party is all in on Amy McGrath,\" Jones said in May. \"All their efforts, all their recruitment, it's all in on her. They won't even speak to me until they go with her.\" Jones said he doesn't believe McGrath can win statewide, but he told the Courier Journal that he was waiting on McGrath's decision and would let the public know his intentions after returning from a June vacation. State Rep. Rocky Adkins is another contender who may not be known at the national level but is beloved among many Kentuckians who believe he could be a formidable Democratic challenger in a general election. The House Democratic leader hails from eastern Kentucky and has a more conservative record than either McGrath or Jones, which could appeal to rural voters. Steyer is in:Billionaire and activist Tom Steyer announces run for president Adkins won 67 of 120 counties in the gubernatorial primary but came up short against state Attorney General Andy Beshear in a four-way election. Others are encouraging Adkins to run for the House against U.S. Rep. Hal Rodgers, who represents the eastern half of the state. Either way, Adkins would have to give up his seat and position as Democratic leader if he wants to run for higher office in 2020. Reporter Phillip M. Bailey can be reached at pbailey@courierjournal.com.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Betsy Ross flag: Mitch McConnell tweets out flag that omits Kentucky",
      "url": "https://www.usatoday.com/story/news/politics/2019/07/04/mitch-mcconnell-tweets-out-betsy-ross-flag-which-missing-kentucky/1648855001/",
      "subtitle": "Betsy Ross flag: Mitch McConnell tweets out flag that omits Kentucky",
      "author": "Nicholas Wu",
      "content": "WASHINGTON – Senate Majority Leader Mitch McConnell waded into the controversy over the Betsy Ross flag on Thursday, tweeting out a picture of the flag with the caption \"Happy Fourth of July!\" Twitter users were quick to note that the Commonwealth of Kentucky, McConnell's home state, is not included on the flag. The flag has been a flashpoint for controversy after Nike controversially canceled its decision to produce a shoe with the flag on it. According to a Wall Street Journal report, Colin Kaepernick had contacted Nike to explain that the flag had been appropriated as a symbol by some extremist groups and that Kaepernick and others found the flag offensive. Republicans had lashed out at Nike after the company canceled the shoe. Arizona's Republican Governor Doug Ducey vowed to cancel incentives the state had offered Nike to open a shoe manufacturing plant near Phoenix. Sen. Ted Cruz, R-Texas, urged Americans to boycott Nike's products and said Nike had \"decided their shoes represent snide disdain for the American flag.\" More:Nike's decision to cancel 'Betsy Ross flag' shoe prompts backlash from Arizona governor More:Tennessee Smokies delete tweet showing Betsy Ross flag drawn on infield McConnell also criticized Nike's decision. \"If we are in a political environment where the American flag has become controversial to Americans, I think we have a problem,\" McConnell said. Twitter users noted that Kentucky was not included on the flag McConnell tweeted, as the 13 stars on the flag symbolize the original 13 colonies of the United States. Kentucky did not become a state until 1792 and was a county of Virginia before then. Marie Connor, a comedian, noted that Kentucky was not a state at the time of the flag's sewing. Dennis DiClaudio, a humor and fiction writer, quipped, \"Only good thing about this flag is that Kentucky's not represented.\" Another Twitter user asked if Kentucky's omission from the flag meant that \"we can eject Kentucky from the USA.\" McConnell had weighed in on the flag controversy earlier in the week as well. On Tuesday, McConnell said that he would \"make the first order\" if Nike reinstated production of the shoes with the Betsy Ross flag. Contributing: Tom Schad, Associated Press More:Like what you’re reading? Download the USA TODAY app for more",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Amy McGrath says she will take on Mitch McConnell in 2020 US Senate race",
      "url": "https://www.usatoday.com/story/news/politics/2019/07/09/amy-mcgrath-to-run-against-senate-majority-leader-mitch-mcconnell-2020-election/1680773001/",
      "subtitle": "Amy McGrath says she will take on Mitch McConnell in 2020 US Senate race",
      "author": "Phillip M. Bailey",
      "content": "Kentucky Democrat Amy McGrath is suiting up to enter the 2020 U.S. Senate race against Republican Majority Leader Mitch McConnell. The former Marine fighter pilot ended months of speculation over whether she would make a run for one of the Bluegrass State’s top seats in Washington, making the announcement with a video posted to YouTube early Tuesday ahead of an appearance on MSNBC’s \"Morning Joe.\" In the video, McGrath says she wrote to McConnell when she was 13 telling him she wanted to fly combat jets and fight for the U.S. when she was an adult. \"He never wrote back,\" she says in the video. \"I'm Amy McGrath, and I've often wondered, how many other people did Mitch McConnell never take the time to write back or even think about?\" Kentucky:What to know about Mitch McConnell's Senate reelection bid in Kentucky McGrath's name has been bounced around as a possible contender for the Democratic nomination since her failed 2018 attempt to knock off Rep. Andy Barr in Kentucky's 6th Congressional District. The rumors continued to take shape when it was reported this year that Senate Democratic Leader Chuck Schumer of New York, McConnell’s counterpart and chief adversary, was encouraging McGrath to run. McGrath, a mother of three from Georgetown, Kentucky, has since been spotted at community events across the state and has regularly slammed McConnell on social media. Tuesday morning on MSNBC, she said Kentucky is ready for a change in the nation's capital. \"I think this is a message that Kentuckians are ready for,\" she said. McGrath, who was painted as too liberal by Republicans last year, described herself on the program as a moderate. She also tried to put some distance between herself and national Democrats running for president. Trump on Darroch:Trump steps up attacks on British ambassador, calling Kim Darroch 'very stupid guy' For instance, she said that she does not favor taking away private insurance as part of a federal overhaul and opposes subsidizing health insurance for undocumented immigrants as some presidential candidates have indicated. \"I think many Kentuckians feel that we have a problem with getting health insurance for many Americans, so we need to fix that first,\" McGrath said on MSNBC. The McConnell campaign did not immediately respond to a request for comment about McGrath’s announcement. But the Republican's campaign sent a tweet welcoming McGrath to the race and featuring her comments in support of abortion and criticizing the Trump administration's plan to build a wall at the southern border. McGrath has never held office, but she said in Tuesday's TV interview that that shouldn't be held against her. \"I’m not doing this because, like I said, I want to be some politician,\" she said. \"I‘m doing this because I care about my country, and I care about Kentucky.\" Beating McConnell, who has served in the Senate since 1985, won't be easy, she acknowledged. But she made the case that the senator has prevented Trump from passing legislation that people in the Bluegrass State have supported, such as bringing jobs to Kentucky and lowering drug prices. \"Who stops them along the way? Who stops the president from doing these things? Mitch McConnell,\" McGrath said. \"And I think that that’s very important and that’s going to be my message – the things that Kentuckians voted for Trump for are not being done. He’s not able to get it done because of Senator McConnell.\" McGrath swooped into Kentucky’s political scene in August 2017, when she announced her upstart 2018 congressional campaign in a viral YouTube video. She brought no political experience to the race but carried a strong resume as a Marine fighter pilot with 89 combat missions, including bombings of al-Qaida and the Taliban. National Democrats, however, weren’t sold on the neophyte’s candidacy and recruited then-Lexington Mayor Jim Gray as their preferred candidate. McGrath whipped him and four other Democrats by a near-landslide margin in the 2018 primary to claim the nomination. The McGrath campaign in that race was defined by strong television and internet ads, including her announcement video, where she stood in front of a fighter jet wearing her bomber jacket. She noted then as well how McConnell never wrote back to her when she wrote to him about her dream to serve the country when she was 13 years old. McGrath retired from the Marines in 2017 as a lieutenant colonel and moved back to Kentucky. At the urging of former U.S. Rep. Ben Chandler, she jumped into the House race against Barr, who had ousted Chandler in 2012. Trump approval rating:Trump approval rating jumps to highest level of his presidency in Washington Post/ABC News poll As a candidate, she favored saving the Affordable Care Act but said she ultimately wants universal health care coverage for all Americans. She also supported the legalization of medical marijuana, said that climate change is “a fact” and that Kentucky should try to lead the nation in renewable energy. Republicans, however, hammered McGrath relentlessly on abortion after she said: “I don’t think the government should be involved in a woman’s right to choose what is happening to her body.” The GOP had a field day with leaked audio from a fundraiser in Massachusetts, in which she said, “I am further left, I am more progressive, than anyone in the state of Kentucky.” And they quibbled over whether she had exaggerated her military record because during some of her combat missions, she flew in the second seat rather than as a pilot. As the Democratic “blue wave” became the center of attention for the 2018 cycle, McGrath appeared poised to defeat Barr. But a last-minute visit by Trump helped Barr to victory by a little more than 3 percentage points. Obamacare:Affordable Care Act threatened as Trump administration, GOP states fight US House, Democratic states in court But that put her squarely in the sights of national Democrats who were looking for a candidate who could raise money from a national base, to take on McConnell – the man who she says never wrote back to her when she was a teenager. McConnell has already launched his reelection campaign. It raked in $2.1 million since January and has $5.6 million in cash on hand. The Republican will lean heavily into how his majority leader role benefits the state, while boasting about the success of giving the nation’s judiciary a conservative makeover since Trump took office in 2017. McConnell has relished in being the “Grim Reaper” for House Democrats and liberal America as a whole. It started with him blocking then-President Barack Obama from making a critical appointment to the U.S. Supreme Court in 2016. For the past two and a half years, McConnell has talked about how he \"led the fight for our conservative values\" by helping confirm Justices Neil Gorsuch and Brett Kavanaugh, who was hit with an allegation of sexual assault as a high school student in the middle of his confirmation. Trump's White House:Donald Trump's White House is leaking - literally - on the media Kentucky is a state in which Trump remains popular, and McConnell will try mightily to remain behind that shield. Trump has a net approval in the state of plus 16 points, according to the polling firm Morning Consult. McConnell, conversely, is the least popular U.S. senator in the country, according to the same surveys. He has a net approval of negative 16 points. Republicans hold a 53-47 majority in the Senate, with two independents caucusing with the Democrats, and its makeup will be essential for whoever controls the White House in 2021. Democrats need a net gain of four seats if Trump wins reelection or three seats if they take back the White House. They are eyeing pickups in states such as Colorado, Maine and Arizona. But that means the party will also have to keep all of its current seats. If McConnell is still majority leader, it will handicap a Democratic president’s agenda. That fact was acknowledged during the first Democratic presidential debate on NBC when the first 10 candidates were asked by moderators if they had a plan to combat the Kentucky Republican. \"Being criticized for stopping the liberal agenda and confirming conservative judges, I love it,\" McConnell told reporters in Washington, D.C. after the June 26 debate. Report:Sen. Mitch McConnell's family owned 14 slaves in Alabama Other Democrats who are rumored to be considering a run in 2020 are statehouse Minority Leader Rocky Adkins, an eastern Kentucky lawmaker who came in second in the gubernatorial primary, and sports radio host Matt Jones, who has built a powerful media empire for being known as the No. 1 University of Kentucky basketball fan. Jones has said publicly on his television program that McGrath can’t win statewide coming off the heels of losing in the confines of central Kentucky’s more moderate congressional district. Democrat Steven Cox, of Madisonville, a health care professional, is also running. Former state Rep. C. Wesley Morgan, a Richmond liquor store owner, is running in the Republican primary.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Donald Trump tweets Democrats 'coming after' Mitch McConnell as Amy McGrath enters race",
      "url": "https://www.usatoday.com/story/news/politics/2019/07/09/trump-tweets-amy-mcgrath-entering-senate-race-oust-mcconnell/1690053001/",
      "subtitle": "Donald Trump tweets Democrats 'coming after' Mitch McConnell as Amy McGrath enters race",
      "author": "David Harten",
      "content": "President Donald Trump took to Twitter on Tuesday night, weighing in on Amy McGrath's decision to enter the 2020 Senate race against Senate Majority Leader Mitch McConnell. Trump claimed that Democrats are \"coming after our great Kentucky Senator, Mitch McConnell, with someone who compared my election to September 11th … .\" He implied that McGrath wasn't qualified to take McConnell's position. \"… Why would Kentucky ever think of giving up the most powerful position in Congress, the Senate Majority Leader, for a freshman senator with little power in what will hopefully be the minority party,\" Trump tweeted. His remarks come after a day filled with them from all sides over McGrath's entry into the race against McConnell for his Senate seat. The former Marine announced she was running Tuesday morning. Related:Amy McGrath challenges Mitch McConnell as a pro-Trump Democrat Also:5 things to know about McGrath vs. McConnell in the 2020 Senate race Later in the day, McGrath came to the defense of Trump, saying that McConnell has stopped the president from getting things done in Washington. \"And you know what? Who stops them along the way? Who stops the president from doing these things? Mitch McConnell,\" she continued on MSNBC. \"And I think that that’s very important, and that’s going to be my message — the things that Kentuckians voted for Trump for are not being done. He’s not able to get it done because of Senator McConnell.\"",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell declines to single out Trump over racist tweets; says 'all of us' should tone down rhetoric",
      "url": "https://www.usatoday.com/story/news/politics/2019/07/16/mitch-mcconnell-says-trump-no-racist-says-all-us-blame/1745513001/",
      "subtitle": "Mitch McConnell declines to single out Trump over racist tweets; says 'all of us' should tone down rhetoric",
      "author": "Ledyard King",
      "content": "WASHINGTON – Senate Majority Leader Mitch McConnell responded to the furor over President Donald Trump's racist tweets against four freshmen Democratic lawmakers saying \"all of us\" should lower the volume on \"incendiary rhetoric.\" McConnell, R-Ky., refused to label as racist Trump's tweets over the weekend telling the four Democratic congresswomen who have been fiercely critical of the administration's immigration policies to \"go back\" to the countries they \"originally came from.\" \"The president's not a racist,\" McConnell flatly told reporters on Capitol Hill Tuesday. The Kentucky senator also declined to single out Trump for escalating racial tensions, instead laying part of the blame on the four House members, Reps. Alexandria Ocasio-Cortez, D-N.Y., Ayanna Pressley D-Mass., Rashida Tlaib, D-Mich., Ilhan Omar, D-Minn., for espousing \"vile\" and \"anti-semitic ... insults.\" All are U.S. citizens and all but Omar were born in the United States. They've sharply questioned U.S. policy towards Israel and the Palestinians and denounced Trump's immigration policies as heartless. Trump appeal:Donald Trump to GOP: Don't show 'weakness' by siding with Democrats on condemnation of tweets 'All about politics':House GOP leaders refuse to condemn Donald Trump's racist tweets, say the uproar is 'all about politics' \"From the president to the Speaker (Nancy Pelosi, D-Calif.) to freshman members of the House, all of us have a responsibility to elevate the public discourse,\" McConnell, the top Republican on Capitol Hill, said. \"Our words do matter. We all know politics is a contact sport. But it's about time we lowered the temperature all across the board. All of us ought to contribute to a better level of discourse.\" As McConnell read his prepared remarks to reporters, the Democrat-led House was debating a resolution condemning the president's tweets. Senate Democratic Leader Chuck Schumer, D-N.Y., said he plans to introduce a similar resolution in the Senate. In addition, a top aide to Vice President Mike Pence defended Trump's tweets by citing the presence of McConnell's Taiwanese-born wife – Transportation Secretary Elaine Chao – in the Trump administration as an example of the racial diversity among the president's top advisers. McConnell's roots:In McConnell’s boyhood town where his family owned slaves, the reparations debate thrives \"When people write that the president has racist motives, look at who's actually serving in Donald Trump's cabinet,\" Marc Short, Pence's chief of staff said in a Monday interview on Fox Business, referring to Chao. Asked if he would ever tell someone to \"go back to your country,\" McConnell sidestepped. \"Look, I'm obviously a big fan of legal immigration. It's been a big part of my family for a quarter of a century,\" he said. \"As I look around the country and watched the contributions that have been made by new arrivals and the children of new arrivals, it's been reinvigorating America for hundreds of years.\" Contributing: Nicholas Wu, Deborah Barfield Berry",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell responds to report his ancestors owned slaves by pointing out Obama's did too",
      "url": "https://www.usatoday.com/story/news/politics/2019/07/09/mitch-mcconnell-says-barack-obama-ancestors-also-owned-slaves/1685753001/",
      "subtitle": "Mitch McConnell responds to report his ancestors owned slaves by pointing out Obama's did too",
      "author": "Nicholas Wu",
      "content": "WASHINGTON – Senate Majority Leader Mitch McConnell responded to an NBC report that his ancestors owned slaves by telling reporters he and former President Barack Obama were \"once again in the same position.\" \"I find myself once again in the same position as President Obama. We both opposed reparations and we both are the descendants of slave-owners,” McConnell said in a Tuesday news conference following Senate Republicans' weekly conference meeting. McConnell had been asked about the report, which found two of his great-great-grandfathers owned at least 14 slaves, according to NBC's search of the 1850 and 1860 censuses. More:Mitch McConnell: We paid for 'sin of slavery' by electing Obama McConnell's comments about Obama referred to reports from 2007 about the then-presidential candidate's ancestry on his mother's side. The Baltimore Sun and other outlets had retraced Barack Obama's ancestry to confirm the geneology, and found in the 1850 census that Obama's great-great-great-great grandfather on his mother's side owned two slaves, as did one of Obama's great-great-great-great-great-grandmothers. The Obama campaign had addressed the reports at the time, telling the Baltimore Sun in March 2007, \"it is a true measure of progress that the descendant of a slave owner would come to marry a student from Kenya and produce a son who would grow up to be a candidate for president of the United States.\" Ancestry.com had also done an analysis in 2012 and found that Obama's mother was also descended from a slave named John Punch, who was the first African to be declared \"enslaved for life\" in early Colonial Virginia. More:Trump says slavery reparations debate is 'interesting,' but doesn't 'see it happening' More:Ta-Nehisi Coates, Danny Glover call for slavery reparations before Congress Obama opposed reparations as a \"practical matter\" when asked about it by Atlantic writer Ta-Nehisi Coates, saying, \"I have much more confidence in my ability, or any president or any leader’s ability, to mobilize the American people around a multiyear, multibillion-dollar investment to help every child in poverty in this country than I am in being able to mobilize the country around providing a benefit specific to African Americans as a consequence of slavery and Jim Crow.\" McConnell previously sparked controversy about reparations, telling reporters that reparations were not a \"good idea\" and that the United States had tried to solve the \"original sin of slavery\" by, among other things, electing an \"African American president.\" “I don’t think reparations for something that happened 150 years ago, when none of us currently living are responsible, is a good idea,” McConnell said on June 19. “We’ve tried to deal with our original sin of slavery by fighting a civil war, by passing landmark civil rights legislation. We’ve elected an African American president.” The idea of reparations has recently broken into the political mainstream. The House Judiciary Committee Subcommittee on the Constitution, Civil Rights, and Civil Liberties held a hearing on June 19 on a bill, H.R. 40, that would set up a commission to explore the possibility of reparations for slavery. The bill is unlikely to pass, but several Democratic presidential candidates have come out in favor of some form of reparations or the study of ways to implement reparations, including Booker, Sen. Elizabeth Warren, Sen. Kamala Harris, and Marianne Williamson. Contributing: Phillip M. Bailey, Louisville Courier Journal More:Like what you’re reading? Download the USA TODAY app for more",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "3 ways for Elizabeth Warren or another Democratic president to 'deal with' Mitch McConnell",
      "url": "https://www.usatoday.com/story/opinion/2019/07/11/democratic-president-like-warren-could-fight-mcconnell-column/1692984001/",
      "subtitle": "3 ways for Elizabeth Warren or another Democratic president to 'deal with' Mitch McConnell",
      "author": "Jill Lawrence",
      "content": "It’s on between former Marine fighter pilot Amy McGrath and Republican Mitch McConnell in Kentucky. McGrath, 44, may be the strongest candidate the Democrats could land for next year's race against the Senate majority leader. But that doesn’t mean she’ll win. She lost a House race last year amid a blue wave, and now she’s taking on the Washington power broker most likely to make a Democrat turn bright red and start to sputter. And I don’t think that’s just me. There was a telling moment at the first Democratic debate when NBC News’ Chuck Todd asked Sen. Elizabeth Warren what she had in mind if she were elected president and Republicans still held a Senate majority. “Do you have a plan to deal with Mitch McConnell?” he asked. “I do,” Warren said. Even with a Republican Senate, she said, “the fight still goes on. It starts in the White House, and it means that everybody we energize in 2020 stays on the front lines come January 2021. We have to push from the outside, have leadership from the inside, and make this Congress reflect the will of the people.” That didn’t sound like much of a plan to me. Here are a few concrete ideas: First, Warren could have elaborated on her exhortation to \"push from the outside.\" Democratic voters and candidates must send a message to rich donors and advocacy organizations: They need to finance massive, sustained publicity campaigns for whatever needs attention. Use TV and the web, and barnstorm the country like Jim DeMint and Ted Cruz did in 2013 for the Heritage Foundation. Their tour was one of many ceaseless efforts to kill the Affordable Care Act. Conservatives tried dozens of times while President Barack Obama was in office and there was zero chance he would sign a repeal bill; they tried and failed in Congress when President Donald Trump took office, and they are still trying in court — inflaming the base, raising money, turning out votes. Democrats could have used persistence like that when McConnell blocked Obama's Supreme Court nominee, Judge Merrick Garland, leaving the court with only eight justices for nearly a year. They also could have used it when the Russians were interfering in the 2016 election. They could use it now, when there should be a constant drumbeat about Trump. Any aspect of his presidency would do. I’d love to see the obstruction of justice portion of the Mueller report narrated or re-enacted in a collection of ads, like a miniseries. Second, push the legal and constitutional envelope. Look at what Trump is doing now on the census citizenship question. The Supreme Court rejected his rationale for adding it. He says he’s going to get it anyway, maybe by executive order. Will it work? Heck, it’s almost unconstitutional on its face. But Trump is kick-starting a court fight over whether he has that power, and maybe he will win. Obama could have experimented along those lines when, with nearly a year left in his second term, McConnell refused to consider Garland for the Supreme Court because it was a presidential election year — a fraudulent rationale since he has already said that he would of course approve a Trump nominee in the presidential election year of 2020. During a congressional recess or really at any point, Obama could have put Garland on the court and claimed that the Senate had failed to advise and consent. The move would have been challenged and tied up in court, but at least the public would have been aware that something really important was going on and that their president was fighting the good fight. And, like Trump and the census fight, maybe Obama would have won. It's not too late to focus some of that outside pressure on the Supreme Court. In the past two years, which cases affecting people’s lives likely would have been decided a different way had McConnell not blocked Garland? He calls it the most consequential act of his career. I agree. Someone should be making those consequences clear. The best alternative, of course, would have been if Democrats had eliminated the filibuster on Supreme Court nominations when they did so for Cabinet and lower court nominations in 2013. They didn't, leaving it to McConnell and Republicans to knock it down in 2017. Which brings us to a third way to handle McConnell in the event the 2020 election produces a Democratic president, a Democratic Senate majority and a reelected McConnell leading a minority large enough to block bills. Onstage at the debate, Warren could have pivoted to her own \"leadership from the inside\": She was the first major 2020 candidate to endorse ending the filibuster for legislation. You need 60 votes to cut off filibusters intended to paralyze the Senate, and majorities are typically not that big. Democrats would need only 51 senators to end it for legislation. Then they’d be able to pass bills with 51 votes — or even just 50 plus a Democratic vice president. In other words, majority rule instead of supermajority rule. This matters a lot. To take just one example from 2013, a bipartisan gun background check bill “failed” in the Senate because “only” 54 senators voted to end a filibuster. You know where else it would matter? Democracy bills like D.C. statehood, a new voting rights act, gerrymandering reforms and election security. McConnell won’t bring them up. So a Democratic president would have ways to deal with McConnell, assuming he wins reelection. Getting a head start on the outside game now, with ads and other types of pressure, could help McGrath make sure he doesn’t. Jill Lawrence is the commentary editor of USA TODAY and author of \"The Art of the Political Deal: How Congress Beat the Odds and Broke Through Gridlock.\" Follow her on Twitter: @JillDLawrence",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Report: Sen. Mitch McConnell's family owned 14 slaves in Alabama",
      "url": "https://www.usatoday.com/story/news/politics/2019/07/09/mitch-mcconnells-family-owned-14-slaves-alabama-report-says/1680745001/",
      "subtitle": "Report: Sen. Mitch McConnell's family owned 14 slaves in Alabama",
      "author": "Phillip M. Bailey",
      "content": "Senate Majority Leader Mitch McConnell's opposition to the U.S. paying reparations to descendants of slaves has bubbled back to the surface following a report saying his Alabama family owned more than a dozen slaves. The NBC News report published Monday says census information and ancestry records show two of the Kentucky Republican's great-great-grandfathers — James McConnell and Richard Daley — owned at least 14 slaves in Limestone County, Alabama. “I don’t think reparations for something that happened 150 years ago, when none of us currently living are responsible, is a good idea,” McConnell said in June. \"We’ve tried to deal with our original sin of slavery by fighting a civil war, by passing landmark civil rights legislation. We’ve elected an African American president.\" McConnell's comments came a day before the Democratic-controlled House held a hearing on reparations for slavery. The GOP leader's office did not immediately respond to the Courier Journal's request for comment Monday evening. NBC News says a review of county “Slave Schedules” in the 1850 and 1860 census reports shows all but two of the slaves McConnell's great-great-grandfathers owned were women. NBC included scanned versions of the census documents on its website, but the Courier Journal has not independently verified the news report. University of Louisville professor Ricky L. Jones, who is chair of the Pan-African Studies Department and frequent Courier Journal contributing columnist, said Monday that given McConnell's roots are from Alabama, it isn't a surprise that his ancestors had human chattel. Read this:Mitch McConnell on reparations for slavery: Not a 'good idea' \"In his defense, and to paraphrase him on reparations, he wasn't alive then,\" Jones said. \"He can't change that. What is unfortunate is that he maintains a certain level of damaging racial insensitivity and indifference that marked his distant kin. He can change that. Let's hope he will.\" Jones said McConnell and his family, like other slave owners, did benefit from the free labor and subjugation of African Americans, however. \"McConnell benefited like any other individual, family or country would benefit — through the accumulation of generational wealth and privilege directly tied to the beastial submersion of other human beings into a system of long-term free labor and breeding,\" Jones said. \"The benefits are far reaching and innumerable.\" Mitch McConnell:We paid for 'sin of slavery' by electing Obama McConnell, who is seeking reelection next year, has said part of his opposition to reparations is that it would be difficult to figure out how and whom to compensate. Democratic Rep. Sheila Jackson Lee, of Texas, has introduced legislation that calls for a study on reparations. A similar proposal has been put forth in the Senate by Democrat Cory Booker, of New Jersey, however that bill hasn't moved. Kentucky poet and activist Hannah Drake said the NBC News report underscores the need for such studies, particularly of those who oppose paying reparations today. \"Perhaps that is why McConnell is so opposed to reparations, because it would mean he would have to take a long hard look in the mirror and admit that his family benefited from owning black bodies, mainly the bodies of black women,\" she said. \"Before Mitch McConnell attempts to tell this nation about reparations, perhaps he can start by dealing with his own family's part in slavery,\" Drake added. \"What, if anything, does he think his family owes the descendants of the slaves his family owned? Be assured your sins will and have found you out, Mitch.\" Betsy Ross flag:Mitch McConnell tweets out flag that omits Kentucky In 2016, a U.N. panel declared the U.S. did owe reparations to African Americans, as compensation for \"the legacy of colonial history, enslavement, racial subordination and segregation, racial terrorism and racial inequality.\" A University of Connecticut researcher — calculating the labor men, women and children contributed from 1776 to 1865 — estimated in 2016 that the price tag for slavey alone would cost between $5.9 trillion to $14.2 trillion to give historical reparations. Others have estimated it would be as high as $17.1 trillion. While reparations has become a more-talked-about subject among Democrats and the political left, it remains a non-starter for Republicans. McConnell's surrogates were quick to dismiss the NBC News report when asked about it Monday. \"So far this year the news media has shockingly uncovered that... Mitch McConnell's is from Alabama,\" said CNN commentator Scott Jennings, another Courier Journal contributing columnist. \"Excellent work.\" Josh Holmes, a former McConnell chief of staff, rebuffed the report as \"ridiculous\" and pointed to a 2007 story, which found then-candidate Barack Obama's ancestors on his mother's side had owned slaves. \"You know who else is the descendant of slave owners and opposes reparations — Barack Obama,\" he told the Courier Journal. The research, which was retraced by the Baltimore Sun, showed one of Obama's great-great-great-great grandfathers, George Washington Overall, owned two slaves who were recorded in the 1850 census in Nelson County, Kentucky. Other records showed that one of his great-great-great-great-great-grandmothers also owned two slaves. In 2012, Ancestry.com also dived into the background of Obama's mother and found she was the descendent of a slave named John Punch, who was the first African to be declared \"enslaved for life\" in early Colonial Virginia. Jon Stewart:Former 'Daily Show' host slams McConnell over 9/11 victim fund on Stephen Colbert's show Obama said he believed reparations were just, but that he didn't think such a proposal could pass Congress, where McConnell controlled the Senate, when he was asked about the subject in 2016. \"I’m not so optimistic as to think that you would ever be able to garner a majority of an American Congress that would make those kinds of investments above and beyond the kinds of investments that could be made in a progressive program for lifting up all people,\" Obama said. \"I have much more confidence in my ability, or any president or any leader’s ability, to mobilize the American people around a multiyear, multibillion-dollar investment to help every child in poverty in this country than I am in being able to mobilize the country around providing a benefit specific to African Americans as a consequence of slavery and Jim Crow,\" he added. McConnell's views on race came into focus earlier this year when actor Samuel L. Jackson blasted the GOP leader in a wide-ranging interview with Esquire. \"I'm angrier now about it than I was then, just because I see these guys and I know these are the same guys: Trump and all those a--holes, Mitch McConnell,\" Jackson said. \"But they're the same f---ing guys. And when I hear their voices, I hear the same voices. Those twangs where they didn’t specifically call you 'n-----,' they said 'nigra.'\" McConnell's defenders often point to his remarks against racial slurs and his praise of civil rights legislation during the 1960s when he has faced with charges of racism. McConnell chastised Everett Corley, a Kentucky Republican who ran for the state legislature last year and who criticized McConnell's marriage to U.S. Transportation Secretary Elaine Chao, who is Asian, during a 2014 appearance on a white nationalist YouTube show. \"This racist behavior is completely despicable,\" McConnell told the Courier Journal at the time. \"Such backwards views and hateful rhetoric must be given no corner in the Republican Party or anywhere in America. I’m not at all surprised that the state party is not affiliated with or in any way supporting this individual.\" McConnell also lashed out against pizza mogul John Schnatter, who lives in Kentucky, when the Papa John's founder was skewered last year for using the N-word during a media training session. McConnell supported removing Schnatter's name from the University of Louisville's football stadium. In 2015, McConnell also called for removing a statue honoring Jefferson Davis, the president of the confederacy during the Civil War, from the Kentucky Capitol building. Reporter Phillip M. Bailey can be reached at pbailey@courierjournal.com.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "A Kentucky farmer, ex-Marine wants to challenge Mitch McConnell in 2020 US Senate race",
      "url": "https://www.usatoday.com/story/news/politics/2019/07/18/democrat-mike-broihier-challenge-mitch-mcconnell-2020-kentucky-senate-race/1764747001/",
      "subtitle": "A Kentucky farmer, ex-Marine wants to challenge Mitch McConnell in 2020 US Senate race",
      "author": "Phillip M. Bailey",
      "content": "LOUISVILLE, Ky. – Kentucky Democrats will have more options on next year's ballot when deciding who should take on Senate Majority Leader Mitch McConnell in 2020. Farmer and retired Marine Mike Broihier, a first-time candidate, entered the race Thursday with a three-minute advertisement that calls on voters to forget their labels. “It's time to retire Mitch McConnell,\" Broihier said in an interview with the Louisville Courier Journal this week. \"We have to do it to restore our democracy, and I've been warned about what he's capable of doing, but it doesn't scare me.\" The spot features a diverse group of Kentuckians holding tiny chalkboards with different slurs and descriptions, such as \"baby killer\" and \"hillbilly\" and \"queer.\" \"Labels are powerful things,\" Broihier says in the ad. \"For 35 years, Mitch McConnell has used labels to reinforce old prejudices, divide us, to maintain his grip on power.\" Broihier, 57, is a Wisconsin native who moved to the Bluegrass State in 2005 after he and his wife, Lynn, also a retired Marine officer, bought a 75-acre farm in Lincoln County. He said the two have raised grass-fed beef, pastured poultry, pigs and sheep on their farm. Since living in Kentucky, he has worked as a reporter and editor for The Interior Journal, a small town newspaper which is the third-oldest such publication in the state. Amy McGrath vs. Mitch McConnell:5 things to know about the 2020 Kentucky Senate race Challenger:Amy McGrath says she will take on Mitch McConnell in 2020 US Senate race Broihier said being a rural journalist, farmer and military veteran gives him a unique perspective and qualification to run. \"I've been doing this in Kentucky for 15 years, and I really think it's a part of me,\" he said. \"I think I've got a heck of a lot more in common with the people in Kentucky maybe than McConnell ever had.\" Broihier is the third Democrat to have officially entered the primary contest, which could be one of the most watched races in 2020. Health care professional Steve Cox, of Madisonville, entered the race in May but has made little noise since then. Record donations:Amy McGrath's Senate campaign says it set money record in first 24 hours after announcement Former Marine Amy McGrath, who has gained the most national attention, has been in the race since last week. She is the presumed frontrunner in the race given her support from party leaders and various major groups such as VoteVets. McGrath has already raked in more than $5 million, but she stumbled in the first days of her race after saying she would have voted to confirm Judge Brett Kavanaugh to the Supreme Court. Those missteps have spawned concern among many progressive voters and Democratic officials, such as Rep. John Yarmuth, who say that there should be a contested primary election next year. Other Democrats who are thinking about running include sports radio host Matt Jones, state Rep. Charles Booker, of Louisville, and House Minority Leader Rocky Adkins, of Sandy Hook. Follow Phillip M. Bailey on Twitter: @phillipmbailey",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Kentucky host Matt Jones yanked amid speculation he'll challenge Mitch McConnell",
      "url": "https://www.usatoday.com/story/news/politics/2019/07/20/matt-jones-ksr-wont-host-hey-kentucky-amid-u-s-senate-rumors/1785249001/",
      "subtitle": "Kentucky host Matt Jones yanked amid speculation he'll challenge Mitch McConnell",
      "author": "Phillip M. Bailey",
      "content": "Kentucky Sports Radio host Matt Jones is losing his television show until the outspoken media personality makes a decision on running for U.S. Senate in 2020, according to a Lexington station. LEX 18's General Manager Pat Dalbey announced on Tuesday that Jones is taking a leave of absence as host of \"Hey Kentucky!\" as he considers entering the Democratic primary for a chance to take on Senate Majority Leader Mitch McConnell. Dalbey did not immediately respond to a request for comment. Jones expressed disappointment with the station's decision in a tweet and suggested other contenders may have been behind his removal. \"I disagree with this decision but It is what it is,\" he said. \"I still love @hey_kentucky and will return if I do not run. I am disappointed that candidates who raise massive amounts of money are then scared of allowing a person to do his regular job he created. But alas, here we are.\" LEX 18's decision comes less than a weekafter former Marine Amy McGrath entered the Democratic primary. The McGrath campaign did not immediately respond to a request for comment. Jones has been critical of McGrath's rocky rollout, saying there is renewed interest from state Democrats in him running for Senate as a result. He also has used \"Hey Kentucky!\" in the past to declare that McGrath can't win statewide after losing to Rep. Andy Barr in Kentucky's 6th Congressional District. \"She's got a great resume, she's also a really good person. I just don't know if she can win,\" Jones said during a March broadcast. Amy McGrath:McGrath backtracks on Kavanaugh, saying 'I would have voted no' \"She can't beat McConnell,\" he added. \"She would be a great public servant, I just don't know if she can beat McConnell in Kentucky, which is probably what the goal is.\" Other rumored candidates for the Senate Democratic primary include House Minority Leader Rocky Adkins, of Sandy Hook, Kentucky, and state Rep. Charles Booker, of Louisville. Health care professional Steve Cox, of Madisonville, Kentucky, has also declared for the 2020 Democratic primary. McGrath upset many progressive groups and liberals across the country when she told the Courier Journal she would have voted to confirm Judge Brett Kavanaugh to the Supreme Court. Trump:Donald Trump tweets Democrats 'coming after' Mitch McConnell as Amy McGrath enters race Hours later, she backpedaled and said she would have, in fact, not voted to confirm Kavanaugh to the high court. Jones pounced on McGrath's troubles saying that Kentuckians are wary of inauthentic candidates. \"The worst thing you can do is to seem like your beliefs are malleable, and what's unfortunate is that is the impression that the first 48 hours has given some people,\" Jones said in an interview. Democrats:‘Send her back’ chant at Donald Trump’s rally moves race to center of 2020 contest. What does that mean for Democrats? Jones is known by many as the most visible fan of University of Kentucky college sports, who has created a media empire based on the school's rabid fan base. He also has a syndicated radio program on UK sports. He has been the \"Hey Kentucky!\" anchor since 2016, serving  as a contributor to the station's political coverage and as a moderator for previous political debates, including a 2019 Democratic governor's debate. The stations said Wednesday was Jones' last show. Reporter Phillip M. Bailey can be reached at pbailey@courierjournal.com.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "AOC calls out McConnell after photo shows 'Team Mitch' supporters 'groping and choking' cardboard cutout",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/08/06/aoc-criticizes-mcconnell-after-social-media-post-cardboard-cutout/1930780001/",
      "subtitle": "AOC calls out McConnell after photo shows 'Team Mitch' supporters 'groping and choking' cardboard cutout",
      "author": "Sarah Ladd",
      "content": "Rep. Alexandria Ocasio-Cortez criticized Senate Majority Leader Mitch McConnell on Monday night, joining many others who've taken swings at the senator over the past few days. But her criticism was for a different reason. Ocasio-Cortez tweeted a photo that had been circulating on social media and tagged the senator. The photo shows a group of young men holding a cardboard cutout of Ocasio-Cortez with one of them making a choking gesture at the throat and another gesturing to kiss her cheek. The handle of the person who originally shared the photo was blacked out, but the caption reads, at least in part, \"break me off a piece of that.\" \"Hey @senatemajldr,\" Ocasio-Cortez tweeted in response to the photo, \"these young men look like they work for you. Just wanted to clarify: are you paying for young men to practice groping & choking members of Congress w/ your payroll, or is this just the standard culture of #TeamMitch? Thanks.\" McConnell's camp told the Washington Post it does not condone the image. In a statement, McConnell campaign manager Kevin Golden explained that the high school boys in the photo were not campaign staff. \"It’s incredible that the national media has sought to once again paint a target on their backs rather than report real, and significant news in our country,” the statement said. The photo comes after Amy McGrath, who hopes to unseat the senator in November 2020, criticized McConnell for posting a photo of a tombstone with her name on it on Saturday. Another tombstone in the picture said, \"Green New Deal,\" a plan introduced by Ocasio-Cortez to tackle climate change. Reach breaking news reporter Sarah Ladd at sladd@courier-journal.com. Follow her on Twitter at @ladd_sarah.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell, criticized for inaction after El Paso, Dayton shootings, calls for discussions to address mass murders",
      "url": "https://www.usatoday.com/story/news/politics/2019/08/05/el-paso-dayton-shootings-mcconnell-no-plans-bring-senate-back/1920954001/",
      "subtitle": "Mitch McConnell, criticized for inaction after El Paso, Dayton shootings, calls for discussions to address mass murders",
      "author": "Ledyard King",
      "content": "WASHINGTON – After a torrent of criticism blasting congressional inaction, Senate Majority Leader Mitch McConnell has directed key senators to begin examining ways of curbing gun violence in the wake of mass shootings in El Paso, Texas, and Dayton, Ohio. In a statement issued Monday, the Kentucky Republican said he spoke with the chairman of three committees – Judiciary; Commerce, Science and Transportation; and Health, Education, Labor and Pensions. \"I asked them to reflect on the subjects the president raised within their jurisdictions and encouraged them to engage in bipartisan discussions of potential solutions to help protect our communities without infringing on Americans’ constitutional rights,\" he said in the statement. McConnell noted that it was \"serious, bipartisan work\" that led to bills strengthening some background checks and providing resources to expand mental health programs, training, and school safety programs. Democratic congressional leaders have criticized McConnell for not taking up background check legislation approved by the House in February. Democrats called on McConnell to bring senators back to Washington but McConnell's statement makes no mention that he's considering such a step. Thirty-one people were killed in the shootings over the weekend – 22 in a Walmart in El Paso and nine in Dayton's trendy Oregon District. Trump: Slams white nationalism, vows to respond with 'urgent resolve' to El Paso, Dayton shootings Investigators said they believe the suspected shooter in the El Paso attack, Patrick Crusius, wrote a 2,356-word \"manifesto\" that was posted online shortly before the massacre and was filled with \"racist hate.\" Crusius, who is white, laced his manifesto with anti-immigrant and racist rhetoric, saying he advocates a plan to divide the nation into territories by race. Senate Minority Leader Charles Schumer, D-N.Y., and other key Democrats , said condolences were not enough. Schumer tweeted that McConnell's statement omitted any mention of guns. Democrats are urging McConnell to pass legislation to beef up background checks. The Senate is not scheduled to return from summer break until Sept. 9. Dayton:After weekend of horror, Dayton residents left with one question on shooting: Why? El Paso:'One of the lowest points in American history': El Paso struggles to recover from mass shooting One House-passed bill would close a potential loophole allowing the transfer of firearms without a background check at gun shows or between individuals. Another measure would extend to at least 10 days the amount of time firearms dealers must wait for a response from the background check system before the sale can proceed. Currently, they can make the sale if they haven’t received a response in three days. Both bills passed this year with overwhelming Democratic support and the backing of a handful of Republicans. Speaker Nancy Pelosi, D-Calif., announced Monday that the House Homeland Security Committee has scheduled a series of hearings starting next week \"to address the national and personal security threat of white supremacy and domestic terrorism.\" She also said she's pressing McConnell to pass the background check measures the House passed earlier this year. “The President and Mitch McConnell have to feel the public sentiment on this,\" she told Democratic lawmakers on a call Monday, according to a Democratic aide on the call. \"We have a golden opportunity to save lives.” McConnell, who has blocked most gun control legislation since he's been majority leader, has consistently received donations and endorsements from the National Rifle Association. The gun rights organization said in a statement on its website that it \"will not participate in the politicizing of these tragedies but, as always, we will work in good faith to pursue real solutions that protect us all from people who commit these horrific acts.\" During a nationally televised address Monday, President Donald Trump said he would support \"red flag\" laws that would allow family members or law enforcement to limit a person's access to firearms if that person was deemed a potential threat to the public. Trump indicated that his administration's response to the shootings would be focused more on mental health and cultural issues than on gun control. “Mental illness and hatred pulls the trigger, not the gun,\" Trump said. Pressure for McConnell to act on bills that would ban assault weapons and high-capacity magazines is coming from gun control groups such as Moms Demand Action and the Brady Campaign. \"Enough! How many times do we have to keep saying it? This is a national emergency,\" Brady Campaign President Kris Brown said in a statement after the Dayton shooting. \"Sen. McConnell needs to immediately call Congress back from recess before this public health epidemic spirals any further out of control.\" Growing toll:El Paso, Dayton make 251 mass shootings in the USA in 216 days, more shootings than days in the year Contributing: NIcholas Wu",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "El Paso, Dayton mayors want quick action on gun control but Mitch McConnell has no plans to speed things along",
      "url": "https://www.usatoday.com/story/news/politics/2019/08/08/mcconnell-wont-push-gun-background-checks-el-paso-dayton-mayors-want/1959148001/",
      "subtitle": "El Paso, Dayton mayors want quick action on gun control but Mitch McConnell has no plans to speed things along",
      "author": "Ledyard King",
      "content": "Senate Majority Leader Mitch McConnell has no plans to call the Senate back to vote on laws beefing up gun background checks despite demands for immediate action from more than 200 mayors, including those of El Paso, Texas, and Dayton, Ohio, two cities recovering from mass shootings. McConnell is waiting to hear back from senators who chair key committees whom he has directed to work with Democrats to examine ways of preventing more mass murders. \"We're going to have these bipartisan discussions and, when we get back (Sept. 9), hopefully be able to come back and actually pass something,\" he said. \"I want to make a law not just see this political sparring going on endlessly which never produces a result.\" A lone gunman is accused of killing 22 people and injured dozens more at an El Paso Walmart Saturday. In an unrelated attack hours later, a gunman wielding an assault rifle killed nine and 26 injured in an entertainment district in Dayton early Sunday morning. \"We’ve never dealt with anything like this,\" El Paso Mayor Dee Margo said. \"Whatever can be done to preclude or prohibit or prevent any acts like this evil needs to be (pursued).” McConnell spoke shortly after the U.S. Conference of Mayors issued a letter signed by the leaders of 225 cities, including Margo and Nan Whaley of Dayton, urging McConnell to reconvene the Senate immediately and approve two House-passed bills that would beef up background checks for gun purchases. Stalemate:This is the gun control legislation Mitch McConnell won't allow senators to vote on El Paso:Mom of El Paso shooting suspect asked police about son's 'AK'-type weapon, lawyer says Dayton:'Oh well': Dayton mayor confused by Trump's criticism of how she described his visit \"It's no surprise to us that we have 225 bipartisan mayors that have signed on to this letter asking McConnell to come back and do his job, something that we do every day,\" Whaley, a Democrat, told reporters during a press call regarding the letter. \"We do our job so we want the Senate to do theirs.\" The Bipartisan Background Checks Act of 2019 (H.R. 8) would prohibit most person-to-person firearm transfers unless a background check can be conducted. It aims to close a potential loophole allowing the transfer of firearms without a background check at gun shows or between individuals. The Bipartisan Background Checks Act (H.R. 1112) would extend to at least 10 days the amount of time firearms dealers must wait for a response from the background check system before the sale can proceed. Currently, they can make the sale if they haven’t received a response in three days. Both bills passed with almost every Democrat and a handful of Republicans supporting the measures. But some analysts say it's doubtful tougher screening would have prevented either massacre. The White House issued a veto threat on both bills when they passed in February. But President Donald Trump said Wednesday he is talking with congressional leaders and considering tougher background checks for gun buyers as lawmakers coalesce around the idea of \"red flag\" laws after the mass shootings. House Speaker Nancy Pelosi Thursday urged Trump to take the remarkable step granted by the Constitution of convening Congress to address gun violence. \"This extraordinary moment in our history requires all of us to take extraordinary action to save lives,\" she wrote in a letter to the president. Protesters have gathered outside McConnell's house, blasting him for not doing more to bring the bills to the Senate floor. But the Senate majority leader told the Louisville radio station he won't be intimidated. \"Not a chance,\" he said.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Amy McGrath calls out Sen. Mitch McConnell for posting a photo of her name on a tombstone",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/08/06/mitch-mcconnell-foe-amy-mcgrath-calls-him-out-tombstone-post/1930353001/",
      "subtitle": "Amy McGrath calls out Sen. Mitch McConnell for posting a photo of her name on a tombstone",
      "author": "Sarah Ladd",
      "content": "There's a new zinger in the ongoing saga between Senate Majority Leader Mitch McConnell and his rival, Amy McGrath, who hopes to unseat him in November 2020. McGrath called McConnell out on Twitter on Monday after his campaign Twitter account posted a photo of tombstones Saturday. One of the headstones, among others inscribed with \"socialism\" and \"Green New Deal,\" bore McGrath's name. Team Mitch's original tweet included a picture of him smiling and the picture of the fake tombstones stuck in the ground near two Team Mitch campaign signs and a 'Matt Bevin for Governor' sign. \"The Grim Reaper of Socialism at #FancyFarm today,\" was the caption. \"#FancyFarm139.\" McGrath responded Monday around noon. She posted the photo of the tombstones, writing, \"Hours after the El Paso shooting, Mitch McConnell proudly tweeted this photo. I find it so troubling that our politics have become so nasty and personal that the Senate Majority Leader thinks it's appropriate to use imagery of the death of a political opponent (me) as messaging.\" McGrath on Kavanaugh:'I would have voted no' Mass shootings:El Paso, Dayton make 251 mass shootings in the US in 216 days, more shootings than days in the year This weekend saw a death toll of at least 31 in Dayton, Ohio, and El Paso, Texas, from two separate shooting sprees that injured dozens. Reach breaking news reporter Sarah Ladd at sladd@courier-journal.com. Follow her on Twitter at @ladd_sarah.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell lashes out at the media on Senate floor about 'Moscow Mitch' accusation",
      "url": "https://www.usatoday.com/story/news/politics/2019/07/29/mcconnell-lashes-out-following-accusations-being-russian-sympathizer/1862588001/",
      "subtitle": "Mitch McConnell lashes out at the media on Senate floor about 'Moscow Mitch' accusation",
      "author": "Ben Tobin",
      "content": "LOUISVILLE, Ky. - Senate Majority Leader Mitch McConnell took to the Senate floor Monday to blast the \"hyperventilating hacks\" who have accused him a being a Russian sympathizer. The Kentucky Republican compared the attacks to \"modern-day McCarthyism.\" \"Over the last several days, I was called unpatriotic, un-American and essentially treasonous by a couple of left-wing pundits on the basis of baldfaced lies,\" McConnell said. \"I was accused of aiding and abetting the very man I've singled out as an adversary and opposed for nearly 20 years, Vladimir Putin.\" On Friday, MSNBC host Joe Scarborough called McConnell \"Moscow Mitch\" during a segment of his \"Morning Joe\" show because the majority leader halted two measures aimed at preventing foreign interference in U.S. elections. McConnell blocked the bills on Thursday, a day after former special counsel Robert Mueller appeared before two House committees and reiterated how his 448-page report found the Russian government interfered in the 2016 presidential election. Mueller also warned that Russia is planning to interfere in the 2020 election \"as we sit here.\" Also on Friday, Washington Post opinion columnist Dana Milbank wrote a piece titled \"Mitch McConnell is a Russian asset,\" in which he said McConnell's actions are \"unpatriotic\" and that the \"Kentucky Republican is, arguably more than any other American, doing Russian President Vladimir Putin’s bidding.\" 'Retire Mitch McConnell':A Kentucky farmer, ex-Marine wants to challenge McConnell in 2020 US Senate race McConnell spoke with rare outrage Monday afternoon, saying he wanted to clarify things for the \"hyperventilating hacks who haven't actually followed this issue.\" McConnell spoke in frustration about Scarborough, \"Morning Joe\" and MSNBC, saying the show doesn't offer truthful journalism and hosts \"conspiratorial voices.\" \"The host lied and said that I've dismissed Russian interference in our 2016 election as 'a hoax,'\" McConnell said. \"Of course, I've never said any such thing, ever. I've spoken extensively and often about Russia's unacceptable interference in 2016.\" Additionally, McConnell called Milbank's column \"a shameful smear\" that is \"based on more lies.\" \"Mr. Milbank repeatedly claims that I blocked all efforts to raise our defenses against Russian meddling,\" McConnell said. \"The truth is that I've championed and coordinated work between Congress, the administration and the states, which are primarily responsible for our elections.\" Milbank listed several pieces of legislation that he said McConnell had blocked. However, McConnell claimed that he never opposed one of them, though he didn't make clear which one. 'The president is not a racist':Mitch McConnell declines to single out Trump over racist tweets; says 'all of us' should tone down rhetoric \"You'd think a columnist leveling these kind of smears would at least consult a fact-checker before accusing an elected official of aiding and abetting Vladimir Putin,\" McConnell said. \"But, alas, it's not even a competent hit piece. Just sloppy work.\" In all, McConnell addressed the Senate for about 20 minutes. He finished his remarks by circling back to McCarthyism, stating that Putin and Russians are trying to invoke fear in America and that mainstream media pundits are helping to perpetuate it. \"If anything is an asset to the Russians, it is disgusting behavior like that,\" McConnell said. McCarthyism refers to the 1950s campaign by former Sen. Joseph McCarthy to identify alleged Communists in the U.S. government and other institutions at a time when tensions were mounting between the United States and the then-Soviet Union. MSNBC did not answer a phone call from the Courier Journal. Milbank did not immediately reply to an email. Amy McGrath, who is challenging McConnell in the 2020 election, tweeted: \"Let's be very clear here: Mitch McConnell is blocking responsible election security measures that the House already passed. No matter how much he complains from his perch on the Senate floor, that’s the reality of the situation.\" McConnell family benefited from slavery:In McConnell’s boyhood town where his family owned slaves, the reparations debate thrives Follow Ben Tobin on Twitter @TobinBen.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Why is Mitch McConnell's campaign joking about the death of his opponents? Today's talker",
      "url": "https://www.usatoday.com/story/opinion/2019/08/07/mitch-mcconnell-death-joke-political-opponents-talker/1942790001/",
      "subtitle": "Why is Mitch McConnell's campaign joking about the death of his opponents? Today's talker",
      "author": "Elvia Díaz",
      "content": "Senate Majority Leader Mitch McConnell, R-Ky., is being criticized after his reelection campaign put up tombstone-shaped signs with his political opponents' names and tweeted out a photo of the display. On Wednesday, Twitter suspended the McConnell campaign's Twitter account after it shared a video that included profanity. By Elvia Díaz Has Senate Majority Leader Mitch McConnell gone mad? Nothing else explains his reelection campaign's shamefully bad joke about the deaths of his political opponents the same day of the shooting in El Paso, Texas, that took the lives of 22 people. Calling him the “Grim Reaper of Socialism,” the campaign's account on Saturday shared a photo of a fake grave at the 2019 Fancy Farm Picnic. Displayed are yard signs of “Team Mitch” nestled between headstones of “socialism,” political opponents and federal Judge Merrick Garland. You recall Republicans blocked Garland’s nomination to the U.S. Supreme Court. Even assuming McConnell's team had posted that picture before the El Paso massacre, what is he waiting for to apologize? The nation is reeling over El Paso and the subsequent mass shooting in Dayton, Ohio, that left nine dead and many wounded. Former Arizona Rep. Gabby Giffords, who survived a 2011 assassination attempt, is right to demand an apology. “I am appalled that in this divisive political climate — a climate where gun violence fueled by hate is on the rise — Mitch McConnell is joking about the death of his current and former opponents and a federal judge,” Giffords tweeted Monday. Also targets of McConnell’s sickening joke were Amy McGrath, who’s challenging him in 2020, and Kentucky's Democratic Secretary of State Alison Grimes. “The nation is turning to Leader McConnell right now for leadership, and this is the furthest thing from it,” Giffords tweeted. “Leader McConnell must apologize to @AmyMcGrathKY, Merrick Garland, and @AlisonForKY.\" How has McConnell met Gifford’s demand? Crickets. Not by Monday night after a swift response on Twitter and news reports. Former congressman:After El Paso, Dayton shootings, my old Republican colleagues still won't act on guns McConnell, like many other Republicans, condemned the weekend mass shootings — appropriately so. But he should know better. He and his campaign should have the decency and guts to publicly apologize to Garland, McGrath and Grimes. Forget party affiliation. Forget the election. Nobody, and certainly not the team headed by the leader of the U.S. Senate, should be joking about the death of political opponents — not in this deadly political climate. Not now. Not ever. Elvia Díaz is an editorial columnist for The Arizona Republic, where this column originally appeared. Follow her on Twitter: @elviadiaz1 Jill Filipovic,  CNN: \"The Republican stranglehold on the Senate is not likely to end soon; we won't see real, comprehensive gun laws unless opposing these necessary measures begins to cost conservatives. There is only one option here for Americans: Turn being a toady for the gun lobby into political oblivion. That means that Democratic voters should of course focus on getting toxic, immoral actors like McConnell out of office.\" Ricky L. Jones,  Louisville Courier Journal: \"Like it or not, Kentuckians love McConnell and have repeatedly returned him to the Senate since 1985. That’s a long time. At this point, in many ways, Mitch is Kentucky and Kentucky is Mitch. Unfortunately for potential Democratic Senate candidate Matt Jones and everyone else who has tried to take out the Republican 'Night King,' change is hard. Sometimes, people fiercely cling to bad habits, poor friends, unhealthy mates and even bacteria-infested old pillows, not because they’re good for them, but simply because they’re familiar. The same is true of politicians, and McConnell is certainly a known commodity to Kentuckians.\" Amber Phillips,  The Washington Post: \"When we talk about harsh politics, we also have to mention how much McConnell is on the receiving end. Critics of his decision not to bring up election-security bills to prevent Russian hacking of 2020 ballots cast have nicknamed him 'Moscow Mitch.' There were protests outside his home, a day after he fractured his shoulder, calling on him to bring up gun-control bills. McConnell’s campaign shared a video of at least one protester appearing to yell a profane death threat at him.\" Soon enough, liberals will blame everything that happens around the country on President Donald Trump and McConnell. — Tom Panmayil McConnell is a lot of things, but I never knew he was so insensitive as to do something like that. Retire him in 2020. —Jeff Cohee McGrath has many supporters all over the country, donating to her campaign and volunteering to help in any way they can. — Dee Thorne Once again, McGrath proves she's not quite ready for big time politics. If you can't stand the heat, stay out of the kitchen. — Donald Clark",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Sen. Mitch McConnell fractures shoulder at his home, spokesman says",
      "url": "https://www.usatoday.com/story/news/politics/2019/08/04/mitch-mcconnell-fractures-his-shoulder-after-slipping-patio/1917005001/",
      "subtitle": "Sen. Mitch McConnell fractures shoulder at his home, spokesman says",
      "author": "Sarah Ladd",
      "content": "Senate Majority Leader Mitch McConnell fractured his shoulder while at home, his office announced Sunday. He tripped on his outdoor patio, a statement from spokesman David Popp said. McConnell was treated and released to his home, where he is working. \"This afternoon he contacted Senators Cornyn and Portman to express his deepest sympathies for the people of El Paso and Dayton and discuss the senseless tragedies of this weekend,\" Popp wrote. He was referring to the separate shootings over the weekend in El Paso and Dayton, where at least 29 people were killed and dozens more were injured. \"The Leader will continue to work from home,\" Popp wrote. More:McConnell calls for prayers, Democrats demand action after shootings Also:McConnell couldn't escape 'Moscow Mitch' at Kentucky's biggest political picnic Reach breaking news reporter Sarah Ladd at sladd@courier-journal.com. Follow her on Twitter at @ladd_sarah. Support strong local journalism by subscribing today: courier-journal.com/subscribe.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "This is the gun control legislation Mitch McConnell won't allow senators to vote on",
      "url": "https://www.usatoday.com/story/news/politics/2019/08/04/mass-shootings-what-congress-doing-gun-control/1916451001/",
      "subtitle": "This is the gun control legislation Mitch McConnell won't allow senators to vote on",
      "author": "Nicholas Wu",
      "content": "WASHINGTON – Senate Majority Leader Mitch McConnell faced a backlash on Twitter Sunday after tweeting that he stood with law enforcement and offered prayers to the victims of violence in El Paso. \"We stand with law enforcement as they continue working to keep Americans safe and bring justice,\" McConnell said in a tweet that was met by an online backlash by politicians who were calling for Congress to react to the shootings with legislation. McConnell called said the violence was \"sickening\" in that same tweet. Rep. Katie Hill, D-Calif., said \"shame on you,\" calling on McConnell to take up the House's gun violence prevention bills. No sign of a vote:McConnell silent on calls for special Senate session on guns after mass shootings Senate Minority Leader Chuck Schumer, D-N.Y., called on McConnell to cancel the Senate's summer recess and reconvene to pass gun control legislation. \"@SenateMajLdr McConnell must call the Senate back for an emergency session to put the House-passed universal background checks legislation on the Senate floor for debate and a vote immediately,\" wrote Schumer on Twitter. The Kentucky Republican has blocked gun control legislation in the Senate that had previously passed the House by wide margins. McConnell had the billsplaced on the Senate calendar, rather than having them referred to a committee to potentially be passed by the full Senate. Here's what that legislation would do. More:Jordan Anchondo killed shielding her 2-month-old in El Paso, Texas shooting More:At least 9 dead, 26 injured. Victims identified. What we know about the Dayton, Ohio shooting More:FBI's haunting warning about 'lone offenders' paints a grim picture In February this year, the House of Representatives passed H.R. 8: Bipartisan Background Checks Act of 2019. This bill passed 240-190, with eight Republicans joining almost all Democrats to vote for the bill. This bill would prohibit most person-to-person firearm transfers unless a background check can be conducted, aiming to close a potential loophole allowing the transfer of firearms without a background check at gun shows or between individuals. The Senate has not taken any action on the bill since the House passed it. This bill would extend to at least 10 days the amount of time firearms dealers must wait for a response from the background check system before the sale can proceed. Currently, they can make the sale if they haven’t received a response in three days. H.R. 1112 passed in February 2019 by a vote of 240-190. Like H.R. 8, the Senate has taken no action on the bill since it passed. Some Republicans have spoken in favor of \"red-flag\" laws, which would allow family members or law enforcement to limit a person's access to firearms if they are deemed a potential threat to the public. Sen. Lindsey Graham, R-S.C., tweeted in favor of such laws after the Dayton shooting, though he added in a later tweet that such laws \"may not have mattered here.\" Presidential adviser and eldest daughter of Donald Trump Ivanka Trump tweeted in favor of \"red-flag\" laws later Sunday. The Violent Crime Control and Law Enforcement Act of 1994, lapsed in 2004. This legislation, among other provisions, banned the manufacture and sale to civilians of assault-style weapons and certain \"large-capacity\" ammunition magazines for guns, Congress has attempted to pass new bans on assault-style weapons, but the legislation has picked up little traction in the Republican-controlled Senate. In March 2019, the Trump administration banned \"bump stocks,\" or attachments that could allow semiautomatic rifles to mimic automatic weapons, after an October 2017 mass shooting in Las Vegas involving a rifle modified with a bump stock killed 58 people. Contributing: Maureen Groppe",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "2020 candidate Tim Ryan leads gun control caravan to Mitch McConnell",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/08/09/tim-ryan-leads-gun-control-caravan-mitch-mcconnell/1971147001/",
      "subtitle": "2020 candidate Tim Ryan leads gun control caravan to Mitch McConnell",
      "author": "Phillip M. Bailey",
      "content": "Democratic presidential hopeful Tim Ryan said Thursday night that Republican Mitch McConnell needs to call the Senate back into session \"immediately\" if majority leader is serious about having a conversation on expanding background checks for gun owners. \"I've watched him slow walk this time and time and time again, and they're going to the same playbook,\" Ryan told the Courier Journal in an exclusive interview before the rally. \"It's just a bunch of bologna.\" McConnell, who is resting in Louisville after fracturing his shoulder over the weekend, said Thursday on 84 WHAS radio he is anxious to get a conversation going in the next few weeks with his fellow legislators about gun legislation to deal with shootings like the ones that happened over the weekend. Read this:McConnell's campaign locked out by Twitter for posting critic's profanity-laced video “What we can’t do is fail to pass something,” the Senate majority leader told WHAS radio host Terry Meiners late Thursday afternoon. “The urgency of this is not lost on any of us.” Ryan, a congressman from Ohio, has expressed outrage with McConnell in the days following mass shootings in El Paso and Dayton, Ohio, that have left 31 people dead. He organized a caravan with Moms Demand Action, an anti-gun violence group, to travel more than 370 miles, including six stops through the region before its final leg in McConnell's hometown, where around 1,500 people gathered in support. Protesters came with signs with messages like \"Mitch Do Something,\" \"Ban These Killing Machines\" and \"Make America Safe Again.\" The crowd also chanted \"end the silence, no more violence\" and \"bring it to the floor.\" The latter chant is a reference to McConnell ignoring multiple gun-control measures passed by the Democrat-controlled House. More:Mitch McConnell: We can't fail to pass a gun control measure Freshman Kentucky State Rep. Nima Kulkarni of Louisville spoke at Thursday evening's rally, saying the event is an \"urgent call to end gun violence.\" \"We need leaders who will prioritize people over guns,\" Kulkarni said. \"We need leaders who will do something, and if you can't do that then you are failing all of us.\" Cathy Mekus, a leader with the Louisville chapter of Moms Demand Action, said that almost 40,000 people die each year from a gunshot, and that the \"trauma to this sort of slaughter is tearing us apart, and we can do something.\" Also:Editorial: McConnell, we need thoughtful gun control legislation. We need your leadership Hollan Holm, who was shot in the head during a shooting at Heath High School in Paducah, Kentucky in 1997, took a jab at McConnell for his \"prayers\" comment following this past weekend's shootings. \"I remember thoughts and prayers being brought up on Heath's behalf,\" he said. \"Thoughts and prayers weren't enough to stop the violence then.\" \"I was shot in a prayer group,\" Holm said, \"What's your plan B?\" Democratic state Rep. Attica Scott of Louisville said that there is work to be done to make sure McConnell \"remains uncomfortable ... even in his backyard and at his front door and wherever he goes to eat.\" Scott confirmed to the Courier Journal after the rally that she does indeed want people to go to McConnell's home and anywhere he is to peacefully protest. \"He's not doing anything about people dying,\" she told the Courier Journal. Scott was possibly referencing an expletive-filled protest that occurred out of McConnell's Louisville home Monday night. Black Lives Matter Louisville leader Chanelle Helm said in a live video of the protest that instead of falling and injuring his shoulder over the weekend, McConnell \"should have broken his little raggedy, wrinkled-(expletive) neck.\" After a man makes a reference to a hypothetical McConnell voodoo doll, Helm replied, \"Just stab the m----- f----- in the heart.\" Both Ryan and U.S. Rep. John Yarmuth, D-Louisville, condemned the protest in an interview with the Courier Journal earlier in the night. \"The substance of what (the protesters) said certainly is way over the line, as far as I'm concerned,\" Yarmuth said. \"You never wish harm on anybody.\" Ryan concurred, stating, \"We're trying to make Mitch McConnell as uncomfortable as humanly possible, but there's a way to do that within the confines of respecting peoples' privacy and neighborhoods and all the rest.\" Yarmuth said at the rally that, as a grandfather, he wonders if his grandson will need an armored stroller or to carry a bullet-proof backpack to school. \"This is not the country we deserve,\" he said. \"We can make a difference. We can take action.\" Meanwhile, Ryan told the crowd that it is time to get special interests out of government and to play more offense than defense. \"We are fed up,\" he said. \"We don't want anymore speeches ... we don't want left and right. We want new and better.\" Ryan, who temporarily suspended his campaign after the Dayton shooting, told the Courier Journal that prioritizing stronger gun control measures \"is now something that will be part of my pitch and my message moving forward.\" He will resume his presidential campaign at an event tomorrow in Iowa. \"Our number one responsibility is to keep people safe. Period. End of story. You keep people safe,\" Ryan said. \"This president and Senator McConnell are abdicating their responsibility to keep us safe as Americans.\" McConnell's statement showed he might be pivoting away from holding up gun control legislation that had passed the U.S. House, although he didn't mention two gun measures that passed that chamber in February. But the senator did say that the background checks would be “front and center” in the debate once the Senate reconvenes in September. He said another priority would be red flag laws, which would allow family members or law enforcement to limit a person's access to firearms if they are deemed a potential threat to the public. Priorities once the senate is back in session, McConnell said, are to discuss background checks and red flags that may give a person away as a candidate for violence.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell: Background checks will be 'front and center' in Congress gun debate",
      "url": "https://www.usatoday.com/story/news/politics/2019/08/09/mitch-mcconnell-on-gun-legislation-before-tim-ryan-louisville-rally/1964604001/",
      "subtitle": "Mitch McConnell: Background checks will be 'front and center' in Congress gun debate",
      "author": "Lucas Aulbach",
      "content": "Senate Majority Leader Mitch McConnell said Thursday that he was willing to consider expanding background checks for gun buyers as a caravan of protesters led by U.S. Rep. Tim Ryan descended in Louisville to press him on gun control. “What we can’t do is fail to pass something,” McConnell told WHAS radio host Terry Meiners late Thursday afternoon. “The urgency of this is not lost on any of us.” McConnell's statement showed he might be pivoting away from holding up gun control legislation that had passed the U.S. House, although he didn't mention two gun measures that passed that chamber in February. But Ryan, upon arriving in McConnell’s hometown, told the Courier Journal the senator’s words were “a bunch of bologna.” “The history of President Trump and Mitch McConnell is they try to slow walk this until it falls out of the news cycle,” said Ryan, who has suspended his presidential campaign in the wake of mass shootings that left 31 people dead in El Paso, Texas, and Dayton, Ohio, over the weekend. Trump:Congress discussing 'meaningful' gun background checks, NRA will have input McConnell has been under intense pressure to act since those shootings, and Ryan called on him Thursday to immediately call the Senate back from its August recess to act on the issue. McConnell did not say that he would bring the Senate back in session. This week, protesters have amassed at McConnell’s Louisville home and office. A profane video of a protester wishing McConnell harm caused his campaign's Twitter account to be suspended after it posted the footage. In his radio interview, McConnell said the Senate would take up the debate in September with background checks “front and center.” Another priority will be red flag laws, which would allow family members or law enforcement to limit a person's access to firearms if they are deemed a potential threat to the public. Pelosi on guns:Pelosi urges Trump to call Senate to vote on House gun background checks bills Ryan has criticized McConnell for inaction on House bills that passed with bipartisan support and would strengthen background checks in gun purchases. On Thursday, the U.S. Conference of Mayors, which includes 214 mayors from around the country, sent a letter to McConnell and Senate Minority Leader Chuck Schumer urging them to immediately vote on the two bills. In February, the Trump administration issued a statement saying both bills would impose oppressive delays and requirements on gun purchases and that the president's advisers would recommend he veto the bills if either were presented to him. Trump and the NRA:Trump spoke with NRA CEO Wayne LaPierre during Dayton, El Paso trip, faces opposition on gun background checks But on Wednesday, President Donald Trump signaled an “appetite” to change the laws on background checks. McConnell followed a day later. Ryan said his goal is “to make Mitch McConnell as uncomfortable as humanly possible.” “This (gun control) is now something that will be part of my pitch and my message moving forward,” he said. Mayors:El Paso, Dayton mayors want quick action on gun control but Mitch McConnell has no plans to speed things along Lucas Aulbach can be reached at laulbach@courier-journal.com or on Twitter @LucasAulbachCJ.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Kentucky sports radio host writing book that bashes Mitch McConnell",
      "url": "https://www.usatoday.com/story/sports/2019/08/15/book-bashing-mitch-mcconnell-works-kentucky-sports-radio-host/2018157001/",
      "subtitle": "Kentucky sports radio host writing book that bashes Mitch McConnell",
      "author": "Scott Gleeson",
      "content": "Kentucky Sports Radio host Matt Jones is writing a travelogue book dedicated to politically rebuking Senate Majority Leader Mitch McConnell, R-Ky., he announced on social media Thursday. The book's running title is currently, \"Mitch, Please! How Mitch McConnell Sold Out Kentucky (and America too).\" Jones and co-author Chris Tomlin plan to travel to each of Kentucky’s 120 counties to make the following case: McConnell has had a negative impact on the state for more than three decades. “We’ve heard from people who have been cut off in traffic by Mitch’s people,\" Jones told The Washington Post. \"Really, the book is about trying to figure what this man’s impact on people across the state has been in a very real way, while he’s amassed incredible power in Washington.\" Jones, a native Kentuckian who grew up in the Appalachian Mountains of Eastern Kentucky and attended Transylvania University in Lexington, added that the book is also meant to be \"a love story to my state.\" Jones started the Kentucky Sports Radio blog in 2005 and left a successful legal career — he clerked for three federal judges and worked in private practice — in 2008 to run the website and host his syndicated radio show on a full-time basis. His website is centered on Kentucky Wildcats athletics, mainly basketball. Over the years, Jones has put McConnell on blast for not declaring his allegiance to UK or Louisville. The politician attended both universities, receiving his undergrad at Louisville and his law degree at Kentucky. Jones said on his radio program back in July that he's considering a Senate run, but he admitted an uphill battle as Democrat Amy McGrath launched a successfully funded bid last month. The 40-year-old is no stranger to politics. In 2015 he was recruited to run for Congress but grew disenchanted by the political process during a visit to Washington. “One congressperson addressed the group and literally said that what matters in the election isn’t your views but how much money you raise,” Jones recalled to The Post. “I don’t think the national Democratic Party cares about average Kentuckians, either.\" But it appears that instead of attempting to unseat McConnell, Jones has mostly turned his focus to chiding the politician in the book, which is expected to be released next summer ahead of the 2020 election. The book will be published by Simon & Schuster. In addition to Kentucky Sports Radio endeavors, Jones has hosted a television show, \"Hey, Kentucky!\", that covers sports and politics on Lexington's local WLEX-TV station. On it, he'd often criticize McConnell. Former McConnell adviser Scott Jennings told Politico last year: “‘If you throw a pebble at me, we’ll throw a boulder back at you.’ And Matt Jones has built up a whole quarry full of boulders.”",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "'Over the top:' McConnell still mad about #MoscowMitch, calls attention to 2020 election",
      "url": "https://www.usatoday.com/story/news/politics/2019/09/04/mcconnell-moscow-mitch-over-top-smear-and-unbelievable/2207022001/",
      "subtitle": "'Over the top:' McConnell still mad about #MoscowMitch, calls attention to 2020 election",
      "author": "Sarah Ladd",
      "content": "It's no secret Senate Majority Leader Mitch McConnell doesn't like the nickname given him in July – \"Moscow Mitch.\" During a Tuesday interview on the Hugh Hewitt Show, he again condemned the name, calling it \"modern-day McCarthyism\" and an \"over the top\" smear on his career. \"Unbelievable for a Cold Warrior like me who spent a career standing up to the Russians to be given a moniker like that,\" McConnell told Hewitt. \"It’s an effort to smear me. You know, I can laugh about things like the Grim Reaper, but calling me Moscow Mitch is over the top.\" Louisville's famous politician was first called \"Moscow Mitch\" in July by MSNBC host Joe Scarborough on his \"Morning Joe\" show for blocking two measures aimed at preventing foreign interference in U.S. elections a day after former special counsel Robert Mueller appeared before two House committees and reiterated how his 448-page report found the Russian government interfered in the 2016 presidential election. Mueller also warned that Russia is planning to interfere in the 2020 election \"as we sit here.\" McConnell has stood his ground on not passing the measures from the beginning. He said Tuesday that his opponents will \"say anything and do anything.\" Background:McConnell called 'Moscow Mitch' for blocking election security bills Also:Nancy Pelosi gets laughs as she refers to McConnell as 'Moscow Mitch' \"And going back even to the breakup of the Soviet Union,\" he told Hewitt, \"I was one of those leading the charge for expanding NATO up to the Russian border over and over again over the years.\" When Hewitt asked McConnell if Democrats have \"monetized anger and slander,\" McConnell drew attention to the upcoming election and said it's important to look past \"hot rhetoric\" surrounding nicknames like Moscow Mitch and instead look at the \"cold, hard reality.\" \"That’s what the election’s about next year, and the American people somehow are going to have to sort out all of this,\" he said. \"And what I hope they’ll do is tune a good bit of this out and focus on the facts, which are that if the Democrats get power again, they’re going to turn us into a socialist country.\" \"The Green New Deal, Medicare for all, add it all up, and you have fundamentally changed America into a country it’s never been before,\" McConnell said. \"That’s what’s really at stake next year, not all of this hot rhetoric, but the cold, hard reality of what they’ll do if they get power.\" McConnell is keen to hold the position he has held since 1984 in his reelection campaign against Democratic challenger Amy McGrath in a race that may get more crowded soon. More:From 'Moscow Mitch' to 'Massacre Mitch': McConnell gets new nickname after mass shootings Opinion:Why is McConnell so upset about being called Moscow Mitch? Maybe it hits too close to home In a video shared by WHAS 11 Monday, U.S. Representative John Yarmuth of Louisville said he had no desire to run against McConnell but would do so if the senator agreed to debate him in public five times. Tuesday afternoon, McConnell's campaign Twitter account shared the link and wrote, \"Accepted. When is the announcement? - MM.\" Three hours after that post, the account tagged Yarmuth in a GIF scene from the 1992 film \"Reservoir Dogs\" with the quote, \"Are you gonna bark all day, Little Doggy, or are you gonna bite?\" Yarmuth spokeswoman Heather Dearing hasn't yet returned a Courier Journal request for comment. Reach breaking news reporter Sarah Ladd at sladd@courier-journal.com. Follow her on Twitter at @ladd_sarah.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Sports radio host to form exploratory committee on Senate bid against Mitch McConnell",
      "url": "https://www.usatoday.com/story/sports/2019/08/29/democrat-matt-jones-forming-exploratory-committee-for-mitch-mcconnell-senate-2020/2150194001/",
      "subtitle": "Sports radio host to form exploratory committee on Senate bid against Mitch McConnell",
      "author": "Joe Sonka",
      "content": "Kentucky Sports Radio host Matt Jones is forming an exploratory committee for a potential U.S. Senate bid against Mitch McConnell in 2020. Jones, a Democrat, told the Courier Journal he expects to come to a final decision on such a run after the election for statewide offices this November. He said he will file the paperwork for the committee in the coming days. Forming the committee will allow him to raise money to conduct polling and research on a potential run but not engage in any overt campaign activities to ask for votes. \"I did want to move the ball forward, because I am very interested in the race,\" said Jones, who has been considering a run for this seat since the beginning of the year. \"And it's important for me to sort of take the next step.\" Jones said he previously had a deadline imposed on him by WLEX to come to a final decision on a run by the end of August but that station's move to pull him off the \"Hey Kentucky\" show he hosted and fire him freed him up to slow down and make a more informed choice. Having recently signed a deal with publisher Simon & Schuster to co-author a book that is critical of McConnell, he plans to spend the next two months traveling to all 120 counties in the state on an unconventional book tour, where he'll listen to Kentuckians and use what he hears to write the book — as well as learn whether a Senate bid would be viable for him. \"It makes a lot more sense for me to make the final decision after I've done that, after I've listened to Kentuckians and talked to Kentuckians about what they want in a senator and whether or not I'm the right person going against McConnell,\" Jones said. \"So rather than me just sort of declaring that I'm the best candidate, I'd like to talk to people and hear what they have to say.\" Alluding to \"some outside influence\" that caused WLEX to fire him, Jones said that move may turn out to be \"a blessing in disguise,\" as he's no longer forced to rush a decision before an artificial deadline. Jones also said he wants to wait another two months before making a final decision because he doesn't want to be a distraction from this fall's governor race, echoing the same rationale recently shared by Kentucky House Minority Leader Rocky Adkins, who is also considering a bid for McConnell's seat. \"After the last four years, these next eight weeks are crucial for the future of Kentucky,\" said Jones, who is supporting Democratic gubernatorial candidate Andy Beshear over Republican Gov. Matt Bevin. \"The Senate race has got so much attention, there's already been so much advertising, that a lot of people have forgotten there's a very important governor's race coming up in two months.\" Ricky Jones:Here's why Matt Jones should and shouldn't run against Mitch McConnell As for why he is considering a run, Jones mentioned his love of the state and belief that both McConnell and national Democrats have not given a voice to average Kentuckians. He added that he continues to hear from a large number of Democrats who are not sold on the current frontrunner for the party's nomination — retired Marine Lt. Col. Amy McGrath — and have urged him to consider joining the race. \"I was in Powell County on Saturday speaking at a Democratic event ... and the amount of people sort of asking me to do it was overwhelming,\" Jones said. \"It sort of confirmed to me that there is this sort of desire to find another potential candidate. And what I need to see is, is that desire, potentially, for me?\" McGrath's campaign raised a record $2.5 million in the first 24 hours after announcing her candidacy in July but made questionable choices in the following days, including telling the Courier Journal she would have supported controversial Judge Brett Kavanaugh's confirmation to the Supreme Court only to reverse course hours later. Jones has publicly stated that he believes a complaint by the McGrath campaign played a role in WLEX's decision to pull him from his show. McGrath also formed an exploratory committee when she ran for Congress in 2018, making her candidacy official two months later. A spokesman for the McGrath campaign had no comment on Jones' exploratory committee, and a McConnell campaign spokesman did not immediately return a request for comment. His decision to form an exploratory committee will not affect his radio show in the near term, Jones said, adding that he has clearance from his bosses at iHeartRadio to continue to host the show while on his book tour. \"They're aware of my decision, and the one thing they requested is that I not use the radio to advocate for it,\" Jones said. \"And I won't do that.\" Jones declined to discuss specific government policy positions, saying \"there will be plenty of time to talk about all the policy positions if I end up announcing.\" He added that he would answer any questions from the people he meets over the next two months as he travels the state on his tour. Other Democrats to have announced a Senate run are retired Marine Mike Broihier and health care professional Steve Cox, while state Rep. Charles Booker of Louisville is also considering entering the race. Reach reporter Joe Sonka at jsonka@courierjournal.com or 502-582-4472 and follow him on Twitter at @joesonka. Support strong local journalism by subscribing today: courierjournal.com/subscribe.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "McConnell fundraises off impeachment, says effort will fail 'with me as majority leader'",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/10/05/mitch-mcconnell-campaign-ad-says-trump-impeachment-fail/3881997002/",
      "subtitle": "McConnell fundraises off impeachment, says effort will fail 'with me as majority leader'",
      "author": "Billy Kobin",
      "content": "Earlier this week, Senate Majority Leader Mitch McConnell said his chamber would have \"no choice\" but to hold a trial on whether to remove President Donald Trump from office if the House votes to impeach. But in a new campaign ad on Facebook, the Kentucky Republican claims that any impeachment attempt will fail as long as he remains in charge of the Senate. \"Nancy Pelosi's in the clutches of a left wing mob. They finally convinced her to impeach the president,\" McConnell says directly to the camera in a 17-second video. \"All of you know your Constitution. The way that impeachment stops is a Senate majority with me as majority leader. \"But I need your help,\" he adds, standing in front of a picture of an elephant. \"Please contribute before the deadline.\" The McConnell campaign, according to Facebook's \"Ad Library,\" started running the digital ad last week, a few days after House Speaker Nancy Pelosi announced an impeachment inquiry over whether Trump improperly pressured Ukraine's president to investigate political rival and possible 2020 opponent Joe Biden. Pelosi:Trump impeachment probe 'a very sad time for our country' Photos:The Trump impeachment inquiry in pictures The ad features the same video, but McConnell's team has paired the video with different captions that all are mostly focused on the topic of impeachment. \"Your conservative Senate Majority is the ONLY thing stopping Nancy Pelosi from impeaching President Trump. Donate & help us keep it!\" one caption reads. McConnell campaign manager Kevin Golden told The Courier Journal the impeachment inquiry is energizing the Senate leader's supporters. \"Few issues energize conservative voters like liberal overreach,\" Golden said in a statement. \"And the Democrats latest outrageous attempt to impeach President Trump has activated our base to new heights.\" Another caption from Team Mitch goes after Pelosi's fellow California Democrat, Rep. Adam Schiff, who chairs the House Intelligence Committee. \"BREAKING: Adam Schiff LIED. His office secretly coordinated with the source of this laughable impeachment inquiry,\" the caption reads. \"Help me stop it.\" That caption appears to reference the New York Times reporting this week that Schiff received an early account of the whistleblower's complaint regarding Trump's phone call with Ukrainian President Volodymyr Zelensky. Impeachment inquiry:House Democrats subpoena White House for Ukraine documents More:Trump tears into Mitt Romney who said requests for Ukraine, China to investigate Biden were 'appalling' The complaint from the anonymous whistleblower, reportedly a CIA officer, led to the White House releasing a summary of the July phone call between Trump and Zelensky. According to the call's summary, Trump told Zelensky to reopen an investigation into a Ukrainian energy company connected to Biden's son, Hunter. McConnell reportedly told the White House to release the transcript of the phone call, something that McConnell and his spokespeople have not commented on. On Thursday, Trump added further fuel to the fire by telling reporters that China should also investigate the Bidens. The president also claimed Thursday that McConnell put out a statement referring to the president's phone call with the president of Ukraine as \"the most innocent phone call (transcript) that I’ve read.\" McConnell's office has not responded to questions about Trump's assertion, though the Senate leader dismissed criticism of the call last week and said it is “laughable to think this is anywhere close to an impeachable offense.” On the Senate floor, McConnell has defended his record of standing up for Ukraine, especially against the Russian government. Democrats and some Republican critics of Trump have said the president's requests to Ukraine and China are a blatant attempt to have a foreign power interfere with next year's election. Trump has denied any wrongdoing. It would take a simple majority of the House (218 votes) to submit articles of impeachment to the Senate. A trial would then be held in the Senate, where it would take at least two-thirds (or 67 votes) of the chamber to convict Trump and remove him from office. The chief justice of the Supreme Court presides over the trial. But as majority leader, McConnell would have some power in setting up ground rules for a trial, including timing. \"So I would have no choice but to take it up,\" McConnell told CNBC on Monday, referring to the impeachment trial. \"How long you're on it is a whole different matter.\" The new campaign ad from McConnell shows the Senate leader sees the impeachment matter as a chance to raise funds for his 2020 reelection campaign. Amy McGrath, a former Marine Corps pilot and one of several Democrats in Kentucky vying to unseat McConnell in 2020, endorsed the impeachment inquiry last week. McGrath has also urged McConnell to show \"patriotic courage\" and get to the truth of the allegations in the whistleblower complaint. The \"deadline\" mentioned by McConnell in the new video refers to this past Monday, Sept. 30. 'Over the top':McConnell still mad about #MoscowMitch, calls attention to 2020 election That was the third-quarter cutoff for donations to Senate, House and presidential candidates. Candidates now have until Oct. 15 to file reports with the Federal Election Commission that reveal their fundraising and spending totals. According to Facebook's Ad Library, McConnell's campaign spent a little over $63,000 on digital ads between Sept. 27 and Oct. 3. That represents about 44% of the roughly $143,500 that Facebook data shows Team Mitch spent from May 2018 to Oct. 3, a decent-sized sum in a brief amount of time. According to the most recent FEC data, McConnell had a sizable war chest for his 2020 reelection bid, with nearly $7.9 million in cash on hand. Follow Billy Kobin on Twitter: @Billy_Kobin",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "The Constitution and McConnell say so: Senate will hold trial if House impeaches Trump",
      "url": "https://www.usatoday.com/story/opinion/2019/10/01/senate-will-hold-trial-if-house-impeaches-trump-column/3821519002/",
      "subtitle": "The Constitution and McConnell say so: Senate will hold trial if House impeaches Trump",
      "author": "null",
      "content": "Senate Majority Leader Mitch McConnell once boasted about keeping a Supreme Court seat vacant for more than a year. He said that blocking Judge Merrick Garland’s nomination from even getting a vote was “the most consequential decision I’ve made in my entire public career.” McConnell also calls himself the “grim reaper” of the raft of legislation passed by the Democratic-led House of Representatives. In the legislative graveyard of his Republican-controlled Senate, McConnell has buried House-passed bills to prevent gun violence, lower prescription drug prices, prevent violence against women and many others. As President Donald Trump faces scrutiny in Congress for allegedly attempting to pressure the Ukrainian government for political dirt on former Vice President Joe Biden in exchange for military aid, it's natural to wonder whether McConnell would try to bury impeachment, too. Some argue he could simply ignore impeachment, but McConnell himself said Monday that he “would have no choice but to take it up.” He was notably vague on what exactly that would mean, adding that “how long you're on it is a whole different matter.” But months ago, he said the Senate \"immediately goes into a trial\" if the House approves articles of impeachment. Let’s be absolutely clear, neither the Constitution nor Senate rules give McConnell any wiggle room to try to “Garland” his way out of this critical process of constitutional accountability. To begin, Article I, Section 3 says, “The Senate shall have the sole power to try all Impeachments.” Every Senate to consider impeachment since the founding has read this critical passage to require them to undergo some sort of process. In the 230 years since the Constitution took effect, the House has impeached 15 federal judges, one senator, one Cabinet member and two presidents. Sixteen of those impeached individuals received a full Senate trial, while the other three resigned before the Senate trial concluded. Never in that entire time has the Senate understood its power to try impeachments as discretionary. Never. Think about why that is. Our Constitution does not work — it simply falls apart — if this critical power of Congress to check and balance the other branches is discretionary. Acquittal is obviously an option: Seven impeached officials have been, including Presidents Andrew Johnson and Bill Clinton. Dereliction of duty, however, is not an option. One half of Congress indicting a sitting president for committing treason, bribery or other high crimes and misdemeanors, only to meet silence from the other half — no trial, no review of the evidence, no vote — leaves a cloud of illegitimacy hanging not only over the nation’s chief executive, but also over our nation’s founding charter. Legal jeopardy:Why Trump is increasingly desperate to avoid an impeachment conviction and win in 2020 As if the text and structure of the Constitution, plus hundreds of years of unbroken historical tradition, weren’t enough, Senate rules require Sen. McConnell to stand aside and allow the prescribed impeachment process in the Senate to commence. The Rules of Procedure and Practice in the Senate When Sitting on Impeachment Trials are explicit and clear about this. The House sends impeachment managers to the Senate, along with the articles. Chief Justice John Roberts would be sworn in to preside, and in turn he would swear in all 100 senators. The process would be underway. There is no discretion in the Senate rules, no menu of options for the majority leader to choose from. Now, if McConnell wanted to change the rules, then he’d better buckle up. Any motion he could make to change the rules is likely debatable, requiring 67 votes to pass, which he doesn’t have. Winning would mean not only shielding Trump from an impeachment trial, but also possibly nuking the filibuster for everything else in the Senate(it's now only eliminated for court and executive branch nominations). Such a vote would be the equivalent of a vote on impeachment anyway. Choosing this bizarre and destructive route doesn’t make sense for someone as calculating as McConnell, especially with the possibility that one of a strong field of Democratic presidential candidates could be driving the national agenda in 2021. Still, for the sake of argument, let’s nod to the darkest corner of McConnell’s proven cynicism. Could he disregard the Constitution and Senate rules altogether? Could he engage in an act of blatantly anti-constitutional, nihilistic obstruction and refuse to allow any impeachment proceeding whatsoever — even if, say, House Speaker Nancy Pelosi herself walked the articles of impeachment across the Capitol and banged on the doors of the Senate? We already know enough:Donald Trump's call with Ukrainian president drips with impeachable crimes Sure, McConnell could do that. But doing so would mean wrecking the Senate by violating one of its written rules, maybe for the first time in his career. McConnell faced no explicit contrary instruction when he blocked President Barack Obama's Garland nomination to the Supreme Court. This is different, and the majority leader seems to recognize that. At the end of the day, both houses of Congress are faced with Benjamin Franklin’s timeless, bracing challenge — “a republic, if you can keep it.” With the Constitution, the Senate rules, Mitch McConnell’s own self-interest and the raised voices of We the People, we can bear witness to a full Senate trial of President Trump should the House vote to impeach him, and indeed keep our republic for many generations to come. Elizabeth Wydra is president of the Constitutional Accountability Center. Follow her on Twitter: @ElizabethWydra",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Trump, AOC and McConnell: the personalities that could determine who wins the Senate in 2020",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/10/13/2020-senate-races-may-determine-whether-democrats-gop-gain-majority/3922420002/",
      "subtitle": "Trump, AOC and McConnell: the personalities that could determine who wins the Senate in 2020",
      "author": "Ledyard King",
      "content": "WASHINGTON – The bruising campaign for the White House between President Donald Trump and his Democratic challenger will take center stage in 2020 but it's the contest for control of the Senate that will determine the presidential winner's ability to pass legislation, appoint judges and fund priorities. Democrats, who effectively control 47 seats, need to flip at least four Republican Senate seats to recapture the upper chamber – or three if they win back the White House since the vice president breaks ties. Republicans hold 23 of the 35 seats up for grabs next year, giving Democrats nearly twice as many pick-up opportunities. Adding to the Democrats' optimism is that many of the races are in states where the president's approval rating sits well under 50%. Republicans counter that all but two (Colorado and Maine) of the GOP seats up for election are in states Trump won in 2016. And the two most vulnerable Democrats are in states (Alabama and Michigan) that Trump won. Thirteen months out from Election Day, there remains plenty of questions: Will primary voters nominate moderates or party reactionaries that would have a tougher time winning a general election? How will the the Democratic presidential nominee influence down-ballot Senate races? What kind of effect will congressional Democrats' pursuit of Trump's impeachment have on voters? “So many things we don’t know,\" said Jennifer Duffy, a long-time Senate analyst with the non-partisan Cook Political Report. Duffy and others watching 2020 elections give Democrats less than a 50-50 chance of recapturing the Senate considering there are only a handful of states in play right now. The debates:Schedule set for 2020 general election presidential and vice presidential debates Already the attack ads have been launched by both parties. Republicans are painting Democratic candidates as socialists who back far-left policies such as \"Medicare for All,\" free college tuition and radical climate change remedies like the Green New Deal. They've begun airing ads in some states that feature Rep. Alexandria Ocasio-Cortez, the freshman New York Democrat and social media star who embodies the party's left-wing ideology. Democrats are portraying Republicans as climate deniers and anti-immigration zealots who blindly back Trump. They've started airing ads with Senate Majority Leader Mitch McConnell, the Kentucky Republican whom opponents accuse of protecting Trump and obstructing important legislation from even getting a floor vote. There is a soundness to each side's partisan strategy: In 2016, every Senate seat up for election was won by the party whose presidential nominee also captured that state. Here's a look at the states in play and the chances the Senate could flip back to Democrats: The two Republicans who represent states that Hillary Clinton captured in 2016 – Cory Gardner in Colorado and Susan Collins in Maine – are top targets for Democrats next year. As a freshman senator who squeaked in five years ago, Gardner is considered more vulnerable than Collins, who won her fourth term in 2014 with 68% of the vote. Former Colorado Gov. John Hickenlooper's entry into the race gives Democrats a formidable challenger with high name recognition in a state where Democrats will try to capitalize on issues such as climate change and health care. But Republicans say Hickenlooper's shaky performance during a short stint as a 2020 presidential candidate and an expected primary challenge from former state House Speaker Andrew Romanoff may wound him in the general election. Susan Collins:For Sen. Susan Collins, a tough reelection got a lot tougher with Trump impeachment inquiry Collins' long-held image as a moderate voice on Capitol Hill took on water last year with her pivotal vote to confirm Brett Kavanaugh to the Supreme Court. Progressives fumed over her vote, promising to raise money and turn out Mainers to keep her from winning a fifth term. Collins was leading her likely Democratic opponent, state House Speaker Sara Gideon, by double digits in a Gravis Marketing poll released in June. But there was a potential warning sign for the incumbent: the same poll found 48% approved of Collins' performance – the same percentage that disapproved. Few GOP incumbents have a bigger bullseye than Sen. Martha McSally in Arizona. The former Air Force fighter pilot has a stellar resume but she is running in an increasingly purple state against a well-funded and high-profile challenger: former astronaut Mark Kelly, the husband of former congresswoman and gun-control advocate Gabby Giffords. Kelly is a first-time candidate and Republican strategists said they hope to exploit that lack of experience on the campaign trail. McSally has never won statewide (she lost a Senate race in 2018 and was appointed to fill the vacancy created by John McCain's death last year). But she wields the power of incumbency and Trump's endorsement could turn out conservative Arizonans wary of McSally. Democrats are optimistic they can flip the seats of two other Republican incumbents – Thom Tillis of North Carolina and Joni Ernst of Iowa. Of the two, Tillis is in deeper peril, according to political experts, partly because there are signs the state might not be as red as it was in 2016. A Charlotte-area congressional seat that Trump won by 12 points in 2016 barely went for a Trump-endorsed Republican in a special election earlier this year. Tom Steyer:Tom Steyer has been pushing impeachment for years. Now it's center stage for his first debate Just as Republicans Gardner and Collins must find cross-over appeal in states that voted in 2016 for Clinton, Democrats Doug Jones (Alabama) and Gary Peters (Michigan) face a similar challenge because they're running for reelection in states that Trump won. Jones is considered the most vulnerable incumbent running in 2020 – Democrat or Republican – chiefly because he represents a state that Trump carried by nearly 28 percentage points. Jones, the only Senate Democrat in the Deep South, came to the Senate after winning a closely contested special election in 2017 over Republican Roy Moore, who was tainted by allegations he had romantically pursued and sexually assaulted teenage girls when he was in his 30s. Moore is running again but so are other Republicans, including Congressman Bradley Byrne and former Auburn Football Coach Tommy Tuberville, neither of whom carry the political baggage that helped Jones win his seat. Republicans also believe that Peters is very beatable, largely because many Michiganders don't know him or aren't sure what to make of him. Polls show more than a third of state voters don't have a firm opinion of him despite nearly five years in office. Peters is \"weak\" Duffy said. \"It’s not that he has angered voters. It’s that they have no idea who he is.” Republicans are also optimistic because GOP businessman and Army veteran John James, who outperformed expectations in a 2018 loss to Democratic Sen. Debbie Stabinow, has entered the race. Nita Lowey:Longtime Rep. Nita Lowey won't seek reelection in 2020 A senator's decision not to seek reelection presents a rare opportunity for opposing parties because it traditionally provides a better chance to flip a seat when there's no incumbent touting years of constituent achievement or legislative accomplishment. But none of the four open seats – three GOP states (Georgia, Kansas and Tennessee) and one Democratic (New Mexico) – are in much danger of changing party control, according to political analysts. Traditionally red Kansas could be the exception if Republican Kris Kobach wins the primary. The immigration hard-liner who lost a gubernatorial contest to Democrat Laura Kelly in 2018 is seen by analysts and political operatives on both sides as a weak candidate who would likely put the state in play if he wins the GOP nomination next year. Georgia's open seat (created by the early retirement of Republican Johnny Isakson) will be paired with Republican David Perdue's reelection bid. That would give Democrats two chances to pick up a seat in a Deep South state that's been trending more purple recently. But chances of winning one of those were hurt when rising Democratic star Stacy Abrams opted not to run.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell: Senate would have 'no choice' but to hold trial if House votes to impeach Donald Trump",
      "url": "https://www.usatoday.com/story/news/politics/2019/09/30/mitch-mcconnell-senate-must-hold-trial-trump-if-house-impeaches/3820028002/",
      "subtitle": "Mitch McConnell: Senate would have 'no choice' but to hold trial if House votes to impeach Donald Trump",
      "author": "Ledyard King",
      "content": "WASHINGTON – Senate Majority Leader Mitch McConnell said Monday the Senate would have \"no choice\" but to hold a trial on whether to remove President Donald Trump from office if the House votes to put forward articles of impeachment. The Kentucky Republican told CNBC that the obligation to hold a trial is part of Senate rules, and it would take a two-thirds vote of the chamber to change that. \"I would have no choice but to take it up, based on a Senate rule on impeachment,\" McConnell said. House Speaker Nancy Pelosi announced an impeachment inquiry last week over whether Trump improperly pressured Ukraine to investigate his political rival Joe Biden. Trump denied exerting any pressure or doing anything improper. Timeline:Nancy Pelosi puts the Trump impeachment inquiry on a fast track. Here are the plan, timeline and players It would take a simple majority of the House (218 votes) to submit articles of impeachment to the Senate. Impeachment would be akin to an indictment in a court proceeding. A trial would then be held in the Senate where it would take at least two-thirds (or 67 votes) to convict Trump and remove him from office. The chief justice of the Supreme Court would preside over the trial. House lawmakers would act as prosecutors and senators as the jury for a trial. How long a trial might take is unclear. The Senate would have to pass a resolution setting up the ground rules of a trial. As majority leader, McConnell would have some latitude in shaping those rules, as well as determining the timing of the trial. \"So I would have no choice but to take it up,\" McConnell said. \"How long you're on it is a whole different matter.\" When the House impeached President Bill Clinton more than two decades ago, the Senate trial began about three weeks after the House acted. After a five-week trial, the GOP-led Senate acquitted Clinton. Watergate parallel:Trump's Ukraine call and Nixon's Watergate increasingly draw parallels as scandal erupts After the acquittal, Clinton finished the remaining 11 months of his term.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell rebukes Donald Trump's plan to pull US troops out of northern Syria",
      "url": "https://www.usatoday.com/story/news/politics/2019/10/07/mitch-mcconnell-rebukes-trumps-plan-pull-troops-out-syria/3901760002/",
      "subtitle": "Mitch McConnell rebukes Donald Trump's plan to pull US troops out of northern Syria",
      "author": "Ben Tobin",
      "content": "LOUISVILLE — Though he and President Donald Trump often agree, Senate Majority Leader Mitch McConnell said Monday he is against the president's move to pull U.S. troops out of northern Syria. The White House announced the decision late Sunday night as Turkey prepares a military assault against Kurdish fighters who helped the U.S. battle the Islamic State. Trump defended the decision on Twitter Monday, saying it was time to \"get out of these ridiculous Endless Wars, many of them tribal, and bring our soldiers home.\" He added that \"WE WILL FIGHT WHERE IT IS TO OUR BENEFIT, AND ONLY FIGHT TO WIN\" and that \"Turkey, Europe, Syria, Iran, Iraq, Russia and the Kurds will now have to figure the situation out.\" However, McConnell rebuked the move in a statement issued Monday, saying \"ISIS and al Qaeda remain dangerous forces in Syria.\" \"A precipitous withdrawal of U.S. forces from Syria would only benefit Russia, Iran, and the Assad regime,\" McConnell said. \"And it would increase the risk that ISIS and other terrorist groups regroup.\" Background:Graham says Trump's Syria pullout abandons Kurds, helps ISIS McConnell urged Trump to reverse the decision and to keep fighting ISIS. Though McConnell opposes Trump's decision, his Republican counterpart from Kentucky, Sen. Rand Paul, voiced support for the president. \"I stand with @realDonaldTrump today as he once again fulfills his promises to stop our endless wars and have a true America First foreign policy,\" Paul tweeted Monday. But the Senate majority leader was far from alone in his pushback against the Trump administration. Sen. Lindsey Graham, R-S.C., said Trump's decision \"will be a stain on America's honor for abandoning the Kurds,\" and \"we have sent the most dangerous signal possible – America is an unreliable ally.\" Additionally, Nikki Haley, Trump's former U.S. ambassador to the United Nations, spoke out against the move, tweeting, “The Kurds were instrumental in our successful fight against ISIS in Syria. Leaving them to die is a big mistake.\" ICYMI:In ad, McConnell says impeachment will fail 'with me as majority leader' Secretary of State Mike Pompeo and other administration officials had promised the U.S. would ensure that \"the Turks don't slaughter the Kurds.\" The Kurdish fighters in Syria are known as the Syrian Democratic Forces. Turkey's President Recep Tayyip Erdogan considers the Kurdish forces in Syria to be terrorists allied with Kurdish insurgents within his country and has long threatened a military incursion into the area. Foreign policy experts, as well as Republican and Democratic lawmakers, have warned that allowing Turkey into the region could lead to a massacre of the Kurds and would be seen as an American betrayal of  a vital military ally. Contributing: William Cummings, David Jackson and Deirdre Shesgreen.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Democrat running against Mitch McConnell raises $10.7 million in third quarter",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/10/10/amy-mcgrath-raises-10-7-million-race-against-mitch-mcconnell/3934531002/",
      "subtitle": "Democrat running against Mitch McConnell raises $10.7 million in third quarter",
      "author": "Savannah Behrmann",
      "content": "WASHINGTON – Democrat Amy McGrath, who is challenging Senate Majority Leader Mitch McConnell for his seat in Kentucky in 2020 raised $10.7 million in the first three months of her campaign. McGrath started her run against McConnell, who has represented the Bluegrass State on Capitol Hill since 1985, in July. She raised $2.5 million the first day, and the Democratic Senatorial Campaign Committee told USA TODAY’s affiliate paper the Louisville Courier-Journal at the time that that number stood as the most ever raised in the first day of a campaign for U.S. Senate. Her campaign stated Thursday that they received 299,000 contributions with the average contribution size being just $36, and they received donations from all 120 counties, which totaled to reach almost $11 million. McGrath, a former Marine fighter pilot, unsuccessfully ran for Kentucky's 6th Congressional District in 2018, but nearly flipped a staunchly red district blue. More:5 things to know about Amy McGrath vs. Mitch McConnell in the 2020 Kentucky Senate race McConnell is the most unpopular Senator in the country, according to the survey research company Morning Consult. And in his home state, he has a net unfavorability rating of 50%. However, the Senate Majority Leader has been one of President Donald Trump's fiercest defenders. Trump seized Kentucky in 2016 by nearly 30 points. They have worked closely together on a number of issues, including working to leave a conservative legacy with the federal bench. McGrath has raised more money in this Senate race than a number of current Senators have raised for in third-quarter fundraising for their presidential bids. These include New Jersey Senator Cory Booker, who raised just over $6 million, and Amy Klobuchar of Minnesota, who brought in $4.8 million, according to media reports. McConnell has not yet released how much he has raised yet, but candidates are required to disclose their third-quarter fundraising numbers to the Federal Election Commission by Oct. 15. McGrath told the Journal in July that, \"A lot of Kentuckians voted for Donald Trump because he wasn't part of that political establishment on either side. For me, I'm a Democrat. My husband's a Republican. I was an independent for 12 years; it's been about my country.\" During the 2018 election, McGrath emphasized the need to protect pieces of the Affordable Care Act, acknowledged the impacts of climate change and called for restoring respect in American leadership. She has bemoaned that some of the Democratic presidential candidates have crawled too far to the left, saying she opposes taking away private health insurance as part of a \"Medicare for all\" plan or subsidizing health insurance \"for illegal immigrants.\". Mark Nickolas, McGrath’s campaign manager said Thursday, “Mitch McConnell has never faced an opponent like Amy McGrath. Not only does a new independent poll show the race tied, but more than a quarter-million grassroots donations – from all 120 Kentucky counties – have provided us a record-shattering first quarter of nearly $11 million to take down McConnell and his self-serving special interest allies. Change is coming.” Contributing: Phillip M. Bailey, Louisville Courier Journal",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "McConnell rebukes Trump administration: Syria withdrawal is a 'grave strategic mistake'",
      "url": "https://www.usatoday.com/story/news/politics/2019/10/18/mitch-mcconnell-rebukes-trump-administrations-syria-withdrawal/4027514002/",
      "subtitle": "McConnell rebukes Trump administration: Syria withdrawal is a 'grave strategic mistake'",
      "author": "Savannah Eadens",
      "content": "LOUISVILLE – Sen. Mitch McConnell has published a stern rebuke of the Trump administration's decision to pull military forces out of Syria, saying the decision \"will leave the American people and homeland less safe, embolden our enemies and weaken important alliances.\" In a Washington Post op-ed published Friday afternoon, and later provided to the Courier Journal, McConnell, R-Ky., the withdrawal of U.S. forces from Syria \"a grave strategic mistake.\" The longtime Kentucky senator and Senate majority leader also explained three lessons he said he has learned while working with three different administrations since the Sept. 11, 2001, terrorist attacks. \"Lesson No. 1.,\" he wrote, is that the \"threat is real and cannot be wished away.\" \"These fanatics threaten American interests and American lives. If permitted to regroup and establish havens, they will bring terror to our shores,\" he said. The second lesson, he said, is the importance of American leadership. \"No other nation can match our capability to spearhead multinational campaigns that can defeat terrorists and help stabilize the region. Libya and Syria both testify to the bloody results of the Obama administration’s 'leading from behind,'\" McConnell wrote. The third lesson, he said, is that the U.S. is not alone in the fight against the Islamic State and the Taliban — and that Syria had been a model for the \"successful approach\" of contributing \"limited, specialized capabilities that enable our local partners to succeed.\" \"Unfortunately, the administration’s recent steps in Syria do not reflect these crucial lessons,\" McConnell wrote. McConnell criticized the Obama administration's withdrawal from Iraq, which he said \"facilitated the rise of the Islamic State in the first place.\" He did not mention President Donald Trump by name in his column. Read Mitch McConnell's op-ed: 'Withdrawing from Syria is a grave mistake'",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell snubbed by Elijah Cummings' pallbearer in handshake line at US Capitol ceremony",
      "url": "https://www.usatoday.com/story/news/politics/2019/10/25/mitch-mcconnells-handshake-snubbed-elijah-cummings-pallbearer/2453194001/",
      "subtitle": "Mitch McConnell snubbed by Elijah Cummings' pallbearer in handshake line at US Capitol ceremony",
      "author": "Billy Kobin",
      "content": "Senate Majority Leader Mitch McConnell received a bit of online attention Thursday during a memorial service for Rep. Elijah Cummings when a pallbearer appeared to refuse to shake the Kentucky Republican's hand. A video posted to Twitter captures the pallbearer walking down a line and shaking the hands of several lawmakers before ignoring an outstretched McConnell's hand. McConnell appears to look somewhat caught off guard and turns to Senate Minority Leader Chuck Schumer near the end of the 16-second video. McConnell, Schumer, Rep. Mark Meadows, Rep. Jim Clyburn and House Speaker Nancy Pelosi were among several attendees who spoke Thursday as Cummings was lying in state inside the U.S. Capitol's Statuary Hall. Cummings, a Maryland Democrat who represented parts of Baltimore for 23 years in Congress, died Oct. 17 at the age of 68 due to health complications. Elijah Cummings funeral live updates:Barack Obama, Clintons to honor Maryland congressman He was the first black lawmaker to lie in state at the Capitol, according to the Congressional Black Caucus. A funeral for Cummings will be held Friday morning at the New Psalmist Baptist Church in Baltimore, where he worshiped for nearly 40 years. Former Presidents Barack Obama and Bill Clinton are among the dignitaries set to speak during the service. Former Secretary of State Hillary Clinton is also slated to speak. During his remarks Thursday, McConnell praised Cummings, who chaired the House Oversight and Reform Committee. \"He knew there was only one reason why a son of sharecroppers, a child who had literally had to bear the injuries of bigotry and segregation, could graduate from law school and eventually chair a powerful committee in Congress,\" McConnell said. \"Only one reason, because principled leaders had fought to give kids like him a chance. \"Chairman Cummings made it his life's work to continue that effort. He climbed the ranks here in the Capitol, not because he outgrew his hometown but because he was so committed to it.\" Cummings lying in state:Elijah Cummings lies in state at Capitol as Congress bids farewell to a 'master of the House' McConnell also noted how Cummings tirelessly worked in 2015 to bring people together in his native Baltimore, where protests raged following the death of Freddie Gray, a black man who suffered a fatal spinal injury while in police custody. \"By day, the congressman was here in the Capitol working and leading in these hallways of power,\" McConnell said. \"But every night, he rode the train back home and walked the neighborhoods, bullhorn in hand, encouraging unity and peace.\" McConnell said Cummings had a simple message for the angry protesters on Baltimore's streets after Gray's death: \"Let's go home. Let's all go home.\" \"Now, our distinguished colleague truly has gone home,\" McConnell said. \"Home to his father's house.\" Reach Billy Kobin at bkobin@courierjournal.com",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Why a pallbearer at Elijah Cummings' memorial didn't shake Mitch McConnell's hand",
      "url": "https://www.usatoday.com/story/news/politics/2019/10/28/elijah-cumpallbearer-bobby-rankin-mitch-mcconnell-handshake/2485036001/",
      "subtitle": "Why a pallbearer at Elijah Cummings' memorial didn't shake Mitch McConnell's hand",
      "author": "Ben Tobin",
      "content": "The internet went crazy after video surfaced of a pallbearer skipping Senate Majority Leader Mitch McConnell in a handshake line at a memorial service for Rep. Elijah Cummings last week. In the video, the pallbearer, Bobby Rankin, walks down a line and shaking the hands of several lawmakers before ignoring McConnell's hand, much to the apparent surprise of the Kentucky Republican. Rankin, a 64-year-old man from Charlotte, had personal reasons for being angry at McConnell, he told The Washington Post. His brother, Jerry, died from cancer last October after being exposed to contaminated water while serving in the Marines at Camp Lejeune in North Carolina. You may want to read:After Rand Paul calls Kurds 'ingrates,' Bette Midler brings up sore subject on Twitter Veterans who were exposed to the water and later developed any of 15 conditions linked to the camp's tainted drinking water — including the type of cancer Rankin's brother had, multiple myeloma — could qualify for benefits, including free health care and disability compensation, according to the Department of Veterans Affairs. Rankin told The Post that his brother did not receive the veterans' benefits he was entitled to before he died. And while Cummings \"reached across party lines trying to help my brother get his military benefits,\" including to McConnell, Rankin said he blamed McConnell in part for his brother's death. “I could not put my hands in the man’s hand who refused to help somebody who served his country,” Rankin said, later adding, “I couldn’t do it because I was thinking about my brother.” According to The Post, Rankin wasn’t clear about exactly why his brother didn’t receive VA benefits or McConnell’s precise role in Jerry’s battle to get them after his cancer returned in 2016. McConnell's spokespeople did not provide a comment when contacted by The Courier Journal. Since the memorial service, the video of Rankin passing up on McConnell's handshake has gone viral — inspiring the hashtag \"#thehandshakethatneverwas.\" But according to The Washington Post, Rankin said he didn't even see the video until one of the news outlet's reporter's called. \"I don't know what people are saying,\" Rankin said. Cummings, a Maryland Democrat who represented parts of Baltimore for 23 years in Congress, died Oct. 17 due to health complications. He was 68 years old and was the first black lawmaker to lie in state at the Capitol. A funeral for Cummings was held Friday morning at the New Psalmist Baptist Church in Baltimore, where he worshiped for nearly 40 years. Former Presidents Barack Obama and Bill Clinton were among the dignitaries who spoke during the service. During his remarks at the memorial service, McConnell praised Cummings, who chaired the House Oversight and Reform Committee. Also:McConnell has made money rain on protégé Daniel Cameron in attorney general's race \"He knew there was only one reason why a son of sharecroppers, a child who had literally had to bear the injuries of bigotry and segregation, could graduate from law school and eventually chair a powerful committee in Congress,\" McConnell said. \"Only one reason, because principled leaders had fought to give kids like him a chance. \"Chairman Cummings made it his life's work to continue that effort. He climbed the ranks here in the Capitol, not because he outgrew his hometown but because he was so committed to it.\" Rankin first met Cummings at a gas station in Baltimore more than 20 years ago, according to The Washington Post. The two struck up a conversation and quickly became friends. “When I carry him to his grave, if I could say something to him, I would say something I said to him many, many times before,” he told The Post. “What a mighty, mighty man he is.” Contact Ben Tobin at bjtobin@gannett.com and 502-582-4181 or follow on Twitter @TobinBen. Support strong local journalism by subscribing today: subscribe.courier-journal.com.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "McConnell still 'can't imagine' Senate will oust Trump in impeachment process",
      "url": "https://www.usatoday.com/story/news/politics/2019/11/18/trump-impeachment-mcconnell-cant-imagine-presidents-removal/4229878002/",
      "subtitle": "McConnell still 'can't imagine' Senate will oust Trump in impeachment process",
      "author": "Morgan Watkins",
      "content": "Senate Majority Leader Mitch McConnell continues to hold the line when it comes to impeachment, saying Monday he \"can't imagine a scenario\" in which the U.S. Senate would remove President Donald Trump from office. This comes the week after the U.S. House of Representatives began holding public hearings in the impeachment inquiry. The House still has to vote on whether to approve articles of impeachment. If that happens, McConnell said Monday he's still confident it wouldn't lead to Trump's ouster. “I can’t imagine a scenario under which President Trump would be removed from office with 67 votes in the Senate,\" he said, reaffirming comments he made two weeks ago in Washington. Although he seems assured of the outcome, he noted it's still an open question of how long a Senate impeachment trial would last. Impeachment would displace the chamber's other business, McConnell said. Earlier:Billboard warns McConnell to impeach Trump or 'lose your job' He indicated the ongoing inquiry is already slowing its progress on priorities such as the U.S.-Mexico-Canada Agreement, which requires Congress' approval. \"Nothing is happening because House Democrats seized with Trump derangement syndrome are consumed with this argument with the president,\" he said. McConnell was in downtown Louisville on Monday to receive this year's \"Distinguished Rural Kentuckian\" award from the Kentucky Electric Cooperatives. During his acceptance speech, McConnell spoke about how he has been able to use his position as Senate majority leader to benefit rural Kentucky and \"Middle America.\" He also criticized a general lack of civility in American political discourse, which he considers to be \"our biggest national problem\" right now. Stay updated:USA TODAY's impeachment coverage \"People are acting out,\" he said. \"We need to learn how to behave better, how to disagree without anger ...\" McConnell is up for reelection next year and has a reputation for running cutthroat campaigns against his political opponents. And he acknowledged Monday that campaigns are \"hot salsa\" but emphasized that the governing process doesn't have to be that way. Gov. Matt Bevin, who lost his own reelection bid this month to Democrat Andy Beshear, often has been criticized for the way he spoke about public school teachers and other people who opposed his policies. But McConnell told reporters Monday that he wasn't thinking about Kentucky politics when he made those comments about the need for civility. Previously:McConnell thinks Trump would be safe if a trial was held today He said he was thinking about national issues, and in particular about when U.S. Supreme Court Justice Brett Kavanaugh's nomination to the country's highest court was being considered last year. Kavanaugh's nomination was highly controversial. Both he and Christine Blasey Ford, a university professor who accused Kavanaugh of sexually assaulting her when they were teenagers, testified before Congress in the lead-up to his eventual appointment to the Supreme Court. On Monday, McConnell spoke critically of that period of time, when \"we had people chasing members (of Congress) through the halls and getting in their faces and screaming and hollering and going over to the Supreme Court and acting out. \"Certainly we have free speech in this country, but I think we have a serious civility problem,\" he said. When a reporter asked whether Trump shares some of the blame for that, given his penchant for harshly criticizing people he disagrees with, McConnell said: \"I think we have a civility problem, and I didn't confine it to just liberals. I think it's across the board.\" As for Bevin's loss to Beshear, McConnell reiterated statements he previously made in which he said Bevin had a good four years but came up short in the November election. He also said he called Beshear after Bevin conceded the race last week and plans to meet with the attorney general — and soon-to-be governor — before the end of the year. Related:Will Rand Paul be punished for outing suspected Trump whistleblower? Morgan Watkins: 502-582-4502; mwatkins@courierjournal.com; Twitter: @morganwatkins26. Support strong local journalism by subscribing today: courier-journal.com/morganw.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "GOP complaint takes sports radio host and potential Mitch McConnell challenger Matt Jones off air",
      "url": "https://www.usatoday.com/story/sports/2019/11/06/matt-jones-mitch-mcconnell-complaint/2514428001/",
      "subtitle": "GOP complaint takes sports radio host and potential Mitch McConnell challenger Matt Jones off air",
      "author": "Sarah Ladd",
      "content": "Kentucky Sports Radio host Matt Jones, who's toyed with the idea of running for Senate next year against Senate Majority Leader Mitch McConnell in 2020, announced Wednesday he won't be on iHeart Radio in the near future. \"Due to the Mitch McConnell complaint filed this morning with the FEC against me, iHeart Radio has asked that I not be on the show in the upcoming days,\" Jones wrote on the Kentucky Sports Radio website. The Republican Party of Kentucky filed a complaint with the Federal Elections Commission on Wednesday accusing Jones, a Democrat, of \"serious violations\" of regulations, including accepting corporate contributions toward his campaign and failing to report related expenditures. \"The complaint is absolute nonsense and very disappointing from someone as powerful as McConnell,\" he wrote. \"I have said repeatedly in public and in filings with the FEC that I am not yet a candidate and I haven’t used the show to raise money or talk about my Exploratory Committee in any way. Nevertheless Senator McConnell has complained that having me on air is unfair and the man who speaks often about the importance of free speech and the exchange of public ideas has decided to cut off mine.\" \"I understand iHeart Radio’s decision and don’t blame them. Since I will be making a decision on whether to run very soon, fighting this battle with the Senate Majority leader doesn’t make sense,\" Jones went on. \"I get it and still value my relationship with them.\" He said if he decides against running, he hopes to stay on with iHeart Radio and KSR \"into the future.\" \"For the time being however, I won’t be on the show. I had hoped to do the show for a couple more weeks, make my decision and then take time off to finish my book and regroup after a long process. Thanks to Senator McConnell that time will apparently start now.\" \"One would think that a man who has at his disposal all the media outlets in America, an unending supply of corporate donations and all the platforms a person could ever need would not be frightened of a sports radio show in Kentucky,\" Jones wrote. \"Alas, I guess that is not correct. I am disappointed but still love KSR and know that my co-hosts will keep it entertaining for everyone. Until the next time, Go Cats!\" Jones shared his statement on Twitter and wrote again that he didn't blame iHeart Radio. \"They have been very supportive in this entire process and wonderful to work for,\" he wrote.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell claims Senate trial 'would not lead to a removal' of Trump if held today",
      "url": "https://www.usatoday.com/story/news/politics/2019/11/05/mitch-mcconnell-senate-would-not-removal-trump/4171994002/",
      "subtitle": "Mitch McConnell claims Senate trial 'would not lead to a removal' of Trump if held today",
      "author": "Savannah Behrmann",
      "content": "WASHINGTON – Senate Majority Leader Mitch McConnell said that if the impeachment trial were held today, the Senate would acquit President Donald Trump. “I will say I’m pretty sure how it’s likely to end,” McConnell said to reporters. “If it were today I don’t think there’s any question — it would not lead to removal. So the question is how long does the Senate want to take?” “How long do the presidential candidates want to be here on the floor of the Senate instead of in Iowa and New Hampshire?” The Kentucky Republican asked, taking aim at the six Senators running in the Democratic primary election for President. “And all of these other related issues that may be going on at the same time, it's very difficult to ascertain how long this takes. I'd be surprised if it didn't end the way the two previous ones did with the president not being removed from office.\" More:#bybyebevin trends on Twitter during close Kentucky gubernatorial race The House of Representatives' impeachment inquiry stems from a July 25 call between Trump and Ukrainian President Volodymyr Zelensky in which Trump pressed Zelensky to investigate the President's political rivals. The House recently adopted rules for how Democrats will conduct the public phase of the impeachment investigation. More:Pathway of the impeachment process: How it works, where we are More:Sondland detailed 'quid pro quo' in amended testimony filed this week, transcript shows If the House approves articles of impeachment against the President, there would then be a trial in the Senate, which could vote to remove him. McConnell also clarified to reporters that discussions on formalizing the process have not begun with Senator Chuck Schumer, the Democratic Minority Leader, but added that “if the House acts, I think the place to start would take a look at what the agreement was 20 years ago [in the Clinton impeachment trial] as a starting place and discuss how we may be able to agree to handle the process.” \"How long it goes on really depends on how long the Senate wants to spend on it,\" McConnell said.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    }
  ]
}