{
  "articles": [
    {
      "title": "Washington Post editor says Bernie Sanders favoring 'conspiracy theory' by linking coverage to Amazon, Jeff Bezos",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/08/13/bernie-sanders-criticizes-washington-post-coverage-baron-responds/1994986001/",
      "subtitle": "Washington Post editor says Bernie Sanders favoring 'conspiracy theory' by linking coverage to Amazon, Jeff Bezos",
      "author": "Nicholas Wu",
      "content": "WASHINGTON – Marty Baron, the executive editor of the Washington Post, said Sen. Bernie Sanders, I-Vt., had bought into a \"conspiracy theory\" after the senator, a Democratic presidential candidate, accused The Post of anti-Sanders bias. “Sen. Sanders is a member of a large club of politicians – of every ideology – who complain about their coverage,” Baron told The Post in a statement. “Contrary to the conspiracy theory the senator seems to favor, Jeff Bezos allows our newsroom to operate with full independence, as our reporters and editors can attest.” At a Monday town hall in Wolfeboro, N.H., Sanders suggested that some critical coverage of his campaign was linked to his own criticism of Amazon, noting that Amazon paid little corporate tax last year. More:Bernie Sanders' unique plan to legalize marijuana \"Anybody here know how much Amazon paid in taxes last year?\" \"Nothing,\" shouted back the audience. \"I talk about that all of the time, and then I wonder why The Washington Post, which is owned by Jeff Bezos, who owns Amazon, doesn't write particularly good articles about me. I don't know why, but I guess maybe there's a connection,\" said Sanders, to laughter from the audience. Jeff Bezos, the CEO and founder of Amazon, also owns The Washington Post, though the paper stresses its editorial independence and separate management. Sanders has been openly critical of Amazon for its labor and business practices. The company raised its minimum wage to $15 an hour in October 2018 after a backlash from Sanders and other progressive politicians. Sanders has also called for the company to pay more in taxes after reports alleged the company paid no federal income taxes in 2018. More:After Newtown, Pulse, Vegas caused little change, gun-control advocates hope latest shootings push significant gun laws More:Kamala Harris hits back at NRA after group criticizes her gun control proposals In July, The Post published a story about labor disputes on the Sanders campaign. The campaign's union had sparred with management as they formed a union, and some staff had complained to The Post about not being paid $15 an hour. Sanders later told The Des Moines Register that he was \"disappointed\" in the campaign employees that had complained to the press about the campaign's labor disputes. \"It does bother me that people are going outside of the process and going to the media,\" he said at the time. \"That is really not acceptable. It is really not what labor negotiations are about, and it's improper.\" President Donald Trump has echoed similar criticism of The Post, using the hashtag #AmazonWashingtonPost in tweets and accusing the newspaper of furthering Amazon's corporate goals.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "'Phony suppression poll': Trump bashes poll that shows him trailing against Biden, Sanders, Warren",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/09/11/trump-bashes-poll-has-him-trailing-biden-sanders-warren/2284395001/",
      "subtitle": "'Phony suppression poll': Trump bashes poll that shows him trailing against Biden, Sanders, Warren",
      "author": "Rebecca Morin",
      "content": "WASHINGTON – President Donald Trump slammed a new poll Wednesday as a \"phony suppression poll\" after it showed him trailing behind several major Democratic presidential candidates for the 2020 election. In an ABC News/Washington Post poll published Wednesday, Joe Biden has a 15 percentage point lead over Trump among registered voters, with the former Vice President at 55% and the president at 40%. The margin between that match-up has grown since July, where Biden was at 53% and Trump was at 43% — a 10 percentage points difference. More:President Trump rips Fed as 'Boneheads,' calls for zero or negative interest rates \"In a hypothetical poll, done by one of the worst pollsters of them all, the Amazon Washington Post/ABC, which predicted I would lose to Crooked Hillary by 15 points (how did that work out?), Sleepy Joe, Pocahontas and virtually all others would beat me in the General Election,\" Trump wrote in a tweet. \"This is a phony suppression poll, meant to build up their Democrat partners. \"I haven’t even started campaigning yet, and am constantly fighting Fake News like Russia, Russia, Russia,\" he continued. \"Look at North Carolina last night. Dan Bishop, down big in the Polls, WINS. Easier than 2016!\" Biden isn't the only candidate that holds a lead against Trump. Sen. Bernie Sanders of Vermont holds a 9 percentage point lead over Trump among registered voters, with Sanders at 52% and Trump at 43%. That is a jump from July, where there was only a 1 percentage point difference, with Trump at 48% and Sanders at 49%. Both Sens. Elizabeth Warren and Kamala Harris also hold a small 7 percentage point lead among registered voters. Warren is at 51% while Trump is at 44% in that match-up, a jump from July where the two were tied at 48%. Harris is at 50% while Trump is at 43% in their match-up, a small jump from July, where she was at 48% and Trump at 46%. More:Donald Trump slams 'fixed' poll showing his latest job approval rating is at 38% In a match-up with South Bend Mayor Pete Buttigieg, Trump is at 43 compared to Buttigieg at 47. The 4 percentage point difference is not statistically significant due to the margin of error. There is a margin of error of 3.5 percentage points, with 1,003 adults surveyed between Sept. 2-5. The interviews were conducted by landline and cell phones, as well as in English and Spanish. Trump on Tuesday bashed a separate ABC/Washington Post poll on his approval rating. The poll showed his approval rating drop to 38% from 44% in July. The president has repeatedly criticized his standing in polls and approval ratings in a variety of surveys throughout his presidency. Trump has often referred to polling he disagrees with as \"suppression polls\" or \"phony polls.\"",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Cardi B to Bernie Sanders: 'What are we going to do about wages in America?'",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/08/14/2020-democrats-cardi-b-bernie-sanders-discuss-minimum-wage/2013362001/",
      "subtitle": "Cardi B to Bernie Sanders: 'What are we going to do about wages in America?'",
      "author": "Rebecca Morin",
      "content": "WASHINGTON – Rapper Cardi B wants to know how Democratic presidential candidates are going to help everyday Americans make money moves. The Grammy Award-winning rapper posted a video on Instagram Tuesday in which she discussed the unemployment rate and increasing the minimum wage with 2020 Democratic presidential candidate Sen. Bernie Sanders \"A couple of weeks ago I asked my followers if you all had the chance to ask a Democratic candidate a question, what would that question be? The topic that was mentioned the most by all of you was about raising MINIMUM WAGE,\" she wrote in the caption of her roughly 90-second video. More:Stacey Abrams: I'd be 'honored' to be running mate of any 2020 Dem presidential candidate More:Steve King: 2020 presidential candidates, GOP challenger, condemn 'rape and incest' remarks Cardi B, whose real name is Belcalis Marlenis Almánzar, has been outspoken on social media about her politics, particularly about her support for Sanders and her criticisms of President Donald Trump. In Tuesday's video clip, Cardi B began by saying: \"What are we going to do about wages in America?\" \"Like, for example me, as a New Yorker, not now, but you know, when I was not famous, I just felt like no matter how many jobs I get, I wasn't able to make ends meet,\" she continued. \"Like, I wasn't able to pay my rent, get transportation and eat.\" Sanders said that it was an \"excellent and important question.\" Increasing the federal minimum wage has been one of Sanders' key policy initiatives for years. He wants to increase the national minimum wage to $15/hour. \"Right now we have tens of millions of people who are earning what I consider to be starvation wages. Can you imagine somebody today earning $9 an hour?\" Sanders said. \"It don't make no sense,\" Cardi B responded. \"No, it doesn't,\" Sanders replied. Sanders also highlighted legislation passed by the House of Representatives in June that would increase the federal minimum wage to $15 an hour by October 2025. Cardi B also seemingly dissed Trump, who has repeatedly touted the low unemployment rate in America, particularly for African Americans and Latinos, and claimed credit for the statistics as he seeks re-election. More:White nationalists could have firearms taken under red flag law proposed by Kamala Harris More:U.S. Rep. Steve King: If not for rape and incest, 'would there be any population left?' \"My thing is certain people like to brag that there is more jobs now in America, but it's like, yeah, there's an increase of jobs given, but what are they paying in these jobs? They're practically paying nothing,\" she said. \"You got it,\" Sanders replied. \"That is exactly the issue. So you can get a job, but maybe you're gonna have to work two or three jobs.\" The Bronx rapper first hinted at her interview with Sanders on July 29, when she posted a photo of the two. \"Not me, US. Thank you Senator Bernie Sanders for sitting with me and sharing your plans on how you will change this country,\" she wrote in the caption of that post last month. On his Twitter account, Sanders also previewed the full interview with Cardi B, which will go live on Thursday. \"Cardi B knows this is the most important election of our lives,\" Sanders wrote in the tweet. \"So we sat down to talk about the pressing issues facing people today.\" Like what you’re reading?:Download the USA TODAY app for more",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders announces plan to deal with 'crisis' in American journalism, as he calls out 'Trump’s authoritarian bullying of the media'",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/08/27/2020-democrats-sanders-has-plan-help-journalism/2134162001/",
      "subtitle": "Bernie Sanders announces plan to deal with 'crisis' in American journalism, as he calls out 'Trump’s authoritarian bullying of the media'",
      "author": "Savannah Behrmann",
      "content": "WASHINGTON -- Sen. Bernie Sanders, I-Vt., a top-tier candidate in the 2020 Democratic primary field, used an op-ed published Monday in the Columbia Journalism Review to release his plan to “take concrete action” against “today’s assaults on journalism by Wall Street, billionaire businessmen, Silicon Valley, and Donald Trump,” calling the situation a \"crisis.\" Sanders writes that the convergence of several trends has resulted in the “decimation of journalism” as communities have lost local newspapers and newsrooms have lost employees. Newsroom employment across the country has declined by a quarter since 2008, Sanders writes, citing government data analyzed by the Pew Research Center. “At precisely the moment when we need more reporters covering the healthcare crisis, the climate emergency, and economic inequality, we have television pundits paid tens of millions of dollars to pontificate about frivolous political gossip, as local news outlets are eviscerated,” Sanders writes. News outlets have been looking for ways to make money as traditional advertising dries up and jobs cuts have been necessary. Sanders acknowledges that much of that revenue potentially still exists in digital advertising, but that that money largely goes to Facebook and Google, who “control 60 percent of the entire digital advertising market.” Sanders also faults mergers between outlets and conglomerates, and greed from places like Wall Street. For example, he mentions the proposed acquisition of Gannett by Gatehouse Media. Gannett owns USA TODAY and more than 100 other daily publications and digital marketing services. If he is elected president in 2020, Sanders said his administration will start “requiring major media corporations to disclose whether or not their corporate transactions and merger proposals will involve significant journalism layoffs.” The senator also said he would appoint an attorney general who will enforce antitrust laws against \"tech giants like Facebook and Google, to prevent them from using their enormous market power to cannibalize, bilk, and defund news organizations.” \"Their monopoly power has particularly harmed small, independent news outlets that do not have the corporate infrastructure to fight back,\" Sanders added. On top of also appointing “new, progressive leadership at the FCC” Sanders writes that he will appoint Federal Trade Commission officials who will, along with his attorney general, enforce antitrust laws against companies like Facebook and Google. Additionally, Sanders would work to pass his Workplace Democracy Plan, which boosts media workers' efforts to form unions. Sanders plan comes at a time when violence and mistrust against the media is on the rise. According to the press freedom group Reporters Without Borders, the U.S. was among the top five deadliest countries for journalists in 2018. Additionally. the US Press Freedom Tracker has recorded 27 attacks against journalists so far this year. In the op-ed, Sanders also takes on President Donald Trump’s dislike of the media, which he frequently calls \"fake news.\" “We also know that Donald Trump is making things far worse. He is a pathological liar who has spent his presidency trying to demonize journalists when they dare to debunk his lies,” Sanders pens. “Worse, he has called the media the 'enemy of the people' in a deliberate attempt to destroy the very idea of a free press.” “Trump’s authoritarian bullying of the media is totally unacceptable and it must be denounced and rejected. But let us be clear: that alone will not solve the journalism crisis. Moreover, a further expansion of oligarchic business models in the media industry could make matters worse,” he continues. This plan comes despite Sanders recently growing frustrated himself with the media, included suggesting that Jeff Bezos, who owns both Amazon and the Washington Post, had influenced the Post’s coverage of his campaign. At a town hall, Sanders suggested that some critical coverage was linked to his own criticism of Amazon, noting that Amazon paid little corporate tax last year. More:Washington Post editor says Bernie Sanders favoring 'conspiracy theory' by linking coverage to Amazon, Jeff Bezos Sanders is not the only 2020 Democratic presidential hopeful to announce a plan intended to help journalism. Entrepreneur Andrew Yang has proposed a Local Journalism Fund, writing that the public \"should recognize that local journalism has a vital public function.\" In his op-ed, Sanders writes: \"Our constitution’s First Amendment explicitly protects the free press because the founders understood how important journalism is to a democracy. More than two centuries after the constitution was signed, we cannot sit by and allow corporations, billionaires, and demagogues to destroy the Fourth Estate, nor can we allow them to replace serious reporting with infotainment and propaganda.\"",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders unleashes $16 trillion climate plan that builds on Green New Deal",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/08/22/bernie-sanders-climate-plan-green-new-deal-follow-costs-16-trillion/2081655001/",
      "subtitle": "Bernie Sanders unleashes $16 trillion climate plan that builds on Green New Deal",
      "author": "null",
      "content": "WASHINGTON – Democratic presidential candidate Bernie Sanders has released a $16.3 trillion climate plan that builds on the Green New Deal and calls for the United States to move to renewable energy across the economy by 2050 and declare climate change a national emergency. While the Vermont senator had already endorsed the sweeping Democratic proposal to combat climate change and had teamed up with Rep. Alexandria Ocasio-Cortez of New York on climate legislation, Sanders' climate plan provides the most detail yet on how he envisions the climate change moonshot taking shape if he is elected president. Sanders describes his plan, released Thursday, as a \"ten-year, nationwide mobilization centered on equity and humanity\" that would create 20 million new jobs. The Green New Deal resolution, which Ocasio-Cortez put forth with Sen. Ed Markey of Massachusetts, calls on the nation to eliminate its carbon footprint by 2030 and to shift away from fossil fuels such as oil and coal and replace them with renewable energy sources such as wind and solar power. Among Sanders' ideas is sourcing 100% of the country's electricity from renewable and zero-emissions power. He is calling for committing $2.18 trillion in grants for low- and middle-income families to weatherize and retrofit their homes and businesses, with the goal of reducing residential energy consumption by 30%. He would charge the Energy Department with making sure that both new and existing commercial structures, as well as high-income home owners, meet his administration's energy retrofitting goals. NATO force announces:2 US service members killed in Afghanistan Sanders also is calling for an overhaul of the nation's transportation system by investing in electric vehicles, high-speed rail and expanded public transit. He calls for spending $526 billion in modernizing the electrical grid across the United States. In his plan, Sanders notes that communities of color are disproportionately affected by the climate emergency. He says the Green New Deal is an \"opportunity to uproot historical injustices and inequities to advance social, racial and economic justice.\" A Northern California community ravaged last November by the state's deadliest wildfire on record will serve as the backdrop for Sanders' climate announcement. Scientists and policymakers have blamed climate change for California's worsening wildfires, which have killed more than 100 people and destroyed tens of thousands of homes in recent years. As scientists warn of the imminent consequences of global warming, the Green New Deal has been a rallying point for liberals in the party's base as well as Democratic presidential contenders in the crowded field. But Republicans have argued that the plan is too radical and would drive the economy off a cliff and lead to a huge tax increase. Hundreds of thousands of Africans were enslaved in America:Wanda Tucker believes her relatives were the first Sanders is the latest Democratic presidential contender to release details of his climate plans. Former Vice President Joe Biden released a $5 trillion-plus climate proposal that he says would lead the U.S. to net zero emissions of carbon pollution by 2050, and he is calling for $1.7 trillion in federal spending over 10 years. Massachusetts Sen. Elizabeth Warren has proposed investing $2 trillion in federal funding in clean energy programs as part of a Green New Deal, including her Green Apollo Program to invest in clean energy research and development and a Green Marshall Plan devoted to encouraging countries to buy and use American-made clean energy technologies. Before abandoning his presidential bid Wednesday, Washington Gov. Jay Inslee, who staked his campaign on the issue of climate change, released a $9 trillion plan to cut emissions. Former Texas congressman Beto O'Rourke called for spending $5 trillion over 10 years to combat climate change. Sanders' plan calls for a $16.3 trillion investment, and the campaign is proposing covering the costs over 15 years by a patchwork of measures that includes eliminating existing fossil fuel subsidies and taxes on that industry; income tax revenue on the 20 million jobs created by his plan; and an estimated $1.3 trillion saved through a reduced need for safety net programs because of the creation of those jobs. Contributing: Kathleen Ronayne, The Associated Press",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Elizabeth Warren and Bernie Sanders slam Big Tech but their campaigns spend heavily on them",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/08/25/elizabeth-warren-bernie-sanders-slam-uber-lyft-spend-big/2006627001/",
      "subtitle": "Elizabeth Warren and Bernie Sanders slam Big Tech but their campaigns spend heavily on them",
      "author": "Camille Caldera",
      "content": "WASHINGTON – In March, when thousands of Uber and Lyft drivers in Los Angeles went on strike over low pay and lack of benefits, Democratic presidential candidate Elizabeth Warren took to Twitter to slam the companies and accuse them of \"squeezing\" workers while executives cashed in. \"The drivers are fighting for living wages and better working conditions, and I stand with them,” the U.S. senator from Massachusetts wrote. That same day, her campaign entered expense reports for seven Lyft and 54 Uber charges totaling more than $850. Warren condemned the companies again in May for using a “business model [that] depends, in part, on low wages for their drivers.” But between January and June, her campaign paid nearly $12,000 to the companies, according to public Federal Election Commission filings. The only candidate to top Warren on ride-sharing expenses was Sen. Kamala Harris, D-Calif., who spent almost $15,000. Her brother-in-law, Tony West, is general counsel of Uber, though Harris also voiced support for striking drivers. Vermont Sen. Bernie Sanders, who like Warren has frequently promised on the campaign trail to rein in big corporations, has also complained about the ride-sharing companies. His message for the companies? “The greed has got to end.” His campaign still spent over $9,000 on Ubers and Lyfts in the first half of 2019. Sanders and Warren were also among the top spenders at a few other large technology companies, a class of businesses they have railed against repeatedly. In total, the progressive senators paid almost two million dollars to Uber, Lyft, Amazon, Google and Facebook. Their criticisms range from the companies' practices on labor to their policies on privacy. The candidates have objected to the working conditions at Amazon warehouses, which Sanders called “unconscionable.” Sanders also introduced legislation – the “Stop BEZOS Act” – in the Senate proposing a tax on Amazon over the public benefits its employees receive. The duo even wrote to CEO Jeff Bezos warning him to stop the company’s “potentially illegal anti-union behavior” after a video leaked last fall that warned managers at Amazon-owned Whole Foods stores of the consequences of unionizing. They have also been vocal critics of what they see as monopolistic tendencies at the company. Sanders singled out Amazon for “moving very rapidly to be a monopoly” at a Washington Post event in July. Sanders also frequently remarks that Amazon “did not pay one nickel” in federal income taxes, despite raking in billions in profits. Earlier this month, at a New Hampshire campaign event, Sanders noted that he talks about this “all of the time.” “And then I wonder why The Washington Post, which is owned by Jeff Bezos, who owns Amazon, doesn’t write particularly good articles about me. I don’t know why,” said Sanders in remarks that drew comparisons to the criticisms President Donald Trump regularly lobs at Bezos and the Post. Trump has tweeted or retweeted criticism of The Washington Post more than 50 times since running for president. He has repeatedly accused The Post of being a \"lobbyist newspaper\" that Bezos uses \"as protection against antitrust claims\" against Amazon, despite assurances from top editors that Bezos allows the newsroom \"to operate with full independence.\" Like Sanders, Trump has also criticized Amazon for not paying taxes, writing on Twitter in 2015 that they are a \"big tax shelter\" with the \"power to screw public.\" He has said he is looking into antitrust policy regarding Amazon as well as Facebook and Google – both of which he has also accused of anti-conservative bias. Despite his qualms, the Trump campaign paid Amazon about $17,500 in six months. In contrast, the Sanders camp spent almost $140,000 on office supplies, event supplies, and technology from Amazon in the first two quarters, while Warren spent more than $80,000 on the same goods and services. No other candidate spent even close to that amount, with Sen. Cory Booker, D-N.J., coming in third at $31,000. For her part, Warren sums up her concerns about Amazon by suggesting it is acting as both “the umpire” and “the player” in online retail by running both the sales platform and selling its own goods. “You don’t get to be an umpire and have a team in the game,” she says. Amazon's ability to collect data and information on all its users gives it an unfair advantage in the marketplace, Warren has said. Amazon has pushed back on this narrative. In April, the corporate Amazon News Twitter account retweeted video from a town hall where Warren discussed why she wanted to break up big tech. “We don’t use individual sellers’ data to launch private label products (which account for only about 1% of sales). And sellers aren’t being “knocked out” – they’re seeing record sales every year,” the tweet said. Warren responded by accusing Amazon of “intentionally\" misconstruing the facts. Both Sanders and Warren have pledged that, if elected, they will seek to break up Facebook, Google and Amazon. Warren published a plan on the subject on Medium, vowing to make “big, structural changes to the tech sector to promote more competition.” She wants regulators to roll back big tech mergers, like Amazon acquiring Whole Foods and online retail company Zappos; Google buying navigation app Waze and smart home products maker Nest; as well as Facebook purchasing messaging platform WhatsApp and photo-driven social media site Instagram. Warren was also a top spender on Google and Facebook, which do business during presidential campaign cycles with internet advertising, digital media and subscriptions. She spent over $440,000 on Google, second to South Bend, Ind., Mayor Pete Buttigieg who almost hit $500,000. And she purchased over $1.17 million of Facebook advertising, more than any other candidate. Yet she accused Google and Facebook of having “scooped up” content from other creators, and admonished companies that “have a ton of our data” when consumers ought to have “more control over how their personal information is collected, shared, and sold.” Other big spenders on Google and Facebook, such as Buttigieg, have their own proposals for the companies. Buttigieg, for example, believes it’s too soon to contemplate breaking up any of the companies. Instead, he wants to empower the enforcers at the Federal Trade Commission with more staff, funding or authority. “We’re going to need to empower the FTC to be able to intervene, including blocking or reversing merges in cases where there’s anti-competitive behavior by tech companies,” he said during a townhall on CNN in April. Angie Kronenberg, chief advocate and general counsel of INCOMPAS – a trade association whose members include Facebook, Amazon, Google Fiber, Netflix and Twitter – said she was hardly surprised by the money Sanders and Warren were spending on companies they criticize. “In our experience, Americans have embraced tech innovations and services because it makes their lives easier and better,” Kronenberg said. “It’s not surprising to us that the campaigns also would be using these services because they’re convenient and affordable.” Kronenberg encouraged the candidates to “embrace the experience” that their campaign staffers and supporters are having with technology, including its “convenience,” “affordability,” and positive impact on the economy. “I do think that they need to embrace that experience as they consider potential implications for policy positions they may have in the campaigns and certainly if they’re elected president,” Kronenberg said. “The potential threat to the positive consumer experience could be very troubling to voters.” The Federal Election Commission only records direct disbursements from candidates’ accounts. However, candidates can also buy Google and Facebook advertisements through third-party consultants or strategists. The two tech giants have published transparency reports since May 2018 offering their most up-to-date totals for ad buys, and they show that Sanders and Warren have not withheld their funds. Warren topped the list at Google, per its transparency report, totaling $1.74 million. Buttigieg was just behind her at $1.7 million. Sanders' number totaled just over $750,000, which placed him midway through the Democratic field, in seventh place, behind other candidates including Harris and Vice President Joe Biden. But Sanders topped the list of Facebook ad buy totals since May 2018 on its transparency report, totaling over $2.5 million for the purchase of 34,000 ads. Sen. Kirsten Gillibrand and Biden spent similarly, at $2.48 million and $2.16 million respectively. Warren was not too far behind at just over $2 million. The only candidate spending more than any of the Democrats, according to Google and Facebook, was Trump. The Make America Great Again Committee spent $6 million on Google ads and nearly $11.5 million on Facebook ads since May 2018. Donald J. Trump for President, Inc., spent an additional $2 and $5 million dollars on Google and Facebook, respectively.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders' unique plan to legalize marijuana",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/08/12/bernie-sanders-legalize-marijuana-joe-rogan/39940327/",
      "subtitle": "Bernie Sanders' unique plan to legalize marijuana",
      "author": "null",
      "content": "Whether you're ready for it or not, it's election season in America. For the next 15 months we'll be hearing political ads and debates, and reading columns concerning which political candidates give our city, county, state, or country the best chance to thrive. But what's particularly interesting about the 2020 elections is that, for the first time ever, there's likely to be a real focus and debate on cannabis reform. As you're probably aware, marijuana is classified as a Schedule I drug in the United States. That means it's wholly illegal, prone to abuse, and not considered to have any medical benefits, even though the U.S. Food and Drug Administration approved the very first cannabidiol (CBD)-based oral medicine in June 2018. Yet according to various polls, the American public favors the legalization of recreational cannabis, and overwhelmingly supports patients' access to medical marijuana. This bifurcation between what the public appears to want in surveys, versus a body of lawmakers that has been unable to advance serious discussion on cannabis reform, is likely to come to head in the 2020 election. CBD crazy? You’ll be surprised by how many Americans use cannabidiol products Whereas President Donald Trump, the expected Republican nominee for a second term, has wavered on his support for legalizing marijuana at the federal level, nearly all Democratic candidates have come out in support of some form of legalization or decriminalization of the drug. But perhaps no candidate has been more vocal about this stance than Sen. Bernie Sanders (I-Vt.). In 2016, when Sanders ran for the Democratic presidential nomination, ultimately losing out to Hillary Clinton, one of his many campaign promises was to reform America's justice system by legalizing marijuana. This made Sanders the first major presidential candidate to support legalizing cannabis, with many of his fellow Democrats also taking that view ahead of the 2020 election. But whereas many of Sanders' fellow Democrats have offered their support for legalization or decriminalization without laying out a specific plan on how to get that done, Sanders has proposed a unique means of bringing the green rush to the United States. As reported by Newsweek, Sanders would use a presidential executive order to make it so. A US veteran, mothers of American kids:Interactive border wall mural honors the deported While speaking with Joe Rogan on the Joe Rogan Experience podcast, Sanders had this to say: When I ran for president for the Democratic nomination in 2016, I talked about a broken criminal justice system, which ends up having in the United States more people in jail than any other country. And what I call for then, and I call for now, is the legalization of marijuana in America. That [marijuana's Schedule I classification] is insane. Heroin is a killer drug. You can argue the pluses and minuses of marijuana, but marijuana ain't heroin. So we have to end that, and that's what I will do as president of the United States. I believe we can do that through executive order, and I will do that. As you can imagine, any possibility of change at the federal level in the U.S. has cannabis companies excited. More specifically, it has established Canadian growers with deep pockets very intrigued. Let's remember that, even though Canada has legalized adult-use weed, legalization in the U.S. would dwarf Canada's annual pot sales, and any other country around the world, for that matter. This expectation of eventual reform is what enticed Canopy Growth, the largest marijuana stock in the world by market cap, to offer to buy Acreage Holdings for $3.4 billion (when announced) on a contingent-rights basis. Shareholders have already approved the combination. The contingency, however, is that the U.S. federal government has to legalize marijuana. If that happens, in addition to Canopy paying Acreage shareholders $300 million upfront, they'll receive 0.5818 shares of Canopy Growth for each Acreage share they own. Sure, this deal gives Acreage access to Canopy's leading brands, but it's far more important for Canopy Growth, which would gain access to 20 U.S. states, as well as Acreage's more than seven dozen retail store licenses. Acreage has the infrastructure needed to make Canopy an instant success in a budding U.S. market, and the timing of this announcement (mid-April) suggests that the two parties see legalization occurring at the federal level sooner than later. Of course, Canopy Growth is far from alone. Around half of Canada's major weed growers have made plans to enter the U.S. hemp and/or cannabidiol (CBD) market in order to build business relationships and get valuable infrastructure in place on U.S. soil before a hopeful change in scheduling at the federal level. Heads up, Ford and Lincoln owners:MyFord Touch users could receive up to a $400 payout after class-action lawsuit While public opinion, and recent investments, would appear to favor the legalization of cannabis happening fairly soon in the U.S., this may not prove to be the case. For instance, only Sanders has suggested that an executive order to legalize marijuana is on the table. That means such a scenario may only work if Sanders becomes the Democratic nomination, and wins the election. There are no certainties, at the moment, who'll win the Democratic presidential nomination or the 2020 presidency. That makes it very difficult to predict whether or not cannabis has a shot at reform anytime in the near future. In the meantime, Senate Majority Leader Mitch McConnell (R-Ky.) has made it clear through his actions that cannabis-related legislation isn't going to reach the Senate floor for debate. This suggests that the Senate may have to change hands from a Republican majority to a Democratic majority if marijuana reform is to stand a chance at passing on Capitol Hill. There's no doubt that cannabis reform has more potential to occur now in the U.S. than at any point over the past couple of decades. But that also doesn't mean it's a guarantee to happen anytime soon. Invest accordingly. Sean Williams has no position in any of the stocks mentioned. The Motley Fool has no position in any of the stocks mentioned. The Motley Fool has a disclosure policy. The Motley Fool is a USA TODAY content partner offering financial news, analysis and commentary designed to help people take control of their financial lives. Its content is produced independently of USA TODAY. This Marijuana Stock Could be Like Buying Amazon for $3.19 A little-known Canadian company just unlocked what some experts think could be the key to profiting off the coming marijuana boom. And make no mistake – it is coming. Cannabis legalization is sweeping over North America – 10 states plus Washington, D.C., have all legalized recreational marijuana over the last few years, and full legalization came to Canada in October 2018. And one under-the-radar Canadian company is poised to explode from this coming marijuana revolution. Because a game-changing deal just went down between the Ontario government and this powerhouse company...and you need to hear this story today if you have even considered investing in pot stocks. Simply click here to get the full story now.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Meghan McCain challenges Bernie Sanders to name Republicans he'll work with if elected president",
      "url": "https://www.usatoday.com/story/news/politics/2019/09/04/view-meghan-mccain-challenges-bernie-sanders-bipartisanship/2210622001/",
      "subtitle": "Meghan McCain challenges Bernie Sanders to name Republicans he'll work with if elected president",
      "author": "Jeanine Santucci",
      "content": "WASHINGTON -- Vermont Sen. Bernie Sanders, a top-tier candidate for the Democratic presidential nomination, sparred with the hosts of \"The View\" on Wednesday as he defended his policies and electability. The 77-year-old independent said he would work with politicians on the other side of the aisle if elected president in 2020. Sanders said he has \"conservative friends that I like and respect\" while expressing his view that President Donald Trump is a danger to the country. Co-host Meghan McCain, daughter of the late Republican Sen. John McCain of Arizona, cut Sanders off. \"Can I hear, any in Congress or the Senate?\" she said. \"I’m generally curious about bipartisanship. Can you name one?\" Sanders named Johnny Isakson, the Georgia Republican senator who recently announced his retirement due to health reasons. As Meghan McCain noted Isakson would be vacating his seat, Sanders continued by touting his relationship with John McCain. \"But they're dead,\" McCain started to say. \"Johnny is not dead,\" Sanders shot back. More:Meghan McCain says there will be 'a lot of violence' if assault weapons are banned Isakson's announcement that he will step down at the end of this year came in the middle of his term. He was diagnosed with Parkinson's Disease, a degenerative nervous system disorder, in 2013. Meghan McCain pressed Sanders to name a Republican currently in office that he can work with to achieve bipartisanship. Sanders finally named Sen. Lamar Alexander of Tennessee: \"Lamar is not a liar, Lamar is not a sexist, he's not a racist, he's not a homophobe. He's a conservative guy. It's called American politics.\" During Sanders' appearance on the daytime talk show, he was also pressed by co-host Whoopi Goldberg to address how he will deal with income inequality. She asked if he will change that, as she said candidate and entrepreneur Andrew Yang had pledged to do on a previous episode of the show. Sanders said, \"Of course I'll change it,\" Sanders said. \"Well, how do I know this?\" Goldberg replied. \"Because I've been talking about it for 25 years,\" Sanders said, seemingly frustrated. Sanders also talked about his ability to defeat the current president in the 2020 election should he win the Democratic nomination, disagreeing with the idea that only a moderate Democratic candidate could take on Trump. \"I think the agenda that I am bringing forth is the most progressive agenda ever brought forth by any candidate —serious candidate⁠—running for president of the United States,\" Sanders said.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Biden says he raised $15M in third quarter, lagging Sanders and Buttigieg",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/10/03/joe-biden-fundraising-comes-behind-bernie-sanders-pete-buttigieg/3858737002/",
      "subtitle": "Biden says he raised $15M in third quarter, lagging Sanders and Buttigieg",
      "author": "null",
      "content": "WASHINGTON — Joe Biden raised $15.2 million for his presidential campaign over the last three months. The sum places him well ahead of many lower-tier candidates in the Democratic primary. But it’s a middling amount for one of the top-polling candidates in the Democratic primary and lags behind what Bernie Sanders raised by more than $10 million. Biden’s campaign announced his haul Thursday after the former vice president unexpectedly announced it during a fundraiser in Palo Alto, California. He has raised $36.7 million since entering the race in April. More:Joe Biden answers Donald Trump during campaign event in Nevada: 'I'm not going anywhere' Pete Buttigieg, the mayor of South Bend, Indiana, also bested Biden during the third fundraising quarter, announcing this week that he raised $19.1 million. California Sen. Kamala Harris raised $11.6 million. Elizabeth Warren is the only top-tier contender who has not yet announced her fundraising figures. With Iowa's caucuses looming in February, a sense of urgency is growing among the candidates as the primary contest turns into a fierce battle for a limited pool of cash. President Donald Trump and the Republican National Committee, meanwhile, have a huge cash advantage. They announced Tuesday that they collectively raised $125 million for Trump’s reelection. That has heightened Democratic anxiety that a protracted primary could hurt the party’s chances of quickly picking a nominee and rallying the cash needed to fight Trump.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Phase out nuclear power? Elizabeth Warren and Bernie Sanders locked in absurd arms race",
      "url": "https://www.usatoday.com/story/opinion/2019/09/11/no-nuclear-power-elizabeth-warren-bernie-sanders-absurd-editorials-debates/2234071001/",
      "subtitle": "Phase out nuclear power? Elizabeth Warren and Bernie Sanders locked in absurd arms race",
      "author": "null",
      "content": "Democrats, to their credit, are the one major party that cares about climate change. But it can be frustrating to watch as their presidential hopefuls get behind nonbinding policy papers or go wobbly on the hard decisions. Perhaps nothing shows the lack of seriousness more than the candidates who play the anti-nuclear card even while claiming to be sincere about global warming. Sen. Bernie Sanders of Vermont has a climate plan that calls nuclear energy a “false solution” and says it should be phased out by an unspecified date. Massachusetts Sen. Elizabeth Warren’s plan is mum on the issue. But, locked in a kind of arms race of impracticalities with Sanders, Warren said at a recent CNN town hall on climate change that nuclear should be phased out by 2035. GREEN AMERICA:Nuclear power is too costly and too risky With 10 Democratic candidates set to square off in another debate Thursday night, more bad-mouthing of nuclear is possible in an appeal to progressives who have trouble distinguishing between atomic bombs and atomic energy. Nuclear is an important part of the puzzle in weaning the nation’s power grid off fossil fuels. At the very least, it needs to retain its place. And if a new generation of smaller and simpler reactors can be developed, an expansion of nuclear's role should be considered. Nuclear is America’s third largest electricity source, behind natural gas and coal. It accounts for nearly 20% of our power. If it were eliminated, wind and solar would have to be more than doubled just to make up for its loss — while making no progress in cutting carbon emissions. What’s more, wind and solar, while ideal in many respects, have shortcomings: Solar is regional and seasonal. Most of its production is in the Sun Belt and drops off precipitously in winter. Wind can disappear for days at a time. Both need backup sources that can rise when they fall and fall when they rise. At present, the only power sources with this flexibility are fossil fuels. Wind and solar, which collectively account for about 8% of the U.S. power supply, can and should be greatly increased. Given their limitations, however, they are not going to produce the bulk of our power any time soon. Hydropower could pick up some of the slack, yet we don't hear a hue and cry to build more dams. Which brings us back to to nuclear. While it does have the vice of the radioactive waste it produces and the potential for catastrophic meltdowns, it is not without its virtues. In addition to not emitting any carbon, nuclear (along with hydro) produces a lot of power at night because it can’t be easily turned off. This means that people who live in areas powered by nuclear or hydro who buy electric cars can charge them at night with zero-emissions power. The record on getting rid of nuclear power has been disastrous. After the 2011 disaster at the Fukushima plant in Japan, Germany decided to get rid of its plants. It has shut down eight and vows to close nine that remain. While Germany, to its credit, is ahead of the USA on renewables, the plant closures make the nation more reliant on coal. The first rule of dealing with any problem is to not make it worse. The second is to think broadly and creatively about all of the solutions that are available. Nuclear power comes into play in both. If you can't see this reader poll, please refresh your page.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders bashes Joe Biden, embraces Trump supporter during Nevada campaign stop",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/09/14/bernie-sanders-trump-supporter-embrace-carson-city-nevada-stop/2325879001/",
      "subtitle": "Bernie Sanders bashes Joe Biden, embraces Trump supporter during Nevada campaign stop",
      "author": "James DeHaven",
      "content": "Bernie Sanders took aim at Democratic presidential front-runner Joe Biden on Friday, telling a Carson City, Nevada, audience that the former vice president had distorted Sanders’ Medicare for All proposal during Thursday’s nationally televised debate. Sanders, a two-time presidential contender, said he was dispirited by the on-stage exchange at Texas Southern University, where Biden attacked Sanders’ single payer health plan as too costly. Sanders went on to deride what he saw as Biden’s willingness to “parrot” the health insurance industry’s talking points. “Apparently the Vice President thinks its just wonderful for people to be paying thousands of dollars per month in premiums and paying the highest prices in the world for prescription drugs,” Sanders said in front of a crowd of around 300 supporters gathered for a town hall at the Carson City Community Center. “Well, I think those are problems.” Sanders spent much of the rest of the event listening to audience members who had struggled with the skyrocketing cost of health care, including a recently laid off Trump supporter. Castro-Biden feud:Why Julian Castro's attack on Joe Biden's age fell flat at Democratic debate Bill Herron, 56, told Sanders he lost his insurance along with his job at PepBoys. He wondered what the longtime independent senator from Vermont could do to help him and others facing a lapse in health care coverage. The exchange started combatively, with Sanders and Herron shouting over each other about the state of the health care system. But it ended with the pair locked in a half-hug, as Sanders asked Herron to help him take on entrenched corporate health care interests. “Work with me to tell the drug companies and the insurance companies that the function of health care is to provide quality care to all of these people,” Sanders said, using a free hand to gesture to a crowd that was already giving him a standing ovation. Biden and Castro:Biden campaign calls Julian Castro's attack a 'cheap shot' as both campaign off Democratic debate feud The moment stood out as a highlight for many in the audience, including Darren Jenkins, a Sanders supporter from Carson City. “I love Bernie, he’s going to be the next president of the United States,” Jenkins said. “Look at the way he had that Trump supporter come up. He put his arm around him and talked to him, with kindness and love.” Sanders adopted a sharper tone for his second stop, a “College For All” rally on the campus of the University of Nevada–Reno. The Houston debate:5 things we learned from the 2020 Democratic debate in Houston The 77-year-old self-described Democratic Socialist opened with a typically passionate rebuke aimed at the nation’s top 1% of income earners, quickly revving up a crowd of hundreds of students gathered on the lawn in front of UNR’s Mathewson-IGT Knowledge Center. He later won loud applause for his pledges to cancel student debt, make college tuition free and end the war on drugs. His plan to create a universal pre-kindergarten program received a similarly warm welcome, as did each mention of Sanders’ activist-endorsed, $16 trillion climate change prevention plan. Overall, Sanders’ latest appearance at UNR was less eventful than his previous stop on campus, when the progressive firebrand called out a small handful of pro-Trump supporters perched atop a nearby parking garage. The former mayor of Burlington, Vermont, is now polling about six percentage points behind front-runner and former Vice President Joe Biden among likely Nevada caucusgoers. Can Democrats win Texas?:Houston debate put Lone Star politics at the forefront Sanders won Washoe County’s contentious 2016 Democratic presidential caucus before dropping the statewide vote to ex-Secretary of State Hillary Clinton, who ended up carrying Nevada in the general election. He has a pair of stops scheduled in Las Vegas on Saturday, including another campus appearance to discuss Latinx issues at the University of Nevada, Las Vegas. James DeHaven is the politics reporter for the Reno Gazette Journal. He covers campaigns, the Nevada Legislature and everything in between. Support his work by subscribing to RGJ.com right here.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Amy Klobuchar hits hard against Bernie Sanders' Medicare for All plan at 3rd Dem debate",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/09/12/democratic-debate-klobuchar-slams-sanders-medicare-all-plan/2306601001/",
      "subtitle": "Amy Klobuchar hits hard against Bernie Sanders' Medicare for All plan at 3rd Dem debate",
      "author": "John Fritze",
      "content": "Sen. Amy Klobuchar, D-Minn., came out swinging against the progressive plan to provide government health insurance for all Americans – and what has become a campaign mantra for Sen. Bernie Sanders, I-Vt. “While Bernie wrote the bill, I read the bill,” Klobuchar fired at Sanders, arguing that the plan would remove millions of Americans off their private health insurance. \"And on page eight – on page eight of the bill it says that we will no longer have private insurance as we know it.\" “I don’t think that’s a bold idea, I think it’s a bad idea,” she continued. The line was a response to Sanders' oft-repeated line that he \"wrote the damn bill\" that would move to a Medicare-for-All health insurance system. Health care, and the fight over whether to make adjustments to Obamacare or to scrap it for additional government coverage, has dominated the opening moments of virtually every Democratic primary debate this year – and it has widely split the field. Klobuchar has said she wants to build on the Affordable Care Act, and does not support the Medicare for All plan. She favors a universal health care system that would include a public option, but not mandate it. More:Donald Trump says he's only going to watch highlights of the Democratic debate",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders: Trump weather map incident shows 'authoritarian' impulses",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/09/10/bernie-sanders-responds-to-president-trumps-sharpie-on-dorian-map/2273268001/",
      "subtitle": "Bernie Sanders: Trump weather map incident shows 'authoritarian' impulses",
      "author": "Nick Coltrain",
      "content": "CEDAR RAPIDS, Ia. — President Donald Trump showing a scribbled-on hurricane path on an official weather service map is “ludicrous and outrageous,\" but also a sign of “moving the country in an authoritarian direction,” Sen. Bernie Sanders said in an interview with the Des Moines Register. Sanders, who is seeking the Democratic nomination for president, was in Ames, Iowa, for the first of three rallies at each of Iowa’s public universities when he first mentioned the incident. Chuckles initially rippled through the crowd, but Sanders didn't linger like it was a punchline. Instead, it's an example of Trump bending nonpolitical entities to his whims, Sanders said. “It's one thing for a president to draw a line on a map, that's totally absurd,” the Vermont senator said in the interview. “But then to have the appropriate agency kind of back him up, that speaks to the authoritarian type of government that Trump is moving us to.\" Trump tweeted on Sept. 1 that Hurricane Dorian was set to reach as far as Alabama when it made landfall. Forecasts at that point showed the storm moving sharply north, avoiding Alabama. What happened last week:Trump doubles down on debunked Alabama comments about Dorian's path The tweet spurred an immediate response from the Birmingham, Alabama, office of the National Weather Service saying Alabama wouldn't feel Dorian's effects. It led to a multi-day spat where Trump refused to give ground and presented an altered weather service forecast map to bolster his position. On Wednesday, Trump showed reporters in the White House a map that projected the storm’s path with white lines. A black marker was reportedly used to extend its path into Alabama. Forecasters did not predict the storm would hit Alabama when Trump tweeted his initial warning or when the map was presented. On Friday, the National Oceanic and Atmospheric Administration, which oversees the National Weather Service, issued an unattributed statement backing up Trump and disavowing the tweet from Birmingham, Alabama. The local agency spoke “in absolute terms that were inconsistent” with the probabilities outlined in forecasts, the statement reads. “This is how much of a pathological liar he is,” Sanders told a crowd of about 500 at Iowa State University on Sunday. “Did you all see his famous black Sharpie?” Chuckles rippled through the crowd, but Sanders did not pause for laughter. “What was really scary about that, he got the appropriate agency, the NOAA, to change their views in order to correspond with his,” Sanders continued. “And that's what authoritarianism is about. You do what the guy on top wants, not what the facts are about.\" Sanders went further in an interview with the Register Monday. Regardless of your politics, he said, people should not want “a president who is moving this country forward into an authoritarian direction and who is, in fact, a pathological liar.\" “The function of the agency (at) hand is to give the American people accurate and important information on weather, storms and hurricanes, and not simply say what the president of the United States said is right,” Sanders said. “So both of those factors, concerning what the president did, was ludicrous and outrageous. But it is even more frightening that we have an agency of government whose job is to provide incredibly important information to the American people backing up the president even when he's dead wrong.\" Nick Coltrain is a politics and data reporter for the Register. Reach him at ncoltrain@registermedia.com or at 515-284-8361.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Trump pokes fun at Sanders' baseball video after heart attack: Not 'a lot of bat head speed'",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/10/11/trump-sanders-heart-attack/3949636002/",
      "subtitle": "Trump pokes fun at Sanders' baseball video after heart attack: Not 'a lot of bat head speed'",
      "author": "Savannah Behrmann",
      "content": "WASHINGTON – During a rally in Lake Charles, Louisiana, Friday night, President Donald Trump commented on the recent health scare of Senator Bernie Sanders, who is running for the Democratic nomination and recovering after having a heart attack. “Looks like Bernie lost his chance, huh?” Trump said, drawing up some reaction from the audience. “Bernie was hitting a baseball today to show how strong he was,” referencing a video the Senator posted yesterday, \"It just wasn't a lot of bat head speed.\" “Bernie... get better fast,” the President said on Friday, continuing, “That’s the only time I’ve ever said anything good about him.” Sanders was released from the hospital last week after doctors said he had a heart attack, and his campaign announced that doctors inserted two stents after he felt chest discomfort during a campaign event in Las Vegas. He has taken some time off of campaigning, but recently stated that “We're going to get back into the groove of a very vigorous campaign, I love doing rallies and I love doing town meetings.” Sanders, at 78 years-old, is the oldest person running for president in 2020. Former Vice President Joe Biden is 76 and President Donald Trump is 73. Sen. Elizabeth Warren is 70. Sanders, who ran for president in 2016, has been consistently among the top three Democratic contenders. He currently stands in third place in national polling, according to a Real Clear Politics' averaging of major polls. Commenting on his campaign's response to the heart attack, Sanders said, \"You know, this is not a baseball game. So I think we acted absolutely appropriately.\"",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "October Democratic debate: Will Sanders attend? What are the issues? Here are 4 things you need to know",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/10/15/election-2020-four-things-you-need-know-october-debate/3977424002/",
      "subtitle": "October Democratic debate: Will Sanders attend? What are the issues? Here are 4 things you need to know",
      "author": "Savannah Behrmann",
      "content": "WASHINGTON – The candidates vying for the Democratic nomination will face off Tuesday night during the party’s October primary debate on the biggest stage yet. Having 12 candidates appearing on one stage together makes Tuesday’s debate the biggest presidential primary debate in recorded political history, The New York Times reports. Here are four questions answered about Tuesday's democratic debate: This will be the Democratic National Committee's fourth debate. It will be held at Otterbein University in Westerville, Ohio, by CNN and The New York Times, airing live at 8 p.m. EST. Viewers can watch the debate on CNN, CNN International, CNN en Español, and it can be streamed through both CNN’s and the New York Times' websites. It will additionally be available across mobile devices via CNN and The New York Timess apps for iOS and Android, via CNNgo apps for Apple TV, Roku, Amazon Fire, Chromecast and Android TV; SiriusXM Channels 116, 454, 795, the Westwood One Radio Network and National Public Radio. CNN's Erin Burnett and Anderson Cooper and the New York Times' Marc Lacey will moderate. Opinion:Age, health and impeachment: What to watch for in this week's Democratic debate The following candidates will appear on stage together in this order: More:Democratic debate No. 4: What you need to know More:How do Democrats win in 2020? These battleground state leaders have some advice. The stage placement represents how candidates are polling. It has become a three-way race leading into the October match-up as Biden, Warren, and Sanders are consistently polling in the top three, and they will be center stage for the second debate in a row. Gabbard and Steyer are additions to this stage from the September debate, where 10 candidates faced off. Gabbard also said Monday that she does plan to attend the debate after she had previously considered boycotting what she claimed was \"a serious threat to our democracy\" by the Democratic National Committee and the media. Sanders is also planning on appearing after canceling several campaign events following a heart attack and procedure a few weeks ago. The senator had two stents inserted, but recently said that he's \"going to get back into the groove of a very vigorous campaign.\" Democratic debate:Democratic debate: Who were the winners and losers This will be the first time the top democratic candidates have been together on one stage since the impeachment inquiry against President Donald Trump was announced in late September by House Speaker Nancy Pelosi, and that subject could dominate some of the discussion as every candidate has now supported the inquiry. This comes at the same time Steyer will be looking to make waves during his first appearance on the debate stage, and he has been making the case for impeachment for years. It may also add pressure to Biden, who has been a consistent front-runner for the nomination, as the inquiry puts his family at the center of the investigation into the president's dealings with Ukraine. The candidates may also address Trump's decision to pull back U.S. forces from northern Syria. This move potentially enables a resurgence of the Islamic State as Turkey prepares a military assault against Kurdish fighters who helped the U.S. battle the Islamic State. The president faces widespread backlash for \"abandoning\" a U.S. ally. Other topics that could dominate the night include gun control and safety, immigration, LGBTQ rights and health care. More:Democratic debate: Time for 2020 presidential candidates to get real on health care For October, candidates needed to reach 2% in at least four recognized polls and receive donations from at least 130,000 individuals. And despite this being the largest primary debate, there are still a few candidates who will not be gracing the stage. These include: The DNC recently released more difficult requirements candidates must meet to qualify for the November debates, setting up the possibility that several additional candidates may miss the stage compared to the October match-up, potentially ending some campaigns. Contributing: Nicholas Wu, Jeanine Santucci, William Cummings, Aamer Madhani",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Sanders: It's 'nonsense' to suggest his campaign was hiding his heart attack",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/10/09/bernie-sanders-its-nonsense-he-hid-heart-attack/3923551002/",
      "subtitle": "Sanders: It's 'nonsense' to suggest his campaign was hiding his heart attack",
      "author": "Rebecca Morin",
      "content": "WASHINGTON – Presidential candidate and Sen. Bernie Sanders said Wednesday that it's \"nonsense\" to think his campaign was trying to hide the fact he had a heart attack last week. During his first sit-down interview since leaving a Nevada hospital Friday, Sanders swatted back claims that his campaign was concealing the medical issue. \"That's nonsense,\" he told NBC News. \"I don't know what people think campaigns are, you know we're dealing with all kinds of doctors and we wanted to have a sense of what the hell was going on really.\" Sanders said he believes his campaign \"acted absolutely appropriately.\" \"The first thing that we're trying to do is understand what's going on and not run to the New York Times and have to report every 15 minutes,\" he said. \"You know, this is not a baseball game. So I think we acted absolutely appropriately.\" Sanders' campaign last Wednesday announced that doctors found the Vermont Senator had blockage in one artery and two stents were inserted after he felt chest discomfort during a campaign event in Las Vegas. More:Bernie Sanders will not participate in LGBTQ town hall after heart attack It wasn't until Friday that Sanders' campaign officially noted he'd had a heart attack. Arturo E. Marchand Jr. and Arun Guraraj, Sanders' treating physicians, said in a statement that the senator was “diagnosed with a myocardial infarction” at another facility before being transferred to Desert Springs Hospital Medical Center. A myocardial infarction is the medical term for a heart attack. Sanders at 78 years old is the oldest person running for president in 2020. Former Vice President Joe Biden is 76 and President Donald Trump is 73. Sen. Elizabeth Warren is 71. More:4 decades separate 2020's presidential candidates. Here's what that looks like. More:Sanders says heart attack won't hurt campaign According to NBC News, Sanders also said he \"misspoke\" when he said Tuesday that he would \"change the nature\" of his campaign post-heart attack. \"I misspoke the other day, I said a word I should not have said and media drives me a little bit nuts to make a big deal about it,\" Sanders said. \"We're going to get back into the groove of a very vigorous campaign, I love doing rallies and I love doing town meetings.” Contributing: Savannah Behrmann",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Elizabeth Warren leads Iowa Poll for the first time, besting Joe Biden and Bernie Sanders",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/09/21/election-2020-elizabeth-warren-narrowly-leading-joe-biden-in-iowa-poll/2407045001/",
      "subtitle": "Elizabeth Warren leads Iowa Poll for the first time, besting Joe Biden and Bernie Sanders",
      "author": "Brianne Pfannenstiel",
      "content": "DES MOINES — Elizabeth Warren has surged in Iowa, narrowly overtaking Joe Biden and distancing herself from fellow progressive Bernie Sanders, the latest Des Moines Register/CNN/Mediacom Iowa Poll shows. Warren, the U.S. senator from Massachusetts, now holds a 2-percentage-point lead, with 22% of likely Democratic caucusgoers saying she is their first choice for president. It is the first time she has led in the Register’s poll. Former Vice President Biden, who had led each of the Register’s three previous 2020 cycle polls, follows her at 20%. Sanders, the U.S. senator from Vermont, has fallen to third place with 11%. The list:Who is running for president in 2020? An interactive guide No other candidate reaches double digits. “This is the first major shakeup” in what had been a fairly steady race, said J. Ann Selzer, president of Selzer & Co., which conducted the poll. “It’s the first time we’ve had someone other than Joe Biden at the top of the leader board.” South Bend, Indiana, Mayor Pete Buttigieg follows the three leaders as the favorite of 9% of poll respondents. U.S. Sen. Kamala Harris of California is at 6%. U.S. Sens. Amy Klobuchar of Minnesota and Cory Booker of New Jersey are at 3%. Polling at 2% are U.S. Rep. Tulsi Gabbard of Hawaii, former U.S. Rep. Beto O’Rourke of Texas, businessman Tom Steyer and entrepreneur Andrew Yang. Eight others are polling at 1% or less. But the race is far from settled: Just one in five likely Democratic caucusgoers say their minds are made up, while 63% say they could still be persuaded to support a different candidate. “The data in this poll seem to suggest the field is narrowing, but my sense is there’s still opportunity aplenty,” Selzer said. “The leaders aren’t all that strong. The universe is not locked in.” The poll of 602 likely Democratic caucusgoers was conducted Sept. 14-18, and the margin of error is plus or minus 4 percentage points. Other candidates have seen their Iowa Poll numbers briefly spike — O’Rourke hit double digits early after running in a competitive U.S. Senate race in Texas, then fell back. Buttigieg surged after a well-received CNN town hall performance, then drops in the new poll. But no one in Iowa so far this cycle has seen Warren's steady and sustained momentum. The Register’s first 2020 caucus poll, in December 2018, pegged Warren's support at 8%. In March, about two months after she first visited the state and formally announced she would run, that rose to 9%. In June, as Iowa Democrats began to marvel at her organizational strength, she rose to 15% — though that poll’s methodology differed somewhat from the others. Today, the universe of people who say they are considering Warren in some way — 71% of likely Democratic caucusgoers — is larger than it is for any other candidate. That includes 22% who say she is their first choice for president, 20% who say she is their second choice and another 29% who say they are actively considering her. Trailing her are: Biden (60%), Buttigieg (55%), Harris (55%), Sanders (50%), Booker (42%), O’Rourke (38%) and Klobuchar (37%). It’s also higher than where Warren was polling in June. Then, 61% of respondents were considering her in some way. “That appears to be a powerful leap forward and suggests that she can improve further, because she’s got these people actively considering her and thinking of her as a second choice,” Selzer said. “She’s got a huge number there. Those people can be converted.” Warren is the best-liked candidate in the field: 75% of likely Democratic caucusgoers say they view her favorably. Next-best are Buttigieg, who is viewed favorably by 69%, and Biden, at 66%. But Selzer said Warren’s numbers also reveal some vulnerability. Among those who say she is their first choice for president, only 12% say their minds are made up, while 88% say they could be persuaded to support another candidate. More Biden supporters are firm in their choice: 26% say their mind is mind up, with 70% saying they could be persuaded. Biden and Sanders — who have held first and second place, respectively, since last December — have hit new lows, though they still outshine 16 other candidates. Their numbers aren’t bad, Selzer said, but the downward trend line is troubling. Overall, the former vice president has slipped in each of the four Iowa Polls the Register has conducted this caucus cycle — in terms of both support and favorability. In December 2018, 32% of likely Democratic caucusgoers said Biden was their first choice for president. That’s fallen in each poll as Biden reintroduces himself to Iowans — and as his competitors have targeted him as the polling front-runner. Biden’s favorability rating also has fallen — 82% of likely Democratic caucusgoers had a favorable view of him in December, compared with 66% today. His unfavorable numbers have nearly doubled in that time from 15% to 29%. Even among those who say Biden is their first choice for president, they’re less enthusiastic than are supporters of other candidates. Twenty-eight percent of all poll respondents describe their feelings toward their first-choice candidate as “extremely enthusiastic.” But 32% of Warren supporters say they are “extremely enthusiastic” about their choice, compared with 22% of Biden supporters. Biden supporters are more likely to describe themselves as “mildly enthusiastic” (31%) than are Warren supporters (11%). Biden does best with older caucusgoers, winning the support of 35% of those 65 and older. That demographic makes up about a quarter of likely caucusgoers, and Biden is their top choice, with an almost 3-to-1 lead over Warren. But he struggles with young people. Just 9% of those younger than 35 say he is their first choice for president. Warren leads that demographic, at 27%. Sanders, too, has hit a new low among those younger than 35, falling from a high of 25% in March — just after he announced he would run. He dropped to 16% in June and is at 11% today. Part of Sanders’ problem: Warren has eaten into some of his key constituencies. Among those who say they caucused for Sanders in 2016, 25% say they will do so again. Thirty-two percent say they will support Warren instead, and 12% opt for Buttigieg. Katie Naset, a 37-year-old poll respondent and Clive resident, said she caucused for Sanders in 2016 because he advanced a far-left agenda focused on issues such as “Medicare for All,” student loan debt relief and affordable child care. “I aligned more closely with him than Hillary Clinton on those issues,” the family law attorney said. “But at this point, Elizabeth Warren best approximates with where I am on these issues. She has bold, realistic ideas. They’re backed with a lot of research and deliberate thought.” Naset is among the 20% of likely Democratic caucusgoers who describe themselves as “very liberal.” Of that group, 48% back Warren and 20% support Sanders. Sanders ties Warren among first-time caucusgoers at 22%, and he's second to her in generating support among young people. Twenty-two percent of those younger than 35 say Sanders is their first choice for president, trailing Warren by 5 percentage points. Iowa’s likely Democratic caucusgoers say that nominating a candidate who has a strong chance of beating President Donald Trump is more important than nominating someone who shares their positions on major issues. Sixty-three percent say defeating Trump is more important, and 31% say it’s more important to find someone who aligns with them on the issues. Six percent are unsure. But what does electability look like to likely Democratic caucusgoers? Asked which of two phrases better fits their definition of the more electable candidate, 74% choose a candidate who can excite new voters and get them to show up, compared to 16% who say it's someone who excites the Democratic base. Sixty-three percent say a candidate who takes positions seeking to find common ground with Republicans is more electable than someone who takes positions moving the country to the left (28%). Fifty-seven percent say a candidate who represents a new generation of leadership is more electable than someone who has a long history of serving in government (28%). And when it comes to dealing with Trump, 54% say the candidate who will “take the high road” is more electable than someone who will “get in the mud as needed” to take him on (35%). “It’s very hard not to get down in the mud with him. He just kind of brings that out in people,” said J’Andrea Gibney, an 83-year-old poll respondent and Maynard resident. “But you’ve got to take the high road — you can’t be on his level or you’re no better than he is.” Gibney is among the 59% of likely caucusogers who believe government will return to the way it was if Trump is removed from office in 2020. Majorities of every demographic group agree. But 30% say they believe Trump’s presidency has permanently changed the way American government works. Three candidates are polling at 1%: Montana Gov. Steve Bullock, former U.S. housing secretary Julián Castro and former U.S. Rep. John Delaney of Maryland. Two candidates — author and activist Marianne Williamson and U.S. Sen. Michael Bennet of Colorado — are polling at 0%, when accounting for rounding. Three candidates had not a single person name them as their first choice for president: New York City Mayor Bill de Blasio, who ended his campaign Friday, after polling had concluded; U.S. Rep. Tim Ryan of Ohio; and former U.S. Rep. Joe Sestak of Pennsylvania. Not a single person named de Blasio as either their first or second choice for president in three rounds of Register polling. “This is what lack of traction looks like in absolute terms,” Selzer said of de Blasio’s numbers. Among those candidates polling at 1% or below, Castro has the largest universe of people who are considering him in some capacity: 1% say he is their first choice, another 1% say he is their second choice and 20% say they are actively considering him, for a total of 22%. But as he's become better known (71% can now rate their feelings toward him compared to 47% who could do so in June), Castro's unfavorability rating has nearly tripled. It's risen from 13% in June to 36% today. The data also suggest that Castro's performance in the Democratic debate earlier this month did him no favors with Iowa Democratic caucusgoers. On the Texas debate stage, Castro appeared to attack Biden's age, asking repeatedly whether the vice president had forgotten what he had said minutes earlier. Fifty-four percent of those who say they watched all of that debate view Castro unfavorably. He is viewed unfavorably by 23% of those who watched none of it. Delaney is the only other lower-polling candidate to crack double digits when looking at the full universe of people considering him in some way. However, that number has shrunk to 10% from 18% since June. “Most of them have come to Iowa at least once — some of them many times,” Selzer said. “They’ve hired staff. They’ve made an investment. And if you’ve got people who are getting numbers above 50% and you’re not getting 10%, you have to either really up your game or consider the alternative.” But the caucus field typically doesn’t crystallize until very late, and there is still opportunity for momentum, she said. The top three candidates — Warren, Biden and Sanders — account for just over half of first-choice votes, totaling 53%. There are now 15 candidates vying for 47% of the remaining electorate. “Those votes could start to coalesce around one of the also-rans and quite easily pop another candidate into double-digits as a contender,” Selzer said. Des Moines Register reporters Kim Norvell and Katie Akin contributed to this report. Brianne Pfannenstiel is Chief Politics Reporter for the Register. Reach her at bpfann@dmreg.com or 515-284-8244. Follow her on Twitter at @brianneDMR. The Iowa Poll, conducted September 14-18, 2019, for The Des Moines Register, CNN and Mediacom by Selzer & Co. of Des Moines, is based on telephone interviews with 602 registered voters in Iowa who say they will definitely or probably attend the 2020 Democratic caucuses. Interviewers with Quantel Research contacted 3,510 randomly selected active voters from the Iowa secretary of state’s voter registration list by telephone. The sample was supplemented with additional phone number lookups. Interviews were administered in English. Responses for all contacts were adjusted by age, sex and congressional district to reflect their proportions among active voters in the list. Questions based on the sample of 602 voters likely to attend the 2020 Iowa Democratic caucuses have a maximum margin of error of plus or minus 4.0 percentage points. This means that if this survey were repeated using the same questions and the same methodology, 19 times out of 20, the findings would not vary from the true population value by more than plus or minus 4.0 percentage points. Results based on smaller samples of respondents — such as by gender or age — have a larger margin of error. Republishing the copyright Iowa Poll without credit to The Des Moines Register, CNN, and Mediacom is prohibited.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Joe Biden accidentally refers to Bernie Sanders as 'president'",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/09/12/democratic-debate-biden-accidentally-says-bernie-sanders-president/2306659001/",
      "subtitle": "Joe Biden accidentally refers to Bernie Sanders as 'president'",
      "author": "Nicholas Wu",
      "content": "While debating Sen. Bernie Sanders, I-Vt., former Vice President Joe Biden accidentally referred to the senator as \"president\" rather than a senator. \"If you notice, nobody's yet said how much it's going to cost the taxpayer. I hear this, large savings, the president thinks – my friend from Vermont thinks that the employer is going to give you back if you negotiate,\" said Biden, referring to projections of reduced costs in Medicare for All plans. Biden continued his attack on Sanders by calling him a \"socialist.\" \"For a socialist, you've got a lot more confidence in corporate America than I do,\" Biden quipped. The former vice president has staked out a position closer to the center on the Democratic Party's current debate over the future of its health care policy that is based on strengthening Obamacare, a position that has drawn fire from other candidates that have rolled out more progressive health care plans.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "'SNL': Maya Rudolph's cool Kamala Harris faces off against Larry David's Bernie Sanders",
      "url": "https://www.usatoday.com/story/entertainment/tv/2019/09/28/saturday-night-live-maya-rudolph-bernie-sanders/3811101002/",
      "subtitle": "'SNL': Maya Rudolph's cool Kamala Harris faces off against Larry David's Bernie Sanders",
      "author": "Erin Jensen",
      "content": "Season 45 of \"Saturday Night Live\" saw a star-studded premiere. In addition to Alec Baldwin reprising his role as President Donald Trump, Democratic candidates were also impersonated by famous faces. Maya Rudolph, an \"SNL\" alum, portrayed Sen. Kamala Harris, and Larry David once again embodied Bernie Sanders for the Impeachment Town Hall. Rudolph's Harris, who at one point slipped on shades and sipped on a frozen drink, described herself as a \"smooth talkin' lady lawyer\" and a \"walkin,' talkin' TNT show\" who is \"America's cool aunt. A fun aunt, I call that a 'funt.' \" What kind of funt, no one asked? \"The kind of funt that will give you weed but then arrest you for having weed.\" 'SNL' premiere:Alec Baldwin returns as Trump concerned about impeachment; 'Kanye' ends friendship More:Aidy Bryant can't help but break after 'Saturday Night Live' sketch hiccup during premiere Meanwhile, David's Sanders declared his technological incompetence: \"It takes me 40 minutes to figure out how to turn on the TV. ... If I accidentally hit 'input,' that's a whole day. \"Sometimes, I sit on the porch and do literally nothing for six hours,\" he added. In his closing words, \"Sanders\" offered: \"America, here is my promise to you: Free college, free health care, free refills on any medium-size soft drink.\" Shane Gillis jokes about 'SNL' firing, Asians and 'funny' Trump assassination at NYC show Leslie Jones breaks silence on leaving 'Saturday Night Live,' teases 'amazing projects'",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders says he admires Trump's hair — and that's about it",
      "url": "https://www.usatoday.com/story/news/politics/2019/09/22/bernie-sanders-says-what-he-admires-president-donald-trump/2412240001/",
      "subtitle": "Bernie Sanders says he admires Trump's hair — and that's about it",
      "author": "Nick Coltrain",
      "content": "U.S. Sen. Bernie Sanders didn't quite play along when a student asked him Sunday to name one thing he admired about President Donald Trump. A Drake University student told Sanders, of Vermont, he wanted to smooth political divisiveness with the question. He was part of a youth forum sponsored by the Des Moines Register and Des Moines Public Schools. Sanders took a few steps, and, smile across his face, mimed getting punched in the gut. After a moment, Sanders, who long has sported snow white hair, joked that he likes the color of the president’s locks. Getting serious, Sanders told the student he might not like what he says next. While he has some Republican colleagues in the Senate he respects and likes, the party has moved far to the conservative right since the days of President Dwight D. Eisenhower, he said. The current Republican president, however, is a racist, a sexist, a bigot and other pejoratives, Sanders said, a common line on his campaign stops. “You have to speak that out,” Sanders told the crowd. “And I have to do everything I can to take that kind of behavior on.” Pressed on the question by a moderator, and Sanders took another swing at an answer. “He gets up at 3 o’clock in the morning to tweet,” Sanders told the crowd. “I’m impressed by people who get up at 3 o’clock in the morning.” Nick Coltrain is a politics and data reporter for the Register. Reach him at ncoltrain@registermedia.com or at 515-284-8361. Your subscription makes work like this possible. Subscribe today at DesMoinesRegister.com/Deal.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "'The halls of Congress are no joke': AOC reflects on Congress as she endorses Sanders",
      "url": "https://www.usatoday.com/story/news/politics/2019/10/19/aoc-bernie-sanders-endorsement/4038312002/",
      "subtitle": "'The halls of Congress are no joke': AOC reflects on Congress as she endorses Sanders",
      "author": "Nicholas Wu",
      "content": "On Saturday afternoon, Rep. Alexandria Ocasio-Cortez, D-N.Y., made her endorsement of Sen. Bernie Sanders, I-Vt., official at a rally in Queens, N.Y., that marked Sanders' return to the campaign trail after recently having a heart attack. \"I'm in the United States Congress now,\" said Ocasio-Cortez as she gave a 20-minute speech introducing Sanders, \"a long, long way from being a sexually harassed waitress in downtown Manhattan one year ago.\" \"The halls of Congress are no joke,\" she continued. \"It is no joke. Standing up to corporate power, and established interests is no joke. It's not just about standing up and saying these things, but behind closed doors, your arm is twisted, the vise pressure of political pressure gets put on you, every trick in the book, psychological, and otherwise is to get us to abandon the working class,\" she said before a massive crowd. More:AOC to endorse Bernie Sanders in 2020 Democratic presidential primary More:Alexandria Ocasio-Cortez told Bernie Sanders about her endorsement while he was still in the hospital More:'I'm feeling great': Bernie Sanders reassured voters of his health following heart attack Ocasio-Cortez said that the pressure she'd felt in Congress led her to \"appreciate the enormous, consistent, and non-stop advocacy\" of Sanders. The 30-year-old New York Democrat has served as a lightning rod in Congress and a frequent target of criticism on the right as one of the most outspoken House Democrats. She has attracted much more attention than a freshman member of Congress might otherwise receive, becoming an outspoken voice on high-profile issues like student debt, D.C. statehood, and climate change. Sanders said during his speech that he planned to campaign with Ocasio-Cortez, ensuring that Ocasio-Cortez will continue to have a high-profile role in the presidential campaign. President Donald Trump has frequently criticized her, and retweeted a post from the Republican Party Twitter this afternoon that criticized Ocasio-Cortez and Rep. Ilhan Omar, D-Minn., as \"far-left Democrats\" who wanted to \"spend taxpayer dollars & have the government take control over every aspect of American life.\" Ocasio-Cortez seems aware of the criticism and often responds sharply. Last week, she was the subject of a story in the conservative Washington Times that had criticized her for the cost of her hairstyle. \"They’re just mad we look good doing it,\" she had said on Twitter of her conservative critics, adding the hair flip emoji. More:'They’re just mad we look good doing it': AOC responds to story about the price of her hairstyle She addressed the issue in her speech today as well. \"You all like my haircut. It got a lot of attention last week,\" she joked at the beginning of her speech.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders heart scare: Democrats on campaign trail & House leadership may be too old",
      "url": "https://www.usatoday.com/story/opinion/2019/10/02/bernie-sanders-heart-surgery-stent-artery-blockage-trump-impeachment-column/3814602002/",
      "subtitle": "Bernie Sanders heart scare: Democrats on campaign trail & House leadership may be too old",
      "author": "null",
      "content": "With Sen. Bernie Sanders' heart scare, age is a rising concern among Democrats whose top presidential candidates are among the oldest in history, including Sanders, 78, former Vice President Joe Biden, 76, and Sen. Elizabeth Warren, 70. As an impeachment investigation in Congress heats up, age could become a factor there, too. Seniority in Congress for Democrats has always been a mixed blessing. When majorities switch or committee chairs are defeated or die, the next person in line in terms of length of service on the committee automatically steps in to take the gavel. Interestingly, the Republicans abandoned the practice in the mid-1990s, when incoming Speaker of the House Newt Gingrich experienced a revelation: Many of those Republicans who had been waiting patiently for a chairmanship since the GOP last held the House in 1954 were in an advanced state of decrepitude. Gingrich shunted them aside for younger and more combative Republicans and then replaced seniority with six-year term limits. The Democrats, having decided to retain the seniority rule, now confront President Donald Trump with many of their major committee chairs in their 70s and 80s. These very senior Democrats are not showing well against the administration and its backers. It is a problem not easily solved. The problem was illustrated recently when former Trump campaign chair Corey Lewandowski appeared before the House Judiciary Committee. A natural performer in the Trump style, Lewandowski, 46, danced circles around Committee Chairman Jerrold Nadler, 72, who appeared at times befuddled and gob-smacked. A photo of Nadler made him appear to be fighting off a migraine. It took Rep. Hakeem Jeffries, 49, chairman of the Democratic Caucus, to warn the president’s former campaign chief that he was out of line. But the double-edged sword of seniority cuts across a number of the most important panels. Not irrelevant:You don't have to be 37 like Pete Buttigieg, but age should matter in the 2020 campaign One of the few universally recognized powers of Congress that can be used to rein in an out-of-control president is the power of the purse. Article I, section 9 of the Constitution is explicit in stating that no money can spent except pursuant to a congressional appropriation, yet Trump has been able to redirect money designated for certain military projects and disaster relief to the construction of the wall on the border with Mexico that has proved no barrier to tens of thousands of asylum seekers. But the “repurposing” of taxpayer money is only one of the areas in which the power of the purse has proved a rubber sword in the hands of Congress. Rescinding money appropriated for the operation of Cabinet departments is a tool that can be used on high officials who are acting improperly. The House Appropriations Committee headed by Rep. Nita Lowey, 82, could lower that boom on Attorney General William Barr, who has acted more like the president’s consigliere than the peoples’ counsel. Barr needs to have his personal office account slashed. He can do very well without his private dining room at the Justice Department. Let him use Uber instead of an armored SUV to get to his bagpipe recitals. But the Appropriations Committee seems to have no stomach for the fight. It might be age and the inertia of doing things as they have always been done. The age issue in the House has mostly focused on Speaker Nancy Pelosi, 79, but it runs far deeper. Rep. Richard Neal, chairman of the powerful Ways and Means Committee, is 70. Rep. Maxine Waters, chair of the Financial Services Committee, is 81. Foreign Affairs Chairman Eliot Engel is 72 and should be inquiring into President Trump’s strong-arming the president of Ukraine to produce political dirt on former Vice President Joe Biden. Julian Castro is no ageist:He's just practicing presidential politics while Hispanic Mere age, of course, is no sure marker for inability to do a job, and accumulated knowledge based on longtime tenure on a committee is invaluable. Senior members are the committees’ organizational memory. They have stored in their brains the schematic of all of the outside players within the committee’s jurisdiction. They know who lobbies them and who contributes to the members’ campaigns. But as the performance of special counsel Robert Mueller and Rep. Nadler’s behavior appeared to reveal, endurance and mental acuity in older men and women can be problematic. However, the solution adopted by the GOP has created a totally new set of problems by inducing GOP chairs who are term-limited to retire instead of having to step back into the back benches. Now, the Democrats have the House majority, and it is their job to hold the administration’s feet to the fire. There is considerable doubt that they are capable of living up to the moment. Ross K. Baker is a distinguished professor of political science at Rutgers University and a member of USA TODAY's Board of Contributors. Follow him on Twitter @Rosbake1",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "2020 White House hopeful Bernie Sanders hospitalized after suffering chest pains",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/10/02/bernie-sanders-hospitalized-after-suffering-chest-pains/3840418002/",
      "subtitle": "2020 White House hopeful Bernie Sanders hospitalized after suffering chest pains",
      "author": "Aamer Madhani",
      "content": "Democratic presidential hopeful Bernie Sanders had a heart procedure after suffering chest discomfort during a campaign event Tuesday evening in Las Vegas, a top campaign aide confirmed Wednesday. “Following medical evaluation and testing, he was found to have a blockage in one artery and two stents were successfully inserted. Sen. Sanders is conversing and in good spirits,” senior campaign adviser Jeff Weaver said. \"He will be resting up over the next few days. We are canceling his events and appearances until further notice, and we will continue to provide appropriate updates.” Sanders, 78, later wrote on Twitter that he was \"feeling good\" and that his medical episode underscored the need for Medicare for All, his signature policy proposal that would lead to a massive expansion of the government backed health-care system while doing away with private insurance. \"I'm fortunate to have good health care and great doctors and nurses helping me to recover,\" Sanders added. \"None of us know when a medical emergency might affect us. And no one should fear going bankrupt if it occurs. Medicare for All!\" The Vermont senator is among the top contenders vying for the 2020 Democratic nomination. He trails former Vice President Joe Biden and Sen. Elizabeth Warren in the polls. Sanders has kept a breakneck campaign schedule since entering the race in February and has been a prolific fundraiser. He announced this week that he had collected $25.3 million from small donors – the largest quarter for any Democratic candidate this year. The Democratic socialist has boasted that most of his campaign war chest comes from small donors. The heart problem led to the postponement of a $1.3 million television advertising buy in Iowa this week, said the campaign's Midwest spokesman, Bill Neidhardt. Sanders had been scheduled to take part in a gun safety forum in Las Vegas on Wednesday and campaign in California in the coming days. President Donald Trump's reelection campaign and Sanders' Democratic presidential rivals took to social media to wish the Vermont senator a speedy recovery. Tim Murtaugh, the Trump campaign's communication director, said his team sent Sanders \"our prayers and wish him a speedy recovery.\" Biden tweeted: \"Anyone who knows Bernie understands what a force he is. We are confident that he will have a full and speedy recovery and look forward to seeing him on the trail soon.\" Warren said, \"Bruce, Team Warren, and I are sending all our best wishes for a speedy recovery to@BernieSanders. I hope to see my friend back on the campaign trail very soon.\" \"Thinking of @BernieSanders today and wishing him a speedy recovery,\" Sen. Kamala Harris, another 2020 Democratic contender, tweeted. \"If there's one thing I know about him, he's a fighter and I look forward to seeing him on the campaign trail soon.\" The Vermont senator is one of four septuagenarians battling for the White House in 2020. Does age matter? Trump vs. Biden in Iowa: Septuagenarian rivals try to demonstrate vigor in head-to-head stops Trump is 73, Biden is 76 and Warren is 70. The age of the contenders has been mostly a backburner issue in the campaign. Forty-six percent of voters planning to attend Iowa’s Democratic caucuses said it would be a disadvantage for a candidate to be older than 70, and 50% said it would make no difference, according to a Des Moines Register/CNN/Mediacom poll published in June. Three percent said they were unsure, and 1% said it would be an advantage. The stent procedure comes at a moment when Sanders – despite maintaining a strong fundraising haul – had found his candidacy in a “slow-moving decline” as fellow progressive candidate Warren has moved up in the polls, said Daniel Schlozman, a political scientist at Johns Hopkins University. In his unsuccessful 2016 run for the Democratic nomination, Sanders found success in his head-to-head competition consolidating a range of opposition among Democratic primary voters to former Secretary of State Hillary Clinton and those on the left who questioned the centrist trajectory of the party. But in a crowded field – there are still 19 major Democratic candidates vying for the nomination – Sanders has had more difficulty making headway with voters. He stands in third place in national polling, according to a Real Clear Politics' averaging of major polls. Sanders also sits in third place in polling of three of the first four caucus and primary states. “As of yesterday, Sanders faced strategic challenges in a multi-candidate race, where he faced a closely (ideologically) aligned and fast-rising candidate in Elizabeth Warren,” Schlozman said. “Those challenges haven’t disappeared, and now there is a new concern on top of them. \"How he thinks his way through the issues of age and health is another difficult issue for a campaign that was already facing a ceiling as far as we could see unless something pretty substantial happened to shake the field out.” Contributing: Nick Coltrain in Des Moines",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders released from the hospital after having heart attack earlier in the week",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/10/04/bernie-sanders-released-hospital-after-heart-attack/3869887002/",
      "subtitle": "Bernie Sanders released from the hospital after having heart attack earlier in the week",
      "author": "Savannah Behrmann",
      "content": "WASHINGTON — Sen. Bernie Sanders was released from the hospital Friday evening after doctors say he had a heart attack earlier in the week. The 2020 presidential hopeful felt chest discomfort during a campaign event in Las Vegas Tuesday. He had a blockage in one artery and two stents were inserted, his campaign said earlier this week. Sanders' treating physicians Arturo E. Marchand Jr and Arun Guraraj released a statement via the campaign Friday saying that Sanders was “diagnosed with a myocardial infarction” at another facility before being transferred to Desert Springs Hospital Medical Center. A myocardial infarction is the medical term for a heart attack. “After two and a half days in the hospital, I feel great, and after taking a short time off, I look forward to getting back to work,” Sanders, 78, said in a statement Friday. The doctors said Sanders’ “hospital course was uneventful with good expected progress.” The Vermont Senator will participate in the upcoming Democratic primary debate, his campaign confirmed to USA TODAY Thursday. He had previously cancelled planned campaign events, as well as a planned television ad buy in Iowa. Sanders, who ran for president in 2016, has been consistently among the top three Democratic contenders. He currently stands in third place in national polling, according to a Real Clear Politics' averaging of major polls. Contributing: Aamer Madhani",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Following heart attack, Bernie Sanders plans return to 'very vigorous campaign,' but no Iowa plans yet",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/10/10/bernie-sanders-iowa-campaign-continues-heart-attack-health-scare/3928574002/",
      "subtitle": "Following heart attack, Bernie Sanders plans return to 'very vigorous campaign,' but no Iowa plans yet",
      "author": "Nick Coltrain",
      "content": "DES MOINES — Sen. Bernie Sanders canceled several planned Iowa events to recover from a heart attack, but his Iowa campaign staff are moving forward with or without him on the stump. Sanders, who was hospitalized the night of Oct. 1 to have two stents inserted to clear blockages in his heart, has no current plans to return to Iowa. His only public event scheduled now is Tuesday's televised debate in Ohio. Tuesday evening, he told reporters assembled outside of his home in Burlington, Vermont, that he's going to \"change the nature of the campaign a bit, and make sure I have the strength to do what I need to do.\" The Democratic presidential candidate told NBC News on Wednesday he plans to \"get back into the groove of a very vigorous campaign,\" albeit one where \"I want to start off slower and build up and build up and build up.\" What that means for Sanders' Iowa campaign strategy wasn't immediately clear. Sanders canceled one Iowa swing immediately after he was hospitalized and a second appearance at an Iowa labor forum, planned for Oct. 13. Sanders is slated to participate in a Des Moines forum on issues important to Latino voters on Oct. 24, but his campaign staff couldn't confirm if that would happen. Before his heart attack, when Sanders would campaign through Iowa, he'd pack his schedule with town halls, forums and rallies. At the end of September, his most recent visit, he held 11 public events over four days, starting in Des Moines before moving from north-central Iowa down to its southeast corner. During those four days, he also included two events in Oklahoma. The heart attack led the campaign to delay a $1.3 million ad buy on Iowa TV markets. The two-week buy launched Tuesday, four days after it initially planned to air, campaign spokesperson Bill Neidhardt said. The Iowa campaign hasn't stopped, however. In early October, the campaign's national co-chair, U.S. Rep. Ro Khanna of California, traveled across Iowa as volunteers canvassed neighborhoods and worked phonebanks. \"We began this campaign with the intent to win Iowa, and we continue to intend to win Iowa,\" Neidhardt said. Iowa tends to see fewer presidential candidates in the days leading up to televised Democratic debates, so Sanders' absence does not stand out as much as it would during other stretches. The Des Moines Register's candidate event tracker showed a bare schedule wrapping up October among all candidates. Sanders, so far, has held the most public events in Iowa among the top-polling candidates. Among candidates with more than 1% support in the latest Des Moines Register/CNN/Mediacom Iowa Poll, only U.S. Sen. Amy Klobuchar, who has held 85 events, has had more Iowa stops than Sanders. Sanders has held 76 Iowa events this cycle. But campaigns tend to come to Iowa more frequently in the fall and winter leading up to the February caucuses. U.S. Sen. Kamala Harris in particular has said she plans to focus on the first-in-the-nation nominating contest to prove her mettle as a candidate. She was in Iowa the first weekend of October and will be back next weekend. Sam Roecker, a Democratic strategist and consultant, said Sanders' absence from the campaign trail likely won't hurt him as much as it would a lesser-known candidate. But Sanders will need to keep his name in the national conversation and pivot focus away from concerns of his health and fitness for the job. \"It's up in the air,\" Roecker said. \"We're still at that point where people haven't made up their mind on who they're going to caucus for.\" But Sanders' health scare has not dissuaded his most fervent supporters. Alyssa Rooney, a 25-year-old social worker in Waterloo, has supported Sanders since the 2016 race. She points to his demanding schedule, routine of walks and basketball, and general vigor during campaign stops as evidence of overall physical fitness. \"People have health issues all the time,\" Rooney said in an interview. \"Young people have health issues. For me, I read that he had this health scare but he was OK. For me, that was the end of it. It happened, but he can move on from it. \"I still believe he's the best person for the job.\"",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Trump trails Biden, Warren, Sanders, Harris, Buttigieg by double-digit margins in new poll",
      "url": "https://www.usatoday.com/story/news/politics/2019/11/05/trump-trails-leading-democrats-2020-poll/4163164002/",
      "subtitle": "Trump trails Biden, Warren, Sanders, Harris, Buttigieg by double-digit margins in new poll",
      "author": "William Cummings",
      "content": "WASHINGTON – President Donald Trump loses in a hypothetical matchup with all the leading candidates for the 2020 Democratic presidential nomination, according to a Washington Post-ABC News poll released Tuesday. Trump – who has a job approval rating 20 percentage points lower than his disapproval rating of 58% – trails by sizable margins against former Vice President Joe Biden (56%-39%); Sen. Elizabeth Warren of Massachusetts (54%-39%); Sen. Bernie Sanders of Vermont (56%-39%); South Bend, Indiana, Mayor Pete Buttigieg (52%-41%); and Sen. Kamala Harris of California (52%-41%). Each of those Democratic candidates performed well against Trump in a Post-ABC poll Sept. 5, and all of them expanded those leads in this week's survey. Experts said a national poll more than a year away from the general election is not necessarily the best predictor of Trump's reelection chances. Morgan State University journalism professor Jason Johnson said on MSNBC's \"Morning Joe\" that the poll was an outlier relative to other surveys that have looked at head-to-head matchups and that \"the real numbers that are the best indicators of what will happen in 2020\" won't start coming out until after the holiday season. 'I have the real polls':Trump calls Fox News polls 'lousy' after survey finds 49% support impeachment \"The top four or five candidates probably do lead Trump, and they probably do lead the president in a lot of swing states,\" Johnson said. \"But I don't think anyone in our current political environment is going to beat the incumbent president by 10, 12 points.\" MSNBC analyst John Heilemann said there \"literally is almost nothing more meaningless right now than head-to-head polls that are national more than a year out from the election.\" \"It's a terrible mistake for Democrats to look at these national numbers and get overconfident,\" he said, pointing to how competitive the race is in the battleground states that will determine who wins in the Electoral College. A recent poll from The New York Times and Siena College found Trump narrowly leading Warren and Sanders among likely voters in most of the tossup states that will be critical to the election outcome. Out of the six states in the poll, Trump led Biden only in North Carolina, but he was within the margin of error in Michigan, Pennsylvania, Wisconsin, Florida and Arizona. More:Biden leads Trump in battleground states, but Warren does not, poll finds According to the Post-ABC poll, most Americans share negative opinions of Trump in a number of areas. Sixty-three percent say they don't think the president is \"honest and trustworthy,\" 62% say he lacks presidential temperament, 60% say he does not understand their problems, 55% say he is not good at making political deals and 54% say he is not a strong leader. Fifty-four percent say the United States is less respected around the world as a result of the Trump administration's policies. Half of Americans say Trump uses the office of the presidency to boost profits at his hotels and golf courses, and 46% say that is unacceptable. Forty-nine percent favor impeaching Trump and removing him from office, and 47% are opposed. In contrast, Post-ABC polls found support for President Bill Clinton's impeachment at 27% to 41% in 1998. Trump is accused of using the power of the presidency to pressure Ukraine into investigating Biden and of using his personal attorney Rudy Giuliani to help apply that pressure. Sixty percent of respondents say it was inappropriate for Trump to involve Giuliani in U.S. foreign policy, and 55% say Trump did something wrong – though 8% say they don't think it was a serious matter. Slightly more than two-thirds of Republican-leaning voters want to see Trump as their party's nominee in 2020, and 30% say they would prefer someone else. The 2020 candidates:Who is running for president? An interactive guide Biden leads the Democratic field with 27%, followed by Warren at 21%, Sanders at 19% and Buttigieg at 7%. Harris is tied at 2% with Sen. Cory Booker of New Jersey, former Housing and Urban Development Secretary Julián Castro, Rep. Tulsi Gabbard of Hawaii and entrepreneur Andrew Yang. When asked who has the best chance of beating Trump in November, 42% of Democratic-leaning voters say Biden, 17% say Warren and 16% say Sanders. The poll was conducted Oct. 27-30 using a random sample of 1,003 adults, and it has a margin of error of plus or minus 3.5%. USA TODAY/Suffolk Poll:Biden's lead over Warren narrows in a turbulent Democratic field Poll:Iowa caucuses are 'up for grabs' as Pete Buttigieg surges into top tier",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders will attend October debate after heart procedure",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/10/03/democratic-debate-bernie-sanders-attend-october-debate-after-heart-procedure/3854262002/",
      "subtitle": "Bernie Sanders will attend October debate after heart procedure",
      "author": "Rebecca Morin",
      "content": "WASHINGTON – After canceling several campaign events following a heart procedure, Sen. Bernie Sanders will participate in the upcoming Democratic primary debate, his campaign confirmed to USA TODAY Thursday. Sanders, 78, had two stents inserted earlier this week after doctors found blockage in one artery. His campaign said Wednesday that he experienced chest discomfort during a campaign event Tuesday evening in Las Vegas. The debate will be held on Oct. 15 at Otterbein University in Westerville, Ohio. CNN and The New York Times will be hosting the debate, which will air live at 8 p.m. ET. Sanders' wife, Jane, in a statement Thursday said the Vermont Senator's doctors \"are pleased with his progress, and there has been no need for any additional procedures.\" More:2020 White House hopeful Bernie Sanders hospitalized after suffering chest pains \"Bernie is up and about,\" she said in the statement. \"Yesterday, he spent much of the day talking with staff about policies, cracking jokes with the nurses and doctors, and speaking with his family on the phone.\" The senator will likely be discharged before the end of the weekend and will be heading back to Burlington where he will take a few days to rest, the statement said. Jane Sanders said her husband is \"ready to get back out there and is looking forward to the October debate.” Sanders, who ran for president in 2016, has been consistently among the top three Democratic contenders. He currently stands in third place in national polling, according to a Real Clear Politics' averaging of major polls. Contributing: Aamer Madhani",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders: Billionaires shouldn't exist. Mark Zuckerberg doesn't disagree",
      "url": "https://www.usatoday.com/story/money/2019/10/04/mark-zuckerberg-weighs-bernie-sanders-attack-billionaires/3869852002/",
      "subtitle": "Bernie Sanders: Billionaires shouldn't exist. Mark Zuckerberg doesn't disagree",
      "author": "Joel Shannon",
      "content": "When a software engineer employed by Facebook asked billionaire Mark Zuckerberg to comment on Democratic presidential candidate Sen. Bernie Sanders' position that billionaires should not exist, fellow employees began to laugh. Facebook CEO and co-founder Zuckerberg also chuckled after a moment's pause. Those in attendance at Thursday's live-streamed town hall-style internal meeting began supportively to applaud. \"It's a good question ... All right,\" Zuckerberg said. In the answer that followed, Zuckerberg – who, with a net worth of $67 billion, is listed by Forbes as the fourth wealthiest American – said he was sympathetic to Sanders' views on income inequality. \"I understand where he's coming from,\" he said, noting he couldn't put a threshold on how much wealth is too much. \"At some level, no one deserves to have that much money.\" He went on to say he sees potential advantages to some Americans' ability to accumulate even \"unreasonable\" amounts of wealth, too. Forbes 400:Jeff Bezos, Bill Gates and Warren Buffett remain the richest people in the US Facebook encryption:Here's why the government doesn't want Facebook to encrypt your messages He cited his own philanthropic pledges as an example: Zuckerberg and wife Dr. Priscilla Chan have pledged to give away 99% of their Facebook shares in their lifetime. Zuckerberg said that while critics might argue billionaires' charitable gifts would benefit the nation more as tax dollars, he says his philanthropy is funding scientific research projects that would likely be ignored by the government. \"I think the alternative would be the government chooses all of the funding for all of the stuff,\" he commented. \"Part of what makes progress happen is people taking different approaches to different things,\" he went on to say. The exchange happened at a weekly \"internal Q&A\" that was publicly live-streamed on Zuckerberg's Facebook page. Usually the sessions are only for employees but a previous Q&A session made headlines this week when Zuckerberg was heard saying in leaked audio that he would \"go to the mat\" to fight efforts aimed at breaking up the social networking giant. That sparked a response from another Democratic presidential hopeful: Sen. Elizabeth Warren, who defended her plan to break up big tech companies. Zuckerberg was asked Thursday about Warren's plans and responded: \"Let's try not to antagonize her further.\" On Friday, Warren tweeted a video clip of the question and the start of Zuckerberg's response. \"If Facebook finds my scrutiny uncomfortable, here's what Mark Zuckerberg and his team could work on,\" Warren tweeted, listing protecting consumers' privacy, ensuring Facebook \"isn’t undermining our election security\" and ending \"his company's illegal anticompetitive practices.\" Contributing: Kelly Tyko, Jessica Guynn, Brett Molina",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders: A look at his political career",
      "url": "https://www.usatoday.com/picture-gallery/news/politics/2015/04/28/bernie-sanders-a-look-at-his-political-career/21342217/",
      "subtitle": "Bernie Sanders: A look at his political career",
      "author": "null",
      "content": "",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders will not participate in LGBTQ town hall after heart attack",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/10/07/bernie-sanders-wont-attend-cnn-lgbtq-town-hall-after-heart-attack/3903074002/",
      "subtitle": "Bernie Sanders will not participate in LGBTQ town hall after heart attack",
      "author": "Savannah Behrmann",
      "content": "Clarification: A quote texted to USA TODAY about Bernie Sanders pulling out of the town hall was misattributed to the campaign. The story has been updated to remove the erroneous quote. WASHINGTON — After suffering a heart attack last week, Vermont senator and 2020 Democratic hopeful Bernie Sanders will no longer be participating in a televised LGBTQ town hall on Thursday, according to CNN. The 2020 presidential hopeful felt chest discomfort during a campaign event in Las Vegas last week and had a blockage in one artery. Two stents were inserted, his campaign said last week, and he was released from Desert Springs Hospital Medical Center on Friday. His doctors said Sanders’ “hospital course was uneventful with good expected progress.” Sanders, 78, was seen walking about his neighborhood in Burlington, Vermont, with his wife, Jane, Monday, and told reporters he'd be back on the campaign trail \"soon.\" He said on Sunday that he was “glad to be home in Burlington to rest for a little bit” and is “recovering well and feeling much better.” Sanders will participate in the upcoming Democratic primary debate, his campaign confirmed to USA TODAY last week. But he has cancelled some other campaign events since his heart attack. CNN and LGBTQ advocacy group the Human Rights Campaign announced at the end of CNN's 7-hour forum on climate change that they would be partnering to host the Thursday town hall. The event focused on LGBT issues comes after Trump administration policies that have banned transgender Americans from serving in the military, prohibited embassies from flying rainbow flags during Pride Month and rolled back certain Obama-era nondiscrimination protections. Sanders, an independent who ran for the Democratic nomination for president in 2016, has been consistently among the top three Democratic contenders in the large field. He currently stands in third place in national polling, according to a Real Clear Politics' averaging of major polls. The Vermont senator’s health scare has brought age to the forefront of the 2020 race. Sanders is the oldest person running for President. The other top democratic contenders are also the oldest. Former Vice President Joe Biden follows Sanders at 76, and Massachusetts Senator Elizabeth Warren is 70. President Donald Trump is also 73 years old. Contributing: Jeanine Santucci and Aamer Madhani.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders' daughter-in-law dies at 46 after cancer diagnosis",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/10/09/bernie-sanders-daughter-law-raine-riggs-dies/3917146002/",
      "subtitle": "Bernie Sanders' daughter-in-law dies at 46 after cancer diagnosis",
      "author": "null",
      "content": "The daughter-in-law of Democratic presidential candidate Bernie Sanders has died, shortly after being diagnosed with cancer. Rainè Riggs was 46. The Lee & Martin Funeral Home in Burgettstown, Pennsylvania, says Riggs died Saturday, the day Sanders returned to Vermont after suffering a heart attack. Her obituary said she was diagnosed with neuroendocrine cancer. Riggs, a neuropsychologist, was married to Levi Sanders, who ran unsuccessfully for a New Hampshire congressional seat in 2018. Riggs' obituary says she met Levi Sanders while the two worked at an emergency food shelter in Vermont. The obituary said Riggs was the director of behavioral medicine at Dartmouth Medical School for several years, and she started the Palliative Care Department for Dartmouth Medical Center. She also owned Riggs Geriatric Psychology in Windsor, Vermont. Riggs and Sanders had three children.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez told Bernie Sanders about her endorsement while he was still in the hospital",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/10/16/aoc-ilhan-omar-told-bernie-sanders-endorsements-after-heart-attack/4003249002/",
      "subtitle": "Alexandria Ocasio-Cortez told Bernie Sanders about her endorsement while he was still in the hospital",
      "author": "Jeanine Santucci",
      "content": "News that Rep. Alexandria Ocasio-Cortez, a progressive icon, would be endorsing Sen. Bernie Sanders for president came as he took the stage alongside his 2020 rivals and showed he was still in the game after a health scare. But Sanders got the news from the New York representative herself as he was still recovering in the hospital from a heart attack earlier this month, according to a new report. Sanders' campaign manager, Faiz Shakir, told Politico he answered the phone that day and passed it over to Sanders, who was in his hospital bed. \"Think about the courage of this person who says, ‘You know, I know what you just went through but I have so much trust and confidence in you that you are the one who will fight the fight that I believe in. I'm with you,' \" Shakir said. Minnesota's Ilhan Omar, another freshman Democrat in Congress who announced her support of Sanders Tuesday night, also told the senator about her decision after his heart attack, according to Politico. Sanders said during Tuesday's debate that a \"special guest\" would be joining him at a rally this weekend, and it was later confirmed the guest would be Ocasio-Cortez and that she would make her endorsement then. In response to a question about his heart attack and recovery at the debate, the 78-year-old said, \"I’m healthy, I’m feeling great.\" Sanders had canceled several campaign events after his surgery. He released a video in which he said being in a Las Vegas hospital “made me feel even more strongly the need for us to continue our efforts to end this dysfunctional and cruel health care system.” 'I'm feeling great':Bernie Sanders reassured voters of his health following heart attack He also said in an NBC interview, \"We're going to get back into the groove of a very vigorous campaign, I love doing rallies and I love doing town meetings.” Sanders is currently trailing former Vice President Joe Biden, 76, and Massachusetts Sen. Elizabeth Warren, 70, according to a rolling average of national polls by RealClearPolitics. The three frontrunners are the oldest Democrats in the race. President Donald Trump is 73 years old. Candidates' ages:4 decades separate 2020's presidential candidates. Here's what that looks like. Contributing: Nicholas Wu, Courtney Subramanian, Rebecca Morin",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "'I'm feeling great': Bernie Sanders reassured voters of his health following heart attack",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/10/15/democratic-debate-bernie-sanders-reassured-voters-his-health/3993614002/",
      "subtitle": "'I'm feeling great': Bernie Sanders reassured voters of his health following heart attack",
      "author": "Courtney Subramanian",
      "content": "When pressed about whether he’s “up to the stress” of the presidency after suffering a heart attack earlier this month, Sen. Bernie Sanders responded, “I’m healthy. I’m feeling great.” The 78-year-old canceled several campaign events after undergoing surgery, releasing a video in which he said lying in a Las Vegas hospital “made me feel even more strongly the need for us to continue our efforts to end this dysfunctional and cruel health care system.” Tuesday Democratic debate served as a return to the campaign trail for Sanders. But as the Vermont senator seeks to turn his heart attack into a conversation about Medicare for All, the scare has renewed questions about whether his age will affect his stamina in the race and in the White House should he win in 2020. A Huffpo/YouGov poll released Monday found that voters age 65 and older are more likely (61%) than voters age 18 to 29 (51%) to question a candidate’s physical health. Sanders said he’s reassuring Americans about his fitness by “mounting a vigorous campaign” across the country and he plugged a rally in Queens he is planning on Saturday. The Vermont senator also drew cheers after he thanked his supporters and those who sent prayers and well wishes for his recovery. More:Beto O'Rourke defends plan to confiscate assault-style weapons The same question was put to another septuagenarian – Joe Biden, who would be 78 if elected to office. “One of the reasons I’m running is because of my age and my experience – with it comes wisdom,” Biden said.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders is big Democratic debate winner, and only partly due to his performance",
      "url": "https://www.usatoday.com/story/opinion/2019/10/16/alexandria-ocasio-cortez-bernie-sanders-democratic-debate-column/3990254002/",
      "subtitle": "Bernie Sanders is big Democratic debate winner, and only partly due to his performance",
      "author": "null",
      "content": "All 12 leading Democratic candidates for president got a chance to demonstrate why they were able to meet the requirements to pack on the stage for the fourth debate Tuesday. Sen. Elizabeth Warren of Massachusetts stayed feisty and focused in her new role as front-runner. Former Vice President Joe Biden was optimistic and self-congratulatory as he tried to win the John McCain name-dropping contest. Rep. Tulsi Gabbard of Hawaii confounded everyone by spreading the blame for the slaughter of the Kurds in northern Syria that Donald Trump invited to members of “both parties.” And Andrew Yang got to say lots of things as if no one had ever thought of them before. But the winner of the night was older than the two youngest candidates on stage — Gabbard, 38, and South Bend, Indiana, Mayor Pete Buttigieg, 37 — combined. Vermont Sen. Bernie Sanders, 78, returned to the campaign trail after recovering from a heart attack to deliver his strongest debate performance of the campaign. He was lively, funny and persuasive. At one point, he even seemed to convince billionaire Tom Steyer that billionaires shouldn’t exist. Sanders also took on Biden’s constant praise of bipartisanship and his pointed boast, “I'm the only one on this stage that has gotten anything really big done.” “Joe, you talked about working with Republicans and getting things done,” Sanders said. “But you know what you also got done — and I say this as a good friend — you got the disastrous war in Iraq done. You got a bankruptcy bill, which is hurting middle-class families all over this country. You got trade agreements like NAFTA and PNTR (permanent normal trade relations) with China done, which have cost us 4 million jobs. Now, let's get to 'Medicare for All.' ... If we stood together, we could create the greatest health care system in the world.” A conservative's take:Winners and losers in the Democratic debate from columnist Glenn Harlan Reynolds But Bernie’s biggest moment of the night didn’t happen onstage. In the closing minutes of the debate, news broke that one of the brightest young stars on America’s left, Rep. Alexandria Ocasio-Cortez of New York, will endorse the 2016 Democratic primary runner-up this weekend. This gives the democratic socialist from Vermont the chance to break the momentum of Warren’s steady rise in the polls, though he notably hasn’t taken a shot at the senator from Massachusetts on the debate stage yet. Instead, he sided with her several times as she was cornered, echoing her arguments for systemic change. The format of the debate flowed much better than the previous three. It’s unclear whether this was because the moderators allowed the candidates more air to answer and rebut each other, or because self-help guru Marianne Williamson wasn’t on the stage. Whatever it is, they should do more of it. While there are still miles to go before anyone actually votes for a nominee, the race for the chance to oppose Trump will likely remain a tossup among Sanders, Warren and Biden. This is mostly because the rest of the candidates have done a better job of canceling each other out than breaking through. While the debates have led to some blips in the polls — most notably for Sen. Kamala Harris of California after the second debate — the crowded stage format has the effect of blurring candidates together, especially since every debate seems to rehash the same Medicare for All contentions over and over until even Sanders seems a little bored by the fray. Another huge winner of the night was impeachment, which is now polling 50%. Every candidate on stage backs the inquiry in the House, and no candidate showed any willingness to echo the attacks on Hunter Biden that Trump pressured Ukrainian President Volodymyr Zelensky into trumping up. Unfortunately, the biggest loser of the night was human civilization. While there was a question about Ellen DeGeneres’ defense of her kindness to former president and torture purveyor George W. Bush, there wasn’t one question about climate change. Future generations will have to be satisfied knowing that we were much too busy worrying about rich people getting along in luxury boxes to stop the planet from boiling. Jason Sattler, a writer based in Ann Arbor, Michigan, is a member of USA TODAY’s Board of Contributors and host of \"The GOTMFV Show\" podcast. Follow him on Twitter: @LOLGOP",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bloomberg + Sanders + Biden + Trump + Warren = 374. What's wrong with this 2020 picture?",
      "url": "https://www.usatoday.com/story/opinion/2019/11/10/bloomberg-trump-biden-sanders-warren-over-70-too-old-column/2531529001/",
      "subtitle": "Bloomberg + Sanders + Biden + Trump + Warren = 374. What's wrong with this 2020 picture?",
      "author": "null",
      "content": "Hallelujah. In Michael Bloomberg, Democrats have just what they need: another presidential candidate who was alive when Harry Truman occupied the White House. The former New York mayor and billionaire business tycoon is 77. Until Donald Trump's victory in 2016, Americans had never elected a president who was 70 upon entering office. The age of the world's most powerful person is critically important, and most voters acknowledge it. Yet in the 2020 campaign, the issue is largely ignored. Why? Back on Oct. 1, when 78-year-old Bernie Sanders suffered a heart attack, it set off a flurry of worry about aging politicians. But just a couple of weeks later, with the Vermont senator looking robust and his usual frisky self in a three-hour debate, opinion flipped. Sanders, many said, was living proof that age doesn't matter. In truth, neither Sanders' heart incident nor his declaration soon after that \"I am back!\" changed anything about the physical and mental odds facing older candidates. We tend to evaluate politicians' fitness to serve based on the image they present in public. By that measure, Sanders looks vigorous now that he's back on the trail; Sen. Elizabeth Warren, 70, bounds around the stage with pep in her steps; Trump, 73, seems tireless delivering lengthy speeches at campaign rallies; and former Vice President Joe Biden, 76, appears lean and fit. Then again, just a few days before being stricken in Las Vegas, Sanders seemed as healthy as ever. Trump's tan from a bottle might help project an image of physical well-being, but his actions in office have prompted many to question his mental health. Biden has fumbled badly in campaign appearances, placing his cognitive faculties in doubt. Only Warren, youngest of the leading septuagenarians, shows no outward signs of aging, but even she is at a point in life when the odds turn against you. It’s not surprising that Trump supporters aren’t focusing on the president’s age. With impeachment proceedings dominating the news and the White House staff unraveling, age becomes the kind of thing the late George Carlin spoke of in his comedy weather forecast when he said: The radar is picking up Russian ICBMs, so I wouldn't sweat the thundershowers. On the Democratic side, the goal of defeating Trump is so dominant that little else seems to matter. When Pew researchers asked Democratic voters about age, 97% said it would be better to have a presidential candidate younger than 70. Yet, the Real Clear Politics polling average shows about two-thirds of Democratic primary voters supporting candidates 70 or older — Biden, Sanders and Warren. This disconnect might be due to voters’ understanding that people do age differently. They see vibrant public servants like House Speaker Nancy Pelosi, 79, and Supreme Court Justice Ruth Bader Ginsburg, 86, and dismiss concerns about the age of presidential contenders. Uneasy feeling:Joe Biden isn't the boringly reassuring candidate Democrats were hoping for Yet, the science of aging is clear-cut regarding factors that affect a president’s ability to serve. As people grow older, their ability to multitask diminishes, as does their recall of new or recently learned information. Here is one particularly pointed observation from a paper on aging by the noted author Dr. Diane Howieson: “Older adults tend to be slower in conceptualizing problems and less ready to change strategies when circumstances shift.” How would that work in the White House Situation Room? Former President Jimmy Carter, a marvel of clear-headedness at 95, said recently that by the time he reached 80, “I don’t believe I could undertake the duties that I experienced when I was president. For one thing you had to be very flexible with your mind. You had to be able to go from one subject to another and concentrate on each one adequately and then put them all together in a comprehensive way.” Among the things that do improve with age is experience, which is often quantified as “wisdom.” Biden spoke of it in the October debate: “Look, one of the reasons I’m running is because of my age and my experience. With it comes wisdom.” When Sanders was asked about his health and age, he said: “We are going to be mounting a vigorous campaign all over this country.” Same question to Warren and a similar answer: “I will out-work, out-organize and outlast anyone.” Three predictable responses, none of which addressed the reality about aging that concerns Carter. How older candidates look and sound today might be a good indicator of how well they would function tomorrow or next month. But the candidates are seeking a term that would end half a decade from now. Maximum age:I'm the same age as Elizabeth Warren. We 70-somethings have no business being president. Some Democrats would like Biden and Sanders to pledge to only serve one term. A related suggestion is they'd be wise to select a significantly younger running mate, who could step in if needed or move to the top of the ticket after four years. How awful. The process of replacing a president is traumatic for the nation and on the world stage, no matter what the circumstances. And betting that a vice president could move up and win the next election is no sure thing. Carter believes there should be an age limit for presidents, which sounds like a good idea that comes from wisdom gained by experience. Of course, it’s too late for that sort of thing in the 2020 campaign. But there is time, when the primary-season voting begins in February, to thank the older candidates for their service and turn to someone younger. Peter Funt is a writer and host of \"Candid Camera.\"",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders digs at Pete Buttigieg: We need more judges like Ruth Bader Ginsburg, not Anthony Kennedy",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/10/24/bernie-sanders-pete-buttigieg-more-supreme-court-judges-like-rbg-not-kennedy/4088421002/",
      "subtitle": "Bernie Sanders digs at Pete Buttigieg: We need more judges like Ruth Bader Ginsburg, not Anthony Kennedy",
      "author": "Jeanine Santucci",
      "content": "Presidential candidates Sen. Bernie Sanders and South Bend, Indiana, Mayor Pete Buttigieg are clashing on their ideas for the Supreme Court. In an interview with Cosmopolitan, Buttigieg said one of his goals would be to have more justices \"who think for themselves,\" floating former Justice Anthony Kennedy as an example. Kennedy, known as a swing voter in major dividing issues, retired last year, allowing the president to appoint Brett Kavanaugh and establish conservative control of the court. Sanders, however, says he would prefer more liberal judges. \"Interesting, I'd like more justices like Ruth Bader Ginsburg and Sonia Sotomayor,\" Sanders tweeted. Kennedy was a right-of-center justice, appointed by former President Ronald Reagan. Significant to his legacy is the fact that he swung majority votes on the side of certain LGBTQ protections, including same-sex marriage legalization in 2015. Buttigieg, who is the only gay candidate for president, said in the interview that he'd like to \"stop the descent of the Supreme Court into becoming yet another political body.\" \"As you know, it’s especially important for LGBTQ rights, but it’s important for access to abortion and many other issues too,\" Buttigieg said. \"When I look at the Supreme Court, I can’t help but remember that my marriage only exists by the grace of a single vote in that body.\" More:Who's the best known justice on the Supreme Court? Brett Kavanaugh tops Ruth Bader Ginsburg \"This is not about making sure that it agrees with me on everything. My appointments will definitely be people who share my values,\" Buttigieg added. Buttigieg has been campaigning on his plans to restructure the Supreme Court, and says one of his top priorities is to establish a commission with the directive to \"make the Supreme Court less political.\" He has floated the idea of having 15 justices, instead of nine, and implementing term limits. \"Right now, every time there’s a vacancy, there’s this apocalyptic ideological battle and it hurts the court and it hurts the country,\" Buttigieg said. A member of Buttigieg's campaign team, Sean Savett, chimed in on the backlash to Buttigieg's remarks on Twitter. \"To be clear: Pete has consistently said he would appoint Justices to the Supreme Court who share his progressive values. Kennedy was not such a Justice,\" Savett said. Contributing: Richard Wolf",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "AOC to endorse Bernie Sanders in 2020 Democratic presidential primary",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/10/15/democratic-primary-aoc-endorse-bernie-sanders-president/3994047002/",
      "subtitle": "AOC to endorse Bernie Sanders in 2020 Democratic presidential primary",
      "author": "Nicholas Wu",
      "content": "Rep. Alexandria Ocasio-Cortez, D-N.Y., plans to endorse Sen. Bernie Sanders, I-Vt., and appear with him at an event this weekend, The USA TODAY Network has learned. A person with knowledge of the plans confirmed the endorsement. The Washington Post had first reported the planned endorsement. Nina Turner, a former state senator and current Sanders campaign national co-chair, said to The USA TODAY Network that Ocasio-Cortez was returning the favor for the groundwork Sanders' campaign had laid in 2016. \"So the foundation that he laid in 2016 allowed for candidates to stand up and be bold and run their race,\" Turner said. \"This is coming full circle. One person doesn't make or break a campaign, but the level of excitement, it's going to take it to the next level for us.\" Later in the evening, Rep. Ilhan Omar, another member of the group of progressive House freshmen colloquially known as \"the Squad\" announced her endorsement of Sanders. Omar cited Sanders' leadership of a \"working class movement to defeat Donald Trump,\" and his leadership on other major progressive issues – \"And it’s why I believe Bernie Sanders is the best candidate to take on Donald Trump in 2020,\" she said in a release. Sanders had promoted the rally, which will take place in Queens, New York, during the debate, along with the promise of a \"special guest.\" Ocasio-Cortez's district includes part of Queens, though the rally would take place right outside her district. The two also interacted on Twitter during the debate. \"Tax the rich,\" she tweeted, during a debate over income inequality. The Sanders campaign then quoted her tweet with the comment, \"When we are in the White House, that is exactly what we will do.\" The New York congresswoman and liberal firebrand was an organizer for Sanders' 2016 presidential campaign when the senator's insurgent campaign in the Democratic primary caught fire against establishment pick Hillary Clinton. The endorsement by the outspoken progressive could help the Sanders campaign, which has recently lagged in polls amid the rise of Sen. Elizabeth Warren, D-Mass., and questions about Sanders' health after he had a heart attack. Contributing: Ledyard King, USA TODAY; Jessie Balmert, Cincinnati Enquirer",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders says Alexandria Ocasio-Cortez will work in his administration if he's president",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/10/21/bernie-sanders-says-aoc-work-his-white-house/4055445002/",
      "subtitle": "Bernie Sanders says Alexandria Ocasio-Cortez will work in his administration if he's president",
      "author": "Jeanine Santucci",
      "content": "After freshman Rep. Alexandria Ocasio-Cortez officially endorsed Sen. Bernie Sanders for president at a Queens, N.Y. rally on Saturday, the Vermont progressive said he wants Ocasio-Cortez to work in his White House Sanders was asked in a joint interview with CBS News if he would consider Ocasio-Cortez to be his running mate. The congresswoman answered for him as both laughed: \"I think I'm too young for that.\" \"There you go, she's answered,\" Sanders added. But when Ocasio-Cortez was asked if she'd work in Sanders' administration should he be elected president, he interjected with a forceful \"Yes, you would.\" Ocasio-Cortez, the youngest woman ever elected to Congress, said at the rally that the pressure that has been on her since she was elected to office made her \"appreciate the enormous, consistent, and non-stop advocacy\" of Sanders. Sanders' recent health scare was a \"gut check,\" Ocasio-Cortez told CBS. She informed Sanders of her decision to back his campaign while he was still recovering from a heart attack earlier this month. \"Neither me nor the senator cannot do this by ourselves,\" Ocasio-Cortez said. On health scare:Bernie Sanders reassured voters following heart attack Last week's Democratic primary debate was Sanders' return to the campaign trail following his hospitalization, and in response to a question about his heart attack and recovery at the debate, the 78-year-old said, \"I’m healthy. I’m feeling great.\" Sanders canceled several campaign events after his surgery but said that he would continue with a \"vigorous\" campaign. Sanders also has the backing of Minnesota Rep. Ilhan Omar, and she and Ocasio-Cortez have faced some criticism from those who question their choice to support a white man's candidacy. When asked why, as a woman of color, Ocasio-Cortez made that decision, she said, \"I'm actually very excited about this partnership because it shows what we have to do in our country, is that we have to come together across race, across gender, across generation.\" 'It is no joke':Alexandria Ocasio-Cortez reflects on Congress as she endorses Sanders Ocasio-Cortez says she had also spoken to other candidates, including Massachusetts Sen. Elizabeth Warren, ahead of her endorsement. \"I think she's a fabulous candidate. Frankly, Sen. Sanders, Sen. Warren and myself are all on the same team in the party,\" she said. Warren is currently outpacing Sanders in national and early-state polls alongside former Vice President Joe Biden. A USA TODAY/Suffolk University poll found that Sanders is in fourth place behind Biden, Warren and South Bend, Ind. Mayor Pete Buttigieg. USA TODAY/Suffolk poll:Iowa caucuses are 'up for grabs' as Pete Buttigieg surges into top tier Nationally, Sanders is in third place after Biden and Warren, according RealClearPolitics averages.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Trump losing in Georgia to Biden, Warren, Sanders, Buttigieg and Harris, poll finds",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/11/13/poll-trump-trails-democrats-georgia/4180158002/",
      "subtitle": "Trump losing in Georgia to Biden, Warren, Sanders, Buttigieg and Harris, poll finds",
      "author": "William Cummings",
      "content": "WASHINGTON – Several national polls in recent months have shown President Donald Trump trailing or virtually tied in hypothetical matchups with the leading candidates in the Democratic presidential primary. Those polls indicate the president could face an uphill battle in his fight for reelection – though Trump has dismissed them as \"fake. A new poll from The Atlanta-Journal Constitution finds Trump is trailing the five leading Democrats in Georgia, a Republican stronghold where he beat Hillary Clinton by five points. The poll found Trump losing to former Vice President Joe Biden in Georgia by eight percentage points, 51%-43%. He also trailed Sen. Elizabeth Warren of Massachusetts; Sen. Bernie Sanders of Vermont; South Bend, Indiana Mayor Pete Buttigieg and Sen. Kamala Harris of California, though by smaller margins that were within the poll's margin of error. Here was the breakdown: Election 2020:USA TODAY speaks with presidential candidates 2020 candidates:Who is running for president? An interactive guide Georgia is not considered a swing state and has not gone for a Democratic presidential candidate since 1992, though Democrat Stacey Abrams lost to Republican Gov. Brian Kemp last year by less than two percentage points. Trump's job approval in the state was at 44%, which is about where it is in most national polls, and his disapproval rating was at 54%, which is also comparable to his national averages. By contrast, 55% of registered Georgia voters said they were happy with the job Kemp was doing and 35% said they disapproved. Georgia voters were split on whether Trump should be impeached and removed from office, with about 47% in favor and 47% opposed. The poll was conducted from Oct. 30 to Nov. 8 with a margin of error of plus or minus 3%. Poll:Pete Buttigieg shoots to the top of the 2020 field in Iowa 2020:Joe Biden edges ahead of opponents in New Hampshire poll",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Jimmy Carter and Bernie Sanders show age is no obstacle when it comes to serving",
      "url": "https://www.usatoday.com/story/opinion/2019/10/21/bernie-sanders-jimmy-carter-lessons-on-service-into-maturity-column/4046506002/",
      "subtitle": "Jimmy Carter and Bernie Sanders show age is no obstacle when it comes to serving",
      "author": "Bruce Lowry",
      "content": "I could not help but be moved by recent photos circulating out of Nashville, Tennessee, showing Jimmy Carter, looking as though he had been punched in the eye, patiently fashioning a piece of wood and preparing to use a power drill — lending his energies to a building project for one more person in need. Yes, that Jimmy Carter, former president, the man for whom I cast my first ballot. The man, 95, who just became the nation’s oldest former president. The man in whom, apparently, there is no quit. In the photos, Carter wears a red bandanna, a baseball cap, a large bandage over his left eye, and a large bruise beneath it and across his cheek, along with 14 stitches courtesy of a fall he had taken a couple of days earlier at his home in Plains, Georgia. Carter, whose humanitarian streak knows no end, is an inspiration. He has been building homes with the nonprofit Habitat for Humanity for decades, not to mention taking on scores of humanitarian projects both at home and abroad. He seems, as one old friend used to describe such folks, driven to do good. \"I fell down and hit my forehead on a sharp edge and had to go to the hospital,” Carter told a crowd on Oct. 6 at Nashville's fabled Ryman Auditorium. “And they took 14 stitches in my forehead and my eye is black, as you’ve noticed. But I had a No. 1 priority and that was to come to Nashville and build houses.” Indeed, Carter and his wife, Rosalynn, 92, were part of a team building new porches on 21 Nashville homes. The project was part of what was called the 36th Jimmy and Rosalynn Carter Work Project with Habitat for Humanity. Carter, as president, was not our greatest. His critics cast him as weak and ineffective. Maybe he was. People still blame him for the so-called Iranian hostage crisis without delving too deeply into our problematic relations with Iran that continue today. He is also looked on with disdain for disallowing American athletes to participate in the 1980 Summer Olympics in Moscow. Carter called for the boycott to protest the Soviet invasion of Afghanistan. In other words, he did something you rarely see today. He took a stand on principle, not politics. He also kept us out of war, and he fought hard for a smarter and more sustainable energy policy. And yet for all that, he is considered a failure in some circles. He lost to Ronald Reagan, the Gipper, who was Hollywood handsome and had a way with words and who was also going to \"make America great again.” Yet we are right to celebrate Carter’s endurance even as it comes around in these same days that some are questioning the health of Vermont Sen. Bernie Sanders, who suffered a heart attack on Oct. 1, and encouraging him to drop out of the presidential race. Sanders returns:Age, health and impeachment: What to watch for in the debate Sanders, 78, directly addressed the event that put him in a Las Vegas hospital, where he underwent a 45-minute procedure to have two stents inserted to address a blockage in an artery. “I was at an event and … for the first time in my life I said, get me a chair, I have to sit down. And I was sweating profusely,” Sanders said. “I said to my staff, ‘Guys, we’ve got to get out of here.’ ” In an interview with CNN’s Sanjay Gupta in at his home in Burlington, Vermont, on Oct. 10, Sanders indicated he would be continuing with the campaign, adding that “at the appropriate time, we'll make all the medical records public for you or anyone else who wants to see them.” Don't ignore age:You don't have to be 37 like Pete Buttigieg, but age should matter in the 2020 campaign I don’t know whether Sanders should drop out of the race. It strikes me as the most personal of decisions. He alone knows how he feels. What I would say about Sanders, though, is that he seems genuine, a politician to be sure, but one who, like Carter, is driven to do good. In the end, I think that as you get older you gain appreciation for your elders, those who came before, who have been where you are now walking, and somehow survived into greater maturity. Both Carter and Sanders are teaching us lessons about the journey, and maybe we can take some of them along as we make our own way. Bruce Lowry is the editorial page editor for The Record and NorthJersey.com, where this column first appeared. Follow him on Twitter: @BruceLowry21",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders defends Tulsi Gabbard, says claim that she's a Russian asset is 'outrageous'",
      "url": "https://www.usatoday.com/story/news/politics/2019/10/21/bernie-sanders-slams-hillary-clinton-claim-tulsi-gabbard-russian-asset/4058621002/",
      "subtitle": "Bernie Sanders defends Tulsi Gabbard, says claim that she's a Russian asset is 'outrageous'",
      "author": "Jeanine Santucci",
      "content": "Clarifications and corrections: The Associated Press corrected an Oct. 18 story, used by USA TODAY, about Tulsi Gabbard and Hillary Clinton, which reported erroneously that Hillary Clinton said she believes the Russians have “got their eye on somebody who’s currently in the Democratic primary and grooming her to be the third-party candidate.” She was referring to Republicans, not Russians, according to an aide. This story has been updated to reflect that correction. Vermont Sen. Bernie Sanders has added his name to the list of lawmakers defending fellow 2020 presidential candidate, Hawaii Rep. Tulsi Gabbard, after 2016 Democratic nominee Hillary Clinton suggested she was a \"favorite\" of the Russian government.. \"Tulsi Gabbard has put her life on the line to defend this country,\" Sanders said in a tweet Monday. \"People can disagree on issues, but it is outrageous for anyone to suggest that Tulsi is a foreign asset.\" Gabbard has seen an outpouring of support from both sides of the political aisle after Clinton made her remarks on a podcast last week. Though Clinton did not use Gabbard's name, the comments appeared to be directed at the veteran. She said she believes Republicans are \"grooming\" Gabbard. “I’m not making any predictions, but I think they’ve got their eye on somebody who’s currently in the Democratic primary and they’re grooming her to be the third-party candidate,\" Clinton said. \"She's the favorite of the Russians.\" More:U.S. Rep. Tulsi Gabbard says Hillary Clinton 'knows she can't control me' Gabbard responded to the former secretary of state on Twitter, accusing Clinton of being behind an effort to tarnish her campaign and reputation. \"You, the queen of warmongers, embodiment of corruption, and personification of the rot that has sickened the Democratic Party for so long, have finally come out from behind the curtain,\" Gabbard tweeted. Gabbard brought up her endorsement of Sanders during the 2016 Democratic primary, which came after she quit as the vice chairwoman of the Democratic National Committee. \"They said Clinton will never forget. That she and her rich and powerful friends, her allies in politics and the media will make sure you’re destroyed,\" Gabbard said. Clinton also called President Donald Trump \"Vladimir Putin's dream\" and referred to 2016 Green Party opponent Jill Stein as a \"Russian asset.\" Stein received about 1% of the vote in 2016. Trump, too, defended Gabbard on Monday. \"She’s accusing everyone of being a Russian agent,\" the president said. \"I don’t know Tulsi, but she’s not a Russian agent.\" Several 2020 Democratic candidates, including author Marianne Williamson, entrepreneur Andrew Yang and former Texas Rep. Beto O'Rourke. \"Tulsi is not being groomed by anyone. She is her own person,\" O'Rourke said. \"Obviously has served this country, continues to serve this country in uniform, in Congress, as a candidate for presidency so I think those facts speak for themselves.\" Recognizing their \"very different views,\" South Bend, Ind. Mayor Pete Buttigieg said that he doesn't know what the basis is for the accusation against Gabbard. \"I'd prefer to have the conversation be about policy,\" Buttigieg said of attacks on his opponents, speaking to CNN.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders releases marijuana legalization plan that includes billions in federal grants",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/10/25/bernie-sanders-releases-marijuana-legalization-plan-billions-in-federal-grants/2456515001/",
      "subtitle": "Bernie Sanders releases marijuana legalization plan that includes billions in federal grants",
      "author": "Isaac Fornarola",
      "content": "BURLINGTON – Sen. Bernie Sanders has released a plan for marijuana legalization that would invest tax revenue in grants for minority-owned cannabis businesses and expunge past convictions. The Sanders campaign released the plan, aptly, at 4:20 on Oct. 24. If elected president of the U.S., Sanders promises to legalize marijuana within his first 100 days in office. He would issue an executive order directing the attorney general to declassify marijuana as a Schedule I controlled substance and nominate cabinet officials \"who will all work to aggressively end the drug war,\" and codify legalization into law. Here are some key aspects of the plan: The Sanders administration would review \"all marijuana convictions\" on both the state and federal level. Though the plan says all past convictions would be expunged, the details of the proposal say each case will be reviewed to see which convictions are eligible for expungement. The plan would direct federal funds to states and cities to assist in the process of expunging criminal records. If, after two years, a case has not been reviewed on the state level, the administration would grant the individual \"an administrative remedy.\" More:Where the 2020 Democratic candidates for president stand on marijuana legalization More:Presidential pot: Why 2020 Democrats are ready to legalize marijuana Sanders' plan allocates $50 billion in marijuana tax revenue for grant programs and community development funds. This includes: Although the tobacco industry has already made significant investments in the marijuana industry, the Sanders plan says it will ban \"tobacco/cigarette corporations from participating in the marijuana industry.\" Tobacco behemoth Altria, which manufactures Marlboro cigarettes, has already invested billions in one of the largest marijuana companies in the world, the New York Times reports. The plan does not specify how or whether it would push out companies like Altria that are already invested in the industry. It doesn't specify whether it would also prohibit alcohol companies like Constellation Brands (the maker of Corona) and Molson Coors which have invested billions in the industry to date. The plan would \"provide resources\" to incentivize entrepreneurs to start marijuana non-profits and cooperatives. It grants the federal government regulating authority over quality control and safety inspections.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders laughs at idea of Jeff Bezos floating Michael Bloomberg's presidential run",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/11/10/bernie-sanders-aoc-react-to-jeff-bezos-michael-bloomberg-report/2555554001/",
      "subtitle": "Bernie Sanders laughs at idea of Jeff Bezos floating Michael Bloomberg's presidential run",
      "author": "Nick Coltrain",
      "content": "CORALVILLE, Iowa — When U.S. Sen. Bernie Sanders learned Saturday that Amazon owner Jeff Bezos reportedly asked fellow billionaire Michael Bloomberg about running for president, Sanders couldn’t contain his laughter to speak. U.S. Rep. Alexandria Ocasio-Cortez, who was in Iowa campaigning for Sanders, jumped in while Sanders composed himself. “Of course!” she said in an interview with the Des Moines Register. “They’ve got class solidarity. The billionaires are looking out for each other. They’re willing to transcend difference and background and even politics. \"The fact that Bill Gates seems more willing to vote for Donald Trump than anyone else tells you everything you need to know about how far they’re willing to go to protect their excess, at the cost to everyday Americans.” Sanders jumped in to joke that the two billionaires make for their own “strong grassroots movement.” More:Michael Bloomberg qualifies for Democratic primary ballot in Alabama “Jeff Bezos, worth $150 billion, supporting Mike Bloomberg, whose worth only $50 billion, that's real class solidarity,” Sanders said with a chuckle. “I’m impressed by that grassroots movement. We on the other hand have had over a million people contribute to our campaign, in millions of individual contributions averaging $16 a piece. That's what we get from working class people. So a little bit different approach to politics.” On the campaign trail, Sanders frequently says that Amazon raised its starting wage to $15 an hour after pressure from him. Earlier Saturday, at a Des Moines summit on the climate change crisis, Sanders criticized billionaires deciding to run for president just because they have tremendous wealth. He didn’t name Bloomberg then, but made his point clear in an interview. Extreme wealth inequality, coupled with lack of regulation — like unlimited political spending allowed under the Citizens United Supreme Court decision — is seeping deeper into politics via things like the “absurdity” of Bloomberg pondering a run, he said. \"He's deciding because he is worth $50 billion, he's going to run for president of the United States,” Sanders said. “He doesn't have to worry about coming into Iowa, he doesn’t have to worry about going to New Hampshire or Nevada or South Carolina. He's just going to spend, I suspect, hundreds of millions of dollars in media in California because he's a billionaire. So that's the corruption of the political system based on the kind of massive wealth inequality that exists right now.\" Sanders brought up Bloomberg when tying his “Green New Deal” — the stated theme behind Ocasio-Cortez’s visit to Iowa — to a broader \"class war\" Sanders sometimes describes on the campaign trail. \"When you talk about class warfare within the context of climate change, like Alexandria was just saying, the fossil fuels industry makes billions of billions of dollars in profits every single year, and the people who suffer the most are often lowest income people. But it's not just low income people. Family farmers in Iowa and agriculture in Iowa is going to be suffering.” The “Green New Deal” would create “millions of good paying jobs while we save the planet for our children,” Sanders promised. The $16.2 trillion proposal, spread over 10 years, aims to fundamentally remake the economy around renewable energy and decarbonization. Ocasio-Cortez, a lead sponsor of the “Green New Deal” in Congress, agreed with the class war framework. Oil companies knew in the 1970s that carbon emissions would lead to global temperature increases, she said, and prioritized profits over being part of the solution. \"The climate crisis is not impacting all of us equally,” Ocasio-Cortez said. “It's happening along class lines, so I think it's important to acknowledge the essential classism in the issue and how it's impacting us.\"",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Green New Deal: AOC, Bernie Sanders team up on bill to modernize public housing",
      "url": "https://www.usatoday.com/story/news/politics/2019/11/14/aoc-bernie-sanders-unveil-green-new-deal-bill-updating-public-housing/4190376002/",
      "subtitle": "Green New Deal: AOC, Bernie Sanders team up on bill to modernize public housing",
      "author": "Ledyard King",
      "content": "WASHINGTON – What do public housing and climate change have in common? The Green New Deal. As part of the sweeping progressive program to confront global warming, Sen. Bernie Sanders, I-Vermont, and Rep. Alexandria Ocasio-Cortez, D-N.Y., Thursday held a Capitol Hill news conference to unveil the first plank of the ambitious plan: a bill designed to make housing cheaper, safer and more environmentally friendly. The Green New Deal for Public Housing Act would set aside $180 billion over 10 years to repair existing apartments, upgrade health and safety features and eliminate carbon emissions. The measure would also provide money to electrify all public housing buildings with clean energy, add solar panels, and start powering apartments housing low-income Americans using renewable energy sources. Ocasio-Cortez said it was no accident that the first legislation to implement the Green New Deal would center on poorer communities in urban and rural areas where widespread droughts, powerful hurricanes and strong tornadoes pose the greatest threat. \"This is how we show that tacking the climate crisis is an opportunity for us to create an economic stimulus and an economic boon not just for Wall Street but for working people,\" she said at the news conference. Backers say the bill \"dramatically improves\" living conditions for nearly 2 million people living in roughly 1 million public homes. Sanders said the Green New Deal isn't \"just about climate change. It is an economic plan to create millions of good-paying jobs.\" Democratic pushback:After Green New Deal goes down, Democrats try less ambitious approach to climate change One of the co-sponsors of the public housing bill is Sen. Elizabeth Warren, D-Mass., who is vying with Sanders for the Democratic presidential nomination in 2020. The bill's prospects appear dim given that the Senate is currentcontrolled by Republicans and most House Democrats have yet to sign on to the Green New Deal. Thursday's announcement comes less than a month after Ocasio-Cortez endorsed Sanders for president, a move that was seen as a key boost for the Vermont senator struggling to overtake Warren and former Vice President Joe Biden in the polls. More:Scientists want to help save the Earth by storing carbon dioxide in the ground Unveiled earlier this year, the Green New Deal calls for shifting completely from fossil fuels to renewable energy in the coming years and prescribes a broad social justice platform that includes free housing, medical coverage and higher education for all Americans. Mocked by Republicans as a socialist program that would end air travel and demolish the economy, the program has also faced pushback by moderate Democrats who have argued for smaller steps such as having the U.S. rejoin the Paris accord on climate change.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "2020 election: Democratic presidential candidate Bernie Sanders shares his views on current issues",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/11/07/democratic-presidential-candidate-bernie-sanders-shares-views-current-issues/4103305002/",
      "subtitle": "2020 election: Democratic presidential candidate Bernie Sanders shares his views on current issues",
      "author": "null",
      "content": "We asked presidential candidates questions about a variety of issues facing the country. This is what Democratic candidate Bernie Sanders had to say about climate change, gun control, health care and other issues. Do you believe the earth’s climate is changing? If yes, do you believe it is caused by humans? Yes. Bernie knows that climate change is real. It is caused by human activity and it's already causing devastating problems in the United States and around the world. That is why Bernie has proposed his Green New Deal plan to save the planet and create millions of new jobs. If you could unilaterally make one change, or enact one policy, that would affect the climate, what would that be? And why? Bernie understands that if we are going to save the planet, we are going to have to be extremely bold and stand up to the fossil fuel industry and Bernie’s Green New Deal does just that. Bernie’s Green New Deal is the only plan bold enough — mobilizing an historic $16.3 trillion investment — to confront the climate crisis with the urgency it requires, generate the political will necessary for a wholesale transformation of our society, and create an economy that works for all. How would you engage foreign leaders to work with the United States on issues related to climate? Bernie will work with the international community to tackle the existential threat of climate change. The threat of climate change is a very clear example of where American leadership can make a difference. Europe can’t do it alone, China can’t do it alone, and the U.S. can’t do it alone. This is a crisis that calls out for strong international cooperation. American leadership — the economic and scientific advantages and incentives that only America can offer — is hugely important for facilitating this effort. Should the U.S. explore additional use of nuclear power as an alternative energy source? Why or why not? We know that the toxic waste byproducts of nuclear plants are not worth the risks of the technology’s benefit, especially in light of lessons learned from the Fukushima meltdown and the Chernobyl disaster. To get to our goal of 100 percent sustainable energy, we will not rely on any false solutions like nuclear. As president, Bernie will stop the building of new nuclear power plants and find a real solution to our existing nuclear waste problem. He will also enact a moratorium on nuclear power plant license renewals in the United States to protect surrounding communities. Should the U.S. government offer subsidies for renewable energy, such as wind energy or ethanol? Why or why not? For decades the federal government has given subsidies to the fossil fuel industry. Bernie will end fossil fuel subsidies and instead invest in renewable energy to transform our energy system away from fossil fuels to 100 percent renewables and create millions of jobs in the process. The energy will be publicly owned and sold with preference to public utilities.The New Deal provided inexpensive electricity to America. 80 years ago we electrified America under FDR without modern technologies, and today we will avert climate crisis by transitioning to renewable energy. How would you address gun violence in America? Gun violence in this country is an epidemic that must be stopped, and as president, Bernie will pass the common-sense gun safety legislation that the overwhelming majority of Americans want. He will take on the NRA; expand background checks; end the gun show loophole; ban assault weapons and high-capacity ammunition; implement a buyback program to get assault weapons off the streets; license assault weapons the same way that we do for automatic weapons; crack down on “straw purchases”; and pass “red flag” legislation so weapons stay out of the hands of those who shouldn’t have them. How do you propose making schools safer from acts of violence? Our schools must be safe for all students. It is absurd that our children must face the terrifying reality of being at risk of being killed in their own schools. Bernie will enact comprehensive gun violence prevention laws to end the epidemic of gun violence in this country and in our schools; pass the Safe Schools Improvement Act and the Student Non-Discrimination Act into law to protect the rights of LGBTQ+ students; protect and enforce Title IX; and ensure that immigrant children and their parents are free from harassment and surveillance at school, regardless of their immigration status. What role, if any, should the government have in regulating large technology companies? In nearly every part of our economy, the concentration of economic and political power is unprecedented and dangerous. If Teddy Roosevelt were alive, he would break these companies up. So as president Bernie will nominate an Attorney General who will aggressively stand up to monopolies in all industries by breaking up existing monopolies and placing moratoriums on mergers in concentrated industries. We live in an era of unchecked corporate power. It’s time to take that power back for the people. If you are elected, how would you interact with North Korea? What relationship would the U.S. and North Korea have? Every step we take to reduce the military force of North Korea, open it up to inspections, end the 70-year-old Korean War and encourage peaceful relations between the Koreas and the U.S. to increase the chances of complete denuclearization of the peninsula. Peace and nuclear disarmament must proceed in parallel, close consultations with our South Korean ally. Bernie will negotiate a step-by-step process to roll back North Korea’s nuclear program, build a new peace and security regime on the peninsula and work towards the elimination of all North Korea nuclear weapons. This will take some time. Would you re-enter the 2015 nuclear deal with Iran? Why or why not? Yes. The agreement with Iran was one of the strongest anti-nuclear agreements ever negotiated. It prevented a war and stopped Iran from building a nuclear weapon. Bernie would re-enter the agreement on day one of his presidency and build upon it with additional measures to further block any path to an Iranian nuclear weapon, restrain Iran’s offensive actions in the region, and forge a new strategic balance in the Middle East. How do you plan to address the threat of extremism in the U.S.? The United States must come together as a nation and combat the rise of violent white supremacist extremism. As president, Bernie will use the power of the presidency to redirect federal resources to address this threat to our national security. Incredibly, the Trump administration has spent limited federal law enforcement dollars caging immigrant children while cutting funding from initiatives designed to fight the growing influence of white nationalist propaganda and violence. As president, Bernie will fight white supremacist extremism once and for all. Do you believe there is equal access to voting in the U.S.? If not, how would you go about expanding access to voting? The right to vote is fundamental in America for every eligible voter. Bernie believes we must expand equal access to voting in the U.S. by implementing measures such as automatic voter registration for every American over 18 and by making Election Day a national holiday. As president, Bernie will restore and expand the Voting Rights Act, fight the scourge of right-wing voter suppression, and make sure our elections are secure. Do you believe voter fraud is a problem in the U.S.? If yes, how do you plan to you address it? No. Unfortunately we are facing widespread and politically motivated voter suppression across the United States, which greatly impacts voters of color, students, those living in rural areas, seniors, and individuals with disabilities. Bernie stands against voter suppression by supporting the restoration of the Voting Rights Act, abolishing burdensome voter ID laws, and ending partisan gerrymandering. Bernie also believes we must re-enfranchise those who have had their vote taken away by a felony conviction and incarceration. Voting is a fundamental right of all citizens above 18. Should it be a crime to enter the U.S. illegally? Entering the U.S. without documentation should not be a criminal offense. Bernie believes that no human being is illegal, and we should not treat families who travel thousands of miles to escape violence and misery as criminals. The criminalization of border crossings does not serve public interest or safety, wastes valuable government resources and taxpayer dollars, and has been utilized by President Trump to rip families apart and cage children. As president, Bernie will handle border crossings as a civil matter and push Congress to repeal 8 US Code Section 1325. Should the U.S. expand or limit legal immigration? Bernie believes immigrants make our country, our economy, and our society stronger. Bernie supports a family-based immigration system grounded in civil and human rights. As president, Bernie will protect and expand family-based visas, welcome asylum-seekers fleeing persecution and violence, lift Trump’s un-American refugee caps, and create a program to settle refugees who are displaced from their homes by climate change, with a floor of 50,000 in his first year. In many areas of the country, there is a critical shortage of affordable housing. What would your administration do to address it? Bernie is the only candidate to propose filling the full 7.4 million unit affordable housing gap in this country. Bernie’s Housing for All plan will build 9 million affordable and social housing units, expand Section 8 vouchers to all who are eligible, enact a nationwide rent control standard, establish a tenants bill of rights to protect vulnerable renters against unscrupulous landlords, end exclusionary zoning, repair and modernize public housing. What is your plan to address the growing national debt? For too long in this country, there has been austerity for the poor but windfalls for the rich. Trump’s tax cuts added trillions to the deficit for a giveaway to the wealthy and large corporations. Meanwhile, we’ve seen decades of cuts to essential public services and stagnant real wages for workers. Bernie will ensure the rich and corporations pay their fair share, and he’ll reduce our bloated military budget. Bernie’s proposals are fully paid for, but he will not make the deep cuts to Social Security and Medicare that many in both parties demand under the guise of deficit reduction. Do you think our national debt is a national security issue? Why or why not? Bernie believes our most pressing national security issue is climate change. Scientists are clear that if we do not take decisive action immediately to transform our energy system, the cost of inaction will total trillions of dollars by the end of the century. We must stop cutting taxes for the wealthy and large corporations and start mobilizing the federal government and our substantial resources to meet the most important challenge of our lifetimes. Is capitalism the best economic structure for the United States? If yes, why? If no, what is better and how do you believe it will benefit Americans? Three families control more wealth than the bottom half of America. Unfettered capitalism has left millions of working-class people, in the wealthiest country, suffering incredible economic hardship. Bernie believes we must guarantee everyone in our country basic economic rights: the right to health care, quality education, a good job that pays a living wage, housing, a secure retirement, and the right to a clean environment. As Dr. King said, “Call it democracy, or call it democratic socialism, but there must be a better distribution of wealth within this country for all of God's children.” In many parts of the country, there is a skilled worker gap. How would you close that gap to get more people employed in the industries that need them? Unfortunately, for much of the United States, we have a situation where employers are not willing to raise wages to attract necessary workers. And to educate the next generation, Bernie will make public community colleges, trade schools, colleges, and universities tuition and debt free so all who want to can attain a higher education. We also have a crumbling infrastructure in our country, from repairing roads and bridges to moving our energy system to 100 percent renewable energy. Bernie will implement a federal jobs guarantee to ensure that all who can work are guaranteed a job. Should the government forgive student loans? If yes, why and for whom? If no, why not? Yes. When Bernie is in the White House, he will cancel the entire $1.6 trillion in outstanding student debt for the 45 million borrowers who are weighed down by the crushing burden of student debt. This will save around $3,000 a year for the average student loan borrower. And by cancelling all student debt we will cut the racial wealth gap for young Americans by more than half — from 12:1 to 5:1. We can do better than burdening people with debt to carry until they die for the \"crime\" of getting an education. Should community college be free to anyone who wants to attend? Should other colleges and universities be free to attend? Today, there is universal access to free, public schools across the U.S. for kindergarten through 12th grade. In the 21st Century, a free public education system that goes K-12 is no longer good enough to fully succeed. Every human has the right to a good and free education, no matter family income, immigration status, race, disability, or religion. Bernie’s College for All plan will make all four-year public colleges and universities, HBCUs, tribal colleges, community colleges, trade schools, and apprenticeship programs tuition and debt-free, and we must cancel all student debt. Is more funding needed for mental health care in America? If yes, what amount and how should it be allocated? Where should that money come from? Yes. We are experiencing a crisis in mental health treatment in this country. Bernie's Medicare for All plan would address this crisis by providing comprehensive mental health and substance abuse treatment services as well as prescription drugs free at the time of service — no co-payments, premiums, deductibles, or surprise bills. By cutting unnecessary administrative costs, bringing down the outrageous prices of prescription medication, and ensuring large corporations and the wealthy pay their fair share, we can afford to guarantee quality health care to all people in the U.S. Read what all the candidates have to say about health care here. How would you address rising prescription drug costs, specifically for medications that are necessary for people to live, such as insulin and mental health medications? We pay the highest prices in the world for prescription drugs. While about one out of five Americans cannot afford to pay for the medicine prescribed by their doctors,10 big drug companies made $69 billion in profits last year. Under Medicare for All, Bernie will stop the pharmaceutical industry from ripping off the American people by making sure that no one in America pays over $200 a year for the medicine they need by capping what Americans pay for prescription drugs. What do you believe is the biggest health care issue facing Americans? How would you solve it? America is the only major industrialized country that doesn’t guarantee health care as a human right. Thirty million Americans remain uninsured, millions more are underinsured, and profit-driven pharmaceutical and insurance companies fill the system with bloat for their own benefit at the expense of patients. Despite the groundswell of support from Democrats, Republicans, and independents for Medicare for All, insurance, drug, and hospital lobbyists have teamed up to protect their profits by pouring large sums of money into an attack campaign on a plan that would guarantee health care to all. How would you address the opioid crisis? The opioid epidemic is killing thousands of Americans every year, caused by the greed of pharmaceutical companies, which lied about the dangers of these products. These companies have profited billions each year and not one of them has been held fully accountable. Bernie will address this crisis with the urgency it requires by investing in treatment, prevention, and research and guaranteeing health care as a right to all, including substance abuse and mental health services. Bernie will hold pharmaceutical companies responsible for this epidemic by passing the Opioid Crisis Accountability Act. Should marijuana be legalized federally for medicinal use? Should it be legalized for recreational use? It is time to admit the criminalization of marijuana was a disaster, especially for communities of color, and to take action to undo the terrible damage caused by the war on drugs. Even though people use drugs like marijuana at roughly the same rates across all races, black Americans are nearly four times more likely to be arrested for marijuana possession than white Americans. Our job now is to legalize marijuana and vacate and expunge past marijuana convictions, and ensure that revenue from legal marijuana is reinvested in communities hit hardest by the War on Drugs. Do you support a public health insurance option for all Americans? If yes, do you support the elimination of private health care in favor of a government-run plan, or do you support an option where Americans can choose a public or private plan? If no, why? Yes. Bernie is running for president because the time is long overdue for the United States to join every other major country on Earth and guarantee health care to all people as a right, not a privilege, through a Medicare for All program. The goal of a health care system should be to keep people well, not to make stockholders rich. Bernie’s plan would provide comprehensive health coverage to all with no premiums, deductibles, copayments, or surprise bills, period. Should the federal government re-institute the death penalty? If yes, for what crimes? Absolutely not. The death penalty is cruel and unusual punishment, is applied disproportionately to people of color, and has been debunked as a deterrent to violent crime. Nearly every other major country on Earth has abolished the death penalty and as resident, Bernie will do the same.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Ariana Grande shares backstage pictures with 'my guy' Bernie Sanders: 'We adore you!'",
      "url": "https://www.usatoday.com/story/entertainment/celebrities/2019/11/20/ariana-grande-backstage-pictures-bernie-sanders/4252758002/",
      "subtitle": "Ariana Grande shares backstage pictures with 'my guy' Bernie Sanders: 'We adore you!'",
      "author": "Cydney Henderson",
      "content": "Ariana Grande is showing off \"MY GUY\" – Sen. Bernie Sanders. The Democratic presidential candidate, 78, attended the pop star's Atlanta concert Tuesday night, where the two posed for pictures and shared a hug backstage. \"Thank you Senator Sanders for coming to my show, making my whole night and for all that you stand for,\" Grande, 26, captioned several Instagram photos of herself and Sanders grinning ear to ear. \"I will never smile this hard again.\" The \"Thank U, Next\" singer has partnered with the nonprofit organization HeadCount to help her concertgoers register to vote at every stop of her Sweetener World Tour, which wraps up in late December. The outreach program is called \"#thankunextgen.\" \"@Headcountorg and i are doing our best to make you proud,\" Grande added. \"We’ve already registered 20k+ young voters at my shows and more online and we aren’t stopping any time soon. proud of my fans for paying attention and getting involved. we adore you!\" More: Ariana Grande cancels tour stop because she's 'very sick' The feeling is mutual. Sanders took to Twitter to document their meet-and-greet with a sweet message for the singer: \"I want to thank @ArianaGrande for not only being a wonderful entertainer, but also for being such an outstanding advocate for social justice. We must all be prepared – like Ariana has shown – to fight for everyone who is struggling. It was great to meet her in Atlanta last night.\" More: Cardi B's latest video collaborator? It's Bernie Sanders Ahead of her Atlanta show, Grande was forced to cancel a tour stop in Kentucky over the weekend because she was \"very sick\" with a sinus infection. But it appears Sanders' visit was just what the pop star needed to feel better. That wasn't the only good news for Grande. On Wednesday, she was nominated for five Grammys, including record (\"7 Rings\") and album of the year (\"thank u, next\"). \"Thank u for acknowledging this music my beautiful best friends and i created in just a few weeks together,\" she wrote on Instagram. \"The acknowledgement is truly more than enough on its own for me and my heart. thank u.\" 'My heart feels good':Ariana Grande celebrates 'Thank U, Next' anniversary",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Susan Sarandon cancels Bernie Sanders campaign event after suffering concussion from fall",
      "url": "https://www.usatoday.com/story/entertainment/celebrities/2019/11/22/susan-sarandon-pulls-out-bernie-sanders-event-after-fall-concussion/4275422002/",
      "subtitle": "Susan Sarandon cancels Bernie Sanders campaign event after suffering concussion from fall",
      "author": "Charles Trepany",
      "content": "Susan Sarandon isn't letting \"a little slip\" stop her from spreading a political message. The \"Ray Donovan\" actress revealed on Instagram Friday that she suffered a concussion, fractured nose and \"banged up\" knee after a fall, posting a photo of herself with a severely bruised face and a black eye. As a result of the her condition, Sarandon wrote that she \"won't be able to meet the folks in New Hampshire\" at an event with Democratic presidential candidate Bernie Sanders Saturday. \"I'm really sorry I'll miss that opportunity, but here's what I'd hoped to say,\" she added. Sarandon then issued call to action for voters to support Sanders. \"This is an emergency,\" she wrote. \"Ask the scientists, the farmers, the creatures in the sea. Ask all those who have lost their homes from hurricanes, flood and fire, ask the endless stream of climate refugees, and the people of Flint, San Juan, and Standing Rock.This is a emergency. Ask the mothers who have lost their children to the opioid epidemic or because of the price of insulin. Ask the mothers who have lost their kids to gun violence in schools, in churches, in their bedrooms.\" She continued: \"This is an emergency. Ask those separated from their families at the border, or those separated from their loved ones by an unjust, racist, for-profit prison system. This is an emergency when our young people have no hope for education, for dream-making, because of insurmountable student debt. When teachers are forced to have additional jobs and when 40 hours of honest labor can still leave you in poverty. When homophobia, Islamaphobia, transphobia and racism take lives, that is an emergency.\" Sarandon capped off her post saying emergencies \"require bold, visionary leadership\" rather than \"incremental change.\" \"Senator Sanders believes in us and that together a better world is possible,\" she added. \"He has been fighting for social, racial and economic justice his entire life, long before running for President, often before it was acceptable. Now it’s time for us to fight for him.\" Susan Sarandon among 575 people arrested at protest against Trump immigration policy Sarandon, 73, is a vocal Sanders supporter and political activist. In 2018, she was among hundreds of people arrested in Washington, D.C. in a \"mass civil disobedience\" act to protest the Trump administration's immigration policy. According to the United States Capitol Police, approximately 575 protesters were charged with \"unlawfully demonstrating.\" Contributing: Sara M Moniuszko",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Ex-MLB player Aubrey Huff teaching sons to use guns in case Bernie Sanders becomes president",
      "url": "https://www.usatoday.com/story/sports/mlb/2019/11/27/aubrey-huff-guns-mlb-bernie-sanders/4317322002/",
      "subtitle": "Ex-MLB player Aubrey Huff teaching sons to use guns in case Bernie Sanders becomes president",
      "author": "Jesse Yomtov",
      "content": "Former Major League Baseball player Aubrey Huff caused an uproar Tuesday, tweeting that he was training his sons to use guns in the \"unlikely event\" that Bernie Sanders becomes president, along with picture of a gun range target. \"Knowing how to effectively use a gun under socialism will be a must,\" Huff wrote, tagging the National Rifle Association in the tweet. Huff, 42, played 13 big-league seasons and was part of the 2010 and 2012 San Francisco Giants teams that won the World Series. Huff would go on to explain that he was training the kids in case there were \"crazy people rioting and trying to break into my house for food or shelter.\" A handful of celebrities jumped in to chide Huff, including Patricia Arquette, Tom Arnold and Kathy Griffin. It was quite a week online for Huff, who in previous days had ranted about divorce laws and alimony payments. \"No way women who have never threw a touchdown pass, hit a game winning 3, or hit a 2-0 slider deserve half of a mans hard earned money just for having his babies,\" he wrote Sunday. In another tweet Sunday, Huff wrote that \"marriage has become a (business)\" for women looking to get rich. \"I believe n marriage the way it was in the old days when women had pride n being a stay at home mom & making sure her man is satisfied providing for the family. Marriage has become a biz 4 women looking 2 get rich off a successful man,\"",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    }
  ]
}