{
  "articles": [
    {
      "title": "Donald Trump defends his Jeffrey Epstein, Bill Clinton conspiracy retweet",
      "url": "https://www.usatoday.com/story/news/politics/2019/08/13/donald-trump-defends-jeffrey-epstein-bill-clinton-conspiracy-retweet/1996632001/",
      "subtitle": "Donald Trump defends his Jeffrey Epstein, Bill Clinton conspiracy retweet",
      "author": "David Jackson",
      "content": "WASHINGTON – President Donald Trump defended a re-tweet that appeared to link Jeffrey Epstein's death to former President Bill Clinton, and said Tuesday he wants a full investigation of Epstein's apparent suicide. \"The retweet was from somebody that is a very respected conservative pundit so I think that was fine,\" Trump told reporters as he departed his golf club in Bedminster, N.J., for an energy speech in western Pennsylvania. \"I want a full investigation,\" Trump said. Supporters of Clinton have questioned Trump's mental stability for trafficking in conspiracy theories normally confined to the fringes of the political spectrum. \"Ridiculous, and of course not true — and Donald Trump knows it,\" said a weekend tweet from Angel Ureña, a spokesman for former President Clinton. \"Has he triggered the 25th Amendment yet?\" After Trump defended the re-tweet on Tuesday, Ureña added: \"Might be hard to hear over Air Force One, but that’s the sound of the President of the United States’ credibility blowing in the wind.\" Keep up with this story:Get USA TODAY's Evening Briefing in your inbox Trump has frequently feuded with the Clinton family, particularly during the 2016 presidential election against Democratic nominee Hillary Clinton. Democratic presidential candidates for 2020 and others have blasted Trump for re-tweeting a no-evidence conspiracy theory somehow tying Epstein's death to Clinton. “This is another example of our President using this position of public trust to attack his political enemies with unfounded conspiracy theories,\" Democratic candidate Beto O'Rourke said Sunday on CNN. Another presidential candidate, Cory Booker, told CNN that Trump is \"whipping people up into anger and worse\" and added that “this is a very dangerous president that we have right now.\" Asked Tuesday if he believes Clinton had anything to do with Epstein's death, Trump said he didn't know. Trump did mention that Epstein, the accused sex trafficker, owned a private island where \"bad things\" happened. “Did Bill Clinton go to the island?” Trump asked. There is no evidence at all linking Clinton to Epstein's death Saturday by suicide, yet Trump on Saturday night re-tweeted the comments of a Twitter user named Terrence K. Williams: \"Died of SUICIDE on 24/7 SUICIDE WATCH? Yeah right! How does that happen #JefferyEpstein had information on Bill Clinton & now he’s dead I see #TrumpBodyCount trending but we know who did this! RT if you’re not Surprised.\" Epstein, the financier who had been facing federal sex trafficking charges, was not on suicide watch when he was found dead in his jail cell early Saturday, officials said. Other conspiracy theorists on the Internet are trying to link Epstein's death to Trump, but there is no evidence of that either. Like Clinton, Trump was once friends with Epstein. After his remarks on Epstein, Trump departed for Monaca, Pa., about 35 miles northwest of Pittsburgh, where he will tour the soon-to-be completed Pennsylvania Petrochemicals Complex. Trump plans to discuss his support for \"expanding domestic manufacturing and energy production,\" the White House said.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Hillary and Chelsea Clinton are writing their first book together about 'gutsy' women through history",
      "url": "https://www.usatoday.com/story/entertainment/books/2019/08/06/hillary-clinton-and-chelsea-clinton-writing-book-gutsy-women/1930237001/",
      "subtitle": "Hillary and Chelsea Clinton are writing their first book together about 'gutsy' women through history",
      "author": "null",
      "content": "NEW YORK (AP) — Hillary Rodham Clinton and Chelsea Clinton have teamed up for “The Book of Gutsy Women,” honoring everyone from scientist Marie Curie to climate activist Greta Thunberg. Simon & Schuster announced Tuesday that the book will come out Oct. 1. It’s the first time the former secretary of state and presidential candidate has written a book with her daughter. Each has published several previous works, including Hillary Clinton’s “What Happened” and “Living History” and Chelsea Clinton’s children’s book “She Persisted: 13 American Women Who Changed the World. ” “The Book of Gutsy Women” includes portraits of more than 100 women, including presidential candidate Shirley Chisholm, Saudi activist Manal al-Sharif, entertainer Ellen DeGeneres and author Chimamanda Ngozi Adichie. The Clintons also will tell of heroines among their friends and family members. “To us, they are all gutsy women — leaders with the courage to stand up to the status quo, ask hard questions, and get the job done,” Hillary Clinton said in a statement. “This book is a continuation of a conversation Chelsea and I have been having since she was a little girl, and we are excited to welcome others into that conversation.” Chelsea Clinton said in a statement that the women in their book “share a fierce optimism that their work and lives will make a difference in the world.” “We hope readers will draw strength from their stories as we have, because if history shows one thing, it’s that the world needs more gutsy women,” she said. Financial terms for the book were not disclosed. The Clintons were represented by Robert Barnett, the Washington, D.C. attorney who has worked on book deals for Hillary Clinton, former President Bill Clinton and former President Barack Obama. Chelsea Clinton welcomes baby No. 3, Hillary and Bill are 'so thrilled' Mariah Carey makes her politics clear, posts photos of 'President Clinton and her husband'",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Twitter loves Hillary Clinton's 'epic' 'Truth Hurts' tweet: 'I just took a DNA test...'",
      "url": "https://www.usatoday.com/story/entertainment/celebrities/2019/08/21/twitter-stans-hillary-clintons-epic-truth-hurts-tweet-im-dead/2071011001/",
      "subtitle": "Twitter loves Hillary Clinton's 'epic' 'Truth Hurts' tweet: 'I just took a DNA test...'",
      "author": "Erin Jensen",
      "content": "There are many on Twitter \"with her\" after Hillary Clinton responded to a tweet from singer Lizzo Wednesday. The day prior, the \"Juice\" singer tweeted a clip from a Democratic presidential debate with then-candidates like Clinton and Bernie Sanders on their feet for the national anthem. Only instead of \"The Star-Spangled Banner,\" Lizzo's \"Truth Hurts\" plays instead: \"Why men great 'til they gotta be great?\" Clinton responded with the next line of the track, stopping before an expletive is dropped. \"I just took a DNA test, turns out...\" she tweeted. The line is: \"I just took a DNA test, turns out I'm 100% that (expletive).\" Members of the Twitterverse promptly lost their minds. Some shared GIFs of people falling to the floor. \"HILLARRRYYYYYYYYY I’m dead,\" a user said in response. Hillary and Chelsea Clinton are writing their first book together about 'gutsy' women through history Lizzo, the flute-playing singer, is back in the studio with a 'really different' sound \"simply epic ma’am\" another gushed. \"Yaaaaaas Madam President!\" a person cheered. \"#StillWithHer\" Others filled in the rest of Clinton's sentiment. \"I 100% won the popular vote,\" a person posted, recalling Clinton beat Trump by millions of votes. \"I am 1000% more intelligent than Donald Trump!\" read another tweet. Lizzo calls Summerfest security guard a 'racist bigot,' says he attacked her team Chelsea Clinton welcomes baby No. 3 and her parents are 'so thrilled'",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "'Debunked': Hillary Clinton slams Trump's claim of voter manipulation",
      "url": "https://www.usatoday.com/story/news/politics/2019/08/20/hillary-clinton-responds-trump-tweet-google-vote-manipulation/2059138001/",
      "subtitle": "'Debunked': Hillary Clinton slams Trump's claim of voter manipulation",
      "author": "Nicholas Wu",
      "content": "WASHINGTON – Former Democratic presidential nominee Hillary Clinton responded on Monday to President Donald Trump's claim that Google had \"manipulated from 2.6 million to 16 million votes\" for her in the 2016 election by noting that the study Trump appeared to be referring to was \"debunked.\" Clinton said on Twitter the study was actually \"based on 21 undecided voters.\" She added, \"For context that’s about half the number of people associated with your campaign who have been indicted.\" She had been referring to Trump's post earlier Monday about alleged voter fraud in the 2016 election. Trump had said on Twitter that because of Google's misdeeds, \"Google must be sued\" and added that his electoral victory should have been larger. PolitiFact, a nonpartisan fact-checking website, rated Trump's claim \"false.\" The site noted that Trump appeared to be referring to a 2017 research paper by psychologists Robert Epstein and Ronald Robertson. The paper had claimed that users' search results were biased in favor of Clinton, which could have possibly shifted votes to her. The paper's methodology and findings have been questioned by other academics. who said the paper had failed to adequately explain its methodology or even define what \"bias\" was. More:Donald Trump touts voter ID laws as an issue in the 2020 election. Here’s why. More:FEC chair Ellen Weintraub on Trump claims: 'No evidence of rampant voter fraud in 2016' When reached by the outlet, Epstein said Trump mischaracterized his work. \"I have never said that Google deliberately manipulated the 2016 election,\" he told PolitiFact. Epstein and Robertson had hedged their findings in their paper, too. \"We don’t know what caused these patterns of bias,\" wrote Epstein and his co-author in the paper. Trump has frequently vented about his loss in the popular vote to Clinton. Trump won the electoral vote but lost the popular vote to Clinton by several million votes, and Trump has claimed that millions of Americans voted illegally for Clinton. The president has not provided evidence for these claims.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "'Found my emails': Hillary Clinton flips through her emails at an Italian art exhibit",
      "url": "https://www.usatoday.com/story/news/politics/2019/09/11/hillary-clinton-leafs-through-her-emails-italian-art-exhibit/2295637001/",
      "subtitle": "'Found my emails': Hillary Clinton flips through her emails at an Italian art exhibit",
      "author": "Savannah Behrmann",
      "content": "WASHINGTON-- Hillary Clinton, former secretary of State and the 2016 Democratic presidential nominee, spent time Tuesday leafing through her emails that were on display at an art exhibit in Italy. Clinton, whose 2016 campaign was shadowed by lingering questions after an FBI investigation into her use of a private email server while leading the State Department, sat at a replica of the Oval Office Resolute Desk and thumbed through thousands of emails during a visit to an art exhibit in Venice titled \"HILLARY: The Hillary Clinton Emails.\" According to the description from exhibit co-organizer Zuecca Projects, the exhibit makes public “for the first time in printed format” some 60,000 pages of Clinton’s emails which, according to WikiLeaks, “were sent from the domain clintonemail.com between 2009 and 2013.” \"Hillary Clinton spent an hour yesterday reading her emails at my exhibition of all 62,000 pages of them in Venice,\" Artist Kenneth Goldsmith tweeted. The former Democratic presidential candidate and first lady was “guided on a closed-door visit” of the exhibition, the curators say in a statement. \"I think the scene was so extraordinary that many customers believed that she was just a lookalike at first,\" the show's curator, Francesco Urbano Ragazzi, told the Huffington Post. Clinton posted a picture of herself at the exhibit Instagram, saying that she \"found\" the emails, so someone needed to \"alert the House GOP.\" Answering reporters questions outside the exhibit, Clinton told Italian news outlet TGR Veneto, \"It was and is still one of the strangest, most absurd events in American political history.\" \"And anyone can go in and look at them -- there's nothing there,\" Clinton says. \"It's an artistic way of making the same point that I made in the book I wrote, 'What Happened,' and that is, there was nothing wrong, there was nothing that should have been so controversial.\" On Twitter on Thursday morning, she said: \"Found my emails at the Venice Biennale. Someone alert the House GOP.\" During the 2016 White House race, then-candidate Donald Trump highlighted the long-simmering controversy surrounding Clinton’s usage of a private email server during her tenure as secretary of State, and chants of “lock her up” would often break out at his campaign rallies. Then-FBI Director James Comey penned a letter to lawmakers after the investigation that stated the FBI stood by its original findings, made in July of 2016, that Clinton should not be prosecuted for her handling of classified information over email while secretary of State. The often-derided refrain of \"but her emails\" was heard on the trail and on social media during the 2016 campaign to justify support for Donald Trump over Clinton. The remark was often attributed to Clinton opposers who were searching for a way to offset the latest negative news about Trump. Clinton was reportedly already in Italy to attend an economic forum. In a statement provided to the Hill, the curatorial team said “The exhibition is a way to allude to an alternative world that will never exist. We are happy that the real Hillary Clinton has been part of this image full of possibilities. \"The exhibition is indeed the portrait of a powerful woman, but also the portrait of a historical change in our understanding of notions such as transparency, propaganda, public and private space,” they also said. Contributing: William Cummings, USA TODAY",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Chelsea Clinton says she won't run for Nita Lowey's New York House seat in 2020",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/10/16/chelsea-clinton-congress-nita-lowey-us-house-of-representatives/3998039002/",
      "subtitle": "Chelsea Clinton says she won't run for Nita Lowey's New York House seat in 2020",
      "author": "Mark Lungariello",
      "content": "Chelsea Clinton ended speculation that she might run for Congress next year during an appearance on the talk show \"The View\" on Wednesday. Clinton, 39, emerged as a possible candidate immediately following 30-year Rep. Nita Lowey's announcement on Thursday she wouldn't seek reelection in 2020. She was considered a frontrunner in what is expected to be a crowded field, even though Clinton herself never said she was considering entering the race. On Wednesday, she directly addressed the rumors. \"I'm not considering running for Congresswoman Lowey's seat,\" Clinton said in response to a question from co-host Whoopi Goldberg. Chelsea Clinton:Could Chelsea Clinton run for a New York House seat? Clinton, daughter of former President Bill Clinton and U.S. Secretary of State Hillary Clinton, said she understood why people asked her about running. \"Someone has asked me some version of this question literally as long as I can remember,\" she said before recounting that she remembers being asked if she'd run for governor of Arkansas at age 3 or 4. \"I share that because I think it’s a question that shouldn’t just be asked of people whose last name is Clinton or Huntsman,\" she said, referring to co-host Abby Huntsman, the daughter of former Utah governor and U.S. Ambassador to Russia Jon Hunstman. \"It’s a question we should be asking kids, like, 'Do you think about running for office one day?'\" she said. \"I hope that if the answer to that question is, 'Yes, I'm considering it,' that you'll really think about doing it and go to run for something.\" She said she wasn't sure if she'd run for office one day, but \"right now, the answer's no.\" October debate:Here are the winners and losers from Tuesday's Democratic debate Lowey, 82, is a longtime fixture in New York's 17th Congressional District, which includes Rockland County and part of Westchester County. Clinton's parents have lived in the ritzy hamlet of Chappaqua in the Westchester part of the district since leaving the White House at the turn of the century. Chelsea Clinton lives outside of the district in New York City, but the U.S. Constitution doesn't require a House member to live within the district he or she represents. Lowey, chairwoman of the powerful House Appropriations Committee, is the first woman to head the committee. Since the district is reliably blue and overwhelmingly Democratic, her retirement has sparked interest from a number of local Democrats. 'To me it will always be Columbus Day.':Trump dismisses criticism of Christopher Columbus But the Clinton name propelled her to the front of the pack without so much as a public statement from the would-be candidate, and drew comparisons to Lowey's own abandoned U.S. Senate race in 2000. The congresswoman, a Harrison resident, had eyed a run for the Senate seat that year but stepped aside to allow Hillary Clinton a clear path to the nomination. Hillary Clinton went on to win election against Republican Rick Lazio. In 2006, she won reelection to the Senate against former Westchester County District Attorney Jeanine Pirro, now a Fox News host and friend of President Donald Trump. Clinton left the Senate in 2009 after running unsuccessfully for president to become President Barack Obama's Secretary of State. With Chelsea Clinton out of the running for the seat, there are two Democrats who are officially seeking the party nomination: David Buchwald, a state Assemblyman from White Plains who once interned for Lowey, and Mondaire Jones, who launched a primary challenge from the left in July well before Lowey's announcement she wouldn't seek reelection. Debate:CNN slammed for asking about Ellen, but not climate change, at Democratic debate Jones, 38, grew up in Spring Valley and attended Harvard Law School, raised $218,000 since launching his candidacy with the goal of becoming the first gay black man elected to Congress. Registered Democrats outnumber Republicans by more than 2-to-1 in the 17th district, according to state Board of Elections figures. Registered voters without party affiliation also outnumber Republicans in the district, 110,000-103,000, according to state active voter numbers. Follow Mark Lungariello on Facebook: @lungariello; and Twitter: @marklungariello.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Could Chelsea Clinton run for a New York House seat?",
      "url": "https://www.usatoday.com/story/news/politics/2019/10/11/chelsea-clinton-make-run-nita-loweys-house-seat-2020/3946455002/",
      "subtitle": "Could Chelsea Clinton run for a New York House seat?",
      "author": "Swapna Venugopal Ramaswamy",
      "content": "The internet was abuzz with speculation this week on whether Chelsea Clinton would throw her hat in the political ring after longtime Rep. Nita Lowey, D-N.Y., announced Thursday that she would not seek re-election in 2020. After all, rumors of Clinton, 39, being groomed for New York's 17th Congressional District, have long been circulating. The district represents Rockland County and part of Westchester County, including Chappaqua, where her parents, former president Bill Clinton and Hillary Clinton, live. In an interview with The Journal News/lohud.com last year, Chelsea Clinton said she would consider a political run under certain circumstances. “I think if someone were to step down or retire and I thought I could do a good job and it matched my talents, I’d have to think if it’s the right choice for me,” she said. While she didn’t have any immediate plans to run for office, she told the paper, it was something she thought about. “If you care about what’s happening in the world, you have to care about running for and holding elected office,” she said. “I hope it’s a question that we ask ourselves.” Chelsea Clinton's spokeswoman did not respond to an email this week about her plans, but whether she'll run is a question many are asking. On Twitter, PopularismUpdates posted a side-by-side photo of Chelsea and Hillary Clinton (who recently caused a Twitter storm of her own with her “Don’t tempt me” response to President Donald Trump tweet urging her to run) tweeting: “Today Nita Lowey the Democratic representative for NY 17th Congressional District announced she is retiring. Chelsea Clinton has been speculated to run for this seat. America, it's not too late. Come 2020 we could have them BOTH in office at the same time.” Chelsea Clinton does not live in the district, but unlike her mother, who had to establish residency in New York when she ran for a Senate seat in 2000, she would not have to engage the services of a real estate agent any time soon. Members of the House of Representatives are not required to live in the district they represent; they are required to be at least 25 years old, have been a U.S. citizen for at least seven years, and live in the state they represent. Chelsea Clinton lives in Manhattan with her husband and three children, but could easily relocate to the 17th District by moving next door to her parents in Chappaqua. The Clintonsbought the neighboring 3,600-square-foot home at 33 Old House Lane for $1.16 million in August 2016. Referring to reports it would be used as a getaway home for the couple's daughter and her family, Roni Jacobson, who has lived on Old House Lane since 1984, said when the Clintons bought the house: \"It's a perfect house for (their daughter) Chelsea. Perfect mother-daughter situation. The neighbors are delighted for them.\" What does Lowey, the first woman to lead the powerful House Appropriations Committee, think about a possible Clinton run? \"She can do whatever she wants. She’s an adult,\" said Lowey in an interview with The Journal News/lohud last November. \"When I decide to retire, I am sure the list will be very long (of people interested in the seat).” More:Here are the lawmakers who aren't running again in 2020 On Sunday, Hillary and Chelsea Clinton will be in Hyde Park where Chelsea is set to receive the Eleanor Roosevelt Val-Kill Medal — which honors the legacy of the late first lady — at the Eleanor Roosevelt National Historic Site in Hyde Park. She'll be presented the medal by her mother, a former honoree. The mother-daughter duo have also been hitting the talk show circuit and making public appearances to promote their new book, \"The Book of Gutsy Women: Favorite Stories of Courage and Resilience.\" On Dec. 2, they will speak at the Chappaqua Performing Arts Center for an event sponsored by the Chappaqua Public Library. Swapna Venugopal Ramaswamy covers women and power for the USA Today Network Northeast. Write to her at svenugop@lohud.com SECOND HOME: Clintons buy adjacent Chappaqua home for $1.16 M LOWEY ANNOUNCEMENT: Longtime Rep. Nita Lowey won't seek reelection in 2020 REACTION:Chuck Schumer, Nancy Pelosi react to Rep. Nita Lowey's retirement WHO'LL RUN?:Chelsea Clinton, Rob Astorino: Who could run for Nita Lowey's seat?",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Calling Trump a 'corrupt human tornado,' Hillary Clinton backs impeachment",
      "url": "https://www.usatoday.com/story/news/politics/2019/09/24/hillary-clinton-backs-trumps-impeachment-over-ukraine-call/2433661001/",
      "subtitle": "Calling Trump a 'corrupt human tornado,' Hillary Clinton backs impeachment",
      "author": "Savannah Behrmann",
      "content": "WASHINGTON — Former Secretary of State Hillary Clinton, who ran against Donald Trump in the 2016 presidential election, said in an interview exerpt released Tuesday that she is “favor of moving toward impeachment” and that \"we are in a crisis.\" “I did not come to that decision easily or quickly, but this is an emergency as I see it,” Clinton told PEOPLE. “This latest behavior around Ukraine, trying to enlist the president of Ukraine in a plot to undermine former Vice President Biden or lose the military aid he needs to defend against Trump’s friend, Vladimir Putin — if that’s not an impeachable offense, I don’t know what is.” The former first lady called Trump a “corrupt human tornado,” continuing that “the president of the United States is betraying our country on a daily basis.” “This man who is in the Oval Office right now is a clear and present danger to the future of the United States,” she added. The interview was published minutes after House Speaker Nancy Pelosi announced a formal impeachment inquiry into Trump over the president's efforts to get Ukraine to investigate former vice president Joe Biden and his son's business dealings in the Eastern European country. More:Read Nancy Pelosi's full remarks as she called for an impeachment inquiry of President Trump \"The president must be held accountable. No one is above the law,\" said Pelosi, who accused Trump of betraying his oath of office and endangering national security. Additionally, Clinton's comments for impeachment came after a flood of Democrats, some of whom had previously held out against impeachment, joined the effort. Trump tweeted after Pelosi’s announcement that the inquiry was “presidential harassment” and a “total witch hunt.” Trump and his personal attorney Rudy Giuliani have pushed claims for months that Biden as vice president sought the ouster in 2016 of Ukraine’s then-prosecutor general Viktor Shokin to stop an investigation into Burisma Group, a Ukrainian energy company where his son Hunter served on the board of directors. The push by the vice president came alongside calls for Ukraine to get rid of Shokin from European diplomats and the U.S. State Department because international leaders said Shokin did too little to fight corruption in the Eastern European country. The Ukrainian Parliament voted Shokin out. Ukrainian officials have found no evidence of wrongdoing by Biden or his son. Contributing: Bart Jansen and Christal Hayes",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Hillary Clinton says ‘gutsiest' personal thing she ever did was stay in her marriage",
      "url": "https://www.usatoday.com/story/news/politics/2019/10/01/hillary-clinton-gutsiet-thing-ive-ever-done-stay-my-marriage/3835228002/",
      "subtitle": "Hillary Clinton says ‘gutsiest' personal thing she ever did was stay in her marriage",
      "author": "Savannah Behrmann",
      "content": "WASHINGTON — Former Secretary of State and presidential candidate Hillary Clinton said Tuesday that the “gutsiest” personal thing she's ever done was \"stay in my marriage.\" The frank comments from Clinton came as she and her daughter, Chelsea, appeared on ABC’s “Good Morning America” to promote their new book, “The Book of Gutsy Women.” At the end of the joint interview, host Amy Robach asked Clinton “what's the gutsiest thing you've ever done?\" “Ah, boy, I think the gutsiest thing I've ever done — well, personally, make the decision to stay in my marriage,” Clinton answered. “Publicly, politically, run for president. And keep going. Just get up every day and keep going.” The former First Lady, who was the 2016 Democratic presidential nominee, has been married to former President Bill Clinton for more than 40 years. While Bill Clinton was president, he engaged in a sexual relationship with White House intern Monica Lewinsky and was eventually impeached for perjury and obstruction of justice in the wake of the extramarital affair. However, the Senate acquitted him of both charges, and Clinton went on to serve the remainder of his second term in office. Chelsea Clinton, when asked the same question after her mother, said she was “overwhelmed by my mother's answer that I'm a bit out of words.” Clinton also told ABC that she had not been questioned in relation to recent reports that the Trump administration is investigating the email records of dozens of current and former State Department officials who sent emails to her private email address. “I think it's an unfortunate diversion,” Clinton said. “You go and you talk to people who've been experienced diplomats for many years, and then you retroactively classify what they said 10 years ago? I think it's really a shame that they're doing that, and hopefully people will not be distracted.” On Tuesday, Clinton also sarcastically responded to Rudy Guiliani, President Donald Trump’s personal lawyer, who invoked the Clinton Foundation while defending his involvement in the Ukraine controversy that has led to an impeachment inquiry into Trump. “WP [Washington Post], NBC, and CNN are going after me because I’m the messenger, and covering up the message, Dem corruption,” Giuliani tweeted. “Meanwhile, they have yet to ask Biden difficult questions because he is protected and immune like the Clintons and crooked Clinton Foundation!” Clinton quote-tweeted his statement and quipped, “Yes, I am famously under-scrutinized.”",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Hillary Clinton questions Pompeo's handling of Trump's Ukraine call and mocks Giuliani",
      "url": "https://www.usatoday.com/story/news/politics/2019/10/01/hillary-clinton-mike-pompeo-late-show/3828685002/",
      "subtitle": "Hillary Clinton questions Pompeo's handling of Trump's Ukraine call and mocks Giuliani",
      "author": "William Cummings",
      "content": "During an appearance on CBS' \"Late Show with Stephen Colbert\" on Monday, former Secretary of State Hillary Clinton took issue with his handling of the phone call between President Donald Trump and Ukrainian President Volodymyr Zelensky that helped prompt an impeachment inquiry. \"How many times, when you were secretary of state, did you have to say to Barack Obama, 'You can't extort foreign countries to get dirt on your political enemies'?\" Colbert jokingly asked Clinton. \"Yeah, that never happened,\" Clinton replied, laughing. \"The secretary of state's job is to make sure that he knows, number one, what the president is going to say on those calls,\" she said. \"These are usually highly prepared calls.\" According to media reports, Secretary of State Mike Pompeo was one of the officials who listened in on Trump's call in which the president asked Zelensky to investigate former Vice President Joe Biden and his son, Hunter Biden. \"If the secretary of state was on the call, as is now being reported, he should have been one of the very first people to just say, 'Wait a minute, we have to clean this up. You can't let that stand.'\" Clinton said. \"But we don't know what he did.\" Colbert asked how she would have reacted – when she was America's top diplomat – to the president sending out his personal attorney to \"handle foreign policy,\" a nod to Rudy Giuliani's admission that he contacted Ukrainian officials at the direction of the State Department. Pompeo:Democrats' impeachment inquiry an effort to 'intimidate, bully' State Dept. workers Full text:Read the summary of President Trump's call with Ukraine president about Biden \"Presidents often use – as do secretaries of state – they might use an envoy or a special adviser to deliver a message,\" she said. \"But again, it is supposed to be carefully thought through. And from what we’ve seen on television, carefully thinking through is not one of Rudy’s strong points.\" Clinton appeared on the \"Late Show\" with her daughter Chelsea Clinton to promote their new book, \"The Book of Gutsy Women: Favorite Stories of Courage and Resilience.\" Colbert warned that the book would have to be discussed later in the segment because it was \"Ukraine week\" and an impeachment inquiry was underway. \"Is it time to – dare I say – lock him up, lock him up?\"  Colbert asked, beginning to pump his fist. \"Lock him up,\" the crowd began to chant. 'This is a moment of reckoning':Hillary Clinton praises Pelosi for impeachment inquiry More:Calling Trump a 'corrupt human tornado,' Hillary Clinton backs impeachment Clinton said an impeachment inquiry to examine the evidence was \"exactly what should be done.\" She said this alleged abuse of power by Trump was resonating with voters. \"We've known for a long time that he was a corrupt businessman who cheated people. And we've known that he and his campaign asked for aid from Russia. We've known that,\" she said. \"But to see him in the office of the president, putting his own personal and political interests ahead of the national security of our country, just pierced through whatever confusion or denial people had.\" Poll:Support for Trump's impeachment over Ukraine jumps 8 points in one week More:Americans approve of impeachment probe by slim margin, split on removal from office",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Parents may not let you miss class, but Hillary Clinton will. 'Please excuse Grace'",
      "url": "https://www.usatoday.com/story/life/parenting/2019/10/03/hillary-clinton-writes-note-excusing-student-class-the-view/3851281002/",
      "subtitle": "Parents may not let you miss class, but Hillary Clinton will. 'Please excuse Grace'",
      "author": "Rasha Ali",
      "content": "A student was ready to risk it all to see Hillary Clinton live and in person. A young woman was in the audience during the former presidential candidate's appearance on \"The View\" and expressed that she was missing class to be there. Clinton decided to write her teacher a note excusing her absence. \"Please excuse Grace from missing class, she was at 'The View' with me,\" the former First Lady wrote on a blue note card and signed it. \"The View\" tweeted out a photo Thursday morning showing Grace smiling and holding the note alongside three of her friends. \"Nothing like getting a note to excuse you from class from @HillaryClinton!\" the tweet read. Opal Vadhan, one of Clinton's people, also tweeted out a photo of Clinton taking time to sign the note during a commercial break. Clinton appeared on \"The View\" on Wednesday with her daughter, Chelsea Clinton, to talk about Donald Trump's impeachment inquiry and their new book, \"The Book of Gutsy Women.\" The duo also visited \"Good Morning America\" on Tuesday to promote the book where Former Secretary of State Clinton said that the “gutsiest” personal thing she's ever done was \"stay in my marriage.\" Clinton added that publicly and politically, her presidential run took the most courage. \"And keep going. Just get up every day and keep going.” We're not sure if Grace's gutsy move will be approved by her teacher, but at least she got a pretty cool souvenir out of it. Contributing Savannah Behrmann​​​​​ READ MORE",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Tulsi Gabbard says she wants to defeat the 'Bush-Clinton doctrine' on foreign policy",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/10/30/tulsi-gabbard-wants-defeat-bush-clinton-doctrine-foreign-policy/4101086002/",
      "subtitle": "Tulsi Gabbard says she wants to defeat the 'Bush-Clinton doctrine' on foreign policy",
      "author": "Savannah Behrmann",
      "content": "WASHINGTON – Hawaii Congresswoman and 2020 Democratic hopeful Tulsi Gabbard wrote in a recent op-ed that she is “running for president to undo Mrs. Clinton’s failed legacy” on foreign policy by defeating the “Bush-Clinton doctrine.” She starts by writing, “Hillary Clinton emerged recently to claim, with no basis in fact, that I am being ‘groomed’ by the Russian government to undermine America.” Gabbard is referencing comments from Clinton that were initially erroneously reported as her saying Russians appeared to be \"grooming\" a Democratic candidate. Clinton actually suggested it was the Republicans who were \"grooming\" Gabbard. Gabbard has continued to run with the statement and has used it as a way to rally supporters. She is now one poll away from qualifying for the November debate after polling at 4% in a recent national USA TODAY/Suffolk University Poll. “This isn’t a petty ‘spat’ between Mrs. Clinton and me,” Gabbard said in the Wall Street Journal op-ed. “It’s a serious contrast in views about the choice voters face as they decide which Democratic candidate is best equipped to defeat President Trump. Mrs. Clinton already lost to Mr. Trump once. Why would Democrats think a Hillary 2.0 candidate would result in anything different?” Gabbard writes that she is not an “isolationist” by wanting to withdraw America from global conflict, writing she would stop \"trying to police the world,\" \"overthrowing governments,\" and ending \"the new Cold War and nuclear arms race.\" She reiterated that, “Those who follow the Bush-Clinton doctrine believe the only way to interact with other nations is by bombing them or starving them with draconian sanctions.” Some of Gabbard's foreign policy views have raised eyebrows during her run for president. After the August debate, Sen. Kamala Harris, who is also vying for the Democratic nomination, called Gabbard a Bashar al-Assad \"apologist\" and that she \"can only take what (Gabbard) says in her opinion so seriously.\" During a January 2017 trip to Syria, Gabbard met with Assad, the President of Syria. She said in February that \"Assad is not the enemy of the United States because Syria does not pose a direct threat to the United States.\" She also opposed President Barack Obama's request to use military force in response to Assad's use of chemical weapons against his people in 2013. Gabbard recently wrote of Clinton, \"From Iraq to Libya to Syria, her record is replete with foreign-policy catastrophes.\" \"Only when we recognize the failings of the past — embodied by Mrs. Clinton and her minions in the media — can we move forward to a future of peace, dignity, transparency and aloha,\" she concluded. Contributing: Rebecca Morin, Nicholas Wu",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "'This is a moment of reckoning': Hillary Clinton praises Pelosi for impeachment inquiry",
      "url": "https://www.usatoday.com/story/news/politics/2019/09/27/hillary-clinton-praises-nancy-pelosi-impeachment-inquiry/3785377002/",
      "subtitle": "'This is a moment of reckoning': Hillary Clinton praises Pelosi for impeachment inquiry",
      "author": "Rebecca Morin",
      "content": "WASHINGTON – Former Secretary of State Hillary Clinton praised Nancy Pelosi Thursday for opening an impeachment inquiry into President Donald Trump after he urged the Ukraine president to investigate Democratic presidential candidate Joe Biden over Biden's son's connections to a Ukrainian gas company. Clinton, who was Trump's Democratic presidential opponent in 2016, said Thursday evening that Pelosi is not making a \"political statement\" and is instead confronting a \"harsh reality.\" \"This is a moment of reckoning, a historic moment, and I'm very grateful to Speaker Pelosi for her leadership,\" Clinton said Thursday during a speech at the NARAL Pro-Choice America 50th anniversary dinner. Clinton was receiving NARAL's Lifetime Achievement Award. More:As whistleblower report on Trump and Ukraine reverberates through Washington, scandal will test Pence Pelosi opened an impeachment inquiry into Trump's actions during a July phone call with Ukraine President Volodymyr Zelensky. A whistleblower issued a complaint on the phone call, expressing concern that Trump \"used the power of his office\" to solicit foreign help to discredit Biden during his call with the Ukrainian president. Since Pelosi's announcement, Clinton has said she is in favor of impeachment. Clinton said Thursday that Pelosi has \"addressed the question of impeachment is exactly in line with what a sobering decision she had to make.\" \"This occupant of the Oval Office poses a clear and present danger to our future, to our democracy,\" Clinton said. Clinton continued criticize Trump during her remarks, saying that \"we have known who Donald Trump is for some time now.\" \"We knew he was a corrupt businessman who cheated people,\" she said. \"We knew that his campaign invited foreign adversaries to tamper with our elections. And now we know that in the course of his duties as our president, he's endangered us all by putting his personal and political interests ahead of the interests of the American people.\" 'Almost a spy':Donald Trump suggests whistleblower source committed treason as Ukraine firestorm builds Trump has in the past criticized Clinton, often referring to her as \"Crooked Hillary.\" Clinton also warned that \"there's so much more at stake\" for this impeachment inquiry than just Trump's call with Zelensky. \"We are living through a crisis in our democracy,\" she concluded.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Donald Trump to Hillary Clinton: Run for president again! Clinton to Trump: Do your job!",
      "url": "https://www.usatoday.com/story/news/politics/2019/10/08/donald-trump-hillary-clinton-run-again-she-replies-do-your-job/3907084002/",
      "subtitle": "Donald Trump to Hillary Clinton: Run for president again! Clinton to Trump: Do your job!",
      "author": "David Jackson",
      "content": "WASHINGTON – Engaging in a favorite pastime, President Donald Trump taunted Hillary Clinton and the 2020 Democratic candidates on Tuesday by saying she should run for the White House again – only to have Clinton taunt back. \"Don’t tempt me,\" she tweeted at Trump. \"Do your job.\" She was responding to an earlier post in which Trump said: \"I think that Crooked Hillary Clinton should enter the race to try and steal it away from Uber Left Elizabeth Warren.\" He also listed one \"condition\" of her renewed candidacy, saying Clinton should disclose the reason she deleted emails from her time as secretary of State for President Barack Obama. Clinton responded a few hours later with her own taunting tweet. Trump's hit came as he as under impeachment investigation for asking Ukraine's president to investigate another Democratic presidential candidate, former Vice President Joe Biden.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Chelsea Clinton won't say how she felt that election night. But she was busy being a mom",
      "url": "https://www.usatoday.com/story/life/parenting/2019/10/29/chelsea-clinton-busy-pumping-kids-election-night-hilary-clinton-lost/2497519001/",
      "subtitle": "Chelsea Clinton won't say how she felt that election night. But she was busy being a mom",
      "author": "Rasha Ali",
      "content": "Just because your mom is running for president of the United States, doesn't mean your own motherly duties stop. In Chelsea Clinton's interview with The Cut, Jonathan Van Meter makes it a point to share that the only child of Bill and Hillary Clinton mostly avoids answering questions related to how she felt on the election night when her mom lost to Donald Trump. But she does share what she was doing on Nov. 8 in 2016: She was busy being a mom. Clinton, who has two kids and gave birth to her third child this summer, revealed that she was mostly pumping and breastfeeding that day. \"I was still breastfeeding. Aidan was not even 5 months old. We went and we voted, and then I spent time with our kids and spent a lot of time breastfeeding and pumping, because that’s what women do when we’re committed to having that relationship with our babies,\" Clinton said. Gutsy Women:Hillary Clinton says ‘gutsiest' personal thing she ever did was stay in her marriage Breastfeeding:'Real Housewives' alum Ashley Darby 'heartbroken' by low rate of black mothers breastfeeding Clinton's response to what happened on election night mostly revolved around her children and motherhood. \"Then I took my kids to the hotel and we’re with my parents and we got the kids ready for bed and then I think my friend Jen actually, literally brought the kids home and helped get them to bed,\" she said. \"We were with my mom, and I pumped a lot on and off for the rest of the night.” When it comes to politics, Clinton doesn't shy away from talking to her kids about current issues. Her chief of staff, Bari Lurie, said that Clinton will have a conversation about family border separation with her 5-year-old daughter, Charlotte Clinton Mezvinsky. \"I walk into her apartment at 7:30 in the morning and she is teaching her daughter about how unfair and unjust it is,\" Lurie said. \"Don’t get me wrong; there’s also a debate about last night’s episode of The Voice. It can be puzzling to others, but to those who know her best, it is one of the most endearing things about Chelsea.\" Follow the latest from USA TODAY Parenting at usatoday.com/life/parenting.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Hillary Clinton says Duchess Meghan's race is 'certainly part of' media's treatment of her",
      "url": "https://www.usatoday.com/story/entertainment/celebrities/2019/10/14/hillary-clinton-says-race-part-medias-coverage-meghan-markle/3973203002/",
      "subtitle": "Hillary Clinton says Duchess Meghan's race is 'certainly part of' media's treatment of her",
      "author": "Rasha Ali",
      "content": "Hillary Clinton is not fond of the way the British media has treated Duchess Meghan of Sussex. In an interview with The Sunday Times the former Secretary of State was asked about Prince Harry's decision to sue media outlets for their \"relentless\" and \"malicious\" coverage of his wife. \"I do want to say that the way she’s been treated is inexplicable,\" Clinton told the outlet. The former presidential candidate was asked if she believed race was a factor in the media's portrayal. \"It’s certainly part of it... Well, I think if the explanation is that she’s biracial, then shame on everybody,\" Clinton said. Chelsea Clinton, who was also interviewed, noted that the media's treatment of the former Meghan Markle is probably due to her advocacy work and willingness to break the mold of what a royal is expected to be like. \"She proudly had a career first and has a voice that she thankfully continues to use,\" Clinton said. \" Anyone who has the temerity to break the mold of what has previously been established and expected often, unfortunately, receives criticism and bile that I don't understand. We've seen this pattern repeatedly.\" Chelsea Clinton added that while she doesn't personally know Meghan, she respects her. \"I’m so grateful that she persists, and is unbowed, and is doing work she feels called to do,\" she said. \"And isn’t willing to be bullied.\" Earlier this month, Prince Harry issued an open letter denouncing the coverage of his wife. \"Unfortunately, my wife has become one of the latest victims of a British tabloid press that wages campaigns against individuals with no thought to the consequences – a ruthless campaign that has escalated over the past year, throughout her pregnancy and while raising our newborn son,\" he wrote in a statement. The royal, 35, continued: \"I have been a silent witness to her private suffering for too long. To stand back and do nothing would be contrary to everything we believe in.\" Harry compared the media treatment of Meghan to that of his late mother, Princess Diana, who died in a car crash in Paris in 1997 while evading paparazzi. \"My deepest fear is history repeating itself,\" he wrote. \"I’ve seen what happens when someone I love is commoditised to the point that they are no longer treated or seen as a real person. I lost my mother and now I watch my wife falling victim to the same powerful forces.\" Contributing: Cydney Henderson",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "U.S. Rep. Tulsi Gabbard says Hillary Clinton 'knows she can't control me'",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/10/19/tulsi-gabbard-hillary-clinton-russia-claims-iowa-city-tailgate-election-2020/4037543002/",
      "subtitle": "U.S. Rep. Tulsi Gabbard says Hillary Clinton 'knows she can't control me'",
      "author": "Robin Opsahl",
      "content": "As U.S. Rep. Tulsi Gabbard walked around tailgate parties for Homecoming weekend at the University of Iowa, one man gave her a Hawkeyes-themed Russian cossack hat. Another shouted \"screw Hillary!\" as Gabbard drove from party-to-party on a golf cart. Some Iowans showed their support for Gabbard after former Secretary of State Hillary Clinton suggested that Russians are \"grooming\" a Democratic presidential candidate to run as a third-party candidate Friday. While Clinton did not name Gabbard, the comment appeared to be directed at the Democrat from Hawaii. On Saturday, Gabbard said the past 24 hours had \"a lot of news,\" but it brought to the forefront the reasons why she believes her campaign is important: it threatens the party's establishment. More:Tulsi Gabbard fires back at Hillary Clinton suggestion that she's Russia's pawn Gabbard has said multiple times she is not considering a third-party run, both before and after Clinton's statement. \"She knows she can't control me,\" Gabbard told the Des Moines Register on Saturday. \"She knows that if I'm the nominee, if I become president, she can't have any influence or any control over the kind of foreign policy I would lead our country in. Both her and her proxies and the foreign policy establishment.\" Gabbard said Clinton was the \"queen of warmongers\" on Twitter Friday in response to her comments. Despite the back-and-forth between Gabbard and Clinton, Gabbard was met with good cheer by Hawkeyes fans Saturday morning. A group of people at a tiki bar tailgate drank a round of Fireball whiskey shots in her honor, shouting \"Tulsi time!\" as she mingled with the crowd. Maria Frazer, a 21-year-old University of Iowa student, is still deciding who she wants to support in the Iowa caucus. She's heard allegations about Gabbard's ties with Russia, but while she doesn't \"necessarily buy into it,\" Frazer said Americans should be wary of foreign governments' influence in the presidential election. \"I am concerned, not necessarily about Tulsi,\" she said. \"But it's something I'm very cautious about. I think we need to be cautious about in the future.\" Chris Forbes, a 52-year-old man in Iowa City, gave Gabbard a Twinkie as they talked politics. He already committed to caucus for U.S. Sen. Kamala Harris, but said it's important for foreign policy to take a bigger role in the presidential election — something Gabbard brings. He doesn't agree entirely with Gabbard's positions. Forbes said the U.S. military should still play some role in foreign conflicts, especially in cases when allies are at risk, like the Kurds in northern Syria following President Donald Trump's decision to leave the region. \"I agree that steps should be made to pull away from some of the actions of being the world's policemen,\" Forbes said. \"But I also believe the standard of American democracy for 240 years has been to be a beacon of freedom for the rest of the world. And as such, we need to have just enough present to represent that freedom and world leadership toward democracy so that all groups can feel safe in being free to stand openly for what they believe.\" Gabbard said Clinton and other Democrats accusing her of being a \"Russian asset\" is a strategy to stop Americans from criticizing U.S. foreign policy decisions. \"This threatens our freedom of speech and is very revealing about the real motives behind this smear campaign that literally began the day I announced my candidacy for president,\" Gabbard said. Robin Opsahl covers political trends for the Register. Reach them at ropsahl@registermedia.com or 515-284-8051. Support reporters who follow your government by becoming a subscriber. Sign up at DesMoinesRegister.com/Deal.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "'You cannot make up my life': Hillary Clinton's ties to impeachment inquiries against three presidents",
      "url": "https://www.usatoday.com/story/news/politics/2019/10/26/impeachment-hillary-clinton-memo-nixon-trump/4082889002/",
      "subtitle": "'You cannot make up my life': Hillary Clinton's ties to impeachment inquiries against three presidents",
      "author": "Michael Collins",
      "content": "WASHINGTON – Richard Nixon nearly got impeached. Bill Clinton did. And Donald Trump could be next. A common thread running through all three imperiled presidencies? Hillary Clinton. In the 243-year history of the republic, just four U.S. presidents have faced impeachment inquiries. In a bizarre plot twist that reads like bad fiction, Clinton – a former first lady, senator, secretary of State and almost-president – is connected to three of them. “You cannot make my life up. Really,” Clinton joked recently with television host Stephen Colbert about her strange ties to the impeachment cases against the 37th, 42nd and 45th presidents. Clinton was still known as Hillary Rodham when, fresh out of Yale Law School, she was hired by the House Judiciary Committee to work on the impeachment case against Nixon during the Watergate scandal. The memo they produced is an official government document and is still relevant today in large part because it helps define what is considered an impeachable offense. Two decades later, Clinton was America’s first lady, literally standing by her man, President Bill Clinton, in the White House Rose Garden, nodding her head in agreement as he decried “the poisonous venom of excessive partisanship” following his impeachment in 1998. Two decades after that, Hillary Clinton would run for president herself and win the popular vote but lose the Electoral College – and the presidency – to Trump, who is now facing an impeachment inquiry amid accusations that he pressured a foreign power to investigate a political adversary, former Vice President Joe Biden. Impeaching Trump:Republicans condemn impeachment proceedings in resolution Clinton’s office declined to comment for this article. But Frank Bowman, a law professor at the University of Missouri and the author of a book on presidential impeachment, described Clinton’s connection to impeachment proceedings against three presidents as “an odd coincidence” and “a testament to Hillary Clinton’s longevity as part of the national political life.” “She’s a part of (the impeachment story),” Bowman said, “but that’s because she has been a part of the national story for so long.” Before Watergate in the early 1970s – a scandal that would eventually end Nixon's presidency – no American president had faced impeachment since Andrew Johnson a century earlier. Amid Watergate, with impeachment no longer a constitutional relic but a real possibility, the House Judiciary Committee tapped Clinton and a bipartisan team of young staffers to research the history of impeachment and explore possible grounds for impeaching Nixon. “The staff and members of the House understood that considering the impeachment of a president is a very big thing, and they wanted to make sure they understood the history and the law,” said Michael Gerhardt, a University of North Carolina law professor and expert on impeachment. Clinton and others on the bipartisan team produced a 64-page memo detailing the origins of impeachment dating to the British Parliament more than 400 years ago and the constitutional grounds that would be needed to impeach an American president. Among their conclusions: Criminal conduct is not needed to satisfy the definition of “high crimes and misdemeanors,” one of the thresholds the U.S. Constitution spells out for impeachment of a public officeholder. The 1974 memo “is a tremendous piece of work,” Bowman said. “I don’t know how much contribution Secretary Clinton had to that work, but given its length, I think it really covers the ground nicely. And I very much agree with almost all of its conclusions, particularly its conclusion about the kinds of things that are impeachable.” The memo, an official government document, served as something akin to a road map for lawmakers as they embarked on the impeachment of Nixon. Over the course of four days in late July 1974, the House Judiciary Committee debated five articles of impeachment against Nixon and eventually approved three, accusing him of obstruction of justice, abuse of power and contempt of Congress. A week later, Nixon resigned before the full House voted on the articles of impeachment. Impeachment history:The times an American president was impeached (and the one time it came close) The memo that Clinton and her colleagues wrote was largely forgotten until 1998, when Bill Clinton’s presidency was put in jeopardy by his extramarital affair with White House intern Monica Lewinsky. House Republicans dusted off and pored over the document as they began to contemplate articles of impeachment against the husband of an author of the memo. “People paid a lot of attention to it – partly because it was substantive and partly because of the irony,” said Gerhardt, who himself cited the memo when he testified before a House committee contemplating Bill Clinton’s impeachment. Then-Rep. Bob Barr, a Georgia Republican who was one of the most vocal proponents of impeaching Bill Clinton, even used the memo to taunt the president’s wife. In a Wall Street Journal op-ed addressed to “Dear Mrs. Clinton,” Barr wrote that when he first raised the notion of impeaching her husband, “little did I realize your scholarly work 23 years ago would provide clear historical and legal basis and precedent for my proposition.” “I presume – but I must ask whether – you stand by your research and analysis today,” Barr wrote before concluding with a caustic zinger: “Thank you, Mrs. Clinton, for giving Congress a road map for beginning our inquiry.” On Dec. 19, 1998, Bill Clinton became the second American president to be impeached when the House, voting mostly along party lines, approved two articles of impeachment accusing him of perjury to a grand jury and obstruction of justice. The Senate acquitted him of both charges the following January. Mea culpa:After slamming Trump for 'lynching' tweet, Biden apologizes for using the term Hillary Clinton would go on to be elected U.S. senator from New York, serve as secretary of State under Barack Obama and lose her own bid for the presidency to Trump, who is now the subject of an impeachment inquiry led by House Democrats. And once again, Clinton figures into the impeachment discussions. Drawing on her own experience, Clinton has said in recent interviews that House Democrats had no choice but to open an impeachment inquiry against Trump following a whistleblower’s claims that Trump pressured Ukraine President Volodymyr Zelensky to investigate Biden and Biden’s son, Hunter Biden, who served on the board of a Ukrainian energy company. Clinton “has incredible insight to the impeachment process both personally and professionally,” said author Amie Parnes, who has written a pair of books on Clinton’s two unsuccessful campaigns for president. “She’s seen what goes into an (impeachment) inquiry and also on the flip side, in her husband’s case, how it can weigh on the president facing impeachment and, even in her case, how it impacts the president’s family,” Parnes said. “And I think that’s why you’ve seen her really wrestle with the implications of impeachment even against someone like her former opponent President Trump.\" Clinton vs. Trump:Calling Trump a 'corrupt human tornado,' Hillary Clinton backs impeachment A couple of months ago, Parnes said, Clinton talked about how impeachment shouldn’t be used for “trivial political” purposes. “But I think, as with many Democrats, her views solidified with the whistleblower on the Ukraine call,” Parnes said. “I think for her this was a 'break glass for emergency' moment, even if some say she’s almost too close to it.” Clinton’s impeachment memo has held up well over the years and could again serve as an important resource for lawmakers as they contemplate whether to file formal impeachment charges against Trump, Gerhardt said. “I don’t think they are going to have to go back and reinvent the wheel,” he said. “This (memo) is sort of a good foundation, and my guess is the staffers have read it and it will be helpful to the current members.” The prospect that Clinton’s memo could help bring down the man who dashed her own presidential ambitions is “the ultimate irony for Secretary Clinton,” Parnes said, “and in some ways, the ultimate vindication for her.” “If she only knew then what she knows now.\" Perilous times for Trump:By 45%-38%, Americans support impeachment over Ukraine allegations, poll finds",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Tulsi Gabbard fires back at Hillary Clinton suggestion that she's Russia's pawn",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/10/18/tulsi-gabbard-fires-back-hillary-clinton-suggestion-shes-russia-pawn/4027196002/",
      "subtitle": "Tulsi Gabbard fires back at Hillary Clinton suggestion that she's Russia's pawn",
      "author": "null",
      "content": "Clarifications and corrections: In a story Oct. 18 about Tulsi Gabbard and Hillary Clinton, The Associated Press reported erroneously that Hillary Clinton said she believes the Russians have “got their eye on somebody who’s currently in the Democratic primary and grooming her to be the third-party candidate.” She was referring to Republicans, not Russians, according to an aide. MANCHESTER, N.H.  — MANCHESTER, N.H. (AP) — It’s Hillary Clinton vs. Tulsi Gabbard on the sidelines of the 2020 presidential race. The Hawaii congresswoman fought back unsparingly after Clinton appeared to call her “the favorite of the Russians” in a recent interview and said she believes Republicans have “got their eye on somebody who’s currently in the Democratic primary and are grooming her to be the third-party candidate.” Clinton, the former senator, U.S. secretary of state and 2016 Democratic presidential candidate, did not name Gabbard directly. In a series of tweets Friday, Gabbard called Clinton the “personification of the rot that has sickened the Democratic Party for so long.” Gabbard also alleged there has been a “concerted campaign” to destroy her reputation since she announced her presidential run in January. “It’s now clear that this primary is between you and me,” Gabbard tweeted about Clinton. “Don’t cowardly hide behind your proxies. Join the race directly.” More:Mueller sounded an alarm on Russian meddling in the 2020 election. Here is what happened last time There is lingering trepidation in the Democratic Party of a repeat of the 2016 presidential race, when Russia interfered in the U.S. election in an effort to help Donald Trump defeat Clinton. U.S intelligence agencies have warned that Russia intends to meddle in the 2020 presidential election, as well. Russian President Vladimir Putin has mocked that possibility, joking earlier this month that Moscow would “definitely intervene” again. During a Democratic presidential debate on Tuesday, Gabbard criticized a TV commentator who she said had called her “an asset of Russia.” She called the comments “completely despicable.” Without naming Gabbard, Clinton seemed to echo the commentator’s remark during a podcast appearance this week on “Campaign HQ with David Plouffe.” Plouffe was campaign manager for President Barack Obama in 2008 and served as a senior adviser to the president. “She’s the favorite of the Russians,” Clinton said, referring to the person she had earlier identified as a woman “who’s currently in the Democratic primary.” ″They have a bunch of sites and bots and other ways of supporting her so far.” Clinton also called Trump “Vladimir Putin’s dream” in the interview. She went on to say that Trump’s inauguration speech was “like a declaration of war on half of America.” Clinton also describes 2016 Green Party presidential candidate Jill Stein as “a Russian asset.” The Russians know they can’t win without a third-party candidate, Clinton added. Gabbard said later Friday on CBSN that she “will not be leaving the Democratic Party. I will not be running as an independent or a third-party candidate.” Stein, who ran against Trump and Clinton as a Green Party candidate, received about 1% of the vote in the 2016 election, but some Democrats said her candidacy siphoned votes away from Clinton and helped Trump win, particularly in states like Wisconsin. The Senate Intelligence Committee asked Stein for documents as part of its probe into Russian interference in the election because she attended a 2015 dinner in Moscow sponsored by Russian television network RT with Putin. Stein has said she attended “with a message of Middle East peace, diplomacy and cooperation.” In a tweet Friday, Stein accused Clinton of “peddling conspiracy theories to justify her failure instead of reflecting on real reasons Dems lost in 2016.”",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "38 people cited for violations in Hillary Clinton email probe",
      "url": "https://www.usatoday.com/story/news/politics/2019/10/18/hillary-clinton-email-probe-people-cited-but-no-evidence-deliberate-mishandling/4027787002/",
      "subtitle": "38 people cited for violations in Hillary Clinton email probe",
      "author": "null",
      "content": "WASHINGTON — The State Department has completed its internal investigation into former Secretary of State Hillary Clinton's use of private email and found violations by 38 people, some of whom may face disciplinary action. The investigation, launched more than three years ago, determined that those 38 people were \"culpable\" in 91 cases of sending classified information that ended up in Clinton's personal email, according to a letter sent to Republican Sen. Chuck Grassley this week and released on Friday. The 38 are current and former State Department officials but were not identified. Although the report identified violations, it said investigators had found \"no persuasive evidence of systemic, deliberate mishandling of classified information.\" However, it also made clear that Clinton's use of the private email had increased the vulnerability of classified information. The Associated Press sent an email seeking comment to a Clinton representative. More:Fact check: 12 questions and answers about Hillary Clinton’s emails The investigation covered 33,000 emails that Clinton turned over for review after her use of the private email account became public. The department said it found a total of 588 violations involving information then or now deemed to be classified but could not assign fault in 497 cases. For current and former officials, culpability means the violations will be noted in their files and will be considered when they apply for or go to renew security clearances. For current officials, there could also be some kind of disciplinary action. But it was not immediately clear what that would be. The report concluded \"that the use of a private email system to conduct official business added an increased degree of risk of compromise as a private system lacks the network monitoring and intrusion detection capabilities of State Department networks.\" The department began the review in 2016 after declaring 22 emails from Clinton's private server to be \"top secret.\" Clinton was then running for president against Donald Trump, and Trump made the server a major focus of his campaign. Then-FBI Director James Comey held a news conference that year in which he criticized Clinton as \"extremely careless\" in her use of the private email server as secretary of state but said the FBI would not recommend charges. The Justice Department's inspector general said FBI specialists did not find evidence that the server had been hacked, with one forensics agent saying he felt \"fairly confident that there wasn't an intrusion.\" Grassley started investigating Clinton's email server in 2017, when he was chairman of the Senate Judiciary Committee. The Iowa Republican has been critical of Clinton's handling of classified information and urged administrative sanctions.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Barack Obama, Bill and Hillary Clinton to attend Elijah Cummings' Baltimore funeral",
      "url": "https://www.usatoday.com/story/news/politics/2019/10/24/elijah-cummings-funeral-barack-obama-and-hillary-clinton-speak/4081679002/",
      "subtitle": "Barack Obama, Bill and Hillary Clinton to attend Elijah Cummings' Baltimore funeral",
      "author": "William Cummings",
      "content": "Former Presidents Barack Obama and Bill Clinton, and former Secretary of State Hillary Clinton will attend Rep. Elijah Cummings' funeral in Baltimore on Friday as the nation bids farewell to the Maryland Democrat who served on Capitol Hill 23 years. Spokeswoman Katie Hill confirmed that Obama would attend in a tweet Wednesday night. She said Cummings’ widow, Maya Rockeymoore Cummings, asked Obama to \"deliver remarks about the remarkable life and legacy of one of this country’s finest public servants.\" Cummings, 68,  died last week of complications related to longstanding health issues. He had previously been treated for heart and knee issues, according to The Associated Press and had cancer, The Baltimore Sun reported. \"Michelle and I are heartbroken over the passing of our friend, Elijah Cummings,\" Obama said in a statement after the congressman's death. \"As Chairman of the House Oversight Committee, he showed us all not only the importance of checks and balances within our democracy, but also the necessity of good people stewarding it.\" Cummings was a personal friend of Obama's and was an early supporter of his 2008 presidential run. 'Enough is enough':The moments that defined the career of Rep. Elijah Cummings More:Elijah Cummings to lie in state at US Capitol Thursday The funeral will be held at the New Psalmist Baptist Church, where Cummings worshiped for nearly 40 years. In addition to Obama and Hillary Clinton, House Speaker Nancy Pelosi, D-Calif., and former Rep. Kweisi Mfume will join Rockeymoore Cummings, Cummings' brother and his daughters as speakers at the funeral, according to Reuters and The Washington Post. Cummings won Mfume's House seat in a special election in 1996 after Mfume left Congress to become president of the National Association for the Advancement of Colored People. Last week, Bill Clinton said Cummings \"was a resounding voice of moral courage who fought the good fights for the people of Baltimore.\" Hillary Clinton said Cummings was \"a man of principle who championed truth, justice and kindness. He fiercely loved his country and the people he served.\" The former House Oversight and Reform Committee Chairman will lie in state in the U.S. Capitol on Thursday. On Wednesday, mourners paid respects to Cummings as his body lay in repose at Morgan State University, a historically black college in Cummings' district. Cummings served on the school's Board of Regents for 19 years. More:How Elijah Cummings' unexpected death could affect the impeachment inquiry Contributing: The Associated Press",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "What's the dispute between Hillary Clinton and Tulsi Gabbard about?",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/10/24/what-feud-between-tulsi-gabbard-and-hillary-clinton-about/4082268002/",
      "subtitle": "What's the dispute between Hillary Clinton and Tulsi Gabbard about?",
      "author": "Nicholas Wu",
      "content": "WASHINGTON – Hillary Clinton kicked off a political firestorm last week after making comments about Rep. Tulsi Gabbard's presidential campaign on an Oct. 17 podcast. Clinton's comments were initially erroneously reported as her saying Russians appeared to be \"grooming\" Gabbard, D-Hawaii, as a potential third-party presidential candidate. Clinton had actually suggested that it was the Republicans who were \"grooming\" Gabbard. Clinton had been speaking on Democratic strategist David Plouffe's podcast in a wide-ranging interview about President Donald Trump, impeachment, and the state of the 2020 Democratic primary. Several outlets picked up on the story, prompting a response from Gabbard on Twitter and elevating Gabbard to the forefront of a news cycle. The problem is, however, that much of the controversy comes from a misquote of Clinton's remarks. More:U.S. Rep. Tulsi Gabbard says Hillary Clinton 'knows she can't control me' Excerpts of Clinton's remarks started to go viral after the release of Plouffe's podcast, but it is important to put them in context since some of the initial reporting missed some crucial context around Clinton's remarks. In the podcast, Clinton had talked about how \"they've got their eye on somebody\" in the Democratic primary and are \"grooming her,\" followed by how \"she's the favorite of the Russians.\" Out of context, it would appear that Clinton was referring to Russians \"grooming\" a candidate. They're also going to do third party. I'm not making any predictions, but I think they've got their eye on somebody who's currently in the Democratic primary and are grooming her to be the third-party candidate. She's the favorite of the Russians, they have a bunch of sites and bots and other ways of supporting her so far, and that's assuming Jill Stein will give it up, which she might not, because she's also a Russian asset. Yeah, she's a Russian asset, I mean totally. They know they can't win without a third party candidate. However, in the section of the podcast before those remarks, Clinton had been discussing the Republican Party's attempts to defeat Democratic presidential candidates and her concerns that a third-party candidate would take away votes in close races from a Democratic candidate, as some Democrats believe Libertarian candidate Gary Johnson and Green party candidate Jill Stein did in 2016. On Oct. 18, as Clinton's misreported comments started to pick up traction, and several news outlets published stories on her remarks, Gabbard shot back on Twitter, calling Clinton the \"queen of warmongers, embodiment of corruption, and personification of the rot that has sickened the Democratic Party for so long.\" Democratic presidential candidate Andrew Yang defended Gabbard, saying she \"deserves more respect and thanks than this.\" Sen. Bernie Sanders, I-Vt, a Democratic presidential candidate, also defended Gabbard, tweeting that \"it is outrageous for anyone to suggest that Tulsi is a foreign asset.\" Sen. Cory Booker, D-N.J., responded to Gabbard's tweet with a meme of his face from the first Democratic presidential debate. About a week after the initial controversy, several news outlets corrected the reporting of Clinton's remarks, including the version from the Associated Press used by USA TODAY. Clinton spokesperson Nick Merrill highlighted The New York Times' correction and slammed the coverage of Clinton's remarks. \"I too am tired of talking about this, but let’s again set the record straight,\" Merrill wrote on Twitter, using HRC to refer to Clinton. \"HRC speculated that the only way the GOP is going to win in states where Trump can’t hit a 50% majority is to 1) Suppress the vote, as they do widely and routinely, & 2) Bank on the 3rd party spoiler.\" Merrill added that media reports showed Russian propaganda and disinformation networks being used to bolster Gabbard's candidacy. Gabbard, however, has continued her criticism of Clinton and has used it as a way to rally her supporters. In an Oct. 23 tweet, Gabbard told Clinton to \"acknowledge the damage you have caused and step down from your throne.\" Gabbard tweeted that quote along with a link to a website for supporters to add their names to a list criticizing Clinton.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "'Aliens have seized his brain': Hillary Clinton jokes about the change she has seen in Giuliani",
      "url": "https://www.usatoday.com/story/news/politics/2019/11/06/hillary-clinton-jokes-rudy-giulianis-brain-seized-aliens/2506511001/",
      "subtitle": "'Aliens have seized his brain': Hillary Clinton jokes about the change she has seen in Giuliani",
      "author": "William Cummings",
      "content": "WASHINGTON – The 2016 Democratic presidential nominee Hillary Clinton said Tuesday night that she did not understand the change she has seen in former New York Mayor Rudy Giuliani in recent years, joking that it seemed as if \"aliens had seized his brain.\" She made the comment after \"Late Late Show\" host James Corden asked Clinton if she had been surprised by Giuliani's behavior. \"Totally,\" she said, laughing. \"He was mayor during 9/11. I was a senator, I worked with him, and I don't know what happened. It's almost like aliens have seized his brain.\" She said Giuliani, who is acting as President Donald Trump's personal attorney, \"has been saying things that were demonstrably untrue.\" 'America's mayor' to Trump's pit bull:Rudy Giuliani emerges as central figure in Ukraine firestorm Is he a 'foreign agent'?:Trump-Ukraine scandal puts spotlight on Rudy Giuliani's business ties Clinton cited his claim that he never saw her at ground zero after the Sept. 11, 2001 terrorists attacks, despite photographs of the two of them together at the site the day after the terrorist attacks that toppled the World Trade Center. After that incident, Clinton said she remembered thinking, \"truly he's been possessed.\" \"I don't understand when it happened but it is a very clear case of a man who has gone over the edge – probably pushed,\" she said. \"We need an exorcism,\" suggested Chelsea Clinton, who appeared with her mother on the CBS late-night talk show. Giuliani has been at the center of the impeachment inquiry into allegations that Trump pressured Ukraine into opening a pair of investigations, one of them into former Vice President Joe Biden. Democrats say Giuliani was conducting a \"shadow foreign policy\" in Ukraine to carry out the president's wishes. The former New York City mayor has made several animated media appearances in defense of Trump since the president took office. Some of his statements, such as his declaration that \"truth isn't truth\" were widely lampooned and in other instances, he has appeared to reveal more than he intended, such as when he said Trump had used his own money ahead of the 2016 election to buy the silence of a woman alleging an affair with the former reality TV star. 'Truth isn't truth':Trump lawyer Rudy Giuliani worries Mueller interview could lead to perjury charge More:Rudy Giuliani accuses Twitter of anti-Trump conspiracy, editing his tweet to add typo More:Rudy Giuliani says Trump is 'honest' because facts are 'in the eye of the beholder'",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Hillary Clinton shares most mischievous thing Chelsea did while growing up in the White House",
      "url": "https://www.usatoday.com/story/entertainment/celebrities/2019/11/06/hillary-clinton-chelsea-rebelled-white-house-ordering-pizza/4175849002/",
      "subtitle": "Hillary Clinton shares most mischievous thing Chelsea did while growing up in the White House",
      "author": "Hannah Yasharoff",
      "content": "Hillary Clinton shared the most out-of-line thing daughter Chelsea Clinton did while growing up in the White House, but it may not resonate with many parents. Appearing Tuesday on \"The Late Late Show,\" Hillary and Chelsea were both asked by host James Corden about the \"most mischievous thing Chelsea did as a teenager in the White House.\" During President Bill Clinton's two terms in the '90s, Chelsea, now 39, moved into the Executive Residence at 12 and officially moved out at 20. Chelsea's answer? \"Nothing.\" \"I already know that's (expletive),\" Corden joked while reading over her shoulder. \"You did nothing mischievous?\" Chelsea responded with a smile: \"I was perfect, James.\" But the former first lady had a different recollection of her daughter's rebellious streak as a teen. \"My answer was 'order pizza,' \" Hillary said. \"Here's what I mean by that: When you're in the White House, you can't order pizza. And so when she would have friends over, they'd want to order pizza and it kept causing all kinds of commotion with the Secret Service. \"You'd get calls,\" she recalled. \"You know, 'There's a guy down here who says he's delivering pizza to the White House.' We'd say, 'No, no, that – no!' \" \"Well, yeah. Yeah, they did, they ordered pizza,\" Hillary concluded. Chelsea Clinton won't say how she felt that election night. But she was busy being a mom Hillary Clinton says Duchess Meghan's race is 'certainly part of' media's treatment of her",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Tulsi Gabbard's lawyers sent a letter to Hillary Clinton demanding she retract Russia comments",
      "url": "https://www.usatoday.com/story/news/politics/2019/11/12/tulsi-gabbards-lawyers-demand-hillary-clinton-retract-russia-remarks/2581635001/",
      "subtitle": "Tulsi Gabbard's lawyers sent a letter to Hillary Clinton demanding she retract Russia comments",
      "author": "Jeanine Santucci",
      "content": "In the latest development of the feud between Rep. Tulsi Gabbard and 2016 Democratic nominee Hillary Clinton, lawyers for the Hawaii congresswoman sent a letter to Clinton demanding a retraction of comments alleging Gabbard is a \"favorite of the Russians.\" A political firestorm was set off after Clinton's remarks, made during an October podcast interview, that triggered a bipartisan outpouring of support and defense of Gabbard, from President Donald Trump to 2020 Democratic rival Sen. Bernie Sanders. \"Your statement is defamatory, and we demand that you retract it immediately,\" the lawyers wrote, adding that the retraction should be done at a press conference as well as in writing on social media and in the press. Explainer:What's the dispute between Hillary Clinton and Tulsi Gabbard about? Gabbard initially hit back at Clinton on social media and in media interviews, calling the former secretary of state the \"queen of warmongers.\" Gabbard has continued to rally her supporters with her criticism of Clinton. \"The statement is false. Congresswoman Gabbard is not being groomed by Russia to be a third-party candidate. Nor is she a Russian asset. Rather, she is a patriotic loyal American, a sitting four-term United States Congresswoman and a Major in the United States Army National Guard,\" the letter reads. Excerpts of Clinton's remarks started to go viral after the podcast's release but some of the initial reporting missed context around Clinton's remarks. It was later revealed by an aide that Clinton was referring to Republicans, not Russians, \"grooming\" Gabbard. Her remark that \"She's a favorite of the Russians\" stands. \"They're also going to do third party. I'm not making any predictions, but I think they've got their eye on somebody who's currently in the Democratic primary and are grooming her to be the third-party candidate. She's the favorite of the Russians, they have a bunch of sites and bots and other ways of supporting her so far, and that's assuming Jill Stein will give it up, which she might not, because she's also a Russian asset. Yeah, she's a Russian asset, I mean totally. They know they can't win without a third party candidate.\" \"It appears you may now be claiming that this statement is about Republicans (not Russians) grooming Gabbard,\" the letter says. \"But this makes no sense in light of what you actually said.\" The lawyers went on to say that the comments were understood by the public to mean that Gabbard is a \"Russian asset.\" They called Clinton's statement \"so facially improbable that it is actionable as defamation.\" Here is what the lawyers want Clinton to say publicly: \"On October 17, 2019, I made certain statements about Congresswoman Tulsi Gabbard. Among other things, I accused her of being a Russian asset and that Russia was grooming her to be a third-party presidential candidate. I was wrong. I never should have made these remarks, and I apologize. I did not have any basis for making the statements. I acknowledge my grave mistake and error in judgment in this matter. I support and admire the work that Congresswoman Gabbard has done and will continue to do in serving our country.\" Contributing: Nicholas Wu",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "'I never say never': Hillary Clinton refuses to close the door on a 2020 presidential run",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/11/13/hillary-clinton-2020-presidential-run-speculation/4176641002/",
      "subtitle": "'I never say never': Hillary Clinton refuses to close the door on a 2020 presidential run",
      "author": "William Cummings",
      "content": "Former Secretary of State Hillary Clinton refused to close the door on the possibility of entering the 2020 presidential race, telling an interviewer Tuesday, \"I never say never to anything.\" The 2016 Democratic presidential nominee was asked during a BBC Radio interview if she was \"100%\" certain she would not run again. Clinton replied that she thinks \"all the time about what kind of president I would have been, and what I would have done differently, and what I think it would have meant to our country and the world.\" \"So of course, I think about it. I think about it all the time,\" she said. When she was asked a second time if she was ruling out another run, Clinton again declined to explicitly say she would not do it. \"I will certainly tell you, I'm under enormous pressure from many, many, many people to think about it,\" she said. \"But as of this moment, sitting here in this studio talking to you, that is absolutely not in my plans.\" If Clinton does plan to enter the fray, time is not on her side as the filing deadlines have already passed in at least two states and others are fast approaching. And Clinton said Tuesday, \"it's way past time\" to get in the race. Trump vs. Clinton:Donald Trump to Hillary Clinton: Run for president again! Clinton to Trump: Do your job! Speculation about a 2020 rematch between Clinton and President Donald Trump, the man who defeated her in 2016, has swirled virtually since the moment the election results were announced three years ago. Though she declared in March that \"I'm not running,\" pundits began to rekindle the idea of a 2020 Clinton campaign after former New York City Mayor Michael Bloomberg's unexpected moves toward a late entry into the race. Former Massachusetts Gov. Duval Patrick is also said to be considering a last-minute run. Bloomberg is \"increasingly concerned that the current field of candidates is not well positioned\" to beat Trump, said his adviser Howard Wolfson. The New York Times reported Monday that wealthy Democratic donors have been hoping for fresh faces to enter the race amid concerns about fundraising totals and a lack of confidence in the strength of the leading candidates. Mark Penn, who was chief strategist for Clinton's 2008 presidential run, said Bloomberg's move could prod Clinton to consider a run and decide there's \"still a political logic there for her.\" Former Clinton adviser Philippe Reines said on Fox News last month that \"if she thought she had the best odds of beating Donald Trump, I think she would think about it long and hard.\" And on Oct. 31., former President Bill Clinton dropped the aside that while he is ineligible for another term, his wife \"may or may not run for anything.\" In another BBC Radio interview on Tuesday, Hillary Clinton said, \"I try to give the best advice I can to the candidates who are running because my goal is to help retire the current incumbent.\" Clinton said she did not expect to endorse a candidate in the primary but would \"support them and answer their questions in any way that I can. But once we have a nominee to do everything I know to do to win.\" \"The process is unfolding,\" she said. \"And we'll see who emerges.\" More:Hillary Clinton says ‘gutsiest' personal thing she ever did was stay in her marriage",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Speculating about Trump's health is 'dangerous,' but Hillary Clinton's was fair game?",
      "url": "https://www.usatoday.com/story/opinion/2019/11/19/trump-health-hypocrisy-2016-clinton-smears-speculation-dangerous-column/4230547002/",
      "subtitle": "Speculating about Trump's health is 'dangerous,' but Hillary Clinton's was fair game?",
      "author": "null",
      "content": "When I heard about President Donald Trump's unexpected weekend visit to Walter Reed National Military Medical Center, honestly, my first thought was the stress and strain of impeachment coupled with his Big-Mac-KFC diet finally got the better of him. Instead, White House Press Secretary Stephanie Grisham issued a statement saying, “Anticipating a very busy 2020, the President is taking advantage of a free weekend here in Washington D.C. to begin portions of his routine annual physical exam at Walter Reed.” Grisham would later add via tweet that “further speculation beyond the extensive & honest info I put out is wholly irresponsible & dangerous for the country.” But how “routine” was this medical visit? And can you blame many of us for asking? Trump has made 13,435 false or misleading claims over 993 days, according to The Washington Post Fact Checker. He and his aides have lied about everything from the trivial to important matters of national security. They lied about inauguration crowd sizes, his affair with porn actress Stormy Daniels, and why he fired FBI Director James Comey. This administration has lost any right to the benefit of the doubt. It is beyond absurd for Grisham, who has yet to conduct even a single White House press briefing, to expect anyone to believe a word she says. When it comes to speculating about health, Grisham might want to revisit the ghosts of Donald Trump’s very recent past. In September 2016, Democratic presidential nominee Hillary Clinton disclosed that she had pneumonia — a common illness that is the most common cause of hospital admissions in the United States (other than women giving birth). This of course prompted her then rival, Donald Trump, to attack her health and Trump’s smear team of Jerome Corsi and Roger Stone to spread conspiracy theories to allies on the right that Clinton had suffered from “seizures” or had “brain damage” Before he was running Trump’s campaign for president, Steve Bannon was running Breitbart News, pushing headlines such as, “There’s Something Seriously Wrong with Hillary Clinton’s Health.” Fox News’ Sean Hannity used his show to run a relentless crusade targeting Clinton’s health. The Washington Post reported on a Thursday in August 2016 that Hannity had been hammering on a debunked story every night that week, summoning \"a 'Fox News Medical A-Team' to probe the claim that Hillary Clinton has serious medical issues, covered up by a press that won’t demand her medical records.” I don’t remember Grisham or Trump or anybody in their camp denouncing Hannity, Bannon, Corsi or Stone for being “wholly irresponsible” or “dangerous” back then. We should have known:Donald Trump wrote his own medical report. Reckless language makes that obvious. Trump didn’t seem to concerned with “speculation” when, during an appearance on Fox, he invented a conspiracy theory that Clinton “goes away for five or six days and you don’t see her. She goes to sleep.” Trump campaign spokesperson Katrina Pierson didn’t seem to be preoccupied by what was good “for the country” when she appeared on MSNBC and made the insane allegation that Clinton was suffering from the language disorder “dysphasia.” Donald Trump has given us more pause to doubt his fitness for office than Hillary Clinton ever did. Which brings us to Trump’s unscheduled visit Saturday to the doctor. Can you imagine what the Trumps and Bannons and Hannitys of the world would have done to Hillary Clinton had she gone to an unscheduled doctor’s appointment? Age is not just a number:Bloomberg + Sanders + Biden + Trump + Warren = 374. What's wrong with this 2020 picture? This White House is so steeped in lies and hypocrisy that it is virtually impossible to tell fact from fiction. The bottom line is you have to ask yourself two questions, and answer them: ►Is this president capable of lying to the American people? Yes. ►Is the White House press secretary capable of lying to the press to cover up the president’s lies? Sean Spicer and Sarah Huckabee Sanders have shown us the answer to that question is also a resounding yes! Trump’s unexpected doctor’s visit could very well be an unplanned but routine medical check in an effort to get ahead of his 2020 schedule. But it also could be something much more serious. At the very least, I think Trump deserves the same benefit of the doubt that he and his allies gave Hillary Clinton. None. Kurt Bardella, a member of USA Today’s Board of Contributors, is the former spokesperson for Breitbart News and Republicans on the House Oversight and Government Reform Committee. Kurt left the Republican Party in 2017 and joined the Democratic Party. Follow him on Twitter: @kurtbardella",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "An American Airlines plane had a mechanical issue, and Hillary Clinton was onboard",
      "url": "https://www.usatoday.com/story/travel/airline-news/2019/11/18/hillary-clinton-american-airlines-plane-had-mechanical-issue/4227192002/",
      "subtitle": "An American Airlines plane had a mechanical issue, and Hillary Clinton was onboard",
      "author": "David Oliver",
      "content": "An American Airlines flight, which had former Secretary of State and presidential candidate Hillary Clinton aboard, needed to return to its gate in New York following a mechanical issue on Sunday afternoon. American flight 2144, which was set to depart from New York's LaGuardia airport and head to Washington, D.C.'s Reagan National airport, made a return to its gate around 3:15 EST on Sunday \"due to a mechanical issue,\" American Airlines spokesman Ross Feinstein told USA TODAY in a statement. Passengers ultimately boarded a different aircraft. Flight tracking service FlightAware indicates the plane left at 5:07 and reached Washington at 6:05. – an hour and 41 minutes after its scheduled arrival. The aircraft's mechanical issue was not reported to the Port Authority of New York and New Jersey, and there wasn't any emergency response, Steve Coleman, the deputy director of media at the Port Authority, told USA TODAY. In case you missed:FAA: American Airlines plane's landing gear collapsed in scary skid Wow:Could you pull a 92,500-pound plane? American Airlines employees do it for charity",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    }
  ]
}