{
  "articles": [
    {
      "title": "Amazon fires back at Ocasio-Cortez’s claim that it pays workers ‘starvation wages’",
      "url": "https://www.usatoday.com/story/money/2019/06/17/amazon-responds-alexandria-ocasio-cortez-wages-claim/1481725001/",
      "subtitle": "Amazon fires back at Ocasio-Cortez’s claim that it pays workers ‘starvation wages’",
      "author": "null",
      "content": "Amazon responded Monday to a comment by Rep. Alexandria Ocasio-Cortez, D-N.Y., that it pays warehouse workers “starvation wages,” saying in a tweet that it pays workers at least $15 per hour plus full benefits. In response to a question on ABC News’ “This Week” on Sunday about Amazon CEO Jeff Bezos, Ocasio-Cortez said whether Bezos is a billionaire is less of a concern to her than how the company’s policies impact Amazon warehouse workers. Ocasio-Cortez said she was concerned that Bezos’ “being a billionaire is predicated on paying people starvation wages and stripping them of their ability to access health care, and also if his ability to be a billionaire is predicated on the fact that his workers are taking food stamps.” Amazon tweeted a response to Ocasio-Cortez’s comments, saying: “Amazon is a leader on pay at $15 min wage + full benefits from day one. We also lobby to raise federal min wage.” Competitors coming for Prime:Two reasons it may be time to drop Amazon Prime Amazon’s head of communications, Jay Carney, later tweeted that Ocasio-Cortez should change the minimum wage law. Ocasio-Cortez was one of the most outspoken public critics of Amazon’s plan to move its second headquarters to Long Island City, in the borough of Queens, before Amazon pulled out. Amazon decided to raise its minimum wage to $15 an hour in 2018 after facing criticism for its pay disparity. In April, Bezos issued a challenge to other retailers to match Amazon’s pay and benefits. ©CNBC is a USA TODAY content partner offering financial news and commentary. Its content is produced independently of USA TODAY.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Ocasio-Cortez on Biden segregationist comments: Booker doesn't need to apologize to Biden",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/06/20/alexandria-ocasio-cortez-booker-doesnt-need-apologize-biden/1512986001/",
      "subtitle": "Ocasio-Cortez on Biden segregationist comments: Booker doesn't need to apologize to Biden",
      "author": "Rebecca Morin",
      "content": "Rep. Alexandria Ocasio-Cortez, D-N.Y., said Thursday that Sen. Cory Booker does not need to apologize to Joe Biden after the New Jersey Senator criticized the former vice president's controversial comments about working with segregationist senators during his early years on Capitol Hill. Booker on Wednesday had asked Biden to apologize for praising his work with former Democratic Sens. James Eastland of Mississippi and Herman Talmadge of Georgia during a fundraiser at the Carlyle Hotel in New York, both of who fought against the civil rights movement and opposed the racial integration of schools. Biden, however, said that Booker \"knows better\" and should be the one to apologize. The former vice president added that he doesn't \"have a racist bone on my body.\" Ocasio-Cortez, who has been critical of Biden, weighed in on the debate on Thursday. \"For the record, Cory Booker does *not* owe Joe Biden an apology for pointing out that waxing nostalgic about working with segregationists is insensitive,\" she tweeted. \"'He knows better?' Really? What is 'better?' To stay quiet about it?\" she wrote. More:Biden: Booker should apologize after criticism of my comments on segregationists 'He is out of step':Backlash after Biden talks 'civility' with segregationist senators Booker campaign spokeswoman Sabrina Singh confirmed Booker and Biden spoke Wednesday night after the New Jersey Democrat appeared on CNN. “Cory shared directly what he said publicly — including helping VP Biden understand why the word 'boy' is painful to so many,” Singh said. “Cory believes that Vice President Biden should take responsibility for what he said and apologize to those who were hurt.\" The Biden campaign confirmed in an email that two candidates spoke. Ocasio-Cortez also warned that voter turnout in the 2020 election could be harmed by Biden's comments. Many of the Democratic wins in the 2018 midterms were driving by black voters, particularly black women, according to analysis from the NAACP. \"For folks saying we should gloss over this, I think it’s important to realize that we can’t risk depressed turnout in 2020,\" she wrote in a second tweet. \"The original remark is valid to ask about & have a discussion on or clarify - not dismiss. We should be compassionate toward each other, but not silent,\" she continued. Biden's comments defending his stance on civil rights came on Wednesday, which was Juneteenth — a day marked in many states and by African Americans across the country commemorating June 19, 1865, when blacks in Galveston, Texas, learned they were no longer slaves, almost two years after President Abraham Lincoln had issued the Emancipation Proclamation. A number of top lawmakers that are part of the Congressional Black Caucus have defended Biden, Politico reported. Ocasio-Cortez has previously criticized Biden for his \"middle-of-the-road approach\" on climate change, for his previous support of the Hyde Amendment, and believes that only a true progressive candidate could beat Trump. Biden has repeatedly touted as being moderate and working with both sides of the aisle, while maintaining that he is progressive. Despite her criticisms, Ocasio-Cortez has said she would support Biden if he was the nominee during an interview on ABC's \"This Week.\" She added that she still thinks the candidate that is picked as the Democratic nominee is \"going to be exciting to vote for, that all people, women, people of all genders, races, income levels, geographies feel excited and good about voting for.\" \"I think that it is absolutely important that we defeat Donald Trump,\" she said. Contributing: Aamer Madhani Like what you’re reading?:Download the USA TODAY app for more",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Ocasio-Cortez on planned Wayfair walkout: 'This is what solidarity looks like'",
      "url": "https://www.usatoday.com/story/news/politics/2019/06/25/aoc-wayfair-walkout-this-what-solidarity-looks-like/1562921001/",
      "subtitle": "Ocasio-Cortez on planned Wayfair walkout: 'This is what solidarity looks like'",
      "author": "Rebecca Morin",
      "content": "WASHINGTON – Rep. Alexandria Ocasio-Cortez, D-N.Y., praised workers from Wayfair, an online home goods website, for planning a walkout after the company sold furniture to an organization that is managing migrant camps along the U.S-Mexico border. \"Wayfair workers couldn’t stomach they were making beds to cage children,\" Ocasio-Cortez tweeted. \"They asked the company to stop. CEO said no.\" \"Tomorrow, they‘re walking out,\" she continued. \"This is what solidarity looks like - a reminder that everyday people have real power, as long as we’re brave enough to use it.\" Sen. Elizabeth Warren, D-Mass., who is a top-tier candidate in the 2020 Democratic field, also tweeted that she supports the walkout. \"I stand with the hundreds of @Wayfair employees who are planning to stage a walkout at their Boston headquarters tomorrow,\" she wrote. \"The safety and well-being of immigrant children is always worth fighting for. \" Wayfair employees are staging a walkout in Boston, Mass., on Wednesday after the company said it would not end its business relationship with BCFS, a government contractor that has been managing migrant camps at the border, according to several reports. Employees for the company learned last week that a $200,000 order of bedroom furniture was placed by BCFS for a facility in Carrizo Springs, Texas, the Boston Globe first reported. Friday, nearly 550 employees on Friday signed a letter to Wayfair executives asking that the company cease all business with contractors that operate detention camps for immigrants. \"We believe that the current actions of the United States and their contractors at the Southern border do not represent an ethical business partnership Wayfair should choose to be a part of,” the letter stated, according to the Globe, which obtained a copy of the letter. “At Wayfair, we believe that ‘everyone should live in a home that they love.’ Let’s stay true to that message by taking a stand against the reprehensible practice of separating families, which denies them any home at all.\" The walkout is set for Wednesday at 1:30 p.m. local time in Boston, the Washington Post reported. In addition, employees are calling on Wayfair to donate all profits made from the sale to BCFS to Refugee and Immigrant Center for Education and Legal Services, a Texas-based non-profit that provides legal services to immigrants. More:Federal appeals court orders more fact-finding on Trump administration's plan to add census citizenship question More:GOP Rep. Michael Burgess says migrant children in one detention center can leave 'at any time' This is not the first time Wayfair has sold furniture to a migrant center. According to the Post, the company sold to a facility in Tornillo, Texas, last September. That center has since been shut down. A Twitter account about the walkout was created, as well as a Facebook page. Wayfair and the organizers of the walkout have not responded to requests for comment. Another Democratic lawmaker has also responded to the media reports about the planned walkout. Rep. Ayanna Pressley, D-Mass., whose district includes Wayfair's headquarters, said she stands in solidarity of those walking out on Wednesday. \"We must actively #resist any & all efforts by this cruel, incompetent administration to cage children and separate families,\" she tweeted. \"I proudly stand in solidarity w/ the hardworking individuals at #Wayfair who are walking out in the name of #justice & humanity.\" Like what you’re reading?:Download the USA TODAY app for more",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "'Being someone’s daughter' not a 'qualification': Ocasio-Cortez slams Ivanka Trump's diplomatic role",
      "url": "https://www.usatoday.com/story/news/politics/2019/06/30/alexandria-ocasio-cortez-says-ivanka-trump-unqualified-diplomat/1611603001/",
      "subtitle": "'Being someone’s daughter' not a 'qualification': Ocasio-Cortez slams Ivanka Trump's diplomatic role",
      "author": "William Cummings",
      "content": "Rep. Alexandria Ocasio-Cortez sharply criticized Ivanka Trump's suitability as a U.S. diplomatic representative at last week's G-20 summit in Osaka, Japan, saying on social media that simply being the president's daughter does not make her qualified for the role. \"It may be shocking to some, but being someone’s daughter actually isn’t a career qualification,\" the freshman Democratic congresswoman from New York said in a tweet on Saturday night. \"It hurts our diplomatic standing when the President phones it in & the world moves on. The US needs our President working the G20. Bringing a qualified diplomat couldn’t hurt either,\" she added. Ocasio-Cortez's post included a link to a tweet featuring a viral video clip – which has more than 9 million views – of President Donald Trump's oldest daughter, and White House adviser, participating in a conversation with French President Emmanuel Macron, British Prime Minister Theresa May, Canadian Prime Minister Justin Trudeau and the director of the International Monetary Fund's director, Christine Lagarde. At G20, Trump tells Putin playfully:'Don't meddle in the election.' Putin laughs New strategy?:Trump criticized Kamala Harris at the G20, breaking a silence More:Donald Trump's future depends in part on Xi Jinping, Vladimir Putin, and Kim Jong Un The context of the 19-second video clip that was published on the official Instagram account of the French presidential palace is not provided, and the sound quality leaves some of the dialogue unintelligible. But it shows Macron making a comment about \"social justice\" to which Ivanka Trump nods and expresses agreement. \"As soon as you begin talking about the economic aspect of it, though, a lot of people start listening who otherwise wouldn't listen,\" May says. \"Yeah,\" Trump agrees. \"And the same with the defense side of it,\" which she says is \"male-dominated.\" Many Twitter users characterized the attempts by the president's daughters to join the conversation as embarrassing. A number of commentators noted an apparent eye roll from Lagarde as Ivanka Trump spoke. \"Your thoughts on this video, @IvankaTrump? Your thoughts on the French government releasing it for the world to see?\" tweeted actress and liberal activist Alyssa Milano. Edward Luce, a columnist for the Financial Times, wrote that Ivanka Trump \"inserting herself into an awkward circle of world leaders\" will be the \"abiding image\" of the G-20 summit. He noted the \"varying expressions of tortured politeness\" displayed by the European political figures as Ivanka Trump spoke, and said that \"Lagarde, in particular, was unable to conceal her irritation.\" \"America’s self-named 'First Daughter' is rarely out of the frame at global summits. Other Trump officials are almost invisible compared with Ms Trump, and her husband, Jared Kushner, the only two White House players who are thought to be immune from Mr Trump’s trademark phrase: 'You’re fired,\" Luce wrote. Some of Ivanka Trump's defenders pushed back against Ocasio-Cortez's criticism. They said it was ironic that Ocasio-Cortez, a bartender and the youngest woman ever elected to Congress, was criticizing someone as being unqualified. College professor Oliver McGee, a frequent guest on Fox News, accused Ocasio-Cortez of \"jealousy\" for Ivanka Trump's place  \"on the world stage\" and called her criticism \"petty & classless.\" \"Diplomat Ivanka is savvy in business & politics to dialogue with world leaders! Being a bartender is NOT a savvy qualification for Congress,\" McGee tweeted. \"Imagine lacking this much self-awareness. The bartender turned Congresswoman, called someone unqualified,\" the Students for Trump Twitter account replied to Ocasio-Cortez's post. \"She didn’t 'turn' Congresswoman,\" another Twitter user replied to Students for Trump's criticism. \"She campaigned, beat an entrenched politician, and she did it with grit and a vision. You may not like her views, but nothing was handed to her ... unlike Ivanka.\"",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Biden urges caution about policies of 'way left' Democrats, Ocasio-Cortez",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/07/05/joe-biden-urges-caution-policies-way-left-democrats-aoc/1660272001/",
      "subtitle": "Biden urges caution about policies of 'way left' Democrats, Ocasio-Cortez",
      "author": "Rebecca Morin",
      "content": "WASHINGTON – Former Vice President Joe Biden sounded a note of caution Friday about progressive Democrats and their policies, saying that Democratic voters are more \"center-left\" and not \"way left.\" During an interview with CNN broadcast Friday, Biden pointed to a number of moderate Democrats who won swing districts during the 2018 midterms. \"That's what this election is about. I'm happy to debate that issue and all those issues with my friends because guess what, look who won the races. Look who won last time out,\" Biden said. Throughout the Democratic presidential primary race, Biden has continued to tout his more moderate proposals as some other 2020 Democrats have announced their support for more left-leaning ideas, such as Medicare for all. Biden does not support Medicare for all. He said his plan includes keeping private insurance while allowing people to opt in to Medicare if they would like. The former vice president also downplayed last year's electoral victory by Rep. Alexandria Ocasio-Cortez, D-N.Y. \"By the way, I think Ocasio-Cortez is a brilliant, bright woman, but she won a primary,\" Bidden said. \"In the general election fights, who won? Mainstream Democrats who are very progressive on social issues and very strong on education and health care.\" More:Joe Biden says that he wasn't prepared for Kamala Harris' criticism on segregation and busing More:Elizabeth Warren's 35,000 selfies aren't just for kicks; they're a campaign strategy Ocasio-Cortez, 29, had a stunning upset during the 2018 primaries against former Democratic Rep. Joe Crowley, who served in the House for 10 terms. The district is predominately Democratic and Ocasio-Cortez won the general election with 78% of the vote. Since then, Ocasio-Cortez has become the face of the new progressive lawmakers elected to the House of Representatives. Sen. Bernie Sanders, who is also running for the Democratic presidential nomination, retweeted a clip of Biden's comments and said he was proud to work with Ocasio-Cortez. Sanders has endorsed the New York Democrat's Green New Deal. The two lawmakers have also introduced legislation that would impose a 15 percent interest rate cap on all consumer loans. \"I’m proud to be working with @AOC and so many other Democrats to pass Medicare for All, debt free college and a Green New Deal,\" he tweeted. \"This is the agenda America needs — and that will energize voters to defeat Donald Trump.\" Ocasio-Cortez retweeted Sanders and then added a thank to the Vermont senator: \"Thank you, @SenSanders. It’s an honor to work alongside you and the millions of other people fighting for education, healthcare, and a living wage as rights.\" However, during the 2018 midterms, many of the Democrats who flipped districts were more moderate. And those moderate Democrats helped the party flip key House districts from Republican hands, according to analysis from Vox. Biden described the Democratic Party as moderate. \"Look, it's center-left, that's where I am,\" he said. \"Where it's not is way left.\" Like what you’re reading?:Download the USA TODAY app for more",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Ocasio-Cortez thinks DHS should be abolished, and other items from her New Yorker interview",
      "url": "https://www.usatoday.com/story/news/politics/2019/07/10/ocasio-cortez-department-hs-should-abolished/1698439001/",
      "subtitle": "Ocasio-Cortez thinks DHS should be abolished, and other items from her New Yorker interview",
      "author": "Rebecca Morin",
      "content": "WASHINGTON – Rep. Alexandria Ocasio-Cortez has been outspoken about the Trump administration's treatment of migrants crossing into the U.S. via the southern border with Mexico and about undocumented immigrants living in the United States currently. The New York Democrat has repeatedly called for U.S. Immigration and Customs Enforcement (ICE) to be abolished. And now, Ocasio-Cortez says she thinks that the Department of Homeland Security, which has jurisdiction over ICE, should be eliminated as well. ‘They tore out a piece of my heart’:Migrant mother describes toddler’s illness, death In an interview with the New Yorker, the progressive lawmaker said she believes the core structure of ICE and the DHS \"are extrajudicial, that they lack effective oversight\" and \"it is baked into the core foundational structure of these agencies.\" When asked whether she would get rid of DHS, she said: \"I think so.\" \"I think we need to undo a lot of the egregious mistakes that the Bush Administration did,\" she said. \"I feel like it is a very qualified and supported position, at least in terms of evidence and in terms of being able to make the argument that we never should have created D.H.S., in the early 2000s.\" Amid intra-party bickering between House Speaker Nancy Pelosi and several freshmen congresswomen, including Ocasio-Cortez, the New York Democrat said she doesn't believe she really has a relationship with the House speaker. \"I think sometimes people think that we have this, like, we have a relationship,\" she said during the interview. When asked whether she does, Ocasio-Cortez said: \"Not particularly.\" \"Not one that’s, I think, distinguished from anyone else,\" she said. More:Pelosi after quarrels with AOC, Tlaib: 'You got a complaint? You come and talk to me about it' She added that the last time she spoke to Pelosi one-on-one was when the House speaker asked her to join the select committee on climate change. Ocasio-Cortez said she did not join the panel because she had several requests regarding the committee which were not accommodated: that the committee have a legislative mission that included drafting legislation by 2020, that it have subpoena power and that members of the select committee not take any money from the fossil fuel industry. In addition, she said that her committee assignments that she was ultimately given have been \"very intense and very rigorous.\" Ocasio-Cortez serves on the House Financial Services Committee and the House Oversight Committee. \"I was assigned to two of some of the busiest committees and four subcommittees,\" she said. \"So my hands are full.\" \"And sometimes I wonder if they’re trying to keep me busy,\" she added, laughing. In 2016, Ocasio-Cortez was an organizer for Bernie Sanders' presidential campaign. Now the Vermont senator is running again, but Ocasio-Cortez has not endorsed him just yet. However, she has worked on legislation with him and Sen. Elizabeth Warren, who is also seeking the Democratic presidential nomination. Ocasio-Cortez said she has been approached by several candidates seeking her endorsement. She said she tells them all the same thing: “I’m not endorsing anybody for some time.” \"I certainly don’t want to endorse anyone this year,\" she said, but she noted that she will likely make an endorsement before the Democratic nomination is locked in. \"You know, I think we need to have debates. I think we need to have a national conversation. And also, I need to do my job.\" Ocasio-Cortez also commented on former Vice President Joe Biden's and Sen. Kamala Harris' debate performance late last month. The freshman congresswoman said she thinks it was fair that Harris confronted Biden on his comments about working with segregationist Democrats during his time in Congress and about his stance on busing decades ago. More:Penalizing candidates who interrupt, and other changes coming to the Democratic debates \"I absolutely think she was fair,\" Ocasio-Cortez said of Harris. \"And I think this is also part of a larger discussion, and that issues of race and gender are not extra-credit points in being a good Democrat. They are a core part of the competencies that a President needs.\" However, the New York Democrat said that past criticism of Harris has been warranted and she wants to learn about the California senator's worldview. Ocasio-Cortez said that Biden's debate performance called into question whether he is capable of being president due to his age. \"His performance on the stage kind of raised some questions with respect to that,\" she said. Biden is 76 years old. However, if Biden is the Democratic nominee, Ocasio-Cortez said \"I will do what I can\" to help beat President Donald Trump in 2020. \"Well, we need to defeat this President.\" she told the New Yorker, \"And so, to the extent that I could be helpful in that, you know, I will do what I can.\" Like what you’re reading?:Download the USA TODAY app for more",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "'Once Upon A Time in Hollywood,' 9/11 first responders bill, Pelosi and Ocasio-Cortez meet: 5 things to know Friday",
      "url": "https://www.usatoday.com/story/news/2019/07/26/once-upon-a-time-in-hollywood-911-first-responders-pelosi-ocasio-cortez/1821363001/",
      "subtitle": "'Once Upon A Time in Hollywood,' 9/11 first responders bill, Pelosi and Ocasio-Cortez meet: 5 things to know Friday",
      "author": "null",
      "content": "President Donald Trump is set to sign a bill at the White House on Friday that compensates 9/11 first responders who suffered illnesses, injuries and other medical problems as a result of their service. The measure supplies money for a compensation fund for firefighters, police officers and other emergency personnel who worked on the scene in New York City in the aftermath of the terrorist attacks of Sept. 11, 2001. The bill passed the Senate earlier this week by a margin of 97-2, despite attempts by Sen. Rand Paul, R-Ky., and Sen. Mike Lee, R-Utah, to offset the costs and add amendments. Trump will sign it into law during a ceremony with dozens of first responders, but one high-profile advocate won’t be there. Comedian and longtime first-responder activist Jon Stewart will reportedly be on vacation. After weeks of public friction, high-profile Democrats House Speaker Nancy Pelosi (California) and Rep. Alexandria Ocasio-Cortez (New York) are scheduled to meet face-to-face Friday in Washington, DC. Pelosi said she's \"looking forward\" to the meeting and Ocasio-Cortez added it is \"nothing too climactic.\" Signs of tension between the two have arisen since Ocasio-Cortez's arrival in January, but they appeared to boil over after Ocasio-Cortez and three other first-year congresswomen from the party's progressive wing known as the \"Squad\" were the only Democrats to vote against a version of a border funding bill that Pelosi promoted. Pelosi and Ocasio-Cortez have appeared to unify in recent days after President Donald Trump unleashed a series of racist attacks against the Squad. Prefer to listen? Check out the 5 things podcast Quentin Tarantino’s “Once Upon A Time in Hollywood,” hitting theaters Friday, fulfilling the promise of its title as a throwback fairy tale with two fictional showbiz buddies that just so happens to coincide with one of the most infamous killing sprees of the 20th century. Tarantino's vision of 1969 Hollywood feels authentic and alive, with a lot of that electricity running through leads Leonardo DiCaprio and Brad Pitt, plus an inspired, understated performance by Academy Award-nominated actress Margot Robbie as Sharon Tate. Robbie said she feels the weight of playing actress Tate, who was killed by the Manson family in 1969. “It was immensely important for me to honor Sharon’s generous spirit,” she said. Kathy Zhu, a vocal supporter of President Donald Trump, has been added to the program for a July 26 luncheon in Bloomfield Hills hosted by the Michigan Conservative Coalition. Miss World America stripped Zhu of her title and connection with the organization after officials learned about several posts on Zhu's Twitter account they deemed \"offensive, insensitive and inappropriate.\" Zhu has defended herself publicly in interviews, saying she stands by every tweet she has posted because she has never said anything wrong. ESPN TV and radio personality Dan Le Batard will return to his television show \"Highly Questionable\" Friday after  breaking the network's \"no pure politics\" policy a week ago with an on-air rant calling out President Donald Trump. Le Batard condemned the \"send her back\" chants that targeted Democratic congresswoman Ilhan Omar during a Trump rally in North Carolina and how ESPN has approached the subject since Jemele Hill's exit. Several days before that event, Trump tweeted that Omar and other progressive congresswomen of color should \"go back and help fix the totally broken and crime-infested places from which they came.\" Le Batard, 50, who is the son of Cuban immigrants, said the chanting \"felt un-American\" and he blamed Trump. He will also resume his hosting role on ESPN Radio's \"Dan Le Batard Show\" Monday.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez, Ilhan Omar and Rashida Tlaib fire back at Nancy Pelosi's 'Twitter world' quip",
      "url": "https://www.usatoday.com/story/news/politics/2019/07/08/ocasio-cortez-omar-tlaib-respond-pelosi-criticism/1671204001/",
      "subtitle": "Alexandria Ocasio-Cortez, Ilhan Omar and Rashida Tlaib fire back at Nancy Pelosi's 'Twitter world' quip",
      "author": "William Cummings",
      "content": "A group of freshman Democratic congresswomen responded on social media this weekend to criticism from House Speaker Nancy Pelosi, who dismissed them and \"their Twitter world\" in an interview with The New York Times. Columnist Maureen Dowd asked Pelosi about the opposition to a border funding bill from Reps. Alexandria Ocasio-Cortez, D-N.Y.; Ilhan Omar, D-Minn.; Ayanna Pressley, D-Mass.; and Rashida Tlaib, D-Mich. Pelosi said \"our bill\" was the best Democrats could do. She criticized the four liberal freshman – whom Dowd referred to as \"the Squad\" – for being the only members of their party to vote against the original version of the legislation passed by the Democratic-led House, which included some protections for migrant children. \"All these people have their public whatever and their Twitter world,\" Pelosi said, according to Dowd. \"But they didn’t have any following. They’re four people and that’s how many votes they got.\" The response was swift. \"That public 'whatever' is called public sentiment,\" Ocasio-Cortez fired back on Twitter. \"And wielding the power to shift it is how we actually achieve meaningful change in this country.\" 'Children come first':House passes $4.6 billion in aid for migrants at border after Pelosi caves to Republicans More:AOC criticizes CBP after report of secret Facebook group as agency opens investigation \"I don’t believe it was a good idea for Dems to blindly trust the Trump admin when so many kids have died in their custody,\" Ocasio-Cortez said, explaining her opposition to the legislation. \"It’s a huge mistake. This admin also refuses to hand over docs to Congress on the whereabouts of families. People’s lives are getting bargained, & for what?\" The House version of the border funding bill was rejected by the Republican-led Senate. Pelosi then capitulated and agreed to join the moderates in her party in passing the Senate version of the $4.6 billion bill. Ninety-five Democrats bucked their leader and voted against that version, with another 10 not voting. Pelosi said she \"reluctantly\" decided to back the Senate version of the bill because \"the children come first\" and the emergency funding was needed to get resources to help the mass of migrant children arriving at the U.S.-Mexico border. Pelosi told Dowd that the blame should go to Senate Majority Leader Mitch McConnell, R-Ky., whom she called \"authentically terrible.\" \"With all due respect, the press likes to make a story that is more about Democrats divided than the fact that Mitch McConnell doesn’t care about the children,\" she said. Migrant children's haunting drawings:'These children coming into our country need a voice,' doctor says The stuff of nightmares:Inside the migrant detention center in Clint, Texas 'They are run beautifully':Trump responds to report describing dangerous conditions at detention facilities Ocasio-Cortez's chief of staff Saikat Chakrabarti said on Twitter that the four Democrats had opposed Pelosi's version of the bill because they did not trust a promise he says McConnell made to Pelosi that he would pass the House version of the bill. \"Nah. It is deeper than that,\" Tlaib wrote in response to Chakrabarti's tweet. \"Why would we fund a broken system that rips children away from their parents, deny asylum seekers due process & fuels a racist ideology that dehumanizes people?\" Tlaib also retweeted two posts that fired back at Pelosi's comment to Dowd, including one from immigrants right advocate Greisa Martínez Rosas who said, \"The strategy is simple: Don’t fall for lies. Play to Win,\" and another from Washington Post reporter Jeff Stein that pointed out the \"pivotal policy proposals\" authored by each member of \"The Squad.\" Democratic divisions:Biden urges caution about policies of 'way left' Democrats, Ocasio-Cortez Stein's tweet was also shared by Omar, who responded to Ocasio-Cortez's post about Pelosi's comments with a cry of \"Patetico!\" – apparently referring to the Spanish word for \"pathetic.\" \"You know they’re just salty about WHO is wielding the power to shift 'public sentiment' these days, sis. Sorry not sorry,\" Omar tweeted. Ocasio-Cortez, the youngest woman ever elected to Congress, also took issue with Pelosi's dismissal of Twitter, saying the speaker would \"rather campaign like it’s 2008.\" \"I find it strange when members act as though social media isn’t important,\" she said before using emojis to slam conventional campaigning, which spends millions of dollars on television advertising. \"I haven’t dialed for dollars *once* this year, & have more time to do my actual job,\" Ocasio-Cortez tweeted. Exclusive:How Nancy Pelosi is leading divided Democrats through political turmoil More:Nancy Pelosi wants Trump 'in prison' but not impeached",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez is right, Speaker Nancy Pelosi has a women of color problem",
      "url": "https://www.usatoday.com/story/opinion/2019/07/14/nancy-pelosi-learn-from-ocasio-cortez-women-of-color-column/1715320001/",
      "subtitle": "Which Travel Card Has The Most Valuable Miles?",
      "author": "null",
      "content": "No, House Speaker Nancy Pelosi is not a racist. Yes, she has been an ally of women of color for her entire 31-year career in Congress. I have seen her up close and personal, when she spoke at an event my Alpha Kappa Alpha sorority held last year in Washington, D.C. at the Library of Congress to honor a historic black woman. She is all in on black women’s advancement and policy issues. To argue otherwise would be untrue. Yet freshman Rep. Alexandria Ocasio Cortez has it right — Speaker Pelosi is old guard. She does not like her new, high-profile women of color members nipping at her heels. She paid her dues. She worked her way up through the male dominated congressional system for decades to become the nation’s first female Speaker of the House. The daughter of a powerful Baltimore Mayor, Pelosi was raised in the 1950s and came of age in the early 1960s. She remembers a time when women were like \"Leave it to Beaver” or “Father Knows Best” moms, known for their pearls and perfectly coiffed hair. Pelosi remembers an America where women were largely silent, and could advance in politics, but only through steady party loyalty, staying in their place, waiting their turn, and never running their mouths to the media. This is Pelosi’s formation as a politician and to a large degree as a person. Enter New York’s 29-year-old \"AOC,” a she is known, and her Democratic colleagues Rep. Ayanna Pressley of Massachusetts, Rep. Ilhan Omar of Minnesota and Rep. Rashida Tlaib of Michigan. These bold, young women of color — unbought and unbossed in the spirit of the late Rep. Shirley Chisholm — have turned the Democratic caucus on its head. They are unafraid to speak out, to call out, and demand the change that we are so often asked to delay or deny as women of color. The current tensions erupted after the four women opposed a border spending bill they said failed to protect migrant children from President Donald Trump's policies. Pelosi criticized them  in interview with New York Times columnist Maureen Dowd, the women fought back, and AOC told the Washington Post that Pelosi had been \"outright disrespectful.\" She accused her of \"the explicit singling out of newly elected women of color.\" The issue here is NOT that Pelosi is a racist. In fact, Trump's Twitter attack Sunday on “'Progressive' Democrat Congresswomen\" and his suggestion that they \"go back and help fix the totally broken and crime infested places from which they came\" drew a strong defense of the four women from Pelosi, who called his comments xenophobic and evidence that he wanted to make America \"white again.\" No, the real issue here is what we academics call “intersectionality\" — the combined impact of racism, sexism and other types of discrimination on people and groups. In practice, it means that white women in power often take on the same characteristics of white men in power toward women of color. Last straw: 'I think I'd take it'? Nancy Pelosi, it's time to impeach Trump. The effect on women of color is widespread. White women earn 77 cents on the dollarcompared to white men. Hispanic or Latina women earn 53 cents on the dollar. Black or African-American women earn 61 cents. White women have made notable advancements in industry, politics, academia and corporate America, whereas women of color make up only about 5% of corporate executives and there is only one woman of color heading a Fortune 500 company. In medical schools, law schools  and law firms, while women overall have achieved parity or better, women of color lag far behind. I could go on and on with data points, but that is not the issue at hand. When you need Trump to defend you as not being a racist, you must stop and consider why. What do I mean? On Friday, Trump told reporters that AOC had been \"very disrespectful\" to Pelosi. \"I don't think that Nancy can let that go on,\" he added. What the heck? What Trump really meant to say is that older white people like him, Biden, and yes, Pelosi, simply do not yet know how to deal with women of color being in power and holding their feet to the fire. Pelosi tough: Donald Trump caved to Nancy Pelosi on shutdown, now the wall will never be built Black women are deemed “angry.” Latina women are deemed fiery. And Muslim women are “radical.” These words often used to describe us are meant to marginalize and silence us. The solution here is not for Speaker Pelosi to silence AOC or condemn her. It is to listen and learn and find a way to work together. This is not Congress in 1978, 1988 or 1998. This is 2019. People of color have a voice. Women of color have a voice. These women are members of the United States Congress. These women of color have a national platform that empowers them and indeed demands of them that they speak up for themselves and their constituents. Sophia A. Nelson is an MSNBC commentator, journalist and author of multiple books. Her most recent book is “E Pluribus One: Reclaiming Our Founders' Vision for a United America.” Follow her on Twitter: @IAmSophiaNelson",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "New York businesswoman and Jamaican immigrant Scherie Murray launches campaign to unseat Ocasio-Cortez",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/07/17/alexandria-ocasio-cortez-scherie-murray-campaigning-unseat-aoc/1753824001/",
      "subtitle": "New York businesswoman and Jamaican immigrant Scherie Murray launches campaign to unseat Ocasio-Cortez",
      "author": "William Cummings",
      "content": "WASHINGTON – New York businesswoman Scherie Murray announced Wednesday that she is running for Rep. Alexandria Ocasio-Cortez's congressional seat in 2020. In a series of tweets announcing her candidacy, Murray, who immigrated to New York from Jamaica when she was 9, said Ocasio-Cortez was more \"worried about being famous\" than representing her constituents. \"There’s a crisis in Queens and it’s called AOC,\" the Republican said, referring to Ocasio-Cortez by her initials. She said the freshman Democrat \"seeks celebrity & publicity\" and \"thinks public service is not about serving the public, but herself.\" Murray said she had experience building bridges \"between constituents in our community and the elected officials that represent them, between different nationalities and races, and between political parties.\" She said Ocasio-Cortez instead favored conflict and criticized her for her role in driving Amazon to abandon its plans to build a second headquarters in New York. The youngest woman ever elected to Congress, Ocasio-Cortez has been a frequent target of attacks from conservatives on Capitol Hill and in the news media. A self-described democratic socialist best known for being a sponsor of the Green New Deal, Ocasio-Cortez had been portrayed as the face of a leftward shift in the Democratic Party. Ocasio-Cortez is also known as a member of \"The Squad\" along with Democratic Reps. Ilhan Omar of Minnesota, Ayanna Pressley of Massachusetts and Rashida Tlaib of Michigan. The freshmen lawmakers' liberal positions have at times put them at odds with House Speaker Nancy Pelosi. This week, Ocasio-Cortez, Omar, Pressley and Tlaib have been at the center of a firestorm created after President Donald Trump told the four minority congresswomen, all of whom are U.S. citizens, to \"go back\" and fix their countries of origin before try to push legislative changes in America. Murray made an unsuccessful run in a special election for a New York Assembly seat in 2015, losing by more than 85 percentage points. She lost by a similar margin in a 2013 bid for New York City Council. She is the fourth Republican to file for a run against Ocasio-Cortez, the New York Post reported, joining former police officer John Cummings, journalist Ruth Papazian and building superintendent Miguel Hernandez. The Republicans will face an uphill battle in New York's heavily Democratic 14th Congressional District, which includes parts of the Bronx and Queens. Ocasio-Cortez won the seat in 2018 with 78% of the vote.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Two Louisiana police officers fired after Facebook post saying Ocasio-Cortez 'needs a round'",
      "url": "https://www.usatoday.com/story/news/politics/2019/07/22/two-louisiana-police-officers-fired-after-ocasio-cortez-facebook-post/1801628001/",
      "subtitle": "Two Louisiana police officers fired after Facebook post saying Ocasio-Cortez 'needs a round'",
      "author": "Rebecca Morin",
      "content": "WASHINGTON – Two Louisiana police officers were fired Monday, just days after one of them wrote in a Facebook post that Rep. Alexandria Ocasio-Cortez is a \"vile idiot\" who should be shot. Gretna, La., police officers Charlie Rispoli, who create the post, and Angelo Varisco, who liked the post online, were fired, police chief Author Lawson announced in a press conference Monday. \"These officers have certainly acted in a manner which was unprofessional, alluding to the violent act to be conducted against a sitting U.S. congressman, a member of our government, we're not going to tolerate that,\" Lawson said at the news conference, according to the New York Times. \"This incident, we feel, has been an embarrassment to our department.\" Rispoli, a 14-year veteran of the department, shared a blog post that falsely claims the New York Democrat said \"We pay soldiers too much,\" according to a screenshot of the post taken by The Times-Picayune/The New Orleans Advocate. What happened:Louisiana police officer's Facebook post says Alexandria Ocasio-Cortez 'needs a round,' report says More:President Trump's job approval rating reaches high mark in NPR/PBS/Marist poll after racist tweets \"This vile idiot needs a round,\" Rispoli's wrote in the post. \"And I don't mean the kind she used to serve,\" he added, referring to Ocasio-Cortez's time working as a bartender. The social media post and resulting firings came amid mounting concern for elected officials' safety in the current political climate. Ocasio-Cortez, along with Reps. Ayanna Pressley of Massachusetts, Ilhan Omar of Minnesota, and Rashida Tlaib of Michigan, have been the target of President Donald Trump's ire in the past week. He has repeatedly criticized the four progressive Democrats and called on them to \"go back\" to their countries. All four congresswomen are U.S. citizens, with three being born in the United States. Trump's comments led leading Democrats on Capitol Hill to inquire about additional security for Omar and other lawmakers. More:Tlaib: 'I'm not going nowhere, not until I impeach' Trump More:Geraldo Rivera on Trump 'go back' tweets: His critics 'were much more right than I' The New York Democrat just last week questioned Acting Homeland Security Secretary Kevin McAleenan about threatening messages about her – including Photoshopped images depicting her being rape – in a secret Facebook group for current and former Border Patrol agents. At Monday's press conference, Lawson said that both officers who were fired had worked the streets as patrol officers. However, Lawson said he did not think that Rispoli meant any harm and just got \"caught up in the heat of the moment.\" Contributing: William Cummings Like what you’re reading?:Download the USA TODAY app for more",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Louisiana police officer's Facebook post says Alexandria Ocasio-Cortez 'needs a round,' report says",
      "url": "https://www.usatoday.com/story/news/politics/2019/07/22/alexandria-ocasio-cortez-threatened-police-officer/1793131001/",
      "subtitle": "Louisiana police officer's Facebook post says Alexandria Ocasio-Cortez 'needs a round,' report says",
      "author": "William Cummings",
      "content": "WASHINGTON – A Louisiana police officer last week said in a Facebook post that Rep. Alexandria Ocasio-Cortez is a \"vile idiot\" who should be shot. A screenshot of the post by veteran Gretna police officer Charlie Rispoli was taken by The Times-Picayune/The New Orleans Advocate. In it, Rispoli shares a blog post that falsely claims the New York Democrat said \"We pay soldiers too much.\" \"This vile idiot needs a round,\" reads Rispoli's remarks above Ocasio-Cortez's image. \"And I don't mean the kind she used to serve,\" he adds, referring to her prior career as a bartender. Gretna Police Chief Arthur Lawson said the post was \"disturbing\" but did not believe Rispoli, who has been with the department since 2005, intended it as a genuine threat, The Times-Picayune reported. \"I will tell you this: This will not go unchecked,\" Lawson said, according to the newspaper. \"I’m not going to take this lightly and this will be dealt with on our end. It’s not something we want someone that’s affiliated with our department to make these types of statements. That’s not going to happen.\" The Gretna Police Department did not immediately respond to USA TODAY's request for comment. Rispoli's post comes amid mounting concern for elected officials' safety in an increasingly rancorous political climate. In June 2017, a man opened fire on a group of Republican members of Congress during their baseball team's practice in Virginia. Rep. Steve Scalise of Louisana was severely injured in the attack. Last week, Capitol Police Chief Steven Sund told lawmakers \"we continue to see the threat assessment cases we're opening continue to grow.\" In May, Ocasio-Cortez said she was regularly getting \"hateful messages\" and a \"flood of death threats.\" She said there was a connection between the threats and the reporting about her on conservative news media outlets and also blamed Fox News. On Thursday, Ocasio-Cortez, a fierce critic of the Trump administration's immigration policies, questioned Homeland Security head Kevin McAleenan over threatening messages directed at her – including Photoshopped images depicting her rape – on a secret Facebook group for Border Patrol agents. AOC to DHS chief:Border agents shared 'Photoshopped images of my violent rape' in secret Facebook group 'This puts me in danger':Rep. Alexandria Ocasio-Cortez blames GOP groups for death threats Ocasio-Cortez is one of four Democratic congresswomen, known as \"the Squad,\" who have been the target of sharp criticism from President Donald Trump. Trump has said Ocasio-Cortez and Reps. Ilhan Omar, D-Minn., Ayanna Pressley, D-Mass., and Rashida Tlaib, D-Mich., \"hate our country.\" The president has also suggested that the four congresswomen of color, all of whom are U.S. citizens and three of whom were born in the U.S., should return to their countries of origin and fix the problems there before trying to make legislative changes in the U.S. Omar has said she has faced an increase in death threats since she became a target of the president's ire. In April, a New York man was accused of saying he would \"put a bullet\" in Omar. That same month, a Florida man was arrested after he allegedly threatened several high-profile Democrats, including Tlaib and Omar, whom he said he wanted to throw off the Empire State Building. Trump and his family have been targeted as well. In May, a New Jersey man was arrested for allegedly saying he wanted to \"bomb Trump Tower,\" and two years before that a Michigan man was charged with threatening to assassinate Trump. And in February 2018, Donald Trump Jr.'s ex-wife, Vanessa Trump, was rushed to the hospital after opening a package containing a \"suspicious\" white substance that was later determined to be non-toxic. Those around Trump and his administration have also been confronted in public on a number of occasions. Last month, Eric Trump said an employee at a Chicago cocktail bar spat on him. In April, charges were dropped against a woman who White House counselor Kellyanne Conway says grabbed her and shook her by the shoulders. 'This is endangering lives':Ilhan Omar claims spike in death threats after Trump tweet Secret Service:Trump faces same number of threats as Obama More:Pipe bomb suspect Cesar Sayoc pleads guilty in spree aimed at Trump critics, including Obama, Biden",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez, Nancy Pelosi planning to meet one-on-one",
      "url": "https://www.usatoday.com/story/news/politics/2019/07/17/ocasio-cortez-pelosi-planning-one-one-meeting/1758102001/",
      "subtitle": "Alexandria Ocasio-Cortez, Nancy Pelosi planning to meet one-on-one",
      "author": "Rebecca Morin",
      "content": "WASHINGTON – House Speaker Nancy Pelosi and Rep. Alexandria Ocasio-Cortez are in talks to set up a face-to-face meeting with each other, amid intra-party tension between the two Democratic lawmakers. Pelosi spokesman Drew Hamill said Ocasio-Cortez's office reached out Tuesday afternoon for a one-on-one meeting. During an interview with New York Times columnist Maureen Dowd earlier this month, Pelosi downplayed four votes from a group of progressive Democrats against a border funding bill. Reps. Ocasio-Cortez, D-N.Y., Ayanna Pressley, D-Mass., Ilhan Omar, D-Minn., and Rashida Tlaib, D-Mich., all voted against the bill. The four congresswomen of color are colloquially known as \"The Squad.\" \"We are working to schedule this meeting,\" Hamill said of Pelosi meeting with Ocasio-Cortez, adding that the speaker's chief of staff has already met with the four chiefs of these offices. In an interview with CBS News broadcast Wednesday, Ocasio-Cortez said she \"absolutely\" wants to meet with Pelosi. More:New York businesswoman and Jamaican immigrant Scherie Murray launches campaign to unseat Ocasio-Cortez More:House votes to condemn Trump's racist tweets with support from only 4 Republicans Pelosi in the New York Times said of The Squad: “All these people have their public whatever and their Twitter world. But they didn’t have any following. They’re four people and that’s how many votes they got.” Since then, some members of \"The Squad\" have individually responded to the speaker's remarks on Twitter. That prompted Pelosi in a closed-door meeting to warn Democratic lawmakers that if any lawmaker had an issue within the party, they should come directly to her and not tweet about it. During an interview with the Washington Post last week, Ocasio-Cortez accused Pelosi of \"singling out of newly elected women of color.\" The next day, she told CNN that she \"absolutely\" did not believe Pelosi was racist. Since then, however, the tension between Pelosi and the Squad has been drowned out by days of tweets and attacks on the four progressive lawmakers by President Donald Trump. Trump on Sunday tweeted that the four lawmakers should \"go back\" to their countries, and has since doubled down several times on his attacks and criticisms of the Democrats. Three of the congresswomen were born in the United States. Omar immigrated to the U.S. over 20 years ago from Somalia and is a naturalized U.S. citizen. The House voted Tuesday to condemn Trump's comments as racist, by a 240-187 vote. During the CBS interview, Ocasio-Cortez said she did not believe there is a fracture in the Democratic Party. \"I think that just as there were members of Congress that did not vote for the speaker on the House Floor the day of our swearing-in, just as there are members who challenge her conclusions, who disagree with her, so do we from time-to-time,\" she said. \"But that does not mean that there is a fundamental fracture or a dehumanizing going on within our caucus.\" Contributing: Christal Hayes Like what you’re reading?:Download the USA TODAY app for more",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez welcomes New Jersey Democrat to 'The Squad'",
      "url": "https://www.usatoday.com/story/news/politics/2019/07/16/ocasio-cortez-new-jersey-democrat-youre-in-squad/1748643001/",
      "subtitle": "Alexandria Ocasio-Cortez welcomes New Jersey Democrat to 'The Squad'",
      "author": "Rebecca Morin",
      "content": "WASHINGTON – Rep. Alexandria Ocasio-Cortez is welcoming a new member to \"The Squad\": 82-year-old Rep. Bill Pascrell. The New Jersey Democrat asked Tuesday to be part of the outspoken group of House Democratic congresswomen who have been given their own moniker. Reps. Ayanna Pressley, D-Mass., Alexandria Ocasio-Cortez, D-N.Y., Rashida Tlaib, D-Mich., and Ilhan Omar, D-Minn., are the four freshmen lawmakers who have collectively become known as \"The Squad.\" Pascrell responded to a tweet from The Onion, a satirical website, that posted an article entitled \"82-Year-Old New Jersey Congressman Bill Pascrell Quietly Asks Ilhan Omar If He Can Be Part Of The Squad.\" 'We want to just fight':Democrats' attempt to condemn Trump's racist tweets through House resolution delayed More:George Conway, husband of Kellyanne Conway, calls Trump a racist in op-ed \"Well. How bout it @AyannaPressley @AOC @RepRashida @IlhanMN?\" Pascrell tweeted. Shortly afterward, Ocasio-Cortez gave her approval to the 82-year-old. \"You’re in, @BillPascrell!\" Ocasio-Cortez tweeted, with several emojis including a smiley face and heart. The exchange comes as President Donald Trump has repeatedly criticized \"The Squad\" in recent days. Over the weekend, Trump tweeted for the progressive lawmakers to \"go back\" to their country, a phrase often used in racist tropes. Three of the lawmakers were born in the U.S. Omar came to the United States as a refugee from Somalia more than 20 years ago and is a naturalized U.S. citizen. The president has doubled down on his comments several times since his initial tweets on Sunday. The four congresswomen held a press conference Monday denouncing Trump's comments, calling them \"racist,\" \"xenophobic,\" and \"bigoted.\" More:House GOP leaders refuse to condemn Donald Trump's racist tweets, say the uproar is 'all about politics' More:Trump triples down on his controversial tweets about 'The Squad.' Here's what we know Pascrell is one of many Democrats who have defended the congresswomen from Trump's attacks, saying that the president \"can't leave soon enough.\" Earlier this month, House Speaker Nancy Pelosi also criticized the congresswomen after they voted against a border funding bill. The speaker's statement sparked tension between The Squad and Pelosi, which has since been diminished following Trump's remarks as Pelosi and many Democrats have lined up in solidarity behind the four congresswomen. Like what you’re reading?:Download the USA TODAY app for more",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "'We don't have that many differences': Pelosi minimizes differences with Ocasio-Cortez",
      "url": "https://www.usatoday.com/story/news/politics/2019/07/26/pelosi-meeting-aoc-house-speaker-denies-tensions-lawmaker/1831077001/",
      "subtitle": "'We don't have that many differences': Pelosi minimizes differences with Ocasio-Cortez",
      "author": "Camille Caldera",
      "content": "WASHINGTON – House Speaker Nancy Pelosi and Rep. Alexandria Ocasio-Cortez met face-to-face Friday after weeks of public friction between the two high-profile Democrats. \"It went very well,\" Pelsoi said after the meeting. When asked if she and Ocasio-Cortez resolved any of their differences, Pelosi replied, \"we don't have that many differences.\" The speaker wrote in a tweet later that the two met \"to discuss working together to meet the needs of our districts and our country, fairness in our economy and diversity in our country.\" Speaking later Friday at her weekly press conference, Pelsoi expressed \"some level of confidence, and actually joy\" at the diversity of the House Democratic caucus and its ability to unify around issues. \"Ever since I came here, we have engaged in differences of opinion in our caucus, and that is a good thing,\" Pelosi said. \"In our caucus, we have our differences. Respect that, instead of making a big issue of it. Respect that.\" The collegial tone after the meeting appears to be the latest iteration of the sometimes-contentious relationship between the speaker from California and the freshman lawmaker from New York, who has come to represent the progressive wing of the party. The two have have quibbled over both policies and tactics during their six months together in the House but recently appeared to unify after President Donald Trump made racist attacks against four minority members of Congress. Budget deal:Donald Trump's budget deal with Democrats passes House but conservatives pan it as reckless The pair condemned Trump’s tweets in which he told the four House Democrats, which included Ocasio-Cortez, to “go back and help fix the totally broken and crime infested places from which they came.” Pelosi said the tweets were “disgraceful and disgusting” and introduced a resolution to condemn the comments as racist. But before Trump's attacks, signs of tensions between the two had been visible from the time of Ocasio-Cortez's congressional orientation, when she joined a climate protest outside Pelosi's office. And they continued as Ocasio-Cortez disagreed with the speaker's cautious approach to pursuing impeachment proceedings against Trump, while Pelosi offered lukewarm support for Ocasio-Cortez's Green New Deal. Tensions appeared to boil over after Ocasio-Cortez and three other first-year congresswomen from the party's progressive wing were the only Democrats to vote against a version of a border funding bill that Pelosi promoted. '45 is a puppet':Trump appears in front of altered presidential seal saying '45 is a puppet' During an interview with New York Times columnist Maureen Dowd, Pelosi criticized Ocasio-Cortez, along with Reps. Ilhan Omar of Minnesota, Ayanna Pressley of Massachusetts and Rashida Tlaib of Michigan for voting against the bill. \"They didn’t have any following. They’re four people and that’s how many votes they got,\" Pelosi said. That article prompted Ocasio-Cortez and her chief of staff to criticize Pelosi and centrist Democrats on social media. Pelosi then called out Ocasio-Cortez and the other three freshman congresswoman in a caucus meeting. \"You got a complaint? You come and talk to me about it,\" Pelosi said, according to a source in the room. \"But do not tweet about our members and expect us to think that that is just OK.\" From impeachment to indictment:5 repercussions from Robert Mueller's testimony Ocasio-Cortez responded by saying it was “outright disrespectful” for Pelosi to repeatedly single out newly elected women of color, though she later tried to downplay any ill-will between herself and the speaker. On Thursday, Pelosi minimized reports of strain in her relationship with Ocasio-Cortez, saying, “We’re good, we’re good.\" “I don’t think there are tensions,\" she said. When asked about the meeting Wednesday, Ocasio-Cortez said, \"I don’t think I have a strong message for her.\" Rep. Ro Khanna, D-Calif, views the meeting between Pelosi and Ocasio-Cortez as a further sign of de-escalation. \"The speaker is our coach and leader, and (Ocasio-Cortez) is a star recruit freshman who’s capable of big plays,\" he said, \"so they should see that they both have a particular role to play on the team and ultimately the goal is for the team to win.\" Executions:Justice Department resumes capital punishment after nearly two decades, orders executions of five inmates Norman Ornstein, a resident scholar for the American Enterprise Institute, said Trump's comments \"actually brought Democrats together.\" \"They felt under siege in a completely vile way and that created a commonality,\" he said. \"It created an opening for a different kind of dialogue between the speaker and AOC.” Ornstein said the meeting is significant because \"the speaker doesn’t meet individually with a lot of members on a regular basis because she has so many other things going on.\" When Pelosi was asked at her weekly press conference if she and Ocasio-Cortez had buried the hatchet, Pelsoi replied, \"I don't think there ever was any hatchet.\" Contributing: Christal Hayes",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "'Passive aggression. It's a lifestyle': Ocasio-Cortez responds to a GOP congressional critic",
      "url": "https://www.usatoday.com/story/news/politics/2019/07/30/alexandria-ocasio-cortez-responds-rep-jody-hices-comments-migrant-detention/1872484001/",
      "subtitle": "'Passive aggression. It's a lifestyle': Ocasio-Cortez responds to a GOP congressional critic",
      "author": "Nicholas Wu",
      "content": "WASHINGTON – Rep. Alexandria Ocasio-Cortez responded Tuesday to criticism from a Republican congressman by saying he lied about her and asking for civility in their shared workplace of the House of Representatives. Ocasio-Cortez chided Rep. Jody Hice, R-Ga., writing on Twitter that Hice was \"lying about this.\" \"We’re going to see each other at work & you’re going to pretend to be nice to me. Passive aggression. It’s a lifestyle,\" she continued, adding the thumbs-up emoji at the end of the tweet. Hice had accused her of having \"deliberately misled the American people\" about the treatment of migrants in detention. Ocasio-Cortez had previously said migrants in Border Patrol custody were held in substandard conditions and \"forced to drink out of toilets.\" Hice disagreed. In the first of two videos posted on Twitter on Monday, Hice drank out of one of the combined drinking fountains and toilets at the center of controversy. \"There's drinkable water within this toilet system, AOC is giving fallacious information, here's the truth,\" Hice said, after drinking from it. In another video, Hice visited a warehouse he called a \"miniature Walmart,\" full of basic necessities like socks, toothbrushes, and clothing for detained migrants. The disagreement stemmed from comments Ocasio-Cortez had made after a visit to a Border Patrol facility at the beginning of July. On July 1, after touring the facility, Ocasio-Cortez tweeted to say Border Patrol officers were telling detained migrant women  \"to drink out of the toilets,\" sparking a social media firestorm. More:Illinois GOP group apologizes for offensive 'Jihad Squad' post about AOC, Omar, Tlaib and Pressley More:AOC to DHS chief: Border agents shared 'Photoshopped images of my violent rape' in secret Facebook group More:Chilling first-hand reports of migrant detention centers highlight smell of 'urine, feces,' overcrowded conditions Twitter users noted that Ocasio-Cortez was likely referring to a kind of combined drinking fountain, sink, and toilet. A day later, Ocasio-Cortez tweeted a picture of the toilet to explain that the sink portion of the toilet wasn't working on the day when she and other members of Congress toured the Border Patrol facility. More:Lawmaker describes 'unacceptable' border detention conditions, meets with US citizen in Border Patrol custody The federal government's treatment of detained migrants at the U.S.-Mexico border has drawn increased scrutiny after a Department of Homeland Security inspector general report called conditions in detention facilities in the Rio Grande Valley a \"ticking time bomb.\" Ocasio-Cortez's group was one of several congressional delegations to visit border detention facilities in an effort to draw attention to poor conditions for detained migrants.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "New York’s Alexandria Ocasio-Cortez is the youngest woman ever elected to Congress",
      "url": "https://www.usatoday.com/picture-gallery/news/politics/2018/11/07/new-yorks-alexandria-ocasio-cortez-campaign-trail/1911200002/",
      "subtitle": "New York’s Alexandria Ocasio-Cortez is the youngest woman ever elected to Congress",
      "author": "null",
      "content": "",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "'She should be shot': Ohio man charged after Facebook threat against Ocasio-Cortez",
      "url": "https://www.usatoday.com/story/news/politics/2019/08/10/toledo-ohio-man-charged-after-post-facebook-ocasio-cortez/1975362001/",
      "subtitle": "'She should be shot': Ohio man charged after Facebook threat against Ocasio-Cortez",
      "author": "Nicholas Wu",
      "content": "WASHINGTON – Federal prosecutors announced on Friday that a 41-year-old Toledo, Ohio, man has been charged after making threats against Rep. Alexandria Ocasio-Cortez, D-N.Y., and illegal possession of ammunition. Ireland was charged with \"one count of being a felon in possession of a firearm, one count of being a fugitive in possession of a firearm and one count of making interstate threats,\" according to the Department of Justice. According to the criminal complaint, at the end of July, the U.S. Capitol Police received a report from a person who'd perceived a Facebook post from Timothy J. Ireland, Jr. as potentially threatening against Ocasio-Cortez. More:AOC says she gets death threats after organizations air 'hateful messages' about her More:AOC calls out McConnell after photo shows 'Team Mitch' supporters 'groping and choking' cardboard cutout “She should be shot. Can’t fire me, my employer would load the gun for me,” Ireland had written on Facebook, along with a link to a story about Ocasio-Cortez. On August 2, the Capitol Police called Ireland at a number found in public records and asked him if he made the post and if he owned firearms. The Capitol Police said Ireland told them he was \"very proud of that post he made,\" and admitted to owning firearms. Six days later, Capitol Police and the Bureau of Alcohol, Tobacco, Firearms and Explosives agents searched Ireland's house after obtaining a search warrant. They detained him at the scene and found seven rounds of ammunition inside his kitchen drawers – three rounds of .32 caliber ammunition and four rounds of .45 caliber ammunition. Ireland told agents he did not have a gun in his house but brought ammunition with him when he moved into the house. An FBI criminal background check of Ireland found he had two outstanding warrants for failure to appear charges in Florida and Georgia, which stemmed from a marijuana possession charge. The criminal complaint noted Ireland had also been convicted in 1996 of four felony counts of dealing in stolen property in Sarasota County, Fla. “There is absolutely no place in the marketplace of ideas for threats of violence against any person, especially those who are elected to represent the American people,” U.S. Attorney Justin Herdman said in a press release. “Disagreement on political issues cannot lead to acts of violence, and if it does, we will seek federal prison time.” More:Louisiana police officer's Facebook post says Alexandria Ocasio-Cortez 'needs a round,' report says Ocasio-Cortez has been outspoken about the number of threats that she receives as a high-profile member of Congress. \"I‘ve had mornings where I wake up & the 1st thing I do w/ my coffee is review photos of the men (it’s always men) who want to kill me,\" she wrote on Twitter at the end of May.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez's chief of staff, spokesman leave her congressional office",
      "url": "https://www.usatoday.com/story/news/politics/2019/08/02/alexandria-ocasio-cortezs-chief-staff-spokesman-leave-her-office/1906807001/",
      "subtitle": "Alexandria Ocasio-Cortez's chief of staff, spokesman leave her congressional office",
      "author": "Rebecca Morin",
      "content": "WASHINGTON — Rep. Alexandria Ocasio-Cortez's chief of staff, Saikat Chakrabarti, who has been criticized by some Democratic lawmakers, will be leaving the New York Democrat's congressional office to join an organization working on the Green New Deal, according to several reports. Corbin Trent, Ocasio-Cortez's communications director, will also be leaving the congressional office to join the congresswoman's 2020 reelection campaign. The Intercept first reported both staff moves. Trent, in a statement to The Intercept, said that Chakrabarti will work with a group called New Consensus, a nonprofit focused on climate issues and promoting the Green New Deal. Tulsi Gabbard: Bashar al-Assad is 'a brutal dictator, just like Saddam Hussein' Russia investigation:The final bill for former special counsel Robert Mueller's Russia inquiry: $31. 7 million “We are extraordinarily grateful for his service to advance a bold agenda and improve the lives of the people in NY-14,\" Trent said in the statement. \"From his co-founding of Justice Democrats to his work on the Ocasio-Cortez campaign and in the official office, Saikat’s goal has always been to do whatever he can to help the larger progressive movement, and we look forward to continuing working with him to do just that.\" Chakrabarti, who co-founded Justice Democrats -- a political organization that helped Ocasio-Cortez get elected -- was criticized last month by Democratic Rep. William Lacy Clay of Missouri. The comments came amid intra-party bickering between House Speaker Nancy Pelosi and Reps. Ayanna Pressley of Massachusetts, Ilhan Omar of Minnesota, Rashida Tlaib of Michigan and Ocasio-Cortez. More:Donald Trump’s picks for administration jobs keep dropping out with John Ratcliffe latest to go 'Self-inflicted wound':Trump signs budget bill as experts warn he's on track to add trillions to U.S. debt Clay called out Chakrabarti in July for a tweet where he compared moderate Democrats to \"new Southern Democrats\" that \"certainly seem hell bent to do to black and brown people today what the old Southern Democrats did in the 40s.\" The tweet has since been deleted. In a separate tweet, Chakrabarti said centrist Democrats \"still enable a racist system.\" “It shows you how ignorant and little history [Chakrabarti] knows, how ignorant he is to American history. How dare he,” Clay said at the time. The intra-party differences seemed cool once President Donald Trump began to target Ocasio-Cortez, Pressley, Omar and Tlaib -- colloquially known as the \"Squad\" -- with repeated racist attacks that were condemned by Pelosi, other Democrats, some Republicans and by a resolution passed in the House of Representatives. In an apparent effort to further defuse tensions, Pelosi and Ocasio-Cortez recently met one-on-one. And news of the departures of Trent and Chakrabarti broke a week later. Pelosi:'We don't have that many differences' Like what you’re reading?:Download the USA TODAY app for more",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez says tweets by her ex-chief of staff were 'divisive'",
      "url": "https://www.usatoday.com/story/news/politics/2019/08/08/alexandria-ocasio-cortez-ex-chief-staff-tweets-were-divisive/1957146001/",
      "subtitle": "Alexandria Ocasio-Cortez says tweets by her ex-chief of staff were 'divisive'",
      "author": "Rebecca Morin",
      "content": "WASHINGTON – Rep. Alexandria Ocasio-Cortez, D-N.Y., criticized her controversial ex-chief of staff's tweets about moderate Democrats, saying they were \"divisive.\" Ocasio-Cortez, however, maintained that she parted on good terms with Saikat Chakrabarti, during an exclusive interview with the New York Daily News posted Thursday. “I think it was divisive,” she told the Daily News. “I believe in criticizing stances, but I don’t believe in specifically targeting members.\" Chakrabarti resigned last week to join a group called New Consensus, a nonprofit focused on climate issues and promoting the Green New Deal. Corbin Trent, Ocasio-Cortez's communications director, also announced he was transitioning out of the congressional office to join the congresswoman's 2020 reelection campaign. Chakrabarti, who co-founded Justice Democrats — a political organization that helped Ocasio-Cortez get elected, was criticized last month by Missouri Democratic Rep. William Lacy Clay. More:Trump 'thinking very seriously' about commuting prison sentence for Rod Blagojevich The comments came amid intra-party bickering between House Speaker Nancy Pelosi and Reps. Ayanna Pressley of Massachusetts, Ilhan Omar of Minnesota, Rashida Tlaib of Michigan and Ocasio-Cortez. Clay called out Chakrabarti in July for a tweet where he criticized moderate Democrats who voted in favor of an emergency border funding bill, which Ocasio-Cortez, Omar, Tlaib and Pressley voted against. Chakrabarti compared centrist Democrats, known as the Blue Dogs, to \"new Southern Democrats\" that \"certainly seem hell bent to do to black and brown people today what the old Southern Democrats did in the 40s.\" The tweet has since been deleted. In a separate tweet, Chakrabarti said centrist Democrats \"still enable a racist system.\" “It shows you how ignorant and little history [Chakrabarti] knows, how ignorant he is to American history. How dare he,” Clay said at the time. Ocasio-Cortez told the Daily News that the tweet was deleted following an “internal conversation\" in her office after the tweet. More:Tucker Carlson's fellow Fox News host Shepard Smith says 'white nationalism is real' “We’ve corrected it,” she said. “He immediately took the tweet down.” In addition, Ocasio-Cortez said that the two \"had been discussing this transition before that whole incident happened.\" However, the announcement of the departure of Chakrabarti and Trent broke a week after Pelosi and Ocasio-Cortez met one-on-one in apparent effort to defuse tensions within the party. Prior to that meeting, the intra-party bickering seemed to cool after President Donald Trump began to target Ocasio-Cortez, Pressley, Omar and Tlaib — colloquially known as the \"Squad\" — with repeated racist attacks. Pelosi, many other Democrats and even some Republican condemned Trump's attacks on the four congresswomen. The House of Representatives also passed a resolution to formally condemn Trump's tweets calling on the four congresswomen to \"go back\" to their countries as racist. Like what you’re reading?:Download the USA TODAY app for more",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez told Bernie Sanders about her endorsement while he was still in the hospital",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/10/16/aoc-ilhan-omar-told-bernie-sanders-endorsements-after-heart-attack/4003249002/",
      "subtitle": "Alexandria Ocasio-Cortez told Bernie Sanders about her endorsement while he was still in the hospital",
      "author": "Jeanine Santucci",
      "content": "News that Rep. Alexandria Ocasio-Cortez, a progressive icon, would be endorsing Sen. Bernie Sanders for president came as he took the stage alongside his 2020 rivals and showed he was still in the game after a health scare. But Sanders got the news from the New York representative herself as he was still recovering in the hospital from a heart attack earlier this month, according to a new report. Sanders' campaign manager, Faiz Shakir, told Politico he answered the phone that day and passed it over to Sanders, who was in his hospital bed. \"Think about the courage of this person who says, ‘You know, I know what you just went through but I have so much trust and confidence in you that you are the one who will fight the fight that I believe in. I'm with you,' \" Shakir said. Minnesota's Ilhan Omar, another freshman Democrat in Congress who announced her support of Sanders Tuesday night, also told the senator about her decision after his heart attack, according to Politico. Sanders said during Tuesday's debate that a \"special guest\" would be joining him at a rally this weekend, and it was later confirmed the guest would be Ocasio-Cortez and that she would make her endorsement then. In response to a question about his heart attack and recovery at the debate, the 78-year-old said, \"I’m healthy, I’m feeling great.\" Sanders had canceled several campaign events after his surgery. He released a video in which he said being in a Las Vegas hospital “made me feel even more strongly the need for us to continue our efforts to end this dysfunctional and cruel health care system.” 'I'm feeling great':Bernie Sanders reassured voters of his health following heart attack He also said in an NBC interview, \"We're going to get back into the groove of a very vigorous campaign, I love doing rallies and I love doing town meetings.” Sanders is currently trailing former Vice President Joe Biden, 76, and Massachusetts Sen. Elizabeth Warren, 70, according to a rolling average of national polls by RealClearPolitics. The three frontrunners are the oldest Democrats in the race. President Donald Trump is 73 years old. Candidates' ages:4 decades separate 2020's presidential candidates. Here's what that looks like. Contributing: Nicholas Wu, Courtney Subramanian, Rebecca Morin",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "From unknown to US Congress, Alexandria Ocasio-Cortez says sudden fame is like 'a tattoo on your face'",
      "url": "https://www.usatoday.com/story/news/politics/2019/10/23/aoc-sudden-fame-sometimes-just-want-human-being/4079643002/",
      "subtitle": "From unknown to US Congress, Alexandria Ocasio-Cortez says sudden fame is like 'a tattoo on your face'",
      "author": "Savannah Behrmann",
      "content": "WASHINGTON — Democratic congresswoman Alexandria Ocasio-Cortez got real in an interview with the Huffington Post about the toll of sudden fame. The 30-year-old arrived in the national spotlight in 2018 after defeating a well-known and powerful incumbent in New York's 14th congressional district while working as a waitress. At 29, she became the youngest congresswoman ever. She has 5.5 million Twitter followers, is consistently targeted by President Donald Trump, and repeatedly makes national headlines and appearances on television. She told HuffPo, “Sometimes I just want to be a human being. And you don’t get to be a human anymore. Everything you do from wearing sweatpants to the bodega to getting a haircut ― every personal decision you make for yourself is never going to be yours anymore.” Earlier this month, AOC shot back after a story in the conservative Washington Times criticized her for a \"high-dollar hairdo,\" after spending $300 on her haircut, lowlights, and the tip. 'The halls of Congress are no joke':AOC reflects on Congress as she endorses Sanders The interview from AOC comes just days after American-born Duchess Meghan Markle of Sussex gave a raw interview on British television about the hardships of fame that went viral. AOC had responded to the interview via tweet, “Sudden prominence is a very dehumanizing experience. There’s a part of your life that you lose, & it later dawns on you that you’ll never get it back.” “The people who treat you like a human make all the difference,” she continued. AOC told HuffPo that while she has accepted her privacy will never return to normal, she added, “You kind of grieve for that. It has its highs and it has its lows. A lot of people look at the highs, but sometimes it feels like you got a tattoo on your face that you didn’t ask for. It’s hard. It’s very hard. Sometimes you just want to get a drink or eat a hamburger.” Despite mixed feelings about all the attention, AOC said, “I can’t afford to be hidden away. In order for me to do my job, I need to be connected to people. My job is to love people. And that’s very difficult sometimes given the amount of barriers.”",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Bernie Sanders says Alexandria Ocasio-Cortez will work in his administration if he's president",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/10/21/bernie-sanders-says-aoc-work-his-white-house/4055445002/",
      "subtitle": "Bernie Sanders says Alexandria Ocasio-Cortez will work in his administration if he's president",
      "author": "Jeanine Santucci",
      "content": "After freshman Rep. Alexandria Ocasio-Cortez officially endorsed Sen. Bernie Sanders for president at a Queens, N.Y. rally on Saturday, the Vermont progressive said he wants Ocasio-Cortez to work in his White House Sanders was asked in a joint interview with CBS News if he would consider Ocasio-Cortez to be his running mate. The congresswoman answered for him as both laughed: \"I think I'm too young for that.\" \"There you go, she's answered,\" Sanders added. But when Ocasio-Cortez was asked if she'd work in Sanders' administration should he be elected president, he interjected with a forceful \"Yes, you would.\" Ocasio-Cortez, the youngest woman ever elected to Congress, said at the rally that the pressure that has been on her since she was elected to office made her \"appreciate the enormous, consistent, and non-stop advocacy\" of Sanders. Sanders' recent health scare was a \"gut check,\" Ocasio-Cortez told CBS. She informed Sanders of her decision to back his campaign while he was still recovering from a heart attack earlier this month. \"Neither me nor the senator cannot do this by ourselves,\" Ocasio-Cortez said. On health scare:Bernie Sanders reassured voters following heart attack Last week's Democratic primary debate was Sanders' return to the campaign trail following his hospitalization, and in response to a question about his heart attack and recovery at the debate, the 78-year-old said, \"I’m healthy. I’m feeling great.\" Sanders canceled several campaign events after his surgery but said that he would continue with a \"vigorous\" campaign. Sanders also has the backing of Minnesota Rep. Ilhan Omar, and she and Ocasio-Cortez have faced some criticism from those who question their choice to support a white man's candidacy. When asked why, as a woman of color, Ocasio-Cortez made that decision, she said, \"I'm actually very excited about this partnership because it shows what we have to do in our country, is that we have to come together across race, across gender, across generation.\" 'It is no joke':Alexandria Ocasio-Cortez reflects on Congress as she endorses Sanders Ocasio-Cortez says she had also spoken to other candidates, including Massachusetts Sen. Elizabeth Warren, ahead of her endorsement. \"I think she's a fabulous candidate. Frankly, Sen. Sanders, Sen. Warren and myself are all on the same team in the party,\" she said. Warren is currently outpacing Sanders in national and early-state polls alongside former Vice President Joe Biden. A USA TODAY/Suffolk University poll found that Sanders is in fourth place behind Biden, Warren and South Bend, Ind. Mayor Pete Buttigieg. USA TODAY/Suffolk poll:Iowa caucuses are 'up for grabs' as Pete Buttigieg surges into top tier Nationally, Sanders is in third place after Biden and Warren, according RealClearPolitics averages.",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez apologizes to man who sued her for blocking him on Twitter",
      "url": "https://www.usatoday.com/story/news/politics/2019/11/04/alexandria-ocasio-cortez-apologizes-man-she-blocked-twitter/4158010002/",
      "subtitle": "Alexandria Ocasio-Cortez apologizes to man who sued her for blocking him on Twitter",
      "author": "William Cummings",
      "content": "WASHINGTON – Rep. Alexandria Ocasio-Cortez apologized Monday to a man she had blocked on Twitter as part of a settlement of a federal lawsuit he brought against her earlier this year. The New York Democrat said she had reconsidered her decision to block former New York state Assemblyman Dov Hikind, who had often criticized her on the social media platform, particularly her comparison of migrant detention centers to concentration camps. \"Mr. Hikind has a First Amendment right to express his views and should not be blocked for them,\" she said in a statement. \"In retrospect, it was wrong and improper and does not reflect the values I cherish. I sincerely apologize for blocking Mr. Hikind.\" But Ocasio-Cortez, who has said she has received many threats, reserved the right to block those she felt were harassing her. Hikind said in a news conference that he was pleased with Ocasio-Cortez's apology and that he \"couldn't ask for much more at this point.\" He said he hoped it would be the start of a dialogue between himself and the congresswoman. From unknown to US Congress:Alexandria Ocasio-Cortez says sudden fame is like 'a tattoo on your face' More:Bernie Sanders says Alexandria Ocasio-Cortez will work in his administration if he's president \"Every public official needs to unblock the public from following them on Twitter,\" Hikind said. \"You want to be in elective office? Don't be afraid of what people have to say to you.\" His lawsuit was filed after a federal appeals panel ruled that President Donald Trump could not block Twitter users who criticized him. The panel said that because Trump often made policy announcements and conducted official business through his Twitter account, he was silencing critics and violating their First Amendment rights by blocking them. Voices:Trump blocked me on Twitter. I sued (and won) because modern town halls happen online. Hikind said that people who \"cross the line\" and threaten public officials are \"another story.\" \"But just because you don't like what someone is saying, or you don't like the way they're saying it, does not give you a right to abridge their freedom of speech,\" he said. Ocasio-Cortez has more than 5.7 million Twitter followers on her account, which she uses to discuss topics ranging from mundane personal matters to legislation and congressional affairs. The congresswoman had been scheduled to testify Tuesday in the case, Hikind said, adding that he had looked forward to hearing \"why Ocasio-Cortez decided to silence me, to silence my voice, to take away my speech.\" Contributing: The Associated Press 'The halls of Congress are no joke':AOC reflects on Congress as she endorses Sanders 'They’re just mad we look good doing it':AOC responds to story about the price of her hairstyle",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    }
  ]
}