{
  "articles": [
    {
      "title": "Bernie Sanders: Yes, Middle Class Will Pay More in Taxes",
      "url": "https://www.breitbart.com/clips/2019/06/27/bernie-sanders-yes-middle-class-will-pay-more-in-taxes/",
      "subtitle": "null",
      "author": "Pam Key",
      "content": " Thursday during the Democratic Candidates Debate on MSNBC, Sen. Bernie Sanders (I-VT) acknowledged that middle-class Americans would see a tax increase to pay for his Medicare for all proposal. Sanders said, “People who have health care under Medicare for all will have no premiums, no deductibles and copayments and no out of pockets. Yes, they will pay more in taxes and less in health care for what they get.” Follow Pam Key on Twitter @pamkeyNEN",
      "date": "27 Jun 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Democrat Debate: Bernie Sanders Pledges War on Gun Sales, Gun Makers",
      "url": "https://www.breitbart.com/politics/2019/07/30/democrat-debate-bernie-sanders-pledges-war-gun-sales-gun-makers/",
      "subtitle": "During the July 30 Democrat Debate Bernie Sanders pledged numerous new gun controls focused on gun sales and also made clear his intention to remove protections that spare gunmakers from lawsuits.",
      "author": "AWR Hawkins",
      "content": " Sanders made clear that he had a D- rating from the National Rifle Association (NRA) now, and suggested it will probably drop to an F if he wins the presidency. He said Democrats “have to have the guts to take on the NRA.” He then set forth the gun control plan he will follow if elected to the White House, saying: I will do everything I can not only to take on the NRA, but expand and create universal background checks, do away with the straw man provision, do away with the gun show loophole, and do away with the loopholes that now exist for gun manufacturers who are selling large amounts of weapons into communities that are going to gangs. A couple of points: 1. Straw purchases are already banned. ATF background check form 4473 makes clear the person trying to buy a gun must, in fact, be the actual purchaser in order for the purchase to be approved. 2. California has had universal background checks for over two decades, yet the state continues to catch national attention for high profile shooting after high profile shooting. 3. There is no gun show loophole. Never has been. The majority of sales at gun shows go through an FFL (Federal Firearms License holder). The left’s “gun show loophole” mantra is a way to demonize private gun sales, which were the only kind we had from December 15, 1791–the ratification of the Second Amendment–until Bill Clinton’s 1998 background check gun control bill. Down Range with AWR Hawkins.  Sign up today! Now, the overwhelming majority of mass shooters get their guns via background checks. The exceptions are those who steal their firearms. AWR Hawkins is an award-winning Second Amendment columnist for Breitbart News, the host of the Breitbart podcast Bullets with AWR Hawkins, and the writer/curator of Down Range with AWR Hawkins, a weekly newsletter focused on all things Second Amendment, also for Breitbart News. He is the political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com. Sign up to get Down Range at breitbart.com/downrange.",
      "date": "30 Jul 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders: Wall Street Will Pay for Canceling of Student Debt",
      "url": "https://www.breitbart.com/2020-election/2019/09/13/bernie-sanders-wall-street-will-pay-for-canceling-of-student-debt/",
      "subtitle": "HOUSTON, TEXAS — Presidential candidate Sen. Bernie Sanders (I-VT) said Thursday after the Democrat debate that he would pay for free college by taxing Wall Street.",
      "author": "Kristina Wong",
      "content": " Asked by Breitbart News about his plan to wipe out student loan debts and what he would say to students who paid for college or decided not to go, Sanders did not address the specific question but said Wall Street would pay for free tuition at public colleges and universities. “Well what I’d say is that we’re paying for this program which would make all public colleges and universities and HBCUs tuition-free and cancel all student debt. We do this by a tax on Wall Street speculation,” he said. “And I think 11 years ago we bailed out the crooks on Wall Street, it’s appropriate for Wall Street now to help all the working families in this country,” he said. Sanders in July said he would cancel all of the nearly $1.6 trillion of existing student loan debt owed by roughly 45 million Americans as a bailout for millennials and the working class, according to Politico. Sanders’ higher education plan — canceling debt and free college — would cost $2.2 trillion. His campaign said the tax on Wall Street speculation would generate more than $2.4 trillion over the next decade. Some moderate Democrats have criticized that proposal, arguing that it would burden the wealthy and middle-class to help the working class, or that it would raise the national debt, which is currently $23 trillion. Before the debate, President Trump’s reelection campaign flew a plane with a banner that read: “Socialism Will Kill Houston’s Economy. Vote Trump 2020!” Earlier this month, Trump signed an executive order to eliminate federal student loan debt for disabled veterans, or about $30,000 in debt for about 25,000 eligible disabled veterans.",
      "date": "13 Sep 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Poll: Bernie Sanders Surging in New Hampshire",
      "url": "https://www.breitbart.com/politics/2019/08/13/poll-bernie-sanders-surging-in-new-hampshire/",
      "subtitle": "Sen. Bernie Sanders (I-VT) is surging in New Hampshire, according to a Gravis Marketing poll of Democrat primary voters released last week.",
      "author": "Hannah Bleau",
      "content": " A Gravis Marketing poll released last week shows the Vermont senator with a strong lead in the consequential early primary state. It asked 250 Democrat primary voters, “If the New Hampshire 2020 Democratic Presidential Primary were held today, who would you vote for?” Sanders leads the pack with 21 percent support, followed by Joe Biden (D) with 15 percent support, and Sen. Elizabeth Warren (D-MA) with 12 percent. Warren’s failure to capture second place is significant, as she and Sanders share similar far-left ideologies and represent New England states neighboring New Hampshire. Mayor Pete Buttigieg (D) came in with eight percent, one point above Sen. Kamala Harris’s (D-CA) seven percent support, further signifying the loss of the momentum she sufferred after the first Democrat debate. Rep. Tulsi Gabbard (D-HI) came in with five percent support, and Sen. Amy Klobuchar (D-MN), Andrew Yang (D), and Tom Steyer (D) all came in with four percent support. The remaining candidates garnered two percent or less. Eleven percent said they were “uncertain” as to who they would choose. Respondents were polled August 2–6. The margin of error is +/- 6.2 percent:  “It is important to note that Sen. Sanders won the New Hampshire Democratic Primary in 2016,” Gravis Marketing President Doug Kaplan stated. “However, it is unlikely that Sen. Sanders will have a repeat of his 2016 performance in the state due to the number of candidates in the race this time,” he added. Sanders’ surge in the Granite State does not appear to be a fluke. The current Real Clear Politics average shows Sanders gaining on Biden, who leads by less than three percent. The socialist senator has been drawing hundreds of people to his events on the campaign trail in New Hampshire, calling the president “an overt racist, sexist, xenophobic, religious bigot” during his stump speeches.",
      "date": "13 Aug 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders Says It Will Be a ‘Real Pleasure’ Defeating Trump",
      "url": "https://www.breitbart.com/politics/2019/10/04/bernie-sanders-says-it-will-be-a-real-pleasure-defeating-trump/",
      "subtitle": "Sen. Bernie Sanders (I-VT) on Thursday evening tweeted a message to President Trump, telling him that it will be a “real pleasure” defeating him in 2020.",
      "author": "Hannah Bleau",
      "content": " “It’s going to be a real pleasure defeating you,” Sanders wrote in response to a Trump tweet, describing far-left “Squad” member Rep. Alexandria Ocasio-Cortez (D-NY) as a “wack job”:  Trump’s tweet came in reponse to a viral clip of a town hall attendee telling the socialist lawmaker that we must “eat the babies” to save the planet from climate change. The extremist, antisemitic LaRouche PAC later claimed responsibility for the prank:  Sanders and Ocasio-Cortez have been more vocal about their support of one another in recent days. The two were spotted dining together at the Penny Cluse Cafe in Burlington, Vermont, last Saturday. They were joined by Sanders’ wife, Jane, as well as his campaign manager, Faiz Shakir:  Days later, Ocasio-Cortez defended Sanders’ call to eliminate the existence of billionaires. “‘Billionaires should not exist’ does not mean certain people should not exist,” she tweeted. “It means no person should have a billion dollars.” She added that the “ascent of billionaires is a symptom & outcome of an immoral system”:  The freshman lawmaker has yet to officially endorse a Democrat candidate, but she told CNN in May that the Democrat Party needed a candidate who has a “coherent worldview and logic from which all these policy proposals are coming forward,” and cited both Sanders and Sen. Elizabeth Warren (D-MA):  Sanders – who is in third place with 16.8 percent support, as the current Real Clear Politics average indicates – is recovering from an emergency heart procedure following reports of chest discomfort during a campaign stop on Tuesday. Doctors successfully inserted two stents to address the arterial blockage. Sanders’ wife Jane said he is recovering, “talking with us about policies,” and “joking with doctors and nurses.” He plans on participating in the October 15 debate at Otterbein University in Westerville, Ohio:   ",
      "date": "4 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders Spox Cardi B Named as Bloods Gang Member",
      "url": "https://www.breitbart.com/entertainment/2019/09/21/bernie-sanders-spox-cardi-b-named-as-bloods-gang-member/",
      "subtitle": "Rapper and Bernie Sanders presidential campaign advocate Cardi B denied the accusation that she is a member of the Nine Trey Gangsta Bloods gang, a claim made by incarcerated rapper Tekashi 69.",
      "author": "Kyle Morris",
      "content": " While Cardi B made it clear that she has “never been” or had connections to the Nine Trey Gangsta Bloods gang, she wrote that she is in fact a Blood. “You just said it yourself …Brim not 9 Trey,” the rapper-activist wrote in a now-deleted tweet. “I never been 9 Trey or associated with them.” According to TMZ, a representative for Cardi B denied that she is a member of the Bloods, saying “This is not true.” Tekashi, who is on trial for racketeering, drug trafficking, and other crimes, claimed Thursday during a court appearance that fellow New York City rapper Jim Jones is a member of the notorious Nine Trey Gangsta Bloods gang. Cardi B, of course, is a virulent critic of President Donald Trump. The rapper attacked Trump, saying “I hate him,” in April while endorsing Sanders’ presidential bid. She was featured in a July presidential campaign video from Sen. Bernie Sanders (I-VT). The “Invasion of Privacy” rapper was praised by the White House hopeful who said, “She’s really smart.”  Sanders also sat down with Cardi B for a twelve minute interview where he discussed tax hikes and minimum wage increases with her. Follow Kyle on Twitter @RealKyleMorris and Facebook.",
      "date": "21 Sep 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Media Bails on Bernie Sanders ‘Field of Dreams’ Game Due to Fundraising Email",
      "url": "https://www.breitbart.com/sports/2019/08/20/watch-bernie-sanders-plays-softball-campaigns-at-iowas-field-of-dreams/",
      "subtitle": "Democrat candidate for president and self-avowed socialist, Senator Bernie Sanders, held a rally and played a game of softball at Iowa’s famed “Field of Dreams” on Tuesday.",
      "author": "Warner Todd Huston",
      "content": " The game was played between Sanders’ campaign staffers and some local members of the Leaders Believers Achievers Foundation, a nonprofit that caters to the needs of kids, Yahoo reported. In news footage of the event, Sanders is seen pitching, hitting and running the bases.  Despite the fun day at the “Field of Dreams” park — the site of the filming of the 1980s sports movie of the same name — the event almost did not occur. Late last week the softball game was sold as a game between Sanders’ staffers and the news media. But some media outlets began having cold feet over the idea. CNN and ABC soon pulled out and barred their employees from participating for fear of looking as if they were supporting the Sanders campaign for president, Politico reported. Specifically, the media outlets were concerned about appearing in the game after the Sanders campaign sent out a fundraising email:  The cancellations sent the Sanders campaign scrambling at the last minute to save the event. Sanders has recently joined other Democrat candidates in complaining about the press. Just last week, for instance, Sanders said the Washington Post was giving him negative coverage because of the candidate’s criticism of Amazon and the paper’s owner, Jeff Bezos. Follow Warner Todd Huston on Twitter @warnerthuston.",
      "date": "20 Aug 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders: ‘Extremely Unfair’ to Compare My Socialism to Venezuela’s",
      "url": "https://www.breitbart.com/2020-election/2019/09/12/bernie-sanders-extremely-unfair-to-compare-my-socialism-to-venezuelas/",
      "subtitle": "Socialist Senator Bernie Sanders (I-VT) claimed it was “extremely unfair” to equate his radical leftist policies to those of Venezuelan dictator Nicolás Maduro during Thursday’s Democratic presidential primary debate.",
      "author": "Frances Martel",
      "content": " Sanders was responding to a question from moderator Jorge Ramos, a vocal opponent of the Venezuelan regime who Maduro temporarily imprisoned after disliking his questions during an interview for Univisión in February. Ramos questioned why Sanders had failed to condemn Maduro in the past and asked him to clarify in what way his embrace of socialism as a label for his personal ideology differed from the socialism that has brought Venezuelan society to a complete collapse. “Anybody who does what Maduro does is a vicious tyrant,” Sanders responded. “What we need is interntional and regional cooperation for free elections in Venezuela.” “To equate what goes on in Venezuela with what I believe is extremely unfair,” Sanders protested. Instead, he claimed that the socialism he supported was “what goes on in Canada and Scandinavia, guaranteeing healthcare to all people as a human right.” Under Maduro, Venezuela’s constitution refers to healthcare as a “fundamental social right, an obligation of the state [to provide], as part of the right to life.” Late dictator Hugo Chávez nationalized all hospitals in 2013, the year he died and Maduro took over. Since then, Venezuelan hospitals have suffered enormous shortages in medicine and key medical equipment. As many as 85 percent of pharmacies in Venezuela have no medicine and the country faces chronic shortages of nearly every medicine on the World Health Organization’s (WHO) list of drugs necessary to run a functional healthcare system. Maduro has repeatedly blocked humanitarian aid shipments from entering the country. In February, the same month Maduro arrested Jorge Ramos for asking about the status of political prisoners under his regime, Sanders told CNN that Venezuela still enjoyed “democratic operations,” refusing to call Maduro a dictator. “I think it’s fair to say that the last election was undemocratic, but there are still democratic operations taking place in that country,” Sanders said during a town hall discussion. Carmen Yulín Cruz, a Sanders campaign co-chair and mayor of San Juan, Puerto Rico, refused to condemn the human rights situation in Venezuela during an interview with Jorge Ramos in July. She also attempted to distance Sanders from the “socialist” moniker, saying she did not use it herself because, “especially for Latinos,” socialism is often equated to “authoritarianism.” While Sanders called Maduro a “tyrant” on Thursday, Maduro has had kind words for Sanders. In 2016, Maduro condemned the United States as a dictatorship, claiming that the fact that “our revolutionary friend” Sanders did not win the Democratic primary that year was proof that “in the United States, the people do not have social rights.” Follow Frances Martel on Facebook and Twitter.",
      "date": "12 Sep 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders, Surging: Our Goal is ‘Transforming the Economy and the Government of the United States’",
      "url": "https://www.breitbart.com/2020-election/2019/08/13/bernie-sanders-transforming-new-hampshire/",
      "subtitle": "BERLIN, New Hampshire — Sen. Bernie Sanders (I-VT) told a packed breakfast crowd at the White Mountain Chalet Caterers that the goal of his campaign was “transforming the economy and the government of the United States, so that it works for all of us and not just the one percent.”",
      "author": "Joel B. Pollak",
      "content": " Sanders spoke just moments after a new Gravis poll suggested that he had taken the lead in what is largely a three-way race in the Granite State, surpassing former vice president Joe Biden and Sen. Elizabeth Warren (D-MA).  Sanders’s line recalled a promise made by then-Sen. Barack Obama (D-IL) a few days before the 2008 election, when he declared that his goal was “fundamentally transforming the United States of America.” The socialist senator from neighboring Vermont told the enthusiastic crowd that while many of his ideas would be labeled as radical, many of them were now being adopted across the country. He cited his proposal, four years ago, to provide free tuition for community college, which he noted many cities and states were now considering. He said that now other candidates were adopting his proposal to cancel all student debt. “If this campaign is about anything, it’s asking people to ask the simple question of why not — why can’t we do it? Why was it acceptable for the Congress — against my vote — to bail out … the crooks on Wall Street in 2008? But when it comes to young people today who are struggling … ‘Well, we can’t do that, it’s too radical.’ “What this campaign is about is asking the American people to consider: why not — why can’t we do it?” he repeated. Likewise, he said, it should be possible for the U.S. to “guarantee health care as a human right.” Sanders repeated a line he has used at other events, labeling President Donald Trump as a bigot: “I never, ever would have believed that we would have a president who is an overt racist, and a xenophobe, and a sexist.” He also told supporters that his campaign was best-placed to defeat Trump, adding: “We need to transform the economics of this country and the politics of the country, and we think we are the best campaign to do that as well.” Echoing the slogan of the “Occupy Wall Street” movement, Sanders declared: “In the end, they are the one percent, and we are the 99 percent, and 99 is a lot bigger than one.” On recent mass shootings, Sanders blamed Republican leaders for stopping gun control legislation: “You have a Republican Party intimidated by the N.R.A. — that’s it, end of discussion.” It was just one more example, he said, of a powerful, wealthy special interest group standing in the way of change. One woman asked Sanders about the Trump administration’s recent overhaul of the Endangered Species Act. He replied: “My God, we are losing specie after specie [sic], it’s a terrible thing.” A left-wing Jewish supporter from Vermont asked Sanders what he would do to end the Israeli “occupation.” He said that the U.S. should use its financial leverage over Israel to oppose its “racism,” though he also said Palestinian leaders were “corrupt.” He said the U.S. should “use our clout to bring people together” for peace in the region. Asked what he would do about jobs in the private health insurance industry, Sanders acknowledged there would need to be a “transition,” and that the focus would be on training people to deliver actual health care, rather than administrative functions: “We don’t need more people sitting around a desk” evaluating insurance claims, he said. One supporter asked why Sanders had supported Hillary Clinton after a corrupt Democratic nomination process — what he called “one of the biggest stolen elections in our political history.” Sanders said that he did not see it that way: while the superdelegate system was corrupt, he said, there was a binary choice between Clinton and Trump. Asked why he was not “calling out” rival Democratic candidates who had borrowed his socialist ideas, Sanders said he was “proud” that his ideas had spread. Joel B. Pollak is Senior Editor-at-Large at Breitbart News. He earned an A.B. in Social Studies and Environmental Science and Public Policy from Harvard College, and a J.D. from Harvard Law School. He is a winner of the 2018 Robert Novak Journalism Alumni Fellowship. He is also the co-author of How Trump Won: The Inside Story of a Revolution, which is available from Regnery. Follow him on Twitter at @joelpollak.",
      "date": "13 Aug 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders: Use U.S. Aid As ‘Leverage’ Against ‘Racism’ in Israel",
      "url": "https://www.breitbart.com/2020-election/2019/08/13/bernie-sanders-use-u-s-aid-as-leverage-against-racism-in-israel/",
      "subtitle": "FRANCONIA, New Hampshire — Sen. Bernie Sanders (I-VT) told a town hall in Berlin, New Hampshire Tuesday morning that as president, he would use U.S. aid to Israel as “leverage” against “racism” there.",
      "author": "Joel B. Pollak",
      "content": " Sanders was asked by a young Jewish left-wing activist from Vermont — who described ending Israel’s “occupation” as a “moral imperative” from a religious perspective — why it mattered to him to “fight to end the occupation.” The question won loud applause from the audience, which packed the White Mountain Chalet Caterers for breakfast with the candidate, who is surging in the polls in New Hampshire, overtaking former vice president Joe Biden in some surveys. After commenting on the need for young people to turn out to vote, Sanders addressed her question: Look, I was — you know, it’s a funny thing. All that I have ever said on this issue is that U.S. foreign policy should be even-handed. That’s all. Even-handed. And that you have to — we respect Israel, Israel has ever right in the world to live in peace and security, but so do the Palestinian people! (Applause) And as somebody who is proudly Jewish, to be critical of a right-wing Netanyahu government in Israel is not to be antisemitic. (Applause) So what you have, is a situation — and by the way, the fault is not all with Israel, you’ve got very poor and corrupt Palestinian leadership — but what the goal of the United States has got to be, is to bring people in the region together, the Palestinians and the Israelis, to create a kind of workable peace that works for both parties, not just one. And your point is well-taken. The United States government gives a whole lot of money to Israel. And I think we can leverage that money to end some of the racism that we have recently seen in Israel. Sanders did not elaborate on what he meant by “racism.” To many anti-Israel activists and Arab states, the very existence of Israel, and the Zionist ideology of Jewish national self-determination, is by definition racist. Previously, Sanders has referred to the government of Israeli Prime Minister Benjamin Netanyahu as “racist.” Sanders has also suggested that he would move the U.S. embassy in Israel back from Jerusalem to Tel Aviv. Joel B. Pollak is Senior Editor-at-Large at Breitbart News. He earned an A.B. in Social Studies and Environmental Science and Public Policy from Harvard College, and a J.D. from Harvard Law School. He is a winner of the 2018 Robert Novak Journalism Alumni Fellowship. He is also the co-author of How Trump Won: The Inside Story of a Revolution, which is available from Regnery. Follow him on Twitter at @joelpollak.",
      "date": "13 Aug 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders Says He’s Up to the Stress of the Presidency Despite Heart Attack",
      "url": "https://www.breitbart.com/politics/2019/10/15/bernie-sanders-says-hes-up-stress-presidency-despite-heart-attack/",
      "subtitle": "Sen. Bernie Sanders (I-VT) said he will convince Democrat voters – who are concerned about his health following his recent heart attack – that he is up for the stress of the presidency by mounting a “vigorous campaign” all over the country.",
      "author": "Hannah Bleau",
      "content": " “You’re 78 years old and you just had a heart attack,” CNN’s Erin Burnett stated. “How can you reassure Democratic voters that you’re up to the stress of the presidency?” Sanders responded by announcing a “major rally” in Queens and teased an appearance from a “special guest”– possibly Rep. Alexandria Ocasio-Cortez (D-NY), who was spotted dining with the socialist senator in Burlington, Vermont, last month. “Well, let me all invite you to a major rally we’re having in Queens, New York. Bernie Sanders.com. We’re going to have a special guest at the event, and we are going to be mounting a vigorous campaign all over this country,” Sanders said. “That is how I think I can reassure the American people,” he continued, thanking people for their support following his health scare. “Let me take this moment, if I might, to thank so many people all over this country – including many of my colleagues up here – for their love, for their prayers, for their well-wishes,” Sanders said. “I just want to thank you from the bottom of my heart, and I’m so happy to be back with you this evening,” he added.",
      "date": "15 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders: ‘Health Care as a Human Right’ Applies to Illegal Aliens",
      "url": "https://www.breitbart.com/2020-election/2019/07/30/bernie-sanders-health-care-as-a-human-right-applies-to-illegal-aliens/",
      "subtitle": "Sen. Bernie Sanders (D-VT) said during the second Democrat presidential debate on Tuesday that he would support giving health care to illegal immigrants.",
      "author": "Haris Alic",
      "content": " “I happen to believe that when I talk about health care as a human right, that applies to all people in this country,” Sanders said when asked about the issue by CNN’s debate moderators. The self-described Democratic socialist added that “under a Medicare for All, single-payer” system, the U.S. could afford such an expense. Sanders has long supported the position, though nearly 60 percent of Americans oppose giving health care to illegal immigrants, according to a CNN poll from last month. Later in the debate, Sanders also signaled he was opening to giving free college tuition to illegal immigrants. When pushed by the moderators why that would not simply incentivize more foreign nationals to enter the country illegally, Sanders mumbled briefly about border security before shifting to an attack on President Donald Trump. “What Trump is doing through his racism and xenophobia is demonizing a group of people,” Sanders said. “These people coming to our country are not criminals, they are human beings.”",
      "date": "30 Jul 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders on Elizabeth Warren: Says ‘She Is a Capitalist Through Her Bones — I’m Not’",
      "url": "https://www.breitbart.com/clips/2019/10/13/bernie-sanders-on-elizabeth-warren-says-she-is-a-capitalist-through-her-bones-im-not/",
      "subtitle": "null",
      "author": "Pam Key",
      "content": " On Sunday’s broadcast of  ABC’s “This Week,” 2020 Democratic presidential candidate Sen. Bernie Sanders (I-VT) noted his 2020 Democratic presidential nomination race opponent Sen. Elizabeth Warren (D-MA) was a self-proclaimed “capitalist,” while he was not. Sanders said, “I think she’s a very, very good senator, but there are differences between Elizabeth and myself. Elizabeth, as you know, said she’s a capitalist through her bones. I’m not. I think the situation we face in this country of the greed and corruption that is existing in Washington, that is existing at the corporate elite level where you have massive amounts of price-fixing going on with the drug companies.” “We’re the only major country on earth not to guarantee health care, where we have right now as we speak in the fossil fuel industry, you have companies making billions of dollars a year in profit,” he continued. “By the way, they’re destroying the planet. Business as usual and doing it the old fashion way is not good enough. What we need is, in fact — I don’t want to get people to nervous—we need a political revolution. I’m the only candidate that’s going to say to the ruling class, the corporate elite, enough with your greed and corruption. We need real change.” Follow Pam Key on Twitter @pamkeyNEN",
      "date": "13 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders Campaign: Don’t Blame Us for Dayton; Blame Trump for El Paso",
      "url": "https://www.breitbart.com/2020-election/2019/08/06/bernie-sanders-campaign-dont-blame-us-for-dayton-blame-trump-for-el-paso/",
      "subtitle": "The presidential campaign of Sen. Bernie Sanders (I-VT) has responded to reports that the gunman who committed a mass shooting in Dayton, Ohio, supported Sanders by denying any responsibility — but suggesting that President Donald Trump bears responsibility for the mass shooting in El Paso, Texas, the day before.",
      "author": "Joel B. Pollak",
      "content": " Breitbart News reported Sunday evening that a Twitter account linked to the Dayton, Ohio, shooter had been taken down, and included support for socialism and Sen. Elizabeth Warren (D-MA). The Dayton Daily News reported Monday evening that the shooter had left-leaning political opinions and supported gun control. CNN reported Monday evening that the Twitter account had supported Sanders and it had expressed “extreme” left-wing views. In a statement released Tuesday evening, veteran Sanders campaign aide Jeff Weaver said: Anyone who thinks that political change should come from the barrel of a gun is anathema to what Bernie has advocated for decades — non-violent mass political action. Senator Sanders and our entire campaign are repulsed by the despicable massacres we have witnessed. We asked Donald Trump to condemn white nationalism and anti immigrant [sic] demonization. We are not holding our breath.  President Trump’s statement on Monday from the White House in fact included an explicit denunciation of white supremacy: ” In one voice, our nation must condemn racism, bigotry, and white supremacy.  These sinister ideologies must be defeated.  Hate has no place in America.” In August 2017, after the Charlottesville riots, President Trump made a similar statement: “Racism is evil.  And those who cause violence in its name are criminals and thugs, including the KKK, neo-Nazis, white supremacists, and other hate groups that are repugnant to everything we hold dear as Americans.” He has been critical of illegal aliens, but not immigrants in general. There is no evidence to suggest that Trump inspired the El Paso shooter in any way. In a manifesto posted online that is widely attributed to the shooter, he stated: “My ideology has not changed for several years. My opinions … predate Trump and his campaign for president.” Weaver nonetheless implies Trump is somehow responsible. Joel B. Pollak is Senior Editor-at-Large at Breitbart News. He earned an A.B. in Social Studies and Environmental Science and Public Policy from Harvard College, and a J.D. from Harvard Law School. He is a winner of the 2018 Robert Novak Journalism Alumni Fellowship. He is also the co-author of How Trump Won: The Inside Story of a Revolution, which is available from Regnery. Follow him on Twitter at @joelpollak.",
      "date": "6 Aug 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders Unveils Massive $16 Trillion Green New Deal Plan",
      "url": "https://www.breitbart.com/politics/2019/08/22/bernie-sanders-unveils-massive-16-trillion-green-new-deal-plan/",
      "subtitle": "Sen. Bernie Sanders (I-VT) released his plans for a Green New Deal, accompanied by a monstrous $16 trillion price tag.",
      "author": "Hannah Bleau",
      "content": " Sanders calls climate change the “single greatest challenge facing our country,” citing “extreme” weather phenomena like floods, droughts, wildfires, and hurricanes, despite the fact that those occurrences have existed since the beginning of time. Sanders even suggests that climate change has a racial element to it, arguing the effects of climate change affect “communities of color,” particularly. He warns “immediate” action is necessary, likening the “crisis” to the challenges former President Franklin D. Roosevelt faced in the 1940s, leading to the creation of the New Deal. Sanders’ plan promises to effectively reverse the “crisis” while simultaneously creating 20 million jobs and reaching “100 percent renewable energy for electricity and transportation by no later than 2030 and complete decarbonization by at least 2050,” per the United Nations Intergovernmental Panel on Climate Change’s guidelines. A $16.3 trillion public investment is necessary to make those goals a reality, which falls in line with Rep. Alexandria Ocasio-Cortez (D-NY), who said any viable climate change plan needed to come with a $10 trillion price tag – at least– in order to “have a shot.” Sanders says we must “directly invest a historic $16.3 trillion public investment toward these efforts, in line with the mobilization of resources made during the New Deal and WWII, but with an explicit choice to include black, indigenous and other minority communities who were systematically excluded in the past.” However, he claims the investment will effectively “pay for itself” over 15 years and that the price of inaction will cost far more, citing experts who say that doing nothing will cost the U.S. “$34.5 trillion in economic activity” by 2100. He plans to pay for the $16.3 trillion plan with additional taxes on the fossil fuel industry, and he plans to “prosecute and sue” them for the damage ravaged on the planet. Sanders’ exhaustive plan covers virtually every angle of the climate change “crisis,” from promising to “fully electrify and decarbonize” the transportation sector, to investing $1.12 billion in “tribal land access and extension programs,” to providing “oral translation assistance to USDA, FDA, and DOJ offices for non-English speaking farmers,” to pouring $200 billion in the Green Climate Fund: Despite the major shortcomings of the Paris Climate Agreement, one primary reason why the globe was able to come together to sign the Paris Climate Agreement was that major developed nations like the United States finally recognized that they had an outsized role in the creation of the climate crisis, and an outsized obligation to less industrialized nations to help them achieve the same kind of carbon pollution emissions reductions while improving the quality of life in those countries. In order to help countries of the global south with climate adaptation efforts, the U .S . will invest $ 200 billion in the Green Climate Fund for the equitable transfer of renewable technologies, climate adaptation, and assistance in adopting sustainable energies. U.S. leadership can ensure that the developing world secures reliable electricity, reduces poverty and pollution-related fatalities, creates greater net employment, and improves living standards all while reducing greenhouse- gas emissions. Sanders also uses his plan as a pitch to drastically expand existing entitlement programs, like the Supplemental Nutrition Assistance Program (SNAP) and the Low -Income Home Energy Assistance Program (LIHEAP). The plan states in part: Energy assistance. While we do not expect energy prices to spike because the federal government is going to weatherize homes, electrify heating, and keep electricity prices stable, we still want to ensure that families are protected during the transition. We will expand the Low -Income Home Energy Assistance Program (LIHEAP) by $ 25 billion to help low-income families pay their heating and cooling bills. Additionally, the program will be expanded to provide 10 percent of program costs for maintenance of new efficient heating and cooling systems and technical assistance for the installation and use of new furnaces, heat pumps, boilers, and other upgrades for the duration of the 10-year transition. Ensure a hunger- free transition. Because the cost of energy and food are so intertwined, we will provide $ 215 . 8 billion for free, universal school meals, including breakfast, lunch and snacks. We will expand the Supplemental Nutrition Assistance Program (SNAP) by $311billion to increase the benefits from the ” thrifty plan which provides inadequate benefits to the more generous low-cost food plan, include those with incomes up to 200 percent of the federal poverty line, remove punitive work requirements, remove barriers for college students to access SNAP , and ensure are not denied benefits due to past interaction with the criminal justice system . We will also expand the SNAP program and benefits to the people of Puerto Rico, the Northern Mariana Islands, and American Samoa so they are on par with the benefits in the continental United States. “We need a president who has the courage, the vision, and the record to face down the greed of fossil fuel executives and the billionaire class who stand in the way of climate action,” his plan states. “We need a president who welcomes their hatred. Bernie will lead our country to enact the Green New Deal and bring the world together to defeat the existential threat of climate change,” it continues. The release of Sanders’ plan comes on the heels of Gov. Jay Inslee’s (D) departure from the presidential race. Inslee was the only candidate to build his entire campaign on the sole issue of climate change. “I have seven grandchildren, and I’m going to be damned if I’m going to leave them a planet that is unhealthy and uninhabitable,” Sanders told the New York Times.",
      "date": "22 Aug 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders Unveils Plan to Get ‘Corporate Money Out of Politics’ at the DNC",
      "url": "https://www.breitbart.com/politics/2019/10/07/bernie-sanders-unveils-plan-get-corporate-money-out-politics-dnc/",
      "subtitle": "Sen. Bernie Sanders (I-VT) on Monday unveiled his plans to get “corporate money out of politics”– a plan which would affect the DNC, specifically.",
      "author": "Hannah Bleau",
      "content": " Sanders – who is recovering from a heart procedure after experiencing a heart attack last week– unveiled his plan to reduce the influence of corporate money in politics, and vowed to “ban corporate contributions to the Democratic Party Convention.” “In 2016, seventeen donors gave three-quarters of the Democratic National Convention funding, with large corporations like Bank of America, Peco Energy, Comcast, and Facebook each donating over $1 million,” Sanders website states. “Their lobbyists were everywhere and filled the VIP suites. This type of corporate sponsorship is a corrupting influence and must end if politicians are going to represent the American people,” it adds. The bulk of Sanders’ proposal targets the “influence of corporations” at the Democratic National Committee. He pledges a lifetime ban on lobbying for National Party Chairs and Co-Chairs and aims to diminish their influence by banning chairs and co-chairs from working for entities: The presidential hopeful also vows to ban donations from both corporations and lobbyists, and calls to “institute a lifetime lobbying ban for former members of Congress and senior staffers.” Another facet of Sanders’ plan is to “ban advertising during presidential primary debates” due to the “outrageous sums of money” media outlets charge to run ads during debates. Sanders uses CNN as an example: This year CNN reportedly required a commitment of $300,000 before a sponsor could buy ad time during the presidential debates, and 30 seconds of air time can cost around $110,000,” Private media outlets are making enormous sums of money during events that are meant to inform the public about their candidates. Furthermore, many of their advertisers have vested interest in who is elected. This type of influence must end. He also calls to end corporate influence on presidential inaugurations, arguing that it is “absolutely absurd that these entities are allowed to spend enormous sums of money in an attempt to garner favor with the President and Vice President of the United States.” “Our grassroots-funded campaign is proving every single day that you don’t need billionaires and private fundraisers to run for president,” Sanders said in a statement. “We’ve received more contributions from more individual contributors than any campaign in the history of American politics because we understand the basic reality that you can’t take on a corrupt system if you take its money,” he added. Sanders has raised more than any other Democrat presidential candidate in the third quarter, reporting $25.3 million from 1.4 million individual donations. The average donation was $18.07, according to the Sanders campaign.",
      "date": "7 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Poll: Bernie Sanders Taking the Lead in New Hampshire",
      "url": "https://www.breitbart.com/politics/2019/09/11/poll-bernie-sanders-taking-the-lead-in-new-hampshire/",
      "subtitle": "Sen. Bernie Sanders (I-VT) is leading in the early primary state New Hampshire, according to a Franklin Pierce University-Boston Herald poll released Wednesday.",
      "author": "Hannah Bleau",
      "content": " The survey – taken September 4- 10, 2019, among 425 likely Democrat primary voters – shows the majority choosing the Vermont senator as their first choice with a commanding lead, clocking in with 29 percent support. National frontrunner Joe Biden (D) comes in second place with 21 percent support, followed by Sen. Elizabeth Warren (D-MA) with 17 percent support. The remaining candidates do not come close to the top tier, with Sen. Kamala Harris (D-CA) coming in a distant fourth, 11 points behind Warren with six percent support. Andrew Yang (D) came in fifth place with five percent support followed by Mayor Pete Buttigieg (D) with four percent. The margin of error is +/- 4.8 percent, putting Sanders lead outside of a statistical error. A Gravis Marketing poll released last month also signaled a Sanders surge in his neighboring state, showing the socialist senator topping Biden by six percent – 21 percent to Biden’s 15 percent. Warren came in third with 12 percent support, the poll showed. However, a CBS News/YouGov Tracker survey released Sunday showed Warren gaining a narrow edge in New Hampshire, besting her counterparts with 27 percent support to Biden’s 26 percent and Sanders’ 25 percent:  As Breitbart News reported, there are rumblings that Warren is growing a strong coalition of support in the state, with many undecided delegates reportedly leaning toward Warren. Politico spoke to 100 delegates in New Hampshire and reported that many expressed skepticism on Biden. Politico reported: Dozens of state representatives, party leaders, operatives and volunteers said they weren’t planning to vote for the former vice president in the nomination contest — and many publicly aired concerns about his age, energy and gender. … The complaints about Biden from party soldiers often centered on his campaigning skills, and a desire for more diversity in Democratic leadership. Notably, few undecided delegates named Biden when asked who they were leaning toward. “I’m tired of old white guys telling me what to do,” said Rachel Cisto, an uncommitted delegate who is leading toward Warren or Sanders. The news of Sanders’ lead follows his campaign’s announcement of 53 endorsements from elected officials, activists, and community leaders in the Granite State.",
      "date": "11 Sep 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Alveda King: Bernie Sanders’ Population Control Will Target Black Communities",
      "url": "https://www.breitbart.com/radio/2019/09/07/alveda-king-bernies-population-control-will-target-black-communities/",
      "subtitle": "A “population control” proposal pushed by Sen. Bernie Sanders (I-VT) will target “black and brown” people, unborn children, the sick, and elderly people, said Dr. Alveda King, director of Priests for Life’s Civil Rights for the Unborn project and the niece of Rev. Martin Luther King Jr., in a Friday interview on SiriusXM’s Breitbart News Tonight with hosts Rebecca Mansour and special guest host Rick Manning.",
      "author": "Robert Kraychik",
      "content": " During a Wednesday “town hall” hosted by CNN regarding “climate change,” Sanders accepted the premise of population growth on Earth being “unsustainable,” requiring government controls over procreation. Sanders’s proposal, said King, reminded her of the 1973 dystopian science fiction film Soylent Green, in which overpopulation and poverty was addressed through euthanization of the elderly and processing their remains into food. “In light of the shocking [statements] that we just heard about population control and all of that, cannibalism, many years ago, I watched a movie with Charlton Heston,” recalled King. “It was called Soylent Green, and they were concerned about population growth and all that and the old people were living too long, so they came up with this delicious wafer that they began to feed the public with, and it turns out that Soylent Green was people, the older people, and they were told that they were going to Nirvana… and then they processed them and put them in this little green wafer, and I thought about that when I heard this particular report, and I said, ‘My God, they’re turning us into cannibals.'” LISTEN:\n\n\n\nCNN’s audience and its host, Anderson Cooper, offered no push-back to Sanders’s acceptance of “population control” as a government imperative. Manning reflected, “The thing that shocked me is that Bernie Sanders can say what he said and essentially justify not just abortion, but essentially homicide, killing people, eliminating excess population, and he could say that, and people didn’t boo him overwhelmingly and say, ‘No, you don’t get to do that.'” “They didn’t blink,” noted King of CNN’s audience’s lack of reaction to Sanders’s “population control” proposal. Manning replied, “They accepted it out of hand, and it shows you the sickness that exists.” King asked, “Do they even know who’s going to be chosen to be eliminated under such a plan? It might be them. They don’t think. Oh, my God.” Left-wing desires previously withheld from the public are “in your face, now,” added King: “What makes him so bold that now he wants to put it out there for everybody to hear? That’s what I don’t understand.” King remarked, “They kill babies in the womb, and that’s going to be the sick and the elderly, as well. You have to know that. “Population control” measures will target “black and brown” people, determined King, highlighting the policy’s advocates’ justification of such a measure as a poverty-reduction strategy. King said, “It reminds you of what Margaret Sanger said, ‘Colored people are like weeds that need to be exterminated. We don’t want that word to get out, so let’s get some of their ministers on our side, and they can keep the more rebellious ones — in other words, the ones who can think — in line.’ So this is not new. It’s been happening for decades and decades, but right now it’s really in our faces. So, what are we going to do about it? You’re doing something. You’re getting it out. You’re getting information out. I’m grateful to be invited to have this conversation with you this evening. So it is racist.” Sterilization measures would be included in “population control” laws, King added. “Their killing centers are on or near streets named after Martin Luther King Jr.,” said King of Planned Parenthood’s abortion centers. “They’re in the African-American communities saying, ‘Oh, we’re helping the underserved.’ Well you’re helping by killing the underserved? How is killing somebody going to serve them? Frank Pavone of Priests for Life said, ‘You’ve got to know the difference between serving the public and killing the public.'” “Babies, sick, and old people, in that order,” King concluded. “If somebody’s sick, we have too many people, anyway. Don’t really try to treat him, just let him die comfortably. Euthanize him. Somebody’s old? Well, put them on the lower end of the healthcare providers. Babies in the womb? Well, we don’t know when they’re human.” Breitbart News Tonight broadcasts live on SiriusXM Patriot channel 125 weeknights from 9:00 p.m. to midnight Eastern or 6:00 p.m. to 9:00 p.m. Pacific. Follow Robert Kraychik on Twitter @rkraychik.",
      "date": "7 Sep 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders Had a Heart Attack, Doctors Confirm",
      "url": "https://www.breitbart.com/politics/2019/10/04/bernie-sanders-had-a-heart-attack-doctors-confirm/",
      "subtitle": "Sen. Bernie Sanders (I-VT) experienced a heart attack this week, his campaign confirmed in a statement following the Vermont senator’s release from the hospital on Friday.",
      "author": "Hannah Bleau",
      "content": " Sanders underwent an emergency heart procedure this week after experiencing chest discomfort at a campaign event on Tuesday. A medical evaluation determined a blocked artery, and two stents were successfully inserted. The presidential candidate was released from the hospital on Friday, and his campaign confirmed in a statement that doctors diagnosed him with a “myocardial infarction,” or heart attack. Doctors said Sanders’ three-night stay was “uneventful with good expected progress,” USA Today reports. “I want to thank the doctors, nurses, and staff at the Desert Springs Hospital Medical Center for the excellent care that they provided,” Sanders said in a statement following his release from the hospital. “After two and a half days in the hospital, I feel great, and after taking a short time off, I look forward to getting back to work,” he added:   Sanders is fully expected to participate in the October 15 Democrat primary debate at Otterbein University in Westerville, Ohio: ",
      "date": "4 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders Floats Global Population Control at CNN Climate Town Hall",
      "url": "https://www.breitbart.com/politics/2019/09/04/bernie-yes-im-courageous-enough-to-talk-about-population-control/",
      "subtitle": "Sen. Bernie Sanders (I-VT) told CNN’s climate change town hall attendees Wednesday night that he is willing to talk about population control, suggesting that abortion is key to addressing the climate crisis.",
      "author": "Hannah Bleau",
      "content": " “Human population growth has more than doubled in the last 50 years,” an attendee told Sanders, adding that the planet cannot sustain such growth. “I realize this is a poisonous topic for politicians but it’s crucial to face. Empowering women and educating everyone on the need to curb population growth seems a reasonable campaign to enact,” the attendee continued. “Would you be courageous enough to discuss this issue and make it a key feature of a plan to address climate catastrophe?” she asked. “The answer is yes,” Sanders said, arguing that population control – in the form of abortion and birth control, specifically – is something he “very, very strongly” supports. “The answer has everything to do with the fact that women in the United States of America, by the way, have a right to control their own bodies and make reproductive decisions,” Sanders said. “And the Mexico City agreement, which denies American aid to those organizations around the world that are – that allow women to have abortions or even get involved in birth control is totally absurd,” he continued. “So I think especially in poor countries around the world, where women do not necessarily want to have large numbers of babies and where they can have the opportunity to birth control to control the number of kids they have is something I very, very strongly support,” he added.",
      "date": "4 Sep 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders Promises to Erase Medical Debt",
      "url": "https://www.breitbart.com/politics/2019/08/31/bernie-sanders-promises-to-erase-medical-debt/",
      "subtitle": "Sen. Bernie Sanders (I-VT) revealed another piece of his plan to overhaul the health care system in America on Saturday, teasing his proposal to cancel $81 billion in past medical debt.",
      "author": "Hannah Bleau",
      "content": " “In the United States of America, your financial life and future should not be destroyed because you or a member of your family gets sick,” Sanders said in a statement, calling it “unacceptable.” “I am sick and tired of seeing over 500,000 Americans declare bankruptcy each year because they cannot pay off the outrageous cost of a medical emergency or a hospital stay,” he continued. “In the wealthiest country in the history of the world, 42 percent of Americans should not be losing their entire life savings two years after being diagnosed with cancer,” he added. That is why, Sanders said, his administration will erase $81 billion in existing medical debt across the board. Via The Hill: Sanders’s plan would cancel $81 billion in existing past-due medical debt, repeal parts of the 2005 Bankruptcy reform bill and ensure that unpaid medical bills do not impact one’s credit score. Sanders has hit the 2005 bill for eliminating “fundamental consumer protections,” accusing the bill of making it difficult for Americans to pay back medical debt by imposing stringent means tests. “It is nothing less than barbaric that the leading cause of bankruptcy in America is medical debt,” Sanders echoed in a tweet. “These people didn’t spend all their money on luxury items. Their crime was that they got sick. We are going to cancel all $81 billion in existing past-due medical debt,” he promised.  This is not the first time Sanders has promised to erase debt across the board. He also proposed to cancel $1.6 trillion in student debt via the College For All Act, which would cost roughly $2 trillion. That is in addition to his $16 trillion Green New Deal proposal and his plans to implement Medicare for All, which could cost  the U.S. anywhere from $32 trillion to $60 trillion over the next decade alone.",
      "date": "31 Aug 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Full Interview: Cardi B Asks Bernie Sanders About Tax Hikes for ‘Extreme Socialism’",
      "url": "https://www.breitbart.com/entertainment/2019/08/15/full-interview-cardi-b-asks-about-bernie-sanders-about-tax-hikes-for-extreme-socialism/",
      "subtitle": "Sen. Bernie Sanders (I-VT) released the full video of his interview with rap star Cardi B Thursday, which touched on President Trump’s “overt” racism, police brutality, free college, and free health care.",
      "author": "Hannah Bleau",
      "content": " The presidential candidate sat down for an interview with the “Please Me” rapper in a nail salon in Detroit and discussed a number of issues, ranging from police brutality to free health insurance.  “Cardi B’s nails are juuuust a little different than mine. Our views on the issues are pretty similar,” Sanders wrote in a tweet, along with the interview.  Sanders described Trump as an “overt racist” right off the bat, and Cardi B seemed to agree. “I’m trying to advocate the youth in my community because I feel like there’s a serious problem right now in America. We have this bully as a president, and the only way to take them out is somebody winning,” Cardi B, whose real name is Belcalis Almanzar, said. “You know, we got to get rid of Donald Trump obviously because Donald Trump is an overt racist,” Sanders said. “He’s way out there.” “But right now people are just not scared to show it,” the rapper agreed, pivoting the conversation to “police brutality against black men” and asking Sanders what he would do to change that. “I don’t want people thinking that we’re trying to attack the police. Because let me tell you something, there was this one time that I started to feel like I hate the police, they’re pigs,” Cardi B said. “But there’s a lot of cops that go in their jobs and they want to protect their people,” she conceded. “So we need police departments that look like the communities that they serve — we get rid of a lot of this militarization of the police department, which is a form of intimidating people,” Sanders said. The rap star, who has lamented excessive taxation in the past, asked the socialist senator how he can manage to “work around” voters who fear increased taxes. “People are just afraid to pay more in taxes than they are already paying, so how do you think we work around that?” the Grammy-winner asked. Sanders responded with lines familiar to those who have listened to his stump speeches, arguing that the benefits – in the form of free government health care – received will outweigh the additional taxation. “The overwhelming majority of the people will end up paying less than they’re currently paying in health care. Their taxes will go up but they’re not going to be paying premiums, deductibles, [or] copayments,” he said. Cardi B asked Sanders toward the end of the interview if he would be able to eliminate student debt. He repeated his pledge to make colleges and universities “tuition-free” but did not provide any additional details.",
      "date": "15 Aug 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders to ‘Change the Nature’ of His Campaign After Heart Attack",
      "url": "https://www.breitbart.com/2020-election/2019/10/08/bernie-sanders-to-change-the-nature-of-his-campaign-after-heart-attack/",
      "subtitle": "White House presidential candidate Sen. Bernie Sanders (I-VT) revealed Tuesday that he will reduce the amount of time he spends on the campaign trail for the foreseeable future after suffering a heart attack.",
      "author": "Joshua Caplan",
      "content": " Speaking to reporters outside his home in Burlington, Vermont, the senator said that while he intends to continue “actively campaigning,” he plans to “change the nature of the campaign” in order to ensure “I have the strength to do what I have to do.”  According to the presidential candidate, he was participating in roughly “five or six meetings a day, three or four rallies and town meetings and meeting with groups of people.” “I don’t think I’m going to do that,” said Sanders. Last Wednesday, Sanders’ campaign announced the 78-year-old underwent a heart procedure for a blocked artery and had canceled events “until further notice.” Sanders experienced chest discomfort during an event last Tuesday for which he sought medical evaluation for. His doctors said two stents were inserted into Sanders’s heart and that he was “conversing and in good spirits.” On Friday, Sanders was released from the hospital and took to Twitter to give his supporters an update on his condition. “I want to thank the doctors, nurses, and staff at the Desert Springs Hospital Medical Center for the excellent care that they provided. After two and a half days in the hospital, I feel great, and after taking a short time off, I look forward to getting back to work,” he tweeted. ",
      "date": "8 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie: ‘I Fear’ Biden Will Be Hillary 2.0—No ‘Energy and Excitement’",
      "url": "https://www.breitbart.com/politics/2019/06/03/bernie-i-fear-biden-will-be-hillary-2-0-no-energy-and-excitement/",
      "subtitle": "Sen. Bernie Sanders (I-VT) over the weekend said he fears that if Democrats nominate former Vice President Joe Biden in 2020, President Donald Trump will defeat him like he did Hillary Clinton in 2016 because voters will not be excited about Biden and his candidacy.",
      "author": "Tony Lee",
      "content": " Cenk Uygur of “The Young Turks” program asked Sanders if Democrats are on the verge of “making the same mistake that it did in picking Hillary Clinton, who lost to Donald Trump.” “I fear that it could be, I really do. I fear that you would have a campaign without a lot of energy and excitement,” Sanders replied, according to a Sunday RealClearPolitics transcript. “Could Joe beat Trump? Yeah, I think he could. I’m not saying he can’t. But I think we don’t want to make the same mistake that we made last time. And sometimes this is where the establishment talks to itself.” Sanders also took issue with the establishment’s conventional wisdom that Biden is the Democrat best positioned to win the Rust Belt states, arguing that Biden’s past support for NAFTA, bad trade deals with China, and the Iraq War will turn off a lot of voters in the Midwest who voted for Trump because they liked his economic nationalism and America-first foreign policy. “And why do I think we can do a good job in defeating Trump? Because in the issues that Trump beat Hillary Clinton on–trade, you go to the Midwest and say, ‘I voted for NAFTA, I voted for permanent normalized trade relations with China.’ Which is what Joe Biden did, you think that’s going to resonate terribly well in the Midwest? I don’t think it will. I lead the opposition against those disastrous trade agreements,” Sanders said. “You think going around the country and telling people, ‘I voted for the war in Iraq,’ which is what joe did. Think that’s going to resonate well with people? I don’t think so. It was probably the worst foreign policy blunder in the modern history of this country. I led the opposition to the war in Iraq. For those reasons, nationally and especially in the battleground states, we are the campaign that could rally young people, working people, people of color, to win this election.” Sanders then called out Democrats for ignoring the needs of working-class Americans, saying the party needs to understand that getting rid of Trump will not rid the forces that got someone like Trump elected in the first place. “What was that? It is because for too long the Democratic establishment has ignored the needs of working people all over this country. People work longer hours for lower wages—40 million people living in poverty. The only major country not to guarantee health care to all people as a right,” Sanders continued. “A vigorous effort to combat climate change, dealing with criminal justice reform, immigration reform. Those are issues that are not only the major issues facing this country, income and wealth inequality — how do you not talk about that? We have got to talk about that because it is the right thing to do and it is the way you win an election.” Biden, who is far from where the energy is on the left in today’s party and has not drawn big and enthusiastic crowds at his campaign events, has taken a commanding lead in nearly every state and national poll because Democrats think he is their best candidate against Trump. While kicking off his campaign in Philadelphia, Pennsylvania, Biden previewed what may become his best and go-to argument as the campaign season heats up, saying that Democrats will have no chance of getting any progressive policies enacted if they first do not beat Trump. “The first, most important plank in my climate proposal is, beat Trump. Beat Trump, beat Trump,” Biden said. Democrats on the left who support candidates like Sanders and Sen. Elizabeth Warren (D-MA) argue that Biden is not “woke” enough on a variety of economic and racial justice issues to inspire voters on the left to not only vote for him but to volunteer their time to convince others to do so. Biden’s backers, on the other hand, have been making the case to primary voters that Trump the president will be the best organizing tool for Democrats in 2020.",
      "date": "3 Jun 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Report: AOC, Omar & Tlaib to Endorse Bernie Sanders for President",
      "url": "https://www.breitbart.com/2020-election/2019/10/15/report-alexandria-ocasio-cortez-to-endorse-bernie-sanders-for-president/",
      "subtitle": "Far-left freshman congresswomen Reps. Alexandria Ocasio-Cortez (D-NY), Ilhan Omar (D-MN), and Rashida Tlaib (D-MI) are expected to endorse Sen. Bernie Sanders’s (I-VT) 2020 presidential campaign over the weekend, according to reports.",
      "author": "Joshua Caplan",
      "content": "  The Washington Post stated Tuesday that Ocasio-Cortez is expected to announce her support for Sanders’s White House bid alongside the senator on Saturday at his first rally since suffering a heart attack two weeks ago. “We’re looking forward to Saturday,” Ocasio-Cortez spokesperson Corbin Trent teased in a statement. During tonight’s CNN-New York Times’ Democrat presidential debate, Sanders teased that he would have a “special guest” at his “Bernie’s back” rally in Queens, New York. “The endorsement could be a blow for Sen. Elizabeth Warren (D-Mass.), who, like Sanders, is running on a platform of sweeping liberal change and who has emphasized her role as a female pioneer,” notes the Post. Ocasio-Cortez worked as a volunteer organizer for Sanders’s 2016 campaign. The development comes after Sanders said that he “misspoke” when he told reporters he may slow his frenetic campaigning pace after a recent heart attack. The Vermont senator backtracked in an interview with NBC News just a day after indicating that health concerns would force him to change “the nature” of his campaign, in the short term, at least. “We’re going to get back into the groove of a very vigorous campaign,” Sanders told NBC, downplaying the impact of the heat attack, which required him to be rushed to the hospital where he received two stents to clear a clogged artery in his heart. “People should think that I had a procedure which hundreds of thousands of people a year have,” Sanders continued. “People should think that according to the doctors I’m on the way to a full recovery.” The 78-year-old self-described democratic socialist was hospitalized after experiencing chest discomfort while campaigning in Las Vegas last week. His staff initially said the stents were inserted for a blocked artery, revealing only two days later that he had had a heart attack. Sanders told NBC it was “nonsense” to suggest his staff hadn’t been forthright about his condition. He said he was still talking to doctors and trying to understand what was going on. The Associated Press contributed to this report.",
      "date": "15 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders: ‘We Are Going to Impose a Moratorium on Deportations’",
      "url": "https://www.breitbart.com/politics/2019/09/14/bernie-sanders-we-are-going-to-impose-a-moratorium-on-deportations/",
      "subtitle": "Sen. Bernie Sanders (I-VT) told a group that he backs a moratorium on all deportations from the U.S., a video surfaced on Saturday revealed.",
      "author": "Hannah Bleau",
      "content": " The socialist senator told a group that, under a Sanders administration, the U.S. would cease ICE raids and deportations. “We’re gonna end the ICE raids which are terrorizing communities all across this country,” Sanders said. “We are gonna impose a moratorium on deportations,” he continued. “There are some things that a president can do with executive orders.”    The latter is a new policy position, according to a senior policy adviser who spoke to CNN’s Annie Grayer:  Sanders also told the group that Medicare for All and free college would extend to individuals residing in the U.S. illegally. “Let me also say something of which I have gotten into trouble and people will criticize me for,” Sanders said. “I am, as some of you know, supportive of a Medicare for All single-payer system and that means that everybody in the country has health care including the undocumented,” he continued. “And mark my words. You’ll see 30-second attacking me for that,” Sanders warned before adding that he also supports providing illegal aliens with free college. “And then you’ll see another set of 30-second ads because when I say I want to make public colleges and universities tuition-free, that also includes the undocumented,” Sanders continued. “Now I hope that as soon as possible the undocumented will not be undocumented,” he added. “That’s the goal”:  Sanders’ official immigration reform plan includes expanding DACA, “fundamentally restructuring ICE,” and forging a path towards citizenship, according to his official website.",
      "date": "14 Sep 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders Campaign to Host ‘Bernie’s Back’ Rally",
      "url": "https://www.breitbart.com/politics/2019/10/12/bernie-sanders-campaign-host-bernies-back-rally/",
      "subtitle": "Sen. Bernie Sanders’ (I-VT) 2020 presidential campaign announced Saturday in an email to supporters that it will host a “Bernie’s Back” rally next weekend.",
      "author": "Kyle Morris",
      "content": "  The rally, which is scheduled for October 19 at 1:00 p.m. ET, will be held at Queensbridge Park in New York City. According to the email, the event is free and open to the public with doors opening at 11:30 a.m. ET. The campaign also encouraged those that hope to attend the event to RSVP as entrance to the event is provided on a first-come, first-serve basis. Earlier this month, Sanders experienced a heart attack and was released from the hospital last week. As reported by Breitbart News’s Hannah Bleau, “A medical evaluation determined a blocked artery, and two stents were successfully inserted.” “I want to thank the doctors, nurses, and staff at the Desert Springs Hospital Medical Center for the excellent care that they provided,” Sanders said in a statement following his release from the hospital.  “After two and a half days in the hospital, I feel great, and after taking a short time off, I look forward to getting back to work,” he added. Follow Kyle on Twitter @RealKyleMorris and Facebook.",
      "date": "12 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders Promises Jobs for ‘Tens of Millions’ of Americans During Debate",
      "url": "https://www.breitbart.com/2020-election/2019/10/16/bernie-sanders-promises-jobs-for-tens-of-millions-of-americans-during-debate/",
      "subtitle": "Sen. Bernie Sanders (I-VT) promised jobs for “tens of millions of Americans” during the fourth Democrat debate in Westerville, Ohio, Tuesday night.",
      "author": "Katherine Rodriguez",
      "content": "  “You say your federal jobs guarantee is part of the answer to the threat of automation, that tens of millions of Americans could end up losing their jobs. Are you promising that you will have a job for every single one of those Americans?” asked CNN anchor Erin Burnett. “Damn right we will,” Sanders quickly responded, highlighting his plan to combat climate change as one way to create 20 million additional jobs in the economy. “These jobs will be good-paying, union jobs with strong benefits and safety standards in steel and auto manufacturing, construction, energy efficiency retrofitting, coding and server farms, and renewable power plants,” according to an outline of Sanders’ “Green New Deal” plan on his campaign website. “We will also create millions of jobs in sustainable agriculture, engineering, a reimagined and expanded Civilian Conservation Corp, and preserving our public lands,” the outline continued. Sanders’ climate plan also included nationalizing most of the U.S.’s energy production and drastically reducing carbon emissions. He has acknowledged his plan may cause job losses in the energy industry and promised to provide public assistance to those workers. “We will guarantee five years of a worker’s current salary, housing assistance, job training, health care, pension support, and priority job placement for any displaced worker, as well as early retirement support for those who choose it or can no longer work,” according to the climate plan. But Sanders had said during the debate that despite these promised jobs for “tens of millions of Americans,” taxes will also have to go up. When Sanders spoke about his “Medicare for All” bill on Tuesday, he acknowledged that “taxes will go up.”",
      "date": "16 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders to Join Rashida Tlaib for Tour of Michigan District",
      "url": "https://www.breitbart.com/politics/2019/10/16/bernie-sanders-to-join-rashida-tlaib-for-tour-of-michigan-district/",
      "subtitle": "Sen. Bernie Sanders (I-VT) will join Rep. Rashida Tlaib (D-MI) for a tour of the Michigan lawmaker’s district, the presidential hopeful announced on Wednesday.",
      "author": "Hannah Bleau",
      "content": " The news follows reports of coming endorsements from three of the “Squad” members– Tlaib, Rep. Alexandria Ocasio-Cortez (D-NY), and Rep. Ilhan Omar (D-MN). “There are few better examples of what unfettered corporate greed is doing to working people than what’s going on in Michigan,” Sanders said in a statement. He continued: I look forward to spending the day with Rashida, hearing directly from people in her district because their concerns speak to the broader needs of the working class around the country, especially affordable housing and guaranteeing quality education and health care for all.  Sanders’ announcement comes on the heels of Omar’s formal endorsement. “And we know in order to take on Trump, we’re going to need a unifier– someone who understands what the fight looks like and someone who is ready to defeat him,” Omar said in a video endorsement posted to Twitter. “I was one of the people inspired by the movement that the Senator has built. There was an America that I dreamed about. There is an America that most people believe in,” she said, adding that is just “an ideal” and “not reality yet.” “This is not just the fight for our lives. This is the fight for our democracy. This is the fight for a better future. One we can all be proud of,” she continued:  Sanders, who teased a potential Ocasio-Cortez endorsement during the presidential debate, essentially confirmed it is on its way, announcing the socialist lawmaker as the special guest of his rally in Queens this weekend:  Sanders’ appearance with Tlaib – who is also rumored to endorse the socialist presidential hopeful – is significant given Michigan’s status as a swing state and previously held Democrat stronghold until Trump’s defeat of Hillary Clinton in 2016. He secured the state with 47.3 percent to Clinton’s 47 percent.",
      "date": "16 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Gaffe: Joe Biden Gestures at Bernie Sanders When Referring to Vladimir Putin",
      "url": "https://www.breitbart.com/politics/2019/10/15/gaffe-joe-biden-gestures-bernie-sanders-when-referring-vladimir-putin/",
      "subtitle": "Former Vice President Joe Biden on Tuesday mistakenly gestured at Sen. Bernie Sanders when referring to Vladimir Putin, sparking laughter from the audience.",
      "author": "Charlie Spiering",
      "content": " “The fact of the matter is, you have Russia influencing and trying to break up NATO, what does the president do, he says ‘I believe Vladimir Putin,'” Biden said, gesturing to Bernie Sanders. “Excuse me,” Bernie Sanders asked as the audience laughed, “Vladimir Putin, here?” “No, no, no,” Biden stammered, giving Sanders a side-hug to express his affection for the veteran senator from Vermont.",
      "date": "15 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders: When I Win, I Will Be Your ‘Organizer-in-Chief’",
      "url": "https://www.breitbart.com/politics/2019/10/16/bernie-sanders-when-i-win-be-your-organizer-chief/",
      "subtitle": "Sen. Bernie Sanders (I-VT) said on Wednesday that he will not only be the commander-in-chief, but an “organizer-in-chief” if he becomes President of the United States.",
      "author": "Hannah Bleau",
      "content": " The presidential hopeful made the remark on social media following Tuesday’s debate in Westerville, Ohio, promising to “fundamentally change the nature of the presidency.” “When we win, we are going to fundamentally change the nature of the presidency,” Sanders tweeted. “I will not only be commander-in-chief, but organizer-in-chief. And we will take on the most powerful corporations and special interests”:  Sanders’ remark follows what many consider to be a solid debate performance, which was essential given his recent heart attack, as it sparked concerns about his overall health. Sanders, however, assured hesitant supporters that he is up for the stress of the job and said he will prove it by mounting a “vigorous campaign” across the nation. “Let me invite you all to a major rally we’re having in Queens, New York, berniesanders.com. We’re going to have a special guest at that event,” he said, teasing an endorsement from fellow socialist lawmaker Rep. Alexandria Ocasio-Cortez (D-NY). “And we are going to be mounting a vigorous campaign all over this country. That is how I think I can reassure the American people,” he said. Sanders thanked all those who sent their love, prayers, and support during his health scare, which resulted in doctors putting two stents in a blocked artery. “But let me take this moment, if I might, to thank so many people from all over this country, including many of my colleagues up here, for their love, for their prayers, for their well-wishes,” Sanders said. “And I just want to thank you from the bottom of my heart. And I’m so happy to be back here with you this evening,” he added. Far-left “Squad” member Rep. Ilhan Omar (D-MN) formally endorsed Sanders in a video released Wednesday, describing Sanders as “the only candidate who has built a movement.” “I was one of the people inspired by the movement that the senator has built. There was an America that I dreamed about. There is an America that most people believe in,” she said, noting that it is just “an ideal” and “not reality yet”:  Sanders confirmed in a tweet on Wednesday that Ocasio-Cortez will join him at his rally in Queens this weekend: ",
      "date": "16 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Ilhan Omar Formally Backs Bernie: The America I Dreamed About ‘Is Not a Reality Yet’",
      "url": "https://www.breitbart.com/politics/2019/10/16/ilhan-omar-formally-backs-bernie-the-america-i-dreamed-about-is-not-a-reality-yet/",
      "subtitle": "Far-left “Squad” member Rep. Ilhan Omar (D-MN) confirmed her rumored endorsement of Sen. Bernie Sanders (I-VT) in a formal video released Wednesday morning.",
      "author": "Hannah Bleau",
      "content": " She told her followers Sanders is the “the only candidate who has built a movement,” adding the socialist senator’s vision will help establish the America she dreamt of, which is “not a reality yet.” Sanders teased an endorsement from freshman lawmaker Rep. Alexandria Ocasio-Cortez (D-NY) during Tuesday night’s debate, and reports surfaced quickly after, indicating Ocasio-Cortez, Rep. Rashida Tlaib (D-MI), and Omar would be endorsing the socialist senator’s presidential bid. Omar tweeted a video of her formal endorsement on Wednesday:  “I am so proud to endorse Senator Bernie Sanders for president,” Omar said, describing the Vermont lawmaker as “the only candidate who has built a movement and continues to build a movement that transcends gender, ethnicity, and religion.” “And we know in order to take on Trump, we’re going to need a unifier– someone who understands what the fight looks like and someone who is ready to defeat him,” she continued, adding that she was “one of the people inspired” by the movement Sanders created. “I was one of the people inspired by the movement that the Senator has built. There was an America that I dreamed about. There is an America that most people believe in,” she said, adding that is just “an ideal” and “not reality yet.” One of the most “amazing” things about the socialist senator, Omar said, is “he understands that we have to find solutions to our greatest problems.” She touted him as the only candidate who is proposing to cancel all student debt, provide universal school meals, stop “endless wars,” fight for human rights, and hold everyone accountable “regardless of if they’re an ally or a foe.” “This is not just the fight for our lives. This is the fight for our democracy. This is the fight for a better future. One we can all be proud of,” Omar concluded:    Ocasio-Cortez is expected to formally endorse Sanders on Saturday.",
      "date": "16 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders: ‘Abolish the Electoral College’",
      "url": "https://www.breitbart.com/politics/2019/07/20/bernie-sanders-abolish-electoral-college/",
      "subtitle": "Presidential candidate and Vermont Sen. Bernie Sanders (I-VT) made another call to abolish the Electoral College in a tweet Friday afternoon to his 9.4 million Twitter followers.",
      "author": "Hannah Bleau",
      "content": " Sanders took to Twitter Friday afternoon and wrote “Abolish the Electoral College” in response to an NBC News analysis that theorized that President Trump could win the presidential election in 2020 and lose the popular vote by five million:  NBC’s analysis points to the population booms in California and Texas. Both states, NBC argues, are at the “heart of Democrats’ geography problem.” NBC News adds: Both behemoths are growing more diverse at a much faster rate than the nation — owing to booming Asian and Latino populations — and are trending toward Democrats. Yet neither blue California nor red Texas would play a pivotal role in a close 2020 election, potentially rendering millions of additional Democratic votes useless. A presidential candidate must reach 270 Electoral College votes to win. Trump defeated Hillary Clinton in 2016 with 306 Electoral College votes to Clinton’s 232. Following the election results, Clinton’s supporters argued for the abolishment of the Electoral College and pointed to the popular vote, which Clinton “won” by nearly 2.9 million voters. Proponents of the Electoral College system, however, note that the Founding Fathers set up the Electoral College system as a safeguard against mob rule, preventing densely populated areas – particularly on the coasts – from determining the results of presidential elections. The Electoral College essentially gives communities in less populous states a fair, proportional voice in determining the direction of the country. Trump won in 2016, in part, for winning over voters in Rust Belt states, including Wisconsin, Ohio, Michigan, Ohio, and Pennsylvania. This is not the first time Sanders has voiced support for abolishing the current system. During an appearance at a town hall hosted by League of United Latin American Citizens last week, Sanders expressed support for abolishing the Electoral College. “It is hard to defend a system in which we have a president who lost the popular vote by 3 million votes, so the answer is yes,” Sanders said. Other 2020 candidates, such as Sen. Elizabeth Warren (D-MA), Sen. Kirsten Gillibrand (D-NY), Beto O’Rourke (D), and Pete Buttigieg (D), have expressed support for abolishing the Electoral College as well.",
      "date": "20 Jul 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Exclusive: Attorney for Bernie Donor Class Action Calls DNC ‘The Ultimate Ponzi Scheme’",
      "url": "https://www.breitbart.com/politics/2017/06/20/exclusive-attorney-for-bernie-donor-class-action-against-dnc-talks-with-breitbart-news/",
      "subtitle": "Backers of Bernie Sanders are suing the Democratic National Committee (DNC) for fraud based on last summer’s hacks revealing systemic bias for Hillary Clinton in the 2016 primary campaign.",
      "author": "Ian Mason",
      "content": " The class-action lawsuit, Wilding v. DNC Services Corp., is underway in federal court in Florida, where it is awaiting a ruling on the DNC’s motion to dismiss heard in April. The plaintiff class, Bernie donors who also gave money to the DNC under the assumption of its impartiality in the 2016 primary contest between Clinton and Sanders. The suit alleges fraud, negligent misrepresentation, unjust enrichment, and a consumer protection violation. The claims are based on the celebrated leaked emails and memos from the “Guccifer 2.0” hacks last June. The leaks appear to show direct assistance of Secretary Clinton to the detriment of Senator Sanders. The novel legal theory is based on the donors having been duped by the DNC’s claims of impartiality. Attorney Jared Beck of Beck & Lee Trial Lawyers, the firm representing the class of Bernie supporters, spoke with Breitbart News about the developing case and the surrounding controversies. The entire case shot into the public eye when, according to a notice Beck & Lee filed with the court, their office received a call asking for information about the case from a person using a voice-altering device. A quick lookup of the number revealed it was from a number associated with the congressional office of DNC Chairwoman Rep. Debbie Wasserman-Schultz (D-FL). The DNC’s attorney’s quickly denied any knowledge of the incident, claim the number is from an unused office and is possibly the result of number “spoofing” by an outside source. Asked about the call, Beck told Breitbart News: The incident was startling at the time it happened and we are still very puzzled and concerned by it.  The caller had altered his or her voice to be unrecognizable, and refused to identify themselves.  But please understand that this is just one  in a number of disturbing events that have occurred  throughout the case … I have no idea who was behind the call, but according to the Defendants, the matter has been referred to the Capitol Police. As for the case itself, Beck was confident that general common law principles of fraud and misrepresentation could sustain the Bernie-donors’ claim. “If there is anything “new,” it is the application of these principles to the sphere of political campaigns,” he said. Beck went on to describe that application as follows: One might view this application as a natural consequence of Citizens United – an opinion that crystallizes campaign contributions as the quintessential form of American political participation.  By equating political participation with financial contribution, Citizens United, by inference, incorporates all of the common-law principles of fraud, negligent misrepresentation, etc. that typically govern in the economic sphere. Americans have a cognizable interest in the transparent and fair conduct of primary campaigns precisely because they, through their campaign contributions, are also financiers of the campaign. Asked to make an analogy to a more traditional case of fraud outside the political realm, Beck compared the DNC’s actions with a “Ponzi-scheme,” in which investors buy in based on fraudulent returns that are really just earlier investors: I would think of this as a case against the ultimate political Ponzi scheme. We are used to the concept of Ponzi schemes in the investment world. In my view, the DNC is really no different: it was purporting to be “selling” a fair primary process but in reality was serving as a front for the Hillary Clinton campaign. People lost well over $200 million as a result. Beck told Breitbart News that there bringing the facts of the DNC’s conduct to light: There are two main goals to the litigation: obtaining justice for our clients through whatever legal remedies are available; and having a trial on the issues, so that the public may know the truth of what happened with respect to the 2016 Democratic nominating process. The circumstances by which the DNC leaks came to light, allegedly by hacks by Russian government agents, has been a major public controversy for nearly a year. If the case survives the motion to dismiss, discovery will begin, potentially bringing a trove of new information to light about the DNC’s internal operations and how they came to be the apparent victim of Russian hacking. Beck was optimistic about the prospects for discovery: If we do get to the discovery phase, I think it is safe to say that we expect to find much more evidence of the DNC’s misconduct, with the publicly released material being only the tip of the iceberg.  Also, we will be able to place all of the material witnesses under oath and take their depositions.  In addition, we will be able to conduct discovery on the question of how the DNC’s internal documents came to be placed into the public domain by Guccifer 2.0 and WikiLeaks, which may ultimately be the most important question of all. It is unclear when the court will rule on the motion to dismiss but Judge William Zloch told the parties in April it would “take some time.”",
      "date": "20 Jun 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders: ‘Racist’ and ‘Sexist’ Trump Is a ‘Very Formidable Opponent’",
      "url": "https://www.breitbart.com/politics/2019/10/19/bernie-sanders-racist-and-sexist-trump-is-a-very-formidable-opponent/",
      "subtitle": "Sen. Bernie Sanders (I-VT) declared on Friday that President Trump is a “racist, a sexist and a xenophobe” but said, despite that, he is a “very formidable opponent.”",
      "author": "Hannah Bleau",
      "content": " The socialist senator, who has called Trump no shortage of names (i.e., racist, homophobe, misogynist, idiot) in the past, said on Friday that the president is a “formidable” opponent despite what he believes are gross character flaws. “Trump is a racist, a sexist and a xenophobe. Despite all of that, he will be a very formidable opponent,” Sanders proclaimed. “We can beat him and we will beat him. But we cannot take anything for granted,” he continued, stressing the importance of voter turnout. “To win, we have got to create the largest voter turnout in the history of the country,” he added:  Sanders’ call for the “largest voter turnout in the history of the country” follows the emergence of three election models used by Moody’s Analytics, two of which show the president winning by greater margins than 2016. As Breitbart News reported: “Under the average of the three models, Trump would hold on to key industrial Midwest states and pick up New Hampshire, Virginia and Minnesota,” Moody’s said in a report detailing the results of its models. Moody’s election forecasts have been very reliable in the past, correctly predicting every election result except 2016. The model undercounted support for Trump because it did not anticipate the increase in voter turnout that shifted the majority vote in crucial states. Importantly, Moody’s models all predict Trump wins even if the economy dips to multiyear lows by the end of 2020 and the stock market crashes 9 percent. In other words, Trump is expected to win despite a falling stock market and a sagging economy. Nonetheless, voter turnout could also play a huge role in the election results. As Breitbart News detailed: If turnout by Democrats and independents voting against Trump is low to average, Trump easily wins under the models. If it climbs to the historical maximum, Trump would lose under the stock market and unemployment models but still win in the pocketbook model.” Sanders will appear at a highly anticipated “Bernie’s Back Rally” in New York Saturday afternoon alongside Rep. Alexandria Ocasio-Cortez (D-NY) and left-wing filmmaker Michael Moore:   ",
      "date": "19 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Michael Moore Endorses Bernie Sanders: He ‘Absolutely Can’ Beat Trump",
      "url": "https://www.breitbart.com/entertainment/2019/10/19/michael-moore-endorses-bernie-sanders-he-absolutely-can-beat-trump/",
      "subtitle": "Left-wing documentary filmmaker and notorious anti-Trumper Michael Moore endorsed socialist Sen. Bernie Sanders (I-VT) for president on MSNBC Friday evening and confidently said that Sanders “absolutely can win this.”",
      "author": "Hannah Bleau",
      "content": " The Capitalism: A Love Story director officially threw his weight behind Sanders during an appearance on MSNBC. While Moore said he loves Warren and has for years, he believes Sanders is the right man for the job, citing the lawmaker’s understanding of the “greedy form of capitalism.”  “Why me for Bernie?” Moore began. “Because Bernie understands that capitalism and the greedy form of capitalism – especially what we have now – is at the core of so many of the problems that we’re talking about. And he’s not afraid to come out and just say that– that that’s a problem.” “And you think he’s in a position to win the nomination and be president?” host Ari Melber asked. “Oh absolutely,” Moore said, citing an Emerson Poll released this week. “I mean there was the Emerson Poll in Iowa yesterday, showed a head to head with Bernie, Biden, and Elizabeth,” the Sicko producer said. “Only one of them came out ahead of Trump, and that was Bernie Sanders. He’s absolutely — absolutely can win this.” The poll Moore referenced showed both Joe Biden (D) and Sen. Elizabeth Warren (D-MA) leading the Democrat field in the Hawkeye State with 23 percent each, followed by Mayor Pete Buttigieg (D) with 16 percent, and Sanders dropping to fourth with 13 percent support. However, Moore is correct, as the hypothetical general election matchups show Trump besting Biden and Warren by two points – 51 percent to 49 percent – and Sanders leading Trump by the same, with 51 percent to Trump’s 49 percent. However, with a margin of error of +/-3.2, the candidates are in a virtual dead heat in Iowa.  Moore is expected to formally endorse Sanders alongside Rep. Alexandria Ocasio-Cortez (D-NY) at the “Bernie’s Back” rally in New York City Saturday afternoon. ",
      "date": "19 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Watch Live: Trump Supporters Rally Outside Bernie Sanders Event",
      "url": "https://www.breitbart.com/2020-election/2019/10/19/watch-live-trump-supporters-rally-outside-bernie-sanders-event/",
      "subtitle": "null",
      "author": "Amanda House",
      "content": " Shouting “Socialism Kills” and holding signs with messages like “Commies Go Back”, a group of Donald Trump supporters surrounded 2020 hopeful Bernie Sanders’ rally in New York City today.",
      "date": "19 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders",
      "url": "https://www.breitbart.com/tag/bernie-sanders/",
      "subtitle": "null",
      "author": "Joshua Caplan",
      "content": "                             ",
      "date": "19 Oct 2019, 5:11 PM PDT",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Watch: Michael Moore Downplays Bernie Sanders Heart Attack — ‘Talk About the Health of This Planet That’s Dying’",
      "url": "https://www.breitbart.com/entertainment/2019/10/19/michael-moore-downplays-bernie-sanders-heart-attack-talk-about-the-health-of-this-planet-thats-dying/",
      "subtitle": "Left-wing documentary filmmaker Michael Moore dismissed mounting concerns surrounding Sen. Bernie Sanders’ (I-VT) health and age during a “Bernie’s Back Rally” in New York City on Saturday, declaring that he is “glad” that Sanders is 78 years old and arguing that he would rather “talk about the health of this planet that’s dying” than Sanders’ heart attack.",
      "author": "Hannah Bleau",
      "content": " The Sicko director dismissed concerns over Sanders’ age — he would be the oldest president to take office if elected — and argued that he is “glad” that Sanders is 78-years-old. “I’m glad he’s 78, and we will benefit for his wisdom and his experience and his knowledge and his love for the American people,” Moore said. “It’s actually a gift that we have a 78-year-old American running for President of the United States. You know why that’s a gift?” “What has a 78 year old seen? Bernie has seen many of the things we’ve never seen,” the filmmaker said, naming pay raises, pensions, and the defeat of fascism and white supremacy. The Oscar-winner also added that it is the Electoral College — not Sanders — that is old and outdated. From there, Michael Moore pivoted to Sanders’ heart attack and dismissed all concerns related to the socialist senator’s health. “Next thing they say,” Moore began — “they” being those who tout “false” narratives” about Sanders — “is what about his health?” “How about we talk about the health of this planet that’s dying. That’s the health I care about,” Moore said before joining the crowd in chanting, “Green New Deal!” “What about the health of the kids in Flint, Michigan,” Moore continued. “What about their health? Talk about that on cable news. What about the health of 40 million people who live in poverty?” “The only heart attack we should be talking about is the one Wall Street is going to have when Bernie Sanders is President of the United States,” he said.",
      "date": "19 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Watch Live: AOC Endorses Bernie Sanders at New York Campaign Rally",
      "url": "https://www.breitbart.com/2020-election/2019/10/19/watch-live-aoc-endorses-bernie-sanders-at-new-york-campaign-rally/",
      "subtitle": "Rep. Alexandria Ocasio-Cortez (D-NY) will endorse Sen. Bernie Sanders (I-VT) for the 2020 Democrat presidential nomination at a campaign rally on Saturday at Queensbridge Park in Long Island City, New York.",
      "author": "Penny Starr",
      "content": " Sanders, who, like Ocasio-Cortez, calls himself a democratic socialist, hinted at an impending endorsement for the Democrat debate stage last week, Newsweek reported: “I’m healthy. I’m feeling great,” Sanders said Tuesday on the debate stage at Otterbein University in Ohio. “Let me invite you all to a major rally we’re having in Queens, New York. BernieSanders.com. We’re going to have a special guest at that event, and we are going to be mounting a vigorous campaign all over this country. That’s how I think I can reassure the American people.” During the debate, The Washington Post confirmed Sanders’ “special guest” would be Ocasio-Cortez, who represents New York’s 14th congressional district, which includes parts of both Queens and the Bronx. On Wednesday, Sanders was endorsed by U.S. Representative Ilhan Omar of Minnesota. Sanders tweeted about the endorsement from Ocasio-Cortez, who worked for the senator’s 2016 presidential campaign:  “I’m so excited to have AOC join us at our rally in New York this weekend. Help us show the powerful special interests that we’re not backing down and join us on Saturday in Queens,” Sanders tweeted. Watch live on Breitbart News starting at 1 p.m. EDT. Follow Penny Starr on Twitter.",
      "date": "19 Oct 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    }
  ]
}