{
  "articles": [
    {
      "title": "Democrats Criticize Betsy DeVos, Trump’s Choice for Education",
      "url": "https://www.nytimes.com/2017/01/17/us/politics/what-to-watch-a-crush-of-hearings-and-a-transfer-of-power.html?searchResultPosition=30",
      "subtitle": "null",
      "author": "Emmarie Huetteman",
      "content": "  WASHINGTON — Betsy DeVos, President-elect Donald J. Trump’s choice to lead the Education Department, was sharply criticized by Democrats on Tuesday evening in what was shaping up to be a contentious confirmation hearing. ■ Republicans countered Democrats with rich praise for Ms. DeVos. ■ Representative Ryan Zinke, Republican of Montana, Mr. Trump’s choice for secretary of the Interior, had an easier time of it in his hearing on Tuesday. ■ The main target of Democratic ire is likely to be Mr. Trump’s choice to head the Department of Health and Human Services, Representative Tom Price, Republican of Georgia. His hearing Wednesday morning will focus on his strong opposition to the Affordable Care Act. Ms. DeVos, a billionaire philanthropist, has attracted opposition from organizations supporting charter schools and from teachers’ unions. Her opening statement said that the public education system in the United States needed to move away from “a one-size-fits-all model of learning,” and toward one that would support parents who chose to send their children to private or religious schools, or to home school. “Too many parents are denied access to the full range of options,” she said. “Choices that many of us — here in this room — have exercised for our own children.” “Why, in 2017, are we still questioning parents’ ability to exercise educational choice for their children?” she asked. Ms. DeVos recalled her own education in a Christian school in Western Michigan, and her mother’s job as a public-school teacher. She described a visit she and her husband, an heir to the Amway fortune, made to a Christian school in her hometown, Grand Rapids, Mich., as a turning point in her career as an advocate for school choice. “We saw the struggles and sacrifices many of these families faced when trying to choose the best educational option for their children,” she said. “For me, this was not just an issue of public policy but of national injustice.” She added: “Here’s the sad reality. In the past 28 years, the need and demand for these other options have grown, unabated.” Senator Patty Murray of Washington, the ranking Democrat on the committee, said she was “extremely disappointed” that Ms. DeVos’s hearing was proceeding before she had completed an agreement with the independent Office of Government Ethics that outlined a plan to deal with potential conflicts of interest. Mr. Zinke portrayed himself as an eager steward of the nation’s public lands, treading a fine line between the importance of preservation and utilization as he testified before a Senate panel as Mr. Trump’s choice for interior secretary. Mr. Zinke professed his admiration not only for the naturalist John Muir, a champion of preservation, but also for Gifford Pinchot, the first chief of the United States Forest Service. Mr. Pinchot pushed for what he described as the planned use and renewal of natural resources. “It is also these lands that many communities, like the town I grew up in, rely on to harvest timber, mine and to provide our nation with energy,” he said in prepared remarks. He said one of his priorities leading the Interior Department would be addressing an estimated $12.5-billion backlog of maintenance and repairs in the national parks system. Mr. Zinke broke with Mr. Trump on the issue of climate change Tuesday, disagreeing with the president-elect’s assertion at one point that it is “a hoax.” Mr. Zinke, who once said that climate change was “not proven science,” said the climate was changing and that humans were having an impact on it. “I think the debate is what that influence is, what we can do about it,” Mr. Zinke said. “I don’t believe it’s a hoax,” he added. He expressed his support for the president-elect’s desire for energy independence, though, and he described his approach to developing energy resources on public lands as “all of the above.” Mr. Zinke also drew a clear line on whether the federal government should keep control of its land. “I’m absolutely against transfer and sale of public lands,” he said. “I can’t be more clear.” Perhaps this week’s most contentious confirmation hearing will Wednesday, when a Senate panel will take a look at Mr. Price, Mr. Trump’s selection for secretary of Health and Human Services. Just days after congressional Republicans voted to move forward with plans to repeal President Obama’s health care law, senators will question Mr. Price, one of the law’s top critics in Congress. Republicans hope he can be an aggressive force within the administration as they work to repeal and replace the health care law. Democrats, who cannot block the repeal effort, will most likely take the opportunity to highlight their view that repealing the law will leave millions without health insurance. Watch for Democrats to attack Mr. Price’s support for overhauling the Medicare system, an idea that would move away from its open-ended commitment to pay medical costs toward a plan where beneficiaries receive a fixed amount.",
      "date": "Jan. 17, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Tom Price, a Bigger Problem Than Betsy DeVos",
      "url": "https://www.nytimes.com/2017/02/07/opinion/tom-price-a-bigger-problem-than-betsy-devos.html?searchResultPosition=29",
      "subtitle": "null",
      "author": "David Leonhardt",
      "content": " This article is part of the Opinion Today newsletter. You can sign up here to receive more briefings and a guide to the section daily in your inbox. Betsy DeVos has become the Trump nominee that liberals are trying the hardest to defeat — inspiring the #DeVosPledge — and I understand why. Education sparks passion among many Democrats (sometimes productively, sometimes less so), and DeVos has some alarming positions. She has shown scant interest in holding charter schools and private schools accountable for their results. She has also shown little commitment to special education. And she apparently has strange views about the risk of bear maulings on school campuses. Whatever you think of DeVos, however, I’ve come to think that the focus on her has become too concentrated — and that there is another nominee who deserves more attention than he has received. Tom Price, the nominee to run Health and Human Services, can likely have a bigger impact in that job than DeVos can have as education secretary. The highly localized nature of American education naturally limits DeVos’s ability to privatize schools, as Kevin Carey of the New America Foundation has noted. Price, on the other hand, would have the authority to weaken or undermine health insurance for millions of people if he’s confirmed. He’s sent strong signals that he would like to do so, too. Perhaps even more important, Price — a Georgia Congressman and orthopedic surgeon — has compiled a long list of questionable behavior, mostly in the service of enriching himself. My column this morning tells the story of this behavior. The issues with Price’s nomination aren’t merely ideological. They’re ethical. And while presidents deserve deference on the ideology of their nominees, they don’t deserve deference on basic ethics.",
      "date": "Feb. 7, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Betsy DeVos’s Nomination for Education Secretary Clears Committee",
      "url": "https://www.nytimes.com/2017/01/31/us/politics/betsy-devos-education-secretary-nomination.html?searchResultPosition=28",
      "subtitle": "null",
      "author": "Yamiche Alcindor",
      "content": " WASHINGTON — After contentious confirmation hearings, protests across the country and two rounds of voting, Betsy DeVos cleared the first hurdle in her path to becoming secretary of education on Tuesday with a party-line vote in the Senate Committee on Health, Education, Labor and Pensions that advanced her nomination to the Senate floor. All 12 Republican senators on the committee voted for Ms. DeVos, a billionaire with a complex web of investments, including some in companies with connections to federal education policy. All 11 Democrats opposed her, calling her both dangerous and unqualified. The committee voted twice on Ms. DeVos’s nomination after Democrats protested against a vote cast on behalf of Senator Orrin G. Hatch, Republican of Utah, who was initially absent. Ms. DeVos’s ultimate confirmation, while likely, is still not definite. Senator Lamar Alexander of Tennessee, chairman of the committee, was visibly frustrated — by Democratic delaying tactics and arguments — as he defended Ms. DeVos and said she would be devoted not only to giving parents a choice about school options but also to protecting public schools. “She wants to reverse the trend of a national school board and stop telling teachers and school boards how to run their schools,” Mr. Alexander said. “One would think the committee would be delighted with that. I respect my colleagues. I don’t question their motives. I don’t question their votes. But I believe their concerns are misplaced.” But Senator Lisa Murkowski, Republican of Alaska, expressed reservations about Ms. DeVos that sounded similar to those of Ms. DeVos’s opponents. The senator said that while she would vote to advance Ms. DeVos out of committee, she would not commit to voting for her on the Senate floor. “She has not yet earned my full support,” said Ms. Murkowski, who referred to conversations with Alaska teachers. “Betsy DeVos must show all of us that she truly understands children of all America, of rural, of urban, who are not able to access an alternative choice in education.” Democrats, teachers’ unions and liberal protesters have been flooding senators with calls and emails protesting her nomination for myriad reasons. They have expressed concern about her family’s contributions to groups that support so-called conversion therapy for gay people; her donations to Republicans and their causes, which she agreed have totaled about $200 million over the years; and her past statements that government “sucks” and that public schools are a “dead end.” Opponents have focused on the poor performance of charter schools in Detroit, which she has bankrolled even as she resisted legislation that would have blocked chronically failing charter schools from expanding. Senator Patty Murray of Washington, the ranking Democrat on the committee, insisted she needed more time to question Ms. DeVos about possible conflicts of interests and about her dedication to ensuring the protection of public schools, which she eschewed for her own children. “I have not been persuaded that Betsy DeVos will put students first if she were confirmed, and I have not been persuaded that she has the experience, skills, understanding, or vision to lead this critical department at a time when it is more important than ever,” Ms. Murray said. “From everything we heard, everything we know, and all of the questions that still remain, it is clear to me that Betsy DeVos is the wrong choice to lead our nation’s Department of Education.”",
      "date": "Jan. 31, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Why I Won’t Vote for Betsy DeVos",
      "url": "https://www.nytimes.com/2017/02/03/opinion/why-i-wont-vote-for-betsy-devos.html?searchResultPosition=27",
      "subtitle": "null",
      "author": "Maggie Hassan",
      "content": " WASHINGTON — Our nation recognized early in its history that public education is a necessary foundation for a democracy. It’s critical that we continue to support a strong public education system that prepares our young people, all of them, to participate in our democracy and compete on a fair footing in the work force. For this reason, our public officials should share a reverence for the importance of public education to our country’s success, both now and in the future. And they must show a commitment to enforcing our laws so that all students have the opportunity to succeed. That is why I oppose President Trump’s nominee for secretary of education, Betsy DeVos. Throughout her confirmation process, Ms. DeVos has demonstrated a complete lack of experience in, knowledge of and support for public education. Instead, it is clear that she would pursue policies that would undermine public schools, in my home state of New Hampshire and across our nation. At her nomination hearing before the Senate Committee on Health, Education, Labor and Pensions last month, I questioned Ms. DeVos on whether she would enforce the Individuals With Disabilities Education Act, the law that ensures that all students receive a free and full education in our schools. Not only did Ms. DeVos decline to assure senators that she would enforce the law to protect students with disabilities, but she also demonstrated her confusion about whether the I.D.E.A. is a federal law. Ensuring access to public education for every student is an issue that is personal to my family. My adult son Ben was born with cerebral palsy. Ben is bright and funny (and quite handsome, according to this unbiased source). He cannot walk, cannot use his fingers to type and can speak only in difficult-to-understand single words. If Ben had been born a generation or two earlier, we, his parents, would have been pressured to put him in an institution. But Ben was able to go to a public school in his hometown, Exeter, N.H., because of the tireless work of the advocates, educators and public officials who came before us. Ben had the opportunity to go to school and make friends in his own community — something that all parents want for their children. And I was drawn to public service to ensure that all children have the same opportunities that Ben did. Instead of supporting public schools, Ms. DeVos has supported voucher systems that divert taxpayer dollars to private, religious and for-profit schools without requirements for accountability. Voucher systems often fail to serve children who have disabilities. To use a voucher, families are sometimes forced to sign away their child’s legal rights, and the schools receiving the voucher often lack the experience or resources necessary to educate the child. This is in sharp contrast to public school systems that focus on serving all students, including those with disabilities. In these public schools, educators are better prepared to recognize challenges faced by all students — not just those who have a diagnosed disability — and are empowered to tailor educational experiences to individual students. That is the wonder of a public education system that reinforces the principle that every student counts. Too often, though, the voucher programs that Ms. DeVos advocates leave out students whose families cannot afford to pay the part of the tuition that the voucher does not cover; the programs also leave behind students with disabilities because the schools do not accommodate their complex needs. I am also concerned about the number of unresolved conflicts of interest regarding Ms. DeVos’s finances, which call into question whether she will put America’s students before her own financial interests. Ms. DeVos has invested in numerous companies in the education sphere, and she has failed to answer basic questions about her finances, including which companies she would stay invested in if she is confirmed. I will always fight to improve our public education system and ensure that all students have the opportunity to reach their full potential. This week, I voted against moving forward with Ms. DeVos’s nomination in committee, and I will vote against her nomination again on the Senate floor. Thousands of my constituents have called my office about this nomination, and nearly all have voiced concerns that Ms. DeVos is completely unqualified to serve as secretary of education. Two of my Republican colleagues have also announced their opposition. This leaves just one more vote needed to defeat her nomination. I hope there is another senator willing to break with the president and vote against this woefully unqualified nominee. We must listen to the thousands speaking up for our children and the public education system that serves all Americans.",
      "date": "Feb. 3, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Betsy DeVos Loves Charter Schools. That’s Bad for Charter Schools.",
      "url": "https://www.nytimes.com/2018/06/02/opinion/sunday/betsy-devos-charter-schools-trump.html?searchResultPosition=26",
      "subtitle": "null",
      "author": "Conor P. Williams",
      "content": " At Hiawatha Academies’ elementary school in the Morris Park neighborhood of Minneapolis, signs welcome immigrants in multiple languages. Over 75 percent of students there are learning English as a second language, and most are the children of Hispanic immigrants. Hiawatha runs some of Minnesota’s best public schools for serving such students; the Morris Park school, where math and literacy proficiency rates for students learning English are more than double the statewide averages for that group, is one of its flagships. Hiawatha schools should be easy for the left to love. They’re full of progressive educators helping children of color from low-income families succeed. And yet, they’re charter schools. Like most charters, Hiawatha schools get public funding, but their daily operations are run by a nonprofit organization and their teachers are not unionized. Progressives have long been open to research suggesting that well-regulated charter schools can extend educational opportunities to historically underserved children. But many also worry that charters foster segregation, siphon funding from traditional public schools and cater to policymakers’ obsession with standardized tests. And the more President Trump and his secretary of education, Betsy DeVos, embrace charters, the more suspect they seem to people on the left. Ms. DeVos, who has been widely lampooned for her lack of expertise, can’t stop talking about how much she loves charters. She is so unpopular that she has set off a “political backlash” against these schools, two charter supporters wrote in USA Today. One survey of views on charter schools found that Democrats’ support dropped when they heard that President Trump supported them. In other words, the president and his education secretary are so disliked by liberals that some will automatically reject whatever they endorse. This puts Hiawatha in an awkward position. How should a charter network run by progressives committed to combating racism navigate the Trump administration’s vocal support of charters? How should it respond to criticism from progressives who accuse it of undermining public education? Charter schools are politically homeless. Hiawatha was founded in 2007 by Jon Bacal, an education entrepreneur in Minnesota. Ambar Hanson, a Hiawatha administrator and parent, said the network was “founded out of frustration at the huge gaps in education for students of color.” At Hiawatha, these are called opportunity gaps instead of achievement gaps. “Talking about the achievement gap was often heard by our community members as putting it on them,” Ms. Hanson said. “‘Opportunity gap’ is changing the rhetoric to put the responsibility of closing that gap on schools, where it belongs.” The executive director of the network, Eli Kramer, said, “We’re trying to elevate the importance of identity, race consciousness, pride in self as really core to the mission.” A walk through Hiawatha Collegiate High School, also in Minneapolis, confirms this. Its walls are papered with posters spotlighting the United Nations’ Universal Declaration of Human Rights. “Black Lives Matter” stickers are everywhere. Hiawatha’s project goes beyond posters. More than 95 percent of Minnesota’s teachers are white, and just 1 percent are Hispanic. So the network recruits for diversity. Over a quarter of Hiawatha teachers are people of color. But the school’s commitment to social justice is most visible when it comes to its immigrant families. Early in the Trump administration, Immigration and Customs Enforcement agents began detaining undocumented immigrants near schools. Many Hiawatha students have family members without papers, so the network declared its campuses to be safe havens for undocumented people. Several staff members have volunteered to serve as legal guardians in case students’ parents are deported. When President Trump allowed the Deferred Action for Childhood Arrivals program to expire, students staged a walkout in protest. School leaders say teachers are intentional about stopping instruction for conversations when students bring up politics. Indeed, on the board in one fourth-grade classroom recently was the question “What does Trump mean by ‘Make America Great Again’?” “It’s pretty devastating to have to focus on these kinds of things in addition to academics and instruction,” Ms. Hanson said. And now the teachers are being forced to respond to criticism from people who by most measures should be their allies. Robert Panning-Miller, the former president of the Minneapolis Federation of Teachers, has called Hiawatha schools emblematic of a “corporate reform movement” that values “compliance and test scores over critical thinking” and criticized them as being part of an “apartheid education” movement, because their students are almost exclusively children of color. It’s true that nine out of 10 Hiawatha students are Hispanic. But if Hiawatha schools enroll a high number of minority students and English learners, that’s because they serve them well. During the Obama administration, tensions over charter schools among progressives were manageable. National charter school enrollment grew with support from President Barack Obama and his secretaries of education, Arne Duncan and John King. But the administration also provided more resources and flexibility for the education system as a whole. The Every Student Succeeds Act, which replaced No Child Left Behind as the country’s primary K-12 education law in 2015, continued these trends. It reduced federal oversight of states’ academic standards, as well as oversight of state programs for historically underserved students. This blend of policies helped keep progressive infighting on issues like standardized tests and federal accountability simmering instead of boiling. Left-wing education reform critics increasingly focused their attention on charter schools instead. The 2016 election sharpened that dynamic. In 2017, while Ms. DeVos was pushing her school choice agenda, an Education Next poll found that Democratic support for charter schools dropped by 11 percentage points. Progressive critics are taking advantage of the moment to tie charter-friendly Democrats to her toxic public image. On the day after President Trump’s inauguration, Valerie Strauss, a Washington Post education writer, accused Democratic reformers like Senator Cory Booker of New Jersey, the former Newark mayor, of “advancing corporate education reform” through their support of school choice. This puts the country’s many thousands of charter-school teachers in an odd place. Most come to this work to provide underserved children with a better shot at educational success, but now they’re increasingly branded as corporate stooges selling out public education by critics who challenge charter schools’ right to exist. These teachers shouldn’t have to answer for Ms. DeVos’s incompetence or wonder if there’s room for them in the future of progressive education politics. Progressives can ill afford this kind of sniping. The last thing the left needs right now is a war between teachers unions and liberal charter supporters. “I wish that people knew that the thing that’s most important to us is that students are achieving at high academic levels and they’re also empowered individuals,” said Natalie Heath, who teaches English language development at Hiawatha. That’s all that should matter. But when it comes to education politics in 2018, it seems to be the last thing anyone wants to talk about.",
      "date": "June 2, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Betsy DeVos’s Power Over Black Colleges",
      "url": "https://www.nytimes.com/2017/03/02/opinion/betsy-devoss-power-over-black-colleges.html?searchResultPosition=25",
      "subtitle": "null",
      "author": "Ivory A. Toldson",
      "content": " Betsy DeVos, the education secretary, deserved the hammering she received for her widely reviled comments characterizing historically black colleges and universities (H.B.C.U.s) as early examples of “school choice.” But when it comes to the fate of H.B.C.U.s under the Trump administration, her apparent misunderstanding of their history is a distraction. The fate of these institutions in the coming years will hinge not on her words, but on her decisions about their funding. In February, after only a few days on the job, Ms. DeVos made headlines for visiting Howard University, a historically black college founded in 1867. Then, after a meeting with H.B.C.U. leaders Monday, she released a statement calling H.B.C.U.s the “real pioneers when it comes to school choice.” That description was widely criticized as a dishonest attempt to distance these institutions from the segregated past that necessitated them and to awkwardly reposition them as talking points for the school choice movement. But her misguided remarks have diverted attention away from something more urgent: She now oversees the federal agency that is responsible for roughly three-fourths of the annual federal revenue to H.B.C.U.s. In ways that are much more consequential than any statement she could make, this power will allow her to determine how the schools fare under the Trump administration. Tuesday, President Trump issued an executive order moving the White House Initiative on HBCUs (WHI-HBCUs) from the Department of Education to the Office of the White House. Some H.B.C.U. advocates supported this move because of their impression that it would strengthen the administrative authority of the initiative and elevate the stature of its executive director. However, moving the WHI-HBCUs from the Department of Education to the White House distances the initiative from the source of essential funding for H.B.C.U.s. That’s because the Education Department is responsible for the distribution of approximately $700 million annually in grants, contracts and appropriations to those schools. But when it comes to annual revenue to H.B.C.U.s, the Office of the President is directly responsible for zero dollars. This arrangement leaves Ms. DeVos with significant power. H.B.C.U. advocates and defenders like me should focus less on dissecting her talking points and misstatements and more on seeking answers to specific questions about her attitudes toward the funding of historically black colleges in the present day. First, what are Ms. DeVos’s plans related to Title III, the federal grant program within the Department of Education designed to build the capacity of H.B.C.U.s? President Obama’s budget for the 2017 fiscal year, which never passed, sought to maintain and strengthen these opportunities for H.B.C.U.s to build their capacity. It included a proposal for $85 million in mandatory funding to the schools, as well as $244.7 million in discretionary Title III funding. Will Ms. DeVos maintain or increase these levels of funding? Second, will Ms. DeVos create new grant programs and contracting opportunities for H.B.C.U.s? President Obama proposed $30 million for a program designed to increase the number of low-income students completing degree programs. Will she work with Congress to include similar programs in the federal budget? Third, what are Ms. DeVos’s views on college affordability? In his budget proposal to Congress last year, President Obama requested $60.8 billion in mandatory funding over the next decade to help states make two years of community college free, as well as to offer grants to provide free or reduced tuition to students at H.B.C.U.s and minority-serving institutions in their first two years. Will Ms. DeVos be supportive of similar measures? Finally, will Ms. DeVos protect and expand the Pell Grant program? Approximately 73 percent of all H.B.C.U. students receive Pell Grants to fund their education. Before leaving office, President Obama and his education secretary, John King, issued proposals to ensure that Pell Grants were fully funded. Mr. Obama’s 2017 fiscal-year budget included mandatory protections of Pell Grants. How will Ms. DeVos protect this essential source of funding? The answers to these questions will have enormous bearing on the futures of colleges and universities that serve students who have been historically disenfranchised. As budget priorities are set for these vulnerable institutions, Ms. DeVos has the potential to be an important influencer of the president and negotiator with Congress. It will be her actions in this area — not her campus visits, meetings or comments — that will determine whether she is ultimately a friend or foe to H.B.C.U.s.",
      "date": "March 2, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "null",
      "url": "https://www.nytimes.com/interactive/2017/02/07/us/politics/betsy-devos-confirmation-vote.html?searchResultPosition=24",
      "subtitle": "null",
      "author": "THE NEW YORK TIMES",
      "content": " ",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "null",
      "url": "https://www.nytimes.com/interactive/2017/01/10/us/politics/document-OGE-Response-to-Letter-From-Ranking-Member-Patty.html?searchResultPosition=23",
      "subtitle": "null",
      "author": "The New York Times Company",
      "content": "",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Betsy DeVos Needs to Listen to Survivors",
      "url": "https://www.nytimes.com/2017/07/14/opinion/betsy-devos-needs-to-listen-to-survivors.html?searchResultPosition=22",
      "subtitle": "null",
      "author": "Emily Waters",
      "content": " In recent weeks, countless survivors of sexual violence have called, written and visited Betsy DeVos, the Secretary of Education, to voice their concern about the potential rollback of Title IX protections. Many people are aware that Title IX is a civil rights law that prohibits discrimination on the basis of sex within educational settings. Lesser known are the protections and resources the law guarantees to LGBTQ survivors of sexual violence. Under President Obama, the Department of Education sought to make clear exactly how Title IX applies to the lives of LGBTQ people who have experienced sexual violence — something we welcomed, given the high incidence of such violence against people in our communities. In 2011, the administration released what is now known as the “Dear Colleague Letter,” clarifying that under Title IX sexual violence is a form of sexual harassment as it creates a hostile environment for students. It also stated that universities should use a “preponderance of evidence” standard rather than the higher “clear and convincing” evidence standard for evaluating sexual assault complaints and determining disciplinary action. Three years later, the Department of Education released a guidance document to further clarify the Dear Colleague Letter. The document states that universities must “investigate and resolve allegations of sexual violence involving parties of the same sex using procedures and standards that it uses in all complaints involving sexual violence.” It also explains that universities must respond to discrimination on the basis of gender identity. Finally, the document suggests that universities should ensure that staff who handle sexual violence reports and work with survivors receive appropriate training on working with LGBTQ students. The guidance document and the Dear Colleague Letter are not law, but rather clarify how the Obama administration intrepreted the responsibilities of universities and schools under Title IX. As Secretary of Education, Betsy DeVos has the ability to uphold these guidance documents and ensure that LGBTQ survivors of sexual violence have a safe way to seek justice. Unfortunately, she also has the ability to rescind the Dear Colleague Letter and do away with the prepoderance of evidence standard — moves that she appears to be considering. That would be a travesty for all sexual assault survivors, but especially for LGBTQ survivors, who often cannot get justice in the traditional criminal justice system. Through my work with the National Coalition of Anti-Violence Programs, I have seen up close the many struggles LGBTQ survivors of violence experience when reporting to police or dealing with a court system that is biased against them. Our reports on violence against LGBTQ people have consistently shown that when LGBTQ survivors report to police they can be met with indifference and hostility, or worse, physical and sexual violence. Furthermore, LGBTQ survivors of sexual violence are often subjected to voyeuristic and traumatic questioning in the court system, stemming from ignorance about LGBTQ relationships and stereotypes about our sex lives. The requirement underscored in the Dear Colleague Letter that universities respond to reports of sexual violence and have fair disciplinary procedures using a preponderance of evidence standard creates a vital alternative for LGBTQ students who cannot get justice through the criminal system. It allows us to reimagine what justice might look like for students, to truly meet survivors’ needs, and to create pathways of accountability that heal rather than perpetuate harm. However, in order for students, LGBTQ and otherwise, to want to come forward and tell their stories, they must be able to trust their universities to support them and offer them fair and transparent disciplinary procedures. As it stands now, this just isn’t the reality. According to the Association of American Universities Campus Climate Survey on Sexual Assault and Sexual Misconduct, transgender and gender non-conforming students are less likely than other students to believe that the university will protect survivors’ safety and that the university will do anything in response to reports of violence. Betsy DeVos needs to listen to survivors, particularly those survivors who traditionally have been left out of the conversations around sexual violence. Rather than undermining the protections already in place, she should build on them to create systems of care and accountability for all survivors. She should encourage universities in creating and expanding educational programs about consent, boundaries and healthy sex that are inclusive of LGBTQ students. Finally, she should not allow those who actively work to discount the voices of survivors to take precedence in determining university responses to sexual violence. As the Secretary of Education, it is her responsibility to ensure that universities are meeting the needs of students who have experienced sexual violence, especially those who are most marginalized. It takes courage to share one’s story of sexual violence in hopes that those in power will listen. I hope that survivors have not shared their stories in vain.",
      "date": "July 14, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Big Worries About Betsy DeVos",
      "url": "https://www.nytimes.com/2017/01/10/opinion/big-worries-about-betsy-devos.html?searchResultPosition=20",
      "subtitle": "null",
      "author": "The Editorial Board",
      "content": " The director of the Office of Government Ethics, the nonpartisan agency charged with vetting the financial disclosures of cabinet nominees for potential conflicts of interest, sent an extraordinary letter to Senate Democratic leaders late last week. Never in the four-decade history of the agency, he wrote, have ethics officials felt such “undue pressure ... to rush through these important reviews,” leaving “some of the nominees with potentially unknown or unresolved ethics issues shortly before their scheduled hearings.” As the Senate races forward with confirmation hearings this week, the spottiest disclosures have come from wealthy private-sector nominees with no governing experience and many potential conflicts. In other words, the people most in need of a complete ethics review. Exhibit A is Betsy DeVos, a billionaire and education lobbyist who is President-elect Donald Trump’s pick for education secretary. Ms. DeVos’s finances are a tangle that could take weeks to investigate. Despite that, Republicans had set her confirmation hearing for Wednesday. But late Monday night, they pushed it back to next Tuesday. People who have seen her financial disclosures so far say that Ms. DeVos and her husband, Dick DeVos, have investments in some 250 companies registered to a single Grand Rapids, Mich., address, entities whose investments could take weeks for the ethics office to research. Already, though, there are reports that the DeVoses are indirect investors in Social Finance Inc., a private company that refinances student loans. Private lenders like Social Finance are banned from most of the direct student lending market; their lobbyists have already written to the Trump transition team pitching to change that. That’s only one potential conflict. What if her family has holdings in educational technology or for-profit colleges? Given time, the ethics office will learn this, and reach an agreement with Ms. DeVos to sell off assets that could pose a conflict. Beyond erasing concerns about her many possible financial conflicts, Ms. DeVos also faces a big challenge in explaining the damage she’s done to public education in her home state, Michigan. She has poured money into charter schools advocacy, winning legislative changes that have reduced oversight and accountability. About 80 percent of the charter schools in Michigan are operated by for-profit companies, far higher than anywhere else. She has also argued for shutting down Detroit public schools, with the system turned over to charters or taxpayer money given out as vouchers for private schools. In that city, charter schools often perform no better than traditional schools, and sometimes worse. Mr. Trump has at times displayed breathtaking ignorance about the powers and basic function of government. Many on his transition team are new to government service as well. But the Senate, and people advising him, including Reince Priebus, his chief of staff, have no excuse. Mr. Trump’s nominees will need only a simple majority vote to be confirmed. So what’s the hurry? Republicans seem worried that the more time the Senate has to examine some of these nominees’ backgrounds, the more chance a Republican or three could break ranks. Maybe they’re afraid of Mr. Trump’s ire, should any of his picks generate red flags. That’s backward thinking, of course: The potential for conflicts is more reason, not less, to take the time needed for thorough vetting, and the only route to a responsible vote.",
      "date": "Jan. 10, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Betsy DeVos Teaches the Value of Ignorance",
      "url": "https://www.nytimes.com/2017/02/07/opinion/betsy-devos-teaches-the-value-of-ignorance.html?searchResultPosition=19",
      "subtitle": "null",
      "author": "The Editorial Board",
      "content": " “Government really sucks.” This belief, expressed by the just-confirmed education secretary, Betsy DeVos, in a 2015 speech to educators, may be the only qualification she needed for President Trump. Ms. DeVos is the perfect cabinet member for a president determined to appoint officials eager to destroy the agencies they run and weigh the fate of policies and programs based on ideological considerations. She has never run, taught in, attended or sent a child to an American public school, and her confirmation hearings laid bare her ignorance of education policy and scorn for public education itself. She has donated millions to, and helped direct, groups that want to replace traditional public schools with charter schools and convert taxpayer dollars into vouchers to help parents send children to private and religious schools. While her nomination gave exposure to an honest and passionate debate about charter schools as an alternative to traditional public schools, her hard-line opposition to any real accountability for these publicly funded, privately run schools undermined their founding principle as well as her support. Even champions of charters, like the philanthropist Eli Broad and the Massachusetts Charter Public School Association, opposed her nomination. In Ms. DeVos, the decades-long struggle to improve public education gains no visionary leadership and no fresh ideas. Her appointment squanders an opportunity to advance public education research, experimentation and standards, to objectively compare traditional public school, charter school and voucher models in search of better options for public school students. The charter school movement started in the United States two decades ago with the promise that independently run, publicly funded schools would outperform traditional public schools if they were exempted from some state regulations. Charter pioneers also promised that, unlike traditional schools, which they said were allowed to perform disastrously without consequence, charters would be held accountable for improving student performance, and shut down if they failed. Ms. DeVos has spent tens of millions and many years in a single-minded effort to force her home state, Michigan, to replace public schools with privately run charters and to use vouchers to move talented students out of failing public schools. She has consistently fought legislation to stop failing charters from expanding, and lobbied to shut down the troubled Detroit public school system and channel the money to charter, private or religious schools, regardless of their performance. She also favors online private schools, an alternative that most leading educators reject as destructive to younger children’s need to develop peer relationships, and an industry prone to scams. In her Senate hearing, Ms. DeVos appeared largely ignorant of challenges facing college students, as well. She indicated that she was skeptical of Education Department policies to prevent fraud by for-profit colleges — a position favored, no doubt, by Mr. Trump, who just settled a fraud case against his so-called Trump University for $25 million. It was not clear that she understood how various student loan and aid programs worked, or could distinguish between them. In the end, only two Senate Republicans, Susan Collins of Maine and Lisa Murkowski of Alaska, opposed Ms. DeVos, leaving Vice President Mike Pence to cast the tiebreaking vote. Maybe the others figured it wasn’t worth risking Mr. Trump’s wrath by rejecting his selection to lead a department that accounts for only about 3 percent of the federal budget. Maybe they couldn’t ignore the $200 million the DeVos family has funneled to Republicans, including campaigns of 10 of the 12 Republican senators on the committee that vetted her. The tens of thousands of parents and students who called, emailed and signed petitions opposing Ms. DeVos’s confirmation refused to surrender to Mr. Trump. They couldn’t afford to have a billionaire hostile to government run public schools that already underperform the rest of the developed world. Did anyone who backed this shameful appointment think about them?",
      "date": "Feb. 7, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Whose Side Is Betsy DeVos On?",
      "url": "https://www.nytimes.com/2017/04/13/opinion/whose-side-is-betsy-devos-on.html?searchResultPosition=18",
      "subtitle": "null",
      "author": "The Editorial Board",
      "content": " Education Secretary Betsy DeVos is inexplicably backing away from rules that are meant to prevent federal student loan borrowers from being fleeced by companies the government pays to collect the loans and to guide people through the repayment process. On Tuesday, she withdrew a sound Obama administration policy that required the Education Department to take into account the past conduct of loan servicing companies before awarding them lucrative contracts — and to include consumer protections in those contracts as well. The department is doing the loan industry’s bidding at a time when student debt has crippled a generation financially and the country’s largest loan servicing company, Navient, is facing several lawsuits accusing it of putting its own interest before that of the borrowers it is supposed to help. A suit brought by the Consumer Financial Protection Bureau claims that Navient saved itself money by steering borrowers into costly repayment strategies that added billions in interest to their balances. But as Stacy Cowley and Jessica Silver-Greenberg reported in The Times on Monday, states’ lawsuits are especially damning with respect to Sallie Mae — the company that spun off Navient in 2014. The Illinois and Washington attorneys general argue that Sallie Mae engaged in predatory lending, saddling people with private subprime loans that the company knew in advance were likely to fail because borrowers would not be able to repay them. The two attorneys general — part of an investigative coalition of 29 states — argue that borrowers deserve to have these tainted private loans forgiven. The scenario outlined in the court documents bears a frightening resemblance to the subprime mortgage crisis of a decade ago — when mortgage companies caused millions of borrowers to lose their homes by steering them into risky, high-cost mortgages they could never hope to repay. The Illinois and Washington lawsuits argue that Sallie Mae used subprime private loans to build relationships with exploitative schools that then helped the company make more federal loans to their students. Those loans were the jackpot for the company, the lawsuit argues, because they were guaranteed by the government, which steps in to reimburse the lender when a borrower defaults. The defaulted private loans destroyed the financial lives of students. But they benefited the schools — which sometimes made deals with Sallie Mae to subsidize the losses — allowing them to comply with federal rules requiring that no more than 90 percent of a school’s revenue can come from federal financial aid. The case shows the dangers inherent in letting companies service federal and private loans simultaneously. Navient has denied wrongdoing in these cases. But a growing body of damning evidence shows that the loan servicing industry requires more oversight, not less. The attorneys general are doing a public service by using the courts to fight for borrowers.",
      "date": "April 13, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "The Comforts of the Betsy DeVos War",
      "url": "https://www.nytimes.com/2017/02/07/opinion/the-comforts-of-the-betsy-devos-war.html?searchResultPosition=17",
      "subtitle": "null",
      "author": "Ross Douthat",
      "content": " In these distinctly abnormal times for the republic, with Donald Trump in the White House and a group of unprepared revolutionaries around him, one must be grateful for small doses of normalcy and politics as usual. Thank heavens, then, for Senate Democrats, who just gave us the most predictable of spectacles: a liberal holy war against Betsy DeVos, just confirmed as the new secretary of education by Mike Pence’s tiebreaking vote. A visitor from Saturn might be puzzled by this particular crusade, since none of the things that liberals profess to fear the most about a Trump era revolve around education policy. If Trump is planning to surrender Eastern Europe to the Russians or start a world war with the Chinese, perhaps his secretary of state nominee deserved an all-night talkathon of opposition. If he’s bent on domestic authoritarianism with a racist tinge, then it’s Jeff Sessions, his attorney general, who presents the natural target for Democratic protest. If the biggest problem is that Trump will nominate allies who are unqualified for their responsibilities, then the choice of Ben Carson to run the Department of Housing and Urban Development seems like an obvious place to draw a line. But somehow it was DeVos who became, in the parlance of cable-news crawls, Trump’s “most controversial nominee.” Never mind that Trump’s logorrheic nationalism barely has time for education. Never mind that local control of schools makes the Education Department a pretty weak player. Never mind that Republican views on education policy are much closer to the expert consensus than they are on, say, climate change. Never mind that the bulk of DeVos’s school-choice work places her only somewhat to the right of the Obama administration’s pro-charter-school positioning, close to centrist Democrats like Senator Cory Booker. None of that mattered: Against her and (so far) only her, Democrats went to the barricades, and even dragged a couple of wavering Republicans along with them. DeVos did look unprepared and even foolish at times during her confirmation hearings, and she lacks the usual government experience. But officially the opposition claimed to be all about hardheaded policy empiricism. A limited and heavily regulated charter school program is one thing, the argument went, but DeVos’s zeal for free markets would gut public education and turn kids over to the not-so-tender mercies of unqualified bottom-liners. Just look at what happened in her native Michigan, her critics charged, where the influence of her philanthropic dollars helped flood Detroit’s school system with unsupervised charters run by incompetents and hacks. But the empiricists’ argument wasn’t particularly empirical. There’s no evidence that DeVos-backed charters actually visited disaster on Detroit’s students. Instead, the very studies that get cited to critique her efforts actually show the city’s charters modestly outperforming public schools. That “modestly” is important, because it tracks with much of what we know about school choice in general — that it offers real potential benefits without being a panacea. Decades of experiments suggest that choice can save money, improve outcomes for very poor kids whose public options are disastrous, and increase parental satisfaction. (The last is no small thing!) But the available evidence also suggests that choice alone won’t revolutionize schools or turn slow learners into geniuses, that the clearest success stories are hard to replicate, and some experiments in privatization (like Louisiana’s recent voucher push) can badly disappoint. So in DeVos, we have an education secretary who perhaps errs a little too much on the side of choice-as-panacea, overseeing (with limited powers) an American education bureaucracy that pretty obviously errs the other way. And wherever you come down on striking the right balance, it’s hard to see this situation as empirically deserving the level of political controversy that’s attached to it. So why did the Democrats fight so hard? Because in this particular case, the rules of normal pre-Trump politics still apply. First, when interest groups talk, politicians listen — and the teachers’ unions are simply more powerful in Democratic circles, with more money and leverage and clout, than most of the groups leading the charge against other Trump policies or nominees. It’s not that liberals aren’t genuinely worried about everything that makes Trumpism potentially abnormal and un-republican and authoritarian. But a more normal threat to a deep-pocketed interest group’s preferences still turned out to be a more natural rallying point than the specter of creeping Putinism. Second, even in the age of surging blue-collar populism, upper-middle-class suburbanites haven’t lost their influence, and they generally like their public schools and regard school choice as a threat rather than a promise. Charters and vouchers are most appealing to the poor, the religious and the eccentric — to low-income families locked into failing schools and religious conservatives and bohemians with ideological doubts about the content of the public-school curriculum. That’s a motley, divided constituency, whereas well-off suburbanites are easier to activate and rally. It’s the same dynamic that made it easy to defeat a modest expansion of charter schools in Massachusetts last November: Not only teachers-union-loving Democrats but also lots of Republican-leaning suburbanites, having bought (literally) into the existing system, tend to sympathize with liberal warnings that too much choice could leave their own kids worse off. Finally, even after Trumpism’s disruptions, the older culture-war bogeymen still get liberals excited. Sure, they’re officially more worried about white nationalism and the fate of NATO, but wave the cape of looming theocracy, and suddenly it’s 2004 all over again. After all, did you hear that DeVos is some sort of Calvinist? That she’s actually linked her policy views to her Christian piety? That her support for school choice could conceivably enable more evangelical and Catholic parents to send their kids to conservative religious schools? (If, that is, they aren’t already … home schooling!) I don’t want to make mock of all DeVos opposition. Senators had every right to vote against her if they felt her underqualified or uninformed. But the fervor and pitch of the opposition basically reflected the present Democratic Party at its worst: unstinting in defense of bureaucracy and its employees, more excited about causes dear to the upper middle class than the interests of the poor, and always girding for the battle with the Real Enemy, religious conservatives, no matter what the moment actually demands. But again, these are troubled times. Familiarity has its comforts. And a debate this predictable, this pre-Trumpian, came as something of a relief.",
      "date": "Feb. 7, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Fashion’s Betsy DeVos Connection",
      "url": "https://www.nytimes.com/2017/02/12/fashion/betsy-devos-pamella-roland-new-york-fashion-week.html?searchResultPosition=16",
      "subtitle": "null",
      "author": "Katherine Rosman",
      "content": " It was an eventful week for the DeVos family of Grand Rapids, Mich. On Tuesday, Vice President Mike Pence cast the tiebreaking vote, confirming Betsy DeVos as the Trump administration’s Secretary of Education. On Friday, Pamella DeVos staged her New York Fashion Week runway show for the Fall-Winter 2017 collection of her evening-wear line, Pamella Roland. Pamella and Betsy are married to brothers, Dan DeVos and Dick DeVos, who are sons of Richard DeVos, a billionaire founder of Amway. More than 300 people attended the fashion show, where they ogled aubergine crepe gowns, cashmere coats with fox fur cuffs and numerous sequined numbers, as models strode down the runway to tunes such as Michelle Gurevich’s “Russian Romance.” The education secretary, however, was not among them. Hours earlier, she was booed and harangued by protesters outside of a school in Washington that she had come to visit. Despite her sister-in-law’s absence, in an interview backstage, Pamella said Betsy had been an ardent supporter of the fashion line since it was introduced in 2002. “She wears it beautifully; she’s tall and thin and has been one of my best customers,” the designer said. Of the hoopla surrounding her sister-in-law’s nomination and confirmation, Ms. DeVos said, “It’s crazy because, I’m telling you, she’s very smart and she knows what she was walking into. She can handle it. But no one would do this if she didn’t have a love of education of the children.” Ms. DeVos has tried to keep her public and fashion personae apolitical. Though some captions in her Instagram feed link to one of her daughter’s accounts where the DeVos family’s enjoyment of President Trump’s inaugural festivities are on full display, Ms. DeVos avoids connecting her brand to her family, which gave financial support to Mr. Trump’s presidential campaign. As to why, consider the response of some in attendance when they learned of her family connection. Just before the lights went down, Sarah Gerrish, the fashion market director at Redbook settled in at her assigned seat next to Aja Mangum, a freelancer editor covering the show for Modern Luxury publications. Both said they had second thoughts about being at the show when they learned of Pamella Roland’s ties to Mr. Trump. “I questioned my attendance,” Ms. Gerrish said, noting that she was speaking of her personal convictions, not for her employer. “It gave me pause,” Ms. Mangum said, adding, “But we really don’t know what Pamella’s politics are, just because of the family she’s from.” For Ms. DeVos, it is not just her customers response she is worrying about. “You have to think about the people who work for you, too,” Ms. DeVos said. “We don’t want to bring that kind of craziness in.” Nevertheless, Ms. DeVos will continue to dress her sister-in-law, the education secretary, as well as other visible women in the nation’s capital. This is nothing new. “We’ve always had a presence in Washington,” she said. While models were primping and Ms. DeVos was giving interviews, the designer’s husband glad-handed in the front of the house, greeting family friends as they joined fashion buyers and editors in the large space, darkened by the drawn floor-to-ceiling shades. A small hubbub surrounded the actress Vanessa Williams, dressed in a white Pamella Roland strapless jumpsuit. Ms. Williams likes Ms. DeVos’s designs (she wore one to her May 2016 wedding) because Ms. DeVos is “a woman of a certain age and her pieces are mature without being old-ladyish,” she said, looking not the slightest bit old-ladyish. She is not Ms. DeVos’s only celebrity fan. Just a few days earlier, the singer and songwriter Rachel Platten appeared at the Red Dress Collection event, held in honor of the American Heart Association, wearing a red Pamella Roland gown. She also wore a Pamella Roland gown to the American Music Awards last November. Ms. Platten is best known being a writer of “Fight Song,” the unofficial anthem for the Hillary Clinton presidential campaign. On Nov. 8, Ms. Platten posted on Instagram a photograph of a campaign button that says, “A Woman’s Place is in the White House.” She captioned it “#ImWithHer,” likely referring to Mrs. Clinton, not either of the Ms. DeVoses.",
      "date": "Feb. 12, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Biggest Offender in Outsize Debt: Graduate Schools",
      "url": "https://www.nytimes.com/2019/06/03/upshot/student-debt-big-culprit-graduate-school.html?searchResultPosition=15",
      "subtitle": "The market for master’s degrees behaves in strange and erratic ways, new data reveals.",
      "author": "Kevin Carey",
      "content": " The signs are hard to miss in downtown San Francisco: two stylized A's inside a red circle, symbolizing the Academy of Art University. The for-profit school occupies more than 40 buildings throughout the city and has made its family owners very rich. Where does the Academy of Art’s money come from? About $100 million per year arrives as tuition and fees financed by federal student loans. The full scope of the borrowing was revealed May 21, when, for the first time, the Department of Education released information about how much debt students are taking on to earn degrees from various academic programs at American colleges and universities. The data shows one sector in particular with outsize debt: graduate school. And while the Academy of Art fosters unusually high burdens, many public universities and nonprofit schools have also gotten into the debt-fueled graduate school business. In releasing the college loan data, Education Secretary Betsy DeVos described it as part of President Trump’s executive order to address the student debt crisis. Access to the loan amounts, she said, will allow students to make informed decisions about choosing colleges. At the same time, the department is preparing to uproot the Obama administration’s approach to the debt crisis, by repealing regulations that cut college programs out of the federal financial aid system if students don’t earn enough money to pay their loans back. Within the graduate school sector, the fast-growing master’s degree market is replete with debt levels that make little sense. An accredited university can essentially create a master’s degree in anything, set whatever price it likes, start signing up students for federal loans, and market the program as “accredited.” At the Academy of Art, people with federal loans who graduated in 2016 and 2017 with a master’s degree in design and applied arts owed an average of $100,252. The university offered nine other master’s programs with average loan balances above $90,000. The Academy of Art is expensive, charging over $1,000 per credit, with thousands more for materials, supplies and fees. The numbers also reflect a key fact about federal financial aid policy: Although undergraduate student loans are limited to $31,000 for students who are financially dependent on their parents and $57,500 for those who are not, there are no hard caps on how much someone can borrow for graduate school. That means that students can borrow not merely for tuition, but also for living expenses, notoriously high in cities like San Francisco. (The Academy of Art makes extra money by renting out student housing.) Anyone who passes a credit check is eligible to borrow the full cost of attending any accredited graduate school, regardless of how much money a person has, or doesn’t have, in the bank. Borrowing for graduate school can be a sound financial decision, if the degree reliably leads to a well-paying career. But the new federal data suggests that the graduate school market often behaves in strange and erratic ways. It is not a classic Econ 101 situation in which demand and prices rise with the value of the services received. Sometimes, it seems the opposite. Yale, for example, has a highly ranked master’s of fine arts program. The admissions criteria are rigorous and include the submission of a portfolio of work that the faculty evaluates. The average debt for master’s of fine arts students at Yale turns out to be $21,573 — a significant but manageable sum in a field that doesn’t offer the gold-plated salaries of, say, investment banking. The Academy of Art does not evaluate student portfolios for admission to graduate school, or for its large undergraduate programs. Its success in placing graduates into jobs in their field is unknown, because the university doesn’t disclose that information. Its M.F.A. graduates earn only about $35,000 year. On average, they borrow more than $85,000. (The typical debt for an M.F.A. graduate nationally is around $45,000.) Joe Vollaro, executive vice president of financial aid and compliance at the Academy of Art, said the university provides students with loan counseling before and after they enroll. He added that the university is not legally allowed to limit how much money graduate students borrow from federal loan programs to pay for living expenses. There are many more examples of the complicated, seemingly dysfunctional graduate school market. People don’t become social workers to get rich — most earn less than $50,000 per year — yet $109,486 was the average amount borrowed for a master’s in the subject at the University of Southern California. That’s unusually high even though a large majority of the program’s students learn online. In fact, most of the $275 million in debt incurred by the roughly 2,500 people who earned a master’s degree in social work at U.S.C. in 2016 and 2017 didn’t go to the university itself. It was funneled to a publicly traded for-profit technology company called 2U, which provides marketing, recruitment, course design, clinical placement and advising services for online graduate programs, in exchange for which it receives 60 percent of all tuition revenue. Veterinarians are not extremely well paid: Half earn between $73,580 and $122,180 per year. Yet veterinary programs often graduate students with enormous debt burdens, a factor, some have speculated, in the abnormally high suicide rate within the profession. A number of high-debt veterinary schools are abroad. Ross University (St. Kitts), St. George’s University (in Grenada), and the universities of Glasgow, Edinburgh and Prince Edward Island all have vet schools that American students are borrowing over $230,000 on average from the federal government to attend. Incurred debt can vary widely for the same fields. Students borrowed $153,000 on average to get a master’s of dispute resolution from Pepperdine University. The next-highest amount for the same degree, from Creighton University, was $88,000. Logan University, a chiropractic school in Chesterfield, Mo., has a master’s in dietetics and clinical nutrition that students borrowed $150,000 on average to receive. The same degree at Utah State University produced average debt of $17,000. A Pratt Institute master’s of architecture resulted in average borrowing of $157,000, while the same degree from Ohio State produced average debt of $38,000. Master’s degrees in fields like computer engineering, education, English, history and math seem to have fewer outlier programs and lower borrowing amounts over all. It’s the less mainstream programs, where vague promises of a lucrative career are easier to make, that seem to encourage irrationally large debt. This matters because the assumed efficiency of the higher education market is the keystone of the Trump administration’s deregulatory agenda. The timing of the data release was deliberate: The Department of Education is expected to issue a final rule to cancel the Obama administration regulations within the month. At an education journalists conference, Diane Auer Jones, a high-level department official, said, “Because we will put information out there, we think consumers will make good decisions.” Ms. Jones added, “We do not think it’s the role of the federal government to make a decision on behalf of a student.” But the Academy of Art, among others, suggests that approach may not work. The Department of Education has been publishing college graduation rates for over a decade. The latest numbers show that only 28 percent of Academy of Art undergraduates earn their diploma within eight years; most transfer or drop out. Yet thousands continue to enroll. The Academy of Art master’s of fine arts program failed the Obama administration criteria because of high debt and low earnings (a possible punishment was avoided when the Trump administration suspended the Obama-era rules). But that information has been available for over two years. Students continue to enroll. A handful of numbers on a government website can be no match for trained recruiters who get a bonus from colleges for enrolling more students. (This is an illegal practice that the Academy of Art stands accused of in a federal lawsuit that may soon go to trial.) Universities also spend millions on perfectly legal marketing campaigns to convince students that taking out large debts for graduate school will pay off in the long run. The federal government has typically financed those loans, no questions asked. But as outstanding student debt rises above $1.5 trillion and as one million people default on student loans every year, lawmakers will have to decide whether that approach should continue.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "The Risk with Betsy DeVos",
      "url": "https://www.nytimes.com/2016/11/24/opinion/the-risk-with-betsy-devos.html?searchResultPosition=14",
      "subtitle": "null",
      "author": "David Leonhardt",
      "content": " This article is part of the Opinion Today newsletter. You can sign up here to receive more briefings and a guide to the section daily in your inbox. Many of the initial reactions to Donald Trump’s choice for Education Secretary — Betsy DeVos, an education-reform advocate — were predictable. Many conservatives praised her, and many liberals blasted her. For anyone who still has an open mind about the politics of education, though, I’d urge a nuanced, wait-and-see reaction. Education reform — an inchoate mix of standards, accountability and choice — has succeeded in some big ways. These successes don’t get as much attention as they deserve, which is in part the fault of us in the media; we tend to focus on bad news, and to be sympathetic to traditional schools. For a very quick sense of the reform movement’s successes, you can look at the results in Washington or New Orleans, two laboratories of change (or read my recent column from Boston, which reviews the academic research). Yet those of us who believe these successes are real also need to acknowledge that education reform isn’t a magical formula for success. Some reform-oriented schools have failed miserably. In particular, some in Detroit — where DeVos has been active — have evidently failed. What separates success and failure? Success depends on a balance of autonomy and accountability, as Susan Dynarski of the University of Michigan says. “Too little autonomy: stifles innovation,” Dynarski tweeted this week. “Too little accountability: bad schools proliferate & harm students.” Traditional schools often lack both autonomy and accountability. They can’t make their own decisions about curriculum or personnel, and they can deliver poor results, or great results, year after year with little consequence for principals and teachers. DeVos wants to blow up that system and turn education into more of a free market. I agree that more competition and choice would help many parents and students. But I worry that DeVos is drawn to a version of school reform that has its own troubles with accountability. She has pushed for vouchers that allow parents to pay for private schools even more than she’s pushed for greater autonomy and accountability in the public-schools system. And there is clear evidence that competitive market forces, by themselves, don’t prevent bad schools. The market is too complicated: parents and students can’t always judge what makes a good school and can’t easily leave one they have chosen. Just look at the many poor-performing for-profit colleges — or the fact that Michigan’s version of education reform, which is heavy for-profit schools, seems to be performing worse than other states’ versions. Choice works best when mixed with oversight. The politics of education have turned nasty in recent years, featuring various ideologues who can’t be persuaded by evidence. DeVos will obviously bring some strong views to the Education Department, but here’s hoping that she is open to evidence as well. No matter how good an idea may seem in theory, it needs to help children in practice.",
      "date": "Nov. 24, 2016",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "No Profit in Betsy DeVos",
      "url": "https://www.nytimes.com/2017/10/27/opinion/betsy-devos-for-profit-colleges.html?searchResultPosition=13",
      "subtitle": "null",
      "author": "Gail Collins",
      "content": " Perhaps you’re wondering how Betsy DeVos is doing. Or maybe not, unless you’re planning to go to a Halloween party dressed as the secretary of education. DeVos is the superrich Republican donor who once led a crusade to reform troubled Michigan public schools by turning them into truly terrible private ones. Now she’s in the Trump cabinet, and she seems to be dedicating a lot of her time to, um, lowering higher education. “When no one was watching she hired a lot of people that come from the for-profit colleges,” complained Senator Patty Murray of Washington, who feels the additions are far more interested in protecting their old associates than in overseeing them. Murray is the top Democrat on the Health, Education, Labor and Pensions Committee, otherwise known as HELP. These days it’s hard to tell whether that’s a promise of assistance or a cry of distress. To oversee the critical issue of fraud in higher education, DeVos picked Julian Schmoke Jr., whose former job was a dean of — yes! — a for-profit university. Specifically a school named DeVry. Last year, under fire from state prosecutors and the Federal Trade Commission, DeVry agreed to pay $100 million to students who complained that they had been misled by its recruitment pitch. That sort of thing is getting to be common in the darkest corners of the for-profit world. For instance, there’s a now-defunct “university” that promised to show students how to get rich quick in real estate and wound up paying $25 million to settle the case. … Back to the Department of Education. One of DeVos’s top advisers, Robert Eitel, is on a leave of absence from a company that operates for-profits and once paid more than $30 million to settle charges of deceiving students about the loans they were getting. Which is, again, even more than that real estate school, where some students claimed they were encouraged by instructors to increase the limits on their credit cards. … There are well over 3,000 for-profit colleges and universities in the country, everything from tiny schools that promise to set you off on a career in cosmetology to conglomerates with campuses all over the world. Some of them have names that might seem intended to be confused with somebody else’s. (Not necessarily thinking of you, Brown College, Berkeley College, Columbia Southern University or Northwestern College.) Experts say some for-profits are fine. However, there have been a ton of horror shows in which low-income men and women are promised a path to life-changing jobs but wind up with nothing to show except huge loan bills. ITT Technical Institute in Florida gave students the impression they’d be having careers along the line of “C.S.I.: Miami.” Actually, they frequently wound up working as security guards, degree in hand and $50,000 in debt. There are so many awful for-profit school stories. There was that one in New York that sold students a $35,000 “Gold Elite Package” and had to change its name to “Entrepreneur Initiative” after the state determined it had no right to call itself a university. … “The outcomes for people who take out loans at for-profits are abysmal,” said Ben Miller of the Center for American Progress. He added that almost all the students borrow, for courses they could sometimes get for one sixth the price at a community college. And about half the people who borrow default. As the stories about deceitful for-profits mounted, the Obama administration came up with regulations making it easier for students to refuse to pay their loans if a school had misrepresented their chances of graduating and getting a lucrative career. The rules were supposed to go into effect in July, but DeVos has delayed their implementation. Insiders call those regulations “borrower defense to repayment.” However, if you prefer, you could also refer to them as “something that reminds us of a certain school that used to promise its students fabulous careers in the real estate industry. …” O.K., we’re talking here about Trump University. I knew I couldn’t fool you forever. Cynics might wonder if DeVos has been going to the defense of for-profit colleges so quickly because she wants to please her boss. Who might not enjoy seeing a lot of headlines about greedy colleges that make promises they never intended to keep, being brought down by the forces of justice. But let’s be positive. Perhaps we could be grateful that DeVos is giving us opportunities to bring up Trump University on a regular basis. As a sort of cautionary tale. For instance, the Department of Education has stopped approving new fraud claims against for-profits, leaving a backlog of more than 87,000. Every time the number goes up, we could say, “This is even more than the number of students who complained about their loans for Trump University.” If DeVos says what the country needs now is less regulation, we can recall that Trump University had instructors allegedly handpicked by Donald Trump himself, although it turned out that he’d never even met them. Consider it a teaching moment.",
      "date": "Oct. 27, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Will Betsy DeVos Expand the School-to-Prison Pipeline?",
      "url": "https://www.nytimes.com/2018/03/12/opinion/devos-school-prison-pipeline.html?searchResultPosition=12",
      "subtitle": "null",
      "author": "Michelle Goldberg",
      "content": " On Sunday evening, CBS’s “60 Minutes” broadcast an interview that Lesley Stahl conducted with Betsy DeVos, Donald Trump’s education secretary and one of the richest members of his very rich cabinet. It was overwhelmingly seen as a disaster for DeVos, who struggled to answer very basic questions. She couldn’t say, for example, why schools in Michigan, her home state, have largely gotten worse since the widespread introduction of the school choice policies she lobbied for. When Stahl asked whether, as secretary, she’d ever visited a failing school to find out what went wrong, DeVos said, “I have not intentionally visited schools that are underperforming.” Like many things in Trump’s administration, this performance was shocking but not surprising. Before becoming secretary of education, DeVos had never worked as an educator or a policymaker; she was a donor to education reform efforts favored by the right, such as school choice and vouchers. Her confirmation hearings last year were an embarrassment. She appeared to be unfamiliar with the Individuals With Disabilities Education Act, a federal civil rights law. After taking office, she described historically black universities and colleges, founded in response to segregation, as “pioneers when it comes to school choice.” As this comment suggested, DeVos is, at best, oblivious about race. That obliviousness — or worse — is behind one of the more disturbing moments in her “60 Minutes” interview. In a sick irony, some on the right would use the recent school shooting in Parkland, Fla. — allegedly committed by a young man who carved swastikas into the magazines for his semiautomatic rifle — as a pretext to roll back civil rights protections for students of color. On “60 Minutes,” DeVos, whom Trump has chosen to lead his new school safety commission, appeared to signal she’s on board. To understand how, we need to start with a letter that Senator Marco Rubio, Republican of Florida, sent to DeVos and Attorney General Jeff Sessions on March 5 about the mass shooting at Marjory Stoneman Douglas High School. Rubio referred to a 2014 Barack Obama-era directive, known as the Dear Colleague Letter on the Nondiscriminatory Administration of School Discipline, intended to address the so-called school-to-prison pipeline, in which disadvantaged students are funneled into the criminal justice system for misbehaving at school. The Dear Colleague Letter said school personnel must “understand that they, rather than school resource officers and other security or law enforcement personnel, are responsible for administering routine student discipline.” Without citing any evidence, Rubio wrote that this guidance “may have contributed to systemic failures” to report the suspected Parkland gunman, Nikolas Cruz, to the police, and asked DeVos to revise it. Ann Coulter made a similar argument in a column published in Breitbart: “Cruz’s criminal acts were intentionally ignored by law enforcement on account of Broward’s much-celebrated ‘school-to-prison pipeline’ reforms.” “The logic that people try to manufacture is that the effort to end exclusionary school discipline renders schools unsafe places,” Catherine Lhamon, who served as assistant secretary for civil rights in Obama’s Department of Education, told me. “It doesn’t even bear scrutiny, really.” But in this administration it doesn’t have to. DeVos isn’t just considering ending the policy. Speaking to Stahl, she refused to even admit that race plays a role in discipline. Among experts, this isn’t really a subject for debate. “There’s some fairly good empirical evidence that says minority students are more likely than white students in similar situations to be written up and disciplined,” said Michael Hansen, a senior fellow at the Brookings Institution who studies education policy. Speaking to DeVos, Stahl compared situations in which white kids are punished for classroom disruption by a trip to the principal’s office, while for black kids, “they call in the cops.” DeVos refused to say such a discrepancy is wrong: “Arguably, all of these issues or all of this issue comes down to individual kids.” Stahl pressed her on whether this “disproportion in discipline” constitutes “institutional racism.” DeVos said she was committed to “making sure students have opportunity to learn in safe and nurturing environments.” The comparison Stahl offered was a hypothetical, but it captured the heart of the issue. Black public school students are suspended at 3.8 times the rate of white students. That discrepancy alone doesn’t necessarily demonstrate discrimination, but there’s evidence that students of color are punished differently from white students for the same infractions. Lhamon told me about one elementary school where a black girl was suspended for poking a student with a pencil. When a white girl in the same grade threw a rock that hit another child in the head and broke the teacher’s sunglasses, she was made to help the teacher clean the classroom during lunch. The DeVos interview has already sent a message that schools can be less mindful of stark disciplinary disparities. Combine this tacit license to discriminate with the Trump administration plan to encourage the arming of teachers, and you have a recipe for something combustible. There’s a lesson here that applies across the administration. Don’t let the clownishness distract you from the bigotry.",
      "date": "March 12, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "The Bane That Is Betsy DeVos",
      "url": "https://www.nytimes.com/2018/08/17/opinion/betsy-devos-for-profit-colleges.html?searchResultPosition=11",
      "subtitle": "Watch out, the secretary of education is on the loose.",
      "author": "Gail Collins",
      "content": " Today let’s talk about the evil deeds of Betsy DeVos. We’ve been distracted, what with Omarosa and the Manafort trial and that $90 million military parade we were so looking forward to. At the same time, our secretary of education has been busy, working to protect for-profit colleges from their students. Yes! We keep being told that Donald Trump was elected because working-class Americans were worried that their kids wouldn’t be able to move up in the world. And now DeVos is making it easier for those very same kids to be cheated when they try to prepare for a career. It’s quite a story, just as DeVos is quite a gal. Probably the first secretary of education with a $40 million family yacht that’s registered in the Cayman Islands, presumably to avoid American taxes. Is that the yacht that got mysteriously untied the other day? Yes, it was moored in Ohio and an unknown person set it adrift, causing up to $10,000 in damage. We do not approve of this sort of behavior, people! Somebody could have gotten hurt. And the DeVos family might have been without a floating residence, except for the other nine yachts they own. But before I permit any more distractions, we need to discuss policymaking at the Department of Education: The Obama administration worked very hard to weed out bad for-profit colleges. The policy it finally came up with was to compare an average graduate’s debt with the average graduate’s earnings. Then cut off federal grants and loans to the schools that had a really terrible ratio. And give the students who’d gotten a raw deal a chance to get their loans forgiven. Excuse me, but does this apply to, say, philosophy majors? My grandson is finishing up at the state university and I do not see how all these courses on Heidegger are going to get him work. No, we’re talking about schools that are just there to prepare students for a career, whether it’s computer engineering or cooking or auto mechanics. Your grandson is in a privileged minority. If you want an American college student to worry about, Suzanne Martindale of Consumers Union says you should think less about a kid on a four-year campus and more about “someone 29 with three kids.” Or Stephanie Stiefel, who enrolled at the now-defunct for-profit International Academy of Design and Technology in Tampa to get a B.A. that she was assured would lead to a good-paying position in interior design: “They made it seem so simple — just do well in class and finish the program.” She graduated with a 3.8 and $62,000 in debt, then discovered that the only jobs she could land were minimum-wage positions she could have gotten without any training at all. Other schools wouldn’t accept her credits when she tried to get an advanced degree. Now, 10 years later, she’s finished a tour of duty in the Army and owes $110,000. “At this point I just make the payment and cry about it,” she said. DeVos, meanwhile, is worried about the government making “burdensome” demands on the for-profit schools. We will take a break for a minute to sigh. Oh gosh, this is so depressing. I hate thinking about the things this administration is doing to ordinary people. Is there any chance you could distract me by working in Omarosa? Well, be a good citizen and stay with me for a minute. DeVos loves for-profit education — you may remember she championed an overhaul of the Michigan school system, which replaced troubled public schools with truly terrible charter schools, most of them for-profit. So she’s chipping away at anything the for-profits don’t like. Like the Obama rule allowing aggrieved students to petition to get their loans forgiven. The new idea would pretty much limit relief to people who’ve fallen into deep financial distress. Nobody seems to have seen that one coming. And lord knows what’s next. Amy Laitinen, at the nonpartisan think tank New America, is worrying that the department will “allow a college to outsource its program to an unaccredited provider.” Which in theory could mean that when you pay your tuition to what seems to be a legitimate school, you could find yourself bused over to Trump University for classes. I’m so glad you got Trump University in there. DeVos has stuffed her department with people from the for-profit education industry. The guy who’s supposed to be overseeing fraud investigations is a former dean of a for-profit named DeVry University, which paid $100 million to settle a lawsuit over misleading marketing tactics. But you still promised me Omarosa. Find a way to work her in. The famous memoir claims Trump calls his secretary of education “Ditzy DeVos” and vowed to get rid of her. The first certainly sounds likely. But by now we are well aware that the current president of the United States is incapable — oh, irony of ironies — of firing anybody. And I don’t want to give you the impression that Trump has any reservations about for-profit colleges that make grandiose promises to their students about future careers, while taking their money and preparing them for nothing whatsoever.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "She Left the Education Dept. for Groups It Curbed. Now She’s Back, With Plans.",
      "url": "https://www.nytimes.com/2019/06/09/us/politics/diane-auer-jones-betsy-devos.html?searchResultPosition=10",
      "subtitle": "null",
      "author": "Erica L. Green",
      "content": " WASHINGTON — Depending on whom you ask, Diane Auer Jones has returned to the Education Department with either a mission or a vengeance. A little more than a decade ago she resigned as an assistant secretary for postsecondary education in the George W. Bush administration, after protesting the department’s treatment of an accreditor that oversaw religiously affiliated, liberal-arts colleges. Department officials saw accountability in their crackdown; Ms. Jones saw bias against a gatekeeper for nontraditional college degrees. “Favored accreditors are treated differently than unfavored accreditors,” she said in an interview. “That was my awakening to how the current system could be manipulated to pick winners and losers.” Now, as the chief architect of Education Secretary Betsy DeVos’s higher education agenda, Ms. Jones is leading the charge to overhaul the accreditation system, and, to critics, revive the fortunes of for-profit organizations that operate low-quality education programs that have a track record of shortchanging students and taxpayers. The fact that Ms. Jones went on to work for some of those institutions after she resigned has made her perhaps the most controversial appointee at the Education Department. “President Trump’s Department of Education is stacked with former for-profit executives whose companies got rich by ripping students off,” said Charisma L. Troiano, the press secretary for Democracy Forward, a government watchdog organization that has accused Ms. Jones of several conflicts of interest. “For decades, Diane Auer Jones has advocated for this predatory industry.” Ms. Jones has proposed a significant rewrite of rules that would loosen the federal government’s reins on accreditors, largely invisible but critical watchdogs whose stamp of approval serves as an education institution’s lifeline to millions of dollars in financial aid. The rules would make it easier for accreditors to be recognized by the Education Department to oversee institutions, and afford them more flexibility in how they manage programs. They would also relax departmental standards for measuring accreditors’ performance, and potentially allow them to take years to penalize troubled schools. The rules would strengthen the role that accreditors have in preventing abrupt school closures, and extend federal funding to troubled schools longer to allow students to make other plans. The new regulations are expected to be published as early as this week for public comment. The rules would deliver on Ms. DeVos’s promise to deregulate higher education to foster innovation and competition among institutions, particularly for-profit colleges and career-education programs, that serve a vast and diverse population. For Ms. Jones, they also reflect unfinished business. After she left the department, she joined the board of the American Academy for Liberal Education, the religious-school accreditor that prompted her resignation, where she railed against the Education Department’s accreditation process. In the Trump administration, she has found exoneration. When the accreditation rule-making session ended, with negotiators reaching a rare consensus, in April she popped champagne in the negotiating room. She trumpeted that the rules cut down on “bureaucratic minutiae that distracts institutions from students.” Consumer protection advocates see the rules as part of a larger plan to allow Ms. Jones’s allies in the for-profit industry to proliferate and operate with few guardrails. Some of the proposals reflect wish lists that for-profit and career schools have lobbied for in Congress. They throw a safety net to accreditors and programs that have struggled to meet departmental standards. “The proposed regulations cut any serious oversight of colleges off at the knees,” said Clare McCann, the deputy director for federal policy at New America, a policy research group. “Bottom-feeder colleges will be able to keep enrolling students and pulling in taxpayer dollars for years, and it will be nearly impossible for the Education Department to take action against failing accreditors.” Some higher education experts have been supportive but cautious. Terry Hartle, a vice president at the American Council on Education, an association representing more than 1,700 colleges and universities and related organizations, said the accreditation rules were “important, incremental movements” that have been long desired by a range of institutions. He served on the committee of department-appointed negotiators, including department officials and consumer protection and higher education representatives, and said the rules would allow high-quality institutions to experiment in new ways. Mr. Hartle, who has known Ms. Jones for more than a decade, said he believed allegations that the rules were designed to benefit flailing for-profits was an “easy answer.” “Diane is extremely knowledgeable and she’s always been a professional,” he said. What opponents and proponents can agree on is that none of the changes are as contentious as Ms. Jones herself. As principal deputy under secretary at the Education Department, Ms. Jones is seen as the mastermind behind Ms. DeVos’s most criticized decisions, including the rollback of two major Obama-era regulations that sought to protect students from predatory practices by for-profit institutions. She also recommended the reinstatement of a scandal-plagued accreditor, Accrediting Council for Independent Colleges and Schools, known as A.C.I.C.S., which the Obama administration sought to banish after the collapse of two for-profit chains, ITT Technical Institute and Corinthian Colleges, which were under its supervision. The decision prompted Senator Richard Blumenthal, Democrat of Connecticut, to call Ms. Jones a “former for-profit college lackey.” In an interview, Ms. Jones rejected such characterizations and said she took her cues from Ms. DeVos. “When you have a bold leader, that emboldens you to do the right thing,” she said, “even when it means bad press, even when it means an ugly tweet.” Although her ethics forms have been cleared, Ms. Jones has frustrated advocates and Democrats by repeatedly rejecting their calls to recuse herself from policymaking that could benefit her former employers. In addition to serving on the board of the American Academy for Liberal Education, she was also an executive at Career Education Corporation — where she lobbied against the regulations she is seeking to revise. The company is one of the largest for-profit operators in the nation and settled multistate, yearslong investigations over accusations that it misled students with inflated job-placement rates. The majority of the company’s campuses were accredited by the Accrediting Council for Independent Colleges and Schools. Ms. Jones said she is not concerned with making the company money. She was the one who reported the improprieties found at its schools to the schools’ accreditor and the Education Department, she said. The corporation’s financial records show it lost millions during her tenure. Ms. Jones’s recommendation to reinstate the accrediting council, which is now struggling financially, is under investigation by the Education Department’s inspector general. This week, students from Virginia College, a chain of for-profit schools, sued Ms. DeVos saying that the reinstatement led to their colleges’ demise. She denies allegations that there was anything nefarious behind the decision to reinstate the accrediting council, which was prompted by a judge ordering the department to review the Obama administration’s decision to banish the accreditor. Ms. Jones answered bluntly when asked why she refused to recuse herself from the decision to avoid perceived conflicts: “It was my job. There are only a few of us at the department who know accreditation as well as I do.” While Ms. Jones’s motivations are often pegged to her five years in the for-profit sector, she said they were more inspired by her last two years of high school. Ms. Jones attended a diverse, low-income school outside Baltimore, after she and her mother fled domestic violence. Students there were seen as “those kids,” for whom higher education seemed out of reach. In her junior year, against the advice of her administrators, the high-achieving student chose to cut her class schedule in half to join a program, called “cooperative education,” that allowed her to do an apprenticeship at a hospital as a nursing assistant. The program was intended for students with behavioral and other challenges. That was not her profile, but it was the only program that kept Ms. Jones in high school. Her mother needed help paying the bills, and Ms. Jones was looking for a way to earn money. “I learned more in that experience than in any of my schooling,” said Ms. Jones, a trained molecular biologist. “I realized that if you find opportunities for students, everybody has their place.” Ms. Jones denies that she favors a certain type of school, but she admits she identifies with a certain kind of student. That includes students who, like her, were branded for taking a nontraditional path — although she was ranked No. 1 in her class, she could not be valedictorian because she enrolled in the alternative program. Students who put themselves through college on stipends and scholarships. And others who take career diversions like she did to attend a for-profit massage therapy school and run her own business, gaining skills to navigate their way to powerful institutions like the National Science Foundation, Congress, and the Education and Labor Departments. Ms. Jones said that it was those experiences that were driving her changes, and what she believed was an honest conversation about improving every part of the higher education system. “There are people out there who think this can be done in a different way, and I don’t resent that,” she said. “But frankly, I have ideas for how to do it, and mine are grounded in the experience of being the underdog.”",
      "date": "June 9, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "DeVos Repeals Obama-Era Rule Cracking Down on For-Profit Colleges",
      "url": "https://www.nytimes.com/2019/06/28/us/politics/betsy-devos-for-profit-colleges.html?searchResultPosition=9",
      "subtitle": "null",
      "author": "Erica L. Green",
      "content": " Education Secretary Betsy DeVos on Friday officially repealed an Obama-era regulation that sought to crack down on for-profit colleges and universities that produced graduates with no meaningful job prospects and mountains of student debt they could not hope to repay. The so-called gainful employment rule was issued by the Obama administration in 2014, right before huge for-profit chains collapsed, leaving students stranded with debt and worthless degrees. Under the new standards, career and certificate programs, many of which operate in the for-profit sector, would have to prove their graduates could find gainful employment to maintain access to federal financial aid. It also would have required schools to disclose in advertisements a comparison of the student debt load of their graduates and their career earnings. In her first two years in office, Ms. DeVos has delayed critical parts of the rule, and last year, she sought to repeal it entirely, siding with for-profit industry leaders and congressional conservatives who have contended that the Obama administration unfairly targeted for-profit schools. Education Department officials have argued that transparency, not regulation, is the best way to hold all schools — public nonprofits, community colleges and for-profits — accountable for their results. Instead of any accountability measures, it promised to expand an existing database, called the College Scorecard, to provide information on student debt and earnings prospects. The database, which provides information, including loan debt information, for 2,100 certificate granting programs, was unveiled last month. On Friday, Ms. DeVos said that the scorecard was “only the beginning.” “These important reforms are a more complete and effective way to hold all types of higher education institutions accountable and make sure that students have a full suite of data when making a decision about their education,” she said in a statement. “This administration will continue to put students first and make sure they not only have a multitude of pathways to success post-high school but also the information they need to make the best choices for themselves.” But in rescinding the rule, the department is eradicating the most fearsome accountability measure — the loss of federal aid — for schools that promise to furnish students with specific career skills but fail to prepare them for the job market, leaving taxpayers on the hook to pay back their loans. Congressional Democrats and student advocates said rescinding the rule would leave the scandal-scarred for-profit college industry unchecked. The repeal will take effect July 2020. The department estimated that repealing the rule would cost $6.2 billion over 10 years, which includes funding grants and loans to students attending schools that would have been cut off from federal funding under the Obama rule. “Repealing — rather than revising or replacing — the gainful employment rule will prop up low-quality for-profit colleges at the expense of students and taxpayers,” said Representative Robert C. Scott of Virginia, the chairman of the House education panel. “Today’s announcement underscores the need for Congress to pass a comprehensive reauthorization of the Higher Education Act that protects students and taxpayers from low quality for-profit schools.” Bob Shireman, a senior fellow at the Century Foundation and an architect of the rule when he was in the Obama administration, called the repeal “disturbing and shortsighted.” “They are opening the door to operators whose singular focus on gobbling up federal grants and loans for their investors will steer the business toward manipulative recruiting and poor quality training,” he said. The Obama administration began drafting the regulations when the for-profit college sector was booming, with large chains enrolling 500,000 students at a time. But it was seen as a crucial safeguard against predatory colleges after the collapse of ITT Tech and Corinthian Colleges beginning in 2015. The Obama administration also tried to channel loan relief to graduates who were defrauded by their colleges. Ms. DeVos has moved to overhaul that “borrower-defense” rule as well, hoping to give some students only partial relief. That process has been tied up in court proceedings, leaving more than 150,000 student claims in limbo. One part of the gainful employment rule that had already been put into place has identified hundreds of failing programs, many of which went on to close after they were measured against the new standards. In the Education Department’s first assessment of debt-to-earnings ratios for college graduates, about 98 percent of programs that failed to meet standards for earning power were for-profits. An analysis included in the department’s final rule also shows that for-profits continued to have a significantly higher failure rate. But the department argued in its final rule that the debt-to-earnings formula created by the Obama administration was “fundamentally flawed” and did not account for factors other than the quality of an education that could affect students’ earning potential. The department also said that the rule did not properly account for other kinds of programs that have poor career outcomes and high debt, such as some liberal arts degrees. For-profit leaders have said that although the Obama rule was never fully enforced, its intent already shut down the worst-performing schools in their sector. Since 2010, when the Obama administration began deliberating the rules, more than 2,000 for-profit and career programs — nearly half — have closed, and the industry’s student population has dropped by more than 1.6 million. “The U.S. Department of Education’s final decision commits our nation’s entire higher education system to full transparency,” said Steve Gunderson, the president of Career Education Colleges and Universities, the for-profit trade group. “Instead of picking and choosing winners and losers in higher education, the department will make available, in a student-friendly and transparent manner, key data points at a program level for all programs at all schools.”",
      "date": "June 28, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Emails Show DeVos Aides Pulled Strings for Failing For-Profit Colleges",
      "url": "https://www.nytimes.com/2019/07/23/us/politics/dream-center.html?searchResultPosition=8",
      "subtitle": "null",
      "author": "Erica L. Green",
      "content": "  WASHINGTON — Dream Center Education Holdings, a subsidiary of a Los Angeles-based megachurch, had no experience in higher education when it petitioned the federal Education Department to let it take over a troubled chain of for-profit trade schools. But the organization’s chairman, Randall K. Barton, told the education secretary, Betsy DeVos, that the foundation wanted to “help people live better lives.” The purchase was blessed despite Dream Center’s lack of experience and questionable finances by an administration favorable to for-profit education. But barely a year later, the company tumbled into insolvency, dozens of its colleges closed abruptly and thousands of students were left with no degree after paying tens of thousands of dollars in tuition. Making matters worse, the college is accused of enrolling new students and taking their taxpayer-supported financial aid dollars even after some of its campuses had lost their accreditation, which rendered their credits worthless. Company emails, documents and recordings show that part of why Dream Center kept going is that it thought the Education Department, which under Ms. DeVos has rolled back regulations on for-profit education, would try to keep it from failing. Mr. Barton emailed other Dream Center executives that the department’s head of higher education policy — Diane Auer Jones, a former executive and lobbyist for for-profit colleges — had pulled strings to help the company’s schools in their effort to regain a seal of approval from an accreditor, despite their perilous positions. In another instance, Dream Center’s chief operating officer told faculty at an endangered campus that Ms. Jones was changing departmental regulations to help the schools obtain accreditation retroactively. Although the Trump administration did eventually cut off federal aid to the chain of colleges and precipitate their collapse, Democrats say the department failed to respond to warning signs. Representative Robert C. Scott, a Virginia Democrat who is the chairman of the House Education Committee, unveiled a trove of documents, including internal communication between executives from Dream Center, in a letter to Ms. DeVos this month. He said the documents suggest that Ms. Jones misled Congress about her efforts to help shield Dream Center from its misdeeds. “The actions of Dream Center and the Department of Education’s execution of its responsibility to protect students raise grave concerns,” Mr. Scott wrote. Instead of requiring Dream Center to take action, “the department informed Dream Center executives that it would work to retroactively accredit the institutions during the periods they had lied to students — rewriting history to erase Dream Center’s deceptive marketing practices,” Mr. Scott wrote. The Education Department has maintained it did nothing wrong. “This story is based entirely on a wrongful premise,” the department wrote in a statement. “The full and complete timeline shows Dream Center did not receive any unique benefits from policy decisions made by the department. We simply worked to try and get as many students into a new program as possible. While we did not achieve a perfect outcome, our actions helped thousands of students land on their feet.” In a response letter to Mr. Scott on Monday, the department’s acting general counsel, Reed D. Rubinstein, submitted documentation that he said contradicted the committee’s “unfair suggestions” that the department tailored its policies to assist Dream Center and was not forthcoming with Congress. “The Department categorically rejects these allegations,” he wrote. “Dream Center’s management received no special treatment,” he said. President Trump has moved to deregulate any number of industries, from mining and offshore oil exploration to chemicals and internet providers. But Ms. DeVos’s efforts to get the government off the backs of for-profit colleges have come under particular scrutiny, in part because of the spectacular implosions of for-profit college chains only a few years ago, in part because people who once worked in the sector have led the DeVos deregulatory push. Dream Center’s collapse was the first of the new deregulatory era. Yet Education Department officials insisted, repeatedly, that its demise had nothing to do with the administration’s policies or efforts. Ms. Jones told Congress that she did not even know of Dream Center’s accreditation problems at the time the company said she was working to get it out of its jam. She also told lawmakers the policy change extending retroactive accreditation had “nothing to do with the Dream Center.” Those assurances are now being questioned. “The documents further suggest that department officials were not forthcoming to Congress and the public about the information they had about Dream Center’s status and practices,” Mr. Scott wrote. He is requesting emails, text messages and interviews with several department officials, including Ms. Jones. The letter and documents “raise questions about whether the department took steps to allow Dream Center to mislead students,” Mr. Scott said. [Read the documents.] From the start, the Education Department overlooked red flags when, in late 2017, Dream Center took control of more than 100 campuses with 50,000 students from a for-profit higher-education company, Education Management Corporation. Around that time, Dream Center’s accreditor, the Higher Learning Commission, notified the organization that it was about to change two of its schools’ accreditation status. Two Education Department officials, including the agency’s director of accreditation, were copied on the letter. In January 2018, the accreditor published a notification on its website stating that the two Dream Center schools were not accredited by the Higher Learning Commission. It ordered Dream Center to tell students that their courses and degrees “may not be accepted in transfer to other colleges and universities or recognized by prospective employers.” Yet for five months, Dream Center kept advertising, “We remain accredited.” By July 2018, Dream Center was running out of cash and knew its accreditation problems could worsen its financial strain. Emails from that month obtained by the House Education Committee indicate that Dream Center officials believed that the Education Department was maneuvering to help it stave off catastrophe. In written responses to questions from Congress, the Education Department said Ms. Jones was first made aware that the two Dream Center institutions were not accredited on July 10, 2018. She was unaware of the public notice that the Higher Learning Commission had issued nearly six months earlier, according to the agency. She was notified a week later that the institutions were misrepresenting their accreditation status and ordered them the next day to stop, the department said. Ms. Jones was asked during a House Oversight Committee hearing this spring whether a policy she had issued later that month that allowed accreditations to be granted retroactively was aimed at helping Dream Center. “Absolutely not. It had nothing to do with the Dream Center,” she answered. But in company emails, Dream Center executives indicated the Education Department tipped them off on July 3, 2018, that a new retroactive accreditation policy was coming, a week before Ms. Jones said she even knew Dream Center had a problem. “We just got off the phone with DOE,” Mr. Barton wrote. “It appears HLC is in sync with retro” accreditation. He said Ms. Jones — whom he directly cited by name — had worked with accreditors, and “they will all agree to one plan with department blessing.” Mr. Barton did not respond to requests for comment on his emails. On July 11, Dream Center’s chief operating officer told faculty in a meeting on an Illinois campus that the department would allow the schools’ accreditor to grant retroactive accreditation. He said department officials “changed their regulation to open the door to letting it happen,” according to a recording of the meeting obtained by the committee. He referred to a conversation with Ms. Jones the week prior where “she said everybody was going to be accommodating.” Weeks later, on July 25, Ms. Jones finalized the plan allowing retroactive accreditation, which was a major win for Dream Center. While the schools were already slated for closure, retroactive accreditation would have shielded the company from legal action for making misleading statements about its accreditation status. Ms. Jones said she had begun to revise that guidance months earlier to allay longstanding concerns about the department’s policy stemming from a dispute involving an accreditor of a nursing program. The retroactive policy would have also allowed students to more easily transfer their credits if they were earned at an accredited institution. In response to Mr. Scott’s accusations, Ms. Jones said, in a written statement to The New York Times, “The retroactive accreditation policy — which had been under discussion long before I arrived at the department — decided not whether Dream Center would live or die, but whether or not students could transfer their credits for the hard work they had completed.” In August, after it became public that the two schools would close, Dream Center’s head of regulatory and government affairs wrote an email to other Dream Center officials reminding them that communication should be kept confidential because “Diane is really working behind the scenes to help guide us and keep the accreditors aligned.” Ms. Jones did not directly address the July 3 and July 11 communication from Dream Center officials, but acknowledged that she had worked with accreditors. She called the Dream Center accreditation issue a “messy and complex situation” and said the accreditor had sent mixed messages about the status of Dream Center’s schools. Ms. Jones had acknowledged to Congress that she had concerns about the organization’s capacity to manage its closures, and was in regular communication with a group of accreditors to devise a plan to allow Dream Center students to complete their degrees, known as a “teach-out,” after their campuses closed. “My goal was to get as many of the more than 8,000 students to new institutions where they could complete their programs,” she said. “I stand firm in my decision to work collaboratively with accreditors to hold Dream Center accountable. That Dream Center executives characterize this as being about them is disingenuous but not surprising. They were trying to make it appear they had control of the mess they had made.” A group of students, represented by the National Student Legal Defense Network, filed a lawsuit last year, saying Dream Center issued “false and misleading” statements about its accreditation status, which broke state laws and caused “substantial harm” to more than 1,000 students. Mr. Scott also pointed to emails documenting the steps the Education Department took to help Dream Center get hold of some much-needed cash to prop up its failing campuses. In an October 2018 email, Dream Center officials were preparing to request funding from an escrow account managed by the department. The funds were intended to offset taxpayer liabilities if some of the chain’s schools closed or failed. Dream Center wanted to use part of the money to pay for expenses associated with closing campuses and helping current students complete their degrees. The department had in August agreed to release up to $50 million; Dream Center wanted more. Dennis Cariello, a Dream Center lawyer, sent an email to company executives before a meeting with A. Wayne Johnson, who headed the department’s office of financial aid. At the meeting, Mr. Cariello planned to deliver a “list of the asks” that amounted to $75 million. Mr. Cariello communicated that Mr. Johnson “asked that I review the draw requests — there are a few we can’t have in there — bonuses and future rental payments were issues for him.” Mr. Cariello declined to comment on the exchange. The department had released a total of $40 million from the escrow account to Dream Center by the end of last year, according to records it sent in response to questions from Congress. Education Department officials have maintained that they worked tirelessly to mitigate the fallout of the Dream Center collapse. The department restricted the schools’ cash flow from federal student loans after Dream Center went into receivership in January, barely a month before it cut off federal student loan funds to Argosy University. That final move was considered the death knell for the company. But until then, Dream Center executives had reason to believe they had friends at the Education Department. In January 2018, just as Dream Center’s schools lost their accreditation, Ronald L. Holt, a regulatory lawyer on the Dream Center team, sent a presentation to Dream Center executives on the state of higher education a year into the Trump administration. It included a song he wrote titled, “You’ve Got a Friend in Trump,” to the tune of Randy Newman’s “You’ve Got a Friend in Me,” used in the movie “Toy Story.”",
      "date": "July 23, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Thousands of California Students Lose Financial Aid in Regulatory Fight",
      "url": "https://www.nytimes.com/2019/07/26/us/politics/california-financial-aid.html?searchResultPosition=7",
      "subtitle": "null",
      "author": "Erica L. Green",
      "content": " WASHINGTON — Tens of thousands of students in California enrolled in online classes at out-of-state colleges abruptly lost federal financial aid this week after they found themselves in the cross-fire of a regulatory fight between Education Secretary Betsy DeVos and the nation’s largest teachers’ union. The students who lost their aid are the unlikely victims of an effort by the union, the National Education Association, to stop Ms. DeVos from delaying a rule written by the Obama administration to bolster consumer protections for students taking online courses at schools not based in their states. Ms. DeVos had warned that states were not ready to enforce the rules, and the teachers rebuffed those concerns. A judge sided with the union, leaving the students without aid. “We tried to delay the implementation of the 2016 rule because of its many flaws — including this consequence for California students,” said Liz Hill, a spokeswoman for the department. “Unfortunately, the N.E.A. filed a lawsuit, and a judge ruled that we have to implement the rule.” The union accused the department of a vindictive maneuver to punish its members, regardless of the costs to students. “The Department of Education’s determination to harm students, either through its incompetence or vindictiveness, is unacceptable,” Lily Eskelsen García, the president of the National Education Association, said in a statement. “We remain willing to help the department implement the protections in a way that does not jeopardize critical loans and Pell grants for students.” The 2016 regulations, issued in the waning days of the Obama administration, sought to ensure that students taking such courses would not be left saddled with debt but gave no assurance that the courses would provide employment in the states in which they reside. The rules, part of a series of measures to challenge predatory for-profit colleges, also required schools to disclose whether their online programs were under investigation by the state attorney general or a college accreditor, and to set up a complaint system for students enrolled in out-of-state institutions. Ms. DeVos, acting on the concerns of higher education institutions, sought the delay, citing “widespread concern and confusion in the higher education community.” The groups who had appealed to her for more time specifically warned of California’s vulnerability because it had not set up a complaint system. But the teachers’ unions did not buy it. They feared a delay would leave California teachers seeking online educational credits vulnerable to predatory attacks with no guarantee that their online programs would meet state standards for teacher certification. In August 2018, the National Education Association and the California Teachers Association sued Ms. DeVos, saying the department had not followed the proper administrative procedures in delaying the rules. They won. In April,  a Federal District Court judge in California ordered that the Obama rule go into effect. On Monday, the Education Department published a notification announcing that California was out of compliance with the rule and suspended financial aid to about 80,000 students in the state who were enrolled in “distance learning” classes. And while the Obama-era rule was aimed at for-profit colleges that specialize in online offerings, the California students affected all attend private and public nonprofit institutions that are widely regarded as high-quality leaders in online learning, such as Arizona State and Western Governors universities. California students enrolled in online courses at for-profit colleges are covered by a state law. California officials indicated that the financial aid suspension could be short-lived. Russ Heimerich, a spokesman for the California Business, Consumer Services and Housing Agency, said that the agency had set up a complaint system that would meet the department’s requirements. It will go live on Monday. Not leaving that to chance, the American Council on Education, an association representing more than 1,700 college presidents, sent a letter to the department on Thursday pressing for emergency action. Noting the imminent start of the academic school year, the organization said that its members were scrambling to help students who were already enrolled in classes, and had suddenly lost access to Pell grants and federal student loans. “In short, the likely outcome will be that thousands of students are either forced to drop out of, or never begin, postsecondary education,” the group wrote. “We have already heard from several institutions that will do whatever they can to address any gaps in student funding that occur as a result, but this is at best a temporary solution.” The American Council on Education was among those that first wrote to the department warning that the Obama-era rule could affect states, including California, that were not in full compliance. In anticipation of the rule’s 2018 start date, every other state moved to create a complaint process or enter into multistate reciprocity agreements that would bring them into compliance with the rule. California did not. “This is a debate about obscure regulations, but one with immediate, real world consequences,” said Terry W. Hartle, a senior vice president of the council. “The irony is that a lawsuit that was intended to protect students has had the unanticipated effect of taking money away from 80,000 students without any warning.”",
      "date": "July 26, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "L.G.B.T.Q. Rights Cases Stall Under DeVos, Report Finds",
      "url": "https://www.nytimes.com/2019/07/29/us/politics/gay-transgender-rights-devos.html?searchResultPosition=6",
      "subtitle": "null",
      "author": "Erica L. Green",
      "content": " WASHINGTON — Students who said they were discriminated against because of their sexual orientation or gender identity were significantly less likely to get any relief from the Education Department’s Office for Civil Rights under the Trump administration than they were under the Obama administration, according to a report released Monday. The report, released by the liberal Center for American Progress and based on the Education Department’s own data, provided the first analysis of how students who identify as lesbian, gay, bisexual, transgender or queer have fared in the first half of the Trump administration. The administration has reshaped policy to exclude civil rights protections for transgender people in most areas of government and has scaled back legal protections for gay people. The report found that the Trump administration was less likely to investigate claims of discrimination filed by the students — and more likely to dismiss them. The percentage of complaints that resulted in a school being required to take action to remedy the discrimination under the current administration was nine times lower than under the Obama administration, it concluded. In 2017, just weeks after the new administration took office, the Education and Justice Departments rescinded an Obama-era guidance document that informed schools that denying students access to bathrooms that correspond with their gender identity was a violation under Title IX, the federal law that prohibits sex discrimination in institutions that receive federal funding. The Trump administration believed, as many conservatives had long argued, that the Obama administration’s guidance amounted to overreach and was inconsistent with federal law. The Education Department has adopted the administration’s position, issued in a  memo by the Justice Department, that gender identity is not covered under federal civil rights laws. But Betsy DeVos, the education secretary, who reportedly protested the swiftness of the document’s revocation, has said that while the department would no longer investigate bathroom complaints, it would still enforce protections for L.G.B.T.Q. students who were bullied, penalized or harassed for failing to conform to sex-based stereotypes. That is not happening, the Center for American Progress said. “These data really show that Betsy DeVos is not doing her job,” said Frank J. Bewkes, one of the report’s authors. “Her office just doesn’t seem to care about enforcing civil rights for these students.” Education Department officials released data this month that showed that students who have filed civil rights complaints under Ms. DeVos’s leadership were “served more efficiently and effectively than students who filed civil rights complaints during the previous administration.” The agency boasted that it has resolved, on average, nearly double the number of civil rights complaints per year compared with the prior eight fiscal years, and it noted a 60 percent increase in the number of complaint resolutions that required schools to make changes to protect students’ civil rights. The department said that its own analysis of the complaint data for L.G.B.T.Q. students showed the same trend. “These data were selectively compiled by a left-wing interest group to tell an ideological story,” said Liz Hill, a spokeswoman for the department. “No one should mistake this as unbiased. This department vigorously protects the civil rights of all students and will continue to do so to the fullest extent of the law.” The data obtained by the Center for American Progress, which has served as a research center for Democratic interests, reflected complaints filed by students from March 2010 to May 2018 and cases resolved by the Office for Civil Rights from November 2010 to June 2018. The organization examined complaints of discrimination based on gender identity, sexual orientation and sexual orientation-related sex stereotyping under Title IX, and determined how the complaints were handled using resolution codes used by the Education Department. An overwhelming number of complaints, 75.9 percent, alleged sexual or gender harassment, and transgender students were overrepresented in the filings. The Office for Civil Rights was at least 54 percent more likely to investigate a sexual orientation and gender identity complaint under the Obama administration than it was under the Trump administration, according to the report. When complaints were investigated, 91.5 percent were dismissed or closed with no finding of wrongdoing, compared with 65.4 percent under the Obama administration. Ultimately, the Obama administration resolved 22.4 percent of such cases with a change to policy or practice that the department believed would benefit the student, compared with 2.4 percent under the Trump administration, the group concluded. The Education Department said that its own analysis of the complaint categories showed that it was averaging more resolutions requiring schools to make a change than the previous administration — emphasizing the complaints acted on, not the complaints that went unanswered. It said the current administration averages 11 resolutions that required a change each year, compared with nine averaged under the Obama administration. In fiscal year 2018, the agency obtained more resolutions with change in these categories than the previous administration had achieved in any one year. Department officials acknowledged that the previous administration fared better when looking broadly at how all cases were resolved — which is what the Center for American Progress did — but noted that the previous administration’s numbers appear better because it resolved fewer cases. “A parent wants to know, if their child’s civil rights are being violated, will O.C.R. provide for a change,” Ms. Hill said, referring to the department’s Office for Civil Rights. “Under this administration, it is more likely that it will. The numbers speak for themselves if assessed objectively.” But critics say the department’s metric for success ignores a large volume of students. “If you’re just rushing through complaints, it’s not surprising that you would resolve a large volume,” said Shabab Ahmed Mirza, an author of the center’s report. “What we’ve found is that more students are having cases resolved and not seeing justice. They’re not talking about students who see no change at all.” Ms. Mirza said that one finding in particular undercut the department’s claim that the Obama administration’s civil rights office was pushing a political agenda. Of the complaints that were investigated, the Obama administration was twice as likely to find after an investigation that a school had not violated students’ rights. Catherine E. Lhamon, who led the Office for Civil Rights under the Obama administration and issued the transgender guidance, said that was because her administration was “investigating the facts where they lead, and calling balls and strikes as they were.” “To receive the signoff that you have not harmed children, it’s a very significant resolution and it means a lot,” Ms. Lhamon said. “What the Trump administration is doing is not even examining whether anyone’s been harmed. There’s a benefit to examining whether a student has been discriminated against, even when the answer is no.”",
      "date": "July 29, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Trump Orders Student Loan Forgiveness for Disabled Veterans",
      "url": "https://www.nytimes.com/2019/08/21/us/trump-veterans-student-loans.html?searchResultPosition=5",
      "subtitle": "The directive came after 53 attorneys general criticized the federal Education Department for cumbersome eligibility rules for disabled veterans to eliminate their college loan debt.",
      "author": "Neil Vigdor",
      "content": " President Trump signed a measure on Wednesday that seeks to remove the bureaucratic barriers for permanently disabled veterans to qualify for student loan forgiveness, which he said would save 25,000 wounded warriors an average of $30,000. The rollout of the executive action came during the American Veterans national convention in Louisville, Ky., where Mr. Trump was joined onstage by Betsy DeVos, the education secretary, and the deputy secretary of the Department of Veterans Affairs, James Byrne. “I am proud to announce that I am taking executive action to ensure that our wounded warriors are not saddled with mountains of student debt,” Mr. Trump said. “They have made a sacrifice that’s so great. And they’re such incredible people. And they never complain. They never complain. That’s hundreds of millions of dollars in student debt held by our severely wounded warriors. It’s gone forever.” The savings projected by the Trump administration represents a small fraction of about $1.6 trillion in overall student loan debt in the United States, which has become a point of emphasis among many of the Democrats running for president. While 50,000 permanently disabled veterans in the country are eligible for relief under a decades-old debt forgiveness program, only half of them have qualified because of cumbersome requirements, according to the White House. The executive action signed by Mr. Trump directs the Education Department and the Department of Veterans Affairs to simplify the process to speed up applications. The president said disabled veterans would not have to pay federal income tax on the forgiven debt, and he called on all 50 states to provide the same relief. “So that’s really big stuff,” Mr. Trump said. Some of the administration’s critics, however, have said that Ms. DeVos has hindered the process. In  a letter sent to Ms. DeVos in May, the attorneys general for 53 states and territories said that the Education Department was not doing enough to help ease the burden of college debt for disabled veterans and that the Education Department was too hung up on the tax implications of forgiving student loan debt. “As a nation, we have a moral obligation to assist those who have put their lives on the line to defend us,” the group wrote. ",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "DeVos Toughens Rules for Student Borrowers Bilked by Colleges",
      "url": "https://www.nytimes.com/2019/08/30/business/betsy-devos-student-loan-forgiveness.html?searchResultPosition=4",
      "subtitle": "null",
      "author": "Stacy Cowley",
      "content": " Education Secretary Betsy DeVos on Friday significantly tightened Obama-era rules for student borrowers who say their schools defrauded them, imposing a deadline on claims and eliminating a requirement that the department automatically wipe away the loans of some students whose schools closed while they were enrolled. The new rules apply to federal student loans made from July 2020 onward. They will replace a set of policies, completed by the Obama administration in 2016, that Ms. DeVos had delayed carrying out until a court ordered her to do so last year. Under the new rules, borrowers seeking loan forgiveness will have much higher hurdles to clear. They will need to prove that their college made a deceptive statement “with knowledge of its false, misleading or deceptive nature or with reckless disregard for the truth,” and that they relied on the claim in deciding to enroll or stay at the school. They will also need to show that the deception harmed them financially. There is currently no time limit on submitting claims, but Ms. DeVos set a three-year deadline from the date that students graduate or leave their school. “We believe that within three years, the borrower will know whether or not there has been misrepresentation,” Diane Auer Jones, the Education Department’s principal deputy under secretary, said Friday on a call with reporters. The new rules also eliminate the “automatic closed school discharge,” a program that wipes away the loans of students whose school closed before they could complete their degree. Students who do not transfer their credits elsewhere can apply to have their loans erased, but many do not know about the option and never apply. The 2016 rules required the department to automatically eliminate their debts if the students did not enroll elsewhere within three years. That approach has contributed to the discharge of $222 million in loans owed by nearly 20,000 borrowers, according to Education Department data gathered by the National Student Legal Defense Network, an advocacy group. The new rules from Ms. DeVos will cut debt forgiveness for borrowers by around $500 million a year compared with the 2016 rules if they were in full effect, the Education Department said in its draft of the changes. The tightening of debt relief is the latest in a series of moves by the Trump administration to roll back Obama-era regulations aimed at for-profit colleges and universities. In June, Ms. DeVos officially repealed a rule that sought to crack down on for-profit colleges and universities that produced graduates with no meaningful job prospects and mountains of student debt they could not hope to repay. In 2018, the Education Department unwound a special unit detailed to investigate fraud in the for-profit sector. Senator Richard J. Durbin, Democrat of Illinois, called the latest changes “another Trump-DeVos giveaway to their for-profit college cronies at the expense of defrauded student borrowers.” Consumer advocates said they planned to challenge the new rules in court. Rolling back the 2016 rules will “encourage schools to break the law, engage in risky practices that lead to abrupt closures and harm students with impunity,” said Abby Shafroth, a lawyer with the National Consumer Law Center. For two years, Ms. DeVos has “refused to follow existing law and cancel the loans for these students, leaving them in debt they can’t get away from,” said Eileen Connor, legal director of the Project on Predatory Student Lending. “Now, she’s shredding a set of fair, common-sense rules that level the playing field between students and those who take advantage of them.” The federal government is the primary financier for Americans borrowing to attend college — it has made or backed more than $1.4 trillion in student loans to nearly 43 million people. Borrowers must repay their loans even if they drop out, are unhappy with their education or cannot find a job in the field they trained for. But the government contracts include one escape clause: Borrowers can seek to have their loans eliminated if they can demonstrate that their school defrauded them or broke certain laws. The clause, known as “borrower defense to repayment,” was little used for decades, until a wave of large, for-profit chain failures began in 2014, when Corinthian Colleges collapsed. Caught off guard by a deluge of claims, the Obama administration struggled to create a process for managing and adjudicating them. It eventually approved or set in motion approvals on nearly 48,000 claims, many of them in the last few weeks of President Barack Obama’s term, eliminating $600 million in borrower debt. But when Ms. DeVos took over, the process stalled. The department had nearly 180,000 pending claims as of March 30, and had not approved or denied any in more than a year. Those cases must still be evaluated under the rules in place when the loans were made. Many of the claims relate to false promises by for-profit schools about their graduates’ career prospects. In a coordinated crackdown, state attorneys general and Obama-era federal regulators brought a series of lawsuits against schools that saddled students with high debts for subpar educations. Several large chains, including Corinthian and ITT Educational Services, went under. The Obama administration granted full loan discharges to the borrower defense claims that it approved, but Ms. DeVos tried a new tactic, discharging only a portion of the debt owed by some Corinthian students. A federal judge in California blocked that approach last year, ruling that the department had violated privacy laws by improperly obtaining information from the Social Security Administration on individual applicants’ earnings. The department appealed the decision and is waiting for a court ruling before it addresses those borrowers’ claims, Ms. Jones said. “We are diligently working to see if there is a different methodology we could employ so we can resolve those claims,” she said. Some people, like Jessica Jacobson, have been waiting for more than four years for a decision on their claim. In June, she and six others asked the federal court in the Northern District of California to compel the Education Department to make decisions on their cases. Ms. Jacobson earned a bachelor’s degree from the New England Institute of Art, which she hoped would lead to a career in visual effects. She picked the school, she said, because it marketed its industry connections and state-of-the-art technology. But the equipment was scarce and obsolete, she said, and the school’s career support was limited to pointing students toward public job postings and giving them handouts like one titled “Tips for Applying to a Job From Craigslist.” After her graduation, Ms. Jacobson worked a succession of low-wage retail and restaurant jobs. The New England Institute of Art closed in 2017. The Massachusetts attorney general sued its former operators last year, accusing the school of predatory recruiting tactics and of deceiving students by misrepresenting its job placement rates. Ms. Jacobson sent her borrower defense claim to the Education Department in March 2015, seeking to have $25,000 in federal loans forgiven. While the claim has been pending, she has held off on several major life decisions, including a marriage proposal from her boyfriend. If the claim is denied, she said, she does not want him to be ensnared in her debt. “I’m in limbo,” she said. “I don’t know what the government is going to decide to do, and this debt is just hanging over my head. I feel trapped by it.”",
      "date": "Aug. 30, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Education Department Hits Michigan State With Record Fine Over Nassar Scandal",
      "url": "https://www.nytimes.com/2019/09/05/us/politics/michigan-state-larry-nassar.html?searchResultPosition=3",
      "subtitle": "null",
      "author": "Erica L. Green",
      "content": " WASHINGTON — Michigan State University agreed to pay a record $4.5 million federal fine and the university’s provost resigned on Thursday after the Education Department determined that the school failed to report and address claims of sexual abuse by a former team doctor, Lawrence G. Nassar, who was convicted of sex crimes. The fine was part of a settlement with the department, which initiated two investigations into the university’s handling of abuse by Mr. Nassar and the complicity of William Strampel, a former dean of the university’s College of Osteopathic Medicine. Mr. Nassar, a former doctor for the American women’s gymnastics team, was also an associate professor at the school. The investigations revealed what department officials called “systemic failure to protect students from sexual abuse” over decades, and the university is now obligated to make sweeping changes to its campus safety operations. “What transpired at Michigan State was abhorrent, inexcusable, and a total and complete failure to follow the law and protect students,” Education Secretary Betsy DeVos said in a statement. “Michigan State will now pay for its failures.” The president of Michigan State University, Samuel L. Stanley Jr., pledged immediate action. Among the first was accepting the resignation of June Youatt, the school’s provost, effective immediately. Mr. Stanley said in a statement that the findings of the department made it clear that the provost and the university’s former president failed to take appropriate action to address inappropriate behavior, specifically that of Mr. Strampel. Lou Anna K. Simon, who served as president during the years that Dr. Nassar abused girls and young women, resigned from the post last year and is facing state and federal charges. Mr. Strampel, who was also Mr. Nassar’s supervisor, is serving a year in jail for neglecting to address the abuse. Mr. Nassar was sentenced to 40 to 175 years  in prison for multiple sex crimes. “In my effort to build a safe and caring campus, we must have a culture of accountability,” said Mr. Stanley, who took his post on Aug. 1. Mr. Stanley also announced a newly formed oversight committee that will be responsible for ensuring that the university fulfills the requirements outlined in settlement agreements with the department. “The agreements with U.S. Department of Education further remind us that we failed survivors and our community,” he said. The fine, though dwarfed by the university’s $500 million civil settlement with sexually abused young women, was the largest ever levied under the Clery Act, a federal law that requires colleges to disclose campus crime statistics and issue prompt safety alerts. It far exceeded the $2.4 million penalty levied by the Obama administration  on Penn State University in the wake of the Jerry Sandusky scandal. John Manly, a lawyer for many of the 332 women who sued the university over abuse by Mr. Nassar, called the $4.5 million fine “incredibly insufficient.” “This week the U.S. government fined YouTube $170 million for improperly monitoring children’s web activity, and days later that same government fines a $20-plus-billion-dollar institution a mere $4.5 million for knowingly allowing a voracious sexual predator to molest 500-plus women and girls,” he said. “Sadly, it’s obvious that the political leadership of the Department of Education doesn’t give a damn about stopping this type of behavior at America’s colleges.” Others said that the department’s method of calculating Clery Act fines had always been opaque, so it seemed proper to judge this one by the historical context. “You have to put it in perspective with other Department of Education fines,” said Brett A. Sokolow, the president of the Association of Title IX Administrators, which polices sexual misconduct on campuses. “It’s the largest in history. So while it’s a relatively small number, it is in context the most egregious violation there’s ever been.” The department’s federal student aid office found a number of violations of the law, including a failure to properly record and report crime statistics, issue timely warnings to students and staff about episodes that posed threats, and a failure to notify campus security of complaints. “While the fine is important, of greatest importance to us is the long-term safety of every student,” said Mark A. Brown, the chief operating officer of the Education Department, who oversaw the student aid office. The Clery investigation, which began in January 2018, found that complaints against Mr. Nassar, including some dating back decades, were omitted from the university’s crime statistics. For example, in 1997, a 16-year-old, identified as “Survivor A,” made a report that should have been marked as a forcible sex offense under the Clery Act, but there was no record of it. The university also should have taken other measures required under the law, such as notifying students and staff members of Mr. Nassar’s continuing pattern of abuse, investigators said. In a settlement agreement with the department’s federal student aid office, the university said it would establish a Clery compliance officer position and a committee to oversee its compliance efforts and strengthen its reporting system. Department officials said they would “vigorously monitor” the university’s compliance through September 2024. Separately, Ms. DeVos had ordered the Education Department’s Office for Civil Rights to investigate whether the university met its obligations under Title IX, the federal civil rights law that requires schools to address sexual assaults on campus. The university had already been under government oversight as part of a  2015 resolution agreement resulting from a 2014 Title IX complaint. Over the 19-month civil rights investigation, the office reviewed hundreds of sexual assault reports, interviewed 47 witnesses and victims, and read tens of thousands of documents. That investigation found that university officials did not adequately respond to complaints against Mr. Nassar and Mr. Strampel, had subjected students to a sexually hostile environment, and had repeatedly failed to take appropriate and prompt action when notified of complaints. “Too many people in power knew about the behaviors and the complaints, and yet the predators continued on the payroll and abused even more students,” Ms. DeVos said. The civil rights investigation concluded that the university’s egregious Title IX violations were largely the result of university officials not taking complaints seriously. “The university’s inaction in response to so many complaints about the dean over so many years very likely perpetuated the belief expressed by many that they had no choice but to tolerate the dean’s behavior,” the report said, referring to Mr. Strampel. For instance, the report described numerous complaints referring to the dean’s “ongoing alleged sexually harassing.” A school provost hosted an informal meeting about a complaint against Mr. Strampel, but the only record of it was a “one-sentence email summary to the vice president for human resources, punctuated with a smiley-face emoji, a response which betrays her failure to appreciate the seriousness of the matter,” the report said. “For nearly 14 years the dean’s conduct continued unchecked — if not enabled — by the failure of administrators at the highest levels of the University to take appropriate actions to address it,” civil rights investigators said. In the resolution agreement, the civil rights office ordered the university to review the actions of current and former employees, who could still face disciplinary actions. The university is also required to hire an independent consultant to conduct an assessment of its Title IX grievance procedures and completely overhaul them. It also requires that the school establish a process to extend remedies to Mr. Nassar’s victims, like counseling services, grade adjustments and tuition reimbursement. “While this agreement applies directly to only one specific university, we expect that this message should be heard loudly and clearly at all universities so that the tragedy at M.S.U. is not repeated elsewhere,” said Kenneth L. Marcus, assistant secretary for civil rights at the Education Department.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "U.S. Orders Duke and U.N.C. to Recast Tone in Mideast Studies",
      "url": "https://www.nytimes.com/2019/09/19/us/politics/anti-israel-bias-higher-education.html?searchResultPosition=2",
      "subtitle": "null",
      "author": "Erica L. Green",
      "content": " WASHINGTON — The Education Department has ordered Duke University and the University of North Carolina at Chapel Hill to remake the Middle East studies program run jointly by the two schools after concluding that it was offering students a biased curriculum that, among other complaints, did not present enough “positive” imagery of Judaism and Christianity in the region. In a rare instance of federal intervention in college course content, the department asserted that the universities’ Middle East program violated the standards of a federal program that awards funding to international studies and foreign language programs. The inquiry was part of a far-reaching investigation into the program by the department, which under Betsy DeVos, the education secretary, has become increasingly aggressive in going after perceived anti-Israel bias in higher education. That focus appears to reflect the views of an agency leadership that includes a civil rights chief, Kenneth L. Marcus, who has made a career of pro-Israel advocacy and has waged a yearslong campaign to delegitimize and defund Middle East studies programs that he has criticized as rife with anti-Israel bias. In this case, the department homed in on what officials saw as a program that focused on the region’s Muslim population at the expense of its religious minorities. In the North Carolina program’s outreach to elementary and secondary school students, the department said, there was “a considerable emphasis placed on the understanding the positive aspects of Islam, while there is an absolute absence of any similar focus on the positive aspects of Christianity, Judaism or any other religion or belief system in the Middle East.” Too few of the Duke-U.N.C. programs focused on “the historic discrimination faced by, and current circumstances of, religious minorities in the Middle East, including Christians, Jews, Baha’is, Yazidis, Kurds, Druze and others,” the department said. With its actions, the department entered the debate over Israel and Palestinians that has roiled campuses around the country. The department’s action “should be a wake-up call,” said Miriam Elman, an associate professor at Syracuse University and the executive director of the Academic Engagement Network, which opposes the boycott-Israel movement that has animated campus activism across the country. She added, “What they’re saying is, ‘If you want to be biased and show an unbalanced view of the Middle East, you can do that, but you’re not going to get federal and taxpayer money.’” Palestinian rights groups accused the Education Department of intimidation and infringing on academic freedom. “They really want to send the message that if you want to criticize Israel, then the federal government is going to look very closely at your entire program and micromanage it to death,” said Zoha Khalili, a staff lawyer at Palestine Legal, one such group. The department’s intervention, she added, “sends a message to Middle Eastern studies programs that their continued existence depends on their willingness to toe the government line on Israel.” In a letter to university officials, the assistant secretary for postsecondary education, Robert King, wrote that programs run by the Duke-U.N.C. Consortium for Middle East Studies appeared to be misaligned with the federal grant they had received. Title VI of the Higher Education Act awards funding to colleges “establishing, strengthening and operating a diverse network of undergraduate foreign language and area or international studies centers and programs.” The Education Department “believes” the Middle Eastern studies consortium “has failed to carefully distinguish between activities lawfully funded under Title VI and other activities” that are “plainly unqualified for taxpayer support,” Mr. King wrote. The letter, published this week in the Federal Register, said that the consortium’s records on the number of students it had enrolled in foreign language studies — a cornerstone of the federal grant program — were unclear, and that “it seems clear foreign language instruction and area studies advancing the security and economic stability of the United States have taken ‘a back seat’ to other priorities.” Mr. King wrote that the department believed other offerings, like a conference focused on “love and desire in modern Iran” and another focused on Middle East film criticism, “have little or no relevance to Title VI.” The department wrote the consortium’s programming also “appears to lack balance.” The department also criticized the consortium’s teacher training programs for focusing on issues like “unconscious bias, serving L.G.B.T.I.Q. youth in schools, culture and the media, diverse books for the classroom and more.” They said that it had a “startling lack of focus on geography, geopolitical issues, history and language.” The administration ordered the consortium to submit a revised schedule of events it planned to support and a full list of the courses it offers and the professors working in its Middle East studies program. The department also directed the consortium to demonstrate that it had “effective institutional controls” to stay compliant with the administration’s interpretation of the Higher Education Act. The universities were given until Sept. 22, only days before the department is scheduled to approve funding on Sept. 30. A spokesman for Duke declined to comment, referring questions to the University of North Carolina. A spokeswoman for the U.N.C. acknowledged receipt of the letter. “The consortium deeply values its partnership with the Department of Education and has always been strongly committed to complying with the purposes and requirements of the Title VI program,” the university said in a statement. “In keeping with the spirit of this partnership, the consortium is committed to working with the department to provide more information about its programs.” To advocacy groups enmeshed in academic battles over Israel, the new investigation was not surprising. Last year, the department reopened a case into anti-Jewish bias at Rutgers University that the Obama administration had closed with no finding of wrongdoing. In reconsidering the case, Mr. Marcus said the Education Department would be using a State Department definition of anti-Semitism that, among other things, labels “denying the Jewish people their right to self-determination” anti-Jewish bigotry, suggesting that it had been adopted by his office. The Education Department has not adopted that definition. In June, Ms. DeVos said she had ordered an investigation into whether the Duke-U.N.C. consortium had misused any of the $235,000 it received in Title VI grants, including to sponsor an event in March called “Conflict Over Gaza: People, Politics and Possibilities.” Representative George Holding, Republican of North Carolina, had requested that Ms. DeVos investigate whether federal funding was used to host the conference, which constituents had said was rife with “radical anti-Israel bias.” Mr. Holding said the conference featured active members of the Boycott, Divestment and Sanctions movement against Israel — known as B.D.S. — and featured panelists who “distorted facts and misrepresented the complex situation in Gaza.” He said a video shown at the conference featured a performer who sang a “brazenly anti-Semitic song.” But some groups came to the defense of the Middle East studies consortium. Tallie Ben Daniel, the research and education manager at Jewish Voice for Peace, a liberal group that advocates Palestinian rights, said the investigation was the latest attempt by the Trump administration “to enforce a neoconservative agenda onto spaces of academic inquiry and exploration.” She called the consortium’s curriculum “rich and diverse.” To critics like Ms. Daniel, the targeting of the U.N.C.-Duke program appeared to be a continuation of efforts that predated the Trump administration. A group founded by Mr. Marcus, the Louis D. Brandeis Center for Human Rights Under Law, has pressed Education Department and Congress for years to crack down on Middle East studies programs that the center claimed promoted an anti-Israel bias. But Ms. Elman, the professor at Syracuse, said the department’s scrutiny of the programs was long overdue. “To get Title VI, you really have to strive for viewpoint diversity,” she said. “This is what our students want. They don’t want to be indoctrinated. They want both sides. It’s possible to do that and still make people uncomfortable.” Before joining the Education Department, Mr. Marcus had aggressively lobbied for the Higher Education Act to crack down on Middle East studies programs, and criticized both the Education Department and Congress for failing to hold institutions accountable for violating the law’s “diverse perspectives” requirement. In 2014, he wrote an opinion article that assailed the Title VI program for “being used to support biased and academically worthless programming on college campuses,” leaving students and faculty with opposing views “ostracized and threatened.” “Aside from their intellectual vapidity,” Mr. Marcus wrote, “many of these programs poison the atmosphere on campus.” He called on the department to establish a complaint process that would prompt extensive reviews of entire programs like the one being undertaken into U.N.C. and Duke.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Making America Worse",
      "url": "https://www.nytimes.com/2019/10/12/opinion/sunday/making-america-worse.html?searchResultPosition=1",
      "subtitle": "As impeachment commands the spotlight, the Trump administration continues to gut the rule book to hurt millions.",
      "author": "The Editorial Board",
      "content": " On the campaign trail in 2015, Donald Trump said it was “disgusting” that a big corporation could escape taxation by using bookkeeping tricks to shift profits out of the United States. Now the Trump administration is thinking about making it easier to play those tricks. Bloomberg reported this week that the Treasury Department, in a development sure to gladden the hearts of the corporate class, was considering a rollback of rules written by the Obama administration to prevent the very kinds of shenanigans Mr. Trump once condemned. While Congress focuses on the question of whether to impeach Mr. Trump, the potential change in tax policy is a reminder that the wheels of the government grind on — and that Mr. Trump’s administration continues to make decisions that are bad for most Americans. In recent months, the Agriculture Department has decided to reduce inspections at the slaughterhouses that process the nation’s pork; the Environmental Protection Agency has decided to let farmers and factories dump toxic chemicals into thousands of acres of previously protected wetlands; and the Labor Department has ruled that states can perform drug tests on applicants for unemployment benefits, allowing Texas, Mississippi and Wisconsin to begin efforts to curtail aid for people who need help. These changes in regulatory policy are part of a clear pattern. The Trump administration has worked assiduously to reduce federal protections for consumers, workers and the environment, making the United States a dirtier and more dangerous place in which to live. The Trump administration also continues to flout its obligation to comply with existing law. A federal judge said this week that the Education Department, under the leadership of Betsy DeVos, had committed 16,000 violations of a court order by improperly seeking to collect student loan payments, including docking paychecks and confiscating tax refunds. Magistrate Judge Sallie Kim of the United States District Court in San Francisco described the department’s behavior as “deeply disturbing,” adding, “I’m not sending anyone to jail yet, but it’s good to know I have that ability.” The Obama administration erased the debts of thousands of former students of Corinthian Colleges, a for-profit company that went out of business in 2015, under a policy that forgives the loans of students who are the victims of a fraud. Under Ms. DeVos, however, the department began to grant only partial debt relief to Corinthian students, prompting a lawsuit. Judge Kim ordered the government to suspend its collection efforts while the case winds through the courts. She said she was “astounded” by the failure to comply. Meanwhile, the department has finalized a new rule making it much harder for future student loan recipients to get relief from the government even if they are victims of fraud. The Trump administration’s regulatory policy can generally be summarized as marching to the orders of the businesses it regulates. Indeed, the administration has pushed so hard to reduce regulation that even companies have sometimes expressed reservations: Four major automobile manufacturers have refused to embrace Mr. Trump’s campaign to prevent California from reducing air pollution, instead striking a deal with California to meet stricter emissions standards. Mr. Trump also has an obsession with erasing rules written under President Barack Obama. The potential rewrite of the tax rules governing corporate profits is an example of both tendencies. Corporations dislike the Obama-era rules, which cracked down on the practice of sending profits to a foreign branch, lending the money back to the home office and then writing off the interest expense. Under the rules, the government can prevent companies from treating those transfers as loans, and thus from claiming the resulting tax benefits. Corporations argue that the current rule is broad, burdensome, and no longer necessary because the 2017 tax law limited the incentive for profit-shifting by reducing the tax rate on corporate income. But that overstates the effect of the law, which still leaves room for companies to hide profits in other jurisdictions. There is simply no good reason to weaken the Obama-era rule. The administration’s penchant for this kind of petty vandalism does not add one whit to the case for Mr. Trump’s impeachment. It is instead a reminder that if Mr. Trump does stand for re-election in 2020, Americans can improve their lives by voting for someone else.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    }
  ]
}