{
  "articles": [
    {
      "title": "Democratic Debate Preview: The ‘On Politics’ Guide",
      "url": "https://www.nytimes.com/2019/10/14/us/politics/october-democratic-debate.html?searchResultPosition=30",
      "subtitle": "There are bound to be some fireworks at the CNN/New York Times debate. Here’s what we’ll be watching Tuesday night.",
      "author": "Lisa Lerer",
      "content": " Sign up here to get On Politics in your inbox. Tonight, I’m writing to you from Columbus, Ohio, where The New York Times has descended in force for the biggest presidential primary debate in history. This one is particularly exciting for those of us at the paper, since The Times is co-hosting the debate with CNN and our own Marc Lacey will be one of the moderators. More on that in a minute. Tonight is also an exciting milestone for this little newsletter. Starting this week, we’ll be appearing in your inbox five evenings a week. We have tons of exciting things ahead — impeachment and primaries and a general election, oh my! Sign up, forward us to your friends and get them to sign up, and as always, thanks for reading. Now, back to the debate. Tuesday night’s event comes at a truly extraordinary moment in American politics. In Washington, the impeachment inquiry into President Trump is moving forward at a dizzying pace. Senator Bernie Sanders is out of the hospital, former Vice President Joe Biden is out of patience and Senator Elizabeth Warren seems out to get Facebook. With a dozen candidates stuffed onstage, there are bound to be some fireworks. Here’s some of what we’ll be watching: On Sunday, Mr. Biden’s son Hunter Biden said he would step down from his board position at a Chinese investment firm. On Monday, Mr. Biden released a government ethics plan. On Tuesday, Hunter Biden will do a major television interview. Seems as if Mr. Biden and his team want to make sure he has plenty to talk about Tuesday night when it comes to his family, ethics and Mr. Trump. The challenge for Mr. Biden will be whether he can leverage the fact that Mr. Trump now faces impeachment proceedings because of the president’s efforts to collect opposition research on him and his son, without getting stuck in a morass of questions about his own family. After being hospitalized for a heart attack, Mr. Sanders, 78, needs to convince voters that he is not too old to be president. The debate signifies his return to the race: He has remained off the campaign trail since Oct. 1, when he had two stents inserted to clear a blocked artery after experiencing chest pains at a campaign event. Aides to Mr. Sanders rebuffed questions asked by my colleague Sydney Ember about whether he’d be able to stand so long on a stage, but they fully realize that his energy, vibrancy and ability will be under intense scrutiny from voters. Ms. Warren’s surge in the polls has finally reached the point where it has become problematic for Mr. Biden and Mr. Sanders. Both men have signaled that attacks could be coming, with Mr. Sanders drawing a pretty sharp contrast over the weekend. It’s likely that some of those attacks will focus on her health care plan: how she would pay for it, whether she would raise taxes on the middle class, whether she would end private insurance plans and how she would accommodate union health plans. Will Ms. Warren be ready with more polished answers than she has given in the past? Pete Buttigieg, the mayor of South Bend, Ind., has the most field offices in the early states (tied with Ms. Warren) and a generous campaign bank account (only Mr. Sanders has raised more among Democrats). What he lacks is actual traction in the polls. So far, most of his debate performances have been characterized by “West Wing”-style monologues. But there are signs he may pivot to a more aggressive tack Tuesday night in hopes of expanding his support. In recent weeks, he has nudged Ms. Warren and Mr. Sanders on health care and has been in something of a sniper fight with former Representative Beto O’Rourke of Texas. There have been plenty of signs that the two young guns in the race may be headed for a shootout at the Otterbein University Corral. The question is whether that will be enough for either to make a mark. Four candidates on the stage haven’t qualified for the next debate in November: the former housing secretary Julián Castro, Representative Tulsi Gabbard of Hawaii, Senator Amy Klobuchar of Minnesota and Mr. O’Rourke. Tuesday night is a now-or-never moment for them. Expect some fireworks — or at least an attempt to light a fuse. For Mr. Steyer, it’s his first time in a primary debate. He’s an actual billionaire standing onstage at a time when several candidates have built populist campaigns running against the billionaires. But he’s also one of the most progressive candidates in the field on issues like climate change and impeachment. As for Ms. Gabbard, her campaign has emerged as one of the biggest mysteries of the 2020 race. After threatening last week to boycott the debate, she is now planning to appear. She could attack the entire political class, the Democratic Party and the media. Or not! No one quite knows what to expect from either one of these iconoclastic competitors. Here’s our list of who has qualified for the stage. Check out our visual guide to the debate. You can also read the live chat we did today and listen to the preview conference call we did for subscribers. Tuesday, you can watch the CNN/New York Times debate with us. Join us on nytimes.com or the NYTimes app for the live video and our live chat starting at 7:30 p.m. Eastern time. (I’ll be moderating! The debate itself starts at 8.) And if you happen to be in the Columbus area Tuesday evening, I’ll be appearing with a panel of my New York Times colleagues to discuss what we expect to see at the debate. R.S.V.P. here. After the debate, on Wednesday, politics editor Patrick Healy, national political correspondent Jonathan Martin and politics reporter Katie Glueck will parse the standout moments. Dial in to ask your questions and discuss the takeaways from the night before. We want to hear from our readers. Have a question? We’ll try to answer it. Have a comment? We’re all ears. Email us at onpolitics@nytimes.com. Our National editor, Marc Lacey, has held a lot of the biggest jobs at The New York Times: White House correspondent, a foreign correspondent who has reported from dozens of countries and the editor of the weekend news report. Now, he is about to take on perhaps his highest-profile task yet — moderating the Democratic primary debate. We had some questions about that. Marc was kind enough to give us some answers. But, sadly, not the questions. So, a dozen candidates on the stage, a nonstop flood of Big Breaking News out of Washington. How do you prepare for this kind of debate, in this particularly extraordinary moment in American politics? There are a lot of candidates, no doubt about it. And so many critical issues to ask about. This debate could go on until the sun comes up. But we’ve had to cull the many things we could ask into one meaty debate in one evening. How important is it to ask about what’s happening with the administration versus what’s happening in Democratic policy circles? Put another way, what’s the balancing act between asking about President Trump and, say, health care policy? I can’t get into the questions. I’ve been sworn to secrecy. You’re a print guy about to enter a TV world. Is that nerve-racking? I’ve been in the hotel gym a couple of times a day to remain calm. I can already do more pull-ups than James Comey has set as his goal. How much do you take into account what happened at past debates when making your plan of attack for this one? I’ve watched every previous debate and every candidates’ forum from this election season. That’s hours and hours of preparation. I know you can’t tell us the questions. But, seriously, can you tell us the questions? Any hints, at least? There will be questions, many questions, and they will be substantive questions. Does that answer your question? Any pre-debate rituals? This is my very first debate, so I have no ritual. I’m open to suggestions. And I’m not certain yet how I will nourish myself immediately beforehand. There’s this great taco joint a couple of blocks from my hotel, though. Uh, don’t think we’re talking about quite the same Saints. Were you forwarded this newsletter? Subscribe here to get it delivered to your inbox. Thanks for reading. Politics is more than what goes on inside the White House. On Politics brings you the people, issues and ideas reshaping our world. Is there anything you think we’re missing? Anything you want to see more of? We’d love to hear from you. Email us at onpolitics@nytimes.com.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Warren Versus the Petty Plutocrats",
      "url": "https://www.nytimes.com/2019/09/30/opinion/elizabeth-warren-wealth-tax.html?searchResultPosition=29",
      "subtitle": "Why do they hate her? It’s mainly about their egos.",
      "author": "Paul Krugman",
      "content": " Remember when pundits used to argue that Elizabeth Warren wasn’t likable enough to be president? It was always a lazy take, with a strong element of sexism. And it looks ridiculous now, watching Warren on the campaign trail. Never mind whether she’s someone you’d like to have a beer with, she’s definitely someone thousands of people want to take selfies with. But there are some people who really, really dislike Warren: the ultrawealthy, especially on Wall Street. They dislike her so much that some longtime Democratic donors are reportedly considering throwing their backing behind Donald Trump, corruption, collusion and all, if Warren is the Democratic presidential nominee. And Warren’s success is a serious possibility, because Warren’s steady rise has made her a real contender, maybe even the front-runner: While she still trails Joe Biden a bit in the polls, betting markets currently give her a roughly 50 percent chance of securing the nomination. But why does Warren inspire a level of hatred and fear among the very wealthy that I don’t think we’ve seen directed at a presidential candidate since the days of Franklin Delano Roosevelt? On the surface, the answer may seem obvious. She is proposing policies, notably a tax on fortunes exceeding $50 million, that would make the extremely wealthy a bit less so. But delve into the question a bit more deeply, and Warren hatred becomes considerably more puzzling. For the only people who would be directly affected by her tax proposals are those who more or less literally have more money than they know what to do with. Having a million or two less wouldn’t crimp their lifestyles; most of them would barely notice the change. At the same time, even the very wealthy should be very afraid of the prospect of a Trump re-election. Any doubts you might have had about his authoritarian instincts should have been put to rest by his reaction to the possibility of impeachment: implicit death threats against whistle-blowers, warnings of civil war and claims that members of Congress investigating him are guilty of treason. And anyone imagining that great wealth would make them safe from an autocrat’s wrath should look at the list of Russian oligarchs who crossed Vladimir Putin — and are now ruined or dead. So what would make the very wealthy — even some Jewish billionaires, who should have a very good idea of the likely consequences of right-wing dominance — support Trump over someone like Warren? [For an even deeper look at what’s on Paul Krugman’s mind, sign up for his weekly newsletter.] There is, I’d argue, an important clue in the “Obama rage” that swept Wall Street circa 2010. Objectively, the Obama administration was very good to the financial industry, even though that industry had just led us into the worst economic crisis since the 1930s. Major financial players were bailed out on lenient terms, and while bankers were subjected to a long-overdue increase in regulation, the new regulations have proved fairly easy for reputable firms to deal with. Yet financial tycoons were furious with President Barack Obama because they felt disrespected. In truth, Obama’s rhetoric was very mild; all he ever did was suggest that some bankers had behaved badly, which no reasonable person could deny. But with great wealth comes great pettiness; Obama’s gentle rebukes provoked fury — and a huge swing in financial industry political contributions toward Republicans. The point is that many of the superrich aren’t satisfied with living like kings, which they will continue to do no matter who wins next year’s election. They also expect to be treated like kings, lionized as job creators and heroes of prosperity, and consider any criticism an unforgivable act of lèse-majesté. And for such people, the prospect of a Warren presidency is a nightmarish threat — not to their wallets, but to their egos. They can try to brush off someone like Bernie Sanders as a rabble-rouser. But when Warren criticizes malefactors of great wealth and proposes reining in their excesses, her evident policy sophistication — has any previous candidate managed to turn wonkiness into a form of charisma? — makes her critique much harder to dismiss. If Warren is the nominee, then, a significant number of tycoons will indeed go for Trump; better to put democracy at risk than to countenance a challenge to their imperial self-esteem. But will it matter? Maybe not. These days American presidential elections are so awash in money that both sides can count on having enough resources to saturate the airwaves. Indeed, over-the-top attacks from the wealthy can sometimes be a political plus. That was certainly the case for F.D.R., who reveled in his plutocratic opposition: “They are unanimous in their hate for me — and I welcome their hatred.” So far Warren seems to be following the same playbook, tweeting out articles about Wall Street’s hostility as if they were endorsements, which in a sense they are. It’s good to have the right enemies. I do worry, however, how Wall Streeters will take it if they go all out to defeat Warren and she wins anyway. Washington can bail out their balance sheets, but who can bail out their damaged psyches?",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Biden on Impeachment, L.G.B.T.Q. Forum: This Week in the 2020 Race",
      "url": "https://www.nytimes.com/2019/10/12/us/politics/joe-biden-impeachment-bernie-sanders.html?searchResultPosition=28",
      "subtitle": "Here are seven things that happened on the presidential campaign trail this week.",
      "author": "Maggie Astor",
      "content": "  Here’s our rundown of what happened in the Democratic primary this week, as the candidates gear up for Tuesday’s debate in Ohio. Former Vice President Joseph R. Biden Jr. explicitly endorsed impeachment on Wednesday, going beyond past statements in which he had called only for an impeachment inquiry if President Trump did not cooperate with Congress. “To preserve our Constitution, our democracy, our basic integrity, he should be impeached,” Mr. Biden told supporters in New Hampshire, as he accused Mr. Trump of having “betrayed this nation.” It’s been a whirlwind week for Senator Bernie Sanders of Vermont, who is recovering from a heart attack. In addition to the concerns the episode raised about his health, his campaign’s delay in disclosing the heart attack led to criticism about its transparency, which Mr. Sanders has forcefully rejected. Perhaps more consequentially, Mr. Sanders told reporters on Tuesday that he would be changing the “nature” of his campaign by doing fewer events. On Wednesday, he said he had misspoken. Senator Elizabeth Warren of Massachusetts often tells voters that after she became “visibly pregnant” at the end of her first year as a public-school teacher, the principal wished her luck and hired someone else to replace her. This week, a conservative news site and other outlets challenged her account, citing a 2007 interview with Ms. Warren and minutes from a school board meeting — and Ms. Warren pushed back in a unique way. Rather than just restating the truth of her account (though she has done that as well), she called on women to share their own stories of pregnancy discrimination, which remains widespread. CNN and the Human Rights Campaign hosted the latest subject-based forum of the presidential race on Thursday, focused on gay, lesbian, bisexual and transgender issues. Protesters interrupted the event at several points to call attention to the murders of black transgender women, and the candidates seemed to welcome the reminder. Before the event, Ms. Warren, Mayor Pete Buttigieg of South Bend, Ind., and Senator Kamala Harris of California released plans on L.G.B.T.Q. equality. All three said they would fight to pass the Equality Act and ban conversion therapy as president. This week brought a deluge of new policy proposals on issues ranging from foster care to judicial ethics. The fifth presidential debate will be held in Georgia on Wednesday, Nov. 20, and the hosts will be MSNBC and The Washington Post. As previously announced, candidates will need 165,000 donors and at least 3 percent support in four qualifying polls to make the stage. (An alternative polling option is 5 percent support in two early-state polls.) Eight candidates have met those criteria so far; the latest was Andrew Yang, who did so this past week. Ms. Warren had a crowd-pleasing comeback at the CNN town hall when asked how she would respond to a supporter who said, “Senator, I’m old-fashioned, and my faith teaches me that marriage is between one man and one woman.” Read more about the moment here.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Warren and Sanders, and Their Messages of Change, Dominate the Money Race",
      "url": "https://www.nytimes.com/2019/10/04/us/politics/elizabeth-warren-fundraising.html?searchResultPosition=27",
      "subtitle": "Elizabeth Warren raised nearly as much money as Bernie Sanders over the past three months. They have both shunned wealthy donors, yet they are way ahead of everyone else.",
      "author": "Thomas Kaplan",
      "content": " LOS ANGELES — With Senator Elizabeth Warren’s announcement on Friday that she raised $24.6 million in the past three months, the fund-raising picture for the leading Democratic presidential contenders has come into focus: Ms. Warren and Senator Bernie Sanders are in strong position to fund their campaigns over the long haul. Ms. Warren and Mr. Sanders, whose campaign announced raising $25.3 million in the third quarter, both brought in more money than they had in the previous quarter, while money totals were down for two of their top competitors, former Vice President Joseph R. Biden Jr. and Mayor Pete Buttigieg of South Bend, Ind. Ms. Warren’s total also offers further evidence of her steady rise to the top of the pack in the Democratic primary race, where she now rivals Mr. Biden as a leading contender for the nomination. And while Mr. Sanders trails both of them in recent polls, he has a loyal following that has supported him with millions of small donations this year, ensuring that he is well positioned for a primary season that could stretch through next spring. More broadly, the fund-raising totals show the collective enthusiasm in the party for progressive candidates pushing messages of sweeping change. And they demonstrate the undeniable power of online donors in the primary. Ms. Warren and Mr. Sanders have sworn off courting wealthy donors and holding elite fund-raising events, while Mr. Biden and Mr. Buttigieg — who raised $15.2 million and $19.1 million in the quarter, according to their campaigns — both pursue money from big donors. The fund-raising hauls by Mr. Sanders and Ms. Warren show that there is “strength and power to their ideas that they’re putting forward, and people are engaged,” said Karen Finney, a Democratic strategist who was a senior adviser for Hillary Clinton’s 2016 campaign. “I think for anybody else in the race, you have to pay attention to that — that there is energy around some of these big ideas that represent bigger changes,” she said. Mr. Biden’s total did little to bolster his status in the race. Already under siege from President Trump and no longer enjoying a clear lead over the rest of the field in national polls, Mr. Biden saw his fund-raising drop roughly 30 percent from the previous quarter. Mr. Sanders exceeded Mr. Biden’s total by about $10 million and Ms. Warren exceeded it by more than $9 million — an indicator of the gulf between Mr. Biden and his two progressive rivals in attracting grass-roots support. And for the second consecutive quarter, Mr. Biden, a two-term vice president who previously served in the Senate for 36 years, was bested by Mr. Buttigieg, the mayor of the fourth most populous city in the 17th most populous state. Ms. Warren’s campaign said on Friday that it had received 943,000 donations in the third quarter from 509,000 donors, and more than 300,000 of those donors gave to her presidential campaign for the first time. The average donation was $26, and Ms. Warren ended the quarter with $25.7 million in cash on hand, according to her campaign. “Please take a moment to be proud of the movement you’re helping build,” Roger Lau, Ms. Warren’s campaign manager, wrote in an email to supporters. “Close your eyes and picture Wall Street bankers scowling into their catered breakfast,” he suggested. Collecting small contributions from a vast group of donors comes with a huge long-term advantage: Those donors can keep giving again and again as the campaign goes on. That is not the case for wealthy donors writing $2,800 checks to candidates — the maximum an individual can give to a campaign for the primary race. Ms. Warren and Mr. Sanders “are breaking these old political models in which rich donors can capture and control political parties,” said Stephanie Taylor, a co-founder of the Progressive Change Campaign Committee, which is supporting Ms. Warren. “This is just a really revolutionary, seismic shift in American politics.” Beating Mr. Sanders’s total for the past three months would have given another jolt of momentum to Ms. Warren’s campaign. Instead, Mr. Sanders’s status as the top fund-raiser for the quarter provides a reminder of his sizable base of support, even as other indicators like polling are less favorable. In the long run, Mr. Sanders’s slight financial edge over Ms. Warren in the quarter is unlikely to make a major difference in the perceptions of their candidacies. Mr. Sanders entered the race having already established an enormous network of donors during his 2016 presidential campaign, and he raised slightly less in the third quarter of 2019 than he did during the same time period in 2015. “The biggest takeaway is that Warren is on a roll,” said Stephanie Cutter, a Democratic strategist and veteran of past presidential campaigns. “She’s got wind at her back. It’s evident in her polls, her fund-raising and the energy at her events.” Among other candidates who have disclosed their fund-raising for the third quarter, Senator Kamala Harris raised $11.6 million, Andrew Yang raised more than $10 million and Senator Cory Booker raised more than $6 million, according to their campaigns. Presidential candidates must report their fund-raising for the quarter, which covered July through September, to the Federal Election Commission by Oct. 15. Ms. Warren struggled with fund-raising at the beginning of her campaign, but those struggles ended up being short-lived. Her third-quarter haul is another validation of her strategy to rely on online donors to finance her campaign. That choice is central to her bid for the presidency, freeing up her schedule and creating a tidy contrast with some of her rivals: While other candidates gather with rich donors, Ms. Warren spends hours taking pictures with voters who wait in the “selfie line” at her town-hall-style events. “I made the decision early on I was not going to spend my time behind closed doors with corporate executives and bazillionaires,” Ms. Warren told the crowd at a town hall in Carson City, Nev., on Wednesday night. “I was going to spend my time here.” At a town hall in San Diego on Thursday night, she reached her latest selfie-related milestone: She has now taken pictures with an estimated 70,000 people since beginning her campaign. She made it to the end of the selfie line just before midnight.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Elizabeth Warren and Joe Biden Will Finally  Debate. Here’s What to Expect.",
      "url": "https://www.nytimes.com/2019/09/11/us/politics/joe-biden-elizabeth-warren-debate.html?searchResultPosition=26",
      "subtitle": "The two Democrats arrive at Thursday’s forum with contrasting styles and policies — tensions that will be laid bare as they appear onstage together for the first time.",
      "author": "Katie Glueck",
      "content": "  He tends to meander and misspeak. She once won a college debate scholarship. He is a relative centrist who is seen by Democrats in early polls as the strongest candidate against President Trump. She is a self-styled progressive fighter whose ability to appeal to the broad electorate in a general election still worries some voters and party officials. He rarely delves deep into policy on the campaign trail, preferring to discuss American values and the dangers of a second Trump administration. She gleefully ticks through her long list of detailed plans. In style, substance and strategies for winning the White House, former Vice President Joseph R. Biden Jr. and Senator Elizabeth Warren present two starkly different options for Democratic voters, and in many ways they embody competing theories about what the Democratic Party should stand for. Those tensions will be laid bare Thursday night in Houston, when the two candidates meet onstage at a debate for the first time in the presidential race. It’s a highly anticipated matchup between the early front-runner, Mr. Biden, and a liberal standard-bearer, Ms. Warren, who has steadily climbed in the polls to challenge him. Mr. Biden is eager to stress his experience. And his advisers and allies suggested in interviews that, whether obliquely or overtly, he is prepared to seize on one of Ms. Warren’s perceived strengths — her extensive and boldly progressive policy plans — and use that to accentuate his own record of liberal achievements despite the sometimes-challenging political realities in Washington. “You have to have plans, but you have to be able to execute those plans,” he said at a fund-raiser last week in Manhattan, a message he is expected to reiterate. Ms. Warren is unlikely to pursue the kind of personal, premeditated broadside that Senator Kamala Harris launched against Mr. Biden in the first debate. But she has emerged onstage as a skilled advocate for her message of “big, structural change” and has shown that she is capable of crisply defending her far-reaching proposals. “We start with a plan, and then we get out there and fight for it,” she told reporters in Austin, Tex., on Tuesday when she was asked about Mr. Biden’s focus on what progressive proposals are achievable. “To me, that’s what being president is all about. It’s about laying those plans out and showing the direction for this country, and then getting in the fight, leading the fight and bringing people along.” At Thursday’s debate, Ms. Warren will have another opportunity to stress the urgency of fixing what she views as an economic and political system that caters to the rich and powerful at the expense of working people. Mr. Biden, a Beltway veteran, is expected to preach pragmatism, with a focus on how to achieve Democratic priorities in a divided political moment. [Which Democrats are leading the 2020 presidential race this week?] One risk for Mr. Biden is that, while he connects well with voters in one-on-one interactions, he is prone to uneven and sometimes faltering performances onstage. And the debate arrives as he has faced scrutiny for a series of gaffes and misstatements. “Vice President Biden has not proven to be really great on his feet,” said Steve Drahozal, chairman of the Dubuque County Democratic Party in Iowa. “I know he does not think that his gaffes are a big deal, but he is going up against a very keen, intelligent, articulate candidate who is able to frame issues very well.” A strong night for Ms. Warren could further propel her already-accelerating campaign both nationally and especially in Iowa, the state that begins the presidential primary process, where Mr. Biden already faces challenges. “She’s been the one who’s been gaining the most,” Mr. Drahozal said. “With Biden being in the front-runner position, I don’t think he has a lot to gain. He has a lot to lose.” Mr. Biden’s team has no illusions about Ms. Warren’s skill as a debater and her rise in the polls, advisers and others close to the campaign acknowledge, though they insist that they are not focusing on her alone. Mr. Biden spent the first two debates facing intense criticism from his opponents, a reflection in part of his current standing atop the polls, and his campaign is bracing for more broadsides from all across the stage. Allies noted that Mr. Biden has survived rough debate performances before, with little lasting impact on his national poll numbers. That, they argue, is evidence of the deep-seated good will that Mr. Biden, President Barack Obama’s vice president, continues to enjoy from the Democratic base. [Sign up for our politics newsletter and join the conversation around the 2020 presidential race.] They also see several opportunities for him to draw contrasts that could work to his benefit. That list includes emphasizing his foreign policy credentials — as a former vice president and a former chairman of the Senate Foreign Relations Committee — amid several prominent foreign policy-related controversies involving the Trump administration. His team is convinced that the Democratic electorate is far more moderate than some activists suggest, and welcomes a debate over issues like health care — Mr. Biden supports a public option but opposes eliminating private insurance, something Ms. Warren supports under “Medicare for all” — and which social programs should be offered for free. And allies are eager to deepen an argument Mr. Biden has been previewing: that it is not enough to have ambitious plans if those proposals cannot survive the political realities of Washington. “Lots of other candidates have great plans, they have good policy papers, many of them have, you know, talked about them on college campuses or in the Senate,” said Senator Chris Coons, Democrat of Delaware. “The difference, I think, is that Joe has decades of actual experience getting things enacted in a bitterly divided and partisan Washington, and I think he can and should point to that.” Ms. Warren did not face significant scrutiny from other leading contenders in the first two debates. Mr. Biden’s allies are privately hopeful that she will be pressed on the details and practicalities of her proposals by several of the candidates onstage, as her formidable standing in the race now makes her a bigger target for attacks. Ms. Warren and Mr. Biden have clashed before, exchanging sharp words during a fight over the nation’s bankruptcy laws, which culminated in the passage of a bill in 2005 that Mr. Biden supported and Ms. Warren opposed. In April, in response to a reporter’s question on the day Mr. Biden entered the race, Ms. Warren took a swipe at him over the bankruptcy legislation they had disagreed about. But she has almost always refrained from overtly criticizing her rivals, and any kind of premeditated attack on Mr. Biden on the debate stage would be a significant departure from how Ms. Warren has approached the campaign so far. “Different candidates have different imperatives in the debates, and there are some candidates that need to throw wild punches in order to get attention,” said Adam Green, a founder of the Progressive Change Campaign Committee, which is backing Ms. Warren. “Fortunately, Elizabeth Warren is not in that camp.” Still, Mr. Green said, “Just because she doesn’t throw a punch doesn’t mean that she doesn’t strongly show a contrast.” Scott M. Stringer, the New York City comptroller, who endorsed Ms. Warren on Monday, said there was no need for Ms. Warren to confront Mr. Biden on the debate stage. “I think she has to challenge the Democratic Party and say, we can be incremental or we can be big and bold,” he said. “And if she can showcase big and bold, I don’t think she has to look at Joe Biden. I think she has to look directly into the camera and speak to the American people and Democrats.” Speaking to reporters on Saturday at the New Hampshire Democratic Party convention, Ms. Warren portrayed the debate as an opportunity to share her message with a large audience. She received a far more raucous reception at the convention than did Mr. Biden, who was the first presidential candidate to speak. But asked to compare her welcome to Mr. Biden’s, she did not engage. “All I can do is stand up and talk about why I’m running,” she said. “I’m not here to criticize any other Democrat or anyone else’s campaign.” Still, veteran Democrats caution that for all of the momentum she has enjoyed lately, Ms. Warren still has work to do in assuaging concerns about whether her unapologetically progressive candidacy would resonate in general election battlegrounds. “Elizabeth probably needs to show that she is ready to take on Middle America, the center of our country,” said Sylvia Larsen, the former New Hampshire Senate president, who also questioned whether Mr. Biden could excite younger voters. “Our primaries push people into a more left position and so to get back to a center — Joe already holds the center. And so, can Elizabeth Warren move back to the center if she’s our nominee?” Ms. Warren, for her part, has challenged the idea that a more moderate candidate is best positioned to win. At the convention Saturday, she told the crowd that “we can’t choose a candidate we don’t believe in because we’re scared.” And at a house party in New Hampshire on Labor Day, she cautioned against “nibbling around the edges” — without mentioning Mr. Biden by name. “I think what’s going to carry us as Democrats is not playing it safe,” she said.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Democrats Have a Politeness Problem",
      "url": "https://www.nytimes.com/2019/10/12/opinion/sunday/next-democratic-debate.html?searchResultPosition=25",
      "subtitle": "In this next debate, they should take the gloves off.",
      "author": "Frank Bruni",
      "content": " Twice near the start of the last Democratic presidential debate, George Stephanopoulos of ABC News tried to pin Elizabeth Warren down on whether her vision for Medicare for All would require a middle-class tax increase. Twice she didn’t answer him. It was the perfect opening for one of the other contenders for the Democratic presidential nomination to charge her with evasiveness and force her to reckon fully with the costs of her ambitious plans and the profound difficulty of enacting them. None of them took advantage of it. Warren condemned the corruption of the political process by moneyed interests. I kept waiting for one of her rivals onstage to point out that before she swore off private fund-raisers organized by rich donors, she depended on them for her two victorious Senate campaigns, raising enough cash to transfer $10.4 million in leftover funds to her 2020 presidential bid. But no one made a peep. As she surged toward the front of the pack, the candidates in her wake watched politely for the most part, not confronting her with the tough questions that, if she faces Donald Trump in the general election, he’ll surely hurl at her. That has to stop. At the debate this coming Tuesday night, they should grill her — and one another — with less delicacy than they have exhibited to date. Assuming that Trump lasts until November 2020, he’s going to use every potentially unflattering detail of his opponent that he can dig up, along with the usual heap of lies, to attack him or her. The nation can’t afford for those attacks to be successful. So now is the time, well before the voting in caucuses and primaries begins, to size up the various Democratic candidates’ hypocrisies, half-truths and vulnerabilities. Perhaps more important, it’s the time to discover how persuasively they can explain the parts of their biographies and records that cry out for some explanation. [Get a more personal take on politics, newsmakers and more with Frank Bruni’s exclusive commentary every week. Sign up for his newsletter.] I began this column by focusing on Warren because she seems to be the candidate with the most momentum at the moment and, based on the current state of play, she could very well be the nominee. But everyone in the relatively changeless Top 5 in the Democratic field — Warren, Joe Biden, Bernie Sanders, Kamala Harris and Pete Buttigieg — hasn’t been pressed by rivals on some matters that warrant more attention. Buttigieg has made an argument for his youth — he’s 37 — as an asset, and he boasts of crucial executive experience from his seven years as mayor of South Bend, Ind. But it’s a city so small that he won his second term with 8,515 votes. He’d probably need more than 65 million to ascend to the presidency. One of his rivals would be right to ask him: What should give Democrats confidence that he has that kind of jackpot in him? What gives him the confidence, especially given his strained relations with black residents of South Bend and the coolness of black voters nationwide to his candidacy? Someone should pin Harris down on why her initial statements about Medicare for All were so contradictory, just the way Tulsi Gabbard, in a July debate, challenged her on aspects of her work as the district attorney of San Francisco and then as the California attorney general that don’t fit neatly under the “progressive prosecutor” mantle that she claims. Gabbard’s engagement of Harris on that issue stood out because few candidates poked that directly and forcefully at their rivals’ vulnerabilities. Harris’s engagement of Biden, in a June debate, on the issue of federally mandated busing to desegregate schools stood out for the same reason. And it shed important light on both him and her. He struggled to respond effectively, demonstrating how dulled some of his political skills were, while she made subsequent comments that raised questions about just how divergent their positions really were. Democratic voters came to know both candidates better and to be able to assess them more accurately. And that’s the whole goal of these debates. “Other than Harris going after Biden and Gabbard going after Harris, they have been very timid,” said Bob Kerrey, the former senator and Nebraska governor who ran for the Democratic presidential nomination in 1992. Part of that, he said, is the impossibility of a deeply substantive debate among 10 people, which is how many were onstage for each of the June, July and September debates. The coming debate will have 12 people onstage. And timidity won’t do. “Trump will be well funded and ferocious,” Kerrey told me. “If a Democratic candidate wilts under the warm attention and criticism of another Democrat, they will not be able to stand up to Trump.” And if that criticism goes too far, bleeding into gratuitous nastiness, “the audience will discipline them,” he said. He mentioned Julián Castro’s obvious insinuation in the debate last month that Biden was in serious cognitive decline. That went too far. It was counterproductive, because it didn’t bring to light something about a candidate that wasn’t accessible to voters. That was true as well of Eric Swalwell’s “pass the torch” hectoring of Biden, in a June debate, as a politician who was overstaying his welcome. Voters know that Biden is 76 and has spent more than four decades of his life in public office. Swalwell wasn’t exposing some secret that had been swept under the rug; he was just stamping his feet. Many anxious, Trump-horrified Democrats take the view that the candidates should tread lightly on one another. “When we know that President Trump will be spending his money to discourage Democratic turnout more explicitly and underhandedly than in any other modern campaign, why would we want any candidate to spend time persuading Democrats of how bad other Democrats are?” asked Jack Markell, the former governor of Delaware. “The difference between all of the Democratic candidates is dwarfed by the difference between the Democratic candidates collectively and President Trump.” Many of the readers who write to me agree with him or go even further: They want to see, hear and revel in nothing but loving encomiums about Democrats vying for the White House. Some of them believe that Hillary Clinton was badly hurt by her battle with Sanders in the last Democratic primary, and that we’re where we are as a result. But her wounds would have mattered less if Sanders had rallied more enthusiastically to her side once she’d won the nomination. I urge the losers this time around to get in line pronto. And I think it’s extremely risky to spare the next nominee the sort of tough examination that will let us know if we’ve elevated the most broadly appealing, durable, fearsome Trump slayer. The stakes could hardly be higher. Every day, new revelations about the Ukraine sordidness come to light. Every day, the president acts in impulsive, imprudent, unhinged ways. Maybe that means that any Democrat can beat him. But I’m a bit of a pessimist and cautious to a fault. I think it means that we cannot afford to pick the wrong person. Everyone in that Top 5 has liabilities, as I wrote in my previous column. It’s possible that Democrats would be on safer ground with any of the candidates below that tier — Amy Klobuchar, say, or Michael Bennet or Steve Bullock — who have won statewide elections in red, purple or purple-ish places. It’s also possible that Klobuchar, Bennet and Bullock lack the requisite spark and are bad fits for the moment. The only way to know is to make sure there’s no premature coronation. So Biden’s rivals onstage on Tuesday night should ask if him if anything that he and President Barack Obama did, or failed to do, inadvertently paved the way for Trump. I’d be fascinated, and potentially illuminated, by his response. They should ask Warren how she can be sure that her morally just “wealth tax” will raise as much money and pay for as much as she says it will. And because she keeps stressing her passion for education, she should be pressed on how she swerved from past positions that essentially aligned her with Betsy DeVos to the opposite. If she can’t answer the question well, let’s find out now, before it’s too late. If she can, she’s one step closer to wiping the floor with Trump.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "null",
      "url": "https://www.nytimes.com/interactive/2019/10/11/us/politics/october-democratic-debate.html?searchResultPosition=24",
      "subtitle": "null",
      "author": "SHANE GOLDMACHER",
      "content": "  ",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Why Populist Democrats Have Gained the Upper Hand in the 2020 Race",
      "url": "https://www.nytimes.com/2019/10/11/us/politics/2020-democrats-primary-polls.html?searchResultPosition=23",
      "subtitle": "null",
      "author": "Alexander Burns",
      "content": " With a crucial debate looming next week in the Democratic presidential primary, the party’s populist wing appears increasingly in control of the race — rising in the polls, stocked with cash and with only a wounded leading candidate, Joseph R. Biden Jr., standing in its way. Several slow-building trends have converged to upend the race over the last few weeks: Senator Elizabeth Warren’s steady ascent in the polls has accelerated. Both she and Senator Bernie Sanders, a fellow progressive, have raised immense sums of money from small donors online, dominating the Democratic field and each collecting about $10 million more than Mr. Biden in the last quarter. And Mr. Biden’s numbers have gradually slipped in a way that has alarmed his supporters. The race is far from over: All three of the top candidates — Ms. Warren, Mr. Biden and Mr. Sanders — have a path to victory, and there is still time for longer-shot candidates to make a real run at the nomination. The CNN/New York Times debate in Ohio on Tuesday is likely to test Ms. Warren’s status as an emerging front-runner, subjecting her to new criticism from her fellow Democrats on matters ranging from health care policy to trade and the role of the government in overseeing the economy. Above all, she may need to allay lingering reservations about her appeal to swing voters in the general election. And Mr. Biden signaled on Thursday night that he will come into the debate fighting. “One of the problems I’m finding, I’ve got to be more aggressive,” he said at a fund-raiser in Los Angeles. He then used a roundabout example to explain that debate time restraints don’t allow time for lengthy answers. “When someone says, you know, you know, ‘Are you still beating your wife?’ And, and I go, ‘I have a long explanation,’ and they say, ‘You got 30 seconds to answer.’ And you say, ‘No. And then, wait a minute, what’d I just say? No, I’m not still beating my wife.’ But so, I’ve had, I’ve had some difficulties,” he said. If Tuesday’s debate could break in any number of directions, what may be resolved is the overall mood of Democratic primary voters, and whether they are more inclined to seek a politically cautious nominee who promises to restore normalcy in Washington, or a more confrontational standard-bearer with an ambitious and disruptive reform agenda. It is candidates in the latter category who now control the bulk of the financial might in the race, and are best positioned in most of the early primary states. Anna Greenberg, a Democratic pollster who is not aligned in the primary, said an “anti-establishment” current had plainly taken hold, with voters rewarding candidates for defying the conventional limits of political debate and “pushing boundaries in really productive ways.” She pointed not only to Ms. Warren and Mr. Sanders but also to former Representative Beto O’Rourke, who has embraced a new political identity for himself as a gun-control activist and a critic of his own party’s relatively cautious platform on the issue. “Across the board, whether it’s Beto talking about assault weapons or Warren and Sanders talking about Wall Street,” Ms. Greenberg said, “it does feel like there is a shift in the party that is kind of new.” Ms. Greenberg said there was still space for Mr. Biden to run a strong campaign because of the way voters perceive his values and character. Americans, she said, believe Mr. Biden “cares about people and working class people, regular people, and that’s not an insignificant asset.” Yet it has been Ms. Warren, rather than Mr. Biden, who has consistently gained strength. Campaigning on a message of purging corruption in Washington and restructuring the economy, Ms. Warren has closed Mr. Biden’s lead in the polls every week since the beginning of the summer and is now in a position to upset him in both Iowa and New Hampshire, the first two states to vote. Mr. Biden remains a strong contender for the nomination, largely because of the support he collects from African-American voters. But he has struggled for months to articulate a clear vision for the future and has relied heavily on Democratic nostalgia for the Obama administration. In recent weeks, he has been consumed in a grisly political clash with President Trump. So far, the support Mr. Biden has lost does not seem to have gone to another moderate, like Mayor Pete Buttigieg of South Bend, Ind. Only Ms. Warren has been moving up in the national polls, suggesting either that Mr. Biden’s lost supporters have defected to her camp or that they have become undecided altogether. If Ms. Warren has become the leading liberal standard-bearer, Mr. Sanders has been a steady third in national polls and his fund-raising power is likely to keep him among the most formidable competitors in the race. Yet his campaign has been grappling with the implications of Mr. Sanders’s heart attack in Las Vegas last week, a medical emergency that landed him in the hospital and has kept him off the trail for days. He has sent mixed signals about his path forward, first indicating that he would scale back his campaign schedule and then defiantly reversing that suggestion. It is unclear whether Mr. Sanders’s physical condition will affect his poll numbers: He has a solid base of support nationally and few other candidates believe his core followers will be easily dislodged. There is at least a new degree of uncertainty about whether he will be in a strong position to vie for liberal Democrats who have already been migrating toward Ms. Warren. Nearly all of the candidates feel pressure to do something in the Ohio debate to stop the race from becoming a contest entirely defined by a Warren-Biden rivalry, either by inflicting direct damage on Ms. Warren’s campaign or by outflanking her as an alternative to Mr. Biden. The ongoing impeachment inquiry targeting Mr. Trump has only added to the pressure on the Democratic field, since the tumult in Washington is likely to leave voters with even less time to devote to reviewing underdog options. Mr. Buttigieg in particular has been moving assertively in recent weeks to position himself as a center-left alternative to both Mr. Biden and Ms. Warren, using his considerable war chest to run television ads in Iowa. Several other candidates of different ideological stripes are counting on Iowa for a breakthrough, including Senators Kamala Harris, Cory Booker and Amy Klobuchar. A wild-card joining them onstage will be a new contender, Tom Steyer, a former hedge fund investor who has spent lavishly from his personal fortune to brand himself as a reform-minded outsider. For Ms. Warren, meanwhile, the debate may help reveal whether she can consolidate her gains across the Democratic Party. On Wednesday, she campaigned in South Carolina, where she has so far struggled to gain traction with the African-American voters who largely decide the primary there. To cement her status as a front-runner, she may have to win over a range of constituencies torn between their interest in her ideas and a more cautious political calculus that draws them to Mr. Biden. One of those voters is Ohio’s former governor, Ted Strickland, the only Democrat to hold that office this century. Like many Democratic voters, Mr. Strickland, a populist with close ties to organized labor, said he saw Mr. Biden as the safer bet for the general election but found it hard to resist the appeal of Ms. Warren’s proposals, most of all her plan for a new tax on vast private fortunes. “I think there may be something to the electability issue for Mr. Biden, in Ohio,” Mr. Strickland said. “But if I could just choose to put someone in the presidency — if that was my choice alone — it would be hard for me to pass up Elizabeth Warren.” Mr. Strickland said he had spoken with Mr. Biden recently and saw him as a seasoned diplomat and a reliable “economic progressive.” But Ms. Warren, he said, was gradually easing voters’ reservations about her ability to go up against Mr. Trump by talking about policy issues “in ways that are easily understood.” Mr. Biden remains a clear favorite in just one of the early states, South Carolina, and his advisers have predicted that he would fare better in larger, more diverse states that vote later in the calendar. He is counting, in particular, on older and more moderate African-American voters to hold back the party from stampeding toward a more ideological liberal candidate. In 2016, black and Latino voters helped Hillary Clinton withstand a persistent primary challenge from Mr. Sanders. Yet scattered polling in the later states has largely followed the national trend: Last week, for instance, the Public Policy Institute of California released a poll finding a statistical three-way tie in the nation’s most populous state between Mr. Biden, Ms. Warren and Mr. Sanders. Mark Baldassare, president of the institute, said there was no indication in his poll that the state’s diversity would represent a stumbling block for candidates on the left, as Mr. Biden is hoping. The primary debates would be crucial to determining Ms. Warren’s continued momentum, he said, because voters seemed to be using them for insight into the general election. “It has become kind of a proxy for: How are these candidates going to do when they stand up next to Trump?” Mr. Baldassare said. “I think this will be Elizabeth Warren’s moment now, because if she is in the mix for front-runner, people are going to be testing her and seeing: How does she do? How does she do when she has to be on defense?”",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "The Democrats Worth Staying Up Past Bedtime For",
      "url": "https://www.nytimes.com/2019/10/11/us/politics/2020-candidates-children.html?searchResultPosition=22",
      "subtitle": "For the way-too-young-to-vote crowd, 2020 events are still a draw.",
      "author": "Reid J. Epstein",
      "content": " IOWA CITY — Oliver Hanlon was beaming ear-to-ear as he stood next to Senator Elizabeth Warren of Massachusetts on a riverside stage at the University of Iowa. “I met the president,” he shouted, bounding down the steps two at a time. His mother gently corrected him: “Not yet,” she said, while the Warren photo line snaked on behind her. Oliver couldn’t be faulted for his civics proficiency; he’s 7 years old. The 2020 Democratic presidential campaign stops are crawling with children, some of whom spend most of the stump speeches crawling away from their parents. While all of the candidates seek to portray a family-friendly image, it takes work to bring a youngster to a campaign event: They often start late and run well into the evening, with a policy discussion not exactly accessible on the elementary-school level; bigger rallies often take place outdoors, regardless of weather. Kissing babies and tousling children’s hair has long been a staple of retail campaigning, but in 2020 it is about more than a photo op, even the cutest of photo ops. In a historically crowded field, in an era of uncertain polling, these campaign stops are something of a past-their-bedtimes straw poll, revealing which candidates young parents deem viable or famous enough to risk a tantrum or a sleep-deprived meltdown over the next morning. For now, the leaders appear to be Ms. Warren and former Vice President Joseph R. Biden Jr., who have both taken steps to cater to the children and parents who come see them. It’s one more subtle measure of their stature in a race that is steadily narrowing from the largest primary field in history to just a handful of viable contenders. Ms. Warren and Mr. Biden, whose staffs both go to great lengths to present their events as family friendly, are currently atop the Democratic polls, which might explain the pep talk parents often give their children before meeting the two candidates: You are talking to the next president. Ms. Warren lets families with children cut to the front of her selfie line, a strong incentive given that supporters often wait hours for a 20-second interaction and photograph. Mr. Biden’s campaign stops over the summer and fall have often come with free ice cream — and if frozen dairy products are not available, he’s been known to hand out cash with instructions for children to tell their parents to stop for a treat on the way home. During a Labor Day swing through Iowa, Mr. Biden worked a chocolate-and-vanilla swirl machine at one union picnic and handed out ice cream sandwiches at another. Last month in Iowa City, Clara Engler, 5, spent hours before an evening Warren rally at the University of Iowa practicing the “pinkie promise” that has become a staple for young girls at Ms. Warren’s events. With her mother, Brooke Engler, an Iowa City cosmetologist, Clara worked on locking fingers briefly and looking up, so she could hear Ms. Warren tell her that running for president is “what girls do.” When the moment came, about a half-hour after Clara’s bedtime, Ms. Warren got down on one knee, looked her in the eye and made the promise. Clara jumped up with glee. Her mother beamed. “She’d seen it before on TV,” Ms. Engler said. “It’s nice that I can have my child sit back and watch politics without worrying about what will be said.” The others in the 19-candidate Democratic field aren’t overtly inhospitable to children, but former Representative Beto O’Rourke of Texas peppers his stump speech with profanity and Senator Bernie Sanders of Vermont isn’t a fuzzy figure while delivering his policy-heavy stemwinders. In early September he scolded a crying baby to “keep it down” during a campaign stop in New Hampshire. Mayor Pete Buttigieg of South Bend, Ind., whose most fervent supporters tend to be young enough not to have children of their own, often attracts older kids — particularly L.G.B.T. teens inspired by the first openly gay major candidate for president. “When you know that there’s something historic about your campaign, you feel a level of responsibility that goes with that,” Mr. Buttigieg said aboard his Iowa campaign bus last month. “It certainly adds a level of motivation when people come up to you, sometimes with tears in their eyes, just letting you know what the fact of your campaign means to them.” Even in Iowa, where rare is the weekend without a presidential hopeful stumping nearby, it takes a serious commitment and coordination to attend a campaign event with young children. “If she starts crying we’ll run out quickly,” Elizabeth Batey, a lawyer from Waverly, Iowa, said of her 2-year-old daughter, Hattie, while waiting for Mr. Buttigieg last month in a stuffy storefront in Iowa Falls. Ms. Batey, whose 4-month-old son, George, was asleep in his car seat, made it through Mr. Buttigieg’s event without having to flee. Afterward, she waited on the sidewalk in front of the Buttigieg campaign bus, holding one child in each arm. “Wow, you’ve got your hands full,” Mr. Buttigieg told her before pausing for a picture. Parents interviewed at a range of campaign events said they often felt like this political moment resembled a tawdry reality TV show, and they brought their children to see the 2020 candidates to try to demonstrate to them that politics can be something different. “I can’t let my kids listen to the TV without being ready to hit the mute button,” said Julia Privett, a physician assistant who brought her 2-year-old daughter, Alyssa, to see Mr. Biden talk about climate change in Cedar Rapids. Lytishya Borglum, a Cedar Falls small business owner, brought her three middle-school-aged children to see Senator Kamala Harris of California speak at the University of Northern Iowa. She’d taken her oldest daughter, 13-year-old Berlyn, to see Democratic caucus campaign events in 2008, but skipped 2016 because it was too toxic. “Nowadays, it’s impossible for them not to be exposed to the craziness in the White House,” Ms. Borglum said. At Ms. Warren’s Iowa City rally, a parade of children waited with their parents for a picture with the senator. Kohner Reynolds, who will turn 2 in November, blew past his 7:30 p.m. bedtime. “He fell asleep a couple times in the baby carrier,” said Kohner’s mother, Callie Reynolds. “I wanted him to be able to say he came to see her.” Burgundy Johnson, a child psychologist, kept her 5-month-old son, Archer, up past his 8 o’clock bedtime. She occupied Archer with toys. “I wanted a picture of Elizabeth Warren holding my baby,” she said while leaving the event at 8:40 p.m. “Now it’s going to be an interesting night.” The older children tend to be more attuned to issues. Evelynn Parlet, 11, an Iowa City sixth grader, said she approved of Ms. Warren’s campaign goal of reordering the American economy. “I liked what she said,” she said. “We need to help people who don’t have enough money.” Samara and Isa Murillo, sisters who are 10 and 8 years old, each had Ms. Warren autograph a white campaign placard. Ms. Warren got down on one knee and signed them on the floor of the stage. “We love her ideas about change and the two cents,” Samara said. “People out there are dying of hunger.” Isa said she was more focused on climate change. “Some people don’t have homes because of the flooding,” she said. And, because it is Iowa, there are parents who spend caucus season vying to get their children photographed with all of the candidates they can — just in case one of them makes it to the White House. Eric Heininger, a fund-raiser for nonprofit organizations, and his wife, Tiffani Milless, a physician, toted their 9-month-old daughter, Charlotte, around the Polk County Steak Fry last month to get her in pictures with as many contenders as possible. Dressed in a red-white-and-blue sundress, Charlotte met Ms. Warren, Mr. Buttigieg, Mr. O’Rourke and the entrepreneur Andrew Yang. At earlier campaign events, she was photographed with Mr. Sanders, Senator Cory Booker of New Jersey and former Gov. John Hickenlooper of Colorado, who ended his campaign in August. With Charlotte sleeping on her father’s chest, Dr. Milless filled out a card committing to caucus for Mr. O’Rourke and held it up while the Texan offered his toothy smile. “Thank you so much,” Mr. O’Rourke said, gently patting the sleeping child on her back. A campaign aide took Dr. Milless’s caucus card and stuffed it into a backpack. Afterward, Dr. Milless said she had only filled out the card in order to secure the picture with her daughter. “He’s in my top three,” she said. “It’s a loose commitment, kind of like a promise ring.”",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "A Pregnancy Scandal",
      "url": "https://www.nytimes.com/2019/10/10/opinion/elizabeth-warren-fired-pregnant.html?searchResultPosition=21",
      "subtitle": "The problem here is not Elizabeth Warren.",
      "author": "David Leonhardt",
      "content": " This article is part of David Leonhardt’s newsletter. You can sign up here to receive it each weekday. Elizabeth Warren “sticks by her story,” USA Today said. She “stands by account,” NBC News explained and “defends” it, according to The Wall Street Journal. CBS News put it this way: Warren “insists she was fired from a teaching job nearly 50 years ago because she was pregnant. A series of reports have questioned the story she’s been telling on the campaign trail.” These descriptions all create an impression that Warren’s story is at least questionable and perhaps misleading. But the evidence suggests otherwise. From my reading of the stories, she has been telling the truth all along. This mini-controversy has instead ended up highlighting problems not with Warren but with media coverage and political discourse. I see at least three: Balance over accuracy. It is certainly true, as CBS noted, that some people have questioned Warren’s account. A story in the Washington Free Beacon, a conservative publication, did so, as did a writer for Jacobin, a socialist publication. But to say that stories have raised questions is not the same thing as saying the questions are good ones. Over the years, people have also “raised questions” about whether the earth rotates around the sun, the moon landing happened, Communism was fatally flawed, Elvis died and Barack Obama is an American. But I wouldn’t recommend putting any of those questions in a headline. A good rule: Whenever you see the phrase “raises questions” in a story, you should be deeply skeptical of its assertions. The phrase is a crutch that journalists too often use to make implicit accusations they can’t support. [Listen to “The Argument” podcast every Thursday morning, with Ross Douthat, Michelle Goldberg and David Leonhardt.] A false notion of inconsistency. One piece of supposed evidence of Warren’s prevaricating was that she hadn’t always blamed pregnancy discrimination for her job loss. That’s true — and largely meaningless. Human beings don’t include every detail of a story each time they tell it, especially when the story involves difficult personal history. In this case, the evidence is on Warren’s side. The same CBS News report that included such a misleading summary also featured some good reporting: “The rule was at five months you had to leave when you were pregnant,” Trudy Randall, who taught at the same school, remembered. “Now, if you didn’t tell anybody you were pregnant, and they didn’t know, you could fudge it and try to stay on a little bit longer. But they kind of wanted you out if you were pregnant.” Sexism. Discrimination — against women, racial minorities and others — often happens in unannounced ways. That doesn’t make every claim of discrimination true, of course. But it does mean that employers who discriminate don’t typically broadcast what they’re doing. The bias against pregnant women (and mothers) may be the classic version of this. Employers find excuses to avoid hiring a young, recently married woman who’s otherwise an excellent job candidate. Or co-workers express disappointment about a female colleague getting pregnant. In 1971, when the Warren episode happened, sexism was a bigger problem than it is today. Pregnancy discrimination was still legal, in fact. Yet the last few days of cluck-clucking show some of the ways that sexism is still with us today. In the end, Elizabeth Warren isn’t the person who should be reflecting on how she’s handled this story. For more … “You don’t have to like Warren or agree with her policies to acknowledge the reality of pregnancy discrimination,” National Review’s Alexandra DeSanctis wrote. “Too many conservatives don’t want to talk about it because it’s somehow a ‘liberal’ thing, but a more pro-woman, pro-family right would be willing to admit it happens.” “Throughout the American workplace, pregnancy discrimination remains widespread. It can start as soon as a woman is showing, and it often lasts through her early years as a mother,” Natalie Kitroeff and Jessica Silver-Greenberg wrote in The Times earlier this year. “Whether women work at Walmart or on Wall Street, getting pregnant is often the moment they are knocked off the professional ladder.” Whether or not the original Free Beacon story was fair, a “poisoned version” quickly spread among pro-Trump figures, The Washington Post’s Margaret Sullivan argued. “If there is a scandal here, it’s how — in the bad-faith media world — narrowly presented facts without sufficient context can do unfair harm. They can and will be weaponized, falsely regurgitated and twisted beyond recognition.” “The scrutiny on Warren’s pregnancy-discrimination story feels like an omen of even more blatantly gendered attacks to come,” Bridget Read wrote in The Cut.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "null",
      "url": "https://www.nytimes.com/interactive/2019/10/12/us/politics/democratic-candidates-campaigns.html?searchResultPosition=20",
      "subtitle": "null",
      "author": "Reid J. Epstein",
      "content": " ",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Warren Dares Facebook With Intentionally False Political Ad",
      "url": "https://www.nytimes.com/2019/10/12/technology/elizabeth-warren-facebook-ad.html?searchResultPosition=19",
      "subtitle": "null",
      "author": "Cecilia Kang",
      "content": "  WASHINGTON — Elizabeth Warren is playing a game of dare with Facebook. The Democratic presidential candidate bought a political ad on the social network this past week that purposefully includes false claims about Facebook’s chief executive, Mark Zuckerberg, and President Trump to goad the social network to remove misinformation in political ads ahead of the 2020 presidential election. The ad, placed widely on Facebook beginning on Thursday, starts with Ms. Warren announcing “Breaking news.” The ad then goes on to say that Facebook and Mr. Zuckerberg are backing the re-election of Trump. Neither Mr. Zuckerberg nor the Silicon Valley company has announced their support of a candidate. [Related: What the 2020 candidates’ spending on Facebook political ads reveals about their campaigns.] “You’re probably shocked, and you might be thinking, ‘how could this possibly be true?’ Well, it’s not,” Ms. Warren said in the ad. In a series of tweets on Saturday, Ms. Warren, a senator from Massachusetts, said she had deliberately made an ad with lies because Facebook had previously allowed politicians to place ads with false claims. “We decided to see just how far it goes,” Ms. Warren wrote, calling Facebook a “disinformation-for-profit machine” and adding that Mr. Zuckerberg should be held accountable. Ms. Warren’s actions follow a brouhaha over Facebook and political ads in recent weeks. Mr. Trump’s campaign recently bought ads across social media that accused another Democratic presidential candidate, Joseph R. Biden Jr., of corruption in Ukraine. That ad, viewed more than five million times on Facebook, falsely said that Mr. Biden offered $1 billion to Ukrainian officials to remove a prosecutor who was overseeing an investigation of a company associated with Mr. Biden’s son Hunter Biden. This past week, the Biden campaign demanded that Facebook, Twitter and YouTube take down the ad. Facebook refused, telling the Biden campaign that it would keep the Trump ad up because of its belief that statements by politicians add to important discourse and are newsworthy, even if they are false. Twitter and YouTube have also kept the ad online. Ms. Warren’s false ad on Facebook is now set to escalate her growing feud with the world’s biggest social network. Ms. Warren has turned into a vocal critic of tech companies and their power. She has called for behemoths like Facebook and Google to be broken up. In a leaked audio recording published this month of a meeting that Mr. Zuckerberg had with Facebook employees, he was heard saying that Facebook would sue if Ms. Warren were to enact the breakup plan as president. In response, Ms. Warren doubled down, saying that America needed to “fix a corrupt system that lets giant companies like Facebook engage in illegal anticompetitive practices, stomp on consumer privacy rights, and repeatedly fumble their responsibility to protect our democracy.” This month, Ms. Warren’s campaign also sent an email seeking donations with the subject line “re: Mark Zuckerberg.” And at a rally in San Diego, as she talked about the power of huge corporations, she told the crowd, “Break them up. And yes, Mark Zuckerberg, I’m looking at you.” For Facebook, the situation is tricky. The social media company has struggled in recent years with what to allow and disallow on its site, especially after revelations that Russian operatives used the platform during the 2016 presidential election to post disinformation to inflame the American electorate. Facebook has moved to clamp down on false content. Yet when the company removes or buries messages, ads, photos and videos, it is often called out for bias and censorship. Facebook has faced particular wrath from conservatives, who have said the social network intentionally suppresses what they say. “Facebook believes political speech should be protected,” a spokesman for Facebook said on Saturday. “If Senator Warren wants to say things she knows to be untrue, we believe Facebook should not be in the position of censoring that speech.” Truth in social media advertising is likely to become a bigger issue ahead of the 2020 presidential election. Mr. Zuckerberg is scheduled to speak about Facebook’s political speech policies this coming week at Georgetown University. Presidential candidates have been spending huge sums on ads on Facebook and other social media platforms to reach voters. Some campaigns have focused on advertising specifically on Facebook given its sheer size — it has more than 2.2 billion users worldwide — and the ability to spread ads and content cheaply and quickly across the platform. Like her rivals for the Democratic nomination, Ms. Warren has spent a significant amount of money on Facebook advertising, which is a crucial way to reach potential grass-roots donors. Over all, her presidential campaign has spent more than $3.3 million on Facebook ads, according to numbers disclosed by the company. Unlike the social media companies, some cable outlets have refused to run the false Trump campaign ad that said Mr. Biden acted corruptly in Ukraine. CNN and NBCU, which declined to run the ad, said it violated their standards. Some broadcast networks across the nation have run the ad, including in early voting states. Late on Saturday, Facebook tweeted a response to Ms. Warren. The company said that broadcast stations had aired the Trump ad about 1,000 times as required by law and that the Federal Communications Commission didn’t want broadcast companies censoring speech. “We agree it’s better to let voters — not companies — decide,” Facebook said.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "In Shift, Warren Will Forgo Big Money Events if Nominated. At Least Some of Them.",
      "url": "https://www.nytimes.com/2019/10/09/us/politics/elizabeth-warren-fundraising.html?searchResultPosition=18",
      "subtitle": "Elizabeth Warren is seeking to find a balance — disavowing fund-raisers with wealthy contributors while promising not to actually disarm in a potential matchup with President Trump.",
      "author": "Shane Goldmacher",
      "content": " As Senator Elizabeth Warren has surged toward the top of the Democratic presidential field, she has found herself torn between two competing imperatives: maintaining her perceived purity from the influence of wealthy contributors and not ceding any financial advantage to President Trump, who is busy breaking fund-raising records. One of the centerpieces of Ms. Warren’s anti-corruption message has been her pledge to forgo traditional big-money fund-raisers, which advisers believe has helped fuel her rise. From the start, Ms. Warren had said the ban only applied to the primary. “I do not believe in unilateral disarmament,” she said when she announced it in February on MSNBC. But in a reversal, she told CBS News in an interview posted late Tuesday evening that she would extend the pledge through the general election if she were to win the Democratic nomination. “Look, for me this is pretty straightforward,” Ms. Warren said. “Either you think democracy works and electing a president is all about going behind closed doors with bazillionaires and corporate executives and lobbyists and scooping up as much money as possible. Or you think it’s about a grass-roots, let’s build this from the ground up.” Pressed on whether that was her position “no matter how much money Donald Trump is raising,” Ms. Warren replied: “Yeah, I’m not going to do the big-dollar fund-raisers. I’m just not going to do it. The whole notion behind this campaign is that we can build this together.” Her aides confirmed the decision on Wednesday but layered on some caveats: While she would forgo fund-raisers for her campaign, she would headline open press events for the Democratic National Committee, which has traditionally served as a virtual extension of the nominee. Her spokeswoman, Kristen Orthman, said Ms. Warren was committed to helping Democrats “up and down the ballot.” Powered by small donors, Ms. Warren has become one of the strongest Democratic fund-raisers of the 2020 field, raising $24.6 million in the last three months from more than 940,000 donations, second only to Senator Bernie Sanders of Vermont, who raised $25.3 million. Ms. Warren’s new position on general election fund-raisers appears to be an effort to thread the needle between those on the progressive left urging her to permanently swear off soliciting big checks and Democratic officials and activists concerned that such a stand would endanger the party as Mr. Trump and the Republicans bank record sums of cash. Veterans of Democratic politics said the idea that fund-raising operations for the party nominee and the party itself would be completely independent was strained. “Once you are the Democratic nominee, you are the party,” said Rufus Gifford, a former finance director for President Barack Obama, who has donated to multiple 2020 candidates but not to Ms. Warren. “You own the party. Your political operation takes over the D.N.C. You cannot divorce in any way fund-raising for the presidential campaign and the Democratic Party.” The donation limits for the D.N.C. are actually far higher than those for direct contributions to campaigns. The D.N.C. can raise money in increments of $355,000; direct donations to a potential Warren general election committee would be limited to $2,800. Ms. Orthman said Ms. Warren would attend D.N.C. events that are open to the press to “make sure the Democratic National Committee, state and local parties, and Democratic candidates everywhere have the resources” they need. She also said Ms. Warren was “not going to change a thing in how she runs her campaign,” including “no special access or call time with rich donors or big-dollar fund-raisers.” Ms. Warren headlined a D.N.C. event in August, but she did not meet privately with large donors who attended. She is scheduled for another D.N.C. event next week. The Warren campaign declined to say whether it would create a joint fund-raising committee with the D.N.C., which is traditionally a big lure for contributors who want to support candidates up and down the ballot. Mr. Trump and his shared committees with the Republican National Committee raised $125 million in the last three months. Henry R. Munoz III, who stepped down as finance chair of the D.N.C. earlier this year and has co-hosted a fund-raiser for former Vice President Joseph R. Biden Jr., said Ms. Warren’s proposed arrangement left him confused. “I don’t even know how that would work,” Mr. Munoz said. Democrats, he added, “have to do everything in their power to work together to create an infrastructure to do battle with the almost unlimited resources that this administration and that party will use to destroy what we believe in.” Beyond the party itself, an array of Democratic super PACs are gearing up for 2020. Guy Cecil, the chairman of the biggest such group in the presidential race, Priorities USA, wrote on Twitter that regardless of Ms. Warren’s decision, it was “full speed ahead.” “We’re already up & running ads holding Trump accountable in key states & will be through November next year,” Mr. Cecil wrote. Ms. Warren has steadily risen in the polls throughout the year and has recently topped Mr. Biden in some surveys both nationally and in the early-voting states of Iowa and New Hampshire. Previously, she had been clear that her ban on fund-raisers applied only to the primary. MSNBC’s Chris Hayes asked her that directly when she announced it (“Yes,” Ms. Warren replied). And in an interview with The New York Times over the summer, Ms. Warren said, “It’s primaries. This is Democrat against Democrat. I don’t believe in unilateral disarmament.” Some of her rivals had sought to portray her stance as inconsistent. “Bernie is proud to be the only candidate running to defeat Donald Trump who is 100 percent funded by grass-roots donations — both in the primary and in the general,” Mr. Sanders’s campaign manager, Faiz Shakir, said pointedly when announcing his campaign’s quarterly financial haul. There has also been grumbling about the $10 million in leftover Senate funds she seeded her presidential campaign with, some of which was raised from major contributors. Ms. Warren and Mr. Sanders are the only two Democrats to skip traditional fund-raising events in the primary, where candidates can collect checks of up to $2,800. Her announcement this week could appeal to more fervent supporters of Mr. Sanders, whose base Ms. Warren has been seeking to win over. Tension over how candidates raise their money is an age-old political issue. In the 2016 race, Mr. Trump railed against the influence of big donors in the Republican primary. But once he became the nominee, he quickly embraced the donor world. At the time, he said he did not see a contradiction. “No,” Mr. Trump said then, “because I’m raising money for the party.”",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Working Families Party Endorses Elizabeth Warren. Here’s Why It Matters.",
      "url": "https://www.nytimes.com/2019/09/16/us/politics/working-families-party-elizabeth-warren.html?searchResultPosition=17",
      "subtitle": "The progressive group, whose electoral influence has grown since it backed Bernie Sanders four years ago, is now supporting Ms. Warren for the Democratic presidential nomination.",
      "author": "Astead W. Herndon",
      "content": " The Working Families Party, the labor-aligned progressive group whose electoral influence has grown since the 2016 election, has endorsed Senator Elizabeth Warren of Massachusetts for the Democratic presidential nomination, a boon to her candidacy as she attempts to position herself as the main challenger to former Vice President Joseph R. Biden Jr. The party endorsed Senator Bernie Sanders of Vermont during the last presidential cycle, at which time he described Working Families as “the closest thing” to “my vision of democratic socialism.” The group’s endorsement of Ms. Warren on Monday, one of the few by a prominent progressive organization this early in the primary, could turn heads among left-leaning Democrats desperate to defeat Mr. Biden, the more moderate front-runner, in a primary election where their party’s ideological future is at stake. “Senator Warren knows how to kick Wall Street kleptocrats where it hurts, and she’s got some truly visionary plans to make this country work for the many,” said Maurice Mitchell, the Working Families Party’s national director. “We need a mass movement to make her plans a reality, and we’re going to be a part of that work.” Mr. Mitchell brushed off the possibility that the group’s endorsement would be seen as a sign of a splintering of the progressive left. The vote among “tens of thousands” of party members and national committee leaders resulted in a commanding majority for Ms. Warren, a party spokesman said; she received more than 60 percent of the votes on the first ballot. But the announcement was met with derision from some of Mr. Sanders’s supporters. The national committee leaders — 56 people — held 50 percent of the voting power, with party members accounting for the other 50 percent. Several Sanders supporters called for the Working Families Party to release the full vote totals, which it has declined to do. Mr. Sanders’s campaign shook up its New Hampshire staff over the weekend as Ms. Warren continued to make inroads among progressives. Ms. Warren is coming off a debate performance last week that was generally well received, and she held a rally in New York on Monday that drew thousands to Washington Square Park. Also on Monday, Ms. Warren unveiled a plan to combat corruption in government, a core theme of her campaign. The plan is based on a wide-ranging anticorruption bill that she first proposed last year and is a cornerstone of her stump speech on the campaign trail. Mr. Mitchell and other Working Families Party leaders said in interviews that their endorsement came with a message to other progressive organizations. Rather than passively observe the primary, they said, these groups should choose a side and flex their organizing muscle during the early stages to help knock Mr. Biden off his perch. “If our focus is on victory, we can’t be delusional about it,” Mr. Mitchell said. “You don’t defeat the moderate wing of Democrats through thought pieces or pithy tweets, you defeat their politics through organizing.” Traditional bellwether endorsements from labor unions like American Federation of Teachers and the Service Employees International Union have not yet materialized, though Mr. Sanders picked up an endorsement from the United Electrical workers in August. With less than five months to go before the Iowa caucuses formally begin the nominating contest, many organizations are still wrestling with a sprawling Democratic field. “There are some great arguments for progressives rallying around a single candidate as soon as possible and others for taking the time to see how the contest develops,” said Yvette Simpson, chief executive of Democracy for America, another progressive group that endorsed Mr. Sanders four years ago. Ms. Simpson said her group did not plan to endorse a candidate before December. Mr. Sanders finished second in the Working Families Party vote, ahead of three other candidates: the former housing secretary Julián Castro, Senator Cory Booker of New Jersey and Mayor Bill de Blasio of New York. Most national polls show a top tier of three candidates in the Democratic primary — Mr. Biden, Ms. Warren and Mr. Sanders — and Mr. Biden has remained the front-runner. Among the two leading progressive candidates, Mr. Sanders has traditionally enjoyed more support from working-class voters, helped by his name recognition held over from 2016. Ms. Warren has made significant gains in the last six months, but polling shows that most of that growth has come from college-educated voters. In the years since President Trump’s election, candidates backed by the Working Families Party have won congressional, state and local races across the country, expanding the group’s power base from the Acela corridor to the West Coast. The group also helped several left-wing candidates win seats in the New York State Legislature last year. Mr. Mitchell took over as national director for the party in 2018, after he rose in prominence during the Black Lives Matter movement born out of protests in Ferguson, Mo. The group’s leaders stressed that, even with their endorsement, their intention was not to divide the progressive left between Ms. Warren and Mr. Sanders. The senators are longtime friends and have been publicly supportive of each other’s candidacies. But they are still locked in a battle to be the progressive standard-bearer. After the Working Families endorsement was announced on Monday, Misty Rebik, Mr. Sanders’s Iowa state director, wrote on Twitter: “There is one movement politics presidential candidate. One. It’s @BernieSanders.” Outside the left wing of the party, more moderate Democrats have continued to sound alarms about progressives’ ability to beat Mr. Trump, and about Ms. Warren’s chances in particular. And many Republicans see the progressives’ embrace of a “Medicare for all” health care system and the Green New Deal as general-election liabilities waiting to be exploited. Surrogates for other Democratic contenders — like Mr. Biden, Ms. Harris and Mayor Pete Buttigieg of South Bend, Ind. — have tried to paint Ms. Warren and Mr. Sanders as candidates of the elite, who talk about lofty ideologies instead of pragmatic solutions. “My concern about the vision from the Sanders-Warren approach is that it can polarize Americans, when we have other ways to deliver bold solutions without dividing the American people further,” Mr. Buttigieg said Sunday on CNN. But Mr. Mitchell said he believed the Working Families Party could convert Democrats skeptical of wide-reaching progressive policies. “I’m not worried about converting people who are already committed to a structural change agenda,” Mr. Mitchell said. “I’m worried about the people who are still trying to figure out where they land.”",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Elizabeth Warren, at Washington Sq. Park Rally, Promises to Take On Corruption",
      "url": "https://www.nytimes.com/2019/09/16/us/politics/elizabeth-warren-nyc-rally-speech.html?searchResultPosition=16",
      "subtitle": "Before a crowd of thousands in New York City, Ms. Warren invoked the power of women to bring about sweeping change.",
      "author": "Thomas Kaplan",
      "content": " Senator Elizabeth Warren of Massachusetts brought her ascendant presidential campaign to New York City on Monday night, unspooling a forceful argument for attacking corruption in government in a defining speech of her White House bid. Addressing thousands of supporters in Washington Square Park, some holding up “I’m a Warren Democrat” signs, Ms. Warren pressed her case to bring sweeping change to an economic and political system she views as fundamentally tilted to favor the wealthy and powerful. She spoke near the site of the Triangle shirtwaist factory fire of 1911, which killed 146 garment workers, most of them women. The fire spurred a push to improve workplace safety, which Ms. Warren harnessed as a parallel for the far-reaching change she wants to pursue as president. And once again, she urged Democrats to embrace her call for dramatic change — not the kind of incremental approach favored most notably by Joseph R. Biden Jr., the former vice president and the primary race’s front-runner. “There’s a lot at stake in this election, and I know people are scared,” Ms. Warren said from a lectern in front of the park’s marble arch. “But we can’t choose a candidate we don’t believe in just because we’re too scared to do anything else. And Democrats can’t win if we’re scared and looking backward.” Ms. Warren was introduced by Maurice Mitchell, the national director of the Working Families Party, which announced its endorsement of her earlier Monday. In her speech, Ms. Warren described President Trump as “corruption in the flesh,” but added that “our problems didn’t start with Donald Trump.” And in invoking the Triangle factory workers, she made explicit reference to the power of women to bring about change. “We’re not here today because of famous arches or famous men,” Ms. Warren told the crowd. “In fact, we’re not here because of men at all. We’re here because of some hard-working women.” Throughout her remarks, Ms. Warren was repeatedly met with enthusiastic cheers, and the crowd broke into chants of “two cents” when Ms. Warren brought up her proposal to impose a 2 percent annual tax on the fortunes of the super rich. Beyond amplifying her call to confront corruption, a hallmark of her presidential bid, the speech was another chance for Ms. Warren to draw a big crowd on the campaign trail and put on display the enthusiasm she is generating among voters. In August, she drew 15,000 people in Seattle and 12,000 in St. Paul, according to her campaign. The New York City Department of Parks and Recreation said organizers had anticipated a crowd of 8,000 to 10,000 people for Monday’s speech. Ms. Warren’s campaign said the crowd exceeded 20,000, though that estimate could not be independently verified. With each big rally, Ms. Warren is solidifying her place in an exclusive club of presidential candidates who have become crowd magnets, exhilarating fans at events that can sometimes feel like rock concerts. In the 2004 election, it was Howard Dean, the former governor of Vermont, whose large crowds — including a big showing in Bryant Park in New York in August 2003 — offered a visibly striking signal of interest in his candidacy. Barack Obama drew enormous crowds in the 2008 race, including at a giant rally in Washington Square Park in September 2007. And in the 2016 election, Mr. Trump and Senator Bernie Sanders of Vermont were both buoyed by the electric crowds they commanded. Mr. Sanders, too, held a huge event in Washington Square Park, drawing a crowd before the 2016 New York primary that his campaign put at 27,000 people, though he went on to lose that contest to Hillary Clinton. Mr. Sanders has drawn big crowds this year as well. The recent history of crowd-magnet candidates offers a mixed track record of electoral success. Joe Trippi, who was Mr. Dean’s campaign manager, said Ms. Warren was well positioned to draw sizable crowds in big cities, given her large email list and many grass-roots donors around the country. That is particularly true in a Democratic stronghold like New York; for example, through the end of June, Ms. Warren had an estimated 1,300 donors in a single ZIP code in Brooklyn that includes most of Park Slope. But Mr. Trippi cautioned that drawing a large audience in a big city does not necessarily translate to success in the early voting states. “The question is, can you build beyond that core into a more diverse Democratic constituency?” Mr. Trippi asked. “Fifteen thousand people in Seattle does not equal winning South Carolina.” Asked last week whether she thought crowd size mattered, Ms. Warren replied, “I think it matters getting to talk to lots and lots and lots and lots of people.” Earlier Monday, Ms. Warren unveiled an expansive plan to attack corruption in government, a central theme of her campaign. The plan is based on a wide-ranging anticorruption package she first proposed last year. On the campaign trail, she likes to call it “the biggest anticorruption plan since Watergate.” Ms. Warren kicked off her campaign with a speech in Lawrence, Mass., at the Everett Mills, where textile workers went on strike in 1912. On Monday, she again invoked the setting of her speech, recalling the horrific scene of the Triangle shirtwaist factory fire. Before the fire, she said, female factory workers across New York City had been “sounding the alarm” about their working conditions, but were no match for wealthy and well-connected factory owners. “The tragic story of the Triangle factory fire is a story about power,” Ms. Warren said. “A story of what happens when the rich and the powerful take control of government and use it to increase their own profits while they stick it to working people. But what happened in the aftermath of the fire is a different story about power — a story about our power, a story about what’s possible when we fight together as one.” Ms. Warren told the story of Frances Perkins, citing her efforts after the Triangle factory fire to improve conditions for workers, and, later, her tenure as labor secretary for Franklin Delano Roosevelt. Ms. Warren presented Ms. Perkins — “one very persistent woman,” she called her, drawing cheers — as a template of sorts for how a President Warren could bring about change. “She used the same model that she and her friends had used after the Triangle fire: She worked the political system relentlessly from the inside while a sustained movement applied pressure from the outside,” Ms. Warren said, citing legacies like Social Security and the minimum wage. Even the lectern from which Ms. Warren delivered those lines had a connection to Ms. Perkins, who was the first female cabinet member: It was made with reclaimed wood from the Frances Perkins Homestead in Maine, her campaign said. As is her custom, Ms. Warren stayed after her speech to take pictures with anyone who wanted one. Linus Glenhaber, 18, a college student from Massachusetts, worked on his science homework as he waited. He praised Ms. Warren for how she reached back into American history as she spoke of corruption. “When she was talking about the Triangle shirtwaist factory,” he said, “it felt relevant to today in this incredible way.” Ms. Warren finished taking pictures around 11:40 p.m. — nearly four hours after she finished her speech. One figure who did not seem to factor into Monday’s proceedings was New York City’s mayor, Bill de Blasio, who like Ms. Warren is seeking the Democratic presidential nomination. “The mayor of this city is still running, and Elizabeth Warren turned this city out,” said City Councilman Jimmy Van Bramer of Queens, who endorsed Ms. Warren last week. “I’m not being mean, but it’s got to be devastating for him. But it’s great for us.”",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Bill de Blasio Bows Out, Elizabeth Warren’s Big Speech: This Week in the 2020 Race",
      "url": "https://www.nytimes.com/2019/09/21/us/politics/bill-de-blasio-elizabeth-warren-2020.html?searchResultPosition=15",
      "subtitle": "Here are six things that happened on the presidential campaign trail this week.",
      "author": "Matt Stevens",
      "content": "  The Democratic field got a little bit smaller this week, shrinking to 19 candidates. Here’s our weekly catch-up on the 2020 election and some moments you may have missed. Mayor Bill de Blasio of New York, who entered the Democratic presidential race on the hopes that his brand of urban progressive leadership could appeal on a national scale, said on Friday that he was ending his candidacy. Mr. de Blasio’s campaign never quite caught on, and his announcement came less than two weeks before the qualification deadline for the October debate. His inclusion in the event was growing less likely by the day. “I feel like I’ve contributed all I can to this primary campaign, and it’s clearly not my time,” he said in an appearance on MSNBC’s “Morning Joe.” “I’m going to end my presidential campaign, continue my work as mayor of New York City, and I’m going to keep speaking up for working people.” Monday was big for Senator Elizabeth Warren of Massachusetts. She received the endorsement of the Working Families Party, a labor-aligned progressive group that endorsed Senator Bernie Sanders of Vermont during the last presidential cycle. She released a 6,000-word anti-corruption plan, which would make the release of tax returns automatic for candidates for federal office, make it illegal for elected officials to become lobbyists and strengthen ethics requirements for federal judges. And in a speech at a rally in Manhattan that drew thousands to Washington Square Park, she forcefully attacked corruption and invoked the power of women to bring about sweeping change. Ms. Warren delivered the speech blocks from the site of the Triangle shirtwaist factory fire of 1911, which killed 146 garment workers, most of them immigrant women. It was one of the deadliest industrial disasters in the nation’s history. “The tragic story of the Triangle factory fire is a story about power,” Ms. Warren said. “A story of what happens when the rich and the powerful take control of government and use it to increase their own profits while they stick it to working people. But what happened in the aftermath of the fire is a different story about power — a story about our power, a story about what’s possible when we fight together as one.” With five months to go before the New Hampshire primary, Mr. Sanders overhauled his operations in the state, which he won by more than 22 percentage points in 2016. Mr. Sanders, who hails from neighboring Vermont, almost certainly must win New Hampshire again next year to have a chance at the nomination. The campaign also parted ways with its political director in Iowa, according to a report that surfaced later in the week. Read more about that move here. Several candidates called for the impeachment of Justice Brett M. Kavanaugh after The New York Times published new information about allegations of sexual misconduct against him. Ms. Warren, Mr. Sanders and Senator Kamala Harris of California were among those who called for the justice’s impeachment. “He was put on the Court through a sham process and his place on the Court is an insult to the pursuit of truth and justice,” Ms. Harris wrote. Former Vice President Joseph R. Biden Jr. called the revelations “profoundly troubling” but stopped short of demanding impeachment. Instead, he called for an investigation into “whether the Trump administration and Senate Republicans pressured the F.B.I. to ignore evidence.” Former Representative Beto O’Rourke of Texas released a plan on Thursday to legalize marijuana, expunge all possession convictions and regulate the substance the way alcohol is regulated. Sales would be limited to adults, smoking would be banned in public areas, and advertising would be restricted. He also wants to tax the marijuana industry and invest the revenue in the communities of color disproportionately affected by the war on drugs. Every Democratic candidate supports decriminalizing marijuana, and most, including Mr. O’Rourke, support full legalization. But six candidates — Mr. Biden, Senator Michael Bennet of Colorado, Gov. Steve Bullock of Montana, Representative Tulsi Gabbard of Hawaii, Mayor Wayne Messam of Miramar, Fla., and former Representative Joe Sestak of Pennsylvania — want to leave the question of legalization up to the states. Overheard on the campaign trail? “I’m moving to Iowa,” Ms. Harris joked in a comment to Senator Mazie Hirono of Hawaii that included an expletive and was overheard by a reporter. The state of California did not immediately respond to a request for comment. Ms. Harris’s remark came as her campaign announced a new push in the state. In a call with reporters Thursday morning, aides said they hoped to position Ms. Harris for a late-breaking Iowa surge. And they set a firm target: a top-three finish. Ms. Harris’s team sent out a fund-raising email based on her quip. And, of course, there are already T-shirts.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Elizabeth Warren’s Plan for Social Security Looks Smart",
      "url": "https://www.nytimes.com/2019/09/12/opinion/elizabeth-warren-social-security.html?searchResultPosition=14",
      "subtitle": "The elderly have also suffered from extreme inequality.",
      "author": "David Leonhardt",
      "content": " This article is part of David Leonhardt’s newsletter. You can sign up here to receive it each weekday. When I was a teenager, my mom showed me a statement that she had received in the mail from the Social Security Administration. It included an annual history of her earnings, which showed a big string of zero’s covering the years when she was in her late 20s and early 30s. “That’s you and your sister,” she explained, laughing. My mom is doing just fine these days, but anyone who spends years as a stay-at-home parent — or an unpaid caregiver of any kind — faces a financial penalty when it comes time to retire. Our Social Security system doesn’t recognize parenting as the socially and economically valuable job that it is. That’s not the system’s only inequity, either. It also punishes teachers, police officers, firefighters and other government employees. Their Social Security benefits are cut if their pension is large enough, unlike private-sector workers, who can keep their full Social Security benefit regardless of the size of their private pension. Elizabeth Warren has become famous for her plans, and her latest one, out this morning, is meant to address this unfairness. It would let public-sector workers keep their full Social Security benefits and increase benefits for people who spend at least 80 hours a month as unpaid caregivers for young children, the elderly or the disabled. The biggest part of the plan, however, is an across-the-board increase in monthly Social Security payments. Every current and future beneficiary will receive at least $200 more per month than under the current plan, and many low-income workers will receive at least $600 more. “A generation of stagnant wages and rising costs for basics like housing, health care, education, and child care have squeezed family budgets,” Warren writes in a Medium post. “Millions of families have had to sacrifice saving for retirement just to make ends meet. At the same time, fewer people have access to the kind of pensions that used to help fund a comfortable retirement.” Her campaign also released an outside analysis, by Moody’s Analytics, which found that the plan would cut the elderly poverty rate by about two-thirds. She would pay for the plan by increasing the payroll tax on incomes above $250,000, which are now shielded from it. As income inequality has soared in recent decades, Warren notes, the amount of the country’s total income subject to the payroll tax, which finances Social Security, has declined. She would reverse that decline. I’ve criticized Warren and other Democrats recently for backing a couple of policies that I think are wrongheaded and unpopular (like forcing everyone to enroll in Medicare). The Social Security plan is different. I’ll want to read what others have to say about it in coming days, especially about the size of the increase, but my initial view is that this proposal is the opposite of mandatory Medicare — substantively smart and politically popular. True, the economy has been kinder to older Americans than younger Americans in recent years (as Warren is well aware). Over all, I’d like to see federal spending become more focused on children and younger workers. But it’s also true that our high-inequality economy hasn’t been easy on most people over the age of 65. Many deserve help. And as I’m sure you are aware, people over 65 tend to vote at very high rates. Related: “Americans are pessimistic about the financial health of older Americans,” Kim Parker, Rich Morin and Juliana Menasce Horowitz of the Pew Research Center recently wrote. “Most say that, 30 years from now, those ages 65 and older will be less prepared for retirement than their counterparts today.” My colleague Paul Krugman has written over the years about both the long-term finances and the politics of Social Security. “America’s overall retirement system is in big trouble,” Paul wrote in 2013. “There’s just one part of that system that’s working well: Social Security. And this suggests that we should make that program stronger, not weaker.”",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Elizabeth Warren Lost Her Dream Job but Gained a Path to 2020",
      "url": "https://www.nytimes.com/2019/09/21/us/politics/elizabeth-warren.html?searchResultPosition=13",
      "subtitle": "She had a plan to take on big banks. In the fight to get it done, she honed the approach to politics that defines her presidential campaign.",
      "author": "Alexander Burns",
      "content": " Elizabeth Warren did not want a goodbye party. She told her aides there would be no grand send-off, no celebration of a mission accomplished. The Consumer Financial Protection Bureau had been her idea from the start: a new arm of the government, uniquely empowered to police the kinds of loans and financial schemes that led to the Great Recession. Ms. Warren had detailed the idea in a journal article, then cajoled and pressured Congress to make it law. She was tasked by President Barack Obama in 2010 with setting up the bureau, and spent a year recruiting investigators and enforcers for an office they saw as an exhilarating cause. But as spring turned to summer in 2011, Ms. Warren faced a wrenching separation. The White House had decided not to nominate her to lead the bureau permanently. So she gathered the staff for an “all hands” meeting and told them her work there was over. “She told us that we were ready to sail the ship, that we did not need her there, and that we would be able to do it on our own,” said Patricia McCoy, a Boston College law professor who was a senior official at the bureau. Ms. Warren was right. Under her successor, Richard A. Cordray, the bureau would recover $12 billion for consumers from financial institutions by 2017. It would become, to supporters, a prized example of the government taking on big banks after the 2008 financial crisis. To opponents — Republican lawmakers, business associations and a few conservative Democrats — it would become an example of “runaway government,” an agency to be curbed at the first opportunity. To Ms. Warren, the bureau is something else as well: a formative lesson in how an idea — a plan — can become reality. For it was through creating a new financial regulator that Ms. Warren developed the approach to government that now guides her presidential campaign. And it was in losing the chance to lead her bureau that Ms. Warren came to see the value of asking voters, rather than a president, to give her power. A review of Ms. Warren’s role in creating the consumer bureau, including interviews with more than 30 people involved in the process, revealed an approach to politics that joins imaginative policy ideas with a keen instinct for mass communication and a willingness to negotiate. On one hand, she marshaled support from progressive activists and helped build public demand for her idea; on the other, she haggled with members of Congress to earn their backing. David Axelrod, who was Mr. Obama’s top political adviser during the battle to create the C.F.P.B., called Ms. Warren’s role a “bona fide credential” for the presidency. “There aren’t that many people who can say they had an idea, wrote about it and ended up bringing it to fruition, in terms of the creation of a whole new government agency with a very focused mission,” Mr. Axelrod said. If some of Ms. Warren’s rivals — and more than a few Democratic voters — question whether her ideas are realistic, she and her supporters answer by pointing to the consumer bureau. At the New Hampshire Democratic Party’s convention this month, supporters of Ms. Warren broke out in chants of, “C-F-P-B! She fights for you, she fights for me!” In a recent interview, Ms. Warren described the creation of the bureau as a “model” for how she would seek to deploy her plans as president. At a September rally in Washington Square Park in New York, Ms. Warren likened herself to Frances Perkins, the first secretary of labor — a woman, she said, “who worked the political system relentlessly from the inside, while a sustained movement applied pressure from the outside.” But if the bureau has been an enduring victory for Ms. Warren, it culminated in a painful disappointment. In the interview, Ms. Warren — an upbeat presence on the campaign trail — became somber when the conversation turned to her exit from the bureau. Asked about her insistence against having a farewell party, her eyes began to glisten. “I couldn’t say goodbye to all those people I’d hired and all those people I’d brought in to fight,” Ms. Warren said, speaking slowly and quietly. “I’d made an implicit promise to lead the charge, and I would’ve stayed and led it if I could have. But I couldn’t. And I did not want to say goodbye to all of them.” Ms. Warren’s band of advisers, lawyers, researchers and technicians devised a more discreet send-off. Elizabeth Vale, a former White House official who was among Ms. Warren’s close counselors, said an immense farewell card was made from a “big, big, big piece of cardboard,” stamped with the electric-green logo of the C.F.P.B. and signed by scores of staff members. Still, Ms. Warren, then 62, declined to receive it before a throng of colleagues. “I remember two of us brought it to her,” Ms. Vale said, “and then I remember when she walked out, she just walked out quietly, by herself.” It all began with Ms. Warren’s decision to write an article in the winter of 2007. She had endured one unhappy brush with Washington, testifying against a bill to tighten the bankruptcy code in a way she feared would burden low-income debtors. The proposal became law in 2005, with Joseph R. Biden Jr., then a senator, as its leading Democratic supporter. Back at Harvard, where she was teaching law, Ms. Warren began considering a new idea: a proposal for a government regulator to address the issue on which Congress had spurned her advice — the problem of consumer credit and the often-deceptive financial products being offered to ordinary people. She outlined the concept to Kenneth Baer, then 34, a former Clinton administration aide who with several like-minded Democrats had founded a publication, Democracy, to stir an ambitious policy debate among liberals. He was skeptical at first of Ms. Warren’s regulatory proposal, wondering if forming a new government agency represented an “old Democratic way of thinking.” But Mr. Baer and his colleagues were hungry for big ideas to fill what they saw as an intellectual void in the Democratic Party, and he encouraged her to make the case for a new regulator. In a February email to Mr. Baer, Ms. Warren agreed to write it. As she tells it now, she was bursting for the chance. “The idea was ripe,” she said. “I was ready.” A draft of the piece followed in late March. Ms. Warren urged her collaborators to “edit aggressively,” an instruction that proved unnecessary. A copy of her first version reviewed by a reporter shows its now-famous opening was scarcely changed. “In the U.S. today it is not possible to buy a toaster that has a 1-in-5 chance of bursting into flames and burning down a customer’s house,” Ms. Warren wrote in her draft. “But it is possible to refinance an existing home with a mortgage that has the same 1-in-5 chance of putting the family out on the street — without ever disclosing that fact to the homeowner.” When Democracy published Ms. Warren’s article in the summer of 2007, Mr. Baer and his colleagues promoted it — and its author — vigorously, booking Ms. Warren on CNN and winning coverage for her idea in national newspapers. And they promoted it to presidential campaigns, too. A breakthrough came in June when Heather McGhee, a policy adviser to Senator John Edwards, emailed Ms. Warren to say her candidate was about to endorse a new regulator for financial products. By early 2008, Ms. Warren and her sometime editors were musing over email that the proposal could really become law. When Ms. Warren noted praise for her idea in Newsweek, Andrei Cherny, a co-founder of Democracy, wrote back, “Next stop: law of the land!” “I’m working on it!” Ms. Warren replied, signing off with her initials, EW, in lowercase. It had been decades since either political party had tried seriously to impose tougher financial regulations. Even sympathetic Democrats, like Representative Barney Frank of Massachusetts, questioned the feasibility. Ms. McGhee, who stayed in touch with Ms. Warren after the Edwards campaign ended, said she saw the professor straining to discern what to do and whom to turn to in Washington. “She really was trying to figure out how to have all the right conversations,” Ms. McGhee said. “And then the financial crisis happened.” The Congressional Oversight Panel, a body set up to scrutinize Washington’s bailout of the financial system, did not mention toasters in its “special report” on financial regulation. But the document, issued days after Mr. Obama’s inauguration in 2009, was unmistakable in its suggestion. The report recommended creating a financial regulator that could gather up the fragmented enforcement tools of the federal government and seek to avert another financial crisis. It was a natural suggestion for the oversight body, since Ms. Warren was its chairwoman. Harry Reid, the Senate majority leader at the time, had named her to the post at the end of 2008, in the throes of a global financial catastrophe that sent unemployment soaring and threw millions of homeowners into foreclosure. From this perch, Ms. Warren began a campaign for her bureau. It was no longer a lonely effort. Mr. Frank, a powerful committee chairman, was now an ally. So was an emerging coalition of progressive groups, labor unions and consumer advocates, known as Americans for Financial Reform. Ms. Warren sought out its leader, Heather Booth, for insight into political organizing. “She knew many of the players on the policy side,” Ms. Booth said. “What she hadn’t been experienced with were the politics.” Ms. Warren also built alliances inside government, finding friends in people like Mr. Axelrod and Valerie Jarrett, one of Mr. Obama’s closest advisers. Mr. Axelrod saw the bureau as a political necessity, the one part of financial reform ordinary voters might understand. At times, Ms. Warren’s appeals were strikingly personal: Over dinner in Cambridge, Mass., Ms. Warren told Ms. Jarrett much of the life story that is now familiar to voters who follow her campaign, a tale of deep economic adversity for her family in Oklahoma. “It put in context why this policy was so important to her,” Ms. Jarrett said. Mr. Obama embraced the proposal, putting a consumer bureau in his blueprint for financial reform in the spring of 2009 and talking on late-night television about exploding toasters. Ms. Warren was elated but uneasy. The financial industry was mobilizing, warning that a new regulator would damage the economic recovery. And Ms. Warren was concerned about two of Mr. Obama’s lieutenants: Treasury Secretary Timothy Geithner and Lawrence H. Summers, who helmed the National Economic Council. She had profound philosophical disagreements with both men, who believed that her savage criticism of the bank bailouts revealed a misunderstanding of the role of Wall Street in the fragile economic recovery. “Tim and Larry were not fans of this agency,” Ms. Warren said. “I heard more than once from Senate and House staffers that they had proposed scrapping it in return for some other concession that they cared more about.” Of Mr. Obama, she said: “I never worried about the president. I was worried about his advisers.” Mr. Obama remained forcefully supportive and senior officials at the Treasury Department helped negotiate the shape of the bureau at every stage. In the House, Ms. Warren blessed deals struck by Mr. Frank, including one exempting banks with less than $10 billion in assets from certain new regulatory requirements. The concession was intended to win over an influential trade group, the Independent Community Bankers of America, and its chief lobbyist, Cam Fine. The arrangement dismayed the left — until Ms. Warren endorsed it. “She was very realistic,” Mr. Frank said. “She was deeply engaged in talking to members and she did acquire her own sense of what was politically doable.” Ms. Warren had less influence in the Senate, where Democrats held the majority but their ability to break a filibuster hinged on centrist legislators. So Ms. Warren turned her attention beyond the chamber, rallying activists and talking to the media. In her most provocative move, she told HuffPost that the Senate must either create a “strong consumer agency” or have “no agency at all and plenty of blood and teeth left on the floor.” “That,” Ms. Warren said recently, “is the outsider’s game.” The Senate ultimately approved a bureau that was stronger in some ways than Ms. Warren’s 2007 proposal. Instead of a Financial Products Safety Commission, led by committee, it would be the Consumer Financial Protection Bureau, headed by a single director. And it would draw funding from the Federal Reserve, putting its budget beyond reach of adversaries in Congress. Ms. Warren attended the July 2010 ceremony where Mr. Obama signed the Dodd-Frank bill into law, and with it a consumer bureau that he asked her to help set up. He designated her an aide to himself and to Mr. Geithner, with a mandate to build the regulator she had devised on paper in 2007. There was no promise she would become the permanent director. If Ms. Warren had won a landmark policy victory, it came at the cost of making enemies in Congress and the administration. While Mr. Geithner would criticize business groups for opposing the consumer bureau in a 2014 book, he also cast Ms. Warren as an implacable critic of the bank rescue, more focused on “made-for-YouTube” grandstanding than on crafting practical ideas. He and Mr. Summers described her in White House meetings as unreasonably hostile to financial institutions, and as simply unreasonable. “You cannot play the role she was playing without making people mad at you,” said former Representative Brad Miller, a North Carolina Democrat involved in drafting Dodd-Frank. He said of the Obama economic team, “Those were folks who were used to getting their own way and not having to deal with critics at all.” Mr. Geithner, now president of the private equity firm Warburg Pincus, declined through a spokeswoman to be interviewed. Mr. Summers, who has criticized some of Ms. Warren’s 2020 campaign proposals, did not respond to interview requests. But Ms. Warren at times unnerved others in the administration. In a 2015 memoir, Mr. Axelrod wrote that Mr. Obama grew frustrated in 2010 with Ms. Warren’s assertive efforts to position herself to become director — a possibility he feared would enrage banks and doom the Dodd-Frank bill. “Tell her to keep her mouth shut,” Mr. Obama said, according to Mr. Axelrod’s book. “She may well be the choice, but we can’t surface that now.” In the spring of 2011, Mr. Fine, the lobbyist for community banks, got a call from Ms. Jarrett. If the White House selected Ms. Warren to lead the consumer bureau, she asked, would he fight for her confirmation? Mr. Fine said he would. A few days later, Ms. Warren told Mr. Fine over lunch in downtown Washington that the White House had decided against nominating her. “I said: ‘That’s just not right. Do you want me to start a campaign? Do you want me to demand a meeting over at the White House?’” said Mr. Fine, whose offers Ms. Warren declined. “She put on a brave face.” For Ms. Warren, this setback came at the end of a whirlwind year setting up the bureau. Since Dodd-Frank became law, Ms. Warren had traveled widely and hired aggressively. Eager to show her organization was at work, she demanded swift, visible actions, like the creation of a complaint hotline with a public catalog of Americans’ grievances against banks and other lenders. Her recruitment efforts had established the bureau as a political force, as well as a legal one. The staff swelled, and weekly meetings shifted from a modest conference room to an elevator-studded lobby. In a pair of public-relations coups, Ms. Warren asked Holly Petraeus, a Better Business Bureau official married to a renowned general, to lead the Office of Servicemember Affairs, and enlisted Mr. Cordray, the outgoing attorney general of Ohio, to lead her enforcement division. “As she put it to me: It’s a chance to do on a nationwide basis what you’re doing in Ohio, with more tools, more authority to pursue the banks,” Mr. Cordray said, recalling Ms. Warren’s pitch. It was a chance, in other words, to wield great power. But Ms. Warren would soon learn that hers was borrowed power — power delegated by the president, and for only a year. By the spring of 2011, the opposition to Ms. Warren becoming permanent director was unbending. Republican senators said they would never confirm her; so did Senator Ben Nelson of Nebraska, a conservative Democrat. Mr. Nelson, who is supporting Mr. Biden in the Democratic primary, said in an interview that he worried about empowering someone he saw as a champion of “runaway government.” “I was very concerned about somebody who had been such a strong advocate for a government bureau that had virtually no control,” Mr. Nelson said. Mr. Reid said Republican opposition sealed Ms. Warren’s fate. “The Republicans stopped her from getting that job,” he said. “That was her job.” Among some of Ms. Warren’s allies, frustration lingers about what happened in 2011. They blame not just Republicans, but also her rivals in the Obama administration and a harsh strain of sexism directed at her by political opponents and the media. “Men never get this adjective, ‘strident.’ That bothers me, because I don’t think she is,” Ms. Petraeus said. “Yes, she’s passionate. She doesn’t hesitate to call somebody out, especially on the Hill, if they’re trying to serve up a bunch of double-dealing nonsense.” Sheila Bair, a Warren ally who was then at the head of the Federal Deposit Insurance Corporation, said she had been angry to learn the White House was leaning against nominating Ms. Warren. Her detractors in the administration, Ms. Bair said, had been “whispering behind the scenes that she couldn’t get confirmed.” “Even if that is true, fight it out,” Ms. Bair said. In the end, Mr. Obama concluded Mr. Cordray stood a better chance of clearing the Senate. Republicans would stonewall his nomination until 2013. It was Ms. Jarrett who called to inform Ms. Warren. She also suggested an alternative path forward: running for Senate. “She was not overly enthusiastic in our first call, because she never saw herself as a politician,” Ms. Jarrett said, “and I said I thought that’s the reason she’d be perfect for the job.” Others in the administration, including Mr. Geithner’s aides, saw the Senate race as a way to get Ms. Warren out of the executive branch. Mr. Miller, the former congressman, said he emailed Ms. Warren to warn that her critics might be trying to lure her “into a race that she could not win.” But in September 2011, Ms. Warren entered the race against Senator Scott P. Brown of Massachusetts, starting down a path that has led with improbable speed to a presidential campaign. Her candidacy today resembles a vastly enlarged version of the movement that gave rise to the consumer bureau. In a campaign framed as a crusade of ideas, Ms. Warren has vowed to restructure the economy as president using the same methods that helped make her imagined agency a real structure of concrete and glass. It is not lost on Ms. Warren that, had she become the director, it is unlikely she would be a leading presidential candidate now. “I would have stayed,” she said, “and done it forever.”",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Elizabeth Warren Continues to Persist",
      "url": "https://www.nytimes.com/2019/09/10/opinion/warren-trump-2020-election.html?searchResultPosition=12",
      "subtitle": "But does she have Trump’s number? And what is going on with him anyway?",
      "author": "Gail Collins",
      "content": "  Bret Stephens: Hi, Gail. Did you read our friend Frank Bruni’s column this past weekend? It’s one of the most thought-provoking articles I’ve read in a while about the likely shape of the 2020 race, and it contains this fascinating nugget: “19 Republicans in Congress have already announced that they won’t seek another term in their current office,” and most of them are just retiring from politics altogether instead of seeking a higher office. Frank calls them “bellwethers” and suggests that Republicans “are limping toward a disastrous Election Day.” Do you draw the same conclusion? Gail Collins: Definitely agree it was a fascinating column. It certainly cheered me up, but I want to hear a little more about your take. I know you’d do anything to see Trump defeated. (Well, almost anything. We will have to return to your refusal to consider voting for Elizabeth Warren.) But are you rooting for a Democratic Congress in 2020, too? You live in Jerry Nadler’s district, right? Will you be voting for him to keep running the House Judiciary Committee? Bret: Ideally I want a Democrat in the White House and Republican control of the Senate — or the Senate and House together if the next Democratic president leans too far left. Divided government is one of the blessings of the American system. Let Nadler try to impeach in the House and wiser heads in the Senate save us from President Pence. Gail: Remember the olden days when senators were just into making deals? I used to complain about their lack of passion. Boy, do I miss lack of passion. As things stand now, if we have a Democratic president and House, a Republican majority in the Senate would just devote itself to perpetual obstruction. Plus remember — the way the Senate rules work, even minority leader Mitch McConnell would still have plenty of power to hold everything up for ransom. Bret: I think Frank’s column definitely points to further Republican losses in Congress. But I’m not at all sure whether that will translate to a Democratic victory for the presidency. I’ve lost hope that Pete Buttigieg can win the nomination, and I’m pretty sure that Kamala Harris and Bernie Sanders can’t. So that leaves the Democratic race coming down to a race between Warren and Joe Biden — that is, between a blade most Americans may find too sharp and one they fear is too dull. Gail: You may notice that Biden, Warren and Sanders are the three candidates the voters are familiar with. It’s so hard to come out of relative obscurity and get the kind of attention and confidence you’d need to win a presidential nomination. Barack Obama did it, but he was an extraordinary campaigner — and of course there was the excitement of having the first black president. Donald Trump did it, but he was a reality TV star. I don’t know if even in the age of round-the-clock social media anybody from the real world could pull off that kind of leap to fame. Bret: It’s a shame because I think the Democratic field has some first-rate talents who could beat Trump, but that the party has just discounted, at least so far: Michael Bennet, Steve Bullock, Amy Klobuchar. What is it about them that just doesn’t excite the base? Gail: Think back on the Obama comparison. People used to faint at his rallies, they were so excited. The names you mentioned are all fine people with good ideas, but I wouldn’t call any of them electric. Bret: True, though you have to love Michael Bennet’s latest campaign pledge: “If you elect me president, I promise you won’t have to think about me for two weeks at a time.” Lord, give me a president like that. Gail: Speaking of, um, electric — let’s move on to shocking. Which do you think will hurt Trump more, the fact that he played golf while Americans were being threatened by a terrible hurricane or the fact that he doctored the weather map to make it look as if he was actually right about the storm going to Alabama? Bret: Remember when he used to slam President Obama for playing too much golf? Go on …. Gail: Both of those worry me more than his much larger recent bad decisions because they go beyond bad judgment to a kind of egomaniacal delusion. Where’s the most obscure dictatorship in the world? I’ll bet even there the head man wouldn’t go on TV to show the country a map that looked like it had been doctored by an overreaching third-grade-geography student. Is it too much to wish for a president who’s at least capable of competent forgery? Bret: You know, if you squint hard, the Trump presidency could be a darkly comic TV show: Imagine “House of Cards,” but with Steve Martin or Rowan Atkinson in the role of President Underwood. Alternatively, perhaps the more accurate comparison might be to the sequel to the Stephen King horror flick, “It Chapter Two.” I’ve been thinking about this a lot lately in terms of our approach to the rest of the world. Protesters in Hong Kong are waving American flags, singing “The Star-Spangled Banner,” and imploring Trump to stand up on their behalf. But the administration has basically been mute. We were about to pull the plug on Afghanistan until some last-minute disagreements snagged our withdraw-and-surrender deal. But Trump appears to be perfectly indifferent to what the return of the Taliban would mean to the Afghan people, particularly Afghan women. And then there’s the news that the administration is mulling a plan to slash the number of refugees we take in each year. I’m the son of a refugee. My patriotism is deeply tied to my gratitude for a country that took in my impoverished mother and grandmother when they had no other country and no other place to go. The thought that the administration wants to deny the chance they gave my mom to thousands of similarly stateless people today makes me feel physically ill. Gail: Bret, that was so beautifully said that I am going to give you a break and not ask you if this means you’ll vote for Elizabeth Warren if she’s the nominee. Bret: At this point, she’s almost tempting me, on the theory that an empty wallet beats an upset stomach. Gail: Let’s end as cheerfully as we began. Hey, it’s football season and although I had no interest whatsoever in football until Trump was elected president, I’m now finding it a relief to talk about something other than politics. So how about those Patriots? Bret: I sometimes have the feeling that if we conversed more about football than about politics, we might also disagree more. The Patriots are loathsome. Ninety-five percent of America hates them, with excellent reason, and Bernie Sanders probably roots for them, which means they must be Communists. Also, Tom Brady’s an overrated quarterback; the most he’s good for is as a volleyball extra in the next “Top Gun” movie. Now the Seahawks, however ….",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Elizabeth Warren’s Formidable Stride",
      "url": "https://www.nytimes.com/2019/09/13/opinion/last-night-democratic-debate.html?searchResultPosition=11",
      "subtitle": "She comes out of the latest Democratic debate stronger than ever.",
      "author": "Frank Bruni",
      "content": " Elizabeth Warren didn’t have her best debate on Thursday night, nor was she the most poetic or passionate candidate on that overcrowded stage. Beto O’Rourke, describing the toll of gun violence, forged a moment more moving than any of hers. Cory Booker had better one-liners. Pete Buttigieg’s beautifully shaped final answer put hers, delivered minutes earlier, almost immediately out of mind. But she demonstrated precisely why she has been on an upward trajectory in the race for the Democratic presidential nomination and why that arc won’t be interrupted anytime soon. She showed how canny she can be. How cunning. Criticism came her way, and she brushed it off like so much lint. And she was evasive — not a noble quality but an essential one when you’re running for office. Idealism puts you in play. Slipperiness gets you the prize. [Get a more personal take on politics, newsmakers and more with Frank Bruni’s exclusive commentary every week. Sign up for his newsletter.] I’ll come back to that last observation, but first: Afghanistan. Warren’s reputation isn’t staked on foreign-policy expertise. She focuses more on domestic issues than on international ones. But when she was asked whether she would pull remaining American troops out of Afghanistan no matter the state of the conflict there, she emphatically said yes, then gave an explanation that was its own miniature master class in political communication. She established authority by noting that she had traveled there — in the company of Senator John McCain, no less — and that she had grilled and listened hard to generals from her perch on the Senate’s Armed Services Committee. She framed her misgivings about this particular military engagement in accessible, even folksy terms, saying that she would repeatedly ask military leaders “what winning looks like” and “no one can describe it.” Then came the finishing touch, which made clear that hers wasn’t merely the perspective of some disconnected politician and that plenty in her background overlaps with the experiences of less powerful Americans. “I have three older brothers who all served in the military,” she said. “I understand firsthand the kind of commitment they have made. They will do anything we ask them to do. But we cannot ask them to solve problems that they alone cannot solve.” Now that’s an answer. And that’s why Warren will move on from this debate in strong form. Will Joe Biden? I think so, at least for now. He may even benefit from having been the object of a nasty attack by Julián Castro, who all but accused him of suffering from dementia. The two of them were quarreling over Biden’s contradictory turns of phrase about his health care plan, a hazy quasi-discrepancy that Castro decided to treat as a referendum on Biden’s very cognition. “Are you forgetting what you said two minutes ago?” Castro asked, as if wielding some hybrid of stethoscope and saber. Then, again: “Are you forgetting already what you said just two minutes ago? I mean, I can’t believe that you said two minutes ago that they had to buy in and now you’re saying they don’t have to buy in. You’re forgetting that.” It was gratuitous: Democratic voters can make their own judgments about Biden’s manner of speaking, which has long been sloppy and meandering, if not quite to this extent. Castro’s pointing it out wasn’t illuminating. It was just plain crude. Buttigieg indicated as much, smartly but a tad too theatrically. “This is why presidential debates are becoming unwatchable,” he said. “This reminds everybody of what they cannot stand about Washington, scoring points against each other, poking at each other.” “Yeah, that’s called the Democratic primary election, Pete,” Castro responded as he quickly developed a knack for condescension and sank deeper into his hole. “That’s called an election.” True enough, but I doubt that Castro’s campaign will be making and selling T-shirts with the phrase. I also doubt that anyone’s fortunes will change much as a result of the debate, though some of the candidates were more appealing and compelling than others. O’Rourke found a fight and fire that had been missing since his star-making Senate campaign. Buttigieg proved again that he knows what distinguishes him in this field of contenders and how to allude to those qualities in any and every riff. If you finished watching the debate and didn’t realize that he was the youngest candidate on the stage and the only military veteran and gay, then you probably also didn’t register how funny Kamala Harris finds herself, which is to say that Castro would have legitimate issues with your level of awareness. Something weird has happened to Harris: She has gone from smoothly generating electric moments — on the Senate Judiciary Committee, at the first Democratic presidential debate — to contriving them, so that they have no glow or sizzle at all. I want to root for her but she just won’t let me. Perhaps the most important figure on the stage was Amy Klobuchar, by which I mean that she most readily accepted and aggressively played the necessary role of suggesting that the most progressive proposals — namely, Medicare for All, backed by both Warren and Bernie Sanders — existed in the realm not of the doable but of the dream-able, and that they weren’t going to fix needy Americans’ lives anytime soon. “When it comes to our health care and when it comes to our premiums, I go with the doctor’s creed, which is, do no harm,” she said. Then, referring to Sanders’s Medicare for All legislation, she added: “While Bernie wrote the bill, I read the bill. And on page eight — on page eight of the bill — it says that we will no longer have private insurance as we know it. And that means that 149 million Americans will no longer be able to have their current insurance.” “ I don’t think that’s a bold idea,\" she concluded. “I think it’s a bad idea.” Don’t expect her to get any traction, though. She’s campaigning — admirably — in the realm of the doable. The dream-able is always going to be more vivid and romantic, and that’s where Warren dwells. I worry lots about how Warren’s grandly liberal plans would play in a general election, but I’m impressed by her increasingly skillful navigation of the Democratic primary. Performance-wise, she’s pulling away from Sanders. He shouts and then shouts louder. She’s hardly quiet, but she has grown better and better at layering in personal anecdotes and dabs of humor, which he has never been any good at. He still favors the word “oligarchic,” as if saying it for the zillionth time will finally make it roll off the tongue. She instead talks of “multinational corporations” and their corrupt chief executives, using more concrete images and language and doing, from a different end of the political spectrum, what Trump did with such effectiveness: identifying a class of villains on whom all of the country’s problems can be blamed. She has learned to sail over and around potentially choppy waters. On Thursday night she spoke of her lifelong passion for education without giving the slightest hint of how much her positions on some education-related issues had changed over time. (She once supported vouchers, for example, but not one of her opponents onstage bothered to bring this up.) She also refused to say whether Medicare for All would require a middle-class tax increase. One of the debate’s moderators, George Stephanopoulos, asked her, and then Biden pressed her, but she never grew flustered and never succumbed, instead stressing repeatedly that in terms of people’s reduced health care costs, they’d be ahead of the game. You could call that deceptive. You could also call it disciplined. I shook my head but tipped my hat. She’ll be in this thing until the end.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Does Elizabeth Warren Have a Critical Vulnerability?",
      "url": "https://www.nytimes.com/2019/09/18/opinion/elizabeth-warren-massachusetts.html?searchResultPosition=10",
      "subtitle": "She has struggled with white, working-class voters like those important to winning Pennsylvania, Michigan and Wisconsin.",
      "author": "Paul Starobin",
      "content": " ORLEANS, Mass. — I have voted two times for Elizabeth Warren to represent Massachusetts in the Senate. I would certainly vote for her for president over Donald Trump. But as the Democratic primary unfolds and she extends a steady rise in the polls, I keep coming back to a political vulnerability of which many followers of Massachusetts politics are aware but others may not be. The problem is that she has a relatively weak standing in Massachusetts with non-college-educated working-class voters, and especially white workers. These voters are critical, especially in the Midwest and in states crucial to Mr. Trump’s victory like Michigan, Pennsylvania and Wisconsin. You might call it the Warren Paradox. Her core message as a politician — that America has become rigged in favor of the very wealthy, and the rich get richer as the rest of us get shafted — is very much aimed at the working class. What’s more, her personal narrative, of her rise from “the ragged edge of the middle class” in her native Oklahoma, as she has put it, to professional success and acclaim in the fields of education and government might seem to embody a character trait of grit that appeals to blue-collar workers. Yet while all of the major Democratic presidential candidates face difficulty with this constituency, polls suggest that this is especially a problem for Ms. Warren. For example, in a Fox survey, she drew 33 percent of white, non-college respondents in a matchup against President Trump, versus 38 percent for Joe Biden and 37 percent for Bernie Sanders. For Democrats to feel fully confident about nominating Ms. Warren as their standard-bearer, she needs to figure out this puzzle. In Massachusetts, the Warren Paradox can be glimpsed in towns like Rockland, population near 18,000, a suburb about 20 miles south of Boston, overwhelmingly white and working class. In her November 2018 Senate race against a pro-Trump Republican, Ms. Warren won 60 percent of the vote statewide but only 44 percent of the vote in Rockland. By contrast, northwest of Boston, in the upscale suburb of Lexington, where the median home value is $1.15 million, (compared with $340,000 in Rockland), Ms. Warren took 74 percent of the vote. On a recent visit to Rockland, I encountered a sentiment that her policies to address economic hardships might actually penalize those who have played by the rules. In a conversation in the parking lot of a McDonald’s, a young mother, after depositing her two children into the back seat of her car, said she viewed as unfair Ms. Warren’s proposal to forgive college student loans for most people carrying such debt. Now a manager at a local restaurant, she said she had attended a technical institute after high school and duly paid off her loans. “Probably,” she told me, she would vote for Mr. Trump for delivering on his promise to create more jobs. I also came across what certainly sounded like, although it was not overtly expressed, reluctance to embracing her because she is a woman. “I can’t even listen to her. I just shut it off” — the television — “when she comes on,” a man at Uptown’s Finest Barbershop told me. In part, Ms. Warren is afflicted by an authenticity problem with these voters. A former Harvard law professor, she is viewed by some, whatever her declared agenda, as typical of an elite that is out of touch with the concerns of ordinary working people. Doubts about her genuineness are nourished by her claim of Native American ancestry — which her detractors in Massachusetts have long framed as a dubious attempt to elevate her career prospects over equally qualified white job candidates. In 2012, Scott Brown, her Republican opponent in her first Senate race, tried to use this issue against her. These misgivings feed a conviction that she doesn’t have Rockland’s back — a belief common to white non-college voters, often held against the Democratic Party in general. “She’ll tax me,” insisted a 49-year-old high school graduate who works at a town agency. (Ms. Warren’s proposed wealth tax targets only households with assets exceeding $50 million.) “She wants to have open borders,” he added, voicing another reason that some people in Rockland think a President Warren won’t protect them. (Like a number of the Democratic presidential candidates, Ms. Warren is in favor of decriminalizing unauthorized border crossings.) And the sense that Ms. Warren, who has voted in Congress for a ban on assault weapons, is soft on gun rights also plays into the notion that she would leave Rockland unprotected. The 49-year-old voted for Mr. Trump in 2016 and fully plans to do so again in 2020, with the “good job” the president is doing on the economy. (After speaking to me, he climbed into a car with a National Rifle Association sticker affixed to the back windshield.) As Ms. Warren’s Senate campaigns attest, she is by no means uniformly unpopular in Rockland or, for that matter, in neighboring communities with a similar socio-economic profile. “I love Elizabeth Warren,” said a welder and member of a plumbers union local, age 68, by phone. “She’s my bulldog. She is 100 percent for us — for the working man, the exploited person, the underdog.” He is from Weymouth, next door to Rockland. “If she were a man, they would love her.” He paused. “Or they would like her more.” As he explained, places like Rockland, on the South Shore of Massachusetts, need to be understood as products of “white flight” from Boston, following court-ordered school busing in the mid-1970s. Should she win the Democratic nomination, it’s easy to see the difficulties she will face in gaining the allegiance of the white working class in a matchup with Mr. Trump. White flight also defines a number of working-class suburbs in the Midwest, as in the metropolitan Detroit region. But even though the Warren Paradox will be a real challenge, she still has the opportunity to impress potentially unreceptive voters with her “bulldog” tenacity, as in her visit this year to a small town in West Virginia to talk about the opioid crisis — a state, 93 percent white, taken by Mr. Trump in 2016 by nearly 42 points. She has also put gut economic issues at the centerpiece of her agenda: For instance, her “Plan for Economic Patriotism,” an industrial-policy tack calling for such steps as “more actively managing” the currency value of the dollar “to promote exports and domestic manufacturing” and a tenfold increase in government spending on job apprenticeship programs, won praise from the Fox News commentator Tucker Carlson. “It’s just pure old-fashioned economics: how to preserve good-paying American jobs,” he told his audience, a form of “economic nationalism.” And to be sure, while white working-class voters get a great deal of attention in battleground states like Michigan, if Democrats can increase turnout among African-American voters in 2020, that would help counterbalance any weakness among white working-class voters. As I was reminded in Rockland, the task of beating Mr. Trump doesn’t require passion for the president’s challenger, whoever that may be. The president, too, arouses a visceral dislike among some people there. One man, a Vietnam veteran who works at the American Legion post in Rockland, screwed up his face at my mention of the president. Among the things he finds unappealing is Mr. Trump’s disdainful posture toward the news media. We chatted about the fractious state of American politics at the Rockland Bar and Grill, as he sipped his Guinness. “If it’s down to Trump and Warren, it’s definitely Warren,” he declared without hesitation. Ms. Warren versus Mr. Trump would be a grind, but that, it might be said, is the story of her life.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Elizabeth Warren Details Her Account of Losing Teaching Job Because of Pregnancy",
      "url": "https://www.nytimes.com/2019/10/08/us/politics/elizabeth-warren-fired-pregnant.html?searchResultPosition=9",
      "subtitle": "Ms. Warren said she had grown more comfortable talking about her experience over the years, explaining why her description of the 1971 episode in her stump speeches differs from how she discussed it in the past.",
      "author": "Thomas Kaplan",
      "content": " WASHINGTON — It is one of Elizabeth Warren’s signature anecdotes in her stump speech: By the end of her first year as a public-school teacher, she was “visibly pregnant,” and the principal wished her luck and hired another teacher to replace her. In recent days, a conservative news site and other outlets have cited evidence that challenges her account, including past remarks by Ms. Warren in which she did not mention being forced to leave the school and minutes from a school board meeting showing that her contract was initially extended for the next school year. Ms. Warren is now pushing back against any suggestion that she has misrepresented the circumstances of her departure, and pointing to the discrimination that many pregnant women have faced on the job. The school board did extend her contract early in her pregnancy, before the school knew about it, she said in an interview with CBS News. But two months later, when it was clear that she was pregnant, she lost the job. “When I was 22 and finishing my first year of teaching, I had an experience millions of women will recognize,” she wrote on Twitter. “By June I was visibly pregnant — and the principal told me the job I’d already been promised for the next year would go to someone else.” She added: “This was 1971, years before Congress outlawed pregnancy discrimination — but we know it still happens in subtle and not-so-subtle ways. We can fight back by telling our stories. I tell mine on the campaign trail, and I hope to hear yours.” Ms. Warren did not name the principal in her tweets. News accounts show that the principal at the time was Edward Pruzinsky. He died in 1999. Ms. Warren has frequently cited her experience with pregnancy discrimination as she has laid out her political biography to voters, explaining why she went from a public-school teaching career into law and eventually politics, and how her professional development was affected by a form of workplace bias that many women encounter. Historically, it was common for American teachers to be pushed out of their jobs during pregnancy, either through termination or the requirement of an unpaid leave of absence. In 1974, the Supreme Court ruled some of these policies unconstitutional. But not all such policies were explicitly written down and tracked, giving many female teachers little legal recourse. CBS News quoted a retired teacher from Ms. Warren’s school, Trudy Randall, who suggested Ms. Warren would have been unwelcome at the school given her pregnancy. “The rule was at five months you had to leave when you were pregnant. Now, if you didn’t tell anybody you were pregnant, and they didn’t know, you could fudge it and try to stay on a little bit longer,” Ms. Randall was quoted as saying. “But they kind of wanted you out if you were pregnant.” At issue are the circumstances that brought to an end Ms. Warren’s brief career as a special needs teacher at an elementary school in Riverdale, N.J., where she worked from 1970 to 1971, when she was just out of college. On the campaign trail, Ms. Warren’s personal story is a central part of her stump speech, beginning with her upbringing in Oklahoma and, eventually, her experience as a teacher. As Ms. Warren tells it, she had wanted to be a teacher since she was in second grade. “I loved that work, and I would probably still be doing that work today, but my story has some more turns,” she told a crowd in Nevada last week. “By the end of the first year, I was visibly pregnant, and the principal did what principals did in those days: wished me luck and hired someone else for the job.” She included a similar account in her 2014 memoir. In some retellings earlier this year, she said the principal “showed me the door.” In a post on Twitter last week, Meagan Day, a writer for the socialist magazine Jacobin, drew attention to an interview Ms. Warren gave in 2007 in which she discussed the end of her career as a public-school teacher and did not describe being forced out because she was pregnant. Ms. Warren recalled going back to school because she lacked the education courses she needed. “I went back to graduate school and took a couple of courses in education and said, ‘I don’t think this is going to work out for me,’” Ms. Warren said in the interview. Addressing the differences in her accounts, Ms. Warren said in a statement to CBS News, “After becoming a public figure I opened up more about different pieces in my life and this was one of them.” On Monday, a conservative website, The Washington Free Beacon, published minutes from meetings of the Riverdale Board of Education that referred to her employment status. Minutes of a meeting on April 21, 1971, show that the board approved the issuance of a contract for Ms. Warren’s second year. “Mrs. Elizabeth Warren — 2 days per week, Speech,” the minutes say. Ms. Warren told CBS News that she had been hiding her pregnancy. “I was pregnant, but nobody knew it,” she said. “And then a couple of months later when I was six months pregnant and it was pretty obvious, the principal called me in, wished me luck and said he was going to hire someone else for the job.” Minutes of another school board meeting on June 16, 1971, say that Ms. Warren’s resignation, effective June 30, “was accepted with regret.” Ms. Warren’s first child, Amelia, was born that September. The Republican National Committee said Tuesday that Ms. Warren had been “caught lying.” Pregnancy discrimination can begin as soon as women reveal they are pregnant, or are visibly showing, and can continue to affect them for years. In physically demanding jobs, pregnant women risk being fired if they ask to take rest breaks, and in the corporate world, women and mothers may be steered away from prestigious assignments or excluded from client meetings if a boss perceives them to be less committed to their work than other employees. Randi Weingarten, the president of the American Federation of Teachers, wrote on Twitter about Ms. Warren’s experience, “This happened to women ALL the time.” Congress passed the Pregnancy Discrimination Act in 1978, which made it illegal to treat pregnant women differently from other people “similar in their ability or inability to work.” But the law did not solve the problem. Employers argued successfully in court that pregnant workers were comparable to people who got injured off the job, and did not deserve to be accommodated. Although many American companies have made efforts to become more welcoming to women and retain mothers, pregnancy discrimination remains widespread. Joan C. Williams, the founding director of the Center for WorkLife Law at the University of California Hastings College of the Law, called it the “strongest form of gender discrimination there is.”",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Elizabeth Warren Campaign Fires Staff Member for ‘Inappropriate Behavior’",
      "url": "https://www.nytimes.com/2019/10/04/us/politics/elizabeth-warren-richard-mcdaniel.html?searchResultPosition=8",
      "subtitle": "Richard McDaniel, Ms. Warren’s national organizing director, was let go from the campaign after it “determined that his reported conduct was inconsistent with its values.”",
      "author": "Astead W. Herndon",
      "content": " Senator Elizabeth Warren of Massachusetts fired her national organizing director after “multiple complaints regarding inappropriate behavior,” according to a statement released Friday by her communications director. The campaign hired the staff member, Richard McDaniel, earlier this year to head the national field operations, a job that involved spearheading the campaign’s organizing structure and outreach programs. The statement by Ms. Warren’s communications director, Kristen Orthman, said senior campaign leadership had received multiple complaints about Mr. McDaniel’s behavior “over the past two weeks.” The decision to fire him came after an investigation conducted by outside counsel. “Based on the results of the investigation, the campaign determined that his reported conduct was inconsistent with its values and that he could not be a part of the campaign moving forward,” Ms. Orthman said. Ms. Orthman declined to elaborate on the nature of the complaints. Politico was first to report that Mr. McDaniel had been dismissed. The news came the same day that the Warren campaign reported having raised $24.6 million in the most recent fund-raising quarter, a total that offered further evidence of Ms. Warren’s steady rise to the top of the Democratic primary field. Mr. McDaniel was a veteran of several Democratic campaigns, most recently serving as a senior campaign aide to Senator Doug Jones, who defeated a Republican challenger in a closely watched special election in Alabama in 2017. Before that, he worked for Hillary Clinton’s 2016 presidential campaign. Reached by phone, Mr. McDaniel said “departing at this time is in the best interest of both parties.” “I would never intentionally engage in any behavior inconsistent with the campaign or my own values,” he said. “If others feel that I have, I understand it is important to listen even when you disagree. I wish the campaign and my colleagues well.” Ms. Warren, speaking to reporters on Friday in Los Angeles after the firing was announced, said that when she started in campaign, she put in place procedures to deal with any complaints, and that process was followed in this case. “It is really hard for anyone to come forward with a complaint or with a concern, and the people who did that showed incredible courage,” she said. When he was hired, Mr. McDaniel's expertise in galvanizing black voters was touted as a boon to Ms. Warren, whose populist brand has so far held more sway in white elite circles than black ones. According to sources familiar with the campaign, there had been discontent with Mr. McDaniel’s job performance even before the complaints regarding his behavior arose.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Elizabeth Warren’s Working-Class Problem",
      "url": "https://www.nytimes.com/2019/09/19/opinion/elizabeth-warren-electability-2020.html?searchResultPosition=7",
      "subtitle": "The biggest question about her surging campaign.",
      "author": "David Leonhardt",
      "content": " This article is part of David Leonhardt’s newsletter. You can sign up here to receive it each weekday. Boston’s North Shore seems as if it should be prime Elizabeth Warren territory. It is home to working-class towns, and it’s a short drive from Warren’s own house. But ever since she entered electoral politics in 2012, she has struggled on the North Shore. When she defeated Scott Brown, the Republican incumbent senator, that year, she lost in places like Haverhill, Peabody, Saugus and Methuen. Last year, when Warren won re-election easily, she performed worse in those towns than Maura Healey, the Democratic attorney general, who was also on the ballot. As Warren has risen to the top of the presidential primary field, her North Shore struggles underscore the biggest question about her campaign: If she were the nominee, could she win back working-class voters who swung to Donald Trump in 2016? There are real reasons for concern. In her 2012 and 2018 Senate races, Warren struggled in other blue-collar parts of Massachusetts, like the areas around Springfield and Worcester. And in most state polls asking voters to choose between Trump and potential Democratic nominees, Warren looks considerably weaker than Joe Biden. She is tied with Trump in Wisconsin, while Biden led by nine percentage points, according to a recent Marquette University poll. In New Hampshire — which borders parts of the North Shore — Biden leads Trump by 10 points, while Warren trails by two, according to an Emerson College poll. “For Democrats to feel fully confident about nominating Ms. Warren as their standard-bearer, she needs to figure out this puzzle,” Paul Starobin, a journalist based in Massachusetts, writes in The Times. After interviewing voters on the South Shore, Starobin considers several possible explanations, including Warren’s gender, her policy proposals, her background as a Harvard professor and her former self-identification as Native American. “Even though the Warren Paradox will be a real challenge,” Starobin concludes, “she still has the opportunity to impress potentially unreceptive voters with her ‘bulldog’ tenacity.” Related I’ve argued before that Warren has an excellent overall agenda for combating wage stagnation and helping the working class, but that her support for mandatory Medicare and border decriminalization is a politically damaging mistake. Jonathan Chait of New York magazine says that Warren’s policy positions are hurting her with swing voters. “She is a compelling orator with a sympathetic life story and a gift for explaining complex ideas in simple terms. Yet she has spent most of the last year positioning herself as if the general election will never happen,” Chait writes. Amanda Litman of the progressive group Run for Something disagrees: “Electability is a punditry scam built on racist & sexist notions of what a ‘politician looks like’ … No one knows anything; go with who inspires you … ” Warren’s working-class issues also matter in the primary. The political journalist Ron Brownstein coined the terms “beer track” and “wine track” to describe two different parts of the Democratic electorate, and the beer candidate (Al Gore, Bill Clinton, Walter Mondale) usually beats the wine candidate (Bill Bradley, Paul Tsongas, Gary Hart). Barack Obama was the exception because he added black voters to the wine track. “Liberal college whites are growing as a share of the Democratic electorate, and Warren, in particular, has shown the potential to become a very strong candidate among them, as demonstrated by the huge crowds she recently drew in the white-collar enclaves of Minneapolis and Seattle,” Brownstein writes for CNN. “But many party strategists remain dubious that Warren — or anyone else — can win by consolidating those voters alone if Biden maintains an edge with the party’s other two biggest blocks: blacks and blue-collar whites.” In the new episode of “The Argument” podcast, Michelle Goldberg, Ross Douthat and I consider a different question: Does Biden’s age create an electability problem for him?",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Elizabeth Warren’s Big Challenge: Winning Black Voters",
      "url": "https://www.nytimes.com/2019/10/06/us/politics/elizabeth-warren-black-voters.html?searchResultPosition=6",
      "subtitle": "African-Americans were essential to Hillary Clinton, Barack Obama and Bill Clinton winning competitive primaries like Ms. Warren faces in 2020. For now, Joe Biden has far deeper support.",
      "author": "Thomas Kaplan",
      "content": " ROCK HILL, S.C. — For her most recent rally in South Carolina, Senator Elizabeth Warren chose Clinton College, a historically black institution in this racially diverse city. Her campaign handed out signs reading, “African Americans With Warren.” And in smaller print: “Black issues are American issues.” But when Ms. Warren looked out at the audience, she saw mostly white faces. The view reflected perhaps her biggest political challenge as she seeks the Democratic presidential nomination: adding black voters to her base of support. African-Americans were critical to Hillary Clinton, Barack Obama and Bill Clinton winning competitive primary contests and capturing the nomination. Like those earlier candidates, Ms. Warren faces multiple rivals who may splinter the electorate this winter, and running up the vote margin in predominantly black areas could once again deliver troves of delegates needed for the nomination. While Ms. Warren is rising in polls thanks to support among liberals, women, young people and college-educated whites, black voters, who are the most essential part of the traditional Democratic coalition, have yet to embrace her in large numbers. “I just think people don’t know her yet,” said Kim Ume, 51, who came to see Ms. Warren in Rock Hill. But Ms. Ume, like some other black admirers here, was hopeful: “All she needs to do is put herself in front of people.” Part of Ms. Warren’s challenge is that her leading rival, former Vice President Joseph R. Biden Jr., appears to have strong support among black Democrats, which could help him in delegate-rich states with heavily black districts like the Carolinas, Texas and Virginia that hold early primaries. (In interviews with black voters in South Carolina recently, President Trump’s attacks on Mr. Biden over Ukraine did not appear to worry them.) Senators Kamala Harris and Cory Booker, the two leading black Democrats in the race, are also courting African-American voters. But more broadly, Ms. Warren is running an ideologically left-wing campaign and basing her appeal on policy proposals more so than longstanding relationships and endorsements. Senator Bernie Sanders ran a similar campaign in 2016 and lost black voters in landslides to Mrs. Clinton, who was better known and had key allies among black leaders, most importantly Mr. Obama. Ms. Warren has several months to build ties, of course, but many black voters measure political relationships in years, not months. “I’ve heard very little about her,” Charles Rodgers, 57, said after leaving a library in downtown Columbia. He said he had not yet paid close attention to the primary race, given the size of the field. The clear deficit with black votes stands out in part because, on so many other fronts, Ms. Warren is excelling. She is now running closely with Mr. Biden in polls in the first two states to vote, Iowa and New Hampshire, where the electorate is overwhelmingly white. She is well positioned to navigate the rushing political waters of impeachment, having called for the House to begin impeachment proceedings as far back as April. And the sizable crowd in Rock Hill, which her campaign put at 1,400, was another sign of the palpable interest in her candidacy. At the same time, the largely white audience was only the latest sign that she still has a long way to go in increasing her support among black voters. Six weeks earlier, when she held a rally in Aiken, S.C., the crowd that turned out was also predominantly white. Asked recently about her limited support among black voters, Ms. Warren refrained from offering a political analysis. Instead, she ticked off a number of policy issues that are important to African-Americans, and that she has plans to address, such as housing and maternal mortality. “The way I see this is that African-American women have really been the backbone of the Democratic Party for generations now,” Ms. Warren said as she spoke with reporters. “They get out there and they fight for people. And what I’m doing is showing up and trying to talk to people about why I’m in this fight.” Six in 10 voters in South Carolina’s Democratic primary in 2016 were black, and they favored Mrs. Clinton over Mr. Sanders by 72 percentage points, according to exit polls. This time, it is Mr. Biden who is counting on black voters to propel him to a victory in South Carolina, the fourth state to hold a nominating contest in 2020. In a CNN poll released last week, Mr. Biden was supported by 37 percent of likely voters in South Carolina over all, followed by Ms. Warren with 16 percent. Among white voters in the state, they were neck-and-neck, at 29 percent and 28 percent, respectively. But Ms. Warren was all but invisible among black voters: Mr. Biden was supported by 45 percent, compared with just 4 percent for Ms. Warren. A Fox News poll released on Sunday and a Winthrop University poll released last week painted similar pictures of Mr. Biden far ahead of Ms. Warren among black voters in the state. A national poll released by Quinnipiac University last month offered a brighter outlook for Ms. Warren: It found her at 19 percent among black voters, an improvement of nine percentage points from a poll conducted a month earlier. Interviews with black voters at Ms. Warren’s rally in Rock Hill and elsewhere in South Carolina showed the steepness of the challenge she faces in spreading the word about her candidacy — but also the enthusiasm she generates among voters whom she has been able to reach. After attending worship services at Zion Baptist Church in downtown Columbia on a recent Sunday, Ty Washington, 66, said he favored Mr. Biden, citing his experience and his time in the Obama administration. He was not drawn to Ms. Warren in the same way. “I like her ideas, but she doesn’t come across as strong to me,” he said. “And it’s not her being a woman, because I can deal with women rulers. It’s something about her that just does not resonate with me, because she speaks well, she talks well, but she doesn’t have that strength that I think we need in a presidential candidate.” Denise Hodges, 63, Mr. Washington’s cousin, also favored Mr. Biden. “I never followed her as close as I’ve been following him,” she said. “Because we’ve been seeing him, we’re used to him, so we’re comfortable.” Asked whom he liked in the 2020 race, the Rev. Israel Gist, 81, an associate minister at the church, quickly offered a name: Mr. Biden. Then he offered another. “What’s her name? Warren?” he said. “She’s coming along pretty well.” But he immediately quickly flagged a concern. “I don’t think pushing ‘Medicare for all’ is a winning strategy,” he said, referring to her support of a single-payer health care system, a key difference between her and Mr. Biden. Part of the challenge facing Ms. Warren is the warm feelings that many black voters have for Mr. Biden after he served two terms as Mr. Obama’s vice president. “I think it’s really hard for candidates like Elizabeth Warren, Cory Booker, Kamala Harris, anybody, when you’re going against Joe Biden, who can drop, ‘Obama, Obama,’ and African-Americans are like, ‘Yes, yes,’” said Jazmine Curenton, 19, who came to a block party for Mr. Booker in Columbia. Mr. Biden’s reputation may be particularly hard for Ms. Warren to overcome among older voters. “I think that there are a lot of younger people who not only are really open to her, but truly like her and truly like what she’s saying,” said Uchechi Kalu, 26, who has canvassed for Ms. Warren’s campaign and attended her event in Rock Hill. “And then there’s an older generation that is sticking to people who are familiar with the Democratic base.” Ms. Warren’s team is counting on her standing to improve as she becomes more familiar to black voters. “What we see is that folks who have an opinion, and have heard of Elizabeth Warren, tend to have a favorable opinion and like her,” Joe Rospars, the Warren campaign’s chief strategist, said in a podcast interview with David Plouffe, who managed Mr. Obama’s 2008 campaign. “What we also see is that people of color are disproportionately likely to not have heard of, and not have an opinion about, Elizabeth Warren.” Ms. Warren is making a concerted effort to build relationships with black leaders. “Every couple of weeks, she’ll call just out of nowhere,” said the Rev. Al Sharpton, who has yet to endorse a candidate. When Mr. Sharpton became a grandfather late last year, Ms. Warren was quick to offer congratulations. And last month, when Mr. Sharpton received an award and gave a speech at the annual Congressional Black Caucus Foundation dinner in Washington, he immediately received a text from Ms. Warren. “She’s the only one that does that,” he said. “Friends of mine didn’t text.” Beyond personal overtures, Ms. Warren is leaning on what has been a defining quality of her campaign: producing policy plan after policy plan on a wide range of subjects. Racial justice is a common thread throughout her proposals. Her housing plan would provide down payment assistance to first-time home buyers who live in formerly redlined neighborhoods. She has a plan to reduce maternal mortality among black women, who die of pregnancy-related causes at a much higher rate than white women. She has a proposal to provide grants to minority entrepreneurs, and her child care plan would raise the wages of child care workers, who are disproportionately women of color. Her higher education plan calls for providing at least $50 billion for historically black colleges and universities as well as minority-serving institutions, and her campaign has made a point of highlighting how her student debt cancellation plan would help narrow the black-white wealth gap in America. Ms. Warren also has a powerful partner for her debt cancellation plan, which is being sponsored in the House by Representative James E. Clyburn of South Carolina, the majority whip and the highest-ranking African-American in Congress. On Wednesday, she will join Mr. Clyburn at a town hall on student debt at his alma mater, South Carolina State University, a historically black college in Orangeburg. “I’ve got a lot of plans,” Ms. Warren said, “and what I want to do is talk to people about all of them.” ",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "As Elizabeth Warren Rises, the G.O.P. Deploys an Old Tactic",
      "url": "https://www.nytimes.com/2019/10/10/us/politics/elizabeth-warren-fired-teaching.html?searchResultPosition=5",
      "subtitle": "Republicans are attacking Ms. Warren over authenticity, a sexist trope in politics, much like they did with Hillary Clinton. Ms. Warren has used those attacks to rally supporters.",
      "author": "Thomas Kaplan",
      "content": " WASHINGTON — President Trump and his allies have struggled for months to come up with effective ways to confront Senator Elizabeth Warren, whose steady rise in the polls put the lie to Mr. Trump’s boasts last spring that she was “finished” and “gone,” undone by her past claims of Native American ancestry. Republicans have tried to brand her as a socialist, attack her policy ideas and portray her as too left-wing for the American electorate. None of those arguments have diminished her political momentum, robust fund-raising or polling. But in the past week, conservative news sites have challenged Ms. Warren’s story about how a public school principal forced her out of a teaching job in 1971 because she was “visibly pregnant,” and the Republican National Committee grabbed onto the issue to wage its own attack. In doing so, Republicans employed a tactic — questioning a female candidate’s authenticity — that is at once often a sexist trope in politics and a strategy used against Hillary Clinton in 2016. Ms. Warren and her team, in turn, have confidently parried those attacks and used them to rally supporters. Rather than take a defensive posture, Ms. Warren has responded by offering her personal story as one of countless instances of pregnancy discrimination that have occurred in American workplaces, where it remains a widespread problem. In a video that has been viewed more than a million times across social media platforms, Ms. Warren read messages from women sharing their own experiences. Christina Reynolds, who was an aide on Mrs. Clinton’s campaign and is now a spokeswoman for EMILY’s List, which supports female Democratic candidates who back abortion rights, said the Warren campaign’s move to solicit stories from people was a better response to the line of attack “than just saying, ‘No, it’s not true.’” “I think it’s a really powerful thing that she’s done,” she said, “which is turn this into a learning opportunity for all of us as to what women have faced at past times, what they might still face and how can we do better.” Well before Ms. Warren’s story about losing her teaching job became the subject of news articles, she was being challenged over how she has presented her biography. Since she first ran for the Senate in 2012, she has faced questions over having identified herself as Native American during her career as a law professor, and she drew a backlash last year when she released a DNA test offering evidence that she had a Native American ancestor. Ms. Warren later apologized in private and in public. An email from the Republican National Committee on Tuesday offered a clear preview of how the party would seek to undermine her if she becomes the Democratic nominee: “It’s not just her heritage Fauxcahontas has been lying about to get ahead,” the subject line said. A spokeswoman for the committee, Liz Harrington, said on Wednesday, “Like her false claim of Native American status, this is another example of Warren seemingly shifting the facts of her life story for personal gain.” (Ms. Warren has said she did not advance her career by identifying herself as Native American, an assertion backed up by an extensive Boston Globe investigation.) “The more examples like this that surface, the more it will stick with voters that this is someone who cannot be trusted,” Ms. Harrington said. Mr. Trump has slurred Ms. Warren for years over her ancestry claims, and the personal attacks on her come out of the Trump playbook from 2016 that targeted both Republicans and Mrs. Clinton. Michael Steel, a Republican strategist who was an adviser for former Gov. Jeb Bush’s 2016 presidential campaign, said Mr. Trump would need to “tear down” whoever is the eventual Democratic nominee in order to win re-election, given his low approval ratings. “One of Senator Warren’s great strengths is her ability to connect her biography to her record to her plans for the future,” he said. “That gets undermined if she can’t rely on her biography as the foundation of that progression.” All year, Ms. Warren has framed her personal story to voters as one of perseverance, focusing on her upbringing in Oklahoma, her family’s financial struggles and her winding path to an eventual career as a law professor. Voters often praise her biographical story as a powerful part of her pitch, which centers on bringing about big change to an economic and political system that she describes as rigged against ordinary people. As part of that story, Ms. Warren tells crowds that at the end of her first year as a public-school teacher, she was “visibly pregnant” and lost her job.  A retired teacher from Ms. Warren’s school in New Jersey told CBS News, “The rule was at five months you had to leave when you were pregnant.” Teachers in the United States were commonly pushed out of their jobs during pregnancy at the time, either through termination or the requirement of an unpaid leave of absence. Congress passed the Pregnancy Discrimination Act in 1978, which barred employers from treating pregnant women differently from other people “similar in their ability or inability to work,” but claims of discrimination persist to this day. “These attacks on Senator Warren are absurd,” said Senator Kirsten Gillibrand of New York, who dropped out of the presidential race in August. “Of course pregnancy discrimination was a serious problem in 1971, and it continues to be a widespread issue today despite a law banning it. The stories that women are sharing are real and powerful.” Regardless, the Republican National Committee dismissed Ms. Warren’s description of losing her job, citing a 2007 interview in which she discussed her public-school teaching career but did not mention being forced out, as well as records showing that the school board had approved a contract for Ms. Warren for the next school year. The records were reported on Monday by The Washington Free Beacon, a conservative website. “Another Elizabeth Warren lie about Elizabeth Warren?” asked Kellyanne Conway, a top aide to Mr. Trump, as she shared The Free Beacon’s article on Twitter. Ms. Warren told CBS News that she had not revealed her pregnancy when the contract was approved, and that two months later, when she was showing, the principal told her that she would not be welcomed back. Addressing the 2007 interview, she said: “After becoming a public figure I opened up more about different pieces in my life and this was one of them.” The attacks are the latest evidence of how Republicans are reviving tactics Mr. Trump used to caricature Mrs. Clinton, whom he branded as “Crooked Hillary,” as dishonest. Attacking authenticity has been a common strategy targeting women running for office for decades: Long before Mrs. Clinton, Geraldine Ferraro faced it in 1984, when she was the first woman to appear on a major party’s presidential ticket. “This is a tried and true tactic when it comes to women candidates and elected officials, because women pay a much higher price when their honesty and integrity is called into question,” said Amanda Hunter, research and communications director at the Barbara Lee Family Foundation, which supports women in politics. “Our research shows that voters historically give women what we call a virtue advantage, but then the other side of that is they punish them for any real or manufactured ethical infraction,” she said. “And once women are knocked off that pedestal, it’s a lot more difficult for them to climb all the way back up.” Debbie Walsh, the director of the Center for American Women and Politics at Rutgers University, said the broadsides against Ms. Warren reflected her increasing status as a front-runner for the Democratic nomination. “They’re going to come for her in every possible way that they can, and her honesty and truthfulness will be one tactic,” she said. “We certainly saw this as a tactic when Hillary Clinton was running, to constantly question her veracity.” Ms. Walsh said she thought Ms. Warren’s story of experiencing pregnancy discrimination would “make her relatable for an awful lot of women out there who understand that this has been how the world works.” Ms. Warren’s campaign demonstrated readiness for the attacks as news outlets began publishing articles in recent days about her public-school teaching career and pregnancy. Ms. Warren spoke with CBS News to go into greater detail about her story, and she and her campaign sought to shift the focus onto the broader issue of pregnancy discrimination. Her admirers praised her on social media and others offered support, including some rivals in the 2020 race, a sign of the protectiveness that many Democrats feel toward their candidates in the face of Republican attacks. Jennifer Palmieri, who was the communications director for Mrs. Clinton’s 2016 campaign, noted the extent of that unity around Ms. Warren. “This could have been something that really got pounced on by her opponents,” she said, “and that didn’t happen.”",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "How Elizabeth Warren Responded to Mark Zuckerberg’s Criticism, on Twitter",
      "url": "https://www.nytimes.com/2019/10/02/us/mark-zuckerberg-elizabeth-warren.html?searchResultPosition=4",
      "subtitle": "Wednesday: Mark Zuckerberg rails against Facebook’s critics and Senator Elizabeth Warren. Also: A decision in the Harvard admissions case, and a songstress on the L.A. Metro.",
      "author": "Inyoung Kang",
      "content": " Good morning.  On Tuesday, months after Senator Elizabeth Warren of Massachusetts first unveiled her proposal to break up Facebook and other tech giants, The Verge published highlights from two hours of leaked audio in which Mark Zuckerberg railed against Facebook critics, competitors and Ms. Warren. Our political correspondent Matt Stevens covered Ms. Warren’s response to the remarks: Remember that giant billboard near the Caltrain station in San Francisco? The one with Senator Elizabeth Warren’s face on it? The one that said in all capital letters: “BREAK UP BIG TECH”? With Ms. Warren seeking the Democratic nomination for president, her campaign put up that billboard over the summer after she rolled out her plans to regulate the tech industry. One needs only to look to the billboard for evidence that she wanted to make very sure tech workers got her message. On Tuesday we learned that, yes, in fact, they did get the memo — and that at least one of Silicon Valley’s power players is not a fan. “If she gets elected president, then I would bet that we will have a legal challenge, and I would bet that we will win the legal challenge,” Mark Zuckerberg, Facebook’s chief executive, said of Ms. Warren and her plan, according to leaked recordings of comments he made to Facebook employees. “Does that still suck for us? Yeah. I mean, I don’t want to have a major lawsuit against our own government. That’s not like the position you want to be in. We care about our country and want to work with our government to do good things,” he added. “But look, at the end of the day, if someone’s going to try to threaten something that existential, you go to the mat and you fight.” Ms. Warren has built her campaign around a call for “big, structural change” and has garnered significant support by releasing a series of detailed policy proposals like the one on how she would break up giant tech companies. Shortly after The Verge published Mr. Zuckerberg’s remarks, Ms. Warren responded on Twitter. And she did not mince words. “What would really ‘suck,’” she said, mimicking Mr. Zuckerberg’s language, “is if we don’t fix a corrupt system that lets giant companies like Facebook engage in illegal anticompetitive practices, stomp on consumer privacy rights, and repeatedly fumble their responsibility to protect our democracy.” The exchanges didn’t end there. Mr. Zuckerberg commented on the situation later on Tuesday in a Facebook post, and Ms. Warren again took to Twitter, firing off a five-tweet thread that began: “Let’s talk a bit about my plan to #BreakUpBigTech and why it’s got Mark Zuckerberg so worked up.” The episode had the effect of publicly pitting one of the leading Democratic presidential candidates against the chief executive of the world’s largest social network. That’s something you don’t see every day. We often link to sites that limit access for nonsubscribers. We appreciate your reading Times coverage, but we also encourage you to support local news if you can. Her hair is pulled into pigtails, and she carries shopping bags and a cart full of her belongings. As she sings a Puccini aria, her stage is the Wilshire-Normandie Metro station in Los Angeles. A video posted on Thursday to the L.A.P.D.’s Twitter account showed the homeless singer’s performance. “4 million people call LA home. 4 million stories. 4 million voices … sometimes you just have to stop and listen to one, to hear something beautiful,” the post read. The video went viral, racking up more than 900,000 views. ABC7 identified the songstress as Emily Zamourka, 52, who said she learned to sing as a child growing up in Russia. She said she became homeless after her violin was stolen while she performed in downtown L.A. Hundreds of people have since donated to online fund-raisers to help Ms. Zamourka, The Washington Post reported. And Councilman Joe Buscaino invited her to perform at the unveiling of the city’s new Little Italy district this weekend. “I’ve seen her for years on the Metro,” one Twitter user wrote. “I don’t know why she’s been homeless all these years, but she’s a human being … that’s all that matters.” California Today goes live at 6:30 a.m. Pacific time weekdays. Tell us what you want to see: CAtoday@nytimes.com. Were you forwarded this email? Sign up for California Today here. California Today is edited by Julie Bloom, who grew up in Los Angeles and graduated from U.C. Berkeley.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Missing From Elizabeth Warren’s 2020 Surge: Democratic Endorsements",
      "url": "https://www.nytimes.com/2019/10/14/us/politics/elizabeth-warren-endorsements-.html?searchResultPosition=3",
      "subtitle": "Despite Ms. Warren’s upward momentum in polls and fund-raising, she lacks the support of a single governor, big-city mayor or fellow senator outside Massachusetts.",
      "author": "Jonathan Martin",
      "content": " WASHINGTON — Senator Elizabeth Warren has built her following in part by taking pictures with thousands of voters deep into evening after campaign events, but her dinner audience here one night last month was far smaller. And Ms. Warren’s guests were more interested in hearing, and politely challenging, her campaign pitch than eagerly capturing the moment for posterity on their iPhones. Addressing a few dozen members of the Congressional Progressive Caucus at a Chinese restaurant a few blocks from the Capitol, she laid out her case for why she could unify Democrats, emphasized that she was not hostile to properly run businesses and made a soft sell to the lawmakers to support her presidential bid. “She said, ‘Nobody could do this alone, I will need your help,’” recalled Representative Chellie Pingree of Maine, who attended the gathering and said Ms. Warren “was great.” But just under a month since the family-style meal, the Massachusetts senator has the same small number of endorsements from congressional colleagues beyond her home state as she did beforehand: three. Ms. Warren is expected to reveal additional support from Democratic officials this week in conjunction with Tuesday’s CNN/New York Times debate and the release of her smashing third-quarter financial disclosure. Yet her growing crowd sizes, soaring fund-raising and surge to the top of a number of national and early-state polls only shine a brighter light on one of the most revealing elements of this primary: the widening gap between the preferences of many Democratic voters and the lawmakers who represent them. Ms. Warren is now a clear front-runner in the race for her party’s nomination, yet just under four months before the leadoff Iowa caucuses she lacks the support of a single governor, big-city mayor or fellow senator outside Massachusetts. She does have the backing of the Working Families Party, an influential liberal group, and yet she also has fewer total endorsements from state legislators in Iowa and New Hampshire than Senator Cory Booker, who registers in the lower single-digits of surveys and last month had to beseech donors to give him enough money to sustain his stagnant campaign. The apparent lag between Democratic activists and Democratic elected officials, which comes nearly four years after President Trump’s stunning outsider’s capture of the Republican nomination and Senator Bernie Sanders’ surprisingly potent candidacy in the Democratic primaries, has done little to slow Ms. Warren’s momentum. Yet the reluctance of Democratic lawmakers to embrace Ms. Warren’s campaign this deep into the year, after she has plainly emerged as a leading candidate, illustrates both the lingering reservations party elites have about her general election prospects and her unique positioning in this race. “Racing to the left is not really speaking to the needs of people in the heartland,” said Chicago Mayor Lori Lightfoot, who expressed alarm about scrapping private health insurance, urged the candidates to focus on “pocketbook issues” and, when asked if Ms. Warren could reclaim the Midwestern states Mr. Trump captured in 2016, paused before saying: “I’m not sure.” Ms. Warren is politically neither fish nor fowl. She is not an anti-establishment insurgent in the style of Mr. Sanders, who were he in the position Ms. Warren is now would almost certainly have inspired a Stop Bernie campaign funded by a petrified donor class. But with her refusal to raise money among rich contributors, her unabashed populism and her pre-Senate roots in academia, she is hardly a Clinton-style creature of the Democratic political class. As a result, many party officials are neither rushing to oppose her nor racing to her side, instead staying on the sidelines and doing what politicians often do when they are uncertain of what choice to make: buying time. “It’s easier to wait, you keep your relationships good,” said Representative Deb Haaland of New Mexico, one of the few lawmakers who is supporting Ms. Warren, noting that some of her colleagues are loath to offend their friends in the race by choosing a candidate. Reinforcing this instinct toward caution is the fluid nature of a primary still large enough to feature 12 candidates on the debate stage this week as well as the high stakes of next year’s general election. “You had two candidates last time,” said longtime Representative Rosa DeLauro of Connecticut, referring to the Sanders-versus-Hillary Clinton race. “People want to see this unfold.” Thanks to his decades-long relationships and the perception in some quarters that he would be a strong candidate against Mr. Trump, Joseph R. Biden Jr. has picked up the most support from Democratic lawmakers of any of the presidential hopefuls. But his uneven performance as a candidate this year and Mr. Trump’s daily barrage of attacks on him have left some party officials wondering just how safe a pick he is in 2020. “People are concerned about Joe, but they ask: Is Elizabeth electable?” said former Senator Heidi Heitkamp of North Dakota, explaining the dilemma. “So a lot of people are just keeping their powder dry because they have not decided who can best run against Trump.” Defeating a president who may be the first incumbent to seek re-election after being impeached should be the party’s overriding focus, said Gov. J.B. Pritzker of Illinois. “I genuinely feel our republic is in danger,” Mr. Pritzker said. A longtime donor who often immersed himself in primaries before he entered politics, Mr. Pritzker said he was staying out of this race for the time being in part because he was still stung by 2016, when some of Mr. Sanders’s supporters protested what they saw as his mistreatment by Mrs. Clinton and her establishment-aligned supporters. “When he didn’t win people folded their arms and stayed home or they voted for Jill Stein or Gary Johnson,” said Mr. Pritzker, alluding to two of the third-party candidates whose votes helped cost Mrs. Clinton the election. He’s not the only Democrat who has the echo of the Sanders-Clinton race still throbbing in their ears nor the only one determined to avoid alienating any of the supporters of this cycle’s candidates. “Many believed the primary was rigged in favor of Hillary Clinton,” Representative Darren Soto of Florida said. “There is a feeling among many of us that we need to have a broad and diverse field, plenty of debates and let the primary voters decide on their own.” What few lawmakers will say, at least publicly, is that wading into the race can also come with a cost: they run the risk of angering the eventual nominee if they support a losing candidate and they also invite complaints from their own constituents or donors, who may have a different preference. What’s more, they also have to be mindful of their own political branding and how they align themselves.  “Politicians are different from voters,” said Donna Brazile, the longtime Democratic strategist and former party chair. “They have to say, ‘How does this fit with my agenda, my district?’” In Ms. Warren’s case, even one of her biggest boosters, Ms. Haaland, conceded it was easier for her to step out early because of the progressive nature of her district. “Some folks they’re just like, ‘I better stay out of it for a while because of my district,’” she said of her House colleagues. And it’s not just lawmakers who are taking a wait-and-see approach. Powerful liberal interest groups, including much of organized labor, are also hanging back, which only prompts the politicians to believe it’s safer to remain mum. “That would make a difference if they came out,” Representative Dina Titus of Nevada said of unions. “They’re all being coy, too.” Ms. Titus said she planned to get behind a candidate later this year, but her state, the third to vote in next year’s primary, illustrates just how many party elites were remaining neutral: Nevada’s governor, two senators, three Democratic House members and longtime boss, former Senator Harry Reid, have all refrained from endorsing a candidate. Representative Jamie Raskin of Maryland said that he had also been “drawn in different directions in this race,” noting that he wanted to make a decision that’s both “passionate and strategic.” But after having lunch in Washington last month with Ms. Warren and her husband, Bruce Mann, Mr. Raskin said he planned on endorsing the senator. “If all she had to her name was senator from Massachusetts she would not be an ideal candidate,” he said, before citing Ms. Warren’s record as a consumer advocate and critic of Washington self-dealing. “As a candidate of public integrity and honesty in government, she has a very powerful story to tell at a time of boundless Republican corruption and lawlessness.” What’s more, Mr. Raskin said, “She made a very eloquent and personal pitch to me.” As for Ms. Pingree, she said she was “watching the wisdom, the perspective of the public” and was eager “to see who people get excited about.” She will also have a chance to gauge the views of her colleagues. When Congress comes back from its recess this week, Ms. Pingree said she and the other House Democrats who live in her Washington high rise planned on having a debate watch party in the building’s common room.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Could Facebook Actually Nuke Elizabeth Warren’s Campaign?",
      "url": "https://www.nytimes.com/2019/10/10/opinion/trump-warren-facebook.html?searchResultPosition=2",
      "subtitle": "Mark Zuckerberg doesn’t need to tip the scales in 2020. His platform will do that naturally.",
      "author": "Charlie Warzel",
      "content": " This week, Facebook is embroiled in a different kind of election interference scandal. The current controversy stems from two separate but related events. The first revolves around leaked audio of Mark Zuckerberg speaking privately to employees at recent town hall meetings, where he called Senator Elizabeth Warren’s plans to break up Facebook an “existential” threat to the company and one he would fight. The second is a recent announcement by Facebook that it is exempting political figures from its policy forbidding spreading misinformation in advertisements (yes, politicians spreading false claims in their ads is just a part of the political conversation, according to Facebook). Both developments have attracted the ire of Warren who, in a series of tweets this week, argued that the public has a right to know how Facebook “intends to use their influence in this election” and implied that Mr. Zuckerberg and Facebook might be intentionally emboldening the Trump campaign by relaxing advertising rules. Fellow Democrats echoed the concerns: Seema Nanda, C.E.O. of the Democratic National Committee, told CNN that the social network’s ad policy “is a serious missed opportunity by Facebook.” At the same time, old fears that the company’s “I Voted” button, which has proved effective at boosting get-out-the-vote efforts, could give an outsize advantage to Mr. Trump are recirculating. But Ms. Warren’s concerns miss a key point about the social network’s roles in elections. Yes, Facebook’s willingness to let politicians lie sets a worrying precedent. And yes, lack of oversight into the platform’s decisions opens up a host of plausible election interference conspiracies. But Facebook’s essential threat to democracy isn’t that Mr. Zuckerberg will intervene on behalf of his preferred candidate — it’s more fundamental than that. Mark Zuckerberg need not intervene, because Facebook, the platform, will do so instinctively. With its algorithmic mandate of engagement over all else, Facebook has redefined what it means to be a good candidate — and provided a distinct natural advantage to those who distort the truth and seek to divide. Few politicians have evidenced this phenomenon better than President Trump, the natural Facebook candidate. He’s light on policy but heavy on the sort of sweeping imagery that translates so easily to memes (some of his memes, like “The Wall,” eventually do become policy). Almost every iteration of his messaging is the type of polarizing content that is candy for Facebook’s algorithms. To its credit, the Trump campaign seemed to intuit the candidate’s symbiotic relationship with Facebook back in late 2015, well before most of us took notice. The campaign spent millions of dollars on advertising as Facebook employed a detailed marketing model called “Test, Learn, Adapt” to plaster the social network with ads. They worked, in large part because of their incendiary content, tailored to stoke fears on divisive issues like immigration. [As technology advances, will it continue to blur the lines between public and private? Sign up for Charlie Warzel’s limited-run newsletter to explore what’s at stake and what you can do about it.] In the Philippines, the autocratic leader Rodrigo Duterte utilized a similar Facebook campaign in 2016 to win the presidency. A Duterte campaign document, obtained by BuzzFeed News and titled “Winning the Social Media Wars of 2016,” detailed how the campaign used Facebook’s algorithms to gin up anger, hope and pride with an onslaught of fake news and incendiary memes. “To fight with limited funds, the campaign must organize a series of dramatic events that stoke these emotions in escalating fashion,” Pompee La Viña, a Duterte supporter and social media director for his 2016 campaign, told BuzzFeed News. Mr. Duterte was lauded by Facebook itself as the “undisputed king of Facebook conversations.” Both the Trump and Duterte campaigns wielded controversy to drive virality. On a platform like Facebook, designed to promote engagement, their behavior creates a vicious cycle: Incendiary content means more reach, which means more effective campaign ads. More effective campaign ads increase the likelihood a campaign will spend more on Facebook ads to fund-raise. A natural Facebook candidate both dominates the news cycle and stokes emotions — which, in turn, increases that person’s ability to raise money. Once campaigns realize that divisive rhetoric pays, the incentive to up the ante with hyperpartisan ads and misinformation grows. And the campaigns have certainly taken notice. “I believe Facebook was a great platform for the president,” Mr. Trump’s 2020 campaign manager, Brad Parscale, told me in 2018 in reference to the platform’s ability to raise money and get supporters out to rallies in the last election. The inverse effect is equally powerful: Just look at the 2020 hopeful Joe Biden. He entered the presidential contest as a big spender on Facebook ads, only to cut back substantially. As Shane Goldmacher reported in The Times last week, the Biden campaign spent just $32,000 on Facebook ads in September, behind almost every Democratic candidate. Strategists suggested the former vice president was seeing few returns on the platform. It’s probably because of his moderate positions and don’t-rock-the-boat campaigning style, which, according to a former Sanders strategist, Keegan Goudiss, “hasn’t thrown the kind of red meat he needs to throw to do well online.” Meanwhile, the Trump campaign spent over $1.5 million for ads in just the past week, some of which featured debunked or misleading claims, according to Popular Information’s Judd Legum. Elizabeth Warren is right that Facebook’s influence and scale are a “serious concern for our democratic process.” There’s plenty of reason to be concerned about its contradictory policies around policing misinformation and to demand increased transparency and accountability. And regarding political campaign ads — which make up only a meager percentage of the company’s gargantuan ad revenue — there’s a compelling case to be made that Facebook should be forced out of the game entirely to counter the spread of divisive, toxic content. But Facebook’s “incredible power,” as Ms. Warren tweeted, has less to do with Facebook’s opaque moderation policy and far more to do with a structural flaw in the platform’s original architecture. Mr. Zuckerberg is worried that the 2020 election could create existential concerns for the company. But the specter of a Warren presidency should concern him less than another possible result of the coming campaign: that his platform self-selects for a specific type of candidate. Just as television favored a new brand of well-coiffed, charismatic and dynamic political figures, Facebook offers a disproportionate advantage to those most likely to stoke negative emotions. Facebook’s algorithm might not be picking which person ends up on the ticket, but it’s providing our most divisive politicians with something nearly as precious: a bottomless pool of attention.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Elizabeth Warren Has Quick Comeback to Gay Marriage Question",
      "url": "https://www.nytimes.com/2019/10/10/us/politics/elizabeth-warren-lgtbq-town-hall.html?searchResultPosition=1",
      "subtitle": "At a Democratic forum focused on L.G.B.T.Q. issues, Ms. Warren was asked what she would say to someone opposed to same-sex marriage.",
      "author": "Thomas Kaplan",
      "content": " WASHINGTON — The campaign trail can bring fraught encounters for a presidential candidate. At a televised forum on L.G.B.T.Q. issues on Thursday, Senator Elizabeth Warren was asked to consider a hypothetical one. Suppose a supporter approached her and said: “Senator, I’m old-fashioned and my faith teaches me that marriage is between one man and one woman.” How would she respond? “Well, I’m going to assume it’s a guy who said that,” Ms. Warren replied. “And I’m going to say, then just marry one woman. I’m cool with that.” The audience laughed and applauded. About 10 seconds passed. “Assuming you can find one,” Ms. Warren added, to the delight of the crowd. Viral moments are coveted in the Democratic primary race, where they can serve as a magnet for online donations and bring much-needed attention to candidates struggling to stand out in a large field. Ms. Warren’s answer appeared likely to turn into one of those moments, even though she is hardly struggling to attract attention to her campaign, having risen in the polls to rival former Vice President Joseph R. Biden Jr. as a leading contender for the Democratic nomination. A video of her response at the forum immediately drew attention on Twitter, and the Warren campaign soon shared the moment on her feed as well. Below is a transcript of the exchange: CHRIS CUOMO: You ready for another question? ELIZABETH WARREN: You bet. CUOMO: All right. Morgan Cox, real estate investment firm in Dallas, Texas. He is the chair of the Human Rights Campaign board of directors. Morgan, thank you. WARREN: All right. Hi, Morgan. MORGAN COX: Chris, thank you so much. Hi, senator, thank you for being here. Let’s say you’re on the campaign trail — WARREN: I have been — COX: And you’re approached — you have been, yes. And a supporter approaches you and says, “Senator, I’m old-fashioned and my faith teaches me that marriage is between one man and one woman.” What is your response? WARREN: Well, I’m going to assume it’s a guy who said that. And I’m going to say, then just marry one woman. I’m cool with that. WARREN: Assuming you can find one.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    }
  ]
}