{
  "articles": [
    {
      "title": "Trump Reaches ‘Phase 1’ Deal With China and Delays Planned Tariffs",
      "url": "https://www.nytimes.com/2019/10/11/business/economy/us-china-trade-deal.html?searchResultPosition=30",
      "subtitle": "null",
      "author": "Ana Swanson",
      "content": " WASHINGTON — President Trump said Friday that the United States had reached an interim deal with China that would forestall a tariff increase slated for next week, providing a temporary détente in a prolonged and economically painful trade war. Mr. Trump, speaking from the Oval Office, said negotiators had reached a “Phase 1” agreement that would take several weeks to write and that both sides could officially sign by November. If completed, the agreement would provide relief to American farmers and businesses that have been battered by the trade war. Mr. Trump said the “substantial” agreement would involve China buying $40 billion to $50 billion worth of American agricultural products annually, along with guidelines on how it manages its currency, the renminbi. It would also strengthen Chinese protections for American intellectual property and give financial services companies more access to China’s market, the president said. In exchange, the United States will not move ahead next week with plans to raise tariffs on $250 billion worth of Chinese goods to 30 percent. The president has not made a final decision on whether to impose an additional round of tariffs on Dec. 15, as he has threatened. The announcement is a sharp turn from Mr. Trump’s posture several weeks ago, when the president — angry over China’s retaliatory tariffs — demanded that American companies stop doing business with China and threatened to tax every toy, shoe and computer from Beijing before the year’s end. The escalation has rattled investors, lawmakers and businesses, which have begun delaying investment and hiring amid continuing uncertainty about the trade war’s trajectory. The economic pain appears to have softened Mr. Trump’s appetite for a fight. On Friday, the president said the two sides would now work on a deal in phases, a reversal from his previous position that he was looking for a “complete” China deal, not an interim agreement. “It’s such a big deal that doing it in sections, in phases, is really better,” Mr. Trump said during a White House meeting with Liu He, China’s vice premier. “So you’ll either have two phases or three phases.” The first phase could be signed when Mr. Trump appears alongside Xi Jinping, his Chinese counterpart, at a meeting of global leaders in Santiago, Chile, in November. The next phase would begin soon after, Mr. Trump said. Despite the announcement, the deal has not been completed, and Steven Mnuchin, the Treasury secretary, said that more work remained, including on the agreements related to currency and access for American financial companies. “We have a fundamental agreement on the key issues,” he said. “But there is a significant amount of work to do.” The deal is far from the type of comprehensive agreement Mr. Trump has been pushing for, and it leaves some of the administration’s biggest concerns about China’s economic practices unresolved. Although exact terms are still under discussion, the details the president announced include some of the concessions that China has previously floated, including purchases of agricultural products and limits on Beijing devaluing its currency to gain a competitive advantage. Still, the agreement, which came during the 13th round of negotiations, will help to defuse trade tensions that have begun inflicting pain on the global economy and bolster business across the Pacific. In his quest to force China to acquiesce to America’s terms, Mr. Trump has already taxed $360 billion worth of Chinese products and had penciled in another round of tariffs on Dec. 15. Stock and commodity prices climbed on Friday as investors anticipated a resolution to the trade spat. The S&P 500 rose 1.1 percent. The technology-heavy Nasdaq composite index rose 1.3 percent. The Russell 2000 index of small capitalization stocks, typically viewed as closely tied to the health of the American domestic economy, rose 1.8 percent. Crude oil prices rose, as did prices for key industrial metals such as copper and iron ore, often looked to as a barometer of the outlook for China’s large industrial economy. Stocks of companies with heavy exposure to China soared. Shares of Deere & Company rose 1.9 percent, while Apple gained 2.7 percent and Wynn Resorts, which generates the bulk of its revenue from casinos in China, surged 6.3 percent. An index of semiconductor companies, which depend on Asian supply chains, gained 2.3 percent. Business groups expressed relief that the negotiations between the United States and China appeared to be making progress after more than a year of sputtering, yet they acknowledged that the agreement fell short of the sweeping deal that Mr. Trump had promised. John Neuffer, the president of the Semiconductor Industry Association, said the deal was “welcome news” for his industry that would give “both sides a chance to get back to the negotiating table to strike a more comprehensive deal.” The initial reaction among Republican lawmakers was cautiously optimistic. Senator Charles E. Grassley of Iowa, the Republican chairman of the Finance Committee, said that any progress was good news, but that Mr. Trump must reach a more substantial deal for the pain of the trade war to have been worthwhile. “After so much has been sacrificed, Americans will settle for nothing less than a full, enforceable and fair deal with China,” Mr. Grassley said. “I look forward to learning more details in the coming days.” Trade experts in China were quick to welcome the deal as a breakthrough. “It the first time since the start of the trade war that negotiators have reached some solid result,” said Cui Fan, a prominent professor of trade policy at the University of International Business and Economics in Beijing. Mr. Trump’s defenders say China’s concessions will generate positive momentum for future talks and result in more business for farmers and manufacturers as they continue to press Beijing for a broader pact to correct longstanding economic abuses. Critics say that the move will go only part way toward resolving a crisis of the president’s own making, and that the trade war will continue to slow the global economy. “Behind the hype, this is nothing more than a partial and ostensibly unsustainable deal lacking in real enforcement mechanism,” said Gregory Daco, the chief United States economist at Oxford Economics. “For businesses, this will mean less damage, not greater certainty.” The interim agreement also does not resolve some of the thorniest issues between the two countries, including whether the United States will continue to label China a currency manipulator and whether it will keep Huawei, the Chinese telecom giant, on a government blacklist. In August, the Treasury Department formally designated China a currency manipulator for the first time since 1994, at the direction of Mr. Trump. The largely symbolic move came amid frustration among American officials that China was counteracting the president’s tariffs by devaluing the renminbi. Mr. Mnuchin said that the United States would decide whether to rescind the designation in a future phase of negotiations. And Robert Lighthizer, Mr. Trump’s top trade negotiator, said the deal did not resolve the fate of Huawei, which is banned from buying American products — much to China’s dismay. “In this agreement we’re not dealing specifically with Huawei,” he said. “It’s not part of this agreement. That’s a separate process.” Mr. Trump and his advisers also did not mention any progress in areas that the American business community has identified as critical to its ability to compete with Chinese companies — including China’s subsidization of industries, the role of the government in the economy and the country’s restrictions on transfers of data across its borders. “Our hope and our aspiration is that they get to those harder issues,” said Myron Brilliant, the head of international affairs at the U.S. Chamber of Commerce. Still, he added that the steps taken this week might create positive momentum toward addressing those issues. “We’ve had nothing but bad news since May in the U.S.-China relationship,” Mr. Brilliant said. “And now we seemed to have put a halt to a further escalation of tensions, and that’s a step in the right direction.” Mr. Lighthizer said that the deal would require China to make structural changes to how it screened food imports and approved new genetically modified products that would allow more American farm goods to flow there. “It will be much easier now for American farmers to be able to ship to China,” he said. “And we’ve made some changes on our side too that will help the Chinese.” The agreement came after Chinese officials shifted their position on the trade talks over the past month, moving from an insistence on a complete removal of American tariffs to a willingness to accept a partial deal that would leave many of those tariffs in place. One important factor in China’s shifting stance involved a severe yet unexpected problem: a genuine need for food imports from the United States. African swine fever has killed an estimated two fifths of China’s pig herd over the past year, producing a sharp increase in pork prices. The need for increased food imports from the United States persuaded the Chinese that both sides could benefit from a partial deal even if it did not involve complete elimination of Mr. Trump’s new tariffs, a person familiar with the talks said. Mr. Trump acknowledged that tensions with China had spiraled as a result of the trade war but said that relations between the two countries were now “a love fest.” “Talk was getting tough,” the president said, adding that both sides had “planes” and “ships” and that “stupid things can happen.”",
      "date": "Oct. 11, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "‘Shame on Him’: Evangelicals Call Out Trump on Syria",
      "url": "https://www.nytimes.com/2019/10/10/us/evangelicals-syria-trump-criticism.html?searchResultPosition=29",
      "subtitle": "Some of the president’s most ardent supporters worry that troop withdrawal threatens religious minorities, especially Christians. They are pushing back, to a point.",
      "author": "Elizabeth Dias",
      "content": " One called President Trump’s decision “an egregious act of betrayal.” Another said the policy could be “the biggest mistake of his presidency.” A third said Mr. Trump “is in danger of losing the mandate of heaven.” Conservative Christians have ardently stood by Mr. Trump at most every turn, from allegations of sexual misconduct to his policy of separating migrant families at the border and the Russia investigation. But this week, some of Mr. Trump’s top evangelical supporters broke rank to raise alarms over his move to withdraw troops from Syria, which prompted Turkish forces to launch a ground and air assault against a Kurdish-led militia that has been a crucial ally in the American fight against ISIS. As Turkish warplanes began to bomb Syrian towns on Wednesday, the prominent evangelist Franklin Graham called for Mr. Trump to reconsider his decision, and worried that the Kurds — and the Christian minorities in the region they have defended — could be annihilated. “We have many friends in the Kurdish areas,” said Mr. Graham, whose humanitarian organization, Samaritan’s Purse, has done relief work in the region. “We know people on the ground.” The concern resonated for many conservative evangelicals who have supported Mr. Trump, and called into question his much-touted commitment to religious freedom, a top value for his base. The opposition has arrived at an inopportune time for the president. The administration is weathering a heated battle with Congress, and according to a Fox News poll, more than half of voters now support the president’s impeachment. Tony Perkins, who leads the Family Research Council, is calling on the administration to actively demonstrate its support for persecuted religious minorities in the aftermath of the withdrawal. “This is inconsistent with what the president has done,” he said. Erick Erickson, a well-known conservative evangelical blogger, wrote on Twitter that Mr. Trump had committed “an egregious act of betrayal” to the Kurds. “Shame on him,” he said. Pat Robertson, founder of the Christian Broadcasting Network, said he was “appalled” by the president’s decision, and added that “the president of the United States is in great danger of losing the mandate of heaven if he permits this to happen.” Senator Lindsey Graham, who rarely breaks with the president, said it could be “the biggest mistake of his presidency.” Current disappointment is unlikely to translate into substantial or lasting opposition. And not all evangelical supporters have taken issue with Mr. Trump’s decision. Robert Jeffress, pastor of First Baptist Dallas and a prominent supporter of Mr. Trump, said he “happily” deferred to the commander in chief, and he praised Mr. Trump for carrying through on a campaign promise to end American involvement in Middle Eastern conflicts. “Some evangelicals may disagree with the president’s decision,” Mr. Jeffress said, “but I guarantee you there is not one evangelical supporter of the president who would switch their vote and support Elizabeth Warren or Joe Biden over a Syria decision.” Franklin Graham stopped short of condemning Mr. Trump’s policy outright. The evangelist said he communicated with the president or vice president — he would not specify which leader — about the troop withdrawal within the last 48 hours, and said he ultimately deferred to their determinations. He declined to give specifics of his conversation. “There are so many other issues at stake here,” he said, listing things such as Turkey’s membership in NATO and U.S. military bases in the country. “It is a very hard decision.” Mr. Perkins pointed to the administration’s other efforts for religious freedom, and said that “one incident doesn’t make an administration.” Religious freedom, like anti-abortion policy and conservative judges, has often been a point of pride for many of Mr. Trump’s supporters. At the United Nations last month, Mr. Trump earned praise from supporters for highlighting religious freedom instead of prioritizing a major climate summit. As Mr. Trump’s call with the president of Ukraine roiled Washington last week, Secretary of State Mike Pompeo, an evangelical who often weaves together Christianity and foreign policy, spoke on religious freedom in Rome. This summer, around the time of the Mueller hearings on Capitol Hill, the State Department convened a celebrated gathering to advance global religious freedom. Conservative Christians can point to the administration’s priority of defending religious freedom, but action and policy are more revealing than words, said Meighan Stone, an evangelical Christian and senior fellow at the Council on Foreign Relations. “If this administration can’t be good allies to the Kurds in this battle, where is this policy that is supposed to be protecting persecuted religious minorities around the world?” she asked. “It is nonexistent.” When asked about human rights abuses of non-Christian communities, or in regions that are not as tied to biblical history — for example, how China has targeted Uighurs and other largely Muslim minorities in the autonomous region of Xinjiang — Mr. Graham demurred. “I am not familiar with these people,” Mr. Graham said of the Uighurs, noting that he had not visited the region. “I’d certainly condemn China for, it’s not just the Uighurs, they’ve been destroying churches.” Churches across Christian traditions — Catholic, Orthodox and Protestant — often share spiritual and personal ties to congregations in the Middle East, praying for their pastors or families by name, or inviting them to speak when they visit the United States. Many church leaders galvanized support in 2014 when ISIS fighters targeted, killed and raped fleeing religious minorities, including Christians and Yazidis. Now, that fear is remerging and motivating evangelical alarm, explained Jeremy Courtney, who leads a relief effort called Preemptive Love that works in northeastern Syria and in the Al Hol tent camp, which has been described as a growing hotbed of ISIS fighters and their families. “Another way to view it is Christian self-interest, that if ISIS reconstitutes, then there will be another ISIS genocide against Christians, and maybe Arabs get killed, maybe Yazidis will get killed, but the subtle undercurrent is that maybe Christians will get killed,” said Mr. Courtney, who was raised as an evangelical in Texas and has lived north of Baghdad for almost 13 years. “That is a legitimate concern, it is just disturbing to me,” he said. “Christians speaking out on this should be concerned about the Muslims who will lose their lives because of this policy as well.” The troop withdrawal in Syria is likely to be a topic of conversation this weekend at the Values Voter Summit in Washington, where President Trump is scheduled to speak to hundreds of conservative leaders. At the event, the evangelical pastor Andrew Brunson, whom Turkey accused of spying and detained for two years, will receive an award marking the one-year anniversary of his release. For many conservative Christians, Mr. Brunson has become a symbol of the Trump administration’s commitment to protecting persecuted Christians in unfriendly regions. This week, Mr. Trump said on Twitter that America’s relationship with Turkey “has been very good.” In a phone call on Thursday evening, Mr. Brunson said the decision to withdraw troops from Syria and the ensuing Turkish attack have left him “distressed.” He spoke of the refugees he met working in the Syrian-Turkish border region, including friends who had converted to Christianity and who were currently in Kobani, a Syrian town now under Turkish assault. “I don’t think Turkey is a friend of the West anymore,” Mr. Brunson said. “This is a point of great concern to me, obviously.”",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Trump’s Achilles’ Mouth Keeps Him in Trouble, Colbert Says",
      "url": "https://www.nytimes.com/2019/10/10/arts/television/late-night-stephen-colbert-trump-impeachment.html?searchResultPosition=28",
      "subtitle": "null",
      "author": "Trish Bendix",
      "content": " Welcome to Best of Late Night, a rundown of the previous night’s highlights that lets you sleep — and lets us get paid to watch comedy. If you’re interested in hearing from The Times regularly about great TV, sign up for our Watching newsletter and get recommendations straight to your inbox. On Tuesday, a White House official who listened to President Trump’s call with Ukraine’s president referred to the conversation as “crazy” and “frightening,” which Jimmy Fallon pointed out got “the same review as ‘Zombieland 2.’” Howard Stern used his Wednesday night appearance on “Jimmy Kimmel Live” to re-propose to his wife. David Spade’s mom shares her review of his show so far. John Oliver and Amy Sedaris will team up to interview Stephen Colbert on “The Late Show.” Liz Phair’s new memoir, “Horror Stories,” details the “Exile in Guyville” artist’s perceived failures and lessons learned, but not so much about her experiences specific to being a musician.",
      "date": "Oct. 10, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "What Happened Today in the Trump Impeachment Inquiry",
      "url": "https://www.nytimes.com/2019/10/11/us/politics/trump-impeachment.html?searchResultPosition=27",
      "subtitle": "The former U.S. ambassador to Ukraine gave an extraordinary interview to impeachment investigators.",
      "author": "Noah Weiland",
      "content": " Ms. Yovanovitch delivered her searing account before Congress at the risk of losing her job, since the White House has ordered officials not to cooperate with the impeachment inquiry. This afternoon I stopped by the desk of Sharon LaFraniere, who has written about Ms. Yovanovitch, to discuss why the former ambassador to Ukraine was so intent on speaking out. Sharon, how unusual was her participation? And how unusual was her testimony? She testified despite a White House declaration that there would be no more cooperation with Congress. She’s acting in defiance of the White House. Her testimony today was a really damning indictment of how the Trump administration is conducting foreign policy. She warned against people who in search of personal gain or private influence undermined the work of American government officials and threatened the policy goals of the United States. And on top of all that, she said the State Department is being hollowed out from within, because diplomats don’t feel the government has their back. What does she know that House Democrats want to know? She seemed to suggest that businesspeople who are allies of Rudy Giuliani may have orchestrated this campaign to get her out for their own private gain. Was she removed because she was standing in the way of some sort of quid pro quo deal that the White House was planning to execute? Did they see her as unwilling to play ball in what might have been a corrupt game? Those are the questions impeachment investigators want to answer. “Smart, charismatic, ruthless, a little megalomaniacal.” “Ambitious, righteous, then self-righteous.” “Personable ... for a little while.” “Decisive, combative, conspiratorial.” “Pugilistic, erratic, extremely smart, reckless.” “Forceful, combative, energetic, vindictive, tireless, annoying.” That’s Rudy Giuliani, as described by our reporters who have covered him over the past 35 years. A forthcoming episode of The Weekly traces his path from crime-busting prosecutor to Donald Trump’s personal lawyer, now at the center of the impeachment inquiry. The episode focuses in part on a brutal zinger — that Mr. Giuliani needed only “a noun and a verb and 9/11” to construct a sentence — that was delivered by none other than Joe Biden, which helped sink the former New York City mayor’s 2008 presidential campaign. “Giuliani did not like that line. I don’t think he ever forgot that Biden said it,” my colleague Maggie Haberman says on the show. To better understand how we got to this point, I called Dan Barry, who appears in The Weekly episode and has chronicled Mr. Giuliani for decades. What do you see in Rudy today that reminds you of the guy you’ve covered for so many years? There’s this combativeness, that need to be at the center of attention — the willingness to go almost anywhere to champion whatever the cause of the moment is for him. All those character traits on display now are quite familiar to anyone who followed him closely 20 or 30 years ago. But the Rudy we see now is also at odds with the Rudy of the ’80s and ’90s, with his moral rectitude then. He was Mr. Law and Order. Why, after so many years in the public eye, did he want to work for Mr. Trump? He was leading in the polls in the 2007 to be the Republican nominee for president. He was spending oodles of money. He was getting a lot of ink. And then it all evaporated. He spent millions and ended up with one delegate. That stung. He was an international hero, and then was roundly rejected. He always wanted to be relevant. He needed to be relevant. What happened in 2016? He becomes relevant. Now, he’s effectively the shadow secretary of state. I think he revels in that. Watch “The Weekly,” our new TV show, on FX Sunday at 10/9c.",
      "date": "Oct. 11, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Republicans Stand by Trump Because They Like What He Does",
      "url": "https://www.nytimes.com/2019/10/08/opinion/republicans-trump-kurds.html?searchResultPosition=26",
      "subtitle": "Sometimes, the simplest explanation is the correct one.",
      "author": "Jamelle Bouie",
      "content": " Donald Trump is probably the weakest he’s been since becoming president. He all but confessed to trying to tilt the next election in his favor with pleas — public and private — to China and Ukraine to investigate Joe Biden, the Democratic presidential candidate and former vice president, and Biden’s son. A majority of Americans support the Democratic impeachment inquiry; a plurality wants him impeached already. His defense is anything but, as allies like Rudy Giuliani keep undermining his position with their own misconduct. His approval rating is on the wane, and he trails his Democratic opponents in key swing states like Wisconsin. And yet most congressional Republicans refuse to break with the president. Despite his obvious wrongdoing and complete unfitness for the job, the vast majority of Republican office holders in Washington are “ride or die” supporters of Trump. [Jamelle Bouie answered your questions about this column on Twitter.] The most common explanation for this stalwart commitment is simply fear. “Across the country,” reports The Washington Post, “most G.O.P. lawmakers have responded to questions about Trump’s conduct with varying degrees of silence, shrugged shoulders or pained defenses. For now, their collective strategy is simply to survive and not make any sudden moves.” The former Arizona senator Jeff Flake made a version of this point last month, when he said that most Senate Republicans — “at least 35” — would vote to remove Trump if it were on a secret ballot. [Join Jamelle Bouie as he shines a light on overlooked writing, culture and ideas from around the internet. For exclusive thoughts, photos and reading recommendations, sign up for his newsletter.] The reason for the fear, in this telling, is the Republican base and its total commitment to the president. This overwhelming support is a threat to almost any lawmaker who breaks ranks. Challenge Trump and you may end up in a primary against a more MAGA-compliant opponent. I think there’s another explanation — one that accounts for Republican behavior without casting these lawmakers as would-be dissidents. On most issues, congressional Republicans don’t actually disagree with or disapprove of the president. They might find him coarse and occasionally abhorrent — when he was still the speaker of the House, Paul Ryan took a shot at Trump after his “both sides” remarks regarding the white supremacist march and violence in Charlottesville, Va. — but that doesn’t mean they have a problem with his administration. And why would they? Despite his somewhat heterodox campaign, Trump has been a remarkably conservative president. For most Republican lawmakers, to oppose Trump would be to oppose their own interests. Most Republican lawmakers were sent to Washington to fight for spending cuts, lower taxes and conservative judges. Why would any of them stand against a president who has delivered on each count? Trump has taken an ax to domestic spending programs for the poor — his Agriculture Department just proposed new cuts to food stamps; he signed a tax cut that funnels trillions to the highest earners; and he stacked the federal judiciary with right-wing ideologues. It’s hard to imagine a better outcome for a conservative politician. When Trump occasionally deviates from conservative orthodoxy — or otherwise bucks the party’s consensus — Republican lawmakers try to push him back in line. Earlier this year, Senate Republicans didn’t hesitate to challenge the administration on its plan to impose a 5 percent tariff on all goods imported from Mexico. “I will yield to nobody in passion and seriousness and commitment for securing the border,” Senator Ted Cruz of Texas said to reporters at the time. “But there’s no reason for Texas farmers and ranchers and manufacturers and small businesses to pay the price of massive new taxes.” Likewise, Senate Republicans took a collective stand against Trump after the White House announced his plan this week to withdraw American forces from northern Syria, clearing the path for Turkish military operations against Kurds in the region. Mitch McConnell, the majority leader, warned Trump against a “precipitous withdrawal”; Lindsey Graham of South Carolina called the move “a big win for Iran and Assad, a big win for ISIS”; Ben Sasse of Nebraska said the president “needs to know that this bad decision will likely result in the slaughter of allies who fought with us, including women and children.” It’s true that the Republican base isn’t invested in American foreign policy toward Syria. It’s also true, however, that Trump may well lash out against his Republican critics, which could turn his voters against them on this particular issue. But Senate Republicans spoke right up. This time around, the fear that’s supposed to drive their acquiescence to Trump doesn’t exist. If Republicans are willing to challenge Trump on his foreign policy, including the disposition of American troops abroad, then the difference when it comes to Ukraine — as well as other scandals, like the president’s continued corruption and self-dealing — may just be that they don’t see a problem. You can read Senator Marco Rubio’s willingness to downplay Trump’s open call to intervene in the 2020 election as a craven surrender, or you can take it at face value: Maybe Rubio just doesn’t think it’s that big of a deal. None of this would be out of character for congressional Republicans. These are the lawmakers who refused to fix the Voting Rights Act after the Supreme Court killed a key provision of the law in 2013. They said nothing when Trump tried to launch a crusade against imaginary “voter fraud.” They are at best indifferent to the restrictive laws and voter purges that keep millions of Americans from the polls. Sometimes, the simplest answer is the correct one. Why are most Republicans silent in the face of the president’s attempt to cheat his way to re-election? Perhaps it’s because they don’t think it’s wrong — or because they don’t care if it is.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Trump’s No. 1 Obsession (No, It’s Not Impeachment)",
      "url": "https://www.nytimes.com/2019/10/07/us/politics/on-politics-trump-immigration.html?searchResultPosition=25",
      "subtitle": "In their new book, our colleagues write about the issue the president is sure to focus on in 2020.",
      "author": "Lisa Lerer",
      "content": " Sign up here to get On Politics in your inbox. Today I’m turning over the top of the newsletter to my colleagues Michael D. Shear, one of our White House correspondents, and Julie Hirschfeld Davis, our congressional editor. Their fantastic new book, which comes out tomorrow, details two years of inside-the-administration reporting on President Trump’s signature issue: his opposition to immigration. (The book has already made news by revealing the president’s desire for an alligator-filled moat along the border and his suggestion that migrants be shot in the legs.) Here’s what they had to say about Mr. Trump’s fixation with immigration and what it all may mean for the 2020 race. Six days before the 2018 midterm elections, President Trump got into a shouting match over the phone with Paul Ryan, who was then the speaker of the House. That argument may reveal quite a bit about what to expect from the president when his 2020 campaign ramps up next year. In 2018, Mr. Ryan was furious at Mr. Trump for talking endlessly about immigration — the dangers from caravans of migrants, a pledge to end birthright citizenship, his obsession with the border. “Ryan was exasperated. Trump still didn’t get it,” we write in the book. “You are not helping anything by talking about this kind of stuff,” Mr. Ryan told Mr. Trump. After Republicans lost their majority, the speaker blamed the president’s comments about birthright citizenship, adding that his talk of sealing the border and having American troops shoot at migrants had not helped either. Mr. Trump had made the congressional elections about him and his visceral message of fear and loathing toward immigrants, and voters in vital pockets of the country had recoiled, one of Mr. Ryan’s associates later told a colleague: “He had just hijacked the whole thing.” What does that mean for 2020? At the moment, you could be excused for thinking that the only subject on Mr. Trump’s mind is the impeachment inquiry aimed at removing him from office. But railing against immigration is in the president’s electoral DNA. When Mr. Trump announced his 2016 campaign by calling Mexicans “rapists,” his political advisers were ecstatic, according to our reporting: “Trump had been at No. 8 in some polls when he was at the top of the escalator before his announcement. Within weeks, he had shot up to the top of the Republican pack.” Stephen Miller, the architect of Mr. Trump’s immigration agenda, told us that voters would “resoundingly side with the political party that secured the border. And not by a little bit. Not by 55-45, 60-40, 70-30, 80-20. I’m talking 90-10 on that.” Is that right? According to our reporting, one of the Republican Party’s leading pollsters concluded after the midterms that “immigration and the caravan had overwhelmed the economic message that Ryan and other Republicans had been trying to highlight by a two-to-one margin.” That’s the danger for Mr. Trump. His obsession with immigration could once again overshadow the party’s tax cuts, a 3.5 percent unemployment rate and growth in wages. Even so, expect dire warnings about “open border Democrats,” furious demands to stop asylum seekers and a relentless focus on his “big beautiful wall.” The president believes that immigration is what brought him to the White House, and he’s not about to abandon it now. We want to hear from our readers. Have a question? We’ll try to answer it. Have a comment? We’re all ears. Email us at onpolitics@nytimes.com. Another colleague, Shane Goldmacher, spent his weekend standing in the street and sitting in a hotel lobby in Philadelphia, as Joe Biden’s biggest donors and fund-raisers met for their first big retreat since the campaign began. He sends this dispatch: The gathering of Mr. Biden’s most important financiers came at an awkward time. Just a few hours before they toured his Philadelphia headquarters, Senator Elizabeth Warren’s campaign announced that she had out-raised Mr. Biden by nearly $10 million in the last three months. She was the subject of most of the weekend’s conversation, both among Biden officials and the donors, even though Senator Bernie Sanders had actually raised a little more than her. Some donors were downbeat. But mostly there was a palpable sense of determination. These retreats serve two purposes: 1. Thank the donors for the millions they’ve already raised. 2. Exhort them to raise even more. There were drinks on Friday and a day filled with PowerPoints on Saturday. Most of Mr. Biden’s top brass appeared: the campaign manager Greg Schultz, deputy campaign managers Kate Bedingfield and Pete Kavanaugh, senior advisers Cristóbal Alex and Symone Sanders, and Becca Siegel, the chief analytics officer. Oh, and Mr. Biden came too. Several donors said the weekend presentations were thoughtful, well prepared and steady, if not flashy or particularly inspiring. In that way, two attendees separately likened it to Mr. Biden’s candidacy itself. O.K., so who had Jeff Daniels in the actor-playing-James-Comey betting pool? Were you forwarded this newsletter? Subscribe here to get it delivered to your inbox. Thanks for reading. Politics is more than what goes on inside the White House. On Politics brings you the people, issues and ideas reshaping our world. Is there anything you think we’re missing? Anything you want to see more of? We’d love to hear from you. Email us at onpolitics@nytimes.com.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Impeach Trump, Repeatedly",
      "url": "https://www.nytimes.com/2019/10/06/opinion/trump-impeachment.html?searchResultPosition=24",
      "subtitle": "A president should not be able to stonewall and run out the clock.",
      "author": "Charles M. Blow",
      "content": " When the Democratic leadership was finally forced to formally back an impeachment inquiry, they faced a choice: focus broadly on all of Donald Trump’s corruption and unfitness, which could drag on for a long time, or focus narrowly on the new revelations about Trump and Ukraine and do so quickly. They chose the latter. I happen to agree with that strategy, if one assumes that you only have one shot at this. But, I also propose another scenario: Do both. Draw up articles of impeachment on the narrow case of Ukraine, but don’t close the impeachment inquiry. Keep it open and ready to draw up more articles as new corruption is uncovered. Impeach Trump repeatedly if necessary. There is nothing in the Constitution that prevents a president from being impeached more than once. Trump and his administration are stonewalling in every way possible, refusing to produce administration officials for testimony and refusing to produce documents. In many cases, Democrats in the House have taken the administration to court over its stonewalling, but court cases take time. It could be months, if not years, before there is a judgment in those cases. But, as we are learning with the Ukraine case, Trump’s contempt for law, propriety and process is boundless. He clearly abused the power of his office when attempting to pressure that country into investigating Joe and Hunter Biden. And, we only know this because a whistle-blower stepped forward and said something. Now, The New York Times is reporting that a second whistle-blower in the Ukraine saga is considering filing a complaint. Mark Zaid, attorney for the first whistle-blower, said Sunday that he was now representing a second whistle-blower, but that he didn’t know if it was the same person identified in The Times’s report. Could there be three? Whistle-blowers can draw courage from one another. There can be a positive copycat effect that snowballs. The impeachment inquiry needs to remain open after the Ukraine affair, not only to allow the cases in the courts to be resolved, but also to allow future whistle-blowers’ information to be immediately considered in the context of impeachment. Barring a massive shift in public opinion, efforts to convict and remove Trump are destined to fail in the Republican-controlled Senate. Majority Leader Mitch McConnell said last week on CNBC that the Senate would have no choice but to have a trial if the House passes articles of impeachment. McConnell put it this way: “Yeah, it’s a Senate rule related to impeachment that would take 67 votes to change. So, I would have no choice but to take it up. How long you’re on it is a whole different matter, but I would have no choice but to take it up.” This suggests that McConnell could “take up” a House impeachment but quickly move to dismiss it, thereby allowing the Republican Senate to cowardly back out of doing its duty to place patriotism over party. I say, in that case, deluge them with new articles of impeachment as they present themselves. Force the Senate to continually hold trials and take votes defending Trump’s wrongdoing all the way up to the eve of the election. Some people worry that a single impeachment may strengthen Trump’s hand in 2020. They will no doubt be apoplectic about the idea of doing it multiple times, deeper into the campaign season. But I say, Trump — and his propaganda machine at Fox News — are going to spin every scenario to their best ability. Trump is not going down without a fight, even at the ballot box. I believe that Democrats have to place their faith in something more fundamental: the power of the truth. There are politics involved in everything that happens in Washington. And impeachment is no different. In fact, it is a purely political act. But beyond that, there is an apolitical truth: All political corruption, abuses of power, conspiracies, cover-ups and attempts to deceive and mislead the public are wrong. Many Trump loyalists will never accede to this point, but many more Americans, at the core, know this difference between right and wrong. Trump deserves to be impeached for every offense he has committed against the office of the presidency and the American people. That means that the impeachment inquiry can’t be constrained by electoral calendars or judicial machinations. Precedent must be considered here. What precedent would it set if a president could simply stonewall and run out the clock in court, preventing Congress from performing its oversight and dodging any and all attempts to hold him or her accountable? What precedent would it set if a president abused his power and broke the law but learned that he need only rile up his or her base to keep Congress at bay? All of this would set a terrible precedent. Trump must be held accountable, fully and completely. The Ukraine development unexpectedly entered the conversation as a clear, neat package of wrongdoing that was easy for Americans to understand. But that doesn’t wipe away the many other wrongdoings — obstruction of justice for instance — that also must be addressed for history’s sake. I say, impeach Trump as often as necessary until all the corruption has been laid bare.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Prince’s Estate to Trump Campaign: Don’t Play ‘Purple Rain’",
      "url": "https://www.nytimes.com/2019/10/11/us/prince-trump-rally-purple-rain.html?searchResultPosition=23",
      "subtitle": "The estate said that despite an agreement last year not to use Prince’s music, the song was played at the president’s rally on Thursday night in Minneapolis, the singer’s hometown.",
      "author": "Christine Hauser",
      "content": " The estate of Prince, the musician who died in 2016, pushed back against President Trump’s campaign on Thursday night after the artist’s song “Purple Rain” was played at a Trump rally that night in Minneapolis, the singer’s hometown. On a Twitter account set up to celebrate the life of the singer, the estate said that Jones Day, the law firm that has represented Mr. Trump in election law matters and continuing lawsuits, had agreed last October that the campaign would not use Prince’s songs at rallies and other events. The estate posted a letter it said it had received from Jones Day last year. “Without admitting liability, and to avoid any future dispute, we write to confirm that the Campaign will not use Prince’s music in connection with its activities going forward,” the letter said. The estate said on Twitter that despite that understanding, “Purple Rain” had been played at the Minneapolis rally. “The Prince Estate will never give permission to President Trump to use Prince’s songs,” it said. A representative for Jones Day was not immediately available for comment on Friday. Other artists have asked the Trump campaign not to use their music, including Rihanna and Axl Rose, and the wording in the Jones Day letter resembled one also sent to representatives of Steven Tyler, the lead singer of Aerosmith, who had objected to the playing of his music at Trump events. Such requests are not unusual for politicians and the arenas where they drum up support. Usually, music rights agencies advise campaigns to buy blanket licenses so they can play music in the agencies’ catalogs wherever they are. Arenas where politicians appear often have a blanket license that allows the venue to play any song in an agency’s catalog. Sometimes artists find that their music has slipped through into an event for a politician they do not support. In 2018, Pharrell Williams sent a letter to the president after the song “Happy” was played at an event on the day of the synagogue shooting in Pittsburgh. But the group that hosted the event, the National FFA (Future Farmers of America) Organization, said its organist had played the song without any input from the campaign, The New York Times reported.",
      "date": "Oct. 11, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Trump Is Serious About Carrying Minnesota, the One That Got Away in 2016",
      "url": "https://www.nytimes.com/2019/10/09/us/politics/trump-minnesota-2020.html?searchResultPosition=22",
      "subtitle": "null",
      "author": "Annie Karni",
      "content": "  WASHINGTON — A Republican presidential candidate has not won the state of Minnesota since Richard M. Nixon’s victory there in 1972. But President Trump has long viewed it as the one that got away. Mr. Trump barely set foot in the state during his 2016 campaign, and his field organization on the ground was nonexistent: The lone Trump campaign staff member working the state was moved to Colorado before Election Day. But Mr. Trump lost Minnesota to his former rival Hillary Clinton by 1.5 percentage points, or less than 45,000 votes. “We almost won it,” Mr. Trump said during a visit this year to a trucking company in a Minneapolis suburb. The difference between a victory and a loss, he said, would have been coming to the state to give “one more speech.” This time, the Trump campaign is determined not to let Minnesota go without trying. So on Thursday night, Mr. Trump will arrive in Minneapolis, one of the most Democratic congressional districts in the country, for his first political rally since House Democrats began an impeachment investigation that threatens to engulf his presidency. It is a rare rally for Mr. Trump in a state he did not win in 2016, and takes him to the heart of opposition territory: In 2018, the city helped elect to the House Ilhan Omar, a Democratic woman of color who has become one of the president’s favorite foils. Mr. Trump’s rally at Target Center will be bolstered by a “Women for Trump” event hosted by the second lady, Karen Pence, and Lara Trump, the president’s daughter-in-law, on Wednesday in St. Paul. Vice President Mike Pence will hold his own round table on Thursday in nearby Lakeville. Meanwhile, Brad Parscale, the president’s campaign manager, is planning to pour tens of millions of dollars into the campaign’s Minnesota operation, compared with the $30,000 the Trump campaign spent on the state last cycle. The campaign already has 20 paid staff members in the state, and expects to expand to 100. And the campaign and the Republican National Committee are outspending Democrats by about four to one on digital advertising, according to campaign officials and local Democratic Party officials. “It is a full-on major effort state campaign,” said Tim Murtaugh, a Trump campaign spokesman. “And we will have the resources behind it to make it count.” Minnesota Democrats said it felt as if their state was a true battleground for the first time in decades. “Over the last 25 years, I’ve never seen an investment as robust and deep this early by a Republican presidential candidate,” said Ken Martin, the chairman of the Minnesota Democratic-Farmer-Labor Party. Mr. Martin said it was clear to him that “Trump and the Republicans believe they can win and are doing everything to make it so.” Few states in the Midwest exemplify Mr. Trump’s strengths, such as popularity in rural areas, as well as his weaknesses, such as his shaky standing in suburban areas, the way Minnesota does. Which group turns out in bigger numbers could determine who wins the state on Election Day. If Mr. Trump succeeds in flipping Minnesota’s 10 electoral votes, it will probably mean that he has secured himself another four years in the White House. No Democratic candidate can carve a path to victory without Minnesota, and Trump officials are eager to put Democrats on defense there. One campaign official compared the dynamic to Republicans having to spend resources to defend a Republican stronghold like Indiana. But the changing makeup of the state has made Minnesota something of a microcosm for the Trump campaign’s challenge as it builds him a solid infrastructure nationwide: This time isn’t last time. “This election is much more a referendum on him and his performance as president,” said Geoff Garin, a Democratic pollster. “He has managed to turn a lot of voters off through his conduct and performance. It’s hard to overcome that with field organizing.” Mr. Garin noted that the suburban vote in Minnesota was much more significant than in neighboring Wisconsin, and Mr. Trump was consistently polling poorly in suburbs. “A variety of factors have taken it from being a closely contested state to much more of a slingshot for Trump,” Mr. Garin said. “The kind of antics at his rallies that occur are unlikely to help him in Minnesota.” To win Minnesota, Mr. Trump would have to gain about 45,000 more votes than he did in 2016, while keeping Democratic turnout roughly the same as it was last cycle. A poll commissioned before his visit Thursday by Alliance for a Better Minnesota, a group aligned with Democrats, showed that 49 percent of respondents favored an impeachment inquiry, compared with 44 percent who believed it was a bad idea. The poll, conducted by Public Policy Polling, also found that 52 percent of respondents would vote for an unnamed Democratic opponent if the election were held today, compared with 42 percent who said they would vote for Mr. Trump. “We had record turnout for a midterm election in 2018,” Mr. Martin said. “That was fueled in urban cores and suburbs. He’s going to have to do better than he did in the suburbs and exurbs, and we haven’t seen that happening.” For their part, Trump campaign officials are more focused on the Iron Range, the mining communities in the northern part of the state. In 2016, for instance, Mr. Trump won the states’ Eighth District in the north by 16 points. President Barack Obama won it by six points in 2012. That is where Trump campaign officials see an urban-rural divide that is trending in their direction, while the election of progressive lawmakers like Ms. Omar has pushed voters further in the direction of Democrats in urban areas. Iron Rangers in northern Minnesota have been fleeing the Democratic Party because of promises to end the fossil fuel industry, among others, according to local officials, who point to Representative Collin C. Peterson, a Democrat, as an example of the state’s changing politics. Mr. Peterson, who represents Minnesota’s Seventh District, won his race in 2012 by 26 points. In 2018, he eked out a victory with a much slimmer 4-point margin. In 2016, Mr. Trump won the Seventh District by 31.5 points. But the rural regions in the state have also seen a loss of population, while the suburbs, where Mr. Trump has done little to expand his appeal with voters, have grown. This week, Mr. Trump tried to capitalize on that divide by leaning into a fight with Jacob Frey, the Democratic mayor of Minneapolis, who wanted to charge the campaign about half-a-million dollars for the extra security required to host the presidential visit. Framing Mr. Trump as a victim, his campaign accused the mayor of trying to shut down the rally. In a statement, the campaign called Mr. Frey a “radical leftist mayor” who was “abusing the power of his office and attempting to extort President Trump’s re-election campaign by conjuring a phony and outlandish bill for security in an effort to block a scheduled Keep America Great rally.” The campaign ultimately settled the dispute without paying the additional funds. It was not clear whether the city or the arena would be footing the bill instead. But some Democrats said they worried Mr. Frey had inflamed a real divide in the state, emboldening people to go see Mr. Trump after a Democratic mayor appeared to try to tell them they could not. The heated back-and-forth hinted at the aggrieved tone Mr. Trump plans to strike at the rally Thursday night. “The lightweight mayor is hurting the great police and other wonderful supporters. 72,000 ticket requests already. Dump Frey and Omar! Make America Great Again!” Mr. Trump wrote Tuesday on Twitter.",
      "date": "Oct. 9, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "What Happened Today in Trump Impeachment Inquiry News",
      "url": "https://www.nytimes.com/2019/10/10/us/politics/trump-impeachment-news.html?searchResultPosition=21",
      "subtitle": "null",
      "author": "Noah Weiland",
      "content": " Katie Benner, who covers the Justice Department for us, said federal prosecutors probably had the indictment ready to go for a while and were keeping tabs on Mr. Parnas and Mr. Fruman. When the two got one-way tickets out of the country, she said, the prosecutors realized that they had to move. My colleague Mike Schmidt got an eyewitness account of the arrests in the Lufthansa lounge in the B concourse of Dulles International Airport on Wednesday. Here’s what he heard: At first glance, the two men might seem peripheral to the events that the House is investigating. But they were involved in the Ukraine affair from the beginning, dating to Mr. Parnas’s job as Mr. Giuliani’s fixer in Ukraine. This evening I stopped by the desk of my colleague Ken Vogel, who revealed Mr. Parnas’s involvement in Mr. Giuliani’s Ukraine efforts, to get a sense of why they matter to the impeachment investigation. Why are these two men so important to understanding the whole Ukraine scandal? They were Rudy Giuliani’s enablers and facilitators in his Ukrainian expedition. They connected Mr. Giuliani to the Ukrainian prosecutors who provided both the information and the potential investigations that are at the center of President Trump’s interest in Ukraine. They were at the very front of all of this activity that led to what became the whistle-blower complaint. Why did that activity raise alarm bells? Their ability to get Congressman Sessions to take up their cause on such a niche issue that might not have been on his radar — helping to oust the American ambassador to Ukraine — is precisely the type of thing that campaign finance watchdogs warn of when they bemoan the power of money of politics. How valuable can they be to federal prosecutors, who’ve clearly been investigating them long before the impeachment investigation? It depends who the prosecutors are after. The two men could certainly flip and provide plenty of information about Rudy Giuliani. I have a source who saw Mr. Parnas, Mr. Fruman and Mr. Giuliani together not infrequently at the Trump hotel here in Washington. What about to Congress? They were supposed to be important witnesses in the impeachment investigation this week before they were arrested. They could be very useful to Congress, but maybe not as much in the impeachment inquiry. They don’t have a ton of access or visibility into Trump himself, so it could be a bit of a bank shot. But in another way, they could be extremely useful. Congress has shown a great interest in the outsourcing of foreign policy, and these guys are right in the middle of that. On Thursday evening, Mr. Trump will hold a campaign rally in Minneapolis, his first since the impeachment investigation began. On Friday, House investigators are due to interview  the career diplomat and former American ambassador to Ukraine, Marie Yovanovitch, whose ouster was sought by Mr. Parnas, Mr. Fruman and many in the Trump administration. Despite the White House’s attempts to block cooperation by State Department employees, Ms. Yovanovitch has signaled to House staff members that she is willing to speak to them.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Donald Is Desperate",
      "url": "https://www.nytimes.com/2019/10/02/opinion/trump-impeachment.html?searchResultPosition=20",
      "subtitle": "He will do and say whatever he can to avoid impeachment.",
      "author": "Charles M. Blow",
      "content": " On Wednesday I watched Donald Trump in the Oval Office, while seated next to the Finnish president, take questions from reporters in what can only be described as the unhinged rantings of a desperate man melting down, spiraling out of control and lashing out. Over the last few years, and particularly since the Robert Mueller investigation concluded, I have grown accustomed to Trump delivering his insults, launching his attacks and spewing his lies with a swaggering smugness. This was not that. What was on display Wednesday was anger animated by panicked fear. And at another news conference with the Finnish president, Trump repeated his stupefying performance, rambling and raving, dodging questions and misdirecting attention. And, of course, lying. Donald Trump is scared. And he is incensed that he is scared. And his only impulse is to fight like a thing near death: with everything he has, and by all means necessary. [The big debates, distilled. This guide will put in context what people are saying about the pressing issues of the week. Sign up for our new newsletter, Debatable.] Trump is now on a warpath against everything that threatens him. The whistle-blower is now the “#FakeWhistleblower” whom he wants to identify and “interview.” Anyone who spoke with the whistle-blower is “close to a spy,” and Trump said: “You know what we used to do in the old days when we were smart with spies and treason, right? We used to handle it a little differently than we do now.” He has suggested that Adam Schiff is criminal and even treasonous. He has called the impeachment inquiry a “coup.” And, he has quoted someone who said that removing him from office “will cause a Civil War like fracture in this Nation from which our Country will never heal.” This will not end well. There is nothing Trump hates and fears more than being publicly chastised and embarrassed. He has always believed that he could control the narrative even if he couldn’t control the facts. Facts don’t really matter to the man. But the march toward impeachment is beyond his control. He can’t bully his way out of it. He can’t lie his way out of it. It is happening. If he obstructs in any way it could only add to eventual articles of impeachment. The walls are closing in on him; his options to avoid are nearly nil. The presidency has many powers, awesome powers, but Congress also has powers, and impeachment is one of them. Trump is likely to become only the third president to be impeached and the first to be impeached over his dealings with a foreign government, one of the things the framers of the Constitution feared most. This is outrageous to Trump, a man who has patterned his entire presidency as a rebuke to and competition with his predecessor, Barack Obama. Not only will Trump not get a Nobel Peace Prize, he’ll get an American badge of dishonor. A black president of decency will trounce the president of white supremacy. This fact alone is no doubt pushing Trump to the verge of explosion. He will do anything to avoid this. But this may now be all out of his hands. The whistle-blower complaint has been filed and its credibility bolstered by Trump’s own statements, the rough transcript memo released by the White House and confirmations from the White House. There are other things we want and need to know, to be sure, because there may well be other abuses of power about which we are still unaware. But the basis for at least one article of impeachment has already been established: abuse of power. The House could vote on that one any day it wished. In fact, paradoxically, the longer Democrats drag out their investigation to strengthen their case, the more time Trump will have to muddy the waters with lies and conspiracies, possibly weakening that case, with the public at least. We have to remember that Trump isn’t a politician who entered the arena with a deep desire to serve and with appreciation for the country’s history, customs and institutions. Trump ran for president as an exercise of self-flattery and to boost his brand. His win was surprising, even for him. So we should never expect him to be patriotic when he is being condemned. Before Trump will allow himself to be chased from the temple, he’ll bring it down.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Trump Flies Into the Cuckoo’s Nest",
      "url": "https://www.nytimes.com/2019/10/09/opinion/trump-turkey-congress.html?searchResultPosition=19",
      "subtitle": "Getting stranger every day in every way.",
      "author": "Gail Collins",
      "content": " Two ways to judge anything Donald Trump does these days: A) Is it a good idea? And B) Is it further evidence he’s going nuts? Think about Turkey. Over the weekend, Turkish President Recep Tayyip Erdogan was preparing to attack our old Kurdish allies in northern Syria. The White House announced late Sunday night that it was O.K. with the whole deal and was pulling out the small American military contingent that’s been fighting alongside the Kurds. Nobody seemed to have run this by Defense Secretary Mark (Finally Confirmed!) Esper, who sent out a tweet Monday morning opposing the Turkish operation. Which was later deleted. “If Turkey does anything that I, in my great and unmatched wisdom, consider to be off limits I will totally destroy and obliterate the economy of Turkey,” Trump reassured the nation. Well, we’ve always known he suffers from delusions of grandeur. (“There are those that think I’m a very stable genius.”) And although the way the administration handled the whole Turkey thing was wildly inept, we’ve known for a long time there’s no ept in this White House. But here’s the other part: Donald Trump is in the middle of a super impeachment crisis, and he’s surviving in office only through Senate Republicans’ support. And he chose this time to create a foreign affairs uproar guaranteed to outrage and offend the Republican senators. “Pray for our Kurdish allies who have been shamelessly abandoned by the Trump Administration. This move ensures the emergence of ISIS,” tweeted Lindsey Graham. This from a fervid supporter. If Graham were, say, a miniature poodle, he’d be the one trotting along, carrying the master’s socks in his mouth. The president’s sudden decision to give a shout-out to the Turkish government came after a phone call with Erdogan. By now there have been so many phone-related disasters you’d think the family would have taken away his communication devices. But Trump believes he’s always very careful and conscious that tons of people are listening in. “My knowledge — I know all about it,” he told reporters at a press conference last week. The gathering degenerated into a yelling meltdown, during which our president declared that House Intelligence Committee chairman Adam Schiff “had some kind of a mental breakdown.” Nobody muttered “takes one to know one.” Most of the Republicans are just sort of curled up under their beds, quivering. Lately, the squad of across-the-board Trump defenders has dwindled down to people like Representative Matt Gaetz of Florida. Perhaps you remember Gaetz having argued that violence in America was not due to guns but to “illegal aliens.” This time he said that the impeachment process was “a kangaroo court and chairman Schiff is acting like a malicious Captain Kangaroo.” Well, you take whoever you can get and Trump does not currently have a lot of universally enthusiastic troops. Representative Liz Cheney of Wyoming called the American pullout from Syria a “catastrophic mistake.” Any daughter of Dick Cheney is going to be a person who can overlook a whole lot. When you lose her, you’re really down to … Matt Gaetz. All this is going on while the White House is refusing to let Congress have access to administration officials who have information on the whistle-blower charges. Which, as of course you remember, stem from the time the man who believes he knows all about being careful on phone calls tried to get the Ukraine president to come up with some dirt on the foreign business dealings of Joe Biden’s son. The man who later demanded that China investigate Hunter Biden’s business dealings there. Even China found that loony, a high standard for a country that can’t even manage to have a reasonable relationship with basketball teams. And, of course, the president whose daughter and son-in-law have both been working for the White House while raking in tens of millions of dollars from their business dealings. Some came from the clothing Ivanka manufactured in places like … China. Why would he bring up children making money abroad? This isn’t just a guy who makes stupid decisions. It’s a guy who’s off his rocker. Whose great pal is Rudy Giuliani, the talking head whose TV appearances can terrify toddlers. I’m not saying Trump is the only unbalanced person in this story. Just that he’s the only one who controls our nuclear weapons. In a happier time Americans went about their lives, complaining about Washington, then sort of shrugging and moving on to a discussion of the World Series. Or medieval history. Or goat yoga. Whatever. Now we aren’t even free to change the subject. We’re looking at the pileup and wondering whether the next thing will usher in the Big Crackup. So there’s the president of the United States. Trying to get around the current controversy by rebranding the Turkish invasion “a bad idea.” Stonewalling Congress on the whistle-blower crisis. Which includes a report that one White House official who listened to Trump’s phone call with Ukraine’s president described it as — yes! — “crazy.” What a coincidence.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Congress Can Seek Trump’s Financial Records, Appeals Court Rules",
      "url": "https://www.nytimes.com/2019/10/11/us/politics/mazars-trump-tax-returns.html?searchResultPosition=18",
      "subtitle": "null",
      "author": "Charlie Savage",
      "content": " WASHINGTON — President Trump’s accounting firm must comply with a House committee’s demands for eight years of his financial records, a federal appeals court panel ruled on Friday in a major victory for House Democrats in their struggle against his vow to stonewall “all” of their oversight subpoenas. In a 66-page ruling, the panel rejected Mr. Trump’s argument that Congress had no legitimate legislative authority to seek his business records from the firm, Mazars USA, because the committee was trying to determine whether he broke existing laws — not weighing whether to enact a new one. “Having considered the weighty issues at stake in this case, we conclude that the subpoena issued by the committee to Mazars is valid and enforceable,” wrote Judge David S. Tatel of the United States Court of Appeals for the District of Columbia. Mr. Trump is virtually certain to appeal the ruling, either to the full Court of Appeals or to the Supreme Court. But the decision — affirming an earlier ruling by a Federal District Court judge — was the first test at the appeals court level of the Trump legal team’s sweeping challenges to the constitutional authority of Congress to conduct oversight of his activities. Judge Tatel was joined by Judge Patricia A. Millett in the majority of the three-judge ruling. Both were appointed by Democratic presidents. Judge Neomi Rao, a former Trump administration official whom Mr. Trump appointed to the bench in March, dissented, saying she would have quashed the subpoena as exceeding the House’s legislative powers. Representative Elijah E. Cummings, the Democratic chairman of the oversight committee, hailed the appeals court’s decision. “Today’s ruling is a fundamental and resounding victory for congressional oversight, our constitutional system of checks and balances and the rule of law,” he said in a statement. “For far too long, the president has placed his personal interests over the interests of the American people.” Lawyers for Mr. Trump were reviewing the decision, said one, Jay Sekulow. “We continue to believe that this subpoena is not a legitimate exercise of Congress’s legislative authority,” he said. Sarah E. Sutton, a spokeswoman for the Justice Department, declined to comment on the ruling. The scope of Congress’s power to compel the production of information — and the president’s power to keep information secret — has emerged as a recurring battleground between House Democrats and Mr. Trump, whose legal team has put forth novel legal arguments in carrying out his vow to systematically defy House subpoenas. This week, Mr. Trump’s White House counsel, Pat A. Cipollone, sent a letter to the House declaring that the administration would not cooperate with the House’s impeachment inquiry, such as by providing documents or permitting witnesses to testify. The Trump legal team has separately argued that Mr. Trump’s current and former White House aides are absolutely immune from subpoenas for their testimony — meaning they would not even have to show up — and that Congress lacks legitimate legislative authority to scrutinize potential wrongdoing in the executive branch. The appeals court ruling on Friday centered on that third argument, and it was in some respects already obsolete because the premise of the argument was that the House was relying only on its routine legislative and oversight authorities, rather than any extra investigative powers that lawmakers gain when engaged in an impeachment inquiry. But since the Mazars case started going through the courts, the House Judiciary Committee and Speaker Nancy Pelosi have declared that the chamber is conducting an impeachment inquiry. The Trump administration has disputed that premise, since the full House has not voted for a resolution approving such an investigation. Friday’s ruling did not address the question of whether an impeachment inquiry is underway — and, if so, whether that matters. The majority on the panel ruled for the House without any need to invoke its impeachment powers. Specifically, the fight centered on whether the House Oversight and Reform Committee had the authority to compel Mazars to turn over Mr. Trump’s financial records as part of its routine legislative and oversight powers, even if the committee’s purpose was in part to determine whether Mr. Trump committed crimes. The committee, led by Mr. Cummings, issued the subpoena after it came to light that Mr. Trump had failed to list on his ethics disclosure forms a debt that he owed and then repaid to his former lawyer and fixer, Michael D. Cohen, for paying hush money to a pornographic actress just before the 2016 election to keep quiet about an affair she claimed to have had with Mr. Trump. He has denied the relationship. Mr. Cohen also testified before Congress that Mr. Trump routinely changed the value of his assets for different financial purposes, like inflating their value for loan applications but deflating them for taxes. (Mr. Cohen was separately convicted of lying to Congress in earlier testimony.) In making the request for documents and then issuing the subpoena, Mr. Cummings said that Congress was trying to determine whether the president had broken laws, but he also said that lawmakers were trying to decide whether to update financial disclosure laws. Mr. Trump’s legal team, which sued Mazars to obtain a court order blocking it from complying with the subpoena, argued that this meant the committee was effectively trying to carry out a criminal investigation. That, they asserted, was an executive branch job, not a legislative one, and so the House’s subpoena was invalid. But Judge Tatel wrote that Supreme Court precedent granted broad authority to Congress to issue subpoenas for information that could be used to enact new laws — even if it could also be useful as criminal evidence — and imposed no requirement on lawmakers to say that legislation was their specific purpose. In any case, he also wrote, Mr. Cummings had made reference to investigating whether new legislation was necessary. “We conclude that the public record reveals legitimate legislative pursuits, not an impermissible law enforcement purpose, behind the committee’s subpoena,” he wrote. Judge Rao disagreed. Lawyers for the House, led by their counsel Douglas Letter, had relied only on the House’s normal oversight powers in support of the subpoena, she noted, arguing that permitting lawmakers to pursue such information without an impeachment inquiry would make it too easy to harass the presidency. “When the House chooses to investigate the president for alleged violations of the laws and the Constitution, it must proceed through impeachment, an exceptional and solemn exercise of judicial power established as a separate check on public officials,” she wrote. But Judge Rao did not address the House Democrats’ more recent assertions that they are, in fact, already conducting an impeachment inquiry — nor the Trump administration’s claims that there is no such inquiry for legal purposes. In a letter to Democrats celebrating the ruling, Ms. Pelosi wrote: “The president’s actions threaten our national security, violate our Constitution and undermine the integrity of our elections. No one is above the law. The president will be held accountable.”",
      "date": "Oct. 11, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Luckily, Trump Is an Unstable Non-Genius",
      "url": "https://www.nytimes.com/2019/10/10/opinion/donald-trump.html?searchResultPosition=17",
      "subtitle": "His mental deficiencies may save American democracy.",
      "author": "Paul Krugman",
      "content": " The surprising thing about the constitutional crisis we’re now facing is that it took so long to happen. It was obvious from early on that the president of the United States is a would-be autocrat who accepts no limits on his power and considers criticism a form of treason, and he is backed by a party that has denied the legitimacy of its opposition for many years. Something like this moment was inevitable. What still hangs in the balance is the outcome. And if democracy survives — which is by no means certain — it will largely be thanks to one unpredictable piece of good luck: Donald Trump’s mental deficiency. I don’t mean that Trump is stupid; a stupid man couldn’t have managed to defraud so many people over so many years. Nor do I mean that he’s crazy, although his speeches and tweets (“my great and unmatched wisdom”; the Kurds weren’t there on D-Day) keep sounding loonier. He is, however, lazy, utterly incurious and too insecure to listen to advice or ever admit to a mistake. And given that he is in fact what he accuses others of being — an enemy of the people — we should be thankful for his flaws. The news item that got me thinking along these lines was, oddly, the latest budget review from the Congressional Budget Office, projecting a fiscal 2019 deficit of almost a trillion dollars — up by more than $300 billion from the deficit Trump inherited. Never mind the clear demonstration that the G.O.P.’s Obama-era hyperventilating about deficits was completely hypocritical. The more important point is that $300 billion is a lot of money, and it should have been enough to buy Trump a lot of political gain. After all, other white nationalists trying to do what Trump is trying to do — subvert the rule of law and convert their nations from democracies on paper to one-party autocracies in practice — have solidified their grasp on power by delivering at least a bit on their populist promises. In Poland, for example, the Law and Justice party has increased social spending and is now promising a big rise in the minimum wage. Trump’s domestic economic policy, however, has been standard Republican top-down class warfare. None of that $300 billion went for social benefits or even his continually promised, never-delivered infrastructure plan. Instead, it went mainly into tax cuts for corporations and the wealthy that have done little to boost investment. [For an even deeper look at what’s on Paul Krugman’s mind, sign up for his weekly newsletter.] At the same time, Trump has pursued his personal tariff obsession despite mounting evidence that it’s hurting growth. The economy was supposed to be his big political selling point. Instead, polls of his net job approval on economic policy are, on average, barely positive even now — and likely to get worse as tariffs on consumer goods bite and the economy slows. But Trump’s squandered economic opportunities are, of course, secondary at this point to his de facto self-impeachment. Just a few weeks ago it seemed that Trump would skate on charges both of colluding with Russia to subvert the 2016 election and of obstruction of justice; the Mueller report was basically a bust, partly because the story was complicated, partly because of Robert Mueller’s diffidence. But Trump has managed to make things clear enough for everyone to understand. First he demanded that foreign regimes produce dirt on domestic political rivals, not just in phone calls but right there on camera. Now he’s engaged in a crude, obvious effort to stonewall the House impeachment inquiry that is clearly an impeachable offense in itself. Why did he hand the defenders of democracy so much ammunition? Partly he seems to have gotten high on his own supply — he actually seems to believe the bizarre conspiracy theories his supporters drum up to excuse his actions. Also, he evidently lacks any kind of self-restraint. Even if he considers any effort to hold him accountable a form of treason, he should have known better than to blurt it out in public. So Trump’s own actions explain why a vote to impeach, which seemed unlikely just a few weeks ago, now looks almost inevitable. Conviction in the Senate is still unlikely, but not as impossible as it once appeared. The larger point is that if Trump were cannier and more self-controlled, the march to autocracy might well be unstoppable. He has the backing of a party whose elected representatives have shown no sign of democratic scruples. He has de facto state media in the form of Fox News and the rest of the Murdoch empire. He has already managed to corrupt key government agencies, including the Justice Department. Indeed, these advantages are so large that the assault on democracy may yet prevail. The only reason it might falter is, as I said, Trump’s own deficiencies. It says a lot about the modern G.O.P. that the party is still solidly behind a man so obviously, grotesquely, not up to the job (although some rank-and-file Republicans now back an impeachment inquiry). But those of us who want America as we know it to survive should be grateful that Trump is so immature and incompetent. His character flaws are the only thing that gives us a fighting chance.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Bringing Grievances to His Conservative Base, Trump Assails Impeachment Inquiry",
      "url": "https://www.nytimes.com/2019/10/12/us/politics/trump-impeachment-values-voter.html?searchResultPosition=16",
      "subtitle": "null",
      "author": "Annie Karni",
      "content": " WASHINGTON — President Trump on Saturday night took his post-impeachment message of grievance and political warfare directly to the religious right, telling a group of social conservatives that Democrats were trying to undo the results of the 2016 campaign and “stop our movement and impose their agenda by any means necessary.” For the third consecutive night, Mr. Trump delivered a version of his combative response to the formal beginning of an impeachment inquiry declared last month by Speaker Nancy Pelosi, this time during an official presidential speech at the Values Voter Summit, an annual gathering of social conservatives in Washington. “I think she hates our country,” Mr. Trump said of Ms. Pelosi. “If she didn’t hate our country, she wouldn’t be doing this to our country. It’s a fraud.” After months of restraint, Ms. Pelosi last month charged Mr. Trump with betraying the nation’s security by seeking to enlist a foreign government to damage a political rival for his own gain. Mr. Trump’s remarks came after two nights of raucous campaign rallies, one in the progressive city of Minneapolis, and another in the deep-red district of Lake Charles, La. But at an official White House event on Saturday night, Mr. Trump delivered an almost indistinguishable message from behind a podium with a presidential seal. “I never thought I’d see or hear that word with regard to me,” Mr. Trump said. “Impeachment. To me, it’s an ugly word. It means so much; it means horrible, horrible crimes and things. I can’t even believe it.” From the start, the gathering was a chance for the president to frame the fast-moving impeachment inquiry as the latest chapter of a continuing effort by Democrats to damage him. At the event put on by the Family Research Council, Mr. Trump was introduced with a prayer for the Lord to “expose and reverse the plans of those who would hurt President Trump.” Mr. Trump, who spoke for well over an hour on Saturday night, described himself as the innocent victim of a partisan conspiracy. “First, it was the Russia hoax,” he said. “Then it was the outrageous smearing of Justice Kavanaugh.” Mr. Trump said that “now it is the outrageous impeachment” and added that “the hateful spirit that consumes the modern left violates every tenet of the American tradition.” Later on Saturday night, Mr. Trump also gave a phone interview to the Fox News host Jeanine Pirro, making him one of the sole and omnipresent voices in the White House mounting a defense of his actions and an assault on Democrats as the impeachment inquiry barrels forward. Last weekend, Trump administration officials were absent from the cable news shows. Defense Secretary Mark T. Esper and Secretary of State Mike Pompeo have TV interviews scheduled for Sunday. But Mr. Trump has emerged, so far, as something of a one-man war room setting the tone for the White House’s rebuttal to a constitutional and political showdown that could reshape his presidency and his legacy. On Saturday night, Mr. Trump did not attack former Vice President Joseph R. Biden, Jr., who is a central character in the House impeachment inquiry, which is investigating Mr. Trump’s efforts to pressure Ukraine’s president to come up with damaging information about the former vice president. But he singled out Ms. Pelosi, as well as Representative Ilhan Omar of Minnesota, a favorite progressive foil he likes to hold up as an avatar for her party. “Look at Omar, have you seen what she says?” Mr. Trump said, accusing her of harboring deep anti-Semitic sentiments. “She meant it much more so than even her words,” he said. He also accused Representative Adam B. Schiff, the chairman of the House Intelligence Committee, of “lying and cheating” and said he had instructed his lawyers to sue him as a public relations gambit. “I told my lawyers, sue him anyway, even if we lose the American public will understand,” he said. Mr. Trump reverted to the coarse language he has employed in arena rally settings, even as he spoke in front of a religious audience. “Other countries are looking at us like, what the hell is going on in the United States,” he said. But he promised the audience that he would continue to defend religious liberty and that “we will win massive victories for family, faith — just like the victory we had in 2016.”",
      "date": "Oct. 12, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Trump’s Abrupt Shifts in Middle East Unnerve U.S. Allies",
      "url": "https://www.nytimes.com/2019/10/12/world/middleeast/trumps-abandonment-of-the-kurds-in-syria-has-other-allies-worried.html?searchResultPosition=15",
      "subtitle": "null",
      "author": "David D. Kirkpatrick",
      "content": "   President Trump’s surprise acquiescence to a Turkish incursion into northern Syria this week has shaken American allies, and not just because it was a betrayal of a loyal partner. What alarmed them even more was his sheer unpredictability. His inconsistent and rapidly shifting positions in the Middle East have injected a new element of chaos into an already volatile region and have left allies guessing where the United States stands and for how long. Previous American policymakers were clear about their intentions, said Mowaffak al-Rubaie, a former Iraqi national security adviser. “This guy is all emotional,” he said. “It is unpredictable.” The uncertainties only compound simmering worries about the durability of the American commitment to the Middle East. American presidents have been promising for almost 15 years to reduce the country’s presence in the region, unnerving partners like Israel and the Persian Gulf monarchs that rely on American protection. But few American leaders have ever made and disclosed major foreign policy decisions with the speed and seeming improvisation that Mr. Trump does. No longer merely worried that Washington might withdraw, analysts say many allies are now concerned that this unpredictable commander in chief could bolt for an exit without warning. His decision to get out of the way of the Turkish incursion was apparently made on the spur of the moment during a phone call with the Turkish president, surprising many of Mr. Trump’s advisers. It opened the door to a fierce Turkish assault on the American-backed militia led by the Syrian Kurds, which was key to the ground battle to retake territory captured by the Islamic State. Attacking the Kurds, in turn, risks an Islamic State comeback. This was just the latest in a series of flip-flops in American policy in the region, including two in Syria this year alone. In December, Mr. Trump promised to withdraw the entire contingent of about 2000 American forces there. But he later changed his mind, withdrawing about half. He has repeatedly warned that the United States was “locked and loaded” for military action against Iran. But when Iran shot down an American surveillance drone this summer, Mr. Trump reversed himself in the final minutes to call off a planned missile strike. Then last month, he denounced Iran for orchestrating an attack on Saudi oil facilities but declined to take military action. His hesitance made America’s two most important allies in the region, Saudi Arabia and Israel, reassess the American commitment to the containment of Iran and, consequently, to their own security. Critics say that Mr. Trump’s zigzagging policies have emboldened regional foes, unnerved American partners, and invited Russia and various regional players to seek to exert their influence. “It is chaos,” said Michael Stephens, a scholar of the region at the Royal United Services Institute in London. “The region is in chaos because the hegemonic power does not seem to know what it wants to do, and so nobody else does.” Even in Britain, which customarily keeps its Middle East policies tightly aligned with its superpower ally, “nobody knows what to do any more, because you don’t know what is coming next,” Mr. Stephens said. “Donald Trump is pouring gasoline on the fire and leaving a lot of us very confused.” In his public defenses of his decision, Mr. Trump insists he is acting consistently and has suggested that he was fulfilling a campaign promise to get out of open-ended conflicts around the Middle East. “I was elected on getting out of these ridiculous endless wars, where our great Military functions as a policing operation to the benefit of people who don’t even like the USA,” he wrote on Twitter on Monday. To critics, his shifting defenses of his decision are reminders of his fickleness. When Mr. Trump backed away from his decision to withdraw all American troops remaining in Syria, he appeared to accept the admonitions of his military chiefs and advisers about the dire consequences of an abrupt pull out. The presence of American troops in northern Syria had helped to preserve the area as a safe haven for the Kurdish-led militia that has been Washington’s most critical ally on the ground in the fight against ISIS. Now that Kurdish-led militia is acting as jailers for tens of thousands of ISIS fighters and their families being held in camps and prisons in northern Syria near the Turkish border. The leaders of neighboring Turkey, which has battled Kurdish separatists at home for decades, saw the Syrian Kurdish militia as a threat and talked openly of a cross border campaign to crush it — if only the American troops got out of the way. But despite the warnings about a United States interest in protecting its loyal Kurdish allies and in containing the ISIS prisoners, Mr. Trump this week portrayed the plights of the Kurds as someone else’s problem. Referring to the Turks and Kurds as “natural enemies,” he said, “It is time now for others in the region, some of great wealth, to protect their own country.” As soon as Mr. Trump moved the fewer than a hundred American troops from a border area, Turkey unleashed its cross border assault on Wednesday. By Friday, there was evidence that ISIS was already attempting to regroup amid the chaos. Five militants had escaped from a Kurdish-run prison and ISIS claimed responsibility for a bombing in a provincial capital. With the White House still reeling from the withering criticism aimed at President Trump by his fellow Republicans for essentially abandoning America’s Kurdish allies, the administration announced on Saturday evening that it would release $50 million in “stabilization assistance for Syria to protect persecuted ethnic and religious minorities, and advance human rights.” Syria has not been a direct recipient of American aid in years, and the announcement said little about how it would be spent. But it was clear that it was a response to critiques that by pulling back on the American military presence in the Kurdish-controlled areas, Mr. Trump unleashed a military and humanitarian crisis. The White House said the funds would help “Syrian human rights defenders, civil society organizations, and reconciliation efforts directly supporting ethnic and religious minority victims of the conflict.” And it discussed removing “explosive remnants of war, community security for stabilization assistance, documenting human rights abuses and international humanitarian law violations, and support for survivors of gender-based violence and torture.” But it sidestepped the issue of how to make such aid work on the ground in the midst of conflict. And some of Mr. Trump’s former national security aides warned of further troubles. “We have got to keep the pressure on ISIS so they don’t recover,” former Secretary of Defense Jim Mattis said in a pretaped interview for NBC’s “Meet the Press.” Mr. Mattis, who resigned late last year when Mr. Trump first announced a Syria withdrawal, suggested that the president’s political desires to pull back troops was risky. ”We may want a war over; we may even declare it over,” Mr. Mattis said. “You can pull your troops out — as President Obama learned the hard way — out of Iraq, but the ‘enemy gets the vote’, we say in the military. And in this case, if we don’t keep the pressure on, then ISIS will resurge.” “It’s absolutely a given that they will come back,” he concluded. The decision to allow the Turkish advance came less than a month after Mr. Trump spooked American partners in the region by appearing to back down from another confrontation, that one against Iran. Mr. Trump has levied sweeping economic sanctions against Iran since May in an attempt to coerce its leaders into accepting strict restrictions on their military capabilities and nuclear energy program. During the escalating confrontation over the sanctions, he has frequently expressed a willingness to use military force against Iran. Then, according to the administration, Iran retaliated against the American sanctions by orchestrating a missile strike against the most important oil facility of Washington’s most important Arab ally, Saudi Arabia. And Mr. Trump disclaimed any responsibility. “That was an attack on Saudi Arabia, and that wasn’t an attack on us,” he said. Other countries are scurrying to adapt to the new reality. “I think many nations around the Middle East now are considering major changes in their strategic defense plans because they no longer see the United States as a reliable ally,” said Gamal Abdel Gawad Soltan, an adviser to the state-sponsored Al Ahram Center for Strategic Studies in Cairo. “I think it will be very difficult to convince nations of the Middle East that the United States is serious about what it says, and this is a major change in the strategic landscape of the Middle East.” America’s enemies, some analysts say, may also be taking note. “If you are someone that is a rival on the other side — you’re Iranian, Russian, Turkish, ISIS, Hezbollah — you understand that this is the time for gain,” argued Shimrit Meir, columnist for the Israeli newspaper Yediot Ahronot. “This is the hour. Because when the president of the United States is going all the way, saying ‘I hate military interference in the Middle East, and this is why I was elected, to stop this’ — then it’s not rocket science for the Iranians to understand that they have a lot of room for maneuver.” American involvement in the Middle East rose steadily after the United States emerged as a superpower at the end of World War II. But since the American military presence in the region reached its apex with the invasion of Iraq in 2003, presidents from both parties have tried to cut back. President Obama sought to pull out of Afghanistan but instead sent a surge of more troops to try to achieve enough stability to ease a withdrawal — a gambit that failed to achieve that goal. He withdrew American troops from Iraq in 2011. But his critics say the pullout enabled the emergence of the Islamic State, which seized a large portion of Iraq and Syria in 2014, drawing the United States military back in. Mr. Obama’s experience might now serve as a cautionary tale to Mr. Trump, who risks allowing a resurgence of the Islamic State by pulling back in Syria, argued Michele Dunne, a scholar at the Carnegie Endowment for International Peace. But unlike Mr. Trump, Mr. Obama “was terribly consistent — he said from the beginning that he wanted to pull the U.S. troops out of Iraq.” Phillip Gordon, a senior fellow at the Council on Foreign Relations and the Middle East coordinator for the Obama White House, acknowledged that pulling back from the Middle East turned out to be easier said than done. But he said he had marveled that President Trump had managed to campaign promising both to pull back from Middle Eastern conflicts and at the same time to push back more aggressively against regional foes. “You can’t do those two things at the same time,” Mr. Gordon said, and in Mr. Trump’s policies toward the conflicts in Syria and with Iran this fall “that enormous contradiction is coming back to haunt him.” Critics say that the Trump administration has been inconsistent toward the Middle East before. When Persian Gulf neighbors sought to isolate Qatar in 2017, members of Mr. Trump’s cabinet urged them to end the dispute but the president himself applauded it. He later ordered airstrikes against Syria to punish its government for using chemical weapons against rebel groups but he failed to respond after Washington confirmed another use of chemical weapons earlier this year. When a Libyan militia leader launched an attack on the country’s internationally recognized government six months ago, Secretary of State Mike Pompeo spoke out against it. President Trump, a few days later, announced that he had called the militia leader and commended his “ongoing counterterrorism efforts.” Mr. al-Rubaie, the former Iraqi national security adviser, said that two wars, billions of dollars in spending, and the expense of thousands of Americans lives should have made Iraq the “crown” of United States policy on the Middle East. But Mr. Trump “doesn’t see Iraq” and instead focuses only on the degree of Iranian influence. The Iraqis “feel let down. They feel that these people have left them and left the country. They left them high and dry,” he said. “For the Americans, their friends are disposable,” he said. “The Americans, you look for them and they look for the closest exit. You turn around and you don’t find them.”",
      "date": "Oct. 12, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "We Will Never, Ever Be Rid of Donald Trump",
      "url": "https://www.nytimes.com/2019/09/10/opinion/donald-trump.html?searchResultPosition=14",
      "subtitle": "There is no black Sharpie to write him out of our consciousness.",
      "author": "Frank Bruni",
      "content": " House Democrats are inching closer to a formal impeachment inquiry, as if that’s how best to exorcise Donald Trump from the body politic. Mark Sanford just became the third Republican to announce a 2020 primary challenge and to dream of a successful insurrection against an emperor  whom most of the party meekly obeys. And 10 Democrats will take the stage on Thursday night for their party’s next presidential debate, each determined to present himself or herself as the surest route to the far side of Trump. So now is as good a time as any to state what should be obvious to anyone who has considered Trump’s psychology, registered his megalomania and taken full account of his behavior to date. We will never, ever be rid of him. Oh, sure, we may remove him from the presidency, which is no small thing. But that won’t get him out of the nation’s bloodstream. It sure as hell won’t shut him up. If you think he has demolished all the norms of what it means to be the president of the United States, just wait until you see the sledgehammer he takes to the traditional role and restraint of former presidents. He won’t be at an easel in remote Texas, like George W. Bush. He won’t be biting his tongue and taking big, deep, centering breaths, like Barack Obama. A foundation devoted to good works? Been there, done that, and it was a perfect mirror of the man, which is to say a complete sham. It’s under investigation by the State of New York. No, he’ll be tweeting, bleating, ranting and raging in precisely the manner that he is now, just without the nuclear codes. And if that transition happens after November 2020, he’ll declare the election suspect, fraudulent, the result of a media crusade against him, the fruit of illegal votes. He pressed that narrative in 2016 even though he was declared the victor. A winner that sore is poised to be an epically nasty loser, and I have an easier time imagining a “Thelma and Louise” remake starring Felicity Huffman and Lori Loughlin than I do the Trumps graciously beckoning the Warrens across the threshold of 1600 Pennsylvania Avenue. [Get a more personal take on politics, newsmakers and more with Frank Bruni’s exclusive commentary every week. Sign up for his newsletter.] The post-Trump landscape — or, rather, the impossibility of one — is on my mind in part because of a prediction by Brad Parscale, the manager of the Trump 2020 campaign, at a California Republican convention last weekend. “The Trumps will be a dynasty that will last for decades, propelling the Republican Party into a new party,” he said in a speech to delegates. Then The Atlantic published a riveting cover story by McKay Coppins that in some ways raised the same prospect, reporting that Ivanka and Don Jr. are jockeying to be their dad’s rightful political heir and noting that the Trump progeny are genetically wired to wring every last droplet from their father’s celebrity that they can. Flashing back to the night in November 2016 when the family watched the election returns, Coppins wrote that they were in shock, because Trump “was supposed to go down in a spectacular blaze of made-for-TV martyrdom that all of them could capitalize on. Ivanka had a book coming out. Don and Eric were working on a line of patriotically themed budget hotels. And preliminary talks were underway to launch a Trump-branded TV network that would turn disgruntled voters into viewers. Now they needed a new plan.” Apparently it’s one modeled after the Kennedys and the Bushes, only with a much bigger budget for hair and makeup. Best of luck, Trumpkins. I just don’t see it. Ivanka — or, as I like to think of her, Our Lady of the DMZ — has shown a shocking tone-deafness during her White House romp. And Don Jr. was the nitwit emailing ecstatically and then lying badly about that June 2016 meeting with the Russian, um, adoption evangelists. These two have all of Dad’s gall but only a scintilla of his guile. Trump won’t hang around by proxy, in a next generation of opportunists with his surname or agenda. That would negate the whole point of his pivot into politics. It wasn’t to promote ideas; it was to promote himself. Health permitting, he’ll move heaven and earth to maintain his omnipresence in American life, by which I mean he’ll be as outrageous as he must to stay in the news. And we in the media will confront a decision: Give him what he wants, or let go of him and all the eyeballs he draws? Even if we let go, there’s the strong possibility, as Coppins noted, that he’ll establish his own media enterprise, with a network where the news really is fake, adulation doesn’t hinge on nuisances like the ballot box and Sean Hannity isn’t the model for Trump veneration. He’s the baseline. From that coddled perch Trump can take out his big black Sharpie and write higher vote counts over his actual, official ones. He can draw horns on John Bolton and a halo over William Barr. He can sketch a second White House adjacent to the first one but taller, with gold trim. That’s where he’ll be living, his power fictive but his presence ineluctable, snappily ever after.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Deutsche Bank Does Not Have Trump’s Tax Returns, Court Says",
      "url": "https://www.nytimes.com/2019/10/10/business/deutsche-bank-trump-tax-returns.html?searchResultPosition=13",
      "subtitle": "null",
      "author": "David Enrich",
      "content": " If investigators are going to get their hands on President Trump’s tax returns, they will have to find them somewhere other than Deutsche Bank. The German bank — which for nearly two decades was the only mainstream financial institution consistently willing to lend money to Mr. Trump — has told a federal appeals court that it does not have the president’s personal tax returns, the court said on Thursday. Democratic-controlled congressional committees issued subpoenas to Deutsche Bank this year for financial records related to the president, his companies and his family. Mr. Trump sued the bank, which became his main lender after a string of bankruptcies cost other banks hundreds of millions of dollars, to block it from complying. That litigation is working its way through the federal courts. Last month, The New York Times and other media outlets asked the United States Court of Appeals for the Second Circuit in New York to unseal a letter from Deutsche Bank that identified two members of the Trump family whose tax returns the bank possesses. On Thursday, the court rejected the request. Part of the reason, it said, was that Deutsche Bank had informed the court that “the only tax returns it has for individuals and entities named in the subpoenas are not those of the president.” Current and former bank officials previously told The Times that Deutsche Bank had portions of Mr. Trump’s personal and corporate tax returns. The bank collected at least some of those tax records in 2011, when Deutsche Bank’s private-banking arm — which caters to the ultra-wealthy — took on Mr. Trump as a client. The returns and other financial documents were reviewed by a number of bank executives, according to the current and former officials. Deutsche Bank relied on the information provided in the tax returns and other financial documents to approve a series of loans to Mr. Trump in early 2012 in connection with his Doral golf resort in Florida and his Chicago skyscraper. Over the ensuing years, Deutsche Bank’s private-banking arm continued lending to Mr. Trump, including $170 million in 2014 to convert the Old Post Office building, a few blocks from the White House, into a hotel. By the time Mr. Trump was sworn in as president, he owed the bank more than $300 million, making it his largest creditor. It is unclear when Deutsche Bank stopped retaining Mr. Trump’s tax returns. A former senior bank executive, who said he had seen the returns, said the normal practice was for Deutsche Bank to keep such materials on file. Troy Gravitt, a Deutsche Bank spokesman, said the bank was “committed to cooperating with authorized investigations.” Breaking with decades of presidential precedent, Mr. Trump has refused to publicly disclose his federal tax returns, and Democrats are keen to obtain the documents, believing they are crucial to unlocking his closely guarded financial secrets. Mr. Trump is fighting those efforts. Mr. Trump’s lawyers sued Deutsche Bank and another lender, Capital One, to block them from complying with subpoenas that were issued in April by the House Intelligence and Financial Services Committees. The Financial Services Committee has said it wants to know whether Mr. Trump helped Russians and other foreign real estate buyers launder money through his properties, and the Intelligence Committee is trying to determine whether Mr. Trump’s financial dealings made him subject to foreign influence. Mr. Trump’s lawyers have argued the subpoenas have no legitimate legislative purpose. During one hearing, judges from the appeals court asked the banks’ lawyers whether they had copies of Mr. Trump’s returns, and requested a written answer. Deutsche Bank released a partly redacted letter saying it did have at least draft versions of some returns covered by the subpoenas, prompting the news media requests for the information to be unsealed. Investigators seeking Mr. Trump’s tax returns have other avenues to pursue. Another congressional committee and the Manhattan district attorney have subpoenaed Mr. Trump’s accounting firm, Mazars USA, for his tax returns. Mr. Trump has sued to block those subpoenas as well; on Monday, a federal judge sided with the Manhattan district attorney’s office, but Mr. Trump’s lawyers quickly appealed. The House Ways and Means Committee asked the I.R.S. this year to hand over six years of Mr. Trump’s returns. The Treasury Department has refused that request.",
      "date": "Oct. 10, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Meet the Hosts",
      "url": "https://www.nytimes.com/2019/10/10/opinion/the-argument-trump-impeachment-syria.html?searchResultPosition=12",
      "subtitle": "null",
      "author": "",
      "content": "Listen and subscribe to our podcast from your mobile device: Apple Podcasts | Spotify | Google Play | RadioPublic | Stitcher Is the threat of impeachment making President Trump more erratic — and more dangerous? With Michelle Goldberg out on assignment, fellow Op-Ed columnist Jamelle Bouie returns to “The Argument” to discuss Trump’s decision to withdraw American troops from Syria and his defiance in the face of Democrats’ impeachment inquiry. The Syria decision was particularly ill advised because it alienated Republican lawmakers and elements of the president’s base at a critical time, argues Ross Douthat. Jamelle thinks Trump’s behavior is likely to become increasingly volatile as public support for impeachment grows. And David Leonhardt wants to see more ex-administration officials speak out against their former boss’s chaotic moves. Then, with the conservative-leaning Supreme Court back in session and a slew of big cases on the docket, the columnists debate whether Democrats should answer Republicans’ constitutional hardball with their own. And finally, as a movie set in the dark and gritty New York of the 1980s dominates the box office, Jamelle recommends a star-studded, similarly set film made closer to the era it depicts. Background Reading: I’ve been an Op-Ed columnist since 2009, and I write about politics, religion, pop culture, sociology and the places where they all intersect. I’m a Catholic and a conservative, in that order, which means that I’m against abortion and critical of the sexual revolution, but I tend to agree with liberals that the Republican Party is too friendly to the rich. I was against Donald Trump in 2016 for reasons specific to Donald Trump, but in general I think the populist movements in Europe and America have legitimate grievances and I often prefer the populists to the “reasonable” elites. I’ve written books about Harvard, the G.O.P., American Christianity and Pope Francis; I’m working on one about decadence. Benedict XVI was my favorite pope. I review movies for National Review and have strong opinions about many prestige television shows. I have three small children, two girls and a boy, and I live in New Haven with my wife. I’ve been an Op-Ed columnist at The New York Times since 2017, writing mainly about politics, ideology and gender. These days people on the right and the left both use “liberal” as an epithet, but that’s basically what I am, though the nightmare of Donald Trump’s presidency has radicalized me and pushed me leftward. I’ve written three books, including one, in 2006, about the danger of right-wing populism in its religious fundamentalist guise. (My other two were about the global battle over reproductive rights and, in a brief detour from politics, about an adventurous Russian émigré who helped bring yoga to the West.) I love to travel; a long time ago, after my husband and I eloped, we spent a year backpacking through Asia. Now we live in Brooklyn with our son and daughter. I’ve worked at The Times since 1999 and have been an Op-Ed columnist since 2016. I caught the journalism bug a very long time ago — first as a little kid in the late 1970s who loved reading the Boston Globe sports section and later as a teenager working on my high school and college newspapers. I discovered that when my classmates and I put a complaint in print, for everyone to see, school administrators actually paid attention. I’ve since worked as a metro reporter at The Washington Post and a writer at Businessweek magazine. At The Times, I started as a reporter in the business section and have also been a Times Magazine staff writer, the Washington bureau chief and the founding editor of The Upshot. My politics are left of center. But I’m also to the right of many Times readers. I think education reform has accomplished a lot. I think two-parent families are good for society. I think progressives should be realistic about the cultural conservatism that dominates much of this country. Most of all, however, I worry deeply about today’s Republican Party, which has become dangerously extreme. This country faces some huge challenges — inequality, climate change, the rise of China — and they’ll be very hard to solve without having both parties committed to the basic functioning of American democracy. Tune in on iTunes, Google Play, Spotify, Stitcher or wherever you listen to podcasts. Tell us what you think at argument@nytimes.com. Follow Michelle Goldberg (@michelleinbklyn), Ross Douthat (@DouthatNYT) and David Leonhardt (@DLeonhardt) on Twitter. This week’s show is produced by Kristin Schwab for Transmitter Media and edited by Sara Nics. Our executive producer is Gretta Cohn. We had help from Tyson Evans, Phoebe Lett and Ian Prasad Philbrick. Our theme is composed by Allison Leyton-Brown.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Those Foreign Business Ties? The Trump Sons Have Plenty Too",
      "url": "https://www.nytimes.com/2019/10/11/us/politics/donald-trump-jr-eric-trump-business.html?searchResultPosition=11",
      "subtitle": "null",
      "author": "Eric Lipton",
      "content": "   Last month, the Trump family business received approval from a local government in Scotland for a major expansion of its golf resort near Aberdeen, marking the largest real estate development financed by the Trump Organization since the 2016 election. In August, President Trump’s eldest son, Donald Jr., flew to Jakarta to help kick-start sales at a pair of Trump-branded luxury resorts planned for Indonesia. He appeared at a private event with wealthy prospective buyers and joined his politically connected billionaire Indonesian business partner at a news conference. And last year, Donald Jr. visited India to sell condos at future Trump-branded towers, appearing at an event that also featured India’s prime minister. “I’m here as a businessman,” Mr. Trump told the gathering in New Delhi. “I’m not representing anyone.” But for the children of the politically powerful, personal business and public dealings can often be indistinguishable, especially when private projects depend on foreign governments that are looking to bolster ties with Washington. In recent weeks, as the president has become embroiled in a scandal involving his interactions with Ukraine, Donald Trump Jr. and his brother Eric have taken to attacking Hunter Biden, the son of former Vice President Joseph R. Biden Jr., for his business dealings in Ukraine and China. The brothers have accused him of leveraging his family name for personal gain while his father served in the Obama administration. Among other things, Hunter Biden was on the board of a Ukrainian energy company that has been a focus of Mr. Trump’s interest in the country. “At the VERY LEAST, there’s the appearance of impropriety,” Donald Trump Jr. wrote on Twitter. “A clear conflict of interest.” At a rally in Minneapolis on Thursday, Eric Trump’s charged remarks about the former vice president’s son inspired the crowd of Trump supporters to chant, “Lock him up!” Republicans, led by the president, have sought to make Hunter Biden’s international business dealings an issue in the impeachment debate in Washington. But the high-profile attack roles being played by Mr. Trump’s eldest sons have now thrust their own business dealings into the spotlight too. Both sons have operated and promoted the Trump family business overseas during their father’s presidency, even as he retains ownership. And while the Trump and Biden father-son relationships differ in many ways, the business dealings have set up a simple parallel. “They are criticizing the vice president’s son for doing exactly what they are doing themselves,” said Martin Ford, a member of the Aberdeenshire Council in Scotland, which voted last month to approve a proposal by the Trumps to build a 500-unit housing development. “They are conducting international business here in Scotland.” Eric Trump, in a statement to The New York Times, said there was a distinction between his father’s career in business, with his recent turn to politics, and Mr. Biden’s decades in public office. “When my father became president, our family stopped doing international business deals,” he said, a reference to a pledge by the Trump Organization not to begin new overseas projects during the Trump presidency. Hunter Biden, he said, did the opposite when his father became vice president. The Trump business activities in India, Indonesia and Scotland were considered in compliance with the pledge, according to the company’s ethics rules, because they were building on deals already in the works. Mr. Biden’s campaign declined to comment on Friday. But in a tweet, the former vice president once again suggested that the attacks on his son were part of a political smear campaign. “Let me make something clear to President Trump: I’m not going anywhere,” he wrote. “You’re not going to destroy me. And you’re not going to destroy my family. I don’t care how dirty the attacks get.” Conducting business on the international stage has long been standard for the Trump Organization, which has placed the Trump name on hotels and towers in several countries. But its international dealings have become far more complicated since Mr. Trump took office and his sons took leadership of the business, especially when foreign governments have been involved to the company’s benefit. When the Trump Organization tangled with the majority owner of a property in Panama, for example, its local lawyers at one point called on the Panamanian president for an assist. In Indonesia, the government is helping to build a major new highway that will make a new Trump development more accessible. Construction is scheduled to begin soon on what will be known as Trump Residences Lido, which will include 280 homes, a golf course and a hotel, south of Jakarta. The Trump family’s partner in Indonesia — a billionaire named Hary Tanoesoedibjo — is financing the project, with the Trump family getting a cut of the sales. In marketing materials released this summer, which featured the Trump family logo and a photograph of Donald Trump Jr., the company noted that the “Trump Residences Lido can be accessed directly through the newly opened Bocimi Toll Road.” In Scotland, the Aberdeenshire Council recently dropped an earlier requirement that the new housing development could not be built until the Trumps spent tens of millions of dollars on other investments at the resort. Sebastian Leslie, a local official who supported the project, said the family received no special consideration. “We don’t do that — we don’t give anybody special favors,” Mr. Leslie said. But Mr. Martin, a council member who opposed the approval, said the Trumps benefited handsomely from the change. “It is a much, much more lucrative deal now,” he said. Revenues coming to the Trump family in the United States have drawn scrutiny too, including at the Trump International Hotel in Washington — a property, opened in the final stages of the 2016 campaign, that has flourished while Donald Trump Jr. and Eric have run the company. The hotel has been a magnet for Republican lobbyists and political fund-raisers, and companies and foreign officials with business before the Trump administration have thrown parties there, including the Kuwait embassy and the government of Azerbaijan. Mr. Trump’s daughter Ivanka has also retained a stake in the family business even as she serves as a White House adviser, and last year she received trademarks in China related to her separate fashion ventures. Her husband, Jared Kushner, a senior adviser to the president, maintains a stake in his own family’s real estate business, which has received and sought funding from international sources as well. In 2017, Mr. Kushner met privately at the White House with top executives from Citibank and the private equity firm Apollo Global Management. Those meetings came as the firms were contemplating sizable loans to his family’s business, Kushner Companies, which they did eventually make. And since Mr. Kushner entered the White House, his family has courted state-connected investors in China and the Middle East — both regions that were in Mr. Kushner’s government portfolio — to bail out the firm’s headquarters at 666 Fifth Avenue in Manhattan. But the presidency has also come with some costs for the Trump family business since the sons have been at the helm. The company had been banking on global expansion to drive its growth, but when the president agreed to put a hold on new foreign deals, it curtailed those ambitions for his sons. George Sorial, the company’s chief compliance counsel when the policy was developed, said it was the right thing to do even though it was not required by law and had cost the company significantly. Eric Trump, in his statement to The Times, suggested that even the decision to forgo new foreign deals could be seen through the prism of Hunter Biden. “My father was one of the most famous businessmen on earth and he sacrificed billions to be our president,” he said. “Joe Biden was an incredibly influential politician — his family made millions.” The Biden campaign also sees opportunity in the nasty dispute. In a fund-raising email sent on Friday, the campaign singled out the Trump sons and the “lock him up” chant at the Thursday rally. “We are fighting back against this nonsense as hard as we know how every single day,” the campaign wrote.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "The Real Donald Trump Is a Character on TV",
      "url": "https://www.nytimes.com/2019/09/06/opinion/sunday/trump-reality-tv.html?searchResultPosition=10",
      "subtitle": "Understand that, and you’ll understand what he’s doing in the White House.",
      "author": "James Poniewozik",
      "content": " On Sept. 1, with a Category 5 hurricane off the Atlantic coast, an angry wind was issuing from the direction of President Trump’s Twitter account. The apparent emergency: Debra Messing, the co-star of “Will & Grace,” had tweeted that “the public has a right to know” who is attending a Beverly Hills fund-raiser for Mr. Trump’s re-election. “I have not forgotten that when it was announced that I was going to do The Apprentice, and when it then became a big hit, Helping NBC’s failed lineup greatly, @DebraMessing came up to me at an Upfront & profusely thanked me, even calling me ‘Sir,’ ” wrote the 45th president of the United States. It was a classic Trumpian ragetweet: aggrieved over a minor slight, possibly prompted by a Fox News segment, unverifiable — he has a long history of questionable tales involving someone calling him “Sir” — and nostalgic for his primetime-TV heyday. (By Thursday he was lashing Ms. Messing again, as Hurricane Dorian was lashing the Carolinas.) [James Poniewozik answered questions about this essay on Twitter: part I, part II] This sort of outburst, almost three years into his presidency, has kept people puzzling over who the “real” Mr. Trump is and how he actually thinks. Should we take him, to quote the famous precept of Trumpology, literally or seriously? Are his attacks impulsive tantrums or strategic distractions from his other woes? Is he playing 3-D chess or Rock ’Em Sock ’Em Robots? This is a futile effort. Try to understand Donald Trump as a person with psychology and strategy and motivation, and you will inevitably spiral into confusion and covfefe. The key is to remember that Donald Trump is not a person. He’s a TV character. I mean, O.K., there is an actual person named Donald John Trump, with a human body and a childhood and formative experiences that theoretically a biographer or therapist might usefully delve into someday. (We can only speculate about the latter; Mr. Trump has boasted on Twitter of never having seen a psychiatrist, preferring the therapeutic effects of “hit[ting] ‘sleazebags’ back.”) But that Donald Trump is of limited significance to America and the world. The “Donald Trump” who got elected president, who has strutted and fretted across the small screen since the 1980s, is a decades-long media performance. To understand him, you need to approach him less like a psychologist and more like a TV critic. He was born in 1946, at the same time that American broadcast TV was being born. He grew up with it. His father, Fred, had one of the first color TV sets in Jamaica Estates. In “The Art of the Deal” Donald Trump recalls his mother, Mary Anne, spending a day in front of the tube, enraptured by the coronation of Queen Elizabeth in 1953. (“For Christ’s sake, Mary,” he remembers his father saying, “Enough is enough, turn it off. They’re all a bunch of con artists.”) TV was his soul mate. It was like him. It was packed with the razzle-dazzle and action and violence that captivated him. He dreamed of going to Hollywood, then he shelved those dreams in favor of his father’s business and vowed, according to the book “TrumpNation” by Timothy O’Brien, to “put show business into real estate.” As TV evolved from the homogeneous three-network mass medium of the mid-20th century to the polarized zillion-channel era of cable-news fisticuffs and reality shocker-tainment, he evolved with it. In the 1980s, he built a media profile as an insouciant, high-living apex predator. In 1990, he described his yacht and gilded buildings to Playboy as “Props for the show … The show is ‘Trump’ and it is sold-out performances everywhere.” He syndicated that show to Oprah, Letterman, NBC, WrestleMania and Fox News. Everything he achieved, he achieved by using TV as a magnifying glass, to make himself appear bigger than he was. He was able to do this because he thought like a TV camera. He knew what TV wanted, what stimulated its nerve endings. In his campaign rallies, he would tell The Washington Post, he knew just what to say “to keep the red light on”: that is, the light on a TV camera that showed that it was running, that you mattered. Bomb the [redacted] out of them! I’d like to punch him in the face! The red light radiated its approval. Cable news aired the rallies start to finish. For all practical purposes, he and the camera shared the same brain. Even when he adopted social media, he used it like TV. First, he used it like a celebrity, to broadcast himself, his first tweet in 2009 promoting a “Late Show With David Letterman” appearance. Then he used it like an instigator, tweeting his birther conspiracies before he would talk about them on Fox News, road-testing his call for a border wall during the cable-news fueled Ebola and border panics of the 2014 midterms. When he was a candidate, and especially when he was president, his tweets programmed TV and were amplified by it. On CNBC, a “BREAKING NEWS: TRUMP TWEET” graphic would spin out onscreen as soon as the words left his thumbs. He would watch Fox News, or Lou Dobbs, or CNN or “Morning Joe” or “Saturday Night Live” (“I don’t watch”), and get mad, and tweet. Then the tweets would become TV, and he would watch it, and tweet again. If you want to understand what President Trump will do in any situation, then, it’s more helpful to ask: What would TV do? What does TV want? It wants conflict. It wants excitement. If there is something that can blow up, it should blow up. It wants a fight. It wants more. It is always eating and never full. Some presidential figure-outers, trying to understand the celebrity president through a template that they were already familiar with, have compared him with Ronald Reagan: a “master showman” cannily playing a “role.” The comparison is understandable, but it’s wrong. Presidents Reagan and Trump were both entertainers who applied their acts to politics. But there’s a crucial difference between what “playing a character” means in the movies and what it means on reality TV. Ronald Reagan was an actor. Actors need to believe deeply in the authenticity and interiority of people besides themselves — so deeply that they can subordinate their personalities to “people” who are merely lines on a script. Acting, Reagan told his biographer Lou Cannon, had taught him “to understand the feelings and motivations of others.” Being a reality star, on the other hand, as Donald Trump was on “The Apprentice,” is also a kind of performance, but one that’s antithetical to movie acting. Playing a character on reality TV means being yourself, but bigger and louder. Reality TV, writ broadly, goes back to Allen Funt’s “Candid Camera,” the PBS documentary “An American Family,” and MTV’s “The Real World.” But the first mass-market reality TV star was Richard Hatch, the winner of the first season of “Survivor” — produced by Mark Burnett, the eventual impresario of “The Apprentice”— in the summer of 2000. Mr. Hatch won that first season in much the way that Mr. Trump would run his 2016 campaign. He realized that the only rules were that there were no rules. He lied and backstabbed and took advantage of loopholes, and he argued — with a telegenic brashness — that this made him smart. This was a crooked game in a crooked world, he argued to a final jury of players he’d betrayed and deceived. But, hey: At least he was open about it! While shooting that first season, the show’s crew was rooting for Rudy Boesch, a 72-year-old former Navy SEAL and model of hard work and fair play. “The only outcome nobody wanted was Richard Hatch winning,” the host, Jeff Probst, would say later. It “would be a disaster.” After all, decades of TV cop shows had taught executives the iron rule that the viewers needed the good guy to win. But they didn’t. “Survivor” was addictively entertaining, and audiences loved-to-hate the wryly devious Richard the way they did Tony Soprano and, before him, J.R. Ewing. More than 50 million people watched the first-season finale, and “Survivor” has been on the air nearly two decades. From Richard Hatch, we got a steady stream of Real Housewives, Kardashians, nasty judges, dating-show contestants who “didn’t come here to make friends” and, of course, Donald Trump. Reality TV has often gotten a raw deal from critics. (Full disclosure: I still watch “Survivor.”) Its audiences, often dismissed as dupes, are just as capable of watching with a critical eye as the fans of prestige cable dramas. But when you apply its mind-set — the law of the TV jungle — to public life, things get ugly. In reality TV — at least competition reality shows like “The Apprentice” — you do not attempt to understand other people, except as obstacles or objects. To try to imagine what it is like to be a person other than yourself (what, in ordinary, off-camera life, we call “empathy”) is a liability. It’s a distraction that you have to tune out in order to project your fullest you. Reality TV instead encourages “getting real.” On MTV’s progressive, diverse “Real World,” the phrase implied that people in the show were more authentic than characters on scripted TV — or even than real people in your own life, who were socially conditioned to “be polite.” But “getting real” would also resonate with a rising conservative notion: that political correctness kept people from saying what was really on their minds. Being real is not the same thing as being honest. To be real is to be the most entertaining, provocative form of yourself. It is to say what you want, without caring whether your words are kind or responsible — or true — but only whether you want to say them. It is to foreground the parts of your personality (aggression, cockiness, prejudice) that will focus the red light on you, and unleash them like weapons. Maybe the best definition of being real came from the former “Apprentice” contestant and White House aide Omarosa Manigault Newman in her memoir, “Unhinged.” Mr. Trump, she said, encouraged people in his entourage to “exaggerate the unique part of themselves.” When you’re being real, there is no difference between impulse and strategy, because the “strategy” is to do what feels good. This is why it misses a key point to ask, as Vanity Fair recently did after Mr. Trump’s assault on Representative Elijah E. Cummings and the city of Baltimore in July, “Is the president a racist, or does he just play one on TV?” In reality TV, if you are a racist — and reality TV has had many racists, like Katie Hopkins, the far-right British “Apprentice” star the president frequently retweets — then you are a racist and you play one on TV. So if you actually want a glimpse into the mind of Donald J. Trump, don’t look for a White House tell-all or some secret childhood heartbreak. Go to the streaming service Tubi, where his 14 seasons of “The Apprentice” recently became accessible to the public. You can fast-forward past the team challenges and the stagey visits to Trump-branded properties. They’re useful in their own way, as a picture of how Mr. Burnett buttressed the future president’s Potemkin-zillionaire image. But the unadulterated, 200-proof Donald Trump is found in the boardroom segments, at the end of each episode, in which he “fires” one contestant. In theory, the boardroom is where the best performers in the week’s challenges are rewarded and the screw-ups punished. In reality, the boardroom is a new game, the real game, a free-for-all in which contestants compete to throw one another under the bus and beg Mr. Trump for mercy. There is no morality in the boardroom. There is no fair and unfair in the boardroom. There is only the individual, trying to impress Mr. Trump, to flatter Mr. Trump, to commune with his mind and anticipate his whims and fits of pique. Candidates are fired for giving up advantages (stupid), for being too nice to their adversaries (weak), for giving credit to their teammates, for interrupting him. The host’s decisions were often so mercurial, producers have said, that they would have to go back and edit the episodes to impose some appearance of logic on them. What saves you in the boardroom? Fighting. Boardroom Trump loves to see people fight each other. He perks up at it like a cat hearing a can opener. He loves to watch people scrap for his favor (as they eventually would in his White House). He loves asking contestants to rat out their teammates and watching them squirm with conflict. The unity of the team gives way to disunity, which in the Trumpian worldview is the most productive state of being. And America loved boardroom Trump — for a while. He delivered his catchphrase in TV cameos and slapped it on a reissue of his 1980s Monopoly knockoff Trump: The Game. (“I’m back and you’re fired!”) But after the first season, the ratings dropped; by season four they were nearly half what they were in season one. He reacted to his declining numbers by ratcheting up what worked before: becoming a louder, more extreme, more abrasive version of himself. He gets more insulting in the boardroom — “You hang out with losers and you become a loser”— and executes double and quadruple firings. It’s a pattern that we see as he advances toward his re-election campaign, with an eye not on the Nielsen ratings but on the polls: The only solution for any given problem was a Trumpier Trump. Did it work for “The Apprentice”? Yes and no. His show hung on to a loyal base through 14 seasons, including the increasingly farcical celebrity version. But it never dominated its competition again, losing out, despite his denials, to the likes of the sitcom “Mike & Molly.” Donald Trump’s “Apprentice” boardroom closed for business on Feb. 16, 2015, precisely four months before he announced his successful campaign for president. And also, it never closed. It expanded. It broke the fourth wall. We live inside it now. Now, Mr. Trump re-creates the boardroom’s helter-skelter atmosphere every time he opens his mouth or his Twitter app. In place of the essentially dead White House press briefing, he walks out to the lawn in the morning and reporters gaggle around him like “Apprentice” contestants awaiting the day’s task. He rails and complains and establishes the plot points for that day’s episode: Greenland! Jews! “I am the chosen one!” Then cable news spends morning to midnight happily masticating the fresh batch of outrages before memory-wiping itself to prepare for tomorrow’s episode. Maybe this sounds like a TV critic’s overextended metaphor, but it’s also the president’s: As The Times has reported, before taking office, he told aides to think of every day as “an episode in a television show in which he vanquishes rivals.” Mr. Trump has been playing himself instinctually as a character since the 1980s; it’s allowed him to maintain a profile even through bankruptcies and humiliations. But it’s also why, on the rare occasions he’s had to publicly attempt a role contrary to his nature — calling for healing from a script after a mass shooting, for instance — he sounds as stagey and inauthentic as an unrehearsed amateur doing a sitcom cameo. His character shorthand is “Donald Trump, Fighter Guy Who Wins.” Plop him in front of a camera with an infant orphaned in a mass murder, and he does not have it in his performer’s tool kit to do anything other than smile unnervingly and give a fat thumbs-up. This is what was lost on commentators who kept hoping wanly that this State of the Union or that tragedy would be the moment he finally became “presidential.” It was lost on journalists who felt obligated to act as though every modulated speech from a teleprompter might, this time, be sincere. The institution of the office is not changing Donald Trump, because he is already in the sway of another institution. He is governed not by the truisms of past politics but by the imperative of reality TV: Never de-escalate and never turn the volume down. This conveniently echoes the mantra he learned from his early mentor, Roy Cohn: Always attack and never apologize. He serves up one “most shocking episode ever” after another, mining uglier pieces of his core each time: progressing from profanity about Haiti and Africa in private to publicly telling four minority American congresswomen, only one of whom was born outside the United States, to “go back” to the countries they came from. The taunting. The insults. The dog whistles. The dog bullhorns. The “Lock her up” and “Send her back.” All of it follows reality-TV rules. Every season has to top the last. Every fight is necessary, be it against Ilhan Omar or Debra Messing. Every twist must be more shocking, every conflict more vicious, lest the red light grow bored and wink off. The only difference: Now there’s no Mark Burnett to impose retroactive logic on the chaos, only press secretaries, pundits and Mike Pence. To ask whether any of this is “instinct” or “strategy” is a parlor game. If you think like a TV camera — if thinking in those reflexive microbursts of adrenaline and testosterone has served you your whole life — then the instinct is the strategy. And to ask who the “real” Donald Trump is, is to ignore the obvious. You already know who Donald Trump is. All the evidence you need is right there on your screen. He’s half-man, half-TV, with a camera for an eye that is constantly focused on itself. The red light is pulsing, 24/7, and it does not appear to have an off switch.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Donald Trump vs. the United States of America",
      "url": "https://www.nytimes.com/2019/09/22/opinion/trump-ukraine-whistle-blower.html?searchResultPosition=9",
      "subtitle": "Just the facts, in 40 sentences.",
      "author": "David Leonhardt",
      "content": " Sometimes it’s worth stepping back to look at the full picture. He has pressured a foreign leader to interfere in the 2020 American presidential election. He urged a foreign country to intervene in the 2016 presidential election. He divulged classified information to foreign officials. He publicly undermined American intelligence agents while standing next to a hostile foreign autocrat. He hired a national security adviser who he knew had secretly worked as a foreign lobbyist. He encourages foreign leaders to enrich him and his family by staying at his hotels. He genuflects to murderous dictators. He has alienated America’s closest allies. He lied to the American people about his company’s business dealings in Russia. He tells new lies virtually every week — about the economy, voter fraud, even the weather. He spends hours on end watching television and days on end staying at resorts. He often declines to read briefing books or perform other basic functions of a president’s job. He has aides, as well as members of his own party in Congress, who mock him behind his back as unfit for office. [Sign up for David Leonhardt’s daily newsletter with commentary on the news and reading suggestions from around the web.] He has repeatedly denigrated a deceased United States senator who was a war hero. He insulted a Gold Star family — the survivors of American troops killed in action. He described a former first lady, not long after she died, as “nasty.” He described white supremacists as “some very fine people.” He told four women of color, all citizens and members of Congress, to “go back and help fix the totally broken and crime-infested places from which they came.” He made a joke about Pocahontas during a ceremony honoring Native American World War II veterans. He launched his political career by falsely claiming that the first black president was not really American. He launched his presidential campaign by describing Mexicans as “rapists.” He has described women, variously, as “a dog,” “a pig” and “horseface,” as well as “bleeding badly from a facelift” and having “blood coming out of her wherever.” He has been accused of sexual assault or misconduct by multiple women. He enthusiastically campaigned for a Senate candidate who was accused of molesting multiple teenage girls. He waved around his arms, while giving a speech, to ridicule a physically disabled person. He has encouraged his supporters to commit violence against his political opponents. He has called for his opponents and critics to be investigated and jailed. He uses a phrase popular with dictators — “the enemy of the people” — to describe journalists. He attempts to undermine any independent source of information that he does not like, including judges, scientists, journalists, election officials, the F.B.I., the C.I.A., the Congressional Budget Office and the National Weather Service. He has tried to harass the chairman of the Federal Reserve into lowering interest rates. He said that a judge could not be objective because of his Mexican heritage. He obstructed justice by trying to influence an investigation into his presidential campaign. He violated federal law by directing his lawyer to pay $280,000 in hush money to cover up two apparent extramarital affairs. He made his fortune partly through wide-scale financial fraud. He has refused to release his tax returns. He falsely accused his predecessor of wiretapping him. He claimed that federal law-enforcement agents and prosecutors regularly fabricated evidence, thereby damaging the credibility of criminal investigations across the country. He has ordered children to be physically separated from their parents. He has suggested that America is no different from or better than Vladimir Putin’s Russia. He has called America a “hellhole.” He is the president of the United States, and he is a threat to virtually everything that the United States should stand for.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "How Donald Trump’s Obsession With Immigrants Has Shaped His Presidency",
      "url": "https://www.nytimes.com/2019/10/08/books/review/border-wars-julie-hirschfeld-davis-michael-d-shear.html?searchResultPosition=8",
      "subtitle": "null",
      "author": "Joe Klein",
      "content": " BORDER WARS\nInside Trump’s Assault on Immigration\nBy Julie Hirschfeld Davis and Michael D. Shear On the morning of Jan. 11, 2018, Senator Richard Durbin, Democrat of Illinois, received a phone call from the president of the United States, Donald J. Trump, summoning him to the White House. Durbin had been working for months with Senator Lindsey Graham, Republican of South Carolina, on a deal to grant legal status to the so-called “Dreamers” — children who had been brought illegally into the country by their parents when they were very young, had grown up here and knew only the United States as home. The news from Trump was encouraging. “Wow,” Durbin told an aide. “I think we may actually have a deal.” Durbin and Graham — who received a similar call that morning — expected a private meeting with the president, but as they waited in the West Wing lobby a phalanx of hard-liners arrived, led by Stephen Miller, the young mastermind of Trump’s draconian immigration policies. Were they being ambushed? Durbin wondered. Indeed, they were. The meeting lapsed into a notorious Trump rant — about accepting immigrants from “shithole countries.” The president seemed amazed by the Durbin-Graham proposal: “Wait a minute — why do we want people from Haiti here?” Why not more people from Norway? Graham was flabbergasted: What had happened between 10 a.m., when the president called offering the deal, and noon, when the historic Oval Office tirade had taken place? “I don’t know where that guy” — the more amenable Trump — “went,” Graham told the homeland security secretary Kirstjen Nielsen days later. “I want him back.” Trump’s bigoted eruption was instant news. But the context provided by the New York Times journalists Julie Hirschfeld Davis and Michael D. Shear in their exquisitely reported “Border Wars” reveals the shattering horror of the moment, the mercurial unreliability and instability of the president. Davis and Shear perform this contextual service time and again throughout their book, which is essential reading for those searching for the “beating heart” of the Trump administration. The authors argue it is immigration policy, and who can dispute that? From his very first news conference as a presidential candidate, when he denounced Mexican border-crossers as rapists and criminals, a rancid nativism — aimed at people who have darker skins than Norwegians — has been Trump’s tribalist weapon of choice, his scalpel prodding the worst impulses of the American spirit. Nativism isn’t as American as apple pie — indeed, it is the very opposite of our country’s heterogeneous intention — but it has been with us since the Irish began arriving in droves in the mid-19th century. It has almost always been a minor chord in American politics, but it has flared from time to time — with the Chinese Exclusion Act in 1882, the harsh restrictions on southern and eastern Europeans in 1924, and again today, 50 years after Lyndon Johnson liberalized immigration policy in 1965. Davis and Shear are scrupulously fair reporters. They give Trump’s minions a respectful hearing. The current immigration system is, indeed, a mess. The Dreamers are, technically, here illegally, as are many others who overstay their visas or apply for refugee status and simply disappear into the population. There are reasonable reforms on offer, like favoring immigrants with skills over the current system based on family ties (“chain migration”), non-nativist reforms that countries like Canada and Australia have adopted. But the Trump administration’s “remedies” have been flagrantly — and purposefully — punitive. The astonishing policy of separating children from their parents at the border was imposed as a deterrent: An experiment at the El Paso portal showed that illegal crossing declined 64 percent when word got out that children would be taken from their parents at the border. Stephen Miller took it national. An internal Department of Homeland Security memo noted “harm to children is being deliberately used for its deterrent effect.” Davis and Shear are at their best describing the chaotic inner processes of the administration. They are less successful when they attempt to describe the effects of the crackdown on actual human beings — or give insight into the perpetrators of the Trump policies. They wait 280 pages to offer a biographical sketch of Miller, which raises more questions than it answers. He is the descendant of Jewish refugees, it turns out. His family owns a chain of grocery stores. He grew up in ultra-blue Santa Monica, Calif., but distinguished himself from the crowd as a right-wing provocateur in high school. He rose through congressional staff ranks and became a top aide to the immigrant-phobic Senator Jeff Sessions of Alabama. His co-workers think he’s a nice guy. But his policies — and his pursuit of them — are stunningly heartless. We need to know more about him. In this account, Trump is as he ever was: craven, feckless, moody, narcissistic, mendacious, forgetful. He is sympathetic to the Dreamers he meets in private, but is willing to place their lives and futures in jeopardy to feed the passions of his supporters. He is addicted to inflaming the basest instincts of his base. And it is all a show. “This is why people loved me on ‘The Apprentice,’” Trump told House Speaker Paul Ryan, after bragging about nonexistent “ratings” for yet another ballistic meeting in the Oval Office. There is no distinction between reality and reality TV for this president. In 2016, it was a distinction that escaped the American public as well. Davis and Shear are right: Immigration demagogy is at the “heart” of the Trump show — and the Trump show is at the heart of our tragic decline as a civil and humane society.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "If Donald Trump Does It, It’s Not a Crime",
      "url": "https://www.nytimes.com/2019/09/27/opinion/trump-ukraine-call.html?searchResultPosition=7",
      "subtitle": "Trump sees the Ukraine call as a “nothing” because he has spent his entire adult life skirting, mocking, ignoring or breaking the law.",
      "author": "Timothy Egan",
      "content": " Most people, perhaps even most sociopaths, have an internal alarm that goes off when they do something wrong. They may not feel an ounce of guilt, remorse or sorrow, but their instinct for survival is strong enough to send a red alert. Not so with President Trump. The first question I had after reading the White House reconstruction of the July 25 phone call, in which he prods Ukrainian President Volodymyr Zelensky to interfere with an American election, was: How could they release this? “It turned out to be a nothing call,” Trump said. He also described it as “beautiful” and “perfect” and asked for an apology from his critics. This was a “nothing call” only to a man with nothing for a moral foundation. This was exculpatory only to someone who thinks that the crime he has just outlined for all the world to see does not matter. This was “beautiful” and “perfect” only to someone who has crossed so many lines in his life that he has no idea where the boundaries are. The whistle-blower’s complaint, released on Thursday, at least shows that some people in the White House knew what a violation of the oath of office looked like — and were frantic to cover it up. The whistle-blower described an attempt to “lock down” evidence of Trump’s betrayal of his country. But the politically perilous road to impeachment will start and end with the words of a morally bankrupt man who has spent his entire adult life skirting, mocking, ignoring or breaking the law. The case against him is in plain sight. Trump himself is the smoking gun, as Representative Pramila Jayapal, a Washington State Democrat, said. In his own best-case version, the White House memo of the phone call, he asks a foreign leader to investigate one of his chief political rivals while Trump is holding up nearly $400 million in aid to that leader’s beleaguered country. Trump sees this as no big deal because he’s always gotten away with his many transgressions, floating above the law in a padded world of privilege and prevarication. From trying to prevent black tenants from renting the apartments owned by his family, to his stiffing of contractors, cabinetmakers, drivers and others who worked for him, to defrauding students at a phony university, Trump’s life is a biography of scam and scofflaw. His view is not unlike that of Richard Nixon, who famously said, “When the president does it, that means it’s not illegal.” Except in Trump’s case, it refers to himself, not just the high office he holds. For him, it’s a life motto. And one more thing about Nixon: The Trickster at least knew enough about violating his oath to fight the release of his own smoking gun, the tapes that implicated him in a cover-up and doomed his presidency. Trump did not develop a late-life conscience, once he became leader of the free world. Neo-Nazis are very fine people, he said. The Nobel Peace Prize is rigged. The weather is what he says it is. As soon as he felt he could get away with his attempt to obstruct an investigation into Russian meddling — the day after Robert S. Mueller III testified to Congress — Trump urged Ukraine to meddle in an American election. This is not disputed, not by the words released from Trump’s own White House. The Democrats were left with no choice. Even if it costs them the presidency, they can no longer be blind to their constitutional responsibility. This could be one of those cases where the right thing to do by the country is not the best thing to do politically. The call to duty was made most powerfully in an op-ed essay in The Washington Post by seven Democrats from swing districts. All of them had military or national security experience and had previously been against impeachment. All are freshmen, and vulnerable to losing their seats. “These allegations are a threat to all we have sworn to protect,” they wrote. Let them be the face of the Democratic Party during impeachment. And let the Republican-run Senate, a graveyard of principle, be stuck with defending a lawless president. “Where are you?” Such was the plaintive cry of John Kasich, a Republican who found a spine and lost his party. “Are you hiding under a rock?” Actually, they are in plain sight, just like the evidence of Trump’s high crimes and misdemeanors. People should stop waiting for the Big Reveal to jolt Republicans out of their co-conspiracy with a corrupt president. The Big Reveal has happened. Republicans are all in with Trump. It’s trickle-up politics: the base is debased, backed by right-wing media. “To impeach any president over a phone call like this would be insane,” said Senator Lindsey Graham. In years to come Graham will be remembered, if at all, as an invertebrate politician who cowered before someone he once called a “kook” and “unfit for office.” But those who are “moved by the spirit or history to take action to protect and preserve the integrity of our nation,” as Representative John Lewis said, will not be forgotten. They realize that the Constitution can’t save itself.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Does Donald Trump Want to Be Impeached?",
      "url": "https://www.nytimes.com/2019/09/24/opinion/impeach-trump.html?searchResultPosition=6",
      "subtitle": "Four reasons the president might welcome articles of impeachment.",
      "author": "Ross Douthat",
      "content": " When it comes to determining when it makes sense to impeach a president, congressional Democrats are working with 200 words in the Constitution, three significant historical precedents, the fervor of impeachment advocates, the anxieties of swing-state members of Congress and all the polling data that a modern political party can buy. None of this, unfortunately, tells them what to do when the president in question actually wants them to impeach him. That Donald Trump actually wants to be impeached is an argument that Ben Domenech, the publisher of The Federalist, has been making for some time — that the president isn’t stumbling backward toward impeachment, but is actually eager for the fight. In his email newsletter Monday morning, Domenech cited the last few days of Ukraine-related agitation as vindication, arguing that the circus atmosphere of congressional hearings, scenes of Joe Biden talking about corruption instead of health care or the economy, and wavering House Democrats getting forced into an impeachment vote by their angry colleagues and constituents are all exactly what Trump wants. [Agree to disagree, or disagree better? Sign up for our new newsletter, Debatable, to understand the sharpest arguments on the most pressing issues of the week, from new and familiar voices.] For my own part I think wants is probably an overstatement, since it implies a strategic purpose, a permanent intention and a stable mental state, none of which should be assumed when analyzing the president of the United States. But let’s go this far with Domenech: A president who escapes unscathed from an investigation into his campaign’s collusion with a foreign government and then the day after Robert Mueller’s testimony is on the phone jawboning a foreign government to help out his presidential campaign — does that president seem like a man who’s particularly worried about being impeached? Who’s terribly concerned with avoiding having articles filed, a Senate trial, the works? I would say … not. And why might Trump be so unconcerned? Maybe, as impeachment advocates insist, he just thinks Democrats are too gutless to defend the Constitution, too weak to oppose his lawlessness. But it’s also possible (and yes, now I’m going to assume his rationality, having just warned against that, sorry) that he might see four upsides to impeachment, four gifts to his presidency and perhaps his post-presidency that an impeachment and a trial might bring. First, if the Democrats impeach him they will be doing something unpopular instead of something popular. Maybe the polls showing impeachment’s unpopularity will alter as the Ukraine story develops. Maybe public hearings will deliver a series of blows that persuades the large anti-Trump, anti-impeachment constituency that his expedited removal from office is desirable or necessary. But the current shape of public opinion is the boring, basic reason that Trump seems to want to be impeached more than Nancy Pelosi wants to impeach him: The Democratic agenda is more popular than the Republican agenda (whatever that is), the likely Democratic nominees are all more popular than Trump, and so anything that puts the Democrats on the wrong side of public opinion may look better, through Trump’s eyes, than the status quo. Second, Trump is happy to pit his overt abuses of power against the soft corruption of his foes. This is an aspect of Trumpism that the president’s critics find particularly infuriating — the way he attacks his rivals for being corrupt swamp creatures while being so much more nakedly compromised himself. But whether the subject is the Clinton Foundation’s influence-peddling or now the Biden family’s variation on that theme, Trump has always sold himself as the candidate of a more honest form of graft — presenting his open cynicism as preferable to carefully legal self-dealing, exquisitely laundered self-enrichment, the spirit of “hey, it’s totally normal for the vice president’s son to get paid hundreds of thousands of dollars by the Ukrainians or the Chinese so long as every disclosure form gets filled out and his dad doesn’t talk to him about the business.” In fact this sort of elite seaminess is bad, but what Trump offers isn’t preferable: Hypocrisy is better than naked vice, soft corruption is better than the more open sort, and what the president appears to have done in leaning on the Ukrainian government is much worse than Hunter Biden’s overseas arrangements. But no one should be surprised that some voters in our age of mistrust and fragmentation and despair prefer the honest graft — some in Trump’s base, and also some in the ranks of the alienated and aggrieved middle, the peculiar Obama-Trump constituency. Indeed, history is replete with “boss”-style politicians who got away with corruption because they were seen as the rough, effective alternative to a smug, hypocritical elite. Trump’s crucial political weakness is that unlike those bosses, he hasn’t delivered that much to many of his voters. But that may make him all the more eager to return to the politics of comparative corruption, to have the argument again about whether he’s more ethically challenged than the swamp. He may not win it, but at least he’s playing a part that he knows well. Third, an impeachment battle would give Trump a last chance to solidify his hold on the souls and reputations of his possible Republican successors. To understand what I mean, consider Jonathan V. Last’s explanation of why so few Republican elected officials are likely to break with Trump, no matter how Nixonian his straits become: This doesn’t just explain why Trump thinks he can survive an impeachment fight; it also explains why he might relish it. He knows that he could well lose the next election, but there’s no reason a mere general-election defeat will prevent him from wielding power over the Republican Party, via Twitter and other means, for many years to come. And what better way to consolidate that power (or at least the feeling of that power) in the last year of his administration than seeing all his would-be successors, all the bright younger men of the Senate especially, come down and kiss the ring one last time? Come on down, Marco Rubio! Step right up, Ben Sasse! Tom Cotton, Josh Hawley, Ted Cruz, the history books are watching: Tell us one more time, just one more time, how completely Donald Trump the Great owns your vote, your principles, your honor! Which brings us to the last reason Trump might kind of like to be impeached: Because the circus is the part of politics that he fundamentally enjoys. Throughout the Mueller investigation my Twitter feed was alight with liberal and NeverTrump fantasies about how Trump must be bed-wetting, flop-sweat terrified by the tough G-man’s investigation. And maybe at times he was. But I’m pretty sure that when he ranted on Twitter about the “Twelve Angry Democrats” and “WITCH HUNT” and “NO COLLUSION,” he was more engaged, more alive, more fully his full self than at any point during the legislative battles over tax reform or Obamacare repeal. And Robert Mueller’s was a legal investigation, with the power to actually put people in Trump’s inner circle in prison. A merely political trial, where the worst-case scenario is a political martyrdom that Sean Hannity will sing of ever after, seems to offer Trump a much lower-stress variation on that experience. Why, the nicknames for the impeachment managers alone will be a Trumpian banquet, a veritable feast! [Listen to “The Argument” podcast every Thursday morning, with Ross Douthat, Michelle Goldberg and David Leonhardt.] None of this, I should stress, adds up to an airtight argument that the Democrats should not impeach. Nine months ago I made a case against impeachment, and many of the arguments in that essay might apply to this case — depending on how far it turns out Trump went in pressuring Ukraine. But politics is a contact sport, a field for combat as well as for maneuver, and just because someone wants a fight doesn’t mean that you should never, ever give him one. The dictum about wrestling a pig (you get dirty, and besides, the pig likes it) doesn’t hold up if the pig keeps punching you; the dictum that it’s better to beat Trump at the polls than lose a Senate vote probably doesn’t hold up if you talk yourself into looking permanently supine in the face of indubitable corruption. Much of the Trump era has consisted of politicians of both parties waiting for someone else to give Trump a knockout blow. So there’s something to be said, at the level of spiritedness if not necessarily strategy, for House Democrats to take a swing themselves. But my ultimate guess is that none of this matters quite as much as some impeachment arguers suppose. An impeachment effort could be both foredoomed and unlikely to influence the 2020 outcome all that much, so Nancy Pelosi might be wise to forestall one but also find herself with few regrets if one gets forced on her. The nature of the Trump era is that yuge events recede far more rapidly than anyone expects. So it might be with impeachment: Have the vote or don’t have it, we’ll be arguing about something completely different by the time Americans are going to the polls.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Does Donald Trump Know What His Syria Policy Is?",
      "url": "https://www.nytimes.com/2019/10/07/opinion/trump-syria-erdogan-turkey.html?searchResultPosition=5",
      "subtitle": "null",
      "author": "The Editorial Board",
      "content": " American diplomats thought they had negotiated a solution to a seemingly intractable problem. The United States needed Kurdish-led forces in northern Syria to face off against remnants of the Islamic State. But Turkey, a NATO ally, saw those same Kurds as terrorists, allied with separatists inside Turkey. To prevent a Turkish invasion, the three sides — the United States, Turkey and the Kurds — agreed to five-mile-wide safe zones along the border with Turkey, in Syria. Americans would patrol alongside Turkish forces, and the Kurds would dismantle fortifications in those areas that were designed to defend against a possible Turkish incursion. Turkey would also join American-led air operations against Islamic State militants. The deal would put a strain on the 1,000 or so American troops stationed in the region, but it would protect the Kurds in northern Syria and maintain pressure on the Islamic State. President Trump let all that be destroyed when, succumbing to pressure from President Recep Tayyip Erdogan of Turkey, the White House announced that Mr. Trump would not stand in the way of a Turkish invasion to expel Kurdish forces from the border region. The language of the announcement made it seem as if he was even endorsing the move. Even if the Turks do not invade — and while the president’s tweets on Monday indicated he might be rethinking his green light to the Turks, there were reports that attacks had already begun — the decision may destroy any trust the Kurds, America’s crucial partner in Syria, had left. It could also threaten the fight against ISIS. Mr. Trump appears once again to have acted impulsively, in this case after a phone call with Mr. Erdogan. He blindsided officials at the Pentagon and the State Department and kept Congress and the allies in the dark. Administration national security officials have argued forcefully for maintaining a small troop presence in northeast Syria to continue pursuing the Islamic State and as a counterweight to Turkey and Syria’s Russian and Iranian allies. Mr. Trump’s determination to withdraw those remaining troops led to the resignations of former Defense Secretary Jim Mattis and the special envoy to the coalition fighting ISIS, Brett McGurk, last December. Mr. Trump’s announcement and tweets infuriated conservative allies, including the Senate majority leader, Mitch McConnell, and Senator Lindsey Graham. “The Kurds were instrumental in our successful fight against ISIS in Syria,” tweeted Nikki Haley, Mr. Trump’s first ambassador to the United Nations. “Leaving them to die is a big mistake. #TurkeyIsNotOurFriend.” By midday Monday, the Pentagon was trying to contain the damage by announcing that it and the president had made clear to Turkey “that we do not endorse a Turkish operation in northern Syria.” The statement added that American military forces “will not support or be involved in any such operation.” The president himself expressed second thoughts, which were, in their own way, even more jarring. “As I have stated strongly before,” he tweeted, “and just to reiterate, if Turkey does anything that I, in my great and unmatched wisdom, consider to be off limits, I will totally destroy and obliterate the Economy of Turkey (I’ve done before!).” Just what, in his unmatched wisdom, Mr. Trump meant by “off limits,” or economic destruction, or the rest of the tweet was not clear. Nor is this the first time the Trump administration has sent conflicting messages about American objectives in Syria. Last December, Mr. Trump overruled his top advisers to order the withdrawal of all 2,000 American ground troops from Syria within 30 days. The decision was ultimately reversed, but it was the final straw for Mr. Mattis. Mr. Erdogan has long threatened to send troops into Syria. Since losing an important election in Istanbul in March, he has been under increasing pressure to find ways to shore up his domestic political support. He’d also like to resettle at least one million Syrian refugees now living in Turkey within the safe zone on the Syrian side of the border. Those refugees have become a political liability for him. But if Kurds in Syria have to defend themselves against the Turks, they are likely to shift their forces from the fight against ISIS, including the guarding of about 10,000 ISIS prisoners now in Kurdish detention centers. Making it possible for refugees to return home is a worthy goal, but forced resettlement is rarely successful. Moreover, many refugees in Turkey do not come from northern Syria and are unlikely to mix easily with local populations. Whether Turkey will go forward with a full invasion is unclear. On Mr. Trump’s orders, a couple hundred American troops have been removed from two military outposts. At the same time, the Kurds have stopped dismantling their fortifications and the joint American-Turkish patrols have been ended, officials say. Congress is threatening sanctions on Turkey. It may seem paradoxical, but in caving in to one of the strongmen he so admires, Mr. Trump may have set the United States on a collision course with Turkey. He’s also put himself into conflict with the Pentagon and his own Republican allies. He may walk his own decision back once again, in part or in whole. But what ally could look at the United States now and see a stalwart partner — and what foe could look at it and fear a determined adversary?",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Why Evangelicals Support Donald Trump",
      "url": "https://www.nytimes.com/2019/10/07/books/review/who-is-an-evangelical-thomas-s-kidd.html?searchResultPosition=4",
      "subtitle": "null",
      "author": "Frances Fitzgerald",
      "content": " WHO IS AN EVANGELICAL?\nThe History of a Movement in Crisis\nBy Thomas S. Kidd\nTHE IMMORAL MAJORITY\nWhy Evangelicals Chose Political Power Over Christian Values\nBy Ben Howe How 81 percent of evangelicals could have voted for Donald Trump, given his flouting of their “traditional values,” has been a question for many Americans since 2016. Thomas S. Kidd and Ben Howe, both evangelicals, try to answer this question in different ways. Kidd, a professor of history at Baylor University, finds an explanation in the history of the relationship between evangelicals and political power. It was, he tells us, “a myth” that the Puritans favored religious freedom for all. Rather, they wanted the freedom to practice their own religion and brought a relatively harsh form of religious establishment to Massachusetts and Connecticut. It was the evangelicals in the Great Awakenings — the religious revivals in the 18th and 19th centuries — who spread the idea of religious liberty John Locke inspired in them. After the Revolution, evangelicals, mainly Baptists and Methodists, adopted the principle of separation of church and state and helped James Madison and Thomas Jefferson enshrine it in the first amendment to the Constitution. Nevertheless, Kidd writes, when evangelicals gained ascendancy, they sometimes pursued cultural and legal power that the purists of the founding generation would have disdained. For example, some leading evangelicals in the antebellum period banned the Sunday mail in their communities. And often, as in the case of slavery, the temptation to bring their moral convictions into the public square was irresistible. Northern evangelicals argued that slavery was against God’s will, while Southerners cited biblical passages to prove the opposite. “As a general rule,” Kidd writes, “evangelicals have been at their best when using their political sway to defend the weak and oppressed (such as slaves), rather than seeking to impose evangelical practices, ideas or standards of conscience on the public.” By the time of the Civil War, evangelical churches were so dominant, Kidd writes, that they represented a de facto establishment. But the issue of slavery tore the Northern and Southern churches apart, and divided black from white churches. Kidd tells us evangelicals would never again reach the same level of cohesion that they did before the 1840s. Still, white evangelicals remained the de facto establishment in both the North and South, making laws on such things as prayer in the public schools. In fact, the first real split in evangelicalism came in the Northern churches at the end of the century over the issues of theology and Darwinian evolution. Kidd describes the doctrinal splits, but says, “Promoting anti-evolution laws was one of the most misguided evangelical ventures ever,” and the Scopes trial of 1925 “illustrated the temptations of media access, establishment politics and celebrity politicians in evangelical history.” The trial, he writes, “was a major precedent for the crisis of politicization that bedevils evangelical Christianity today.” Interestingly, Kidd traces what he calls the crisis of the movement to the 1940s, when Billy Graham and many other preachers blended their gospel with anti-Communism. The turning point, he says, came when Graham made an alliance with President Eisenhower, and evangelicals began to conflate pollical power and access to Republican leaders with the advancement of God’s kingdom. Kidd describes the Republican efforts to woo evangelicals while President Johnson’s civil rights acts were turning white Southerners against him. Throughout the book, Kidd does a good job of including the perspectives of black clergymen. However, he, like many other evangelicals, often equates “evangelicals” with “Christians,” and negates the role Northern white Catholics and mainline Protestants played in the civil rights movement. He continues his historical narrative through the rise of the Christian right (or what he calls “Republican insider evangelicals”), plus the “conservative resurgence” in the Southern Baptist Convention. Only in his last pages does he get to the election of Donald Trump, and after all he has said about the corrupting effects of political power on a religious community, the coda is disappointing. He recites the familiar excuses: Evangelicals voted against Hillary Clinton rather than for Donald Trump; among Christians in politics, the media care only about evangelicals; polling doesn’t differentiate between nominal evangelicals and those who hold to traditional beliefs, etc. He admits that evangelical fealty to the Republican Party is real and has done considerable damage to the movement, but he insists that evangelicals should not be defined by the 81 percent because being a real evangelical entails conversion, devotion to an infallible Bible and to God’s discernible presence on earth. But since polls show that evangelicals who attended church frequently voted for Trump at much the same rate as nominal evangelicals, he is left with no explanation for why so many evangelicals voted for an adulterer who boasts about his sexual conquests. Ben Howe is not the scholar Kidd is, but his book comes closer to an explanation; for, unlike Kidd, Howe was a conservative activist who went through a change of heart during the 2016 primaries. A writer, podcaster and filmmaker, he grew up in what he describes as an “ideal” evangelical family. As the family moved about, he went to W. A. Criswell’s church in Dallas and later to Jerry Falwell Sr.’s church in Lynchburg, Va. The two pastors were fundamentalists, heavily involved with politics and, as a boy, Howe supported the Moral Majority. Later, he had great hopes when George W. Bush was elected. He liked the idea of “compassionate conservatism,” and he also liked the president’s “moral clarity” when, after 9/11, he told America’s allies that they had to be either for the United States or for the terrorists. Many evangelicals, Howe writes, had come to believe that the cultural tide was shifting, putting the idea of a Christian nation at the forefront of popular conservative thinking. According to Howe, when Obama was elected, evangelicals became subjected “to what they saw as years of slander.” They had been “insulted and defiled … mocked and marginalized for their beliefs.” Even in the years before Obama, “every action President Bush took was met with hysterical mania by the left, which painted him as everything from a racist to a Nazi.” Howe was outraged. On Obama’s Inauguration Day he wrote an article for the website RedState entitled “My Conservative Pledge,” in which he complained about having seen “hatred, loathing, anger, ignorance, violence, suppression, oppression, blacklisting … my integrity impugned … my God spit upon.” Howe apparently discovered all of this while surfing the underground streams of the internet, where trolls battle in the darkness. In any case, he says, the conservative reaction during the Obama administration was to hit back twice as hard. In his view, long before Trump appeared on the scene, a “toxic mixture of resentment and desire for revenge … spawned the Trump evangelical movement.” Trump then successfully courted evangelicals by promising to give them power and to fight back on their behalf. Today Howe says that Trump did get things done for evangelicals, like nominating justices opposed to abortion, but he sees in the president “untold chasms of depravity.” And he accuses Trump of pulling many evangelicals into “a vortex of moral ambiguity and relativism,” surrendering their moral voice in the public sphere for a bit of worldly influence.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Donald Trump Dreams of Presidential Infallibility",
      "url": "https://www.nytimes.com/2019/10/11/opinion/trump-impeachment-congress.html?searchResultPosition=3",
      "subtitle": "His emerging constitutional doctrine leaves no room for the House or the courts.",
      "author": "Jamelle Bouie",
      "content": " The news cycle has already blown past it, but I think we should dwell a little more on that time, just a few days ago, when President Trump declared himself above the Constitution. No, the president did not say, “I am above the Constitution.” But that was the gist of the eight-page letter sent on his behalf to the House speaker, Nancy Pelosi, and the Democratic majority, not just contesting the impeachment inquiry but challenging the very idea of presidential accountability. [Join Jamelle Bouie as he shines a light on overlooked writing, culture and ideas from around the internet. For exclusive thoughts, photos and reading recommendations, sign up for his newsletter.] With that letter, Trump all but announced his monarchal pretensions — that he is the presidency and the presidency is him. And while there are other, juicier stories to follow in this impeachment saga — just yesterday, two associates of Rudy Giuliani were arrested and charged with federal crimes — this event is significant for what it underscores about the moment. In short, we are living through a bona fide constitutional crisis. “President Trump and his Administration reject your baseless, unconstitutional efforts to overturn the democratic process,” reads the letter from Pat Cipollone, who serves as counsel to the president. Cipollone also accuses House Democrats of violating the due process rights of the president and insists that impeachment is invalid if it isn’t begun by an official resolution. He continues: “Your transparent rush to judgment, lack of democratically accountable authorization, and violation of basic rights in the current proceedings make clear the illegitimate, partisan purpose of this purported ‘impeachment inquiry’. ” It’s all a little dramatic. Cipollone goes on: Most of this is nonsense. The Constitution only specifies the basics of impeachment: The House initiates it and the Senate votes on it. Everything else is left to the respective chambers. No particular process is required. The House is fully empowered to collect evidence, take testimony and subpoena witnesses without passing a resolution to announce it is considering impeachment. The House acts as a kind of grand jury — where the “Articles of Impeachment” correspond to the counts in an indictment — with no obligation to take witnesses from the defense. That will come later, if the House impeaches and the Senate holds a trial. In addition to its nakedly partisan claims, the White House is also making its case with constitutional language, but there is no constitutional support for its arguments. But we shouldn’t get bogged down in the particulars of the letter or its tenuous relationship to the facts. The problem with the White House response is not that it’s wrong, but that it’s an assertion of unaccountable power. To call impeachment “illegitimate” and reject Congress’s ability to conduct oversight is to put forth a doctrine of presidential infallibility, an extreme form of Richard Nixon’s quip that “when the president does it, that means it is not illegal.” To refuse cooperation and compliance is to challenge the constitutional prerogative of a coequal branch of government. The framers understood that re-election wasn’t enough to compel good behavior from the chief executive. As James Madison argued during the constitutional convention of 1787, impeachment exists as a safeguard against the “incapacity, negligence or perfidy of the chief magistrate.” But Trump, speaking through Cipollone, rejects this. To this White House, elections are the only acceptable form of accountability. “The decision as to who will be elected President in 2020 should rest with the people of the United States, exactly where the Constitution places it.” What’s worse is that, according to a longstanding opinion from the Justice Department’s Office of Legal Counsel, a president cannot be indicted while still in office. If impeachment is illegitimate and Trump intends to defy all congressional subpoenas and investigation, then he’s suddenly untethered the office from the entire constitutional system. He becomes what the framers feared — an elected king, answerable only to his supporters. (Here it’s worth noting the hypocrisy of relying on the Constitution when it justifies his own power — Trump is only president because of the Electoral College — and rejecting it when that power is challenged.) Within weeks of Trump’s taking office, scholars and observers wondered if he would precipitate a constitutional crisis. The verdict was uncertain. Yes, he attacked judges, urged officials to ignore court orders and claimed vast powers for his administration. But when challenged by the courts, or the Republican-held Congress, he backed down. Now, he faces a hostile majority. And that changes the dynamic. Political ruin is on the horizon and Trump — with his clear taste for autocrats and autocracy — will undermine American democracy if that will keep it at bay. I say this as if it’s a surprise, but of course it’s not. Trump is an authoritarian by instinct, with little respect for our democratic traditions, much less the Constitution. Of course he’d flout Congress’s authority and trash the separation of powers to protect himself from accountability. It’s the most predictable choice he could make. As long as Republicans continue to stick with the president, the only question now is how Democrats respond. Trump’s refusal to cooperate or comply is itself an impeachable offense, one more transgression to add to any articles drafted by the House. But there’s still the immediate problem of meeting White House escalation head on. Democrats can do this by using all the authority they have at their disposal. The House can impeach officials, like Secretary of State Mike Pompeo, who participate in the president’s obstruction. It can even hold uncooperative officials in contempt and detain them for rejecting subpoenas. The Constitution cannot enforce itself. The only way to stop an attack on separation of powers is to push back with equal force. The president and his allies think they can reject congressional oversight. It’s up to Democrats to bring the fight into public view and force the Trump camp to see that it is Congress that has the authority in this conflict. Trump may want it to be one way, but for the sake of the Constitution, he needs to understand that it’s the other way.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "How to Sell Your Soul to Donald Trump",
      "url": "https://www.nytimes.com/2019/10/05/opinion/sunday/pompeo-trump.html?searchResultPosition=2",
      "subtitle": "Mike Pompeo is just the latest lackey to teach a master class in moral surrender.",
      "author": "Frank Bruni",
      "content": " There’s no way that Mike Pompeo actually venerates Donald Trump. I doubt he even likes the president much. Pompeo graduated first in his class at West Point decades ago, a feat that suggests enormous reserves of discipline, a profound respect for tradition and a talent for self-effacement when the circumstances warrant it. Trump possesses none of those qualities. Pompeo is an evangelical Christian, steeped in the very dictums that Trump has spent a lifetime mocking with both his words and his deeds. And Pompeo has long believed in the importance of American military intervention abroad, the kind of activist role that Trump railed against during his campaign for the Republican presidential nomination. In fact Pompeo, who was then a congressman from Kansas, supported Marco Rubio — and publicly praised him, while disparaging Trump, just before the state’s Republican caucus in March 2016. As Susan Glasser of The New Yorker recalled in an excellent recent profile of Pompeo, he sounded an alarm that Trump would be “an authoritarian president who ignored our Constitution.” He urged Republicans to come to their senses and resist the lure of the surging Trump campaign. “It’s time,” he said, “to turn down the lights on the circus.” But the lights continued to burn bright, so Pompeo just put on a clown suit, put away his ethics and finagled a big role under the Big Top. He had plenty of company in that transformation. It’s the wonder of the Trump era and one of the saddest, scariest themes of the impeachment inquiry so far: the teeming crowd of sellouts and suck-ups who eagerly traded principle for position and are in some cases doubling and tripling down on that transaction, to a point where it’s fair to ask if there was ever much principle to begin with. [Get a more personal take on politics, newsmakers and more with Frank Bruni’s exclusive commentary every week. Sign up for his newsletter.] I’m looking at you, Lindsey Graham, who somehow decided that Trump was the new John McCain, which is like deeming tripe the new tenderloin. Hell, I’m looking at most of the Republicans in the Senate. I’m not so much looking at Attorney General William Barr, odious as his behavior has been, because it’s clear in retrospect that he never made much of a pretense of rectitude, at least not in the context of Trump. He also wasn’t on record trashing Trump, not the way Pompeo and Graham and so many others who now dutifully echo him and gaze beatifically at him were. They must have broken necks from their moral whiplash. Barr’s neck supports that big head of his just fine. Pompeo, who first signed on as Trump’s C.I.A. director and then flattered his way to secretary of state, is a paragon of these lackeys-come-lately, and he’s especially vivid proof of how easily and completely the lure of power can overwhelm any call to conscience. He raised his hand for secretary of state after he’d seen his predecessor, Rex Tillerson, humiliated by Trump and fired by tweet. This was more than a year into Trump’s presidency, by which point the rationalizations of other supposedly serious conservatives who took top administration jobs no longer held water. It was clear that Trump wasn’t just a few artful nudges away from proper presidential bearing. He couldn’t be lifted up because he was too busy cruelly dragging everyone else down. But Pompeo had a heady shot at a vaunted job that almost surely wasn’t going to come his way any other time. So he lunged for it, then demonstrated with his obsequiousness that doing good and doing right were never high on the agenda. He wrote an op-ed article that essentially broke with his fellow Republicans to promote Trump’s view that Saudi Arabia’s butchery of the journalist Jamal Khashoggi shouldn’t give anyone pause. What are a few severed body parts among allies? He recalled the ambassador to Ukraine just to please the president and his babbling Beelzebub, Rudy Giuliani. He listened mutely to that July 25 phone call between Trump and the Ukrainian president, decided to ignore what he heard and then claimed — until a few days ago — that he was utterly in the dark about any pressure on Ukraine to kneecap Joe Biden. In Greece on Saturday, he proudly portrayed the Trump administration’s approach to Ukraine as a high-minded vigil against corruption and an attempt to ensure against interference in American elections. In the process he gave fresh currency to a discredited conspiracy theory that Ukraine meddled in the 2016 presidential race. Had he spoken up about the phone call or pushed back, he would have risked ending up on the outside, among the swelling Trump administration diaspora. He preferred the inside, with its glossier trappings and cushier thrones. He and his wife were diplomatic royalty, jetting around the world. He could bear the ache of a tongue full of tooth marks. Better to be a wretched part of history than no part at all. The tale sounds familiar because it is. It’s the story of Faust, who sold his soul for renown, then endured the ugliness of that deal. It’s also the story of too many of Trump’s Republican enablers to count. Sure, they decided to prop and pretty him up, a man whose unfitness for the Oval Office was never really in doubt, out of tribal loyalty, a force far too potent in American politics today. But some rushed to him because that’s where the riches were, at least metaphorically. That’s where the fame was. And they weren’t simply burying the hatchet with a politician who hadn’t been their preferred candidate or whose positions differed from theirs only slightly. They were dismantling the chain saw that they’d wielded in the face of a fraud whose conduct, along with some of his proposals, was antithetical to who they claimed to be. Few people remember anymore, but just years before she became the dark empress of “alternative facts,” Kellyanne Conway was a respected, reasonably mainstream, uncontroversial Republican pollster and strategist. Just months before she joined Team Trump, she correctly labeled him “vulgar,” said that he wasn’t presidential, called him a liar and demanded his tax returns. Then he offered her the lofty job of managing his presidential campaign — and all the television airtime that came with it — and she turned herself into a kowtowing cartoon. She’ll never be seen the same way again. Was the ride really worth it? And what was Mick Mulvaney thinking when he agreed to be Trump’s third chief of staff, having witnessed the tortures of chiefs Nos. 1 and 2? Before Trump was elected, Mulvaney called him and Hillary Clinton “two of the most flawed human beings running for president in the history of the country,” and lest you think Trump was merely collateral damage in her disparagement, Mulvaney separately called Trump “a terrible human being.” Now he calls him boss. Amazing how revulsion crumbles when relevance is in the equation. Graham was oddly and briefly honest about this in an interview with The Times’s Mark Leibovich, framing his kinship with Trump, whom he once called “the world’s biggest jackass,” as part of his career-long quest “to try to be relevant.” This quest now involves the insistence that Trump, rather than abusing the presidency to dig up imagined dirt on a political rival, is the victim of some setup. You can hear Graham’s version as predictably loopy illogic from a senator up for re-election next year in the deep-red state of South Carolina, but it’s more than that. It’s the fee for being able to get the president on the phone, for being invited to play golf with him, for feeling the rush of access, for crowing about your perch at the epicenter of the action. He and Pompeo will have insider anecdotes to last the rest of their lives. They’ll need just as long to convince themselves that they didn’t overpay. This column has been updated to reflect news developments.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Donald Trump’s Invitation to the World",
      "url": "https://www.nytimes.com/2019/10/04/opinion/trump-china-ukraine-corruption.html?searchResultPosition=1",
      "subtitle": "Soliciting foreign interference sets a precedent. Here’s what that looks like.",
      "author": "Alex Kingsbury",
      "content": " Nations of the world, take heed. There was a time, just months ago even, when a foreign country interfering in America’s elections would have been impermissible by law and unacceptable to the people. The rules of our democracy have changed. President Trump — who brands himself as a new kind of nationalist (without the historical baggage that term lugs around) — has now turned to the global elite to help him win re-election. Forget George Soros, the Bilderbergs and cosmopolitan consensus. Donald J. Trump has pushed globalism to new, glittering heights. Free trade? Please. Try inviting the world to do everything short of casting a ballot. Not even QAnon could have seen this twist coming. On Thursday, the president again asked Volodymyr Zelensky, the president of Ukraine, to investigate one of his political rivals, former Vice President Joe Biden. Mr. Trump went on to ask the same of Xi Jinping, preoccupied though the Chinese leader is at the moment with trying to suffocate a democratic uprising in Hong Kong. A Republican on the White House lawn asking Communist China for help in winning a democratic election isn’t something that prognosticators would have picked for 2019. But that’s where the United States finds itself. But, as they say, don’t hate the player, hate the game. And if those are the new rules, let’s bring in some players who’ve been sitting on the sidelines. Europe, get on over here. At latest count, 70 percent of the population in 25 European countries surveyed “lack confidence in Trump to do the right thing regarding world affairs.” Oomph. Not exactly swing voters. If the European Union is serious about representing the will of its people, its leaders would put their considerable economic, law enforcement and intelligence resources behind an effort to investigate Mr. Trump for any and all potential wrongdoing connected with his global business empire. After all, the American people deserve to know if their president is a crook. Mexico and Latin America? If they’d like to aid in the election of someone other than Mr. Trump, then abrogating arrangements on migration would be a good way to show how much the administration has utterly failed to resolve this longstanding issue. It’d make it tough on the hustings to convince even a MAGA rally that the wall has been built and that get-tough immigration policies — snakes and gators and moats, oh my! — have been effective. As for China, well, it’s now got a standing invitation to join in the 2020 election on behalf of the president. But that shouldn’t be the only offer it considers. Want a trade war truce and a little certainty and sanity in the world economy? Maybe working to undermine the president’s re-election is a wiser course of action than helping to destroy Mr. Biden. The choice is Mr. Xi’s. How about Russia? Oh, Russia. Remember when candidate Trump asked you to steal emails to help his campaign and then you did? But, oh, how the monster you’ve made has gotten out of control. All Vladimir Putin wanted to do was sow a little discord, and what happened? Mr. Trump told the Russian ambassador that he didn’t care about their aid and support to the Republican Party in the 2016 elections. Da. Talk about the dog that caught the car. Guess what would really set Americans at one another’s throats in 2020? President Trump losing re-election and refusing to leave office, as he’s hinted he’d do. Just because the Kremlin backed one horse in 2016 doesn’t mean it can’t switch midstream. Think about it: Relieved of the duties of office, Mr. Trump would be free to refocus executive time on building a tower in Moscow. Shithole countries? You know who the president thinks you are. Anything you’d like to do to swing the 2020 race one way or the other? All investigations welcome! As Vice President Mike Pence said on Thursday about the investigations into Mr. Biden: “The American people have a right to know if the vice president of the United States, or his family, profited from his position.” Ditto the Family Trump. Is the Trump Organization or one of the wayward scions scoring sweetheart deals to build fancy hotels or secure trademarks in your country? Contact The Times or, if you must, @Fahrenthold. At one time, the conventional wisdom was that all elections were local. But Mr. Trump’s lasting contribution to our modest experiment in self-governance has been to invite the world to participate. He is, if you will, the founding father of globalized American Democracy. E pluribus unum.",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    }
  ]
}