{
  "articles": [
    {
      "subtitle": "Hunter Biden’s Chinese investment firm assisted China’s acquisition of “strategically sensitive assets” in the United States, according to a New York Post op-ed by the Government Accountability Institute’s Peter Schweizer and Jacob McLeod.", 
      "author": "Rebecca Mansour", 
      "url": "https://www.breitbart.com/2020-election/2019/10/11/schweizer-mcleod-hunter-biden-helped-china-acquire-strategically-sensitive-assets/", 
      "title": "Schweizer & McLeod: Hunter Biden Helped China Acquire ‘Strategically Sensitive Assets’", 
      "content": " Schweizer and McLeod provide further details on the investments former Vice President Joe Biden’s son, Hunter Biden, facilitated via his Chinese-backed investment firm. In 2013, less than two weeks after accompanying his father on an official visit to Beijing–and despite his lack of pertinent expertise–Hunter Biden secured $1 billion (later raised to $1.5 billion) from the state-owned Bank of China for his newly formed investment firm, Bohai Harvest RST (BHR). This was in addition to the first-of-its-kind deal the Chinese government awarded Biden’s private equity firm Rosemont Seneca in the recently formed Shanghai Free-Trade Zone, a deal that allowed the firm to focus on international acquisitions. “With the backing of the state-owned Bank of China, one of the country’s ‘big four’ financial institutions, BHR had access to the types of deals that most Western firms only dreamed of, including IPOs of state-owned companies,” Schweizer and McLeod write, noting that Biden’s firm “invested in strategically sensitive assets in both China and the United States.” They write: In December 2014, BHR became an “anchor investor” in the IPO of China General Nuclear Power Company (CGN), a state-owned nuclear company involved in the development of nuclear reactors. Not only is CGN a strategically important company in China, it was also facing legal scrutiny in the United States. In 2016, CGN was charged with espionage by the Justice Department for stealing US nuclear secrets. As a “cross-border” investment fund, Bohai Harvest was interested in making deals outside of China. In 2015, BHR acquired Henniges Automotive, a Michigan-based producer of vibration-dampening equipment, alongside Chinese military contractor Aviation Industry Corp. of China (AVIC). Given the military applications of Henniges’ technology, the deal required federal approval. Like CGN, AVIC was suspected of stealing US technology for its purposes. Not long after the Henniges deal closed, AVIC debuted its new J-20 fighter — incorporating designs allegedly stolen from the US’ F-35 program. Schweizer and McLeod conclude by asking, “Did the Chinese give favorable treatment to Hunter Biden to curry favor with his vice-president father? The American public deserves to understand what exactly Hunter Biden was doing overseas and the extent of then-Vice President Biden’s involvement.” The timing of Hunter Biden’s business deal is particularly problematic. His father was negotiating U.S. policy with China at a time when the regime’s behavior had become increasingly menacing to U.S. allies in the region. Vice President Biden’s kid-gloves treatment of China during that trip—a fact which was widely criticized by U.S. allies at the time—also raises questions in light of the lucrative business deals his son secured just two weeks later. Biden’s BHR focused on strategic energy and defense projects, including U.S. companies specializing in technology used by our military, as Breitbart’s Haris Alic reported: In 2015, BHR and the Aviation Industry Corporation of China (AVIC) — an aerospace and defense conglomerate owned and operated by the Chinese government — made a $600 million bid to purchase Henniges, a Michigan-based automotive company. The sale required approval from the Obama-Biden administration’s Committee on Foreign Investment in the United States (CFIUS), as AVIC was a subsidiary of the Chinese government and Henniges produced “dual-use” anti-vibration technology with U.S. “military applications.” CFIUS, which is made up of representatives from 16 different federal bodies including the Departments of State, Treasury, and Defense, is required to review any transaction with national security implications. When the AVIC and BHR’s bid was first announced, alarm bells went off in certain sectors of the defense industry. In particular, many noted that AVIC was “reportedly involved in stealing sensitive data regarding the Joint Strike Fighter program,” which it later “reportedly incorporated … into China’s J-20 and J‑31 aircraft.” Despite the national security concerns, CFIUS approved the deal with AVIC, purchasing 51 percent of the company while BHR took ownership of the other 49 percent. Upon purchase, an industry newsletter stated the deal was the “biggest Chinese investment into US automotive manufacturing assets to date.” The acquisition of foreign technology is a key component of China’s aggressive “Made In China 2025” (MI2025) strategy to overtake the United States economically and militarily by dominating key technologies of the future (i.e. artificial intelligence, robotics, electric vehicles, 5G telecommunications, etc.). A 2017 report by the U.S. Chamber of Commerce explained the role private equity firms like Hunter Biden’s play in this strategy. The Chinese government “is injecting state funds into private equity to fund foreign acquisitions” of companies with technology identified as a priority for MI2025, according to the report. In his extensive report last February on China’s “whole-of-state” strategy for global dominance, Florida Senator Marco Rubio also noted the communist regime’s reliance on “intellectual property acquisitions” to achieve its ambitions. “China is becoming a significant shareholder in U.S. industries, and is selectively targeting those with strategic implications,” Matt Stoller and Lucas Kunce wrote in The American Conservative last June. Their analysis exposes the extend to which China has co-opted Wall Street against the longterm interests of the American economy and national security. For example, they write: Jennifer M. Harris, an expert in global markets with experience at the U.S. State Department and the U.S. National Intelligence Council, researched a recent explosion of Chinese strategic investment in American technology companies. She found that China has systematically targeted U.S. greenfield investments, “technology goods (especially semiconductors), R&D networks, and advanced manufacturing.” Hunter Biden’s attorneys told ABC News last June that Biden still sits on BHR’s board and owns a minority stake in the fund. At his campaign rally in Minneapolis yesterday, President Trump called out Hunter Biden’s business dealings with China while his father was negotiating U.S. policy with the communist regime. “Biden allowed China to rip off America for eight years as vice president,” Trump told the crowd. “And Barack Obama let him just rob us blind, and we are not doing that anymore. Those days are over. The Bidens got rich, and that is substantiated, while America got robbed. That’s what happened. Sleepy Joe and his friends sold out America.” The House Democrat impeachment inquiry has brought renewed interest in the sweetheart deals Hunter Biden’s private equity firm secured while his father was vice president, as detailed in Schweizer’s 2018 bestseller Secret Empires. Democrats allege that President Trump attempted to coerce the Ukrainians into investigating corruption charges against former Vice President Biden during a July phone with his Ukrainian counterpart. The allegation centers around Hunter Biden’s lucrative dealings with a Ukrainian oligarch-owned energy company at a time when his father was mediating U.S. policy towards Ukraine. The natural gas firm Burisma Holdings paid Hunter Biden over $50,000 per month for his work as a board member, despite his total lack of experience in Ukraine or the energy sector. Just a few months prior to landing this Ukrainian deal, Hunter Biden had been dishonorably discharged from the U.S. Navy Reserve for testing positive to cocaine use. A Ukrainian corruption probe into Burisma Holdings was scuttled in 2016, when Vice President Biden threatened to withhold $1 billion in U.S. loan guarantees to the country if the Ukrainian government did not fire the prosecutor who launched the corruption investigation. Withholding the loans would have thrown the former Soviet republic into insolvency at a time when it was fending off attacks from Vladimir Putin’s Russia. Both Trump and Ukrainian President Volodymyr Zelensky denied the Democrats claim that Trump delayed military funding to Ukrainian in order to pressure Zelensky’s government to investigate the Bidens. The Trump White House has refused to cooperate with the Democrat impeachment inquiry, declaring it a “partisan and unconstitutional” investigation. Rebecca Mansour is Senior Editor-at-Large for Breitbart News and the host of Breitbart News Tonight on SiriusXM Patriot channel 125, which broadcasts live weeknights from 9:00 p.m. to midnight Eastern (6-9:00 p.m. Pacific). Follow her on Twitter at @RAMansour.", 
      "date": "11 Oct 2019"
    }, 
    {
      "subtitle": "Actress-activist Jane Fonda said she is taking a break from her Netflix comedy series Grace and Frankie and is moving to Washington, D.C. in order to be at the center of the so-called climate change battle.", 
      "author": "David Ng", 
      "url": "https://www.breitbart.com/entertainment/2019/10/11/jane-fonda-takes-break-from-acting-moves-to-washington-to-become-climate-activist/", 
      "title": "Jane Fonda Takes Break from Acting, Moves to Washington to Become Climate Activist", 
      "content": " The two-time Oscar-winning star said she wants to see fossil fuels phased out over 30 years and wants the government to stop leasing permits for fossil fuel development on public lands and waters. The 81-year-old Jane Fonda was arrested Friday after she and a group of fellow sign-wielding agitators refused to move from the steps of the U.S. Capitol building where she was participating in her “Fire Drill Fridays” protest for the environment. In a recent interview, Fonda said that she convinced Netflix to give her four months off before shooting the final season of Grace and Frankie. “Well, I went to Ted Sarandos who’s the [chief content officer] of Netflix, and I asked him if he could give me a year off,” she told the Los Angeles Times. “And he tried and couldn’t because of the contracts. I mean, there’s a lot of actors in the mix. And so four months is what I could get. And then when we finish, it’ll be a longer season because it’s out last season. Then I’ll come right back.” Fonda said she is moving to Washington “to be at the epicenter of the fight for our climate,” in a statement on her official website. “Every Friday through January, I will be leading weekly demonstrations on Capitol Hill to demand that action by our political leaders be taken to address the climate emergency we are in. We can’t afford to wait.”  The Netflix star said she was inspired by young people, including 16-year-old Swedish climate activist Greta Thunberg. “I mean, I knew about Greta, I didn’t know she was on the spectrum. And I really didn’t know what Asperger’s meant,” Fonda told the Times. “On the spectrum, if they are interested in something, they have a laser focus on that and whatever the denials and rationalizations the rest of us indulge in, that doesn’t come into play with her.” Fonda also talked about her feelings about President Donald Trump. “I did not expect it would be this bad. I didn’t,” she said. The Klute actress also said she called Jared Kushner, who is the president’s son-in-law and advisor, about environmental issues. Fonda said that Kushner told her to speak to his wife, Ivanka Trump. “And so I called her And she said, ‘I’ll see what I can do.’ Nothing,” recalled Fonda. On her website, the actress says, “I will be on the Capitol every Friday, rain or shine, inspired and emboldened by the incredible movement our youth have created. I can no longer stand by and let our elected officials ignore – and even worse – empower – the industries that are destroying our planet for profit. We can not continue to stand for this.” Follow David Ng on Twitter @HeyItsDavidNg. Have a tip? Contact me at dng@breitbart.com", 
      "date": "11 Oct 2019"
    }, 
    {
      "subtitle": "Mexican President Andrés Manuel López Obrador told Speaker Nancy Pelosi (D-CA) on Friday to pass the U.S.-Mexico-Canada Agreement (USMCA), which awaits a vote in the Democrat-controlled House of Representatives.", 
      "author": "Joel B. Pollak", 
      "url": "https://www.breitbart.com/economy/2019/10/11/mexican-president-amlo-to-nancy-pelosi-pass-usmca-already/", 
      "title": "Mexican President AMLO to Nancy Pelosi: Pass USMCA Already!", 
      "content": " President Donald Trump announced the USMCA one year ago, after extensive negotiations with both Canada and Mexico. The trade deal will replace the North American Free Trade Agreement (NAFTA), which Trump has long criticized and which he promised to replace. The new deal includes terms more favorable to U.S. businesses and workers, and is one of the most significant economic and foreign policy achievements of the Trump presidency. While Democrats have spoken favorably about the USMCA, they have also suggested changes to the agreement. They are also reluctant to acknowledge Trump’s success and to approve anything for which he will later take credit. Obrador, known also by the acronym AMLO, told reporters Friday that he had sent a letter to Pelosi urging her to pass the USMCA. “There’s agreement, and I took the opportunity to send Mrs Pelosi a letter explaining that it’s in the interest of the three peoples, the three nations, that this deal is approved,” he said, according to The Hill. Republicans also pressed the House Speaker to stop stalling. When Pelosi posted a subtweet — a tweet that attacks someone without using their Twitter handle — targeting Sen. Joni Ernst (R-IA), Ernst fired back about the USMCA:  A poll in February showed that Americans wanted Congress to pass the USMCA “by a nearly four-to-one margin.” Joel B. Pollak is Senior Editor-at-Large at Breitbart News. He earned an A.B. in Social Studies and Environmental Science and Public Policy from Harvard College, and a J.D. from Harvard Law School. He is a winner of the 2018 Robert Novak Journalism Alumni Fellowship. He is also the co-author of How Trump Won: The Inside Story of a Revolution, which is available from Regnery. Follow him on Twitter at @joelpollak.", 
      "date": "11 Oct 2019"
    }, 
    {
      "subtitle": "Former U.S. Ambassador to Ukraine Marie Yovanovitch on Friday told House Democrats pursuing the impeachment inquiry that President Donald Trump pressured the State Department to remove her from her post because he had “lost confidence” in her.", 
      "author": "Edwin Mora", 
      "url": "https://www.breitbart.com/politics/2019/10/11/former-ambassador-ukraine-tells-congress-trump-pressured-state-remove-me/", 
      "title": "Former Ambassador to Ukraine Tells Congress: Trump Pressured State to Remove Me", 
      "content": " In written testimony prepared for her deposition in the Democrats’ impeachment inquiry, Yovanovitch declared that she was “abruptly” told to return to Washington in late April. Yovanovitch served as the American ambassador to Ukraine from August 2016 through May 20, 2019. She now serves as a State Department fellow at Georgetown University. In her written remarks, obtained by the Washington Post and other news outlets, the former ambassador noted that she met with U.S. Deputy Secretary of State John Sullivan to discuss “why my posting ended so suddenly,” adding: He said that the President had lost confidence in me and no longer wished me to serve as his ambassador. He added that there had been a concerted campaign against me, and that the [State] Department had been under pressure from the President to remove me since the Summer of 2018. He also said that I had done nothing wrong and that this was not like other situations where he had recalled ambassadors for cause. I departed Ukraine for good this past May. Yovanovitch testified before House Democrats pursuing the impeachment inquiry despite the White House indicating earlier this week it would block all officials from testifying. In a letter to House Democrat leaders, the White House dismissed the probe as unfair and “illegitimate.” The Trump administration attempted to block her deposition, prompting House Democrats to issue a subpoena for her appearance that ultimately compelled her to testify, the chairmen of the House panels leading the impeachment probe said in a joint statement. On Tuesday, the State Department ordered U.S. Ambassador to the European Union Gordon Sondland not to testify, prompting House Democrats to subpoena him. U.S. Secretary of State Mike Pompeo the following day vowed that his department would fulfill its legal obligations in responding to the impeachment inquiry. Pompeo noted, however, that the State Department would take its cues from the White House Citing people familiar with the matter, the Wall Street Journal reported in early October that Trump ousted Yovanovitch “after months of complaints from allies outside the administration, including his personal lawyer Rudy Giuliani, that she was undermining him abroad and obstructing efforts to persuade Kyiv to investigate former Vice President Joe Biden. ” The former ambassador denied those allegations in her written remarks, saying: [F]ictitious is the notion that I am disloyal to President Trump. I have heard the allegation in the media that I supposedly told the Embassy team to ignore the President’s orders “since he was going to be impeached.” That allegation is false. I have never said such a thing, to my Embassy colleagues or to anyone else. Next, the Obama administration did not ask me to help the Clinton campaign or harm the Trump campaign, nor would I have taken any such steps if they had.\n\n…\n\nAlthough I understand that I served at the pleasure of the President, I was nevertheless incredulous that the U.S. government chose to remove an Ambassador based, as best as I can tell, on unfounded and false claims by people with clearly questionable motives. The former ambassador said she had “minimal contacts” with Giuliani. The “whistleblower’s” complaint fueling the impeachment inquiry mentions Yovanovitch’s ouster as an example of what the leaker described as the U.S. president’s abuse of power. According to the “whistleblower,” Trump attempted to coerce Ukrainian President Volodymyr Zelensky into investigating allegations of corruption against Biden and his son, Hunter, in exchange for aid during a July 25 call. Trump and Zelensky have denied the allegations. A partial transcript of the calls released by the White House cites Trump as telling Zelensky the former U.S. ambassador is “bad news.”", 
      "date": "11 Oct 2019"
    }, 
    {
      "subtitle": "A supporter of President Donald Trump reacted calmly after a protester spit in his face on Thursday night during a TV interview.", 
      "author": "Charlie Spiering", 
      "url": "https://www.breitbart.com/politics/2019/10/11/watch-trump-supporter-calmly-reacts-to-protester-spitting-in-his-face-during-interview/", 
      "title": "Watch: Trump Supporter Calmly Reacts to Protester Spitting in His Face During Interview", 
      "content": " Vice News was interviewing Dave Carlson, a salesman in Minnesota who attended the president’s political rally, when an unknown protester spit in his face. Carlson winced, turned slightly, and replied, “Oh nice,” and chuckled. The Vice News reporter reacted in shock while another protester apologized for what happened as Carlson wiped the spit off of his face. A second protester approached him to explain why it happened: “That’s not how people really feel; that’s f*cking disrespectful, but on the other hand, that shit is disrespectful as f*ck that too,” he said, pointing to Carlson’s hat. Watch: ", 
      "date": "11 Oct 2019"
    }, 
    {
      "subtitle": "null", 
      "author": "Pam Key", 
      "url": "https://www.breitbart.com/clips/2019/10/11/trump-jr-blasts-medias-treatment-of-hunter-biden-double-standard/", 
      "title": "Trump Jr. Blasts Media’s Treatment of Hunter Biden — ‘Double Standard’", 
      "content": " On Friday’s edition of “Brian Kilmeade Show,” President Donald Trump’s son Donald Trump Jr. criticized the media’s “double standard” on Hunter Biden, the son of 2020 presidential hopeful former Vice President Joe Biden, Ukraine business ties. Trump said, “Look at what they tried to do to me for three years. I mean, these clowns tried to put me in jail for three years because I took an unsolicited phone call. You know, the double standard is pretty sick, Brian. I’ve talked about it for a long time. We can play one way, or we can play another way, but we’ve got to be playing the same game. The reality is this: If Donald Trump Jr. flew on Air Force One with my father, the president, to China and came back with $1.5 —not $1.5 billion, just $1.5—we’d solve the fake news media problem because their heads would explode.” He continued, “There is a double standard. If Donald Trump Jr. had a no-show gig on a corrupt Ukrainian oil company while my father was in charge of the issues over there… minor details. I’ve never been in energy or oil. Minor details. I don’t speak Ukrainian…You think the press would have a problem with that, Brian?” He added, “I had the media camped out in front of my apartment for two years. They don’t even try to find this guy to even get a comment.” He concluded, “It’s not fair. It’s not a level playing field. And, so we have to fight fact accordingly.” Follow Pam Key on Twitter @pamkeyNEN", 
      "date": "11 Oct 2019"
    }, 
    {
      "subtitle": "The Second Amendment Foundation (SAF) is asking the Supreme Court of the United States (SCOTUS) to intervene against Illinois’ ban on concealed carry law for non-residents.", 
      "author": "AWR Hawkins", 
      "url": "https://www.breitbart.com/politics/2019/10/11/saf-asks-scotus-intervene-illinois-ban-non-resident-concealed-carry/", 
      "title": "SAF Asks SCOTUS to Intervene in Illinois’ Ban on Non-Resident Concealed Carry", 
      "content": " SAF posits that Illinois’ “ban on concealed carry by non-residents” deprives non-Illinois residents of their Second Amendment rights, in effect denying “virtually all Americans…of their full Second Amendment rights while in the state of Illinois.” SAF founder and Executive Vice President Alan Gottlieb said: This is a case that literally begs for Supreme Court attention. When the Court ruled in the 2008 Heller case that the Second Amendment protected a fundamental right, it was clear that this right belongs to everyone, not just the residents of an individual state. The Seventh Circuit held in Moore v. Madigan that the carrying of firearms in public for self-defense is a fundamental right, but under existing Illinois restrictions, that right has been limited to Illinois residents and citizens from only four other states. On December 11, 2012, Breitbart News reported the Seventh Circuit ruling that brought concealed carry to Illinois. Judge Richard Posner wrote the court’s Majority Opinion, saying: We are disinclined to engage in another round of historical analysis to determine whether eighteenth-century America understood the Second Amendment to include a right to bear guns outside the home. The Supreme Court has decided that the amendment confers a right to bear arms for self-defense, which is as important outside the home as inside. SAF’s pursuit of a SCOTUS review is joined by the Illinois State Rifle Association (ISRA), Illinois Carry, and nine private citizens. AWR Hawkins is an award-winning Second Amendment columnist for Breitbart News and the writer/curator of Down Range with AWR Hawkins, a weekly newsletter focused on all things Second Amendment, also for Breitbart News. He is the political analyst for Armed American Radio. Follow him on Twitter: @AWRHawkins. Reach him directly at awrhawkins@breitbart.com. Sign up to get Down Range at breitbart.com/downrange.", 
      "date": "11 Oct 2019"
    }, 
    {
      "subtitle": "null", 
      "author": "Pam Key", 
      "url": "https://www.breitbart.com/clips/2019/10/11/fncs-neil-cavuto-on-shepard-smiths-exit-im-a-little-stunned-and-a-little-heartbroken/", 
      "title": "FNC’s Neil Cavuto on Shepard Smith’s Exit: I’m a Little Stunned and a Little Heartbroken’", 
      "content": " On Friday’s broadcast of Fox News Channel’s “Your World,” host Neil Cavuto reacted to the departure of his colleague Shepard Smith. Cavuto said, “I’m a little stunned and a little heartbroken. I don’t know what to say.” He continued, “Wow, a better newsman you probably cannot find — a bigger, more emotionally connected to humankind you cannot find. So, Shepard, I don’t know what the heck you’re planning to do or where you go, but I just know you’ll be great at doing it, and you deserve the best that life has to offer. I’m sorry if I’m a little shell shocked her.” Reporter John Roberts said, “I’m just trying to compile my thoughts too. I walked out here to do the hit and suddenly got hit by a subway train. Holy mackerel.” Follow Pam Key on Twitter @pamkeyNEN", 
      "date": "11 Oct 2019"
    }, 
    {
      "subtitle": "Singer and actress Nancy Sinatra boasted of her prediction of what would happen if “ignorant” Trump became president, lamenting his right-leaning Supreme Court nominees, accusing him of starting a war, and declaring that he should be impeached and removed due to the “clear and present danger” he poses to “our country and the world.”", 
      "author": "Hannah Bleau", 
      "url": "https://www.breitbart.com/entertainment/2019/10/11/nancy-sinatra-trump-a-clear-and-present-danger-to-our-country-and-the-world/", 
      "title": "Nancy Sinatra: Trump a ‘Clear and Present Danger to Our Country and the World’", 
      "content": " “Two things I knew would happen if ignorant @realDonaldTrump was ‘elected’ – 1/ he would stack the Supreme Court and 2/ he would start a war someplace, anyplace,” Nancy Sinatra wrote to her 218k Twitter followers. “He is a clear and present danger to our country and the world,” she added. “#ImpeachAndRemove.”  It remains unclear why the “These Boots Are Made for Walkin” singer emphasized “elected,” as Trump fairly won the 2016 election, surpassing the 270 Electoral College threshold with 304 electoral votes to Hillary Clinton’s 227. Sinatra has been a longtime advocate for Trump’s impeachment, calling for his removal during his first year in office in 2017. “The truth is we should get that son of a bitch @realDonaldTrump out of our White House,” Sinatra wrote in 2017, using the hashtag “MuellerTime,” indicating that she counted on the Mueller report to sink the president. However, the report found no evidence of collusion or conspiracy between the Trump campaign and Russia.    She continued to remain a strong voice for impeachment the following year, fantasizing about impeaching Trump first and indicting him later:  The “Sugar Town” singer asked House Speaker Nancy Pelosi (D-CA) to consider impeachment earlier this year and has since upped her impeachment ante on social media:  ", 
      "date": "11 Oct 2019"
    }, 
    {
      "subtitle": "Greta Thunberg, the 16-year-old Swedish girl who has become the international face of the youth climate change movement, has been passed up by the Peace Research Institute in Oslo for the 2019 Nobel Peace Prize.", 
      "author": "Penny Starr", 
      "url": "https://www.breitbart.com/politics/2019/10/11/greta-thunbergs-cause-could-have-cost-her-peace-prize-no-science-connect-climate-change-conflict/", 
      "title": "Greta Thunberg’s Cause Could Have Cost Her Peace Prize: No Science to Connect Climate Change to Conflict", 
      "content": " Thunberg was a bookmaker favorite to win the prize, and her almost 3 million Twitter followers also were hopeful she would win for her attempt to convince world leaders that the United Nations is correct in its estimation that man-made climate change could lead to mass extinction. But the prize committee disagreed. It chose Ethiopian Prime Minister Abiy Ahmed, who put in place a peace process to finally end a 20-year conflict with neighboring Eritrea. But the Washington Post reported Thunberg’s cause may not be the right vehicle for a peace prize, and then tried to make the case that it should be. According to the report: Henrik Urdal, the head of the Peace Research Institute of Oslo, omitted Thunberg from the Nobel Peace Prize shortlist he publishes. He explained his decision to the Washington Post, saying there “isn’t scientific consensus that there is a linear relationship between climate change — or resource scarcity, more broadly — and armed conflict.” The link between climate change and conflict is hotly debated. But climate change scholars say that while there isn’t a straightforward relationship, there is a recognition that climate change adds to stresses in regions that could spark political instability and conditions that could foster conflict. The Pentagon has called climate change a “threat multiplier.” The prize has gone to environmental champions before. In 2007, the Intergovernmental Panel on Climate Change (IPCC) and former vice president Al Gore won “for their efforts to build up and disseminate greater knowledge about man-made climate change, and to lay the foundations for the measures that are needed to counteract such change.” In 2004, it was given to Wangari Maathai “for her contribution to sustainable development, democracy and peace.” In 1970, it went to Norman Borlaug, sometimes called the “father of the green revolution.” Urdal told the Post that those awards could be a thing of the past because of what Alfred Nobel hoped the prize would represent. “In his will outlining the prize, Nobel wrote that the recipient should be someone who has advanced the ‘abolition or reduction of standing armies’ — which some have interpreted as requiring a direct connection to peace and conflict,” the Post reported. “If you make it too broad, it becomes a bit meaningless,” Urdal said. The Post then checked in with a politics professor at the University of Oslo, who called Thunberg a “wild card” nominee. “The link between climate change and conflict is still ‘quite tenuous at this point,’ she said in the Post report. “Everyone sees flooding can cause conflict, migration and so on, but this is no way well established as a security policy issue yet.” The Post also speculated that it could have been poor timing for Thunberg since the committee puts together its shortlist of nominees at the end of January — before the teen made a splash with her transatlantic sail from Europe to New York on a solar-powered racing yacht and her fiery speech at the United Nations calling out adults for failing to address climate change. On Friday when the announcement was made Thunberg was in Denver with other teens who skipped school to protest climate change. Follow Penny Starr on Twitter", 
      "date": "11 Oct 2019"
    }, 
    {
      "subtitle": "GAINESVILLE, Florida — Left-wing activists congregated outside of the University of Florida’s University Auditorium ahead of Donald Trump Jr.’s appearance on Thursday, marching and chanting, “No Trump, No KKK, No Fascist USA.”", 
      "author": "Hannah Bleau", 
      "url": "https://www.breitbart.com/politics/2019/10/11/watch-leftists-protest-donald-trump-jr-with-no-kkk-no-fascist-usa-chant/", 
      "title": "Watch: Leftists Protest Donald Trump Jr. with ‘No KKK, No Fascist USA’ Chant", 
      "content": " Dozens of students gathered outside of the University Auditorium to protest Donald Trump Jr. and Kimberly Guilfoyle’s appearance, marching across campus and chanting “No Trump, No KKK, No Fascist USA” in unison. Several of the protesters made their way into the University Auditorium, reserving seats specifically to heckle Trump and Guilfoyle. They, at times, shouted, “bullshit,” “Nazi scumbag,” “fuck you,” and, “You put children in cages.” Trump supporters — more than once — drowned out their cries by shouting, “USA, USA, USA.” “Let them get it out of their system. It’s all good,” Trump said amid their interruptions. “That’s what we’re facing. You guys have a decision.” “The difference between the sides are — I’ll still come here,” he continued. “Because as my father said in 2016, he’s going to be the president for all Americans, not just those who agree with him.”", 
      "date": "11 Oct 2019"
    }, 
    {
      "subtitle": "GAINESVILLE, Florida– Protesters gathered at the University of Florida (UF) ahead of Donald Trump Jr. and Kimberly Guilfoyle’s appearance at the university on Thursday, marching outside of the venue and holding signs reading “FUCH U NAZI BITCH” and “I’ll Grab Ya Daddy By The Pussy.”", 
      "author": "Hannah Bleau", 
      "url": "https://www.breitbart.com/politics/2019/10/11/college-students-protest-donald-trump-jr-ill-grab-ya-daddy-pssy/", 
      "title": "College Students Protest Donald Trump Jr.: ‘I’ll Grab Ya Daddy by the P*ssy’", 
      "content": " Trump and Trump campaign senior adviser Kimberly Guilfoyle spoke at the University of Florida on Thursday evening, hosted by the UF student government’s ACCENT Speakers Bureau. Leftist students on campus expressed outrage over their appearance and planned protests ahead of the event, marching across campus to stand up against “Nazis” and “white supremacy.” Activists participated in interactive chanting: “When black lives are under attack, what do we do?” women on the megaphones asked. “Stand up, fight back,” the crowd shouted back. “When trans lives are under attack, what do we do?” the women asked. “Stand up, fight back!” the crowd continued. Protesters eventually moved to another side of the auditorium in order to “face” Don Jr. and chanted, “Whose streets? Our streets!” The activists held signs reading, “I am angry,” “Don’t spread hate,” and “Drain the swamp of white supremacy. Go back to Russia.” One activist held a puppet of a uterus, while another held up a bright pink sign featuring cartoonish depictions of President Trump. It read, “I’ll Grab Ya Daddy By The Pussy”: Breitbart News Breitbart News Breitbart News Breitbart News Breitbart News Breitbart News Breitbart News Olivia Yoh, a senior at the university, stood with the campus’s Republican group, countering the protesters with a cutout of the president’s face with the caption “No collusion”: Breitbart News “People are mad he’s coming here, because they feel like it’s a campaign event,” she told Breitbart News. “But honestly, we just view it as free speech, and we’re happy to have him come here to finally have someone who shares our views on campus.” When asked if the number of people against Trump’s appearance outnumbered those in favor, she said, “I think that the Democrats are much more outspoken about it, whereas Republicans are feeling kind of silenced by it.”", 
      "date": "11 Oct 2019"
    }, 
    {
      "subtitle": "Actor Ben Stiller went after President Donald Trump in a Twitter rant in which the Zoolander star said he’s deeply disturbed “to see the president encourage antipathy towards, and fear of #Refugees.”", 
      "author": "Jerome Hudson", 
      "url": "https://www.breitbart.com/entertainment/2019/10/11/ben-stiller-accuses-trump-of-spreading-hate-fear-and-division-about-refugees/", 
      "title": "Ben Stiller Accuses Trump of Spreading ‘Hate, Fear, and Division’ About Refugees", 
      "content": " “Speaking as a citizen, it’s extremely disturbing to see the president encourage antipathy towards, and fear of #Refugees at his rally. I know that most people in Minnesota are proud and supportive of America’s leadership in helping the 70 million displaced people in the world,” Stiller’s screed began. “It’s clear that false narratives about the danger of resettlement, that have no statistical evidence, and claiming that vetting is not extreme or rigorous enough, stoke the flames of division, and appeal to our lowest instincts. It’s not true,” Ben Stiller said. “Our country is made up of immigrants and refugees, and we have always welcomed them in a safe, and beneficial ( if not perfect) way for all involved. This is the message our president needs to spread. Not hate, fear and division,” the Saturday Night Live alum concluded.   Stiller’s rant referenced comments President Trump made during his rally in Minnesota on Thursday night, in which he said “I promise you as president I will give local communities a greater say on refugee policy and put in place enhanced vetting and responsible immigration controls.” “Since coming to office, I have reduced refugee resettlement by 85 percent,” Trump continued. “And as you know, maybe especially in Minnesota, I signed an executive order that no refugees will be resettled in any state without the expressed written consent of that city or that state.” Stiller, who rarely publicly chimes in on political issues, has served since last year as Goodwill Ambassador for UNHCR, the United Nations Refugee Agency. The Tropic Thunder star was among the celebrities who slammed President Trump’s reported use of the word “shithole” to describe several countries during an Oval Office meeting last January. Stiller added his name to those who praised Supreme Court Justice Brett Kavanahugh’s misconduct accuser Christine Blasey Ford ahead of her testimony before the Senate Judiciary Committee last September.  “Respect to Doctor Ford for standing up and telling her story. For my family, my daughter and people who value the truth, you are a hero and on the right side of history,” Stiller said. Jerome Hudson is Breitbart News Entertainment Editor and author of the bestselling book 50 Things They Don’t Want You to Know. Order your copy today. Follow Jerome Hudson on Twitter @jeromeehudson.", 
      "date": "11 Oct 2019"
    }, 
    {
      "subtitle": "An illegal alien who was twice freed into the interior of the United States has been sentenced to life for brutally murdering 20-year-old Jared Vargas.", 
      "author": "John Binder", 
      "url": "https://www.breitbart.com/politics/2019/10/11/illegal-alien-freed-into-u-s-gets-life-sentence-for-murdering-jared-vargas/", 
      "title": "Illegal Alien, Freed into U.S., Gets Life Sentence for Murdering Jared Vargas", 
      "content": " On Friday, 20-year-old illegal alien Ernesto Esquivel-Garcia from Mexico was sentenced to life in prison for murdering Vargas in June 2018 after being convicted of first-degree murder in August, as Breitbart News reported. On the Angel Family’s Facebook page, Justice for Jared Vargas, they celebrated the life sentence of the illegal alien who took their loved one’s life. “Life!!!” the Angel Family posted. A photo memorial of 20-year-old college student Jared Vargas, a loving brother to his twin and little sister, who was murdered by an illegal alien in June 2018. (Photo via Facebook) Vargas, a cybersecurity student at the University of Texas at San Antonio, was found murdered by Esquivel-Garcia on June 18, 2018, when firefighters arrived at the scene of an apartment set ablaze. Prosecutors said the illegal alien had brutally strangled and stabbed Vargas to death before setting his body on fire in the apartment complex. Throughout the trial, Esquivel-Garcia and his attorneys had used a defense and smear against Vargas to justify the murder, claiming that the illegal alien killed Vargas in self-defense because he believed that he was under threat of being sexually assaulted. The murder occurred after Esquivel-Garcia had been twice released from police and federal custody back into the U.S. and was only given a voluntary deportation order despite having a criminal record. In March 2017, the illegal alien was arrested for drunk driving and was eventually turned over to the Immigration and Customs Enforcement (ICE) agency. Though he was placed into deportation proceedings, an immigration judge allowed him to post bond, and he was released back into the interior of the country. In May 2018, a month before Vargas was murdered, Esquivel-Garcia was again put into ICE custody and local police custody but was able to post bond and be released back into the U.S. with only the promise that he would self-deport. Esquivel-Garcia is eligible for parole in 30 years, and if ever released on parole, he will be deported by federal immigration officials to Mexico. Jared Vargas leaves behind his twin brother, in college, and a little sister, in high school, as well as his parents and countless loved ones and friends. A GoFundMe page has been set up in his honor to help his twin brother and little sister in their schooling. John Binder is a reporter for Breitbart News. Follow him on Twitter at @JxhnBinder.", 
      "date": "11 Oct 2019"
    }, 
    {
      "subtitle": "President Donald Trump announced a “substantial phase one deal” with China on Friday after continued negotiations with the vice premier of China that began on Thursday.", 
      "author": "Charlie Spiering", 
      "url": "https://www.breitbart.com/politics/2019/10/11/donald-trump-announces-future-substantial-phase-one-deal-china/", 
      "title": "Donald Trump Announces Future ‘Substantial Phase One Deal’ with China", 
      "content": " The president spoke about the future deal during remarks with reporters in the Oval Office at the White House after a meeting with Vice Premier of China H.E. Liu He. “We’ve come to a very substantial phase one deal,” Trump said, noting that it would soon be written and signed by both parties. The president said that China had agreed to $40 billion to $50 billion in agricultural purchases, as well as an agreement on intellectual property and financial services. “That’s the largest order in the history of agriculture,” Trump said. He said he was “excited” that farmers would experience a big economic boost as a result of the deal. “They’re going to have to buy more land,” he said, questioning whether farmers could even produce enough agricultural products. Treasury Secretary Steven Mnuchin said that they had also reached an agreement surrounding China’s currency after the United States labeled the country as a currency manipulator. Trump said that the deal was still “subject to getting written,” but Treasury Secretary Steven Mnuchin confirmed that the scheduled tariff hike from 25 percent to 30 percent on October 15 would not take place as a result of the agreement. Trump said he would likely sign the potential deal with President Xi Jinping at the APEC summit in Chile in November. “I don’t think it should be a problem getting it papered,” Trump said, referring to the agreement. U.S. Trade Representative Robert Lighthizer said the Chinese technology Huawei was not part of the deal and would be dealt with separately. The stock market jumped over 500 points on Friday in reaction to the news but closed at 315 points. Lighthizer confirmed the scheduled December 15 tariffs would remain in place for now. “There’s plenty of time to make that decision,” Lighthizer said. Trump said that it was possible that phase two and phase three part of the deal would happen afterward. “Congratulations on the 70th” Trump said, referring to the Chinese Communist party in China celebrating their 70th anniversary. He described the military parade and event “amazing to watch.” The Vice Premier thanked Trump for his congratulatory remarks about the Chinese government’s anniversary and expressed optimism about the future talks between the two countries. “We have made substantial progress in many fields, and we are very happy about it,” Liu said. Liu also presented Trump with a letter from Xi Jinping to the president who took it out of the envelope and showed it to reporters. “We’re working on enforcement right now,” Trump said, noting that the deals would be written and set for the signed agreement in November. “We think that China wants it badly and we want it also,” he said. Trump said that the deal might signal a future “love fest” with China and the Vice Premier said that the deal would bring “peace and prosperity to the world.” “It’s beyond a trade deal,” Trump said.", 
      "date": "11 Oct 2019"
    }, 
    {
      "subtitle": "President Donald Trump questioned why Fox News anchor Shepard Smith on Friday announced his sudden departure from the network.", 
      "author": "Charlie Spiering", 
      "url": "https://www.breitbart.com/politics/2019/10/11/donald-trump-questions-shepard-smiths-ratings-after-announced-departure/", 
      "title": "Donald Trump Questions Shepard Smith’s Ratings After Announced Departure", 
      "content": " The president appeared not to have prior knowledge of the news. “Is he leaving?” Trump asked. “Oh, that’s a shame.” He did not respond to questions from reporters of whether he pressured Smith to leave the network. “Is he leaving because of bad ratings? Tell me, I don’t know,” Trump said. “I’m assuming he’s leaving because of bad ratings.” Smith ended his 3:00 p.m. show, bidding farewell to viewers, noting he asked to be let go from the network. “Recently I asked the company to allow me to leave Fox News and begin a new chapter,” Smith said. “After requesting that I stay, they graciously obliged.” The president has a history of expressing ire at Smith’s reporting of the news on the Fox News channel but did not celebrate his departure. “I wish him well,” Trump said.", 
      "date": "11 Oct 2019"
    }, 
    {
      "subtitle": "Democrat presidential hopeful Pete Buttigieg falsely claimed during CNN’s equality town hall on Thursday that under President Donald Trump, Housing and Urban Development (HUD) is making it harder for transgender youth who are homeless to find shelter.", 
      "author": "Penny Starr", 
      "url": "https://www.breitbart.com/2020-election/2019/10/11/fact-check-pete-buttigieg-falsely-claims-trump-is-making-housing-harder-for-homeless-transgenders/", 
      "title": "Fact Check: Pete Buttigieg Falsely Claims Trump Is Making Housing Harder for Homeless Transgenders", 
      "content": " The remark came after Buttigieg, who is the mayor of South Bend, Indiana, was asked about whether bullying that causes suicide should have legal ramifications. “I believe it’s one of the things that could help,” Buttigieg said. “There are still states — I live in one of them — that don’t have hate crime legislation.” “And we need to make sure that our legislation reflects our values as a country and the insistence that nobody be singled out or harmed because of who they are,” Buttigieg said. He continued: But that’s just the beginning of what we’ve got to do for LGBTQ youth. We know that LGBTQ youth are much more likely to experience homelessness, which is one of the reasons why we need to invest more in youth homelessness in general and do the opposite of what this president is doing, which is allowing rules to go forward that would actually make it harder for transgender youth to access homeless services. “That is just wrong, and it will end in my administration,” Buttigieg said. In fact, while the HUD rule — posted in spring 2019 — does allow for shelters to make decisions based on privacy and safety, it specifically states that discrimination based on “sexual orientation and gender identity” will not take place: This proposed rule provides that grant recipients, subrecipients, owners, operators, managers, and providers (Shelter Providers) under HUD programs which permit single-sex or sex-segregated facilities (such as bathrooms or temporary, emergency shelters and other buildings and facilities with physical limitations or configurations that require and are permitted to have shared sleeping quarters or bathing facilities) may establish a policy, consistent with state and local law, by which such Shelter Provider considers an individual’s sex for the purposes of determining accommodation within such shelters and for purposes of determining sex for admission to any facility or portion thereof. The proposed rule permits Shelter Providers to consider a range of factors in making such determinations, including privacy, safety, practical concerns, religious beliefs, any relevant considerations under civil rights and nondiscrimination authorities , the individual’s sex as reflected in official government documents, as well as the gender which a person identifies with. The proposed rule does not dictate a required basis for making determinations other than that they be consistent with an overall policy. The proposed rule continues HUD’s policy of ensuring that its programs are open to all eligible individuals and families regardless of sexual orientation or gender identity. Buttigieg joined eight other Democrat candidates at the marathon town hall, including Sens. Elizabeth Warren (D-MA), Kamala Harris (D-CA), Cory Booker (D-NJ), and Amy Klobuchar (D-MN), as well as former HUD Secretary Julian Castro (D), former Vice President Joe Biden (D), former Rep. Beto O’Rourke (D-TX), and Tom Steyer (D). Follow Penny Starr on Twitter.", 
      "date": "11 Oct 2019"
    }, 
    {
      "subtitle": "Rep. Alexandria Ocasio-Cortez (D-NY) said during a speech at the C40 World Mayors Summit in Copenhagen that her dreams of motherhood now “taste bittersweet” due to climate change.", 
      "author": "Hannah Bleau", 
      "url": "https://www.breitbart.com/politics/2019/10/11/watch-ocasio-cortez-says-dreams-of-motherhood-taste-bittersweet-due-to-climate-change/", 
      "title": "Watch: Ocasio-Cortez Says Dreams of Motherhood ‘Taste Bittersweet’ Due to Climate Change", 
      "content": " The freshman lawmaker delivered a speech at the summit this week and emotionally declared that her dreams of motherhood “taste bittersweet” because of climate change and the impact it will have on “our children’s future.” “I speak to you not as an elected official or public figure. But I speak to you as a human being,” she began. “A woman whose dreams of motherhood now taste bittersweet because of what I know about our children’s future and that our actions are responsible for bringing their most dire possibilities into focus,” she continued, audibly holding back tears. “I speak to you as a daughter and descendant of colonized peoples who have already begun to suffer,” she added, citing the thousands of Puerto Rican lives lost due to Hurricane Maria, which she described as a “climate change powered storm.” She said her grandfather died in the aftermath along with others, all because “they were living under colonial rule, which contributed to the dire conditions and lack of recovery.” Dozens of C40 mayors called for a “Global Green New Deal” to address the mounting environmental concerns. “As mayors our first priority is to protect the safety of our citizens,” C40 chair, Paris Mayor Anne Hidalgo, said. “It will soon be four years since the Paris Agreement was signed in our city.” “World leaders met in New York just last month and once again failed to agree anything close to the level of action necessary to stop the climate crisis,” she continued. “There is no other solution but a Global Green New Deal to be the pivotal instrument to win this race against the clock. All decision-makers must take responsibility in making it a reality,” she added. This is far from the first time the socialist lawmaker has painted a dark picture of the future over concerns related to climate change. She told viewers during a live video on social media in August that she wants to “perhaps have one less child” due to the looming threat. “Even now, you know, when you put climate change on top of that, I know that I want to perhaps have one less child than I thought I would maybe have,” she explained. “I think having a mixed family is part of my personal planning. But it’s really hard, and I don’t think sometimes that older generations understand how much we’re taking this into account,” she added: ", 
      "date": "11 Oct 2019"
    }, 
    {
      "subtitle": "President Donald Trump surprised the 2019 Little League World Champions on Friday by inviting them to fly home aboard Air Force One.", 
      "author": "Charlie Spiering", 
      "url": "https://www.breitbart.com/politics/2019/10/11/donald-trump-surprises-little-league-champions-with-ride-home-on-air-force-one/", 
      "title": "Donald Trump Surprises Little League Champions with Ride Home on Air Force One", 
      "content": " The Lousiana Eastbank All Stars team visited the White House on Friday, appearing with the president for a picture. The president surprised them by inviting them to fly home with him, as he has a scheduled rally in the state on Friday evening. Pictures of the team soon emerged on social media. ", 
      "date": "11 Oct 2019"
    }, 
    {
      "subtitle": "Defense Secretary Mark Esper said Friday the Trump administration decided to pull back less than 50 U.S. troops from northern Syria in order to make sure they were not caught in a pending fight between Turkish and Syrian Kurdish forces.", 
      "author": "Kristina Wong", 
      "url": "https://www.breitbart.com/politics/2019/10/11/pentagon-chief-on-decision-to-move-troops-in-syria-we-put-the-safety-of-our-soldiers-first/", 
      "title": "Pentagon Chief on Decision to Move Troops in Syria: ‘We Put the Safety of Our Soldiers First’", 
      "content": " “When Turkey notified us of an imminent military operation, we relocated a small contingent of less than 50 special operations soldiers out of the immediate zone of attack,” he said. “This decision was made to ensure that American troops were not caught up in the fighting between Turkish and Kurdish forces.” “The safety of our men and women in uniform remains our top priority,” he added. Esper said Turkey’s decision put the U.S. in a tough situation, given that Turkey is a North Atlantic Treaty Organization (NATO) ally. He said: The impulsive action of President Erdogan to invade northern Syria has put the United States in a tough situation, given our relationship with our NATO ally Turkey, who has fought alongside the United States in the past, and the Syrian Democratic Forces who helped us destroy the physical caliphate of ISIS, and the safety of U.S. military personnel. He said, “Rather than get pulled into this conflict, we put the safety of our soldiers first, while urging Turkey to forego its operations and working hard with us to address their concerns through the development of a security zone along the border.” Despite the administration’s decision to take U.S. troops out of a pending military clash, critics have attacked the administration for “abandoning” the Syrian Kurds, who the U.S. armed to defeat the Islamic State (ISIS) in Syria. Critics have accused the Trump administration of “green-lighting” a Turkish incursion into northern Syria, where the Kurds had staked out a semi-autonomous region during the Syrian civil war. The Turks, who consider the Syrian Kurds to be terrorists and an existential threat, have long wanted to move against them in Syria. Esper said the U.S. had tried to prevent any pending attack, but that ultimately Turkey decided to make a move. He and other senior national security officials have adamantly denied that the administration gave Turkey the green light. “We oppose and are greatly disappointed by Turkey’s decision to launch a unilateral, military incursion into northern Syria,” he said. “This operation puts our SDF partners in harm’s way, it risks the security of ISIS prison camps, and will further destabilize the region.” “From the president on down, we have communicated with the Turks on this issue,” he said. “I spoke with Turkish Defense Minister Akar yesterday to express our strong opposition to Turkey’s actions, and reiterated the damage this is doing to our bilateral relationship.” He also said the U.S. was not abandoning the Syrian Kurds. “To be clear, we are not abandoning our Kurdish partner forces and U.S. troops remain with them in other parts of Syria,” he said. “We remain in close coordination with the Syrian Democratic Forces who helped us destroy the physical caliphate of ISIS, but I will not place American service members in the middle of a longstanding conflict between the Turks and the Kurds. This is not why we are in Syria,” he said. “We will continue to work with members of the defeat ISIS coalition and the Syrian Democratic Forces to ensure the defeat of ISIS,” he said. In addition, he said the Syrian Defense Forces have transferred two ISIS terrorists to U.S. custody who were involved in the kidnapping and murder of U.S. and U.K. citizens in Syria. He said they were being held in a safe and secure location in the U.S., but outside of Syria. Follow Breitbart News’s @Kristina_Wong.", 
      "date": "11 Oct 2019"
    }, 
    {
      "subtitle": "null", 
      "author": "Pam Key", 
      "url": "https://www.breitbart.com/clips/2019/10/11/msnbcs-wallace-on-shep-smiths-fox-news-departure-very-sad-news-for-the-truth-today/", 
      "title": "MSNBC’s Wallace on Shep Smith’s Fox News Departure: ‘Very Sad News for the Truth Today’", 
      "content": " On Friday’s broadcast of MSNBC’s “Deadline,” anchor Nicolle Wallace discussed Shepard Smith’s departure from Fox News. Wallace said, “That’s Shep Smith in my view, the most important voice at Fox News. He took apart Donald Trump’s Uranium One scam, he was an important voice for truth in front of an audience that needs it desperately.” She continued, “Very sad news for the truth today.” Follow Pam Key on Twitter @pamkeyNEN", 
      "date": "11 Oct 2019"
    }, 
    {
      "subtitle": "Some House Democrats are privately calling on Speaker Nancy Pelosi (D-CA) to hold a vote to formalize the impeachment inquiry to undermine Republican criticism that the process is illegitimate, Politico reported this week.", 
      "author": "Edwin Mora", 
      "url": "https://www.breitbart.com/politics/2019/10/11/report-democrats-privately-urging-pelosi-to-hold-impeachment-inquiry-vote/", 
      "title": "Report: Democrats Privately Urging Pelosi to Hold Impeachment Inquiry Vote", 
      "content": " So far, Pelosi has refused to schedule a vote, arguing that the Constitution and House rules do not require the lawmakers to do so. Meanwhile, the White House and its Republican congressional allies contend that such a vote is necessary to legitimize the inquiry per the recognized standards of previous impeachment efforts. Politico reported: Some Democratic lawmakers and aides have begun to say privately — and, to a lesser extent, publicly — that the House should just vote to formalize the inquiry, robbing the GOP of its main talking point. … Though a small but growing chorus of Democrats has started urging a vote simply to undercut this GOP talking point, others say that nothing will stop Trump and his supporters from claiming Democrats’ efforts are unfair and inconsistent with past impeachment procedures. They say the party shouldn’t take the White House’s bait, arguing that the president’s defenders will simply find other reasons to not comply with the inquiry. The “private” debate on whether or not to hold a vote “is threatening to cleave Democrats’ unified front” in favor of impeachment, the news outlet added. Rep. John Yarmuth (D-KY) publicly called for a vote, telling Politico,“If Nancy asked me, I would say sure, let’s have a vote. Everybody’s on record, so they’re not going to vote any differently. What’s the danger in having a vote to formalize it?” House lawmakers voted to allow an investigation into whether to impeach President Bill Clinton and President Richard Nixon. Republicans have pointed to those votes as evidence that Democrats are acting in an unfair and illegitimate manner. Politico noted: Democrats have long argued that they don’t need a vote to launch formal impeachment proceedings, even if that had been the practice in prior presidential impeachment processes. In fact, House lawyers backed by Pelosi have made that argument in a succession of court cases seeking evidence to support their impeachment inquiry, and proponents of that position worry a formal vote would undercut their legal claims. Similarly, Democrats are worried that a near-term floor vote would drive away a handful of Republicans who are wavering over whether to support impeachment proceedings. A party-line vote would hand the White House another talking point, they argue: that impeachment is a purely partisan effort by Democrats. In a letter to Pelosi and the House chairmen pursuing the impeachment inquiry, the White House said the Democrats were conducting a “constitutionally invalid” and “illegitimate” impeachment probe that absolves lawmakers of “taking political accountability.” The White House said it would not cooperate with the ongoing “partisan” impeachment investigation. Although the letter stopped short of explicitly calling on Pelosi to hold a vote, it all but dared the Speaker to do so. Most of the 235 members of the House Democratic Caucus support the impeachment probe, but there are still eight who did not, as of Thursday afternoon, a tally from the New York Times revealed.", 
      "date": "11 Oct 2019"
    }, 
    {
      "subtitle": "All eyes are focused on Louisiana, where Donald Trump will hold a rally on Friday night and the state’s voters will go to the polls in a “jungle primary” on Saturday.", 
      "author": "Michael Patrick Leahy", 
      "url": "https://www.breitbart.com/politics/2019/10/11/all-eyes-on-louisiana-gubernatorial-jungle-primary-first-election-in-nation-since-impeachment-inquiry/", 
      "title": "All Eyes on Louisiana: Gubernatorial ‘Jungle Primary’ First Election in Nation Since Impeachment Inquiry", 
      "content": " The primary pits incumbent Democrat Gov. John Bel Edwards against Republican Rep. Ralph Abraham (R-LA) and Republican businessman Eddie Rispone. Edwards has been hovering in recent polls just a few points under the 50 percent majority he will need to avoid a November runoff election against Saturday’s second place finisher. Abraham and Rispone have been jockeying for the second spot, with both registering between 20 percent and 25 percent in recent polls. President Trump has been attacking Edwards vigorously in recent days, portraying him as another Democrat in lockstep with the impeachment inquiry announced two weeks ago by Speaker of the House Nancy Pelosi (D-CA). On Tuesday, White House Counsel Pat Cippolone sent a powerful letter to Pelosi, calling the inquiry an illegal and unconstitutional violation of the president’s due process rights. For his part, Edwards has attempted to deflect the president’s attacks while avoiding a direct confrontation, as The Advocate reported on Friday: Hours before President Donald Trump’s planned rally in Lake Charles Friday, Gov. John Bel Edwards said voters should not take cues from the “partisanship” of Washington, D.C., and touted his working relationship with the president on the eve of the open primary election in the governor’s race. Edwards, the only Democratic governor in the Deep South, responded to Trump’s Twitter missives against him, noting he has long held a pro-gun stance and saying Trump doesn’t know him or Louisiana. “I don’t think Louisiana should be taking its inspiration from the partisanship of D.C.,” he said in a half-hour-long press conference at SOWELA Community Technical College in Lake Charles. “I think Washington, instead, should take inspiration from the bipartisanship of Louisiana.” The Washington Post noted that Edwards’ efforts to avoid a runoff may fall short: As the only Democratic governor in the Deep South, John Bel Edwards appeared to be doing everything necessary to win a second term in Louisiana, a state whose populist Democratic roots seem to fray a bit more each year. Edwards signed some of the nation’s most restrictive abortion laws . He cozied up to President Trump, scoring an invite to a state dinner at the White House. And in a state with a robust Catholic population, Edwards aired television ads showing him shaking hands with Pope Francis. But all that still might not be enough for the governor to win his reelection battle outright on Saturday, as Trump holds an 11th-hour rally to boost support for the two leading GOP challengers. Early voting results suggest that the impeachment inquiry has created massive increases in Republican and Independent turnout, as Breitbart News reported on Sunday: Early voting in the October 12 “jungle primary” between incumbent Louisiana Gov. John Bel Edwards, a Democrat, and two Republican candidates ended on Saturday, and the turnout is massive, particularly among Republicans and Independents. “As of last night, 374,190 Louisianians either early voted by person or by mail in ballot (340,480 in person, and 33,710 mail in ballots). To put this number in perspective, this is the highest early voting turnout EVER for a non-Presidential election, and is the second highest early voting turnout EVER (only the 2016 Presidential election has seen a higher in person + absentee voting turnout with 531,555 early votes),” Louisiana-based JMC Analytics reported on Sunday. “Republican turnout volume is up 84%, while Independent turnout is up 80% and Democratic turnout is up 36%,” JMC Analytics concluded. On election eve, the question of whether Edwards will surpass the 50 percent margin needed to avoid a runoff remains in doubt. The outcome is likely to be determined by Republican turnout on election day. Historically, about 80 percent of all votes in the gubernatorial jungle primary are cast on election day. Should Edwards fail to reach 50 percent, Republicans are expected to rally around the second place finisher in the November runoff, whether it be Abraham or Rispone. That possible Republican consolidation in a potential November runoff election may be easier for Abraham than Rispone, since Abraham has focused his campaign attacks on Rispone, while Rispone has criticized both Edwards and Abraham.", 
      "date": "11 Oct 2019"
    }, 
    {
      "subtitle": "President Donald Trump will hold a Friday evening rally in Lake Charles, Louisiana, a day before the state’s gubernatorial jungle primary. Governor John Bel Edwards (D) needs to get more than 50 percent of the vote against Republicans Rep. Ralph Abraham (D-LA) and Eddie Rispone to avoid a runoff.", 
      "author": "Tony Lee", 
      "url": "https://www.breitbart.com/2020-election/2019/10/11/live-updates-trump-holds-louisiana-rally/", 
      "title": "***Live Updates*** Trump Holds Louisiana Rally", 
      "content": " Stay tuned to Breitbart News for live updates. All times eastern. — 9:30 PM: Trump now praising the Lake Charles Little League champs. Trump says he always watched Japan win the World Series and then suggest the Japanese had guys who looked like they were 18. He goes off on a story about a 12-year-old Little Leaguer who was throwing 100 mph. What? 9:25 PM: Trump praises Sen. John Kennedy (R-LA) and Rep. Bill Cassidy (R-LA) and invites them on stage. Kennedy says Trump “loves Louisiana like the devil loves sin.” Trump talks infrastructure and the Calcasieu Bridge. 9:15 PM: Trump says John Bel Edwards won’t protect the Second Amendment if Washington Democrats pressure him. He says a Republican will win the gubernatorial race if it goes to a runoff. Trump asks Rispone and Abraham to get on stage with him. 9:10 PM: Trump says Bernie was trying to hit a baseball today but “there was just not a lot of bat head speed.” He says “get better.” 9:07 PM: Trump says he needs Louisiana voters to “send a loud and clear” message to Democrats by voting against John Bel Edwards. Trump ripping him for increasing taxes after promising not to do so and then reminisces about his 2016 Louisiana victory. 9:01 PM: Trump says Democrats are “scammers and con artists” who are “perpetuating hoaxes and witch hunts” because they can’t beat him at the ballot box. He says they are pursuing an “invalid, unconstitutional, and bullshit impeachment.” Crowd erupts. Trump: “Thank God we have a thing called social media.” He says it helps him “get the word out.” He calls the impeachment inquiry one of the “greatest con jobs every” that should never be allowed to happen to another president. Trump says other nations, looking at the impeachment inquiry, look at America and “think we’re all crazy.” He now again rips “Nervous Nancy” and “Shifty Adam Schiff” for their impeachment shenanigans. “I used to think she loved the country,” Trump says. “Nancy Pelosi hates the United States of America.” Trump says Pelosi would not be pursuing impeachment if she loved the country. 9:00 PM: Trump rips the Democrats and the fake news media, says “they’re partners.” He says they would be calling for his kids to be thrown in jail if they made deals like Hunter Biden and then adds, “but we’re here and they’re not.” Trump again rips Democrats and the media for coordinating talking points on everything from the “manufactured crisis” at the border to Russia and says, “that’s the real collusion.” Trump says the Democrats and the media have been trying to defeat him for three years and they are trying to “sabotage,” “deceive” and” hurt voters.” Trump mocks the New York Times for winning the Pulitzer Prize for stories that got the Russia collusion hoax wrong. 8:55 PM: Trump says his “Where’s Hunter?” line from last night’s rally became the hottest thing in the whole country. Trump: “The fake news is always covering up for Joe Biden.”  8:50 PM: Trump says they are battling the unholy alliance “of corrupt Democrat politicians, Deep State bureaucrats and the fake news media.” Trump says the TV ratings will tank when he is not president. He says the fake news media will endorse him for ratings and Trump asks if Americans want “the fake Pocahontas” as president of “Sleepy Joe,” whose son “knows nothing about energy.”  Trump now ripping Hunter Biden’s corrupt business dealings with Ukraine and China. He says Hunter “doesn’t even know what a gasoline tank looks like.” 8:45 PM: Protesters interrupt after Trump accuses the fake news media like NBC of trying to find veterans who are unhappy and making them “stars” to hurt the Trump administration. Trump says all of the nation’s gains are put to risk by Democrats who have gone “completely insane.” He says Democrats have waged a “non-stop battle” for three years to “overturn your vote” and “overturn the results of the most spectacular election in the history of our country.” He accuses Democrats of selling the country out, opening borders, and bogging the country down in endless wars.  8:41 PM: Trump says “we’ve ended the war on American energy” and the United States is the top producer of oil and gas anywhere on the planet. Trump rips Democrats who want to get rid of oil and natural gas. He mocks Democrats who want to go to wind. “I can’t watch LSU and Florida because there is no wind today,” Trump says. 8:38 PM: Trump takes the stage. Trump asks Louisiana voters to vote against a “liberal Democrat” who has sold them out. Trump references the LSU-Florida game at Death Valley and says he wants them to enjoy the game but not if they do not vote first. He urges voters to vote first and then enjoy the game so they don’t feel guilty. 8:20 PM: Rally starting a bit late, but Trump should soon be on stage.  7:50 PM: Trump makes news after landing in Louisiana:   7:45 PM: Not the Undertaker’s Death Valley, but all eyes will be on Death Valley under the lights tomorrow evening to see how good Joe Burrow and LSU’s offense really are against Florida’s vaunted defense as election results come in after the polls close.    7:30 PM:       ", 
      "date": "11 Oct 2019"
    }, 
    {
      "subtitle": "Two former National Security Council staffers that worked with the so-called whistleblower in the Obama and Trump administrations now work for House Intelligence Chairman Adam Schiff (D-CA), according to a report.", 
      "author": "Breitbart News", 
      "url": "https://www.breitbart.com/politics/2019/10/11/washington-examiner-two-adam-schiff-staffers-worked-with-whistleblower-at-white-house/", 
      "title": "Washington Examiner: Two Adam Schiff Staffers Worked with ‘Whistleblower’ at White House", 
      "content": " The Washington Examiner states: House Intelligence Committee Chairman Adam Schiff recruited two former National Security Council aides who worked alongside the CIA whistleblower at the NSC during the Obama and Trump administrations, the Washington Examiner has learned. Abigail Grace, who worked at the NSC until 2018, was hired in February, while Sean Misko, an NSC aide until 2017, joined Schiff’s committee staff in August, the same month the whistleblower submitted his complaint. The whistleblower was an NSC official who worked with former Vice President Joe Biden and who has expertise in Ukraine, the Washington Examiner has reported. A career CIA analyst with Ukraine expertise, the whistleblower aired his concerns about a phone conversation between President Trump and Ukrainian President Volodymyr Zelensky to a House Intelligence Committee aide on Schiff’s staff. He had previously informed the CIA’s legal counsel’s office. Click here to read the rest of the report.", 
      "date": "11 Oct 2019"
    }, 
    {
      "subtitle": "President Donald Trump will rally with supporters in Louisiana on Friday, as he continues to campaign for re-election.", 
      "author": "Charlie Spiering", 
      "url": "https://www.breitbart.com/politics/2019/10/11/watch-live-donald-trump-rallies-supporters-in-louisiana/", 
      "title": "Watch Live: Donald Trump Rallies Supporters in Louisiana", 
      "content": " The president is also rallying Republicans to vote in the race for Louisiana governor. Trump is scheduled to begin speaking at 7:00 p.m. CDT in Lake Charles, LA. “I will be in Louisiana tonight (Love it!) to get Republicans to vote for either of our two great Republican Candidates and force a runoff with John Bel Edwards, who has done a really poor job of tax-cutting, car insurance cost (worst in USA), and is suspect on your Second Amendment!” he wrote on Twitter Friday morning. Livestream courtesy of Right Side Broadcasting Network.", 
      "date": "11 Oct 2019"
    }, 
    {
      "subtitle": "Acting Department of Homeland Security (DHS) Secretary Kevin McAleenan will be leaving his position as the head of the agency, President Trump announced Friday evening.", 
      "author": "John Binder", 
      "url": "https://www.breitbart.com/politics/2019/10/11/trump-to-replace-kevin-mcaleenan-at-department-of-homeland-security/", 
      "title": "Trump to Replace Kevin McAleenan at Department of Homeland Security", 
      "content": " In a series of posts, Trump announced that he would be replacing McAleenan next week after the former Customs and Border Protection Commissioner had served as head of DHS since April. Trump wrote: Kevin McAleenan has done an outstanding job as Acting Secretary of Homeland Security. We have worked well together with Border Crossings being way down. Kevin now, after many years in Government, wants to spend more time with his family and go to the private sector…. “Congratulations Kevin, on a job well done,” Trump continued. “I will be announcing the new Acting Secretary next week. Many wonderful candidates!”  McAleenan posted that he would “work with the White House and DHS leadership teams on a smooth transition” as he exits DHS:  As Breitbart News has chronicled for months,  McAleenan had defied the Trump administration on multiple fronts, including most recently providing an interview to the Washington Post in which he attacked Trump’s “Zero Tolerance” policy at the southern border and said he refused to call border crossers “illegal aliens.” For the structure at DHS, Breitbart News exclusively reported accounts in which administration sources said McAleenan had implemented a personnel agenda that sought to protect the bureaucratic allies of former DHS Secretary Kirstjen Nielsen. In a New York Times report last month, McAleenan was accused of telling federal immigration officials to ignore Trump’s orders at the U.S.-Mexico border. McAleenan, in June, was accused of having leaked raids scheduled by the Immigration and Customs Enforcement (ICE) agency in order to sabotage and stop the plan. The ICE raids would have arrested hundreds of illegal aliens who had already been ordered deported. John Binder is a reporter for Breitbart News. Follow him on Twitter at @JxhnBinder.", 
      "date": "11 Oct 2019"
    }, 
    {
      "subtitle": "Longtime Fox News Channel Shepard Smith’s unexpected departure could be the start of an “exodus” at the news network, according to one staffer.", 
      "author": "Joshua Caplan", 
      "url": "https://www.breitbart.com/politics/2019/10/11/rreport-shepard-smiths-exit-could-spark-fox-news-exodus/", 
      "title": "Report: Shepard Smith’s Exit Could Spark Fox News ‘Exodus’", 
      "content": " Smith announced during Friday’s edition of his weekday program Shepard Smith Reporting that today would be his final broadcast at the network. Smith, known for his critical coverage of President Donald Trump, said in a statement: Recently I asked the company to allow me to leave FOX News and begin a new chapter. After requesting that I stay, they graciously obliged. The opportunities afforded this guy from small town Mississippi have been many. It’s been an honor and a privilege to report the news each day to our loyal audience in context and with perspective, without fear or favor. I’ve worked with the most talented, dedicated and focused professionals I know and I’m proud to have anchored their work each day — I will deeply miss them. According to CNN, staffers inside Fox News were “openly weeping” over the news of Smith’s departure and said some “were here and have stayed here solely” due to the anchor. Smith joined Fox News in 1996 and covered copious breaking news stories for the network for over two decades. In a statement, Fox News president and executive editor, Jay Wallace, said Smith will leave his post as chief news anchor and managing editor of the outlet’s breaking news unit. Wallace said in a statement: Shep is one of the premier newscasters of his generation and his extraordinary body of work is among the finest journalism in the industry. His integrity and outstanding reporting from the field helped put FOX News on the map and there is simply no better breaking news anchor who has the ability to transport a viewer to a place of conflict, tragedy, despair or elation through his masterful delivery. We are proud of the signature reporting and anchoring style he honed at FOX News, along with everything he accomplished here during his monumental 23-year tenure. While this day is especially difficult as his former producer, we respect his decision and are deeply grateful for his immense contributions to the entire network. Smith’s departure comes as President Trump’s relationship with Fox News continues to deteriorate. On Thursday, the president knocked Smith in a pair of tweets that were critical of a Fox News poll that found a record 51 percent of voters support his impeachment and removal from office. The president tweeted: Whoever their Pollster is, they suck. But @FoxNews is also much different than it used to be in the good old days. With people like Andrew Napolitano, who wanted to be a Supreme Court Justice & I turned him down (he’s been terrible ever since), Shep Smith, @donnabrazile (who gave Crooked Hillary the debate questions & got fired from @CNN), & others, @FoxNews doesn’t deliver for US anymore. It is so different than it used to be. Speaking to reporters ahead of his rally in Louisiana, President Trump questioned whether Smith’s exit from Fox News was prompted by his ratings. “I’m assuming he’s leaving because of bad ratings,” the president said. “I wish him well,” he added.", 
      "date": "11 Oct 2019"
    }, 
    {
      "subtitle": "President Donald Trump on Friday declared during his Lake Charles, Louisiana, re-election rally that House Speaker Nancy Pelosi (D-CA) “hates the United States of America.”", 
      "author": "Joshua Caplan", 
      "url": "https://www.breitbart.com/politics/2019/10/11/trump-nancy-pelosi-hates-the-united-states-of-america/", 
      "title": "Trump: Nancy Pelosi ‘Hates the United States of America’", 
      "content": " “Nervous Nancy, I used to think she loved the country,” President Trump began. “She hates the country, she wouldn’t be doing this to the country if she did,” the president continued, in reference to her support for an impeachment inquiry. “Nancy Pelosi hates the country, hates the United States of America,” he added.  This story is developing. Check Breitbart News for updates.", 
      "date": "11 Oct 2019"
    }
  ]
}