{
  "articles": [
    {
      "subtitle": "Newly declassified court documents reveal FBI FISA violations in targeting Americans", 
      "author": "Ronn Blitzer | Fox News", 
      "url": "https://www.foxnews.com/politics/newly-declassified-court-documents-reveal-fbi-fisa-violations-in-targeting-americans", 
      "title": "Newly declassified court documents reveal FBI FISA violations in targeting Americans", 
      "content": " Newly declassified court documents indicate that the FBI failed to comply with the Foreign Intelligence Surveillance Act (FISA) in targeting Americans while searching through NSA records during President Trump's administration and after James Comey's tenure as FBI director. An October 2018 ruling from the Foreign Intelligence Surveillance Court (FISC) found that the FBI violated Section 702 by not keeping track of searches that pertained to \"United States persons,\" and that proposed changes were still not enough to comply with the law. That ruling was later affirmed on appeal in July 2019. The documents were declassified and released Tuesday. FISA Section 702, which deals with targeting people outside the U.S. for gathering foreign intelligence information, places restrictions on gathering information when it comes to Americans or people located in the U.S. LINDSEY GRAHAM WARNS FISA ABUSE WILL HAPPEN AGAIN 'IF SOMEBODY'S NOT PUNISHED HERE' “Because the FBI's proposed procedures do not require it to keep records that ‘indicate whether terms are United States person query terms,’ the FISC held that these procedures do not comply with Section 702(f)(l)(B),” said the decision from the Foreign Intelligence Surveillance Court of Review (FISC-R), which heard the appeal. The queries examined took place between 2017 and 2018, which would largely be during FBI director Chris Wray's tenure and during the Trump presidency. The FBI did not immediately return a request for comment. The FBI has argued that because they kept general records of the search terms used that was enough to satisfy Section 702’s requirement of keeping search records, but the court found that because they did not specify which queries were related to a “United States person,” it did not satisfy the law’s requirement. For context, the FISC ruling noted that in 2017, the FBI ran \"approximately 3.1 million queries against raw FISA-acquired information, including section 702-acquired information.\" While the FBI's failure to specify which ones pertained to U.S. persons, making it difficult to determine how many searches were affected by their insufficient practices, Judge James Boasberg noted that \"given the FBI's domestic focus it seems likely that a significant percentage of its queries involve U.S.-person query terms.\" Boasberg's ruling also ordered the government to keep written records of each instance where the FBI reviews information “concerning a United States person” obtained through Section 702, where the query was “not designed to find and extract foreign-intelligence information.\" These records shall include details of the information, how it is meant to be used, and the search terms used to get the information. After the July 2019 FISC-R decision, the FBI submitted new proposed procedures that the court deemed acceptable in a September ruling. CLICK HERE TO GET THE FOX NEWS APP The newly released decisions came after FISC Judge Rosemary Collyer’s 2017 ruling, which found that officials under the Obama administration used FISA to conduct illegal surveillance of American citizens for years. A soon-to-be-released report from the Justice Department Inspector General will explore whether the FBI conducted a different sort of FISA abuse in connection with former Trump campaign adviser Carter Page. During the early stages of the investigation of Russian interference with the 2016 election, the FBI obtained a warrant to monitor Page, which Republicans claim was based on a misrepresentation of evidence in the form of an unverified dossier compiled by former British spy Christopher Steele as opposition research for Democrats and the Clinton campaign.", 
      "date": "1 day ago"
    }, 
    {
      "subtitle": "DIA employee accused of leaks remains in custody ahead of arraignment", 
      "author": "", 
      "url": "https://www.foxnews.com/politics/dia-employee-accused-of-leaks-pleads-not-guilty-at-arraignment", 
      "title": "DIA employee accused of leaks remains in custody ahead of arraignment", 
      "content": "DEFENSE INTELLIGENCE AGENCY EMPLOYEE ARRESTED FOR ALLEGEDLY LEAKING CLASSIFIED INFORMATION TO REPORTERS The prosecutor said he wanted to wait on a pretrial services report before holding an arraignment, which was originally scheduled for 2 p.m. Thursday. Between April and May 2018, Frese allegedly accessed classified intelligence reports – some of which were unrelated to his job duties – and leaked secret information regarding a foreign country’s weapons system to a reporter, according to court documents. The documents accused Frese of being romantically involved with one of the reporters to whom he allegedly leaked information. A criminal indictment said a first reporter wrote at least eight articles from five compromised intelligence reports leaked by Frese. It said Frese re-tweeted a link to one of the articles that used the information he allegedly had provided. The first reporter then asked Frese if he’d be willing to speak to another reporter, according to the criminal indictment. Frese allegedly said he was “down” to help the second reporter if it helped the first reporter “progress.” The indictment also accused Frese of speaking about classified national defense information to the second reporter via his cellphone on Sept. 24, 2019. The disclosures reportedly contained information that \"could reasonably be expected to cause serious harm to the national security of the United States.\" CLICK HERE TO GET THE FOX NEWS APP While speaking to reporters Wednesday, U.S. Attorney for the Eastern District of Virginia Zach Terwilliger said he was focused on the leaker, not the journalists. \"If you leak info, you will be prosecuted,\" he said. Fox News' Jake Gibson and Andres del Aguila and The Associated Press contributed to this report.   A U.S. Defense Intelligence Agency employee accused of leaking classified information to journalists will remain in custody ahead of his arraignment Friday on federal charges related to the leaks. The arraignment and detention hearing for Henry Kyle Frese has been set for Friday at 11 a.m. in the United States District Court for the Eastern District of Virginia. Frese, 30, a counterterrorism analyst who held a top-secret clearance at the DIA, had started as a contractor in January 2017 before working at the agency full time. He faces two counts of willful transmission of national defense information to persons not entitled to receive it, charges that come with up to 10 years in prison each.", 
      "date": "1 day ago"
    }, 
    {
      "subtitle": "Providing health insurance to illegal immigrants could cost up to $23 billion a year, study finds", 
      "author": "Adam Shaw | Fox News", 
      "url": "https://www.foxnews.com/politics/providing-health-insurance-to-illegal-immigrants", 
      "title": "Providing health insurance to illegal immigrants could cost up to $23 billion a year, study finds", 
      "content": " In the span of just a few months, the idea of providing health care to illegal immigrants has morphed from a fringe, left-wing fancy to a plank of many 2020 Democrats' presidential campaigns -- but it’s a proposal that one study predicts would cost American taxpayers tens of billions of dollars a year. A standout moment of the June 27 Democratic primary debate was that of all the candidates on the stage raising their hands, signifying support for government health care plans including “undocumented” immigrants. ILLEGAL IMMIGRANTS SHOULD GET HEALTH CARE, SAY DEMS IN NIGHT 2 DEBATE Republicans and the White House have seized on that moment, with President Trump declaring it “the end of the race.” But with the campaign definitely not over, and a number of frontrunners now backing the policy, more attention is turning to how much it could cost to give millions of illegal immigrants health insurance. On Thursday, the Center for Immigration Studies (CIS), a policy group that advocates for lower levels of immigration overall, published a study finding that the cost could be up to $23 billion a year. While candidates have not necessarily gone into detail about their plans, CIS cites an Atlantic survey that found that Sens. Bernie Sanders, I-Vt., Kamala Harris, D-Calif., and Elizabeth Warren, D-Mass.; and former Housing Secretary Julian Castro would all provide “full benefits” to those in the country illegally. The CIS study estimated that 4.9 million illegal immigrants have incomes below 400 percent of the poverty line and also do not have insurance -- meaning they have incomes low enough to receive coverage via either Medicaid or the Affordable Care Act -- also known to many, particularly critics, as ObamaCare. The study estimates that if all income-eligible, uninsured illegal immigrants received subsidies under the ACA, then the cost to insure would be $22.6 billion, but with “likely enrollment” of 46 percent, the total cost would be perhaps $10.4 billion a year. It predicts that the average cost of a subsidized premium would be $4,637. If a mixed approach of ACA subsidies and Medicaid enrollment were used, the cost would dip to $19.6 billion with 100 percent enrollment, and $10.7 billion assuming “likely enrollment.” These numbers could change significantly if a more overarching health care overhaul is passed by a future Democratic White House and Congress. “Numbers aside, the fact that presidential candidates are advocating spending billions of dollars on people who are in the country illegally is significant in its own right,” the report concludes. “It suggests that allowing in large numbers of less-educated workers will inevitably generate significant political pressure to provide them access to social programs.” Extending health care to illegal immigrants could, however, be only one part of the cost to taxpayers of more generous social policies being pushed by Democrats. AOC PUSHES NATIONAL RENT CONTROL, WELFARE FOR ILLEGAL IMMIGRANTS IN LATEST MASSIVE PROPOSAL Rep. Alexandria Ocasio-Cortez, D-N.Y., who was an early champion of left-favored policies now finding their way into 2020 Democratic platforms, recently introduced a new package of policies known as the “Just Society.” Among those bills is “The Embrace Act,” which would allow illegal immigrants to claim the same welfare benefits as U.S. citizens and those in the country legally. CLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM \"Notwithstanding any other provision of law ... an individual who is an alien (without regard to the immigration status of that alien) may not be denied any federal public benefit solely on the basis of the individual’s immigration status,” the bill reads. The bill defines a federal public benefit as: “any grant, contract, loan, professional license or commercial license provided by an agency of the United States or by appropriated funds of the United States; and ... any retirement, welfare, health, disability, public or assisted housing, post-secondary education, food assistance, unemployment benefit,or any other similar benefit for which payments or assistance are provided to an individual, household, or family eligibility unit by an agency of the United States or by appropriated funds of the United States.”", 
      "date": "1 day ago"
    }, 
    {
      "subtitle": "Carter Page frustrated he hasn't been interviewed in IG probe", 
      "author": "Gregg Re | Fox News", 
      "url": "https://www.foxnews.com/politics/carter-page-says-he-hasnt-been-interviewed-in-ig-probe", 
      "title": "Carter Page frustrated he hasn't been interviewed in IG probe", 
      "content": " Former Trump campaign adviser Carter Page confirmed to Fox News on Thursday that he has not been interviewed by Department of Justice Inspector General Michael Horowitz as part of his probe into potential surveillance abuses by intelligence officials during the Russia investigation. Page told Fox News that he is frustrated that he has had no input in Horowitz's review, given his central role in the probe. Page was monitored by the FBI pursuant to a Foreign Intelligence Surveillance Act (FISA) warrant that was approved in October 2016 and renewed several times. Last month, Horowitz told lawmakers his team is nearly finished with its long-awaited review of alleged surveillance abuses by the DOJ and FBI, saying it has submitted a draft to Attorney General Bill Barr and is “finalizing” the report ahead of its public release. NEWLY DECLASSIFIED DOCS REVEAL FISA ABUSES IN TARGETING AMERICANS The inspector general said his team has “reviewed over 1 million records and conducted over 100 interviews, including several of witnesses who only recently agreed to be interviewed.” But RealClearInvestigations first reported that Page was not among those witnesses. “We have now begun the process of finalizing our report by providing a draft of our factual findings to the department and the FBI for classification determination and marking,” Horowitz wrote in a letter to several House and Senate committees. “This step is consistent with our process for reports such as this one that involve classified material.” The FISA warrant applications targeting Page relied heavily on the now-discredited Steele dossier on Trump, which was funded by the Democratic National Committee (DNC) and the Hillary Clinton campaign. The FBI formally documented the apparent anti-Trump bias of the dossier's author, British ex-spy Christopher Steele, shortly after the November 2016 presidential election -- yet despite the red flags, continued to use his unverified dossier in the FISA applications, records obtained by Fox News earlier this year showed. WATCH: CARTER PAGE SAYS FBI INFORMANT 'INTENSIFIED' COMMS JUST BEFORE FISA WARRANT Meanwhile, a key FBI player during the time frame, former FBI deputy director Andrew McCabe, is facing the prospect of federal charges after Horowitz faulted him in a separate inquiry over statements he made during a Hillary Clinton-related investigation. The review found that McCabe \"lacked candor\" when talking with investigators, but the former FBI official has denied wrongdoing. Washington, D.C., U.S. Attorney Jessie Liu has recommended moving forward with charges against McCabe, a CNN contributor, though no indictment has been handed down. Horowitz's inquiry is not the only ongoing review at the DOJ. Barr has also assigned John Durham, the U.S. attorney for Connecticut, to conduct an inquiry into alleged misconduct and alleged improper government surveillance on the Trump campaign during the 2016 presidential election. Fox News reported this week that based on what he has been finding, Durham has expanded his investigation adding agents and resources, according to senior administration officials. The timeline has grown from the beginning of the probe through the election and now has included a post-election timeline through the spring of 2017, up to when Robert Mueller was named special counsel investigating Russian meddling in the 2016 elections. CLICK HERE TO GET THE FOX NEWS APP And U.S. Attorney John Huber was appointed by former Attorney General Jeff Sessions to review not only alleged surveillance abuses by the Justice Department and the FBI, but also their handling of the investigation into the Clinton Foundation and other matters. Fox News' Catherine Herridge, Bret Baier Alex Pappas and Cyd Upson contributed to this report.", 
      "date": "1 day ago"
    }, 
    {
      "subtitle": "Giuliani associates arrested while trying to board international flight with one-way tickets, prosecutors say", 
      "author": "Andrew O'Reilly | Fox News", 
      "url": "https://www.foxnews.com/politics/prosecutors-giuliani-associates-arrested-while-trying-to-board-international-flight-with-one-way-tickets", 
      "title": "Giuliani associates arrested while trying to board international flight with one-way tickets, prosecutors say", 
      "content": " Two associates of Rudy Giuliani made their initial appearance before a federal judge on Thursday, less than 24 hours after they were arrested on campaign finance violations while trying to board an international flight with one-way tickets at Dulles International Airport outside of Washington D.C. Lev Parnas and Igor Fruman appeared in federal court in Alexandria, Va. to face a four-count indictment alleging that they, along with two other co-defendants, conspired to violate a ban on foreign donations and contributions in connection with federal and state elections. The two men remained mostly silent during their appearance before U.S. Magistrate Judge Michael Nachmanoff, who set their bond at $1 million each. Nachmanoff said he was reluctant to agree to a bond package but noted the mens' defense team and the government had agreed on it. Terms of bond included $1 million per suspect and the surrender of passports and all other travel documents, as well as travel restricted to the Southern District of Florida and Southern District of New York. They also will be subject to home detention and GPS monitoring, according to the agreement. Both Parnas and Fruman are expected to remain in custody for at least the remainder of the day, until the terms of the bond are met. \"You will be stuck here in limbo if the terms of the bond are not met,\" Nachmanoff said. GIULIANI ON TRUMP IMPEACHMENT INQUIRY: SALEM WITCH TRIALS 'FAIRER THAN THIS' The next hearing was scheduled for Oct. 17 in the Southern District of New York, where their indictments originated. “Protecting the integrity of our elections and protecting our elections from unlawful foreign influence are core functions of our campaign finance laws,” Manhattan U.S. Attorney Geoffrey Berman said at a news conference Thursday. Berman added: “As this office has made clear, we will not hesitate to investigate or prosecute those who engage in criminal conduct that draws into question the integrity of our political process, and I want to add that this investigation is continuing.” Parnas, 47, and Fruman, 53, created Global Energy Producers (GEP), and allegedly funneled money through the company. This included contributions of $325,000 and $15,000 to committees in May 2018, “to obtain access to exclusive political events and gain influence with politicians,” the indictment says. They allegedly incorporated GEP around the time the contributions were made. According to Federal Election Commission (FEC) records, GEP contributed $325,000 in May 2018 to pro-Trump super PAC America First Action. In a statement, a spokesperson for America First Action noted that a complaint was filed with the FEC in July 2018 over this contribution, as well as separate litigation in Florida. The statement said that the money was placed \"in a segregated bank account,\" was not used, and \"will remain in this segregated account until these matters are resolved.\" President Trump said Thursday afternoon he does not know Parnas and Fruman, but might have met them at a fundraiser at one point. \"I don’t know those gentlemen,\" Trump said. \"Now, it's possible I have a picture with them, because I have a picture with everybody.\" Parnas and Fruman were featured in a photo alongside the president's son, Donald Trump Jr., at a table apparently at the Beverly Hills Polo Lounge. The photo was posted on Parnas' Facebook page on May 21, 2018. Both men are accused of making false statements related to the nature of GEP and the contribution in response to the FEC complaint. BIDEN CAMPAIGN SLAMS NY TIMES FOR RUNNING ‘CLINTON CASH’ AUTHOR’S OP-ED ON EX-VP’s UKRAINE TIES Additionally, contributions from Fruman were allegedly made in Parnas’ name to get around federal contribution limits, and several contributions were made under the name \"Igor Furman\" instead of \"Fruman,\" allegedly \"to conceal the source of the funds and to evade federal reporting requirements.\" The indictment also claims that Parnas and Fruman “committed to raise $20,000 or more for a then-sitting U.S. Congressman” whom they had met at a political event. The congressman wasn't identified by name in court papers, but the donations to \"Congressman 1\" in the indictment match campaign finance reports for former Rep. Pete Sessions, a Texas Republican who lost his re-election bid in November 2018. At approximately the same time that they made that commitment, Parnas and the Congressman discussed the Congressman's assistance in securing the removal of the then-U.S. Ambassador to Ukraine, and this was done \"at least in part, at the request of one or more Ukrainian government officials,\" the indictment alleges. The indictment also lays out allegations of a separate \"foreign national donor scheme\" involving the two men and two other defendants, American David Correia, and Ukrainian national Andrey Kukushkin. The foursome allegedly engaged in a conspiracy to make political contributions funded by an unnamed Russian national to obtain influence with political candidates regarding policies to benefit a recreational marijuana business venture, and to help obtain retail marijuana licenses. House Democrats on Thursday subpoenaed Parnas and Fruman as part of the impeachment inquiry into Trump. The subpoenas are for documents that the men have so far failed to provide to Congress. Parnas and Fruman were involved in Giuliani's efforts to urge Ukrainian officials to investigate Trump's political rival Joe Biden and his family. That effort was also discussed by Trump in a July call with Ukraine's president and is at the heart of the impeachment probe. Giuliani told Fox News that he represents Parnas and Fruman on a separate matter and called the timing of their arrest and indictment \"suspect.\" He added that he \"will reveal relevant facts very very shortly.\" CLICK HERE TO GET THE FOX NEWS APP Giuliani, a personal attorney for Trump, said he finds it \"extremely suspicious\" that the arrest was made in connection with an FEC matter that has yet to be resolved, and which Giuliani said is a civil matter. He acknowledged, however, that both men \"logistically helped\" in his collection of evidence against Hunter Biden, and that they helped connect him with Viktor Shokin and Yuriy Lutsenko former Prosecutors General of Ukraine. Ukrainian President Volodymyr Zelensky, whose July phone call with Trump jumpstarted the impeachment inquiry, denied on Thursday knowing Parnas and Fruman and said Washington so far has not requested any documents from him regarding the two men. Fox News’ Ronn Blitzer, Jake Gibson and The Associated Press contributed to this report.", 
      "date": "1 day ago"
    }, 
    {
      "subtitle": "GOP House Intel panel member tells Pelosi to release Volker transcript, slams 'secret hearings'", 
      "author": "Morgan Phillips,", 
      "url": "https://www.foxnews.com/politics/gop-congressman-to-pelosi-volker-leaks-contradict-testimony-and-its-time-to-end-secret-proceedings", 
      "title": "GOP House Intel panel member tells Pelosi to release Volker transcript, slams 'secret hearings'", 
      "content": "  Rep. Mike Turner, R-Ohio, implored House Speaker Nancy Pelosi, D-Calif., to halt what he called “secret” impeachment proceedings against President Trump Thursday, saying: \"The American public deserves to see this impeachment firsthand for themselves, not just what you, your colleagues, and your staff anonymously leak about it.\" Turner, a member of the House Intelligence Committee, took particular issue with the panel's Oct. 3 transcribed interview of former U.S. Special Envoy to Ukraine Kurt Volker and subsequent media leaks that he says are in \"direct contradiction with Volker's testimony.\" \"Nothing in that [Volker's] testimony was classified, and yet it was conducted behind closed doors and a transcript has yet to be released,\" Turner wrote. \"The American public deserve to witness these hearings, not just receive anonymous secondhand reports ... This represents an attempt by you [Pelosi] to totally control what information the American public is receiving in reporting on this impeachment inquiry.\" WHITE HOUSE ANNOUNCES IT WILL NOT COMPLY WITH 'ILLEGITIMATE AND UNCONSTITUTIONAL' IMPEACHMENT INQUIRY Republicans and Democrats present at Volker’s interview had wildly different interpretations of the information he provided. Rep. Jim Jordan, R-Ohio, told reporters after the meeting, “not one thing he [Volker] said comports with any of the Democrats' impeachment narrative.” Rep. Eric Swalwell, D-Calif., said Volker’s testimony made it clear “there was a shadow shakedown going on” in Ukraine led by Trump’s personal lawyer Rudy Giuliani. Appearing on “America’s Newsroom” Thursday, Jordan pressured House Intelligence Committee Chairman Adam Schiff, D-Calif., to release the full transcript of the Volker interview to show there was no quid pro quo agreement between President Trump and Ukrainian President Volodymyr Zelensky involving U.S. military aid and Trump’s call for an investigation into former Vice President Joe Biden. \"He was clear about that [and] reinforced exactly what President Zelensky said when he said, 'I was not pushed by the administration,'\" Jordan said. \"Adam Schiff won't release that. Instead, there were 67 pages of text messages. Adam Schiff took a few of those text messages and released them. Release them all.\" REP. JORDAN CHALLENGES SCHIFF TO RELEASE CLOSED-DOOR TESTIMONY THAT SHATTERS UKRAINE 'QUID PRO QUO' THEORY Turner also alleged that Democratic-led House committees \"are discussing holding not only secret hearings, but interviewing secret witnesses.\" “You are robbing the American public of their right to judge for themselves the veracity and credibility of these witnesses and this investigation,\" Turner wrote to Pelosi. \"The American public is also unable in this process to judge the professionalism, predisposition, and bias of the questioners in this inquiry.\" Turner then cited a CNN report that House of Representative General Counsel Doug Letter told a federal judge that the president did not have to commit a crime to be impeached. The question came up in a hearing over a request by the House for grand jury testimony related to former Special Counsel Robert Mueller's Russia probe. “The Constitution is clear: 'The President ... shall be removed from Office on Impeachment for, and Conviction of, Treason, Bribery, or other high Crimes and Misdemeanors.' A crime must be committed. However, your legal counsel is now trying to argue blatantly against the Constitution,” Turner wrote (emphasis original). “You have said the country is in a constitutional crisis. You are right, Madam Speaker, we are, and it is by your design and creation.” Turner also raised the issue of Schiff’s staff having contact with the intelligence community whistleblower whose complaint prompted the formal impeachment inquiry prior to the complaint being filed. Schiff’s office acknowledged last week that the whistleblower had reached out to them before filing the complaint in mid-August, but said that Schiff himself had not had any direct contact with the whistleblower. \"The American public has a right to know the extent to which you, your colleagues, and your staff have been involved in secret discussions with the complainant on which you based your unilateral assertion of authority to commence impeachment proceedings,” Turner wrote. CLICK HERE TO GET THE FOX NEWS APP “Madam Speaker, I remember firsthand watching the Nixon impeachment hearings, the congressman concluded. \"Your impeachment inquiry, in sharp contrast, is being conducted in secret hearings, with potentially secret witnesses, and has a secret inception. The American public and our constitutional processes deserve transparency.” Last month, Turner stood apart from his Republican colleagues by asserting that Trump's phone call with Zelensky was \"not ok.\" \"Concerning that conversation, I want to say to the President: This is not OK. That conversation is not OK,\" Turner said during a Sept. 26 hearing with acting Director of National Intelligence Joseph Maguire. \"I think it's disappointing to the American public when they read the [conversation's] transcript.\"", 
      "date": "1 day ago"
    }, 
    {
      "subtitle": "Ted Cruz commends Taiwan's stand against 'communist oppression' as China censorship controversies rage", 
      "author": "Tyler Olson | Fox News", 
      "url": "https://www.foxnews.com/politics/ted-cruz-taiwan-china-communist-oppression-censorship", 
      "title": "Ted Cruz commends Taiwan's stand against 'communist oppression' as China censorship controversies rage", 
      "content": " Sen. Ted Cruz, R-Texas, commended Taiwan's stand against \"Chinese communist oppression,\" in a video tweeted Thursday, as multiple controversies have swirled around U.S. companies allegedly acquiescing to China's restrictive speech rules. Standing in Taiwan's \"Liberty Square,\" Cruz congratulated the Taiwanese people on their national day, known as \"Double 10 Day,\" and extolled the relationship between the United States and Taiwan. Cruz has been traveling in Asia this week; he visited Japan on Wednesday. \"I'm here in Taiwan in Chaing Kai-shek square, also known as Liberty Square, celebrating the people of Taiwan who stand up against Chinese communist oppression and stand up for freedom,\" he said. \"America is proud to be allies with the people of Taiwan.\" SOUTH PARK FIRES F-BOMB IN RESPONSE TO CHINA BAN Taiwan, which has fought to assert its independence but which China has claimed as its own, has formal diplomatic relations with only 15 countries. Cruz, along with several other lawmakers including Rep. Alexandria Ocasio-Cortez, D-N.Y., Sen. Tom Cotton, R-Ark., and Sen. Ben Sasse, R-Neb., sent a letter to NBA Commissioner Adam Silver on Wednesday expressing \"deep concern\" over the league's deference to China after Houston Rockets General Manager Daryl Morey tweeted in support of pro-democracy protesters in Hong Kong. TAIWAN PRESIDENT REJECTS CHINA'S OFFER OF 'ONE COUNTRY, TWO SYSTEMS' \"The NBA's initial statement, and pressure placed on Mr. Morey to back away from his statement, has not only sold out an American citizen,\" the letter said. \"It reinforces the Chinese Communist Party view that those who point to Chinese repression in Hong Kong are at best stating opinions, not facts, and that the official Chinese government view deserves equal respect.\" Recent pro-democracy protests rebelling against Beijing's perceived interference in Hong Kong's independence have gained attention around the world. After the lawmakers' letter, however, the NBA drew more China-related ire Wednesday night after workers confiscated signs supporting Hong Kong at a Washington Wizards game in Washington, D.C. At least one sign read \"Google Uyghurs\" -- a Muslim ethnic group with between one and five million members in Chinese government concentration camps. A team spokesman said the displays violated the arena's longstanding policy on signs, banners and posters. In addition, on Thursday, a Houston Rockets employee told a CNN reporter that players James Harden and Russell Westbrook would not answer her question about how they would approach speaking out on politics after the Morey controversy. The league later apologized. Yet more Chinese censorship-related controversies have raged in the U.S. CLICK HERE TO GET THE FOX NEWS APP Activision-Blizzard, a U.S.-based video game company, is coming under fire after it made an E-sports player forfeit $10,000 in prize money and banned him from the game Hearthstone E-sports for a year after he made pro-Hong Kong comments on a broadcast. Company executives said he violated a tournament rule preventing players from engaging in any act that \"brings you into public disrepute, offends a portion or group of the public, or otherwise damages Blizzard image.\" Comedy Central cartoon \"South Park,\" in contrast, fired up a profane response to its recent ban in China for an episode last week bashing the government's censorship of American media and treatment of its citizens. In the episode, characters Towlie and Randy shouted, \"F--- the Chinese Government!\" after Towlie taught Randy about the country's human rights abuses.", 
      "date": "1 day ago"
    }, 
    {
      "subtitle": "Fox News Poll: Biden and Warren gain ground in Democratic race", 
      "author": "Dana Blanton | Fox News", 
      "url": "https://www.foxnews.com/politics/fox-news-poll-biden-and-warren-gain-ground-in-democratic-race", 
      "title": "Fox News Poll: Biden and Warren gain ground in Democratic race", 
      "content": " Together Joe Biden and Elizabeth Warren capture the support of more than half of Democratic primary voters, according to the latest Fox News national poll on the 2020 election. Biden stays on top in the race with 32 percent support among primary voters, up 3 points since September.  He’s followed by Elizabeth Warren at 22 percent -- that’s up 6 points and a new high for her. Bernie Sanders is at 17 percent, down 1 point since last month. While Biden’s support has stayed between 29-35 percent since March, his current 10-point advantage is about half of his 19-point lead in June. The rundown continues with Kamala Harris at 5 percent, Pete Buttigieg at 4 percent, Beto O’Rourke at 3 percent, and Cory Booker, Amy Klobuchar and Andrew Yang each at 2 percent.  Michael Bennet, Julian Castro, Tulsi Gabbard, Tim Ryan, Tom Steyer, and Marianne Williamson receive 1 percent apiece. CLICK HERE TO READ THE POLL RESULTS Biden retains top billing with strong support among non-whites, voters over age 45, and moderates/conservatives.  Warren has strengthened her position by increasing support among suburban voters, very liberals, and men. When Democratic primary voters’ first and second choice preferences are considered together, Biden and Warren tie at 45 percent support, Sanders is at 34 percent, Harris 15 percent and Buttigieg 13 percent. President Trump’s allegations about improper actions by Biden and his son have so far failed to chip away at Biden’s support in the primary race -- and Democratic primary voters continue to believe the former vice president is the candidate best equipped to beat Trump in 2020:  43 percent feel that way, up from 42 percent last month.  Nineteen percent think Warren has the best chance to oust Trump and 15 percent say Sanders. At the same time, the poll finds the three top Democratic candidates with sizable leads over the president in potential head-to-head matchups. The poll, released Thursday, shows Biden (50-40 percent) and Warren (50-40 percent) both top Trump by 10 points, and Sanders is up by 9 (49-40 percent).  This marks the first time all three Democrats have held a lead outside the poll’s margin of error.  Last month, Biden was up by 14 points, Warren by 6 and Sanders by 8. “If Warren continues to poll as strongly against Trump as the former vice president, it makes it increasingly difficult for the Biden team to keep making the argument he is the most electable candidate,” says Democratic pollster Chris Anderson, who conducts the Fox News Poll with Republican Daron Shaw. The impeachment inquiry hasn’t caused any real shifts in the ballot test, as Trump’s support in the two-way matchups has been between 37-42 percent all year.  However, the poll finds an 8-point shift since last month in the number expecting Trump will be re-elected.  In September, more thought he would win by a 6-point margin and now more expect he won’t by 2 points. And while most Republican primary voters want to keep Trump as their party’s nominee, nearly one in five, 17 percent, would like to see someone else run. “So far, Trump has been able to keep his Republican base on board,” says Shaw. “If the percentage opposing his re-nomination creeps into the 20s, that would be a troubling sign.” Meanwhile, voters continue to believe Donald Trump is dishonest.  Sixty-three percent say that -- far more than the 35 percent who think he is honest and trustworthy.  By the way, that’s the same number who said Trump was honest before he won the 2016 election. Vice President Mike Pence does a bit better than his boss, although not by much:  39 percent say he’s honest and 54 percent say dishonest. On the other side, each of the top three Democratic candidates receives positive ratings on this measure.  Sanders performs best with 59 percent saying he is honest and trustworthy (36 percent disagree).  Fifty percent think Warren is honest vs. 44 percent dishonest, and for Biden voters split 48-47 percent. Among Democrats, 87 percent think Sanders is honest and trustworthy, while 81 percent feel that way about Warren and 75 percent Biden.  Seventy-three percent of Republicans say Trump is honest. Currently, 51 percent of voters have a favorable opinion of Sanders, while 43 percent view him negatively.  That puts him in positive territory by 8 points.  More view Warren positively by 7 points (46 favorable vs. 39 unfavorable) and Biden by 6 (50 favorable vs. 44 unfavorable). The ratings are closer to even for Buttigieg (+3 points), Yang (+3), Booker (-2), Harris (-3) and O’Rourke (-4).  They each also have large numbers who have never heard of them or have no opinion of them.  For example, 43 percent of voters are unable to rate Yang, while 36 percent can’t rate Buttigieg and 32 percent can’t rate Booker. CLICK HERE TO GET THE FOX NEWS APP Voters view Trump more negatively than positively by 13 points (43-56).  His personal favorable rating was underwater by 22 points in the days leading up to the 2016 election (38-60). Twice as many primary voters say Trump’s allegations make them more likely to vote for Biden (21 percent more vs. 10 percent less), while twice as many say health concerns make them less (31 percent) rather than more likely (15 percent) to vote for Sanders in the primary. Sanders is off the campaign trail since suffering a heart attack October 3.  He’s 78 years old, while Biden is 76, Trump is 73, and Warren is 70. Conducted October 6-8, 2019 under the joint direction of Beacon Research (D) and Shaw & Company (R), this Fox News Poll includes interviews with 1,003 randomly chosen registered voters nationwide who spoke with live interviewers on both landlines and cellphones.  The poll has a margin of sampling error of plus or minus three percentage points for all registered voters and 4.5 points for Democratic primary voters (484).", 
      "date": "1 day ago"
    }, 
    {
      "subtitle": "Fox News Poll, October 6-8, 2019", 
      "author": "", 
      "url": "https://www.foxnews.com/politics/fox-news-poll-october-6-8-2019", 
      "title": "Fox News Poll, October 6-8, 2019", 
      "content": "", 
      "date": "1 day ago"
    }, 
    {
      "subtitle": "Liz Cheney, others in GOP spearhead bid to sanction Turkey for Syria invasion", 
      "author": "Morgan Phillips | Fox News", 
      "url": "https://www.foxnews.com/politics/liz-cheney-others-in-gop-spearhead-bid-to-sanction-turkey-for-syria-invasion", 
      "title": "Liz Cheney, others in GOP spearhead bid to sanction Turkey for Syria invasion", 
      "content": " House GOP Conference Chairwoman Liz Cheney, R.-Wyo., along with 20 Republican colleagues, said Thursday that legislation is being introduced to sanction Turkey for its military offensive against U.S.-backed Kurdish forces in northern Syria. The announcement came as Turkey’s Defense Ministry boasted Thursday that more than 150 Kurdish forces have been mowed down since the assault began one day ago. TURKEY'S MILITARY ASSAULT IN SYRIA LEAVES MORE THAN 150 KURDISH FIGHTERS DEAD, OFFICIALS SAY “President [Recep Tayyip] Erdogan and his regime must face serious consequences for mercilessly attacking our Kurdish allies in northern Syria, who incurred thousands of casualties in the fight against ISIS and helped us protect the homeland,” said Cheney. “These sanctions are not only a response to the Erdogan regime’s violent attacks in northern Syria. Congress has long had concerns about the regime’s cooperation with U.S. adversaries, such as Russia. \"If Turkey wants to be treated like an ally, it must begin behaving like one. They must be sanctioned for their attacks on our Kurdish allies.\" Much to the frustration of U.S. leaders, Turkey acquired a Russian S-400 air defense system in July. The deal with Russia -- the first such arrangement between Russia and a NATO member -- raised concerns that Turkey is drifting ever closer to Moscow’s sphere of influence. Cheney’s office indicated that the legislation aligns with what President Trump has said about Turkey in the past. “Turkey has been planning to attack the Kurds for a long time,” Trump tweeted Thursday. “I say hit Turkey very hard financially & with sanctions if they don’t play by the rules!” HOUSE DEMS SUBPOENA ENERGY SECRETARY RICK PERRY FOR UKRAINE DOCS IN IMPEACHMENT INQUIRY “President Erdogan’s assault on our Kurdish allies is reckless and reprehensible. The Kurds sacrificed 10,000 of their own men and women combatting ISIS, and we cannot allow Turkey, a NATO partner, to attack them without repercussions,” said co-sponsor Adam Kinzinger, R.-Ill. Cheney’s bill follows a similar one in the Senate announced Wednesday by Sens. Lindsey Graham, R.-S.C., and Chris Van Hollen, D.-Md. The Senate bill would sanction the U.S. assets of Turkish political leadership, restrict military transactions with any foreign entity (including the U.S.) and Turkey, and penalize anyone who makes transactions with Turkey’s energy sector. Cheney, daughter of former Vice President to George W. Bush Vice President Dick Cheney, has repeatedly sounded off about Trump’s decision to withdraw U.S. forces in northeastern Syria. In one tweet, she called it a \"catastrophic mistake that puts our gains against ISIS at risk and threatens U.S. security.\" Critics have decried the decision by Trump, which they say undermines progress against ISIS in the region and leaves a U.S. ally in the fight against the Islamic State vulnerable. In another, she called President Trump's pullback \"impossible to understand.\" CLICK HERE TO GET THE FOX NEWS APP Fox News' Chad Pergram contributed to this report.", 
      "date": "1 day ago"
    }, 
    {
      "subtitle": "House Dems subpoena Energy Secretary Rick Perry for Ukraine docs in impeachment inquiry", 
      "author": "Melissa Leon | Fox News", 
      "url": "https://www.foxnews.com/politics/democrats-subpoena-rick-perry-ukraine-impeachment-inquiry", 
      "title": "House Dems subpoena Energy Secretary Rick Perry for Ukraine docs in impeachment inquiry", 
      "content": " Energy Secretary Rick Perry on Thursday became the latest Trump administration official to be subpoenaed in connection with the House impeachment inquiry, as a trio of House Democratic committee chairmen requested documents relating to Ukraine. The House Intelligence, Foreign Affairs and Oversight Committees requested \"key documents\" from Perry by Oct. 18, the chairmen announced in a press release. Department of Energy (DOE) Spokeswoman Shaylyn Hynes told Fox News, \"The Department of Energy is aware of the House Committees’ letter to Secretary Perry and it is currently under review by DOE's Office of General Counsel.\" Democrats have already subpoenaed Secretary of State Mike Pompeo, the Pentagon, the White House Office of Management and Budget and U.S. Ambassador to the European Union Gordon Sondland for documents as lawmakers probe a July 25 phone call between President Trump and his Ukrainian counterpart, Volodymyr Zelensky. “Recently, public reports have raised questions about any role you may have played in conveying or reinforcing the president’s stark message to the Ukrainian president,\" Democratic Reps. Adam Schiff, Elijah Cummings and Eliot Engel said of Perry. “These reports have also raised significant questions about your efforts to press Ukrainian officials to change the management structure at a Ukrainian state-owned energy company to benefit individuals involved with Rudy Giuliani’s push to get Ukrainian officials to interfere in our 2020 election.\" Two associates of Trump lawyer and confidant Rudy Giuliani who have been linked to his efforts to conduct investigations in Ukraine were indicted for campaign finance violations, according to court documents released Thursday. Lev Parnas and Igor Fruman are accused of using a limited liability company to make political contributions related to American elections, which violates Federal Election Commission (FEC) rules barring contributions from foreign nationals. GIULIANI ASSOCIATES ARRESTED WHILE TRYING TO BOARD INTERNATIONAL FLIGHT WITH ONE-WAY TICKETS, PROSECUTORS SAY The expanding impeachment probe was launched last month after an intelligence community member's whistleblower complaint raised concerns about the president's Ukraine phone call. In it, Trump asked Zelensky to probe onetime Vice President Joe Biden, his son Hunter and their business dealings in Ukraine. Joe Biden has for months been seen as the Democrats' frontrunner in the 2020 election against Trump. Trump has denied abusing his position, saying the call was \"perfect,\" and Zelensky said Thursday there was \"no blackmail\" during their call. The whistleblower accused the president of \"using the power of his office to solicit interference from a foreign country in the 2020 U.S. election,\" claiming Trump used $400 million in military aid, frozen in the days before that fateful phone call, to induce Zelensky to open a Biden inquiry. Trump reportedly told House Republicans it was Perry who suggested he call Zelensky back in July, according to news outlet Axios. RICK PERRY DENIES DISCUSSING BIDENS WITH TRUMP OR UKRAINE OFFICIALS: REPORTS According to one source, Trump said something to the effect of: \"Not a lot of people know this but, I didn't even want to make the call. The only reason I made the call was because Rick asked me to. Something about an LNG [liquified natural gas] plant,\" Axios reported, saying two other sources agreed with that recollection. Perry denied ever mentioning the Bidens during discussions with Ukrainian officials or the president. On Friday he told the Christian Broadcasting Network in an exclusive interview that his dealings in Ukraine were part of the United States' effort to clean up corruption there. President Trump has said Joe Biden's efforts to oust a Ukrainian prosecutor who was investigating the energy firm Burisma Holdings -- where Hunter Biden had held a board seat -- should be investigated for corruption. On Monday, Perry denied rumors that he would resign at the end of November amid questions about his role in the controversy surrounding the now-infamous Trump-Zelensky call. READ THE WHITE HOUSE LETTER The White House issued an eight-page letter to House Speaker Nancy Pelosi, D-Calif., on Tuesday and said it wouldn't comply with the \"illegitimate and unconstitutional\" impeachment inquiry. Fox News' John Roberts, Ronn Blitzer, Dom Calicchio, Louis Casiano and Charles Creitz contributed to this report.", 
      "date": "1 day ago"
    }, 
    {
      "subtitle": "GOP lawmaker requests FEC watchdog investigate chair's 'political' statements", 
      "author": "Bradford Betz | Fox News", 
      "url": "https://www.foxnews.com/politics/gop-lawmaker-request-fec-watchdog-investigate-partisan-behavior-of-agency-chair", 
      "title": "GOP lawmaker requests FEC watchdog investigate chair's 'political' statements", 
      "content": " The top Republican on the House Committee on House Administration urged the Federal Election Commission's (FEC) inspector general on Thursday to investigate the agency’s leader for allegedly using her position to publicly disparage President Trump, including making multiple media appearances in which she referred to the president as a danger to democracy. The request by Rodney Davis, R-Ill. was outlined in a 4-page memo to FEC Inspector General Christopher L. Skinner. In it, Davis chastised FEC Chair Ellen L. Weintraub for using government time and resources for “ideological, and at times, political, purposes.” He recounted four instances where Weintraub had used FEC resources to publish her personal opinions on President Trump. In a February 2017 statement issued on FEC letterhead, Weintraub requested the president show evidence of \"alleged voter fraud in New Hampshire,\" a reference to Trump’s claim that illegal voting had cost him the state's four electoral votes in the 2016 presidential election. In a March follow-up letter, Weintraub reiterated that request. In May 2017, Weintraub wrote a statement, again on FEC letterhead, rebuking Trump for his creation of an Advisory Commission on Election Integrity, saying: “Mr. President, take responsibility for your words. Document them if you can. Apologize to them if you have to. But don’t ship them off to a commission.” FEC CHAIR: TRUMP IS 'DAMAGING TO OUR DEMOCRACY' WITH 'BASELESS' VOTER FRAUD ALLEGATIONS Weintraub wrote a second letter to Trump about his New Hampshire voter fraud claims in August 2019 in a tone Davis described as “partisan snark.” “To put it in terms a former casino operator should understand: There comes a time when you need to lay your cards on the fable or fold,” she wrote. The letter was not hosted on the FEC website, but was drafted with the agency’s letterhead and appeared on Weintraub’s Twitter feed, according to Davis. Davis also criticized Weintraub for appearances on CNN and MSNBC to “discuss matters outside the purview of the FEC.” On at least two occasions, Weintraub dismissed Trump’s claims as “conspiracy theories” that are “damaging to our democracy.” Davis argued that Weintraub had violated the FEC’s nonpartisan position by failing to indicate “in any interview that she was speaking as a private citizen and not as Chair of the nonpartisan FEC.” CLICK HERE TO GET THE FOX NEWS APP Because of her ostensible bias against President Trump, Weintraub “should publicly admit her political differences with the President, disclose her conflict of interest, and at the very least, recuse herself from voting on Matters Under Review involving the President,” Davis wrote. Responding to Davis’ memo via Twitter, Weintraub wrote she would “not be silenced” and that the “independence of the United States Federal Election Commission will not be compromised.” Reached out to for comment, Weintraub directed Fox News to the tweet.", 
      "date": "1 day ago"
    }, 
    {
      "subtitle": "Minneapolis police union boss hits back at mayor ahead of Trump rally", 
      "author": "Vandana Rambaran | Fox News", 
      "url": "https://www.foxnews.com/politics/minneapolis-police-union-boss-hits-back-at-mayor-during-rally", 
      "title": "Minneapolis police union boss hits back at mayor ahead of Trump rally", 
      "content": " The head of the Minneapolis police union delivered impassioned remarks prior to President Trump's reelection rally Thursday night, praising him for championing the rights of law enforcement officials across the country, before being called up on stage later on in the night to be recognized by the president. \"We're seeing a lot of red cop shirts out here tonight because of the hypocrisy,\" Lt. Bob Kroll, president of the  Police Officers Federation of Minneapolis, said at the \"Keep America Great rally\" at the Target Center in Minnesota. \"They don't want the police here when it's a Republican who stands up for the police, but if it's a Democrat we get a different story. Our cops are here as much as they could be in full force across the state.\" MINNEAPOLIS POLICE BAR OFF-DUTY COPS FROM WEARING UNIFORMS AT POLITICAL EVENTS AHEAD OF TRUMP RALLY Just last week, the city rolled out a new rule that barred officers from appearing in uniform at political rallies or events, a move that raised eyebrows among Trump supporters, particularly cops, who questioned the timing of the new rule. Kroll and other officers appeared at the rally in bright red “Cops for Trump” T-shirts, which Trump pointed to during the rally. \"I love you guys,\" Trump said, giving Kroll a shoutout along with the rest of the police force before inviting him to join him and other union officers on the stage. \"You are so great, so respected, you don't even know how much our public loves you.\" \"How can you thank this guy for everything he's done for law enforcement? Wonderful president,\" Kroll said in return. Kroll also condemned Minneapolis Mayor Jacob Frey, who released a statement denouncing Trump's visit to the city last week. \"Our entire city will not stand behind the president, but behind the communities and people who continue to make our city -- and this country -- great,\" said Frey, a Democrat. \"While there is no legal mechanism to prevent the president from visiting, his message of hatred will never be welcome in Minneapolis.\" “The mayor said the president wasn’t welcome but the Police Federation of Minneapolis begs to differ,” Kroll said as the crowd cheered. Kroll slammed the Democratic Party, which has held sway in the state for close to 47 years, and which Trump is determined to flip in the upcoming election. CLICK HERE FOR THE FOX NEWS APP", 
      "date": "23 hours ago"
    }, 
    {
      "subtitle": "NYC council member launches Democratic primary challenge to Ocasio-Cortez", 
      "author": "Morgan Phillips | Fox News", 
      "url": "https://www.foxnews.com/politics/alexandria-ocasio-cortez-fernando-cabrera-democratic-primary", 
      "title": "NYC council member launches Democratic primary challenge to Ocasio-Cortez", 
      "content": " A prominent New York City Democrat filed with the Federal Election Commission (FEC) Thursday to launch a primary challenge for the House of Representatives seat currently held by Rep. Alexandria Ocasio-Cortez, D.-N.Y. City Council member Fernando Cabrera said he believes a moderate Democrat such as himself could beat the socialist Ocasio-Cortez. He plans to target her far-left views and highlight his belief that she is a “no show” in the district. “Only a Democrat is going to be able to defeat her, and it’s going to be a moderate Democrat,” Cabrera, who represents a Bronx City Council district, told Politico. “She’s a no-show in the district. She hasn’t brought about anything except division within the party.” “Socialism doesn’t work,\" Cabrera added. \"I don’t want it for my children, for my grandchildren.\" FOX NEWS POLL: BIDEN AND WARREN GAIN GROUND IN DEMOCRATIC RACE He said he decided to run after becoming fed up with Ocasio-Cortez’s railing against Amazon’s plans to build a headquarters in Queens-- plans Amazon pulled out because of backlash from New York City lawmakers. “It was staggering to me,” Cabrera said. “We have somebody who literally dismantled the possibility of us having 25,000 jobs, and she has yet to bring any jobs into the district.” LIZ CHENEY, OTHERS IN GOP SPEARHEAD BID TO SANCTION TURKEY FOR SYRIA INVASION Cabrera could face attacks over his past views on gay rights. According to Politico, a video surfaced in 2014 of Cabrera praising Uganda’s restrictive anti-gay laws. In response, Cabrera, who is also a pastor, pointed out that he has voted in favor of every piece of legislation supported by the LGBT caucus while on New York's city council. Cabrera was first elected to the city council in 2009, and he lives about a mile outside of the district which he is running to represent. Cabrera told City and State NY “I’ve done more for the Bronx and Queens than [Ocasio-Cortez] ever has.” Cabrera was a registered Republican until 2008. A number of Republicans have entered the race to challenge Ocasio-Cortez, but Cabrera is the first well-known Democrat to do so. Cabrera's complaints about Ocasio-Cortez echo those of Republican Scherie Murray, a businesswoman who emigrated from Jamaica and entered the race against Ocasio-Cortez in July. CLICK HERE TO GET THE FOX NEWS APP \"There is a crisis in Queens, and it’s called AOC,” Murray told Fox News at the time. “And instead of focusing on us, she’s focusing on being famous. Mainly rolling back progress and authoring the job-killing Green New Deal and killing the Amazon New York deal.” Four other Republicans have filed to run for the seat as well-- former police officer John Cummings, medical journalist Ruth Papazian, construction contractor Miguel Hernandez and entrepreneur Antoine Tucker.", 
      "date": "22 hours ago"
    }, 
    {
      "subtitle": "Trump belittles Bidens with graphic language at Minneapolis rally, as chaos unfolds outside arena", 
      "author": "Gregg Re | Fox News", 
      "url": "https://www.foxnews.com/politics/trump-minneapolis-minnesota-rally-impeachment-push-security-costs-ilhan-omar", 
      "title": "Trump belittles Bidens with graphic language at Minneapolis rally, as chaos unfolds outside arena", 
      "content": " President Trump unloaded on Joe and Hunter Biden over their Ukrainian business dealings in Minneapolis on Thursday evening -- at one point bringing the crowd to its feet by charging that Biden's only useful trait as vice president was his preternatural ability to \"kiss Barack Obama's a--.\" Trump cited a new report in The Washington Examiner that the whistleblower at the center of Democrats' impeachment push had worked with Biden. The whistleblower's anti-Trump attorney, Mark Zaid, acknowledged earlier in the week that his client had \"contact\" with current presidential contenders \"from both parties.\" The president also derided the Biden campaign for aggressively seeking to convince Facebook and The New York Times, as well as all major television networks, not to cover what it called \"conspiracy theories\" about potential Biden corruption. Scores of Trump supporters, as well as pro-impeachment demonstrators, lined up hours before the event at the Target Center in downtown Minneapolis began. At least one protester was photographed pouring milk on his face to counter the effects of pepper spray, as chaos unfolded outside the arena -- with pro-Trump hats being lit on fire, as some demonstrators harassed police and assaulted Trump supporters. \"The Bidens got rich -- and that is substantiated -- while America got robbed,\" Trump said. \"Sleepy Joe and his friends sold out America. ... And in a brand new report, just came out as I'm walking on the stage, it turns out that when Joe Biden was vice president -- he worked with the so-called whistleblower.  This is nothing more than a partisan witch hunt, sabotage, and I'm sure they're going to say, 'totally unsubstantiated.'\" As the crowd erupted into applause, Trump remarked, \"Isn't it much better when I go off script? So much better.\" Trump set a fiery tone within minutes of taking the stage, as he relentlessly mocked ex-FBI officials and lovers Peter Strzok and Lisa Page with a passionate dramatic reading of their anti-Trump text messages. He also touted the country's economy and suggested the U.S. will prevail in its trade war with China -- without mentioning the growing issue of censorship in the U.S. over ongoing pro-democracy protests in Hong Kong. The rally, Trump's first since the House moved toward impeachment over his handling of a July phone call with Ukraine's president, was in a state Trump nearly won in 2016 and has talked frequently of capturing in 2020. But, it took place in a traditionally liberal city and the home turf of a frequent foil, Rep. Ilhan Omar. To loud booing during the rally, Trump slammed the Democrat as \"an America-hating socialist\" who \"minimized the September 11 terror attack on our homeland.\" He also outlined comments from Omar that even top Democrats have admitted were anti-Semitic, before asking, \"How do you have such a person representing you in Minnesota? I'm very angry at you people. She is a disgrace to our country, and she is one of the big reasons that I am going to win, and that the Republican Party is going to win, Minnesota in 13 months.\" A chant of \"four more years\" broke out -- in sharp contrast to the \"send her back\" rallying cry from a July rally in North Carolina that was directed at Omar. Trump later condemned that chant, which came after the president asked why unnamed \"Democrat Congresswomen\" didn't \"go back and help fix the totally broken and crime infested places from which they came, then come back and show us how it is done.\" WHISTLEBLOWER ATTORNEY ADMITS CLIENT HAD CONTACT WITH PRESIDENTIAL CANDIDATES, AS LAWYER'S ANTI-TRUMP BIAS SURFACES Trump hit Democrats for bringing in too many refugees without proper security controls, noting that he has \"reduced refugee resettlement by 85 percent\" since taking office. The president thanked Mexico for agreeing to deploy its soldiers to help curtail illegal immigration at the border pursuant to a deal the White House struck earlier this year -- a move that Trump said would help avert a humanitarian crisis like the one unfolding in Europe. Later in the rally, Trump explained his decision to expose U.S.-allied Kurds to Turkish invasion by telling the crowd how difficult it was to inform the families of fallen U.S. servicemembers how \"their child has died.\" Keeping troops on guard to prevent Turkish incursion, Trump said, was an unnecessary risk of U.S. personnel. TUCKER: OUTRAGE OVER TRUMP'S KURD DECISION SHOWS HOW PERVERSE D.C. IS \"I have to sign these letters,\" Trump said, saying it also was \"very tough\" to go to Dover Air Force Base to \"meet the parents and families and wives and children, sisters and brothers\" of fallen soldiers who arrive in coffins. \"It's time to bring 'em home,\" Trump said to applause, referring generally to U.S. soldiers overseas. \"We've done our job.\" At the rally, Trump said over 20,000 people were inside the arena -- and over 25,000 were outside, out of nearly 100,000 who indicated online they wanted to attend. Before the president took the stage, his son Eric Trump briefly encouraged a \"lock him up\" chant directed at Joe and Hunter Biden, before telling the crowd it wouldn't be necessary because Biden will lose his bid for the White House. ANDY MCCARTHY TAKES A LOOK AT DEMS' IMPEACHMENT PUSH The president turned to Ukrainian President Volodymyr Zelensky's comments earlier Thursday concerning their fateful phone call. Zelensky unequivocally told reporters the call involved no bribe, blackmail or quid pro quo, as impeachment-minded Democrats claimed. \"That should be the end of it,\" Trump told rallygoers. \"We released a transcript of that call, which was so good that Crooked [House Intelligence Committee Chairman] Adam Schiff had to make up a fake conversation that never happened, and he delivered it to the United States Congress and the American people. It was a total fraud. And then, [House Speaker] Nancy Pelosi said, 'Oh, I think the president said that.' These people are sick.\" Trump argued that Democrats never anticipated he would release a full transcript of his call with Zelensky, and recklessly locked themselves into their impeachment inquiry before they even read the document. \"Where's Hunter?\" Trump asked rallygoers at one point, referring to Biden's son. Both Joe and Hunter Biden mostly have avoided taking questions about their Ukraine dealings in recent days. The president then launched into a mock interview with Hunter, whom Trump called \"not too smart.\" \"Hunter, you know nothing about energy, you know nothing about China, you know nothing about anything, frankly. Hunter, you're a loser,\" Trump said, his voice rising. \"Your father was never considered smart, he was never considered a good senator -- he was only a good vice president because he understood how to kiss Barack Obama's a--.\" UKRAINE PRESIDENT SAYS 'NO BLACKMAIL' IN CALL WITH TRUMP Critics have alleged Hunter -- who secured a lucrative role on the board of Ukrainian natural gas company Burisma Holdings while his father was vice president -- might have been selling access to his father, who had pushed Ukraine to increase its natural-gas production. Police removed protesters throughout the rally, which went ahead as scheduled even after Trump's campaign threatened a lawsuit over the city's effort to recover $530,000 in security costs relating to the event. The dispute over the rally's security costs erupted late Monday when the campaign accused Mayor Jacob Frey, a Trump critic, of trying to sink the rally. Frey called the costs reasonable and said he had a duty to protect taxpayers. The campaign said the city sent the security cost estimate to Target Center's operator, AEG Management, which threatened to cancel its contract to host the rally if the costs weren't covered. Its law firm threatened to sue AEG if the rally doesn't proceed. LATEST FOX NEWS POLL SHOWS BIDEN, WARREN GAINING -- SANDERS SLIPPING Trump attacked Frey Tuesday on Twitter, writing: \"Someone please tell the Radical Left Mayor of Minneapolis that he can't price out Free Speech. Probably illegal!\" His campaign said the \"bogus security charges\" are an attempt to prevent Minneapolis residents from supporting Trump, and contrasted them with what they said were much smaller charges for a 2009 event by then-President Barack Obama in the same building. \"The radical leftist mayor of Minneapolis, Jacob Frey, is abusing the power of his office and attempting to extort President Trump's re-election campaign,\" Trump's campaign said in a statement. LEGAL EXPERTS WEIGH IN AS WHITE HOUSE OBJECTS TO INQUIRY When the rally was announced last month, Frey said Trump's \"message of hatred\" would never be welcome in Minnesota. But, at a news conference Tuesday, he said the city will do all it can to guarantee a \"safe and peaceful week,\" regardless of his political differences with Trump. Frey stood by the security-cost estimate, saying a Trump political rally would bring \"significant expenses\" not associated with Obama's 2009 event, which was aimed at building support for health-care reform. Later Tuesday, the Trump campaign said in a statement that the operators of Target Center had backed off canceling the contract, with no agreement by the campaign to pay additional money. AEG didn't respond to messages seeking comment. Trump also attacked Frey over Twitter for a policy prohibiting city police officers from wearing their uniforms in support of candidates at political events or in campaign ads. A spokesman for the city's police union has complained about the policy, and the union has been selling \"Cops for Trump\" T-shirts. CLICK HERE TO GET THE FOX NEWS APP Frey said the police force must be nonpartisan and non-ideological. \"They're free to express their First Amendment rights but should do so off-duty,\" he said. Fox News' Chad Pergram and The Associated Press contributed to this report.", 
      "date": "1 day ago"
    }, 
    {
      "subtitle": "Trump protest in Minneapolis erupts in pepper spray, MAGA hat fires", 
      "author": "Danielle Wallace | Fox News", 
      "url": "https://www.foxnews.com/politics/trump-minneapolis-protest-impeachment-maga-hats-fire", 
      "title": "Trump protest in Minneapolis erupts in pepper spray, MAGA hat fires", 
      "content": " Hundreds of protesters outside President Trump’s rally in Minneapolis Thursday night set fire to Make America Great Again hats and other memorabilia in an effort to show their defiance to the current administration before police broke up the crowd, reports said. There were reports that multiple protesters were arrested. One report indicated that protesters threw urine. TRUMP BELITTLES BIDENS WITH GRAPHIC LANGUAGE AT MINNEAPOLIS RALLY, AS CHAOS UNFOLDS OUTSIDE ARENA Cell phone video posted by Star Tribune reporter Chao Xiong showed Trump supporters walking through a crowd of protesters outside the Target Center in Minneapolis, shouting, “Lock him up” and “Shame on you.” A reporter for The Washington Post posted a video on Twitter that appeared to show a protester punch a Trump supporter in the back of the head as he left the rally. The crowd can be heard shouting “Nazi scum! Off our streets!” The video shows a Trump supporter being followed by protesters before someone calls out “There’s a Nazi over here,” prompting the attack. The apparent Trump supporter was also slapped and pushed before eventually running to safety. The Minneapolis Star Tribune reported that police deployed pepper spray. Police officers on horseback and bicycles formed a protective line in front of the arena, according to The Tribune. Officers with riot batons and shields also maneuvered through the crowd of protesters. The  Post captured video of one Hispanic family who wore pro-Trump clothing departing from the rally as one protester shouted “He hates you!” The mother repeated “Mexicanos for Trump!\" as she left the scene. Trump arrived in Minnesota as polls show Americans' support rising for impeachment. Democrats claim he used his office to pressure Ukraine into investigating the Bidens for his political gain. Trump insists that he was just making sure the country was doing its part to weed out corruption. Trump was joined by Vice President Mike Pence, who had a separate schedule of appearances in the state Trump is trying to tip his way next year. CLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM Trump praised police officers during his rally.  USA Today reported that Minneapolis police were not allowed to attend the rally in their uniforms, so they wore, \"Cops For Trump\" t-shirts. The Associated Press contributed to this report.", 
      "date": "18 hours ago"
    }, 
    {
      "subtitle": "'Trump watch party’ reinstated at Michigan restaurant after RNC chair Ronna McDaniel's tweet rallies the troops: report", 
      "author": "Dom Calicchio | Fox News", 
      "url": "https://www.foxnews.com/politics/trump-watch-party-reinstated-after-rnc-chair-ronna-mcdaniels-tweet-rallies-the-troops-reports", 
      "title": "'Trump watch party’ reinstated at Michigan restaurant after RNC chair Ronna McDaniel's tweet rallies the troops: report", 
      "content": " Management at a Buffalo Wild Wings restaurant in Michigan had a sudden change of heart this week after initially canceling a plan by local Republicans to hold a “Trump watch party” at the location because of unspecified “complaints.” Perhaps helping speed the reversal: Chairwoman Ronna McDaniel of the Republican National Committee – a former chairwoman of the Michigan Republican Party whose grandfather was a Michigan governor – learned the event had been called off and alerted her 376,000 Twitter followers. TRUMP BELITTLES BIDENS WITH GRAPHIC LANGUAGE AT MINNEAPOLIS RALLY, AS CHAOS UNFOLDS OUTSIDE ARENA \"Just learned @BWWings cancelled a Michigan viewing party for @realDonaldTrump’s rally,\" McDaniel wrote in a since-delated post, according to the Washington Examiner. \" ... tell them the left's cancel culture has gone too far.\" Soon the restaurant’s location in Howell, Mich., and the corporate office in Minneapolis were receiving calls and messages from Republicans, the Examiner wrote -- and officials decided to allow the Trump watch party to proceed. A representative for the chain later told the Examiner that the cancellation had been “based on a misunderstanding.” “The group has in fact previously hosted events at the restaurant without incident,” the statement said. “The franchise owner apologizes for the misunderstanding.” McDaniel later tweeted a \"thank you\" message to the chain. CLICK HERE TO GET THE FOX NEWS APP \"Thank you @BBWings for letting the watch party proceed as planned,\" McDaniel wrote, \"and thank you to everyone who expressed their support for @realDonaldTrump! Howell is about 55 miles northwest of Detroit.", 
      "date": "17 hours ago"
    }, 
    {
      "subtitle": "Biden's full-throated attack on Trump seen as double-edged sword", 
      "author": "Paul Steinhauser | Fox News", 
      "url": "https://www.foxnews.com/politics/biden-trump-impeachment-attack-double-edged-sword", 
      "title": "Biden's full-throated attack on Trump seen as double-edged sword", 
      "content": " Joe Biden took to Twitter Thursday to declare, “President Trump picked a fight with the wrong guy.” That’s the same line the former vice president used a day earlier – to a rousing standing ovation – as Biden, for the first time, unequivocally called for the impeachment of Trump. While the president has been front-and-center in the Ukraine controversy that sparked House Democrats to launch an impeachment inquiry into Trump, Biden’s another key player, and with the impeachment push overshadowing the 2020 White House race, the Democrat has grabbed outsized attention over his rivals for the presidential nomination. BIDEN, WARREN, GAIN GROUND IN NEW FOX NEWS POLL It’s a double-edged sword for the former vice president, with Trump’s allegations against Biden’s own Ukraine connection also in the spotlight. Biden on Wednesday launched a forceful attack on the president – coming from a candidate who in recent weeks was anything but aggressive in calling for Trump’s impeachment, unlike most of his 2020 rivals. “We all laughed when he said he could stand in the middle of Fifth Avenue and shoot someone and get away with it. It’s no joke,” Biden emphasized during two speeches in New Hampshire. “He’s shooting holes in the Constitution, and we cannot let him get away with it.” Biden’s announcement came one day after the White House vowed not to play ball with the House Democrats’ impeachment inquiry, but it also came as the former vice president lost his polling status as the unrivaled front-runner. Biden’s neck-and-neck with Sen. Elizabeth Warren of Massachusetts for the top spot in most of the recent national and early-voting-state surveys, although he held a lead in the latest Fox News Poll. FOR FIRST TIME, BIDEN CALLS FOR TRUMP IMPEACHMENT And, Biden was left in the dust in the race for campaign cash, with both Warren and Sen. Bernie Sanders of Vermont each topping him by roughly $10 million in the July-September third quarter of fundraising. With those setbacks in mind, the unveiling of the more aggressive, in-your-face approach by Biden has been seen as considerably timely. “It gets his sea legs under him,” noted Larry Rasky, a longtime Biden friend, adviser and fundraiser. “It gives everybody more energy.” Rasky, who’s not directly involved in Biden’s 2020 campaign, predicted, “it’s definitely going to help fundraising.” He added that donors “are happy to see Biden taking on the fight with intensity.” Biden, in his speeches, taunted the president, claiming “he’s afraid of just how badly I will beat him next November.” Veteran Democratic consultant and communications strategist Lynda Tran noted that such swagger would resonate with voters. She also said the Ukraine controversy put the spotlight on foreign relations, a wheelhouse for the former vice president. “His remarks yesterday came across as an ‘enough is enough’ call to action and reminder to the American electorate of the fighter and statesman they have long known,” said Tran, who ran communications for the Obama-era grassroots group Organizing for America and was a founding partner of the communications firm 270 Strategies. The impeachment inquiry was sparked by Trump’s July 25 call with Ukrainian President Volodymyr Zelensky, in which he asked Zelensky to investigate Biden and his son Hunter over their dealings in the eastern European country. Fueled by whistleblower complaints and a transcript of the call released by the White House, Democrats argued the president was asking a foreign country to interfere in a U.S. election. Adding to the controversy was the fact that before that phone call, millions in U.S. military aid to Ukraine was put on hold. Despite allegations that Trump was using that money as leverage, Trump has insisted repeatedly that he did nothing wrong. He said there was no \"quid pro quo\" and on numerous occasions has described his conversation with the Ukrainian leader as “perfect.” BIDEN CAMPAIGN SLAMS NY TIMES FOR OP-ED ON FORMER VP'S UKRAINE TIES The president and allies instead have tried to put the spotlight on Biden and his son. Hunter Biden served on the board of a Ukrainian energy company while his father was vice president. Trump and fellow Republicans have questioned how Biden pushed in 2016 for the dismissal of a Ukrainian prosecutor who was looking into corruption at the company. The prosecutor – who had faced widespread accusations of overlooking corruption in his own office – later was dismissed. Biden, defending his actions in Ukraine, said, “there’s no truth to [Trump's] charges and attacks against me and my son. Zero.” Biden also accused the president of throwing “lies and distortions and smears” at him and his son, “because he thinks he’ll undermine my candidacy for the nomination as well as the presidency if I am the nominee.” While the Fox News national poll released Wednesday indicated that a majority said the president should be impeached and removed from office, Biden has faced warning signs of his own. MAJORITY BACK TRUMP IMPEACHMENT IN LATEST FOX NEWS POLL Thirty-six percent questioned in the survey said they found the Trump allegations against Biden extremely or very troubling. That included 34 percent of independents and even 24 percent of Democrats. Longtime Republican strategist Colin Reed highlighted that “the discussion involving Ukraine is going to involve a continued focus on why Hunter Biden was being paid $50,000 a month to sit on the board of an energy company with him having absolutely no expertise in that area.” Reed emphasized, “I think that crony capitalism does not sit well with voters in the center, right or left.” And, Biden’s increased criticism aimed at the president likely will incite further attacks from Trump. CLICK HERE TO GET THE FOX NEWS APP While the former vice president was speaking in New Hampshire, the president took to Twitter to return fire. “So pathetic to see Sleepy Joe Biden, who with his son, Hunter, and to the detriment of the American Taxpayer, has ripped off at least two countries for millions of dollars, calling for my impeachment - and I did nothing wrong. Joe’s Failing Campaign gave him no other choice!” Trump wrote.", 
      "date": "13 hours ago"
    }, 
    {
      "subtitle": "Ukraine whistleblower wants to testify in writing instead of appearing in person", 
      "author": "Alex Pappas | Fox News", 
      "url": "https://www.foxnews.com/politics/ukraine-whistleblower-wants-to-testify-in-writing-instead-of-appearing-in-person-report-says", 
      "title": "Ukraine whistleblower wants to testify in writing instead of appearing in person", 
      "content": " The Ukraine whistleblower at the center of the House Democratic impeachment inquiry wants to testify to Congress in writing instead of appearing in person, Fox News has confirmed. The Wall Street Journal first reported that lawyers for the anonymous CIA officer have asked lawmakers if the whistleblower could submit testimony in writing, but the House and Senate Intelligence Committees have not yet responded. WHISTLEBLOWER LAWYER ACKNOWLEDGES CLIENT HAD 'CONTACT' WITH PRESIDENTIAL CANDIDATES The request comes amid Democrats' desire to protect the identity of the whistleblower, along with worries over safety and media scrutiny. President Trump and Republicans believe the president should have a right to confront his accuser, and have also cited new reports indicating the whistleblower could have partisan motives. His attorneys have acknowledged he is a registered Democrat who has worked with at least one 2020 candidate. On Thursday, reports surfaced that the candidate was Joe Biden. Democrats formally launched an impeachment inquiry after the anonymous whistleblower filed a complaint about President Trump pressing Ukrainian officials this summer to investigate 2020 Democratic candidate Joe Biden and his son Hunter’s business activities in Ukraine. Other interviews are being conducted on Capitol Hill, as Democrats intensify their impeachment inquiry: Marie Yovanovitch, the former U.S. envoy to Kiev, is scheduled to sit for a transcribed interview with lawmakers and staff on Friday. Trump has pushed for information on the identity of the Ukraine whistleblower. In recent tweets, the president has asked, “why aren’t we entitled to interview & learn everything about the Whistleblower, and also the person who gave all of the false information to him.” During a rally in Minnesota on Thursday night, Trump cited a new report in The Washington Examiner that the whistleblower at the center of Democrats' impeachment push had worked with Biden. The whistleblower's anti-Trump attorney, Mark Zaid, acknowledged earlier in the week that his client had \"contact\" with current presidential contenders \"from both parties.\" TRUMP BELITTLES BIDENS WITH GRAPHIC LANGUAGE AT MINNEAPOLIS RALLY, AS CHAOS UNFOLDS OUTSIDE ARENA Fox News recently reported of the possibility that a secret session between the whistleblower and lawmakers could be held away from the U.S. Capitol complex. “Bringing someone up here [to Capitol Hill] is tough,” said one congressional source who asked to not be identified. It’s unclear where lawmakers could hold such a forum with the whistleblower. A secure facility exists on Capitol Hill, as well as in various quarters of government – ranging from the Department of Justice to the intelligence community. Earlier this week, the whistleblower’s attorneys said, “The whistleblower is not the story. To date, virtually every substantive allegation has been confirmed by other sources. For that reason the identity of the whistleblower is irrelevant.\" Fox News’ Griff Jenkins, Gregg Re and Chad Pergram contributed to this report.", 
      "date": "13 hours ago"
    }, 
    {
      "subtitle": "Adam Schiff's 2020 Republican challenger vows to propel 'the viper into retirement'", 
      "author": "Hollie McKay | Fox News", 
      "url": "https://www.foxnews.com/politics/eric-early-adam-schiffs-2020-republican-challenger", 
      "title": "Adam Schiff's 2020 Republican challenger vows to propel 'the viper into retirement'", 
      "content": " He’s an unabashedly proud, MAGA hat-toting attorney in the left-leaning throngs of Los Angeles. And he has high hopes of removing Rep. Adam Schiff from his seat in California’s 28th congressional district in 2020. Meet Eric Early, Schiff’s leading Republican challenger, who minces no words when it comes to his desire to send the longstanding Democratic “viper into retirement and help give Congress back to the people.” FORMER CIA WHISTLEBLOWER BLASTS MEDIA, DISMISSES UNNAMED OFFICIAL WHO FLAGGED TRUMP-UKRAINE CALL “Schiff could not care less about our district. He has been a carpetbagger since day one, having moved here from somewhere else to run against the then incumbent. In Schiff’s over 20 years representing the district, his record is appalling,” Early told Fox News. “He has done virtually nothing for the District while focusing almost exclusively on staying in power and trying to gain higher office.” And as impeachment talks gain momentum in D.C – with Schiff in the limelight as chairman of the House Intelligence Committee amplifying concerns that Trump may have violated laws in his talks with Ukrainian President Volodymyr Zelensky – Early contends that there are questionable Schiff practices at play. But defeating Schiff in 2020 will be a tall order: Schiff won his race with nearly 78.4 percent of the vote in 2018. “I refer to him (Schiff) as a National Disgrace. It is becoming more and more evident that Schiff and his team likely clandestinely worked together with a conflicted and tremendously biased deep state Trump hater to orchestrate this latest outrage to try to destroy a duly elected American president,” he continued. “That in and of itself should disqualify Schiff from overseeing the so-called ‘inquiry.’” Holding nothing back when it comes to his condemnation and zingers of his political opponent, Early has also accused Schiff of being something akin to a media hog, which was illuminated by his involvement in the two-year-long Russia investigation. “Schiff appeared on national news shows over 400 times during that period, repeatedly telling every American how he had and had seen evidence that made it clear the president had colluded with the Russians to win the election,” Early continued. “As the then-ranking member on the House Intelligence Committee, Schiff made the world believe that his knowledge was based on among other things, his access to classified information. Now Schiff never says the word Russia, but his two straight years of lies will forever be left in the public’s consciousness.” In June, the L.A power attorney for more than 25 years made the bold move to throw his hat into the ring – having become fed up with Schiff’s continuous “lies on TV.” But it is not Early’s first foray into politics. He ran unsuccessfully for California attorney general in 2018 but claims that the experience prepared him for a run against Schiff. “I spoke to people all around California, met many amazing people, received almost a million votes statewide, and thoroughly enjoyed campaigning,” he said. “My legal background has been great preparation for this role. I have practiced with some of the best and brightest attorneys. I have advocated for my clients in courts throughout the nation. I am a fighter and a debater, and I want to fight for my District.” REP. ILHAN OMAR FACES CHALLENGE FROM CHRIS KELLEY, A CELEBRATED IRAQ WAR VETERAN In his current practice, Early is leading a lawsuit against the Santa Barbara Unified School District on behalf of a group of local citizens. They’re suing “for hiring an organization of social justice warriors who are indoctrinating the teachers and students with a radical far-left, America-hating, and racially divisive agenda,” he said. “I’m hearing from parents around the country experiencing the same things in their schools,” Early conjectured. “If I am elected to Congress, I plan to do whatever I can to stop this creeping social justice warrior takeover of our nation’s public schools.” A first-generation American, whose father and mother immigrated to the U.S in the 1930s from Austria and Poland, respectively, with his dad then joining the U.S. Marine Corps and earning a Purple Heart for his endeavors in the Korean War, much of Early’s views on American values were shaped by childhood. A childhood steeped in patriotism and wedged in a middle-class neighborhood alongside Jewish, Italian and Irish families. He describes himself as a “Reagan Conservative.” “Reagan was strong, believed in a strong America, had firm convictions and beliefs, was willing to suffer the slings and arrows of maintaining his convictions,” Early noted. “Like President Trump, he knew and well understood the evils of communism and socialism and how they could destroy what makes America great.” CLICK HERE TO GET THE FOX NEWS APP He rattled off the issues he plans to highlight in the campaign against Schiff. “Schiff has never said one word about the endless increase in our taxes being foisted on us by his friends in Sacramento. Schiff has also ignored the tremendous burdens caused by illegal immigration. Crime is on the rise,” Early added. “Prisons are being emptied. Law enforcement is not being given the tools it needs or proper support from those in power. Homelessness, severe mental illness, failing public schools, and education, etc. The problems are many, deep, and serious.” A spokesman for Schiff did not immediately respond to a request for comment.", 
      "date": "12 hours ago"
    }, 
    {
      "subtitle": "Trump called former Ukraine diplomat 'bad news' ... and now she's set to testify", 
      "author": "Gregg Re | Fox News", 
      "url": "https://www.foxnews.com/politics/drama-swirls-ahead-of-dems-planned-interview-with-ukraine-diplomat", 
      "title": "Trump called former Ukraine diplomat 'bad news' ... and now she's set to testify", 
      "content": " Marie Yovanovitch, the former U.S. envoy to Kiev and someone President Trump has privately called \"bad news,\" is scheduled to sit for a potentially explosive transcribed interview with lawmakers and staff on Capitol Hill on Friday as Democrats intensify their impeachment inquiry. But after the White House abruptly blocked U.S. Ambassador to the E.U. Gordon Sondland from testifying shortly before his planned appearance on Tuesday, it remained unclear whether Yovanovitch would appear at all. The White House announced this week it would not comply at all with what it called Democrats' \"unconstitutional\" proceedings. However, multiple sources told Fox News late Thursday that Sondland will indeed appear for a transcribed interview before House investigators next Wednesday, defying the State Department. \"Notwithstanding the State Department’s current direction to not testify, Ambassador Sondland will honor the Committees’ subpoena, and he looks forward to testifying on Thursday,\" read a statement released by Sondland. It also comes amid some internal drama at the State Department. Fox News has confirmed that Michael McKinley, a senior adviser to Secretary of State Mike Pompeo, resigned this week. As of now, Fox News is told that the plan is for only House Intelligence Committee staff and members to pose questions to Yovanovitch, should the ex-diplomat show up as scheduled at 10 a.m. ET. No staffers from the Foreign Affairs or Oversight Committees, majority or minority party, are expected to be able to ask questions. But Republicans will be allowed to have a second aide in the room after complaining last time, Fox News is told. It's unclear how long the session is likely to run. HERE'S WHY THE WHITE HOUSE SAYS IT WON'T COMPLY WITH DEMS' IMPEACHMENT INQUIRY Trump and his surrogates have painted Yovanovitch as a rogue State Department employee with an anti-Trump political bias. Her ouster in May came amid alleged attempts by Trump attorney Rudy Giuliani to press Ukraine into investigating Democratic presidential candidate Joe Biden and his son. Those efforts triggered the impeachment inquiry. The former New York mayor labeled Yovanovitch a political hack bent on undermining Trump's efforts, charges that apparently resonated with the president. On Thursday, federal prosecutors unsealed an indictment alleging in part that two donors to a pro-Trump fundraising committee were engaged in lobbying efforts in the U.S. on behalf of a Ukrainian politician to seek Yovanovitch's ouster. The Soviet-born defendants, Lev Parnas and Igor Fruman, are U.S. citizens who helped Giuliani's efforts to pursue an investigation of Joe Biden's dealings in Ukraine. Meanwhile, Ukraine's president insisted Thursday that he faced \"no blackmail\" from Trump in the July 25 phone call between the two men that led to an impeachment inquiry. Volodymyr Zelenskiy said for the first time that his country will \"happily\" investigate the conspiracy theory pushed by Trump that it was Ukrainians, not Russians, who interfered in the 2016 U.S. presidential election. And he encouraged U.S. and Ukrainian prosecutors to discuss investigating the Ukrainian gas company Burisma Holdings. GIULIANI ASSOCIATES TIED TO UKRAINE PROBES INDICTED ON CAMPAIGN FINANCE VIOLATIONS Biden has acknowledged that in spring 2016, when he was vice president and spearheading the Obama administration's Ukraine policy, he successfully pressured Ukraine to fire top prosecutor Viktor Shokin. At the time, Shokin was investigating Burisma Holdings — where Hunter had a lucrative role on the board despite limited relevant expertise. The vice president threatened to withhold $1 billion in critical U.S. aid if Shokin, who was widely accused of corruption, was not fired. The impact of any news from the interview with Yovanovitch may be blunted temporarily because both the House and Senate formally remain on recess until next Tuesday. The House Democratic Caucus and Republican Conferences will hold their formal meetings and press conferences on Wednesday morning. Yovanovitch, a State Department employee for 33 years who also led U.S. embassies in Kyrgyzstan and Armenia, has drawn praise from colleagues for her past work on international affairs. She is \"a top-notch diplomat, careful, meticulous, whip-smart,\" and unlikely to have badmouthed Trump, either to Ukrainian officials or her colleagues, said John Herbst, a predecessor as ambassador in Ukraine who worked alongside Yovanovitch there in the early 2000s. That reputation is all but impossible to square with what some view as a smear campaign, capped by the Trump administration's removal of Yovanovitch from her post this year. BIDEN CAMPAIGN SEEKS TO BAR GIULIANI FROM TV ... THEN GOES AFTER NEW YORK TIMES \"The former ambassador from the United States, the woman, was bad news,\" Trump told Ukraine President Zelenskiy during their July 25 call, according to a partial transcript released by the White House. \"She's going to go through some things.\" Currently a State Department fellow at Georgetown's Institute for the Study of Diplomacy, Yovanovitch was declining all requests to speak with reporters in advance of her planned testimony. Yovanovitch, 60, was raised in a household that helped prepare her for a career in international relations. Born in Canada to immigrant parents — her father from the former Soviet Union, her mother from Germany — she grew up speaking Russian at home. The family moved to Connecticut when she was a young child, and she later became a U.S. citizen. \"Like so many, including those in the Ukrainian-American community, my parents' lives were changed forever by Communist and Nazi regimes,\" Yovanovitch said during a Senate confirmation hearing in 2016, attended by her 88-year-old mother. \"They survived poverty, war and displacement, and finally arrived in the United States, with me in tow, in search of freedom, opportunity, dignity and accountability.\" Yovanovitch attended Princeton, where she majored in history and Russian studies. She joined the Foreign Service six years later, working as deputy director of the Russian desk before being posted to Canada, Russia, Great Britain and Somalia. From 2001 to 2004, she worked as the U.S. deputy chief of mission in Ukraine, as second in charge to Herbst, before being named ambassador to Kyrgyzstan, then to Armenia. She returned to Ukraine after President Barack Obama nominated her to be ambassador in 2016. FOX NEWS POLL SHOWS RECORD SUPPORT FOR IMPEACHMENT She arrived in Kiev two years after Russia's forced annexation of Ukraine's Crimean Peninsula and its continuing military intervention. As an envoy, Yovanovitch sought to reassure Ukrainian officials of U.S. support, while pushing them to root out widespread corruption. \"The old oligarch system is still clinging to life, and corruption is its life support,\" she said in a speech in January to new graduates of the Ukrainian Leadership Academy. \"Ukraine must continue to pursue economic reforms in line with European standards and fully empower all of its anti-corruption institutions.\" Some Ukrainian officials, including the country's top prosecutor, bridled at the pressure from the U.S. ambassador. In March, the prosecutor, Yuriy Lutsenko, claimed that Yovanovitch had given him a list of people he should not prosecute. The State Department dismissed the statement as baseless and Lutsenko later recanted his claim. But critics, led by Giuliani, accused her of working to undermine Trump's interests. \"The embassy in Ukraine was a 'Hillary Clinton for president' office. And they were looking to dig up dirt on President Trump,\" Giuliani said. \"There was a lot more collusion with Ukraine than in Russia, where there doesn't appear to be any. They were trying to bring Trump down.\" As part of Senate confirmation hearings to ambassadorial posts, Yovanovitch reported that she made several small contributions to Democratic candidates in the early 2000s, but none more recently. She returned to Washington in 2012 and 2013, serving as the State Department's day-to-day contact with U.S. officials in Europe. Lee Feinstein, the U.S. ambassador to Poland at the time, recalled extended conversations with Yovanovitch about how to calibrate negotiations over missile development and a continuing U.S. military presence there. CLICK HERE TO GET THE FOX NEWS APP \"She was always the kind of person who was very, very supportive of her ambassadors and looking to help them do their jobs better,\" said Feinstein, now dean of the Hamilton Lugar School of Global and International Relations at Indiana University. \"Never somebody who was trying to pursue her own agenda.\" Fox News' Nick Kalman, Chad Pergram and The Associated Press contributed to this report.", 
      "date": "23 hours ago"
    }, 
    {
      "subtitle": "Beto threatens tax-exempt status of churches if they don't support gay marriage", 
      "author": "Caleb Parke | Fox News", 
      "url": "https://www.foxnews.com/politics/beto-church-of-tax-exempt-status-gay-marriage", 
      "title": "Beto threatens tax-exempt status of churches if they don't support gay marriage", 
      "content": " Democratic presidential hopeful Beto O'Rourke says he'd strip churches of tax-exempt status if they don't support same-sex marriage. When the former Texas congressman was asked if religious institutions -- \"colleges, churches, charities\" -- should be stripped of tax-exempt status Thursday night by CNN anchor Don Lemon during the LGBTQ town hall, he immediately responded, \"Yes.\" CNN'S CHRIS CUOMO'S 'MINE TOO' JOKE TO KAMALA HARRIS AT LGBTQ EVENT DRAWS BACKLASH The crowd erupted in applause before O'Rourke further explained. \"There can be no reward, no benefit, no tax break for anyone or any institution, any organization in America, that denies the full human rights and the full civil rights of every single one of us,\" he said. \"So as president, we're going to make that a priority, and we are going to stop those who are infringing upon the human rights of our fellow Americans.\" BOOKER QUOTES THIS OLD TESTAMENT BIBLE VERSE TO DEFEND LGBTQ RIGHTS In O'Rourke's \"Plan to Pursue Equality for LGBTQ+ People and Ensure They Can Live Openly Without Fear of Discrimination or Violence,\" he lists reversing the Trump administration's \"attempt to expand religious exemptions in order to enable discrimination or harm others.\" He adds, \"Freedom of religion is a fundamental right, but it should not be used to discriminate.\" Matt Lewis, CNN political commentator, tweeted out, \"This isn't going to help win the electoral college. If you wonder why so many Christians are willing to hold their nose and support someone as horrible as Donald Trump, this helps explain it.\" Luke Goodrich, vice president and senior counsel at Becket, a religious liberty law firm, called it \"blatantly unconstitutional,\" adding \"it's also foolish because those groups provide billions of dollars in essential social services to their communities. Churches and ministries should be allowed to hold centuries-old beliefs without fear of government retribution.\" CLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM And Hiram Sasser, general counsel for First Liberty Institute, told Fox News their faith-based organization has taken on the government before. “When the  Obama IRS came after pastors gathering together in conferences with Rick Perry support traditional marriage, we had to defend the pastors,” Sasser said. “We beat the IRS then and we would do it again if O’Rourke attacks churches with the IRS in the future.” President Trump has championed religious liberty, largely winning the evangelical vote in 2016, and earlier this year, his administration launched a global effort to decriminalize homosexuality.", 
      "date": "12 hours ago"
    }, 
    {
      "subtitle": "Booker quotes this Old Testament Bible verse to defend LGBTQ rights", 
      "author": "Caleb Parke | Fox News", 
      "url": "https://www.foxnews.com/politics/booker-bible-lgbtq-town-hall", 
      "title": "Booker quotes this Old Testament Bible verse to defend LGBTQ rights", 
      "content": " Democratic presidential candidate Cory Booker, D-N.J., said he's been dealing with the \"juxtaposing issues of religious freedom and LGBTQ rights\" all of his life as a Christian with people \"using religion as a justification for discrimination.\" The New Jersey senator then used a Bible verse from the Old Testament to answer a question during CNN's LGBTQ town hall Thursday night. BETO THREATENS TAX-EXEMPT STATUS OF CHURCHES IF THEY DON'T SUPPORT GAY MARRIAGE Citing Micah 6:8, Booker made his defense after a UCLA student, who attended an all-girls Catholic high school in N.J., said her school routinely rejected requests for an LGBTQ+ club. \"It said in Micah, 'What do you want from your Lord, but what is it you want from your people?'\" he said. \"Which is to do justice, love kindness, and walk humbly -- walk humbly -- and, so for me, I cannot allow, as a leader, that people are going to use religion as a justification for discrimination.\" CNN'S CHRIS CUOMO'S 'MINE TOO' JOKE TO KAMALA HARRIS AT LGBTQ EVENT DRAWS BACKLASH He added, \"I can respect your religious views but also protect people from discrimination.\" Booker used the opportunity to push for the Equality Act as one of the laws \"that do not allow people to discriminate...in our schools in education...healthcare....globally.\" CLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM He concluded, \"My faith, as well as my American values, will make me fight on every front to make sure that people are not discriminating against someone because of who they are.\" At another point in the night, Booker said he once held negative views about \"two men kissing\" and \"hating gays,\" but said his activism started as a teenager on a crisis hotline.", 
      "date": "11 hours ago"
    }, 
    {
      "subtitle": "Federal appeals court rules against Trump in battle over tax returns", 
      "author": "Alex Pappas | Fox News", 
      "url": "https://www.foxnews.com/politics/federal-appeals-court-rules-against-trump-in-battle-over-tax-returns", 
      "title": "Federal appeals court rules against Trump in battle over tax returns", 
      "content": " A federal appeals court in Washington has sided against President Trump, saying his financial records must be turned over to the House of Representatives as the president’s legal team prepares to appeal. The U.S. Court of Appeals for the District of Columbia Circuit said Friday that Democratic lawmakers should get the documents they have subpoenaed from Mazars USA. The firm has provided accounting services to Trump. TRUMP GRANTED REPRIEVE ON TAX RETURN CASE AFTER FEDERAL JUDGE ISSUES BLISTERING RULING Trump’s legal team told Fox News they are “reviewing options.” Options include a request for the appeal to be heard “en banc” or, possibly, taking it to the Supreme Court. “While we are reviewing the court’s lengthy decision, as well as Judge Rao’s dissent, we continue to believe that this subpoena is not a legitimate exercise of Congress’s legislative authority,\" said Jay Sekulow, counsel to the president. The Democrats on the House Committee on Oversight and Reform subpoenaed records from Mazars in April. They include documents from 2011 to 2018 that the House wants for an investigation into the president's reporting of his finances and potential conflicts of interest. “Today’s ruling is a fundamental and resounding victory for congressional oversight, our Constitutional system of checks and balances, and the rule of law,\" said Elijah Cummings, the Democratic chairman of the committee. \"For far too long, the President has placed his personal interests over the interests of the American people.\" Earlier this year, the top Republican on the Oversight Committee, Ohio Rep. Jim Jordan, sent a letter to Cummings “strenuously” objecting to the committee's subpoena. “I urge you to seriously reconsider your intention to issue this subpoena,” Jordan told Cummings at the time. “Your obsession with attacking the president and his family for political gain does nothing to improve the efficiency, economy and operations of the federal government.” Trump appointee Neomi Rao dissented from the three-judge panel's ruling. The other judges are Patricia Millett, appointed by President Barack Obama, and David Tatel, appointed by President Bill Clinton. Meanwhile, earlier this week, Trump was granted at least a brief reprieve Monday after a federal judge issued a scathing order allowing the Manhattan District Attorney’s Office to subpoena his tax returns from Mazars USA. The 2nd Circuit Court of Appeals put the subpoena on hold after Trump's attorneys filed an emergency appeal. CLICK HERE TO GET THE FOX NEWS APP The administrative stay will only be in place while the court reviews the case, and it's unclear how that will resolve. U.S. District Court Judge Victor Marrero earlier Monday was unsparing toward the president's legal team as he dismissed Trump’s lawsuit seeking to block the subpoena. Fox News’ John Roberts and Ronn Blitzer and The Associated Press contributed to this report.", 
      "date": "10 hours ago"
    }, 
    {
      "subtitle": "Top diplomats to testify before Congress despite opposition from State Dept., White House", 
      "author": "Adam Shaw | Fox News", 
      "url": "https://www.foxnews.com/politics/top-diplomats-to-testify-to-congress-despite-opposition-from-state-dept-white-house", 
      "title": "Top diplomats to testify before Congress despite opposition from State Dept., White House", 
      "content": " Two diplomats at the center of the Ukraine controversy are now set to testify before House lawmakers as part of Democrats’ impeachment inquiry, despite significant pushback from both the State Department and the White House. Marie Yovanovitch, the former U.S. envoy to Kiev and someone President Trump has privately called \"bad news,\" arrived on Capitol Hill Friday for a potentially explosive transcribed interview with lawmakers and staff. TRUMP ALLED FORMER UKRAINE DIPLOMAT 'BAD NEWS'...AND NOW SHE'S SET TO TESTIFY Trump and his allies have sought to paint Yovanovitch as a rogue employee with an anti-Trump bias. She was ousted in May amid alleged attempts by Trump attorney Rudy Giuliani to press Ukraine into investigating Democratic presidential candidate Joe Biden and his son.  Those efforts ultimately led to the impeachment inquiry after the revelation of a July 25 phone call between Trump and Ukrainian President Volodymyr Zelensky -- in which Trump asked the premier to “look into” the allegations about Biden's conduct in the country. While Yovanovitch, a long-time diplomat, has been praised by her colleagues as a \"top-notch diplomat,\" Trump depicted her in the call with Zelensky as “bad news” and someone who is “going to go through some things.” Giuliani and other critics have accused her of working to undermine Trump’s interests. Also Friday, U.S. Ambassador to the European Union Gordon Sondland announced that he will testify before Congress. The announcement comes a week after the State Department directed him not to appear before lawmakers at a scheduled deposition. The shift comes after House Democrats on Wednesday subpoenaed him to appear before the joint committees to testify. He said in a statement that he is scheduled to appear on Thursday. TRUMP ADMINISTRATION BLOCKS AMBASSADOR FROM TESTIFYING IN HOUSE IMPEACHMENT DEPOSITION “Notwithstanding the State Department’s current direction to not testify, Ambassador Sondland will honor the Committees’ subpoena, and he looks forward to testifying on Thursday,” the statement said. \"Ambassador Sondland has at all times acted with integrity and in the interests of the United States. He has no agenda apart from answering the Committees’ questions fully and truthfully.” Trump had dismissed the deposition as a “kangaroo court,” while Democrats warned that a failure of Sondland and other witnesses to appear was evidence of obstruction of Congress. “I would love to send Ambassador Sondland, a really good man and great American, to testify,\" Trump tweeted, \"but unfortunately he would be testifying before a totally compromised kangaroo court, where Republican’s rights have been taken away, and true facts are not allowed out for the public to see.\" Democrats claim that Trump used $400 million in military aid as leverage in a quid pro quo for the Ukrainians to investigate a political opponent, former Vice President Joe Biden, and opened an impeachment inquiry, firing off a raft of subpoenas within a few days to top administration and White House officials. While a call transcript shows the president urging a Biden-related investigation, Trump denies any 'quid pro quo' claims. Sondland is a wealthy hotelier, philanthropist and contributor to political campaigns. He is a key figure as he had texted with Bill Taylor, a top U.S. diplomat in Ukraine, arguing over allegations of a quid pro quo. In early September, Taylor wrote: \"Are we now saying that security assistance and WH meeting are conditioned on investigations?\" Days later, he followed up: \"As I said over the phone, I think it's crazy to withhold security assistance for help with a political campaign.\" Sondland responded, defending the president: \"Bill, I believe you are incorrect about President Trump's intentions. The President has been crystal clear: no quid pro quo’s of any kind. The President is trying to evaluate whether Ukraine is truly going to adopt the transparency and reforms that President Zelensky promised during his campaign.” It is not clear how much of the change in Sondland’s position is his own, and how much the Trump administration has shifted on the question of whether he should appear. Axios reported Friday that Republicans close to Trump encouraged the president to let the ambassador come before the committees and that his allies believe Sondland's testimony will be helpful to them. CLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM But the White House has been aggressive in its pushback against the impeachment inquiry, which it sees as illegitimate and politically motivated. On Wednesday the White House issued a defiant letter saying it would not cooperate with the inquiry. \"President Trump and his administration reject your baseless, unconstitutional efforts to overturn the democratic process,\" the letter stated. \"Your unprecedented actions have left the president with no choice. In order to fulfill his duties to the American people, the Constitution, the Executive Branch, and all future occupants of the Office of the Presidency, President Trump and his administration cannot participate in your partisan and unconstitutional inquiry under these circumstances.\" Fox News' Gregg Re, Lillian LeCroy, Nick Kalman, Chad Pergram and The Associated Press contributed to this report.", 
      "date": "11 hours ago"
    }, 
    {
      "subtitle": "Trump to name State Dept. official John Sullivan as next ambassador to Russia", 
      "author": "Adam Shaw,", 
      "url": "https://www.foxnews.com/politics/trump-to-announce-state-dept-official-john-sullivan-as-next-ambassador-to-russia", 
      "title": "Trump to name State Dept. official John Sullivan as next ambassador to Russia", 
      "content": "  President Trump will soon announce that Deputy Secretary of State John Sullivan will be the next U.S. ambassador to Russia, a senior administration official confirmed to Fox News Friday. Sullivan will replace Jon Huntsman, who left the post last week. Fox News reported in August that Trump intended to nominate Sullivan. The Wall Street Journal first reported Friday that Moscow agreed to accredit Sullivan -- a precursor to a formal nomination. US PULLS OUT OF REAGAN-ERA ARMS TREATY, SAYING RUSSIA 'MADE NO EFFORTS' TO COMPLY Sullivan, a lawyer with a long history of federal service, has been deputy secretary of state since May 2017 when the Senate confirmed him 94-6. He briefly led the State Department in the period between former Secretary of State Rex Tillerson’s dismissal in March 2018 and Mike Pompeo’s swearing-in the following month. Sullivan’s career in government dates back to 1991, when he served as counselor to Assistant Attorney General J. Michael Luttig in the Justice Department’s Office of Legal Counsel. During the administration of President George W. Bush, Sullivan served as deputy general counsel to the State Department before moving on to the role of general counsel at the Department of Commerce. The Journal reports that he is currently leading a pair of ongoing dialogues with Russia relating to counterterrorism and strategic security. Sources told the outlet that Sullivan played an important role in the expulsion of Russia diplomats after the poisoning of a former double agent and his daughter in England in 2018. Fox News’ Andrew O’Reilly contributed to this report.", 
      "date": "9 hours ago"
    }, 
    {
      "subtitle": "Former DIA employee accused of leaking top secret information to reporters released on bond", 
      "author": "Barnini Chakraborty | Fox News", 
      "url": "https://www.foxnews.com/politics/former-dia-employee-accused-of-leaking-top-secret-information-to-reporters-released-on-bond", 
      "title": "Former DIA employee accused of leaking top secret information to reporters released on bond", 
      "content": " Henry Frese, the counterterrorism analyst for the Defense Intelligence Agency accused of leaking classified government information to two journalists, including one with whom he was romantically involved, was released Friday on bond. Frese, who pleaded not guilty two days ago, was arraigned in a Virginia federal court. He made no statements in court and no new evidence was presented against him during the bond hearing. A federal indictment against the 30-year-old, who is accused of using his position to pass on \"top secret\" information about foreign countries' weapons systems, was unsealed Wednesday. \"Frese was caught red-handed disclosing sensitive national security information for personal gain,\" Assistant Attorney General for National Security John Demers said in a press release. \"Frese betrayed the trust placed in him by the American people-- a betrayal that risked harming the national security of this country.\" Frese's alleged motive was to advance the career of a female reporter he was having a relationship with, the FBI said in court documents. Frese allegedly also passed information to one of the woman's female colleagues at an \"affiliated but different news outlet.\" Authorities did not disclose the names of the two journalists but the Justice Department said they were from NBC and CNBC and cover national security. Frese's case is one of six authorized disclosure cases that the Justice Department has cracked down on during the Trump administration. CLICK HERE FOR THE FOX NEWS APP \"We will continue in our efforts to punish and deter this behavior,\" Demers said. In one of those cases, former Air Force linguist Reality Winner, who was an intelligence contractor for the National Security Agency, gave the news media classified information about Russian interference in the 2016 presidential election. She was arrested in 2017, pleaded guilty to federal charges and was sentenced to five years behind bars. Fox News' Bill Mears contributed to this report.", 
      "date": "8 hours ago"
    }, 
    {
      "subtitle": "Bullock, long-shot 2020 Dem, insists nomination ‘won’t be decided by the debates’", 
      "author": "Paul Steinhauser | Fox News", 
      "url": "https://www.foxnews.com/politics/lower-tier-2020-dems-argue-nomination-wont-be-decided-by-the-debates", 
      "title": "Bullock, long-shot 2020 Dem, insists nomination ‘won’t be decided by the debates’", 
      "content": " MANCHESTER, N.H. -- Two long-shot candidates for the Democratic presidential nomination who failed to make next week’s debate stage are taking aim at the showdowns. “This won’t be decided by the debates. What I hear from folks time and time again is nothing meaningful came out of these debates and they’re often disconnected from peoples’ lives,” Montana Gov. Steve Bullock said Friday. Bullock spoke with reporters from Fox News, NBC News, and NPR after headlining the \"Politics and Eggs\" speaking series, a must-stop for White House hopefuls in the first-in-the-nation presidential primary state of New Hampshire. BULLOCK ACCUSES STEYER OF BUYING HIS WAY ONTO DEBATE STAGE Bullock, who launched his campaign in the late spring, qualified for the second round of debates but didn’t reach the Democratic National Committee’s polling and fundraising criteria to make the cut for last month’s showdown or Tuesday’s debate, which will be held in Ohio. The DNC’s raising the thresholds again for candidates to make the stage for November’s fifth round showdown, which will be held in Atlanta. Colorado Sen. Michael Bennet is in a similar situation. He jumped into the race relatively late and qualified for the first two rounds of debates, but didn’t make the stage last month and won’t be in the debate spotlight next week. “I had to make a decision on the debate stage, whether I was going to keep laundering money through Facebook to try to stay on a debate stage that was pre-season football, that wasn’t going to make a difference in the standings, or whether I was going to talk to voters directly in Iowa and New Hampshire,” Bennet explained in an interview on Tuesday with Fox News and NHTalkRadio.com. “I decided I was going to talk to voters directly in Iowa and New Hampshire at a time when they were going to start paying attention to this race,” he emphasized. THE LATEST FROM FOX NEWS ON THE 2020 PRESIDENTIAL CAMPAIGN Twelve candidates have qualified for Tuesday’s showdown. Bullock, Bennet, and four other contenders in the still extremely large but shrinking field of Democratic White House hopefuls failed to make the cut. Most of the lower-tier candidates have fired away for months at the DNC for their debate criteria, arguing it’s unfair and winnows the field of candidates before voters in Iowa, New Hampshire, Nevada, and South Carolina – the first four states in the primary and caucus presidential nominating calendar, get to cast their ballots. A slightly more diplomatic Bullock said on Thursday that “the DNC was well-intentioned but I don’t think the best example is for campaigns to be spending $50 or $60 to get each individual donor…. I don’t think that’s the best way to pick a candidate or nominee.” Pushing back against the criticism, DNC Chair Tom Perez told Fox News last month that the process has been “eminently fair” and added “we’re going “to continue to be transparent.” Rep. Tulsi Gabbard  - who failed to qualify for last month’s debate but made the stage for next week’s showdown - announced on Thursday that she may boycott next Tuesday’s debate. GABBARD THREATENS TO BOYCOTT DEBATE TO PROTEST DNC The congresswoman from Hawaii accused the DNC and its national media debate partners of “rigging” the primary battle against many of the lower-tier candidates and political outsiders running for the nomination. “I am seriously considering boycotting October 15 debate to bring attention to DNC/corporate media’s effort to rig 2020 primary,” she tweeted. Even though he’s not making the stage, Bullock says he’s marching on. He told Fox News he has enough campaign cash to survive until the first votes in the early voting states in February. “We’re still 120 days out from any voter expressing preference. I still think there’s a lot of time for this,” he stressed. And Bennet took aim at the top-tier contenders for the nomination, such as former Vice President Joe Biden and Sens. Elizabeth Warren of Massachusetts and Bernie Sanders of Vermont. “I think the support for the leaders in the race is very, very soft, maybe as soft as it’s ever been at this stage of the race,” he predicted.", 
      "date": "8 hours ago"
    }, 
    {
      "subtitle": "Biden buoyed amid Trump attacks", 
      "author": "Chris Stirewalt | Fox News", 
      "url": "https://www.foxnews.com/politics/biden-buoyed-amid-trump-attacks", 
      "title": "Biden buoyed amid Trump attacks", 
      "content": " **Want FOX News Halftime Report in your inbox every day? Sign up here.**\n\nOn the roster: Biden buoyed amid Trump attacks - Giuliani’s woes mount - Trump legal team trashes Gowdy - Dems divided on timing of impeachment vote - ‘This is a nudge to pick up the fudge’\n\nBIDEN BUOYED AMID TRUMP ATTACKS\nFox News: “Together Joe Biden and Elizabeth Warren capture the support of more than half of Democratic primary voters, according to the latest Fox News national poll on the 2020 election. Biden stays on top in the race with 32 percent support among primary voters, up 3 points since September. He’s followed by Elizabeth Warren at 22 percent -- that’s up 6 points and a new high for her. Bernie Sanders is at 17 percent, down 1 point since last month. While Biden’s support has stayed between 29-35 percent since March, his current 10-point advantage is about half of his 19-point lead in June. The rundown continues with Kamala Harris at 5 percent, Pete Buttigieg at 4 percent, Beto O’Rourke at 3 percent, and Cory Booker, Amy Klobuchar and Andrew Yang each at 2 percent. Michael Bennet, Julian Castro, Tulsi Gabbard, Tim Ryan, Tom Steyer, and Marianne Williamson receive 1 percent apiece.”\n\nBiden’s firewall still strong - WaPo: “[Contrary] to the expectations of analysts, the fears of supporters and the hopes of rivals, Biden maintains a sizable loyal following. Nowhere is that more evident than in the African American community, recent interviews suggest, especially in states like South Carolina, which holds a crucial early primary. Martha Beck, a retired high school teacher from Charleston … gushed about Sens. Elizabeth Warren (D-Mass.) and Bernie Sanders (I-Vt.) but said Sanders is ‘too old and grumpy and he just shouts at people all the time.’ And she doesn’t think the same country that elected [Donald] Trump would put Warren, or any other woman, in the White House four years later.”\n\nWill any Dem dare mention the swampy stuff? - NYT: “It’s the one question about impeachment that no Democratic presidential candidate wants to answer head on. Should Joe Biden’s son Hunter have been allowed to sit on the board of a foreign company while his father served as vice president? In the past few weeks, Mr. Biden and his campaign team have spent significant amounts of time and energy denouncing any whiff of impropriety between his son’s work and his service as vice president. … So far, none of the Democratic primary candidates have taken a hard swing at Mr. Biden, focusing instead on the impeachment inquiry into Mr. Trump. But a few are, quite delicately, trying to raise some concerns. … In past debates, candidates who have taken on Mr. Biden’s personal characteristics, like his age, have faced blowback. The questions surrounding his son may be even more sensitive… Echoing an attack introduced and continually leveraged — in false ways — by Mr. Trump could risk raising Democrats’ ire.”\n\nJane Sanders takes starring role in husband’s campaign - NYT: “When it comes time to make critical decisions regarding his presidential campaign, Senator Bernie Sanders often relies on a committee of two: himself and his wife, Jane Sanders. … When doctors confirmed to her on Thursday that Mr. Sanders had suffered a heart attack, she said, it was her decision to wait until he was discharged the next day to release that information. And when it was time to say publicly that Mr. Sanders would be easing the pace of his campaigning after his heart attack, Ms. Sanders … stood beside him to explain the reason: His closest advisers, ‘especially me,’ had told him to slow down. … In a rare interview on Wednesday at their home in Burlington, Ms. Sanders said it would be ‘egotistical’ to call herself Mr. Sanders’s top adviser but allowed that she was ‘very much a close adviser.’ Above all, she said, she was ‘his wife.’”\n\nVoter intensity on both sides through the roof - Gallup: “A year before the 2020 presidential election, roughly seven in 10 Democrats and Republicans say they have given ‘quite a lot of thought’ to the election. About half of political independents have done so. The lack of a Republican-Democratic difference in thought given to the election is notable because Republicans usually have an advantage over Democrats, including in each of the past seven final presidential pre-election surveys, as well as in most surveys conducted throughout presidential election years historically. The current results are based on combined data from interviews with more than 2,400 U.S. adults aged 18 and older, conducted between Aug. 15 and Sept. 30, 2019. Gallup has measured thought given to the election since 1952, and it has shown a relationship to actual voter turnout among all Americans in past elections.”\n\nTHE RULEBOOK: CLOAK AND DAGGER \n\n“It seldom happens in the negotiation of treaties, of whatever nature, but that perfect SECRECY and immediate DESPATCH are sometimes requisite. These are cases where the most useful intelligence may be obtained, if the persons possessing it can be relieved from apprehensions of discovery.” – John Jay, Federalist No. 64\n\nTIME OUT: ‘A STATUE OF FLORENTINE BRONZE’\nParis Review: “In the late summer of 1866, a black equestrian stuntwoman made her Paris debut and galvanized the city. She was known only as ‘Sarah the African,’ and history has left us few traces of her: just some battered posters, inky clippings, and burlesque scripts. Sarah was, in the words of the men who wrote about her, ‘the finest horsewoman of the King of Morocco,’ ‘an Ethiopian,’ or ‘a statue of Florentine bronze.’ A ‘negress’ who performed as neither slave nor clown, whose name evoked Sarah Baartman, the Khoikhoi woman dissected by Georges Cuvier just a few decades before in Paris, and Selika, the queen heroine of Meyerbeer’s hit posthumous opera, L’Africaine. She was a woman named for a whole continent. … On her debut in September she was billed above Méphistophélès the bareback horse, above a race of forty horses all mounted by women, above the rubber horseman, William Meyer, and even above Mlle Adèle, who made her Sidy-Laraby dance with no reins.”\n\nFlag on the play? - Email us at HALFTIMEREPORT@FOXNEWS.COM with your tips, comments or questions.\n\nSCOREBOARD\n\nDEMOCRATIC 2020 POWER RANKING\nBiden: 28 points (↑ 1.2 points from last wk.)\nWarren: 26.2 points (↑ 3.4 points from last wk.)\nSanders: 14.4 points (↓ 1.6 points from last wk.)\nButtigieg: 5.4 points (↓ 0.6 points from last wk.)\nHarris: 4.2 points (↓ 1.4 points from last wk.)\n\n[Averages include: Fox News, Quinnipiac University, IBD, Monmouth University and NBC News/WSJ.]\n\n\nTRUMP JOB PERFORMANCE \nAverage approval: 42.8 percent\nAverage disapproval: 53.4 percent\nNet Score: -10.6 percent\nChange from one week ago: ↑ 0.4 points\n\n[Average includes: NPR/PBS/Marist: 45% approve - 51% disapprove; Fox News: 43% approve - 55% disapprove; NBC/WSJ: 43% approve - 53% disapprove; Quinnipiac University: 40% approve - 54% disapprove; IBD: 43% approve - 54% disapprove.]  \n\nWANT MORE HALFTIME REPORT? \n\nYou can join Chris and Brianna every day on Fox Nation. Go behind-the-scenes of your favorite political note as they go through the must-read headlines of the day right from their office – with plenty of personality. Click here to sign up and watch!\n\nGIULIANI’S WOES MOUNT\nABC News: “The business relationship between President Donald Trump's private lawyer Rudy Giuliani and the men charged Thursday in a campaign finance scheme is a subject of the ongoing criminal investigation being conducted by federal authorities in New York, according to two sources familiar with the matter. The investigation became public after the FBI had to quickly move to arrest Lev Parnas and Igor Fruman before they boarded a flight out of the country from Washington Dulles Airport with one-way tickets. They have been named as witnesses in the ongoing impeachment inquiry into President Trump. The investigation is being conducted by the FBI's New York field office and prosecutors in the Southern District of New York, the same U.S. Attorney's office Giuliani ran before he became mayor of New York.”\n\nFormer Ambassador to Ukraine cites Giuliani pressure campaign - AP: “Former U.S. Ambassador to Ukraine Marie Yovanovitch told lawmakers Friday that President Donald Trump pressured the State Department to oust her from her position. Yovanovitch said in an opening statement obtained by The Associated Press that she was ‘abruptly’ recalled in May and told the president had lost confidence in her. She said she was told by an official that there was a ‘concerted campaign against me’ and that Trump had pressured officials to remove her for almost a year. ‘Although I understand that I served at the pleasure of the president, I was nevertheless incredulous that the U.S. government chose to remove an ambassador based, as best as I can tell, on unfounded and false claims by people with clearly questionable motives,’ Yovanovitch wrote in the statement.”\n\nReport: Trump pushed Tillerson to help a Giuliani client - WaPo: “President Trump sought to enlist then-Secretary of State Rex Tillerson in the fall of 2017 to work with Rudolph W. Giuliani to help stop the prosecution of a Turkish Iranian gold trader represented by the former New York mayor, according to people with knowledge of the request. Trump urged Tillerson in an Oval Office meeting to try to craft a diplomatic ‘deal’ to stop the U.S. case against Reza Zarrab on corruption charges in exchange for concessions from Turkey. The request shocked the then-secretary of state, said the people, who spoke on the condition of anonymity to describe private conversations involving the president. At the time, Turkish President Recep Tayyip Erdogan was personally lobbying Trump to get the charges dropped. Trump, in turn, repeatedly raised the topic with Tillerson — including directly in the Oval Office meeting, according to people with knowledge of the episode.”\n\nPete Session’s political revival threatened by Ukraine role - NYT: “Former Representative Pete Sessions, a Texas Republican who is seeking a return to Congress, was caught in the fallout of the Ukraine scandal on Thursday when he was referred to in the indictment of two presidential allies accused of campaign finance allegations. Mr. Sessions, who served 11 terms in Congress until he was swept out last year, is described as ‘Congressman-1’ in the indictment of Lev Parnas and Igor Fruman, who were arrested and charged on Thursday with illegally funneling foreign money to American political candidates and campaigns. The two men are associates of Rudolph W. Giuliani… Mr. Sessions’s appearance in the indictment, which was filed just a week after he announced he would run for Congress in 2020, was an early and potentially damaging blow to his campaign. Mr. Sessions is not named in the indictment, nor is he accused of any wrongdoing. On Thursday, he issued a statement that denied any wrongdoing and said he had no knowledge of the scheme detailed by federal prosecutors.”\n\nContinetti: We are all Ukrainians - Free Beacon: “From Varsity Blues to Jeffrey Epstein, from China and the NBA to Ukraine and Hunter Biden, Americans are taking a crash course on the ways in which powerful people manipulate the system for personal advantage and globalization merges political cultures as well as economies. What has been uncovered as impeachment rolls on does nothing to spur confidence in the integrity of our system. America is exceptional, but our elites are not. Today we are all Ukrainians.”\n\nTRUMP LEGAL TEAM TRASHES GOWDY\nYahoo: “The president’s decision to bulk up his legal team with former South Carolina Rep. Trey Gowdy amid a widening impeachment inquiry is drawing criticism from one of his high-profile supporters. On Wednesday morning, the day after news leaked that Gowdy was set to serve as outside counsel to the president, Victoria Toensing, a veteran Washington lawyer who has been working with Trump’s personal attorney, Rudy Giuliani, expressed concern and disbelief that the onetime advocate for congressional oversight would be coming onboard. ‘Trey Gowdy doesn’t know s***,’ she said. … ‘He screwed up the Benghazi hearings, and he came out with the advice to Trump, ‘Well, if you’ve done nothing wrong, just talk to Bob Mueller.’’ Toensing and her husband, Joe diGenova, work with Giuliani though they are not officially on Trump’s legal team.”\n\nAnd he can’t even join until January - WashEx: “Former Republican Congressman Trey Gowdy cannot join President Trump's legal team until early next year, the president announced Thursday. Speaking to reporters on the South Lawn of the White House, Trump said, ‘Trey Gowdy is a terrific guy. I think there’s a problem with, he can’t start for another couple of months because of lobbying rules and regulations.’ It was only a day after Jay Sekulow, counsel to the president, announced Gowdy had joined the team to assist with the response to the House Democrats' impeachment inquiry. … Gowdy, 55, is a former federal prosecutor who retired from Congress on Jan. 3 after representing the 4th Congressional District of South Carolina for four terms. He then rejoined his old white-collar law firm, Nelson Mullins Riley & Scarborough. Despite his return to the legal profession, federal law prevents Gowdy from taking on Trump as a client in the impeachment fight until Jan. 3, 2020.” DEMS DIVIDED ON TIMING OF IMPEACHMENT VOTE\nPolitico: “House Democrats are grappling with whether to take more steps to formalize their impeachment inquiry and silence a chief Republican criticism of their efforts, with competing factions beginning to emerge. President Donald Trump and his allies on Capitol Hill have hammered Speaker Nancy Pelosi for not holding a vote authorizing the House’s impeachment proceedings — arguing that without a vote, the entire process is illegitimate. Pelosi has refused to cave, dismissing Trump’s demand last week and insisting it is not required under the Constitution or House rules. And allies close to the speaker say her position hasn’t changed, describing the idea as the latest ‘Republican canard’ in a series of stall tactics the GOP will employ to protect Trump. … Yet some Democratic lawmakers and aides have begun to say privately — and, to a lesser extent, publicly — that the House should just vote to formalize the inquiry, robbing the GOP of its main talking point. The debate is threatening to cleave Democrats’ unified front as the White House makes the arcane procedural arguments the centerpiece of its impeachment defense.”\n\nHouse members get an earful from voters back home - Politico: “The ‘Make America Great Again’ hats were in the front row Thursday night at freshman Rep. Anthony Brindisi’s first town hall event since Speaker Nancy Pelosi blessed an impeachment inquiry against President Donald Trump. But for all the criticism the centrist Democrat faced from pro-Trump voters, the sharper questions came from his own supporters about why he is one of just seven in his caucus who has refused to endorse the impeachment push. … Swing-district Democrats doggedly avoided the impeachment debate when they first got to Washington. Now they can’t avoid it. … But at dozens of town halls over the two-week recess, Brindisi and other vulnerable freshmen had to fend for themselves — serving as the party’s on-the-ground voices on impeachment. Whether they can deliver a message that resonates could determine Democrats’ chances of winning over the public and holding on to their seats and the House majority in 2020.”\n\nIndependents’ support for impeachment jumps 10 points - NPR: “A slim majority of Americans now approve of the Democratic House-led impeachment inquiry into President Trump, a new NPR/PBS NewsHour/Marist poll finds. Fifty-two percent say they approve of the inquiry, while 43% disapprove. That's a slight increase in support from two weeks ago, when 49% approved and 46% disapproved. The numbers are in line with other polls that have been released this week also showing majority support or an increase in support for the inquiry. The uptick in support in the NPR poll comes mostly from a swing among independents. In late September, more independents disapproved of the inquiry than approved, by a 50-44% margin. Now, in a reversal, more independents approve of the inquiry than disapprove, by a 54-41% margin, a net change of 19 points. On the questions of whether Trump should be impeached or removed from office, Americans are split — 49-47% in favor of impeachment and 48-48% on whether the Senate should vote to remove him.”\n\nROMNEY STEPS UP HIS ROLE FOR GOP\nPolitico: “President Donald Trump wants to sideline Mitt Romney — but the Utah senator isn’t having it. Even as he faces a barrage of attacks from the president and his allies, Romney is mapping out plans to play a central role in 2020 — headlining party events, shelling out cash from his campaign war chest, and hitting up his donor network for vulnerable senators on the ballot next year.Later this month, Romney will take his most aggressive step yet to insert himself into the 2020 campaign when he hosts a New York City fundraiser for Maine Sen. Susan Collins, Colorado Sen. Cory Gardner and Michigan Senate hopeful John James. All are establishment-aligned figures confronting tough races in swing states. Behind the scenes, Romney’s team has also begun directing his donors to help GOP candidates in Senate battlegrounds. Romney aides say he's always intended to help in competitive Senate races and that his desire to do so has never been influenced by Trump’s efforts to ostracize him.”\n\nDems eye Chelsea Clinton for New York House seat - NYT: “Ms. [Nita] Lowey’s announcement set off a wave of speculation about other potential contenders, including Chelsea Clinton, the daughter of former President Bill Clinton and Hillary Clinton, as well as a state assemblyman, David Buchwald. Last year, when asked if she envisioned running for elected office, Chelsea Clinton told The Journal News, which covers the Hudson Valley, that ‘if someone were to step down or retire,’ she would ‘have to think if it’s the right choice for me.’ Ms. Clinton did not mention any particular office, although she is clearly familiar with Ms. Lowey’s district: Her parents’ house in Chappaqua, N.Y., is in the district. Ms. Clinton herself does not live in Westchester, but congressional candidates are not required to live in the district they represent. A representative for Ms. Clinton did not return a request for comment. Mr. Buchwald said he would make an announcement within a few days.”\n\nOcasio-Cortez draws credible primary challenger - Fox News: “A prominent New York City Democrat filed with the Federal Election Commission (FEC) Thursday to launch a primary challenge for the House of Representatives seat currently held by Rep. Alexandria Ocasio-Cortez, D.-N.Y. City Council member Fernando Cabrera said he believes a moderate Democrat such as himself could beat the socialist Ocasio-Cortez. He plans to target her far-left views and highlight his belief that she is a ‘no show’ in the district. ‘Only a Democrat is going to be able to defeat her, and it’s going to be a moderate Democrat,’ Cabrera, who represents a Bronx City Council district, told Politico. ‘She’s a no-show in the district. She hasn’t brought about anything except division within the party.’ ‘Socialism doesn’t work,’ Cabrera added.”\n\nPompeo ally steps aside in Kansas Senate race - The Wichita [Kan.] Eagle: “A Kansas business leader with longtime ties to Mike Pompeo will not run for U.S. Senate after weighing a bid for months — renewing speculation about whether the secretary of state will enter the race. Alan Cobb, the president and CEO of the Kansas Chamber of Commerce, in the past has said he would defer to Pompeo if the chief diplomat decided to mount a campaign. Cobb, a former Koch Industries lobbyist, advised Pompeo in 2014 during a congressional primary battle against former Rep. Todd Tiahrt. He made no mention of Pompeo in a lengthy statement Thursday announcing his decision. Cobb said that ‘after months of serious deliberation, analysis, and careful and prayerful consideration with friends, colleagues and my family, I have decided that the best place for me to pursue my passion is to remain as the President and CEO of the Kansas Chamber.’”\n\nPLAY-BY-PLAY\nIt was the foreign policy he promised, but Trump still pays price - NYT\n\nLocations and dates for 2020 general election debates announced Friday - CPD Judges rule in favor of House Dems seeking Trump’s tax returns - NYT\n\nRead this: The pen pal who changed a president - Narratively\n\nReese’s dominates Halloween candy favorites poll- Monmouth University\n\nAUDIBLE: YOU DO YOU\n\n“Well, I’m going to assume it’s a guy who said that… And I’m going to say, then just marry one woman. I’m cool with that. If you can find one.” – Sen. Elizabeth Warren’s answer during CNN’s Equality Town Hall on Thursday night, when asked what she would say to a supporter who believes marriage is between one man and one woman.\n\nANY GIVEN SUNDAY\n\nThis weekend Mr. Sunday will sit down with Sen. Chris Van Hollen, D-Md. Watch “Fox News Sunday with Chris Wallace.” Check local listings for broadcast times in your area.\n\n#mediabuzz - Host Howard Kurtz has the latest take on the week’s media coverage. Watch #mediabuzz Sundays at 11 a.m. ET. \n\nFROM THE BLEACHERS\n\n“I need your help. I don’t get what is going on with the Syria/Turkey situation. I understand the following: Trump has proclaimed that he is pulling troops from Syria after what has been a long involvement (partnering) with the Kurds. But, that doesn’t happen overnight, right? Once Trump announced the pulling of troops, Turkey is waiting on the sideline frothing at the chance to attack. They then attack, even with threats from Trump that they better not or there will once again be sanctions. Now the number of Kurds killed are rolling in, but are our troops still there? If they are, what are they doing? Is there something that Trump picked up on that is going on with the Kurds? The conspiracist side of me thinks he sniffed something out. My husband is an Iowa farmer and I work in crop insurance. We don’t have many ties to the military but sure understand how government a lot of the time just doesn’t make sense. Any insight would be appreciated.” – E’Lise Bracker, Underwood, Iowa\n\n\n[Ed. note: No conspiracy here, Ms. Bracker. The number of U.S. troops in the disputed area was very small – measured in dozens. They were not a credible threat in terms of actually combating Turkey’s forces but rather something of a marker. By having the troops there, we were telling the Turks to stay out and leave our Kurdish allies alone. It was a small-scale version of the U.S. forces in South Korea: To fight, the Turks would have had to kill Americans, thereby bring our military down on their heads. Upon the president’s order, the U.S. troops were quickly out of the Turks’ zone of aggression. The Americans went to Iraq and other U.S. spots in the region, clearing the way for the Turks to start pummeling their ancient Kurdish enemies.] \n\n\n“I am a huge fan of the Halftime Report and never miss it! Your struggle to remain fairly balanced is appreciated, especially by this reader who also struggles mightily to find truth and facts amid the bias and innuendo currently being passed off as ‘news.’  But I am confused by most of the polls' questions (especially the polls you quote) that seem to ask a compound question: Do you favor impeachment and removal of President Trump? I was under the impression that these are two distinct question.  That impeachment is like a grand jury investigation, i.e. a procedure (in the House) designed to decide whether there are grounds for a trial (by the Senate) to decide if removal is warranted or not. Am I wrong?  Please explain!  And keep up the good work!!!” – Tom Scherer, Udon Thani, Thailand\n\n\n[Ed. note: This is an excellent question, Mr. Scherer! Different pollsters do indeed ask these questions in different ways. The complexity of the situation is partly to blame. An “impeachment inquiry” is not a thing. It’s like a couple being “pre-engaged.” But some pollsters have been asking about it, which tends to screw things up. Getting respondents to differentiate between an “impeachment inquiry” and “impeachment” is quite a lot of hair-splitting for civilians. Our poll does it the right way (obvi) and asks whether voters support impeachment, impeachment and removal or no impeachment. Those are the three constitutional possibilities. In our poll, 4 percent of respondents said they wanted the president impeached but not removed. That adds up to 55 percent favoring impeachment and 51 percent favoring removal.]\n\n\n“All my teams have long gone home for the winter. So now we have your traditional Nine in the form of the quite surprising Cardinals playing your hometown Nationals (who should be the Senators and in the American League with Walter Johnson throwing flames, but oh, well). Where do your loyalties lie?” – Mary Carol Miller, Greenwood, Miss.\n\n\n[Ed. note: Hometown!? Washington, D.C.!? My place of residence, certainly. And I do love living here. But c’mon, Doc! My hometown is Wheeling, W.Va. and the Cardinals, whose order I lustily joined as a boy when my family moved to St. Louis for four years, are my baseball team. I admire the Nats’ pluck and am grateful for the chance they are affording me to watch the National League Championship Series in person. But I love the Cardinals and am absolutely over the moon with this year’s squad. What a bunch! The infield alone may be the greatest since my glory days of fandom in the mid-1980s. Matt Carpenter is an absolute rock for the team and the personification of professionalism, Paul DeJong is a clutch player (whoever heard of a slugger shortstop?) who seems like he was born to be a Cardinal, Kolten Wong surfs second base like the pros ride waves at Honoli’i in his hometown and Paul Goldschmidt has shown in his tenacity, play and quality of his character that he is truly in the right uniform. And Yadi is nothing less than a national treasure. So suffice it to say: Viva el Birdos!]        \n\n\n“How ‘bout them Redbirds! We miss you on Twitter where we could delight in the pure joy emanating from Cardinals gifs, memes, and tweets after a playoff series win…but the mailbag will have to do!” – Jack Whiteman, St. Louis\n\n\n[Ed. note: *fredbird waving giant flag gif*]\n\nShare your color commentary: Email us at HALFTIMEREPORT@FOXNEWS.COM and please make sure to include your name and hometown.\n\n‘THIS IS A NUDGE TO PICK UP THE FUDGE’\nAP: “Officials in a southwest Missouri city are planting small flags in piles of abandoned dog poop as part of a campaign to get residents to clean up after their pets downtown. The Police Department in Springfield, Mo., posted photos of the flags in use on its Facebook page Wednesday. The flags contain messages such as, ‘Is this your turd? ‘Cuz that's absurd’ and ‘This is a nudge to pick up the fudge.’ The campaign started this week and the department noted on Facebook that leaving behind a pet's mess in many cases violates a city ordinance. The city's Environmental Services said the flags are made of bamboo and recycled paper and downtown crews will pick them up if they have to clean up pet waste.”\n\nAND NOW, A WORD FROM CHARLES…\n\n“The whole debate arouses dismay, and not just because of the overreaching claims of both sides. One has an instinctive feeling that religion has a place in American public life, and that both sides misunderstand it—that between sectarianism and secularism lies something else.” – Charles Krauthammer (1950-2018) writing in the New Republic on April 9, 1984.  \n\nChris Stirewalt is the politics editor for Fox News. Brianna McClelland contributed to this report. Want FOX News Halftime Report in your inbox every day? Sign up here.", 
      "date": "7 hours ago"
    }, 
    {
      "subtitle": "Pompeo calls foul on NBA's China treatment", 
      "author": "Caleb Parke | Fox News", 
      "url": "https://www.foxnews.com/politics/pompeo-nba-china-usa-uighur-muslims", 
      "title": "Pompeo calls foul on NBA's China treatment", 
      "content": " Secretary of State Mike Pompeo went on offense against the National Basketball Association amid the continuing controversy surrounding the NBA and China. The country's highest diplomat told the American Association of Christian Counselors in Nashville, Tenn. he wished the NBA would call foul on China's human rights abuses. MAN WHO HAD PRO-HONG KONG SIGN CONFISCATED AT NBA GAME IN WASHINGTON SAYS LEAGUE IS 'AFRAID' OF CHINA “The Chinese Communist Party is detaining and abusing more than 1 million Uighur Muslims in internment camps in the Xinjiang region of China. The pages of George Orwell’s 1984 are coming to life there. I wish the NBA would acknowledge that,” Pompeo said Friday. The NBA's starts and coaches have been uncomfortable, unwilling or unable to discuss the pro-democracy protests in Hong Kong and mainland China's human rights abuses, and now the league is shutting down discussion altogether. STEVE KERR SAYS HE HASN'T BEEN ASKED ABOUT US 'HUMAN RIGHTS ABUSES' WHEN ASKED ABOUT CHINA The league announced Friday it will not hold any media availability for the rest of its Chinese jaunt, a day after Beijing prohibited any kind of news conference before or after a preseason exhibition game between the Los Angeles Lakers and the Brooklyn Nets. “We have decided not to hold media availability for our teams for the remainder of our trip in China,” the league said in a statement. “They have been placed into a complicated and unprecedented situation while abroad and we believe it would be unfair to ask them to address these matters in real-time.” The NBA made the decision independent of the Chinese government, ESPN reported. ANDREW YANG RIPS CHINESE GOVERNMENT'S 'RIDICULOUS' DECISION NOT TO BROADCAST NBA GAMES The tension between the league and China started earlier this week after Houston Rockets’ general manager Daryl Morey tweeted from his personal account a pro-Hong Kong message ahead of the Rockets' own preseason trip to Japan. The NBA has tried to do damage control but instead has only caused more outrage by appearing to abandon western values to placate China. CLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM The league took more heat Thursday after a Rockets official shut down a CNN reporter’s question --about the fallout from the tweet --to stars James Harden and Russell Westbrook. The league later apologized for the incident. Speaking on religious freedom, Pompeo also mentioned that more than 80 percent of the world lives in areas where religious freedom is suppressed or denied entirely. Fox News' Ryan Gaydos contributed to this report.", 
      "date": "7 hours ago"
    }, 
    {
      "subtitle": "Russian radio hosts prank Lindsey Graham into thinking he's on phone with Turkey's defense minister", 
      "author": "Sam Dorman | Fox News", 
      "url": "https://www.foxnews.com/politics/russian-pranksters-lindsey-graham-turkey", 
      "title": "Russian radio hosts prank Lindsey Graham into thinking he's on phone with Turkey's defense minister", 
      "content": " Sen. Lindsey Graham, R-S.C., became the latest high-ranking target of two notorious Russian pranksters who have been fooling politicians into thinking they're foreign officials. Alexey Stolyarov and Vladimir Kuznetsov, two radio hosts who also pranked House Intelligence Committee Chairman Adam Schiff, D-Calif., in 2018, managed to reach Graham by phone and successfully impersonate Turkey's defense minister. Graham relayed President Trump's diplomatic interests offered to the senator during a private conversation between the two. None of the information appeared to be sensitive enough to raise concerns. Audio of the call, first released by Politico, showed Graham repeatedly assuring the pranksters of Trump's interest in military and economic cooperation with Turkey -- specifically mentioning efforts towards a free trade agreement and restoring Turkey's position in a joint airstrike fighter program. \"The president told me to tell President Erdogan that he wants to turn the discussion to a free trade agreement,\" Graham said at one point during the conversation. He proceeded to offer to arrange a call between the two leaders about trade, something he hoped would strengthen relations as the threat of U.S. sanctions loomed over Turkey's decision to install a Russian missile defense system. TURKEY'S SYRIA ASSAULT TRIGGERS WAR WITHIN GOP, AS TRUMP BATTLES NEOCON WING Fox News was able to confirm the call with Graham's office. \"We have been successful in stopping many efforts to prank Senator Graham and the office, but this one slipped through the cracks,\" Kevin Bishop, Graham's communications director, said in a statement provided to Fox News. \"They got him.\" Graham serves on the Senate Foreign Relations Committee and has become a key figure in working the president on foreign policy. Initially opposed to Trump in 2016, Graham has become an outspoken supporter of Trump's approach to Israel and North Korea.  That August call came shortly before Trump caused an apparent rift with Graham by deciding to pull U.S. troops out of Syria in October. Graham and other Republicans have criticized that decision as a permission slip for Turkey to enter the war-torn nation and slaughter Kurdish allies with impunity. Despite their disagreement, Graham continued defending Trump against House Democrats accusing him of pressuring Ukraine's government to interfere in a foreign election. Trump aides have countered by suggesting that Schiff -- one of the chief Democrats pursuing the House's impeachment inquiry -- was willing to influence the 2020 election during a separate call with Russian pranksters. In a clip posted by Rep. Matt Gaetz, R-Fla., Schiff told the Russian pranksters that he would be willing to accept dirt on Trump from Ukraine. Stolyarov and Kuznetsov had posed as Andriy Parubiy, the former speaker of Ukraine's parliament, while offering recordings of a Russian journalist and Russian model discussing compromising information about Trump. CLICK HERE TO GET THE FOX NEWS APP Schiff and Graham weren't the only politicians to get tricked into believing they were talking to prominent politicians. The president himself spoke to comedian John Melendez, apparently thinking he was speaking with Sen. Bob Menendez, D-N.J. \"I find it astounding that the news media's not picking up the fact that I totally duped the president & got in touch... within in less than 2 hours while he was on Air Force One,\" Melendez tweeted in June of 2018.", 
      "date": "7 hours ago"
    }, 
    {
      "subtitle": "Ex-Ukraine ambassador speaks of ouster after ‘false claims,’ denies being ‘disloyal’ to Trump", 
      "author": "Adam Shaw | Fox News", 
      "url": "https://www.foxnews.com/politics/ex-ukraine-ambassador-unfounded-and-false-claims", 
      "title": "Ex-Ukraine ambassador speaks of ouster after ‘false claims,’ denies being ‘disloyal’ to Trump", 
      "content": " Marie Yovanovitch, the former U.S. ambassador to Ukraine, told lawmakers behind closed doors Friday that she was recalled earlier this year after “unfounded and false claims” against her, as well as continued pressure from President Trump on the State Department to remove her -- as she denied being “disloyal” to the president. “Although I understand that I served at the pleasure of the President, I was nevertheless incredulous that the U.S. government chose to remove an ambassador based, as best as I can tell, on unfounded and false claims by people with clearly questionable motives,” she said in a scathing account of the way she was removed from her post. TOP DIPLOMATS TO TESTIFY BEFORE CONGRESS DESPITE OPPOSITION FROM STATE DEPT., WHITE HOUSE Yovanovitch, who was recalled in May, spoke as part of House Democrats’ impeachment inquiry into Trump’s July 25 phone call between Trump and Ukrainian President Volodymyr Zelensky -- in which Trump asked the premier to “look into” the allegations about former Vice President Joe Biden’s conduct in the country. Trump, and his top attorney Rudy Giuliani, have focused on Biden’s pressuring of Ukraine to fire in 2016 a top prosecutor who had been looking into Ukrainian gas company Burisma Holdings, on whose board Biden’s son Hunter sat. The content of that call, revealed in a whistleblower complaint and a transcript also released by the White House, has led Democrats to launch an impeachment inquiry into the president’s conduct. In that call, Trump described Yovanovitch as “bad news.” Trump attorney Rudy Giuliani and other critics have accused her of working to undermine Trump’s interests in the region. But in her prepared remarks, obtained by Fox News, she denied asking any Ukrainian official to refrain from investigating corruption, and said it was “fictitious” that she was disloyal to the president. “I have heard the allegation in the media that I supposedly told the Embassy team to ignore the President’s orders ‘since he was going to be impeached.’ That allegation is false. I have never said such a thing, to my Embassy colleagues or to anyone else,” she said. She also denies that the Obama administration asked her to harm the Trump campaign, or to help Hillary Clinton’s campaign, and said that she has never met Hunter Biden. TWO GIULIANI ASSOCIATED LINKED TO UKRAINE INVESTIGATIONS INDICTED ON CAMPAIGN FINANCE CHARGES “And although I have met former Vice President Joe Biden several times over the course of our many years in government, neither he nor the previous Administration ever, directly or indirectly, raised the issue of either Burisma or Hunter Biden with me,” she said. As for Giuliani, she said she was in contact with him three times as she can recall, none related to the controversy at hand -- and said that she did not know Giuliani’s motives for going after her. “But individuals who may have been named in the press as contacts of Mr. Giuliani may well have believed that their personal financial ambitions were stymied by our anti-corruption policy in Ukraine,” she said. That remark appeared to refer to the two associates of Giuliani who have been linked to his investigations in Ukraine, and who were indicted for campaign finance violations after being stopped at Dulles International Airport in Virginia on Wednesday. Yovanovitch told lawmakers that she was told in April, just a month after her tour was extended a month before, to return “on the next plane.” She then recalled a conversation with Deputy Secretary of State John Sullivan, who she says told her Trump had lost confidence in her after a “concerted campaign” and that he had been pressuring the department to remove her since the summer of 2018. In her remarks, she said that the State Department had been attacked and hollowed out, and she predicted harm to the nation’s interests. “The harm will come when private interests circumvent professional diplomats for their own gain, not the public good,” she said. “The harm will come when bad actors in countries beyond Ukraine see how easy it is to use fiction and innuendo to manipulate our system.” Her statement revealed no new details about the circumstances surrounding Trump’s call with Zelensky about Biden. Trump has said he was investigating corruption, while Democrats have accused him of using U.S. military aid as a quid pro quo for an investigation into a political rival. On Friday, Democrats also accused the State Department of directing Yovanovitch not to appear before lawmakers. CLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM \"This is the latest example of the Administration’s efforts to conceal the facts from the American people and obstruct our lawful and constitutionally-authorized impeachment inquiry,\" Intelligence Committee Chairman Adam Schiff., D-Calif., Foreign Affairs Committee Chairman Eliot Engel, D-N.Y., and Oversight Committee Chairman Elijah Cummings, D-Md., said in a statement. Yovanovitch is not the only diplomat who will face lawmakers in the coming days. On Friday, E.U. Ambassador Gordon Sondland announced that he would comply with a subpoena and testify next week, despite objections from the State Department. Fox News' Mike Emanuel, Ronn Blitzer and Gregg Re contributed to this report.", 
      "date": "7 hours ago"
    }, 
    {
      "subtitle": "Judge blocks ‘public charge’ rule that would restrict green cards for immigrants on welfare", 
      "author": "Adam Shaw | Fox News", 
      "url": "https://www.foxnews.com/politics/federal-judge-blocks-public-charge-rule-limiting-green-cards-to-immigrants-on-welfare", 
      "title": "Judge blocks ‘public charge’ rule that would restrict green cards for immigrants on welfare", 
      "content": " A federal judge on Friday blocked a Trump administration rule that sought to strengthen the ability of federal officials to deny green cards to immigrants deemed likely to rely on government assistance -- the latest defeat for the administration's aggressive immigration policy in the courts. Judge George B. Daniels issued a preliminary nationwide injunction, stopping the rule from taking effect on Oct. 15. New York State Attorney General Letitia James, who was part of the lawsuit, along with New York City and the states of Vermont and Connecticut, welcomed the decision. TRUMP ADMINISTRATION BOOSTS ABILITY TO DENY GREEN CARDS TO IMMIGRANTS USING WELFARE PROGRAMS “Once again, the courts have thwarted the Trump administration’s attempts to enact rules that violate both our laws and our values, sending a loud and clear message that they cannot rewrite our story to meet their agenda,” James said in a statement. \"This rule would have had devastating impacts on all New Yorkers – citizens and noncitizens alike – and today’s decision is a critical step in our efforts to uphold the rule of law.” While a “public charge” inadmissibility standard has long been part of U.S. immigration law, it had not been formally defined by statute. The rule, announced by U.S. Immigration and Citizenship Services in August, would have defined a “public charge” as an immigrant who received one or more designated benefits for more than 12 months within a 36-month period. “The principle driving it is an old American value, and that’s self-sufficiency,” USCIS Acting Director Ken Cuccinelli told Fox News in an interview in August. “It’s a core principle -- the American Dream itself -- and it’s one of the things that distinguishes us, and it's central to the legal history in the U.S. back into the 1800s.” Those benefits that would be designated included Supplemental Security Income (SSI), Temporary Assistance for Needy Families (TANF), as well as most forms of Medicaid and the Supplemental Nutrition Assistance Program (SNAP), commonly known as food stamps. The rule expands the number of benefits that can be considered from interim guidance issued in 1999. ICE CHIEF WARNS COURT RULING BARRING DATABASE ACCESS ENDANGERS PUBLIC, RIPS 'JUDICIAL OVERREACH' But Judge Daniels' ruling said that the government had failed to provide a reasonable explanation for changing the definition of public charge. Daniels also objected to the government’s inclusion of English proficiency as a sign of self-sufficiency. “\"The United States of America has no official language. Many if not most, immigrants who arrived at these shores did not speak English,\" he wrote. He went on to claim that the definition has “no support in the history of U.S. immigration law” and described the rule as \"repugnant.\" \"The rule is simply a new agency policy of exclusion in search of justification. It is repugnant to the American Dream of the opportunity for prosperity and success through hard work and upward mobility,” he wrote. Cuccinelli responded to the ruling by predicting that the administration would ultimately prevail, arguing that \"an objective judiciary will see this rule lies squarely within long-held existing law.\" \"Longstanding federal law requires aliens to rely on their own capabilities and the resources of their families, sponsors, and private organizations in their communities to succeed,\" he said in a statement. \"The public charge regulation defines this law to ensure those seeking to come or stay in the U.S. can successfully support themselves financially and will not rely on public benefits as they seek opportunity here.\" CLICK HERE FOR  THE ALL-NEW FOXBUSINESS.COM The legal defeat is the latest in a series of setbacks for the administration on immigration policy -- where it has faced legal defeats on both legal and illegal immigration. Trump last week issued a presidential proclamation that would require immigrant visa applicants to prove that they have health insurance, or the financial means to cover reasonable health care costs. That proclamation, scheduled to go into effect Nov. 3, was also expected to be hit by a legal challenge. The moves by the administration have faced fierce opposition from immigrant activists, as well as many Democrats -- who have opposed measures to limit welfare for immigrants, while also calling for the extension of various forms of government aid to illegal immigrants as well. Fox News' Marta Dhanis contributed to this report.", 
      "date": "5 hours ago"
    }, 
    {
      "subtitle": "2020 Dems aren’t going far enough to address California homeless crisis, advocates claim", 
      "author": "Andrew Craft | Fox News", 
      "url": "https://www.foxnews.com/politics/democracy-2020-dems-debate-ca-homelessness-crisis", 
      "title": "2020 Dems aren’t going far enough to address California homeless crisis, advocates claim", 
      "content": " LOS ANGELES -- Many of the 2020 Democratic presidential candidates are calling for sweeping affordable housing plans to address the chronic issue of homelessness, but advocates on the ground who see the issue up close say it doesn’t go far enough and they wish candidates would assign it more urgency. Homelessness in Los Angeles County and across Western states is skyrocketing. In 2019 so far, the number of homeless residents in Los Angeles has risen 12 percent from 2018, according to county statistics. “We need a FEMA-like, Red Cross-like, National Guard-like [solution],\" said Rev. Andy Bales, the CEO of L.A.’s largest homeless shelter, Union Rescue Mission. \"Army Corps of Engineers needs to come and we need to figure out immediately how to get 44,000 people off the streets.\" Candidate plans that are more forward-looking, like five to 10 years down the road with millions of dollars in investment in affordable housing units, can be good in theory and are necessary, these advocates say, but don’t address “chronic” homelessness, or those who have lived out on the streets for six months or more in the past year. HOMELESS MAN RANDOMLY PICKS UP 6-YEAR-OLD, SLAMS HIM ON CONCRETE: REPORT “We’ve been doing $600,000 to $700,000 per person, per unit, and it’s planned over the next 10 years and that will not get it done,” Bales says. He added that only one candidate has reached out to him on how to remedy the situation. Former Housing and Urban Development Secretary under President Obama Julian Castro and Beto O’ Rourke have actually visited homeless encampments on Skid Row, a notoriously expansive homeless encampment in downtown Los Angeles. O’Rourke released a plan this week similar to Castro’s and Sen. Bernie Sanders’ plans, saying he wants to triple funding for homeless assistance grants through HUD providing $50 billion over the next 10 years, fully funding housing choice vouchers, capping rent increases, and pumping investment in dilapidated public housing units. But for those who study the issue of homelessness, they say the problem should be coming up more in candidate rhetoric and dialogue as they campaign. It’s not so much to just have a job to maintain housing, they say, because rent prices have become so unsustainable. “I think it’s becoming an intractable issue because we don’t have the investment and broader solutions to homelessness, which is why I think many of the presidential candidates are focused on affordable housing….it’s still something that’s just emerging and most of the candidates have not yet addressed,\" said Christopher Herring, a UCLA PhD student. Herring said affordable housing is the main way to go, but there needs to be more steps done to prevent people from becoming homeless in the first place and notes that with Castro and Sanders’ plans, respectively, much of the dollar figures they’re proposing will be spent quickly and frivolously unless backed up by creating and maintaining affordable housing quickly and cost-efficiently. \"To put it another way, that expansion of the billions of dollars for homelessness in Castro and Sanders plans will be pissed away quickly and a waste of taxpayer money if not backed up by more robust structural reform in the production and preservation of affordable housing.\" TOMI LAHREN: CA DEMOCRATS IGNORING HOMELESS 'EPIDEMIC' IN FAVOR OF TRUMP IMPEACHMENT PUSH California’s Democratic primary will be early in 2020, moving up to March from June, making the state in play again for candidates vying for the nomination with 500 delegates up for grabs. Voters in the state have homelessness high on their list of issues. Some in Los Angeles county say it even trumps traffic and the environment in what needs to be fixed first in the city. But ultimately, homeless people have very little, if any political power as a constituency, which could be why voters haven’t heard about the problem in states other than California. “For the most part, the people who are experiencing homelessness are not voting, at least they’re not voting en masse, they don’t have a strong political voice, they don’t have political champions, and elected officials who are sensitive to what their constituents want or else they’re going to get voted out of office, it’s not a constituency they have to pay a lot of attention to,” said Adam Murray, executive director of LA’s Inner City Law Center. California senator and presidential candidate Kamala Harris is supporting a bill in the Senate to provide $13 billion in emergency relief to areas affected by chronic homelessness over the next five years. But Republicans are unlikely to bring it up for a vote, citing the huge price tag. Harris has blamed the Trump administration for cutting off funding to support what local government needs around affordable housing. President Trump, on the other hand, has spoken about the issue on Twitter and at his rallies numerous times, largely in irreverent tones. At a rally in Cincinnati in August, he said, \"What they are doing to our beautiful California is a disgrace to our country...It's a shame. The world is looking at it. Look at Los Angeles with the tents and the horrible, horrible conditions. Look at San Francisco, look at some of your other cities.\" Herring says California needs a federal response like what Trump is suggesting, saying, \"Trump has drawn attention to this and it’s woken up the Democratic candidates to putting forward and putting pressure on them to make real solutions.”", 
      "date": "5 hours ago"
    }, 
    {
      "subtitle": "Appeals court blocks Ohio ban on Down syndrome abortions", 
      "author": "Morgan Phillips | Fox News", 
      "url": "https://www.foxnews.com/politics/ohio-down-syndrome-abortion-ban-federal-appeals-court", 
      "title": "Appeals court blocks Ohio ban on Down syndrome abortions", 
      "content": " A divided federal appeals court panel ruled Friday that Ohio cannot enforce a 2017 law banning abortions when medical tests show the baby has Down syndrome. The 6th Circuit Court of Appeals in Cincinnati upheld a preliminary injunction saying that the law was invalid because it had the purpose and effect of preventing some women from obtaining pre-viability abortions, which violates Supreme Court precedents. Signed into law by then-Gov. John Kasich in 2017, the measure imposed criminal penalties on doctors who perform abortions after learning of a fetal diagnosis of Down syndrome. In February 2018, the American Civil Liberties Union of Ohio filed suit to block the law from taking effect. One month later, U.S. District Court Judge Timothy S. Black halted the law, saying it violated a woman’s right to privacy. TRUMP TO NAME STATE DEPT. OFFICIAL JOHN SULLIVAN AS NEXT AMBASSADOR TO RUSSIA On Friday the panel of three judges upheld Black’s ruling in a 2-1 decision. A spokesman for Republican Attorney General Dave Yost said the state will ask the full 6th Circuit to review the case, according to Reuters. A large majority of the 6th Circuit court's members were appointed by Republican presidents, but Friday's majority consisted of Democratic appointees. \"The state’s interest in preventing discrimination does not become compelling until viability,\" wrote Circuit Judge Bernice Bouie Donald, appointed by the Obama administration. Circuit Judge Alice Moore Batchelder, appointed by former President George H.W. Bush, dissented. “Ohio concluded that permitting physicians to become witting accomplices to the deliberate targeting of Down syndrome babies would undermine the principle that the Down syndrome population is equal in value and dignity to the rest of Ohio’s population,\" Batchelder wrote, according to Cincinnati.com. BETO THREATENS TAX-EXEMPT STATUS OF CHURCHES IF THEY DON'T SUPPORT GAY MARRIAGE Batchelder, quoting a May opinion from Supreme Court Justice Clarence Thomas, added that states have a “compelling interest in preventing abortion from becoming a tool of modern-day eugenics.” Under the law, doctors could have received up to 18 months in prison for performing abortions with the knowledge that the mother had based her decision in part on a prenatal diagnosis of Down syndrome. CLICK HERE TO GET THE FOX NEWS APP The Down syndrome bill was the latest Ohio abortion law to receive a setback from the courts. In July, a federal judge blocked Ohio from enforcing a fetal “heartbeat” law banning abortions after a heartbeat was detected, or six weeks at the earliest. A ban on abortions by dilation and evacuation, a surgical procedure most commonly used in second-trimester abortions, has also been challenged in court.", 
      "date": "5 hours ago"
    }, 
    {
      "subtitle": "Notre Dame, University of Michigan, Belmont University to host 2020 presidential debates", 
      "author": "Vandana Rambaran | Fox News", 
      "url": "https://www.foxnews.com/politics/2020-presidential-debate-schedule-vice-presidential-debate-schedule", 
      "title": "Notre Dame, University of Michigan, Belmont University to host 2020 presidential debates", 
      "content": " The dates and locations for three presidential debates and one vice presidential debate have been set and their locations were revealed Friday by the Commission on Presidential Debates, a nonprofit that has organized the general-election presidential and vice-presidential faceoffs for more than 30 years. The first presidential debate will be held at the University of Notre Dame in South Bend, Ind. on Sept. 29, 2020. The second debate will be held at the University of Michigan in Ann Arbor on Oct. 15, 2020. The third debate will take place at Belmont University in Nashville, Tenn. on Oct. 22, 2020. BULLOCK, LONG-SHOT 2020 DEM, INSISTS NOMINATION 'WON'T BE DECIDED BY DEBATES' The University of Utah in Salt Lake City will host the vice presidential debate on Oct. 7, 2020. Each debate will begin at 9 p.m. ET and run for 90 minutes without commercial breaks, the Commission announced. Further details, including debate formats and moderators, have not yet been disclosed. Historically, the debates are aired by all of the major broadcast networks, drawing millions of viewers each night. PROTEST OUTSIDE TRUMP RALLY IN MINNEAPOLIS 'SICKENS MY STOMACH,' GOP SENATOR SAYS The Commission, which was established in 1987 and is not sponsored by the government nor by either political party, began soliciting bids from groups interested in hosting the 2020 debates about two years in advance of the election. Host criteria included having a debate hall measuring at least 15,000 square feet with air conditioning, parking lots with space for at least 40 television remote trucks, trailers and satellite trucks up to 53 feet in length, a guarantee of the complete city services, including public safety personnel, and a financial contribution. The CPD said it received bids from six separate groups to host a debate. Hartford, Conn. and Creighton University in Omaha, Neb., put in bids but were not selected to host a debate. Eligible presidential candidates and their running mates will be invited to participate in the scheduled debates after Labor Day 2020. CLICK HERE FOR THE FOX NEWS APP According to pre-determined criteria, \"candidates must appear on a sufficient number of state ballots to have a mathematical chance of winning a majority vote in the Electoral College,\" and also have at least 15 percent of the national electorate based on polling averages from \"five selected national public opinion polling organizations\" that are selected based on \"the quality of the methodology employed, the reputation of the polling organizations and the frequency of the polling conducted.\" “We concluded that the CPD serves its voter education mission best when, in the final weeks of the campaign, based on pre-established, published, objective and transparent criteria, it identifies those individuals whose public support places them among the leading candidates and invites them to debate the issues of the day,\" CPD co-chair Dorothy Ridings said in a statement. \"We also concluded that the best available measure of public support is high-quality public opinion polling conducted near the time of the debates.\"", 
      "date": "5 hours ago"
    }, 
    {
      "subtitle": "California adopts nation's broadest gun seizure laws", 
      "author": "Melissa Leon | Fox News", 
      "url": "https://www.foxnews.com/politics/california-expands-gun-seizure-law", 
      "title": "California adopts nation's broadest gun seizure laws", 
      "content": " California Democratic Gov. Gavin Newsom signed 15 gun-related bills into law Friday, tightening the state's already-stringent Second Amendment restrictions. One of the bills, which expands a so-called \"red flag\" law to allow co-workers, employers and educators to seek gun violence restraining orders against firearms owners they fear are a danger to themselves and others, was vetoed twice by Newsom's predecessor, Jerry Brown. Newsom also signed a companion bill allowing the gun violence restraining orders to last one and five years, although the gun owners could petition to end those restrictions earlier. The bill also allows judges to issue search warrants at the same time as they grant the orders. The warrants can be used immediately if the gun owners are served with the relinquishment orders but fail to turn over the firearms or ammunition. \"California has outperformed the rest of the nation, because of our gun safety laws, in reducing the gun murder rate substantially compared to the national reduction,\" Newsom said as he signed the measures surrounded by state lawmakers. \"No state does it as well or comprehensively as the state of California, and we still have a long way to go.\" Between 1993 and 2017, the latest available, there was a 62 percent decline in the gun murder rate in California, nearly double the 34 percent nationally, Newsom said. Co-workers who want to request a gun violence restraining order will have to have \"substantial and regular interactions\" with gun owners, and co-workers and school employees will need to get approval from their employers or school administrators before seeking a restraining order. Those seeking the orders will be required to file sworn statements detailing their reasons for doing so. BIDEN WANTS TO GIVE ASSAULT WEAPON OWNERS TWO OPTIONS: SELL YOUR GUNS TO THE FEDS OR REGISTER The American Civil Liberties Union (ACLU) opposed the bill, saying it \"poses a significant threat to civil liberties\" because a restraining order can be sought before a gun owner has an opportunity to dispute the request. Additionally, those making a request under the new law may \"lack the relationship or skills required to make an appropriate assessment,\" the ACLU said. The bill's author, Democratic Assemblyman Phil Ting of San Francisco, cited a recent study finding that gun restraining order laws may have helped prevent 21 mass shootings, though the University of California, Davis, researchers cautioned that \"it is impossible to know whether violence would have occurred.\" The National Rifle Association (NRA) and its state affiliate, the California Rifle and Pistol Association, opposed the new restrictions, according to the Los Angeles Times. The laws will take effect Jan. 1, 2020. GAVIN NEWSOM PREDICTS THE GOP WILL DEVELOP INTO A THIRD PARTY: 'THEY ARE FINISHED' The Democratic governor also signed a law that will limit Californians to purchasing one long rifle per month, according to The Sacramento Bee. This law expands the current legislation that applies to handguns, and it will prevent people under 21 from purchasing semi-automatic rifles and other similar firearms. The collective measures \"tweak\" the state's current laws and \"improve implementation,\" according to Amanda Wilcox, spokeswoman for the Brady Campaign to Prevent Gun Violence. Ting also has a companion bill that would allow gun owners starting next September who are the subjects of restraining order requests to file a form with the court saying they won't contest the requests and are surrendering their firearms. Under current law, even those who agree to give up their guns must go through a court hearing, which Ting says wastes time and resources. CLICK HERE FOR THE FOX NEWS APP The Associated Press contributed to this report.", 
      "date": "4 hours ago"
    }, 
    {
      "subtitle": "California governor signs measure requiring universities to provide abortion meds", 
      "author": "Morgan Phillips | Fox News", 
      "url": "https://www.foxnews.com/politics/california-governor-signs-measure-requiring-universities-to-provide-abortion-meds", 
      "title": "California governor signs measure requiring universities to provide abortion meds", 
      "content": " California Gov. Gavin Newsom on Friday made his state the first to require public universities to offer abortion medication at campus health centers, beginning in 2023. Newsom contrasted the progressive goals of his new law with restrictions recently enacted in other states. “As other states and the federal government go backward, restricting reproductive freedom, in California we are moving forward, expanding access and reaffirming a woman’s right [to] choose,” Newsom said, according to The Sacramento Bee. “We’re removing barriers to reproductive health – increasing access on college campuses and using technology to modernize how patients interact with providers.” A number of states -- including Alabama, Kentucky, Missouri, Ohio, Mississippi and Georgia -- have in recent months enacted such abortion restrictions as banning the procedure after six weeks, when a heartbeat has been detected. A number of the restrictions have been challenged in court. Newsom’s predecessor, fellow Democrat Jerry Brown, vetoed similar legislation last year, arguing such a requirement wasn’t necessary since abortion services were readily available off-campus. TERMINALLY ILL GROOM'S BUCKET LIST WEDDING TURNS OUT 'ABSOLUTELY INCREDIBLE' Democratic State Sen. Connie Leyva first crafted the legislation three years ago. “I am thrilled that Governor Newsom rejected the misguided paths that other states have taken in limiting access to abortion care,” Leyva said in a statement. “Abortion is a protected right, and it is important that everyone — including college students — have access to that right if they so choose.” The law will rely on private donations, not state dollars, to pay for the services. The state hopes to raise more than $10 million. APPEALS COURT BLOCKS OHIO BAN ON DOWN SYNDROME ABORTIONS Abortion medication is available to women who are less than 10 weeks' pregnant and requires taking two pills. The first pill blocks the hormone progesterone. The second, taken days later at home, causes an effect similar to a miscarriage. All 34 of California’s public colleges would be required to provide the services. Religious and conservative groups objected to the legislation. “We oppose any effort to make it easier to abort a baby before he or she is born,” Rudra Reddy, external vice president for the Berkeley College Republicans, told The Sacramento Bee. “Newsom is opposed to the moratorium on the death penalty in California but he’s perfectly fine executing unborn children.” \"Governor Newsom’s reckless support for a new abortion pill distribution scheme on California college and university campuses will put students’ lives at risk and put schools at risk of lawsuits as conscience rights are violated,\" Students for Life of America president Kristan Hawkins said in a statement. \"The Pro-Life Generation will not sit back and watch their college and university campuses be turned into Planned Parenthood’s new money-making machine.\" Republicans voted against the measure in committee hearings. A handful of Assembly Democrats abstained during floor debates. CLICK HERE TO GET THE FOX NEWS APP The Department of Finance, under Newsom’s office, also opposed the bill, citing a lack of resources, personnel expertise and private funds to support a program of such “size, scope or content.” The Associated Press contributed to this report.", 
      "date": "3 hours ago"
    }, 
    {
      "subtitle": "Nancy Pelosi says Trump's rally comments about Biden 'beyond the pale,' rips Senate Republicans' 'cowardice' on impeachment inquiry", 
      "author": "Liam Quinn | Fox News", 
      "url": "https://www.foxnews.com/politics/nancy-pelosi-says-trump-rally-comments-about-biden-beyond-the-pale-rips-senate-republicans-cowardice-on-impeachment-inquiry", 
      "title": "Nancy Pelosi says Trump's rally comments about Biden 'beyond the pale,' rips Senate Republicans' 'cowardice' on impeachment inquiry", 
      "content": " Nancy Pelosi wants someone to think of the children. House Speaker Pelosi, D-Calif., blasted President Trump during a caucus call on Friday for his latest crude attack on former Vice President Joe Biden, accusing him of having become a “potty mouth” -- before labeling the president “disgraceful.” “One thing, I do want to say is that, POTUS – you know, that’s the President – POTUS has become a potty mouth and children are listening,” Pelosi said. “This is – this is beyond disgraceful.” WHITE HOUSE ANNOUNCES IT WILL NOT COMPLY WITH 'ILLEGITIMATE AND UNCONSTITUTIONAL' IMPEACHMENT INQUIRY She then defended Biden -- her party’s potential 2020 presidential nominee -- after Trump ramped up his attacks on the former vice president during a raucous rally in Minnesota on Thursday night. During the rally, the president launched into a mock interview with Hunter, Biden's son, whom Trump called \"not too smart.\" \"Hunter, you know nothing about energy, you know nothing about China, you know nothing about anything, frankly. Hunter, you're a loser,\" Trump said, his voice rising. \"Your father was never considered smart, he was never considered a good senator -- he was only a good vice president because he understood how to kiss Barack Obama's a--.\" During Friday’s call, Pelosi said: “For him to say the thing that he said about Joe Biden last night was so far beyond the pale.” TRUMP BELITTLES BIDENS WITH GRAPHIC LANGUAGE AT MINNEAPOLIS RALLY She then turned her attention to the ongoing impeachment inquiry -- and how the “facts” of that should not stop anyone from making some of Trump’s other behavior into an election issue. “That is about elections, and I will make my final point,” she said. “What we are doing on impeachment is about the facts -- ‘Just the facts, ma’am’ -- and the Constitution.  His policy, his personality, his potty mouth, that’s about the election, and let’s make sure that we understand the reasons he is – the inquiry is because he has not honored his oath of office.  We will honor ours.” Pelosi then called Republicans in the Senate cowardly and said the impeachment inquiry is about saving the Constitution. WHISTLEBLOWER ATTORNEY ADMITS CLIENT HAD CONTACT WITH PRESIDENTIAL CANDIDATES, AS LAWYER'S ANTI-TRUMP BIAS SURFACES “The Senate is saying, ‘Now that you are doing that, we are not doing it.’  You know, just because we have the courage to honor our oath of office doesn’t mean we have to fold to the cowardice of the Senate that is not going to honor theirs,” she said. “The whole point of this inquiry is to save the Constitution of the United States.  The subpoena is the oversight that Congress has as a separation of powers – political branches of government have checks and balances on each other. “I’ve said before: Trump, himself, is not worthy of impeachment because it’s divisive in the country.  But our Constitution is worth it. Our democracy is worth it. And, our republic, if we can save it, is worth it.” Pelosi’s remarks came after the White House outlined in a defiant eight-page letter to the House Speaker and top Democrats on Tuesday why it will not participate in their “illegitimate and unconstitutional” impeachment inquiry, charging that the proceedings have run roughshod over congressional norms and the president's due-process rights. Trump administration officials called the letter, which was written by White House Counsel Pat Cipollone and obtained by Fox News, perhaps the most historic letter the White House has sent. The document tees up a head-on collision with Democrats in Congress, who have fired off a slew of subpoenas in recent days concerning the president's alleged effort to get Ukraine to investigate political foe Joe Biden during a July phone call with Ukraine's leader. CLICK HERE TO GET THE FOX NEWS APP Pelosi said: \"This letter is manifestly wrong, and is simply another unlawful attempt to hide the facts of the Trump administration’s brazen efforts to pressure foreign powers to intervene in the 2020 elections. ... The White House should be warned that continued efforts to hide the truth of the president’s abuse of power from the American people will be regarded as further evidence of obstruction. Mr. President, you are not above the law.  You will be held accountable.” Fox News' Chad Pergram, Gregg Re, and John Roberts contributed to this report.", 
      "date": "2 hours ago"
    }, 
    {
      "subtitle": "Ex-GOP congressman says he'll donate contributions from arrested Giuliani associates", 
      "author": "Vandana Rambaran | Fox News", 
      "url": "https://www.foxnews.com/politics/pete-sessions-lev-parnas-igor-fruman-contributions-donated", 
      "title": "Ex-GOP congressman says he'll donate contributions from arrested Giuliani associates", 
      "content": " A former Texas congressman who received at least $20,000 in campaign contributions from two associates of Rudy Giuliani who were arrested Thursday for campaign finance violations, has said he will donate the funds to local charities. \"Yesterday, I learned that two contributors to my 2018 campaign are being charged for not following campaign contribution laws,\" Pete Sessions said in a statement Friday. \"Their deception cannot, and should not, be tolerated. Therefore, I am contributing the amount of their contributions to charities that serve abused women and children and the elderly in Central Texas.\" TWO GIULIANI ASSOCIATES LINKED TO UKRAINE INVESTIGATIONS INDICTED ON CAMPAIGN FINANCE CHARGES Federal prosecutors say that one of the arrested men, Lev Parnas, urged an unidentified congressman to seek the ouster of U.S. Ambassador to Ukraine Marie Yovanovich at the behest of Ukrainian government officials. That happened about the same time that Parnas and his co-defendant Igor Fruman committed to raising more than $20,000 for the politician. An indictment against Parnas and Fruman filed in the Southern District of New York does not accuse Sessions of wrongdoing or mention him by name, simply referring to the person as \"Congressman 1.\" But donations made by Parnas and Fruman match campaign finance reports for Sessions. Sessions, who served in the House of Representatives for 11 terms before losing his seat to Democrat Colin Allred in 2018, announced recently that he will be throwing his hat in the ring for Texas' 17th congressional district seat after GOP incumbent Rep. Bill Flores announced he'd be retiring ahead of the 2020 election cycle. Parnas and Fruman's shell company Global Energy Producers (GEP) allegedly contributed $325,000 and $15,000 to separate committees in May 2018, “to obtain access to exclusive political events and gain influence with politicians,” the indictment says. They allegedly incorporated GEP around the time the contributions were made. CLICK HERE FOR THE FOX NEWS APP According to FEC records, GEP contributed $325,000 in May 2018 to pro-Trump super PAC America First Action. In a statement, a spokesperson for America First Action noted that a complaint was filed with the Federal Election Commission (FEC) in July 2018 over this contribution in addition to separate litigation in Florida. The statement said that the money was placed \"in a segregated bank account,\" was not used, and \"will remain in this segregated account until these matters are resolved. Fox News' Ronn Blitzer contributed to this report.", 
      "date": "1 hour ago"
    }, 
    {
      "subtitle": "Trump travels to Louisiana, holds second campaign rally in two nights", 
      "author": "Vandana Rambaran | Fox News", 
      "url": "https://www.foxnews.com/politics/trump-to-hold-campaign-rally-in-louisiana-second-in-two-nights", 
      "title": "Trump travels to Louisiana, holds second campaign rally in two nights", 
      "content": " President Donald Trump held a second campaign rally in as many nights Friday, this time taking the stage in Louisiana in the hope of rallying Republican voters against the state's Democratic Gov. John Bel Edwards. \"Tomorrow you will head to the polls and vote to replace a liberal democrat who has sold you out, John Bell Edwards, with a great Republican governor,\" Trump said in his opening remarks. The president is expected to be joined onstage in Lake Charles by both U.S. Rep. Ralph Abraham and businessman Eddie Rispone, but not endorse either candidate in order to maximize chances that Edwards will fall below the 50 percent vote threshold needed to avoid a runoff in Saturday's gubernatorial \"jungle primary,\" in which all the candidates appear on a single ballot. The president's trip to Louisiana comes one day after another fiery rally in Minneapolis, Minn., during which Trump slammed House Democrats who have launched an impeachment inquiry against him. Trump slammed the \"rage-filled Democrat party that has gone completely insane\" accusing them of waging a \"nonstop battle\" to \"overthrow\" his presidency. He also went after Joe and Hunter Biden over their Ukrainian business dealings for the second night in a row, accusing the media of covering up potential Biden corruption and claiming that claims against the pair are \"unsubstantiated.\" Other top Republicans, including Vice President Pence and Donald Trump Jr. have paid visits to the state, which Trump won by nearly 20 percentage points in 2016. Neither Abraham nor Rispone has been able to break away as the top competitor, even as Rispone poured $11 million of his own personal wealth into the campaign. Party leaders' efforts to keep the men from fighting each other have failed, raising concerns the backbiting could wound both GOP contenders and help Edwards. Republicans blame attacks among their own candidates for helping to elect Edwards four years ago. Edwards isn't the type of liberal, anti-Trump Democrat with whom the president usually clashes. Louisiana's governor is an anti-abortion, pro-gun West Point graduate who avoids criticizing Trump, talks about his strong rapport with the White House and calls the impeachment inquiry a distraction for Washington. While Edwards' efforts to keep the president at bay in the governor's race have been unsuccessful, the Democratic incumbent isn't complaining about the rallies. Instead, he has downplayed them, calling it unsurprising that Trump backs members of his own party in the \"hyperpartisan\" environment of Washington. He said he would continue to \"work well\" with the president and focus on his own, bipartisan approach to governing. CLICK HERE FOR THE FOX NEWS APP \"When my opponents realized just how much support my campaign had from the people of Louisiana, they started calling in help from forces in Washington, D.C.,\" Edwards said. \"My opponents are obsessed with political partisanship because the only way they think they can win is to divide the state of Louisiana.\" Republicans nationally have targeted Edwards for ouster since his longshot election victory four years ago. But work to unify around one major contender failed, with the state's top-tier, well-known GOP officials passing on the race. The Associated Press contributed to this report.", 
      "date": "41 mins ago"
    }, 
    {
      "subtitle": "Trump announces acting Homeland Security Secretary McAleenan to leave post", 
      "author": "Samuel Chamberlain | Fox News", 
      "url": "https://www.foxnews.com/politics/trump-announces-acting-homeland-security-secretary-mcaleenan-to-leave-post", 
      "title": "Trump announces acting Homeland Security Secretary McAleenan to leave post", 
      "content": " Acting Homeland Security Secretary Kevin McAleenan is stepping down from that position, President Trump announced Friday night. \"Kevin now, after many years in Government, wants to spend more time with his family and go to the private sector,\" Trump tweeted shortly before taking the stage at a rally in Lake Charles, La. \"Congratulations Kevin, on a job well done!\" The president added that the new acting homeland security secretary would be announced next week and said he had \"Many wonderful candidates\" to fill the position. McAleenan issued a statement Friday night following the president's announcement, thanking him for \"the opportunity to serve alongside the men and women of the Department of Homeland Security.\" \"With his [Trump's] support, over the last six months we have made tremendous progress mitigating the border security and humanitarian crisis we faced this year, by reducing unlawful crossings, partnering with governments in the region to counter human smugglers and [addressing] the causes of migration, and [deploying] additional border security resources,\" he said. McAleenan took over in April after Secretary Kirstjen Nielsen quit, and he was the fourth person to lead the department in two years. Trump hasn't named anyone to the job yet -- the acting deputy is David Pekoske, the head of the Transportation Security Administration. McAleenan, a longtime U.S. Customs and Border Protection official, was seen as a level head who could effectively manage the border crisis, but like many other former administration officials who came before, Trump eventually soured on him. The 240,000-person department is tasked with election security and cybersecurity, disaster response and even the Secret Service. But for Trump, the Department of Homeland Security means one thing: immigration. The president's signature issue makes the department his focus and his ire. Balancing a White House eager to push major changes with the reality on the ground is a constant challenge. On Monday, McAleenan was shouted off stage during a speaking engagement at Georgetown Law School by audience members protesting the Trump administration’s policies on immigration. He told \"Fox & Friends\" that \"part of the irony here is that this is supposed to be a group of immigration law experts who wanted to hear the facts of what's happening on the border. The facts of what's broken about our immigration system.\" \"I was going to challenge them on how we could talk and start a dialogue about how to fix it,\" McAleenan said. \"But, apparently [I] didn't get that opportunity.\" When it was clear that Georgetown Law Center was \"not going to change that direction of that dialogue,\" McAleenan realized it was \"time to go.\" CLICK HERE TO GET THE FOX NEWS APP The Law Center released a statement sharing McAleenan's regret and said: \"Georgetown is deeply committed to freedom of speech and expression.\" McAleenan had said the border crisis was at its \"breaking point\" during a visit to Texas in March, reiterating there were not enough agents to respond. Before serving in government, McAleenan practiced law in California. He attended Amherst College in Massachusetts and holds his law degree from the University of Chicago. Fox News' Melissa Leon and Frank Miles contributed to this report.", 
      "date": "1 hour ago"
    }
  ]
}