{
  "articles": [
    {
      "subtitle": "The regulation that was too weak to stop the Flint water crisis is getting some mild improvements — but lead pipes can stay.", 
      "author": "Arthur Delaney", 
      "url": "https://www.huffpost.com/entry/epa-drinking-water_n_5d9f8db8e4b087efdbaac243", 
      "title": "Lead Pipes Are Safe From The EPA’s New Drinking Water Rule", 
      "content": " City water systems face stricter standards under a new regulation from the Environmental Protection Agency, but they still won’t have to replace lead pipes. Utilities will have to do a better job of testing for lead in people’s drinking water, according to the updated version of the Lead and Copper Rule ― the same regulation that failed to stop the water crisis in Flint, Michigan, in 2014. Bad water treatment decisions spiked the city’s water with lead that year, resulting in confirmed higher lead levels in Flint children. The government didn’t admit the crisis until late in 2015. The new regulation has found some critics. “The Trump administration’s new Lead and Copper Rule is a step backwards and a slap in the face to the children in Flint,” Rep. Dan Kildee (D-Mich.) said in a statement. Lead is a brain-damaging neurotoxin. It also happens to be a pliable metal that is handy for making pipes. It has been mostly banned from use in plumbing materials, but millions of buildings across the country still get water from old lead service lines that could last for decades more. In recent years, public health experts have learned that even tiny amounts of exposure can be dangerous. Many water regulation experts say the only way to make sure drinking water is safe from lead is to force cities to get rid of their lead pipes altogether. But digging up lead pipes is expensive. Flint has only done so thanks partly to a $100 million infusion from the federal government in the wake of the crisis. In a draft of its proposed regulation, the EPA said that “due to the financial and practical challenges of wide-spread replacement of lead pipes around the country, it is important to use our nation’s resources wisely, and thus target actions where they are most needed and can provide the most good.” Instead of replacing pipes, both the current and proposed new rule tell cities to add chemicals to their drinking water to make it less corrosive and form a protective coating on the inside of service lines. The new regulation will make more cities conduct corrosion control testing. It would also require cities to take an inventory of their pipes, since many were laid so long ago utilities aren’t even sure where they are. And for the first time the rule will require utilities to check for lead in schools and daycares, which have been exempt even though children’s brains are more vulnerable to lead exposure than adults. “Today, the Trump administration is delivering on its commitment to ensure all Americans have access to clean drinking water by proposing the first major overhaul of the Lead and Copper Rule in over two decades,” EPA administrator Andrew Wheeler said in a statement Thursday. Under the current rule, utilities have to replace 7% of their lead pipes annually if samples taken from people’s taps exceeds a certain threshold. The new rule would require them to replace only 3% of pipes annually if they exceed the threshold ― which isn’t getting stricter. Marc Edwards, a Virginia Tech civil engineering professor who worked with Flint residents to blow the whistle on the city’s water lead, said he thought the relaxed standard might actually lead to a better outcome. “Doing 7% out of the blue was just considered so unthinkable that many utilities said they can’t do it, they’d rather cheat and pretend their water’s safe,” Edwards said. (Flint, for instance, avoided taking samples from enough homes that were known to have lead pipes.) Edwards believes it’s unrealistic to expect the kind of public investment it would take to fix the problem nationally. If the Flint water crisis didn’t make it happen, what would? “Lead pipes are going to be there for my lifetime and my children’s lifetime,” he said. “You get the water you pay for.”", 
      "date": "10/10/2019 06:04 pm ET"
    }, 
    {
      "subtitle": "The video features Lizzo, Whoopi Goldberg, Monica Lewinsky and Andy Cohen reciting “The New Colossus,” inscribed at the base of the Statue of Liberty.", 
      "author": "David Moye", 
      "url": "https://www.huffpost.com/entry/celebrities-statue-of-liberty-poem-the-new-colossus_n_5d9f6428e4b087efdbaa7408", 
      "title": "Celebrities Recite Statue Of Liberty Poem In Stirring New Video", 
      "content": " A new video is reminding Americans of the stirring words of one of its most beloved poems. It’s a recitation of “The New Colossus,” the famous poem on the Statue of Liberty’s base. You know, the one that goes, “Give me your tired, your poor, your huddled masses yearning to breathe free.” The new rendition, done to promote “Liberty: Mother of Exiles,” an HBO documentary about the statue, features the famous lines as recited by celebrities, including Lizzo, Whoopi Goldberg, Jessica Chastain, Monica Lewinsky and RuPaul. Oh, and Andy Cohen and Charo! The new reading of the Emma Lazarus poem comes as President Donald Trump’s administration seems to be turning its back on the poem’s promise. Recently, Ken Cuccinelli, the acting head of U.S. Citizenship and Immigration Services, suggested the poem should read: “Give me your tired and your poor who can stand on their own two feet, and who will not become a public charge.” Madeleine Albright, who was secretary of state during Bill Clinton’s presidency, called Cuccinelli’s comment “one of the most un-American things I have ever heard.” “Liberty: Mother of Exiles” debuts Oct. 17 on HBO. You can see “The New Colossus” video below.", 
      "date": "10/10/2019 02:34 pm ET"
    }, 
    {
      "subtitle": "The Washington Times was shredded on Twitter for writing about the Democratic lawmaker’s hair and proving it does not know how much women’s haircuts cost.", 
      "author": "Jenna Amatulli", 
      "url": "https://www.huffpost.com/entry/alexandria-ocasio-cortez-washington-times-haircut_n_5d9f2ff0e4b087efdba97481", 
      "title": "Ocasio-Cortez Responds To Conservative Outlet That Tried To Shame Her For $300 Haircut", 
      "content": " Rep. Alexandria Ocasio-Cortez (D-N.Y.) served up a bit of sass in response to a news article that criticized her for spending $300 on a haircut. On Wednesday, the freshman congresswoman was targeted by conservative news outlet The Washington Times in an article titled “EXCLUSIVE: Self-declared socialist AOC splurges on high-dollar hairdo.” The piece explained that Ocasio-Cortez “spent nearly $300 on her hairdo” at the Last Tangle Salon in Washington, D.C., last month. The article went on to say that she “shelled out $80 for a haircut and $180 for lowlights” and that a “20% tip would have added $52 to the bill.” It’s unclear why hair maintenance would be news. The outlet also clearly does not understand how much it costs for a woman to get her hair done in America, as it quoted the president of Americans for Limited Government, Richard Manning, calling Ocasio-Cortez “the Eva Peron of American politics.” “She preaches socialism while living the life of the privileged,” Manning said. “There is nothing wrong with spending money to make yourself look better, especially as a personality who depends upon visual mediums for her power. But it is a bad look to spend hundreds of dollars to get your hair done to make a video decrying income inequality.” Democratic socialist publication Jacobin tweeted about the article, quipping that it’s sad to see democratic socialists like Ocasio-Cortez and Sen. Bernie Sanders (I-Vt.) “do things like buy winter coats and get haircuts.” On Thursday morning, Ocasio-Cortez responded to Jacobin’s missive about the article with some statistics about poverty in America and how the policies of democratic socialists are not to blame. “Our policies, like Medicare for All, advance prosperity for working people. They’re just mad we look good doing it,” she wrote, accompanied by a hair toss emoji. Many people on Twitter were incredulous that the cost of the New York congresswoman’s haircut was “news”: The Washington Times piece also notes that the 29-year-old “could have saved roughly $100 for the same hairstyle at the government-subsidized Capitol Hill barbershop.” “Her high-dollar hairdo stands in stark contrast to that of former Attorney General Jeff Sessions, a former senator from Alabama who is a regular customer at Senate Hair Care Services,” reads the piece, which explains that the barbershop serves “members of Congress and the public” and charges $20 for a men’s cut. Anyone who has ever been to a hair salon can tell you that a men’s haircut almost always costs less than a woman’s, which the article does acknowledge, even though it undercuts the main point of the piece. The absurdity of that comparison was also not lost on Twitter:", 
      "date": "10/10/2019 10:36 am ET"
    }, 
    {
      "subtitle": "The vice president dodged the question four times in a row. Not a good look, man!", 
      "author": "Jennifer Bendery", 
      "url": "https://www.huffpost.com/entry/mike-pence-ukraine-joe-biden-investigation-trump_n_5d9f6785e4b087efdbaa7a90", 
      "title": "Mike Pence Won’t Say If He Knew Ukraine Aid Was Tied To Biden Probe", 
      "content": " The question was straightforward: Did you know that President Donald Trump held up U.S. military aid to Ukraine in order to pressure the foreign government to investigate Trump’s potential 2020 rival, former Vice President Joe Biden? But Vice President Mike Pence stammered and dodged the question four times at a Wednesday press event in Waukee, Iowa. Here’s the White House transcript of Pence’s exchange with NBC News reporter Vaughn Hillyard: If Pence did know that Trump had pressed Ukraine’s president to dig up dirt on Biden, that would mean he knew that Trump had potentially committed a federal crime and done nothing about it. It is illegal for anyone, including the president of the United States, to solicit anything of value from a foreign national that relates to a U.S. election. Federal Elections Chair Ellen Weintraub recently reiterated this point on Twitter. “Let me make something 100% clear to the American public and anyone running for public office,” Weintraub said in a statement. “It is illegal for any person to solicit, accept or receive anything of value from a foreign national in connection with a US election.” Watch the video above to see Pence dodge the question about what he knew.", 
      "date": "10/10/2019 03:12 pm ET"
    }, 
    {
      "subtitle": "Sean Newaldass said he thought the California senator was fictional, but now he plans to vote for her.", 
      "author": "David Moye", 
      "url": "https://www.huffpost.com/entry/sean-newaldass-kamala-harris-affair-actor_n_5da101c8e4b087efdbae5b79", 
      "title": "Man Who Claimed To Be Kamala Harris’ Lover Now Says It Was All Fake", 
      "content": " A man who claimed earlier this week that he had been paid for sex by presidential candidate Kamala Harris now says he was hired for an acting role. Oh, and he claims now that he thought Harris was a fictional person, according to an exclusive interview with the Daily Beast. On Wednesday, 26-year-old personal trainer Sean Newaldass participated in a news conference organized by Jacob Wohl and Jack Burkman, two far-right conspiracy theorists who are already known for pushing fraudulent claims. Newaldass read from a fact sheet about his alleged relationship with the California senator, which can be seen here, and claimed he and Harris had a total of 11 “sexual encounters” in hotels in Iowa; Washington, D.C.; and New York City, according to the Daily Dot. Check out this video of the news conference ― which is hilarious in its ineptness. On Friday, Newaldass told a much different story than the one he told on Wednesday. He said Wohl and Burkman hired him after he answered a CraigsList ad seeking a “male actor” for “performance art in DC.” Newaldass said he believed the news conference was actually an audition for a Spike TV show that no longer exists. In fact, he had no clue Harris was a politician, much less a potential presidential candidate. “I thought I was acting for a role in a movie, like a role in a TV series,” Newaldass told the Daily Beast. “I thought everything was staged, I’m thinking everyone is an actor.” Even more important: “I’m completely oblivious to who [Harris] is,” Newaldass told the Daily Beast. Later in the interview, Newaldass admitted he’s researched Harris since the news conference and now says he plans to vote for her. However, Newaldass said he regrets his part in the attempted smear because, like Harris, he is of mixed Indian and Caribbean ancestry. “That’s what’s hurtful, because I’m hurting my own ethnicity,” Newaldass said. Newaldass said he was supposed to receive $500 for his services but hasn’t yet. When the Daily Beast reached out to Wohl for his reaction, he responded cryptically with a laughing crying face emoji. HuffPost reached out to Wohl, but he didn’t immediately respond. The smear against Harris was the latest to backfire for Wohl and Burkman. Earlier this month, the two dirty tricksters attempted to smear Sen. Elizabeth Warren of Massachusetts as a “cougar” by holding a news conference with a former Marine in his mid-20s who claimed he had a paid sexual affair with Warren, 70, that included bondage. Warren got the last laugh with a witty response that embraced her “cougar” past, telling the world it made her who she is.", 
      "date": "10/11/2019 07:55 pm ET"
    }, 
    {
      "subtitle": "The energy secretary is the latest person in President Donald Trump’s orbit to face demands for documents.", 
      "author": "Lydia O’Connor", 
      "url": "https://www.huffpost.com/entry/house-subpoenas-rick-perry_n_5d9f9226e4b06ddfc5165763", 
      "title": "Rick Perry Subpoenaed In House’s Trump Impeachment Probe", 
      "content": " The chairmen of three House committees announced Thursday that they’ve subpoenaed Energy Secretary Rick Perry as part of their impeachment inquiry into President Donald Trump. The subpoena demands Perry turn over several documents concerning the Trump administration’s communications with Ukraine and Trump pressuring the foreign power to investigate former Vice President Joe Biden, one of the president’s political rivals. “Recently, public reports have raised questions about any role you may have played in conveying or reinforcing the President’s stark message to the Ukrainian President,” the chairmen of the House Intelligence, Foreign Affairs and Oversight and Reform committees wrote. “These reports have also raised significant questions about your efforts to press Ukrainian officials to change the management structure at a Ukrainian state-owned energy company to benefit individuals involved with Rudy Giuliani’s push to get Ukrainian officials to interfere in our 2020 election,” the letter to Perry said. Perry must comply by Oct. 18. The former Texas governor became publicly entangled in Trump’s Ukraine scandal last week after sources familiar with the situation spoke to Axios. They said that during a conference call with House Republicans on Friday, Trump said Perry arranged his July 25 call with Ukrainian President Volodymyr Zelensky. “Not a lot of people know this but, I didn’t even want to make the call,” Trump reportedly said, according to three sources. “The only reason I made the call was because Rick asked me to. Something about an LNG [liquefied natural gas] plant.” Department of Energy spokeswoman Shaylyn Hynes said the subpoena is “currently under review by DOE’s Office of General Counsel.” The White House did not immediately return HuffPost’s request for comment. Perry’s subpoena is the latest the committees have issued as part of their impeachment inquiry. Others include those sent to the White House, Trump lawyer Rudy Giuliani, Vice President Mike Pence, the Pentagon and the budget office. Perry has denied reports in recent days that he plans to resign as energy secretary.", 
      "date": "10/10/2019 04:29 pm ET"
    }, 
    {
      "subtitle": "Former national security adviser H.R. McMaster denounced foreign interference in U.S. politics but said he saw no such thing while in the White House.", 
      "author": "Carla Herreria", 
      "url": "https://www.huffpost.com/entry/hr-mcmaster-trump-foreign-interference_n_5d9fa15ee4b087efdbab1597", 
      "title": "Ex-Trump Adviser Says It’s Inappropriate For President To Seek Foreign Political Interference", 
      "content": " Former national security adviser H.R. McMaster said it was “absolutely” inappropriate for a U.S. president to seek foreign interference in an election when asked about the matter by a reporter on Thursday. “Of course no. No, it’s absolutely not,” the three-star general told a reporter while speaking at an event at the Foundation for Defense of Democracies on Thursday. The reporter had asked whether it was appropriate for the president to “solicit foreign interference in our political process.” “And of course, what has to happen here is seeing our democracy play out, our separation of powers play out,” McMaster added. “And for the American people, through their representatives in Congress, to make a judgment of whether that happened.” The former Trump official also said he never saw any instance of President Donald Trump seeking foreign assistance for political matters while he worked in the White House. “In all the conversations, in all the meetings I was ever privy too, there was never any incident of the president soliciting any kind of assistance for anything domestic politics,” he said. Trump is resisting an impeachment inquiry launched by House Democrats after details of a call between Trump and the president of Ukraine emerged, showing his efforts to pressure the country into investigating former Vice President Joe Biden and his son Hunter. Two whistleblowers within the intelligence community with knowledge of the July 25 call have filed complaints against the president, alleging that Trump inappropriately pressured Ukrainian President Volodymyr Zelensky into interfering in U.S. politics. John Bolton replaced McMaster as the White House’s national security adviser in April 2018 after reports suggested that the chief of staff John Kelly and Secretary of Defense Jim Mattis, both of whom have since resigned from their positions, were preparing to move McMaster out of his post. Despite reports, the White House said that Trump and McMaster “mutually agreed” on the move. McMaster also retired from the U.S. Army around the time of his resignation. Bolton left the White House in September after Trump said his services “were no longer needed.”", 
      "date": "10/10/2019 06:38 pm ET"
    }, 
    {
      "subtitle": "State lawmakers could choose the next governor because of a little-noticed 1890 provision designed to disenfranchise Black voters.", 
      "author": "Sam Levine", 
      "url": "https://www.huffpost.com/entry/mississippi-attorney-general-governor-race-jim-crow-rule_n_5d9f98a4e4b087efdbaaeadd", 
      "title": "Mississippi Is About To Have An Election Under Jim Crow", 
      "content": " This fall in Mississippi, a group of elected officials could block the candidate who wins a majority of statewide votes from assuming the Governor’s Mansion and the attorney general’s office. And it would be completely legal. That’s because of a long-overlooked provision in the state’s 1890 Constitution. The measure requires candidates for statewide office to win not just a majority of the vote but also a majority of the 122 districts in the state House. If a candidate wins a majority of the statewide vote but not a majority of the districts, the members of the Republican-controlled state House choose who wins the election. If no candidate receives a majority of the vote, the Mississippi House of Representatives picks a winner from the two candidates who received the most votes. The provision has received little attention until recently, when four Black Mississippi voters filed a federal lawsuit arguing that it discriminates against African Americans. Although Black people make up 38% of the state, they are a majority in only 42 of the state’s 122 House districts, according to NPR. The provision was part of an explicit effort during Mississippi’s 1890 constitutional convention to suppress the Black vote, experts say, and has helped keep Black people out of statewide offices for years. It could do the same in the next election, when attorney general candidate Jennifer Riley Collins seeks to become the first Black statewide-elected official in nearly 150 years. Collins, a Democrat, along with gubernatorial candidate and current Attorney General Jim Hood (D), who is white, could win a majority of statewide gubernatorial votes but not a majority of the House districts. That’s unless a federal judge strikes down the constitutional provision. A federal judge in Jackson is set to hear oral arguments in McLemore v. Hosemann on Friday. The four plaintiffs in the case are longtime Mississippi voters, two of whom had to pay poll taxes and three had to pass tests to register to vote decades ago. In court filings, their lawyers argue Mississippi’s system for choosing statewide elected officials is both unconstitutional and illegal because Black-preferred candidates have to win more statewide votes than their white counterparts to get elected. The provision is rooted in efforts to suppress Black people. After the 15th Amendment prohibited officials from denying voting rights based on race, the Mississippi delegates who met in 1890 sought to limit the power of the newly enfranchised black population in the state. Along with the requirements for winning statewide office, they adopted measures like poll taxes and literacy tests that made it harder for Black people to vote. The plan succeeded and significantly reduced the number of eligible Black voters in the state. Mississippi hasn’t elected an African American to statewide office in well over a century. “They focused on coming up with a particular means by which to achieve the goal of white supremacy without violating any federal constitutional safeguards. No other state had attempted that,” said John Winkle III, a professor emeritus of political science at the University of Mississippi. “That’s the way the law was set in 1890, and it was clearly the product of the white supremacy overtones of the entire constitution itself.” Over time, the federal courts and government got rid of poll taxes and literacy tests. But in Mississippi, the special conditions to win statewide office remained. Riley Collins, the Democratic candidate for attorney general, said it was obvious the provision in the state Constitution was only about race. “The crafters of that provision indicated that this was about limiting the power of Black [elected officials]. And so for someone to later try to be revisionist in history is not reading ― they are not reading what the crafters themselves said,” she said in an interview with HuffPost. “We can deny it all day ― it is what it is.” Even though the constitutional provision is obviously racist, it’s gone unnoticed because it simply hasn’t come into play in elections, Winkle said. One exception came in 1999, when none of the candidates running for governor won a majority of the vote. Lawmakers in the Mississippi House, then controlled by Democrats, chose the Democratic candidate, who was the one who had also earned the most votes in the election. The four plaintiffs seeking to overturn the provision argued the Mississippi Constitution establishes a structure that makes it harder for them to elect a candidate of their choice. They say the system denies them the opportunity to participate in the political process on equal ground with white people, regardless of which candidate wins an election. “The Popular-Vote Rule ensures that even when African-American-preferred candidates generate enough support to win a plurality of votes, they are unlikely to be elected,” they wrote in the complaint they filed in May. “The House-Vote Rule ... thwarts the election of an African-American-preferred candidate by removing the selection of candidates for statewide office from the hands of the electorate and places the decision with the House, where African Americans have little influence.” Lawyers representing the defendants, Secretary of State Delbert Hosemann and House Speaker Philip Gunn, both Republicans, conceded in their own court filings that the law has a discriminatory origin. But, they argue, the plaintiffs in the case are really claiming discrimination based on their political party, not race. The four Mississippi voters, they say, have not suffered any harm because the Mississippi Constitution has never prevented an ”’African-American-preferred candidate’ who won the popular vote from taking office.” “Neither the Speaker nor the Secretary wish to defend the motivations behind a law allegedly enacted with racial animus,” the lawyers for state officials wrote in a July filing. “However, both the allegations in the Complaint and the timing of its filing demonstrate that this lawsuit is not about race, and it is not about vindicating alleged wrongs to Plaintiffs’ rights to vote — it’s about partisan politics.” Hood, the gubernatorial candidate, said politicians in the Mississippi Legislature shouldn’t decide who the next governor of Mississippi will be. “The candidate with the most votes should win, period. Every Mississippian’s vote should count. Those voters, not partisan politicians, should decide who they want to be their governor,” Hood said in a statement. The suit is being backed by the Mississippi Center for Justice and the National Redistricting Foundation, which is affiliated with the National Democratic Redistricting Committee, a group led by former U.S. Attorney General Eric Holder.", 
      "date": "10/10/2019 06:09 pm ET"
    }, 
    {
      "subtitle": "At CNN’s town hall, the former vice president and 2020 candidate told the murder victim’s mother about his support for the Equality Act to solidify LGBTQ rights.", 
      "author": "Sanjana Karanth", 
      "url": "https://www.huffpost.com/entry/joe-biden-matthew-shepard-mom-civil-rights-act-includes-lgbtq_n_5d9fc151e4b087efdbab8bd9", 
      "title": "Joe Biden Tells Matthew Shepard’s Mom That Civil Rights Act Includes LGBTQ People", 
      "content": " Former Vice President Joe Biden told LGBTQ rights figure Judy Shepard on Thursday that passing the Equality Act would come “first and foremost” if he won the presidency in 2020. Shepard, whose son Matthew Shepard was murdered in 1998 for being gay, asked Biden at CNN’s LGBTQ town hall in Los Angeles how the former senator and 2020 Democratic presidential candidate would reduce hate crimes against LGBTQ people and other marginalized communities. Biden stressed the importance of passing the Equality Act, which cleared the House earlier this year. It would amend the Civil Rights Act of 1964 to also ban discrimination “on the basis of sex, sexual orientation, gender identity, or pregnancy, childbirth, or a related medical condition of an individual, as well as because of sex-based stereotypes.” The bill’s goal is to provide anti-discrimination protections for LGBTQ people in areas such as places of employment on a national level. “That’s important,” he said. “That’s important because it’ll change a whole range of things.” Matthew Shepard was a 21-year-old student at the University of Wyoming when he was killed, and his death became one of the country’s most high-profile hate crimes against LGBTQ people. Judy Shepard and her husband, Dennis, founded the Matthew Shepard Foundation, an LGBTQ nonprofit that runs education and advocacy programs. Biden also said that his administration would track down hate groups and that he believes the correct interpretation of the Civil Rights Act includes LGBTQ people. “This is a civil rights issue. It’s covered by, in my view ― the court may not agree ― this is a civil rights issue protected by the Civil Rights Act,” he said. “And we should be focusing on how to enforce that. My Justice Department ― and I guess any one of the Democrats’ Justice Department ― will, in fact, do that.” The Supreme Court is currently divided on whether the Civil Rights Act, or Title VII, protects LGBTQ people from employment discrimination. A key part of the law bans job discrimination based on sex, though some courts in recent years have read the language to include discrimination against LGBTQ people as part of sex discrimination. Biden’s answers to Judy Shepard’s question were applauded, though the presidential candidate later caused a bit of discomfort in the audience after describing his first public statement supporting same-sex marriage in 2012 as when he “came out.” “For example, when I came out and ... ,” Biden said before catching himself and restarting with: “When I publicly stated.” “Coming out” is a term often used to describe when someone chooses to publicly identify as LGBTQ. CNN hosted the town hall with the Human Rights Campaign, an LGBTQ nonprofit organization.", 
      "date": "10/10/2019 10:46 pm ET"
    }, 
    {
      "subtitle": "The group drew clear parallels between the current president and Richard Nixon in a Washington Post op-ed.", 
      "author": "Nick Visser", 
      "url": "https://www.huffpost.com/entry/watergate-prosecutors-trump-impeachment-nixon_n_5d9fa4dae4b02c9da047328c", 
      "title": "Former Watergate Prosecutors Say Trump Should Be Impeached", 
      "content": " A group of 17 former Justice Department special prosecutors who investigated the Watergate scandal said Thursday that they believe President Donald Trump has committed multiple impeachable offenses, drawing clear parallels between Trump’s behavior and that of the late President Richard Nixon. In a Washington Post op-ed, the group wrote that there is already “compelling” evidence that Trump’s actions warrant impeachment. They pointed to public statements made by the president and the White House’s summary of his call with the leader of Ukraine, both of which are driving the House of Representatives’ impeachment inquiry. “The Constitution establishes impeachment as the proper mechanism for addressing these abuses; therefore, the House should proceed with the impeachment process, fairly, openly and promptly,” the group wrote. “The president’s refusal to cooperate in confirming (or disputing) the facts already on the public record should not delay or frustrate the House’s performance of its constitutional duty.” Read the full commentary here. The Watergate prosecutors repeatedly compared Trump to Nixon, who resigned after the House Judiciary Committee adopted three articles of impeachment against him: one for obstruction, one for abuse of power and one for contempt of Congress. “In our considered view, the same three articles of impeachment could be specified against Trump, as he has demonstrated serious and persistent abuses of power that in our view satisfy the constitutional standard of ‘high crimes and misdemeanors,’” the op-ed reads. House Democrats opened a formal impeachment inquiry last month following a whistleblower complaint about a call Trump had with Ukrainian President Volodymyr Zelensky in July. Also last month, the White House released a reconstruction of that conversation, during which Trump repeatedly pressed his counterpart to investigate a top political rival, former Vice President Joe Biden, and his son, Hunter Biden. The call took place days after Trump ordered his administration to withhold millions in American military aid that Congress had appropriated for Ukraine. Trump has denied stalling the funding in exchange for a political favor, but critics say his demand for a Biden investigation in the context of that withheld aid represents a clear quid pro quo. The members of the Watergate team also pointed to text messages released by the chairs of three House committees last week that appear to show Trump administration officials pressuring a Ukrainian official for political favors in exchange for cooperation from the U.S. government. The former prosecutors wrote that recent efforts by the White House to stonewall Democrats’ inquiries should not deter lawmakers, arguing that any impropriety by the president “requires firm and resolute action.” “The Constitution provides for the elected representatives of the people to resort to impeachment in extraordinary circumstances showing that this drastic remedy is necessary to restrain, and possibly remove, a president who has engaged in high crimes and misdemeanors,” the group wrote. “Lawmakers should not allow any refusal by the president to cooperate in its process to frustrate the performance of its constitutional duties.”", 
      "date": "10/10/2019 09:01 pm ET"
    }, 
    {
      "subtitle": "Before being indicted, Igor Fruman and Lev Parnas worked with Trump’s lawyer Rudy Giuliani on the plot to get Ukraine to investigate Joe Biden.", 
      "author": "Paul Blumenthal", 
      "url": "https://www.huffpost.com/entry/fruman-parnas-republican-contributions_n_5d9fbc5ee4b02c9da0479363", 
      "title": "Republicans Start Giving Away Contributions From Trump’s Indicted Ukraine Plot Associates", 
      "content": " Republican candidates and committees who benefited from allegedly illegal donations made by two clients of President Donald Trump’s personal lawyer Rudy Giuliani are planning to donate them to charity. Those two clients, Igor Fruman and Lev Parnas, made straw donations in the name of others and operated as a front for an unknown Russian foreign national to donate to “politicians and candidates for federal and state office,” according to a federal indictment filed Thursday. Fruman and Parnas are reportedly deeply involved in the scheme concocted by Trump and Giuliani to pressure the Ukrainian government to open an investigation into former Vice President Joe Biden, who is running for the 2020 Democratic nomination. They worked in both Ukraine and the U.S., often mixing politics with business, to gather information and influence politicians as part of Giuliani’s efforts. This plan to get a foreign government to help Trump’s reelection campaign is at the center of the House impeachment inquiry into the president. House Minority Leader Kevin McCarthy (R-Calif.) plans to give $111,000 — the amount Fruman and Parnas donated to a joint fundraising committee called Protect the House — to an as-yet-to-be-determined charity in his district. The National Republican Congressional Committee says it will donate contributions it received beyond those originally donated to Protect the House as well. Republican Florida Gov. Ron DeSantis also plans to donate the $50,000 his 2018 campaign received from a shell company run by Fruman and Parnas, according to the Miami Herald. “The deception documented in today’s indictment has no place in our country and as a result, McCarthy plans to donate amounts received to a local charity,” Matt Sparks, a spokesman for McCarthy, said in an email. Starting in 2016, Fruman and Parnas contributed at least $955,000 to Republican candidates, committees and super PACs. The $325,000 contribution to America First Action, a pro-Trump super PAC, made in the name of Global Energy Producers LLC in 2018 was the largest contribution made by Fruman and Parnas. The indictment charges the two businessmen with illegally masking their identities by contributing to the super PAC through a shell corporation. The indictment also mentions a $2,700 donation to Congressman-1, who has been identified by press reports as former Rep. Pete Sessions (R-Texas). Fruman and Parnas promised to raise $20,000 for Sessions. Around the time of this promise, Sessions sent a letter to Secretary of State Mike Pompeo urging him to fire the U.S. Ambassador to Ukraine Marie Yovanovitch, a major priority of Giuliani’s influence campaign. The only other contributions specifically mentioned in the indictment are two $10,000 donations to Republican state candidates in Nevada. Fruman and Parnas made these allegedly illegal donations on behalf of a Russian national who was purportedly seeking to obtain a cannabis business license, according to the indictment. The only two Nevada candidates to receive contributions from Fruman or Parnas in 2018 were gubernatorial candidate Adam Laxalt and attorney general candidate Wes Duncan, according to state records. According to federal campaign finance records, Fruman and Parnas also donated $100,000 to House Majority Trust, another joint fundraising committee that worked to protect the Republican House majority in 2018; $15,000 to Sen. Rick Scott’s (R-Fla.) joint fundraising committee; and $53,200 to committees connected with Trump’s presidential campaign. Protect the House divided contributions to the NRCC, McCarthy and his leadership PAC and over a dozen vulnerable House Republicans. House Majority Trust split its contributions between the Republican National Committee and the NRCC. The RNC did not immediately respond to a request for comment on whether it plans to return or donate the contributions.", 
      "date": "10/10/2019 08:52 pm ET"
    }, 
    {
      "subtitle": "The president has enlisted parts of the U.S. government and key allies in the pursuit of unproven or disproven conspiracy theories, some incubated in the dark corners of the internet.", 
      "author": "", 
      "url": "https://www.huffpost.com/entry/trump-us-government-conspiracy-theories_n_5d9fedb7e4b02c9da047c100", 
      "title": "How Trump Used The U.S. Government To Chase Conspiracy Theories", 
      "content": "WASHINGTON (Reuters) - President Donald Trump has enlisted parts of the U.S. government and key allies in the pursuit of unproven or disproven conspiracy theories, some incubated in the dark and anonymous corners of the internet. Text messages between U.S. diplomats, a whistleblower complaint and a series of public statements by Trump and other officials in recent days offer the clearest view yet of the extent to which the president has used the government to chase accusations that secret forces have been plotting against him. Much of that evidence has surfaced because of an impeachment inquiry led by Democrats in the U.S. House of Representatives. Some of the evidence that has emerged shows that: - State Department envoys in Europe offered Ukraine’s president a White House visit if he promised to investigate a discredited theory suggesting Russia did not interfere in the 2016 election that put Trump in office. A whistleblower complaint by an intelligence officer suggested Trump also held back nearly $400 million in security aid to Ukraine as additional leverage, which Trump has denied doing. - The Justice Department is now investigating its own probe into Russia’s meddling in the 2016 election and allegations that Trump’s campaign colluded with Moscow. Attorney General William Barr and another senior department official traveled to Europe in recent months to investigate the theory that the FBI investigation, first launched during the presidential campaign in 2016, was actually a plot to stop Trump from becoming president. The president’s tendency to say untrue things, particularly on Twitter, has caused headaches for his administration before. Until now, however, the government had largely taken pains to distance itself from such statements. As recently as last year, the Justice Department argued in a series of court cases that when it came to national security, the president did not necessarily know what he was tweeting about. Here are the three cases in which Trump has publicly advanced views of uncorroborated conspiracies behind episodes damaging his presidency. The White House declined to comment on the cases: Investigations by U.S. intelligence, law enforcement, Congress and outside researchers have all concluded that Russia’s government was to blame for hacking Democratic Party organizations and leaking stolen emails at politically opportune moments in 2016. Russia has denied involvement, although U.S. investigators even named the Russian officers who were sitting at the keyboard during the breaches. But another view has taken hold in on some right-wing websites. In that telling, the cybersecurity firm CrowdStrike, which the DNC hired to investigate the hack, falsely accused Russia, and spirited the hacked email servers to Ukraine as part of a coverup. As early as March 2017, an unnamed poster on the fringe website 4chan wrote that “Russia could not have been the source of leaked Democrat emails released by WikiLeaks.” Other posts incorrectly said CrowdStrike co-founder Dmitri Alperovitch is Ukrainian (he is a U.S. citizen born in Russia). Trump referenced that view during a July 25 call with Ukrainian President Volodymyr Zelenskiy, mentioning CrowdStrike by name, and saying “The server they say Ukraine has it.” Ahead of that call the U.S. special representative to Ukraine, Kurt Volker, suggested in a text message to a Zelenskiy aide that Zelenskiy might score a White House visit if he promised to “get to the bottom of what happened” in 2016, a reference to the election meddling. CrowdStrike said in a blog post that its finding of Russian involvement was supported by U.S. intelligence and that it never took possession of the hacked servers. Trump’s former homeland security adviser, Tom Bossert, said officials in the administration tried to dissuade Trump. “It’s not only a conspiracy theory. It is completely debunked,” he said on ABC’s “This Week With George Stephanopoulos” last month. Russian involvement in the 2016 election produced an investigation like few others in U.S. history, focused on whether Trump’s campaign had colluded with the Kremlin to win. Another theory, endorsed by Trump, holds that the probe was actually an elaborate effort by U.S. officials and foreign spies to deny him the presidency. The FBI opened its Russia probe in 2016, after an Australian diplomat reported that a Trump campaign aide named George Papadopoulos had boasted that Russia had obtained email “dirt” on Hillary Clinton, Trump’s Democratic opponent, weeks before the hack of the Democratic National Committee became public. Papadopoulos told the FBI that he learned that from a Maltese academic, Joseph Mifsud. Papadopoulos has alleged that Mifsud was actually a Western intelligence operative trying to frame him, and by extension, Trump. On Twitter, Trump has hinted at that theory, repeating messages asking why Mifsud was not charged with a crime, and quoting a television interview in which Papadopoulos said the “whole thing was a complete setup.” Now Barr is investigating how the government opened an investigation - which went on to be led by Special Counsel Robert Mueller - that the president dismissed as a “hoax” and a “witch hunt” from the start. Barr told CBS News that official explanations for the FBI’s investigation “don’t hang together.” He has not elaborated on what he is investigating or why, but told a Senate subcommittee this year that “there is a basis for my concern.” Barr traveled to Italy seeking information about Mifsud, and to the United Kingdom to meet with its intelligence officials. He has tapped the lead federal prosecutor in Connecticut to lead the review. The Justice Department did not respond to a request for comment. Trump’s efforts to pursue those conspiracies came to light in large part because an unnamed U.S. intelligence officer filed a whistleblower complaint about Trump’s July 25 call with Zelenskiy. Trump has accused Democrats of secretly ghostwriting the whistleblower’s complaint. He described the whistleblower’s sources as “spying on our own president,” and said they deserve “Big Consequences.” He also said on Wednesday that the Intelligence Committee Inspector General, who first reviewed the complaint and determined that it was credible and urgent, had presided over a “scam.” Trump also said his administration was “trying to find out” the whistleblower’s identity, and that he wanted to question his unnamed accuser. When the whistleblower’s lawyers said a second official had also spoken to the Intelligence Community Inspector General, Trump said that person too was “coming in from the Deep State,” a phrase that commonly refers to an alleged secret cabal within the U.S. government. One of the initial whistleblower’s lawyers, Mark Zaid, has said that Congress did not help the whistleblower prepare the nine-page set of allegations that touched off the House impeachment inquiry. Nonetheless, Trump’s allies in the House and his lawyers have taken up the accusation that the whistleblower worked in secret with the Democratic head of the House committee leading the impeachment inquiry, Adam Schiff. In a letter Tuesday, White House Counsel Pat Cipollone cited this among the president’s reasons for refusing to cooperate with the impeachment probe. The whistleblower’s party leanings and his contact with Democrats “raises serious questions that must be investigated,” he wrote. Reporting by Karen Freifeld, Brad Heath, Steve Holland, Mark Hosenball, Jonathan Landay, David Morgan, Andy Sullivan and Heather Timmons and Richard Cowan; Editing by Ross Colvin and Frances Kerry", 
      "date": "10/10/2019 11:06 pm ET"
    }, 
    {
      "subtitle": "It’s the latest blast between Trump and Mayor Jacob Frey, who wants the Trump campaign to cover its costs to his city.", 
      "author": "Mary Papenfuss", 
      "url": "https://www.huffpost.com/entry/jacob-frey-love-trumps-hate-day-minneapolis_n_5d9fc03ce4b087efdbab8bbd", 
      "title": "Minneapolis Mayor Declares ‘Love Trumps Hate Day’ Before President’s Rally", 
      "content": " Hours before President Donald Trump took the stage in Minneapolis, Mayor Jacob Frey (D) issued a proclamation declaring Thursday to be “Love Trumps Hate Day” in his city. The declaration was issued as protesters and supporters began gathering outside the Target Center where Trump was set to speak. Frey’s proclamation said that diversity, inclusion, love and compassion have made the Minnesota city “prosperous” and “beautiful.” It added, “The people of Minneapolis will not be baited by voices that promote conflict and intolerance.” The clear dig against Trump is just the latest in an ongoing conflict between the president and the mayor. It was triggered when Minneapolis demanded $530,000 to cover security costs for Trump’s campaign rally. The president’s campaign has developed a reputation for not reimbursing cities for security costs incurred as a result of his rallies — even as his campaign raises record amounts of money. At least 10 cities have complained that the campaign has not paid them for police and fire department costs, totaling more than $840,000, according to a study this summer by the Center for Public Integrity. The Trump campaign owes $569,000 to El Paso, Texas, for a rally there in February, local station CBS-4 TV reported earlier this month. The money represents 15% of the city’s total debt. Earlier this week, Trump slammed Frey as a “Radical Left Mayor” out to squelch free speech. Frey replied that Midwesterners “pay our bills” and that the president’s campaign can afford to pitch in. Frey reiterated in a tweet Thursday that city residents shouldn’t be stuck with the tab for Trump’s campaign rally.", 
      "date": "10/10/2019 09:56 pm ET"
    }, 
    {
      "subtitle": "The two associates, Lev Parnas and Igor Fruman, face charges of violating campaign finance laws.", 
      "author": "Sanjana Karanth", 
      "url": "https://www.huffpost.com/entry/rudy-giuliani-fly-vienna-after-arrested-associates-flight_n_5d9fb8d1e4b087efdbab7b0a", 
      "title": "Rudy Giuliani Planned Vienna Trip 1 Day After Arrested Associates Were Headed There: Report", 
      "content": " Rudy Giuliani was reportedly planning to leave Thursday for Vienna, Austria, a day after two business associates who helped him with his dealings with Ukraine officials were arrested as they were headed to the same destination. The Atlantic’s Elaina Plott reported that Giuliani, President Donald Trump’s personal attorney, told her he would not be able to meet Thursday evening for an interview because he was planning to fly to Vienna in the evening. Giuliani told that to the reporter around the same time that his associates Lev Parnas and Igor Fruman were arrested at Dulles International Airport while waiting to board a flight to Vienna with one-way international tickets Wednesday night, Plott wrote. Parnas and Fruman were headed to Vienna when they were arrested, The Wall Street Journal first reported earlier Thursday. The Southern District of New York indicted the two Soviet-born Florida businessmen on federal campaign finance charges for allegedly channeling foreign money and making fraudulent straw donations in order to hide their political contributions and give in excess of campaign contribution limits to Trump and other Republican candidates. According to Plott, Giuliani texted her late Thursday afternoon declining to comment on why Parnas and Fruman were headed to Vienna, and why he was planning to be there 24 hours later. In comments to the Journal, Giuliani said that while Parnas and Fruman were going to Vienna on issues “related to their business,” he was only going to meet with them when they returned to Washington. As the Journal reported, the two men have introduced Giuliani to multiple current and former Ukrainian prosecutors to discuss his attempts at getting the country to investigate former Vice President Joe Biden and his son Hunter, who served on the board of a Ukrainian gas company. Trump’s call with Ukraine’s president about such an investigation is at the center of a House impeachment inquiry into him. Separately, House Democrats leading the inquiry issued subpoenas on Thursday to Parnas and Fruman for documents related to their work with Giuliani. Before their arrest, the House requested that Parnas appear for a deposition on Thursday and Fruman on Friday; their counsel declined the request earlier this week. Jay Sekulow, another of Trump’s personal lawyers, told reporters on Thursday that Trump has nothing to do with the businessmen’s campaign finance schemes. Trump himself told reporters he doesn’t “know those gentlemen,” but that “it’s possible I have a picture with them.”", 
      "date": "10/10/2019 07:45 pm ET"
    }, 
    {
      "subtitle": "The president does have pictures with Lev Parnas and Igor Fruman, who were arrested on federal campaign finance charges while trying to leave the country.", 
      "author": "Josephine Harvey", 
      "url": "https://www.huffpost.com/entry/trump-lev-parnas-igor-fruman-giuliani-photos_n_5d9eb775e4b02c9da0441429", 
      "title": "Trump: I Don’t Know The Giuliani Associates, But I Might Have A Picture With Them", 
      "content": " President Donald Trump said Thursday that he doesn’t know Lev Parnas and Igor Fruman, but it’s “possible I have a picture with them because I have a picture with everybody.” The two Soviet-born Florida businessmen, who are known associates of Trump’s personal lawyer Rudy Giuliani, were arrested Thursday as they tried to leave the U.S. with one-way tickets to Vienna. They were indicted on federal campaign finance charges that allege they conspired to funnel foreign money to pro-Trump and Republican groups and filed false disclosures about the hundreds of thousands of dollars in political contributions. Parnas and Fruman introduced Giuliani to top Ukrainian political circles, according to multiple reports. And Parnas told the Miami Herald last month that he provided the Trump administration with information on alleged wrongdoing by Trump’s 2020 rival Joe Biden and his son Hunter Biden, via his friendship with Giuliani. When quizzed by reporters on his relationship with the pair following their arrest Thursday, the president was on the defensive. “I don’t know those gentlemen. Now, it’s possible I have a picture with them, because I have a picture with everybody, I have a picture with everybody here, but somebody said there may be a picture or something at a fundraiser or somewhere, but I have pictures with everybody. I don’t know if there’s anybody I don’t have pictures with,” he said, as seen in a clip posted by ABC. “I don’t know them, I don’t know about them, I don’t know what they do, but, uh, I don’t know, maybe they were clients of Rudy, you’d have to ask Rudy. I just don’t know.” Images of Trump with the pair have since been circulated. One image, posted on Facebook by Parnas in May 2018, shows the businessman with Trump at the White House. He thanked the president for an “incredible dinner and even better conversation.” Parnas, Fruman, Giuliani and Trump are pictured together in an undated image published by the Miami Herald. Vice President Mike Pence was also pictured with the four of them at the event. Another image posted on Facebook by Parnas, also in May 2018, was captioned “power breakfast !!!” and included a #Trump2020 hashtag. The photo shows Donald Trump Jr. with Fruman and Parnas at the Beverly Hills Polo Lounge. According to the indictment, Parnas and Fruman made a $325,000 contribution to an independent expenditure committee in May 2018 and falsely reported the source of the funds. The committee’s name was not disclosed in the indictment, but it has been identified as America First Action, a group that supports pro-Trump political candidates. Some on social media were not satisfied with Trump’s umbrella disclaimer that he did not know the pair but might have pictures with them, and some were quick to call out Trump’s hypocritical attack on former Vice President Joe Biden last week. The president had tweeted a doctored version of Nickelback’s “Look at This Photograph” music video, which had been edited to include an old image of Joe Biden and his son alongside two associates, one of whom had been labeled as a “Ukrainian gas exec.” The man was an American business partner of Hunter Biden’s, and the two sat on the same board of a gas company in Ukraine. Trump’s attack was meant to highlight Joe Biden’s assertion he was not involved with his son’s business dealings in Ukraine. The Nickelback meme was quickly turned around on Trump Thursday:", 
      "date": "10/10/2019 08:15 pm ET"
    }, 
    {
      "subtitle": "Trump almost won the state in 2016, giving his campaign hope it can take it next year and win reelection, even if he loses Wisconsin, Michigan and Pennsylvania.", 
      "author": "S.V. Date", 
      "url": "https://www.huffpost.com/entry/trump-rally-minnesota-hardcore-base_n_5d9f7940e4b087efdbaa9cc5", 
      "title": "Minnesota Hasn’t Gone Republican Since Nixon, But Trump Is Pushing Hard Anyway", 
      "content": " MINNEAPOLIS ― Jason Munson gets all his news either directly from the president or from the conspiracy theory website Infowars. He likens Donald Trump’s campaign rallies to religious revivals. He says Trump is the first Republican he has voted for with enthusiasm. “All the other presidents who were Republicans? They were all a bunch of pussies,” said the 49-year-old construction worker who spent Wednesday night at the Target Center arena to be sure to be as close to Trump as possible the following night. “I get goose bumps just thinking about it.” The good news for Trump was that the 20,000-seat arena was packed close to capacity Thursday night with Jason Munsons from all over Minnesota. The bad news was that his cult-like followers, while a significant percentage of the Republican voting base, are likely not enough to flip the state that Trump narrowly lost in 2016 into his column next year. Even worse: Trump’s actions and words that most appeal to rally audiences actually turn off key groups whose support Trump would need to take the state’s 10 electoral votes. “Trump’s ‘base’ represents 40% of everyone who voted for him in ’16,” said former Illinois Congressman Joe Walsh, who is challenging Trump for the 2020 Republican nomination. “That guy at the rally represents 30% of Trump’s base.” Priorities USA, the Democratic super PAC working to defeat Trump, does not include Minnesota on its list of targeted states for next year, which includes Wisconsin, Pennsylvania, Michigan and Florida. Instead, the state is on its “watch” list of must-win states that could become competitive, sandwiched between Colorado and Virginia. That level of relative confidence is perfectly OK with Tim Murtaugh, the Trump campaign’s communications director. He rattles off the statistics: 20 paid staff in Minnesota already, compared with just one during the 2016 campaign, with the goal of hitting 100 by next autumn. The expectation of spending “tens of millions” by Election Day. “This is a not a head fake,” he told HuffPost on Thursday. Matt Fuehrmeyer, for one, takes the Trump camp at its word. “We have to treat Minnesota like a state that we have to fight for to beat Donald Trump,” said the onetime aide to former Democratic Sen. Al Franken of Minnesota. He said that, although Democrats are focused on winning back the three longtime Democratic states Trump won in 2016 that gave him the presidency, they cannot afford to take Minnesota for granted, even if it hasn’t voted Republican in a presidential race since Richard Nixon’s reelection in 1972. “Donald Trump can lose Wisconsin, Michigan and Pennsylvania but win Minnesota and get reelected,” he said. Munson, from the town of St. Michael, about 45 minutes northwest of Minneapolis, had plenty of company Thursday evening by way of devotion to Donald Trump. Jill Simons, a 46-year-old pediatrician, came from Edina, about 20 minutes southwest of the Target Center. She said she is not bothered by his asking Ukraine to investigate political opponent Joe Biden: “I think he has a right to.” Dustin Kluge, a 21-year-old Air Force airman who came to the rally wearing a “Space Force” T-shirt that Trump’s campaign has been selling since last year, said Trump was justified in asking a foreign government for help since all politicians do it. Nancy Vergin, who drove three hours from her home in Benson near the South Dakota border, called the House Democrats’ impeachment inquiry “stupid” and said she knew it would not succeed. “They can’t win at the ballot box.” During 102 minutes of remarks, Trump hit those themes and more, and in the tone that his fans love. On Joe and Hunter Biden: “Hunter, you’re a loser. Why did you get $1.5 billion, Hunter? And your father was never considered smart. He was never considered a good senator. He was only a good vice president because he understood how to kiss Barack Obama’s ass.” On a protester in the stands: “Go home to Mommy.” On accepting refugees in the United States: “We are keeping extremists, criminals and terrorists the hell out of our country.” On the news media: “These are very dishonest people. You understand that.” On his border wall: “That sucker is going up. It is the strongest. It is the finest. It’s steel. It’s hardened concrete. It’s deep. It’s high. It’s a thing of beauty. And it’s going to keep criminal aliens out of our country.” On Democratic Rep. Ilhan Omar, whose district encompasses the Target Center: “Congresswoman Omar is an America-hating socialist.” Trump even suggested that a backlash against Omar would help him win the state next year: “She is a big reason that I am going to win, and the Republican Party is going to win Minnesota in 13 months.” Tom Craft, a 37-year-old information technology consultant who most certainly was not attending the Trump rally, is not buying it. “I don’t think there’s any chance he’s going to win Minnesota,” he said, adding that he understands why so many cultural conservatives support him because he grew up in the rural, central part of the state. But even Republicans he knows in the city and suburbs who gave him a shot in 2016 have had enough of all the chaos. “I think Trump’s delusional.” As she introduced Second Lady Karen Pence at a “Women for Trump” gathering in neighboring St. Paul on Wednesday, state Republican Party chairwoman Jennifer Carnahan reminded the 250 or so who turned out that Democrats have won Minnesota in every presidential election since 1976 ― but that Trump came within 45,000 votes of winning without even trying very hard. “We have an incredible opportunity in 2020 to turn that tide,” she said. Doing so would be a major step toward delivering Trump a second term. Trump won 36 more electoral votes than he needed in 2016, but 46 of them came thanks to a total victory margin of 77,744 votes in Wisconsin, Pennsylvania and Michigan ― an average margin of 0.6%. Since then, a slowing economy caused in large part by Trump’s trade war has put those states in jeopardy for him. If he loses all three, and every other state goes the same way it did in 2016, Trump would fall 10 votes short of an Electoral College victory. And while the Trump campaign is also pushing hard in other states it narrowly lost ― New Hampshire and Nevada ― neither of them by itself would be enough to put Trump over the top. Minnesota would. Murtaugh said the Trump campaign fully intends to win Wisconsin, Pennsylvania and Michigan. Minnesota would simply remove all doubt. “If we win Minnesota, it’s lights out.” Of course, Trump received only 2,000 more votes in Minnesota in 2016 than Mitt Romney did in 2012. The difference between former President Barack Obama’s easy victory and Hillary Clinton’s narrow win was a drop-off of nearly 200,000 Democratic votes. What’s more, between 2016 and now, Minnesota has already had a statewide election: the midterm a year ago, when Democrats comfortably won both U.S. Senate seats and the governor’s race. They also easily unseated two Republican House members in the Twin Cities suburbs while losing two open Democratic House seats ― one by just 1,315 votes ― in rural areas. The main factor energizing Democratic voters in the suburbs has been Trump’s erratic behavior and untempered language, characteristics that Trump appears to see as a positive feature and continues to exhibit, particularly at rallies. Democratic pollster Peter Hart estimated that Trump’s hardcore base, those who will stick with him no matter what, probably represents no more than 9% of the total electorate. Hart said that appealing to that slice made sense in a crowded primary, such as Trump faced in 2016, but is counterproductive in a general election. “Hard to get a majority with that approach,” Hart said. The Trump campaign tacitly acknowledges that with its “Women for Trump” series of discussions, which pushes a quieter message that essentially tells women alarmed by Trump to ignore him and instead focus on things like the unemployment rate. “We know, it’s not so easy sometimes to be a Trump supporter,” said Lara Trump, wife of the president’s son Eric, at the Wednesday gathering. Both she and Karen Pence told their audience in St. Paul that touting the strong economy might be the best tactic. “This is a president that cares about your pocketbook,” Pence said.", 
      "date": "10/10/2019 11:46 pm ET"
    }, 
    {
      "subtitle": "The South Bend, Indiana, mayor and openly gay presidential candidate said he would overhaul FDA rules that ban sexually active gay men from donating blood.", 
      "author": "Sanjana Karanth", 
      "url": "https://www.huffpost.com/entry/pete-buttigieg-lgbtq-town-hall-blood-not-welcome-country_n_5d9fec43e4b02c9da047bf31", 
      "title": "Pete Buttigieg At LGBTQ Town Hall: ‘My Blood’s Not Welcome In This Country’", 
      "content": " South Bend, Indiana, Mayor Pete Buttigieg said at Thursday’s LGBTQ town hall that he would overhaul rules that prevent gay men who have been sexually active within the last year from donating blood. The 2020 Democrat, who is the first openly gay man to run for president, was asked at the town hall hosted by CNN and the Human Rights Campaign what he would do about the Food and Drug Administration’s blood donation policy that prohibits cis men who have had sex with cis men in the past 12 months from giving blood. Buttigieg responded by speaking about his own experience as a gay man leading South Bend’s annual blood drive. “I remember the moment when I realized that, unlike most initiatives that I spearhead, I can’t lead by example on this one, because my blood’s not welcome in this country,” he said. “And it’s not based on science; it’s based on prejudice.” The mayor said as president he would have the FDA revise its rules “based on evidence, based on individual risk factors and without regard to the prejudice that has driven the current policy.” Buttigieg’s appearance Thursday night in Los Angeles was a historic one, as an openly gay presidential candidate being moderated by Anderson Cooper, an openly gay journalist, at a town hall specifically dedicated to issues within the LGBTQ community. Buttigieg’s coming out experience happened after he came back from deployment in Afghanistan and when he had already been elected mayor, he said. The 37-year-old Indiana native told his story of coming out at last month’s Democratic debate, marking the first time in American history that the public had heard a presidential candidate openly talk about their coming out experience. Cooper asked Buttigieg on Thursday what his earlier years were like when he first realizing he was gay. “What it was like was a civil war, because I knew I was different long before I was ready to say that I was gay and long before I was able to acknowledge that that was something that I didn’t have power over,” he responded. “I so admire people who are coming out at young ages but also recognize that there’s no right age or right way or right time to come out,” he said. “I think people are ready when they’re ready. And for me, I was well into my 20s before I was really ready to say even to myself that I was gay.” Buttigieg has previously talked about his “internal war,” and his journey toward accepting and being proud of his sexuality. The town hall occurred the same day Buttigieg unveiled his sweeping LGBTQ plan, which includes tackling HIV/AIDS, overturning the transgender military ban and securing the passage of the Equality Act, which amends the Civil Rights Act to specifically ban discrimination based on gender identity and sexual orientation.", 
      "date": "10/10/2019 11:31 pm ET"
    }, 
    {
      "subtitle": "The campaign violated an agreement a year ago not to use any of Prince’s songs “going forward,” tweets the artist’s estate.", 
      "author": "Mary Papenfuss", 
      "url": "https://www.huffpost.com/entry/prince-estate-purple-rain-minneapolis-campaign-rally_n_5d9ff39de4b06ddfc5174fa2", 
      "title": "Prince’s Estate And Furious Fans Slap Down Trump’s Use Of ‘Purple Rain’ At Rally", 
      "content": " Representatives of Prince’s estate Thursday night immediately attacked President Donald Trump’s use of the late singer’s “Purple Rain” at a campaign rally in the late singer’s hometown. “President Trump played Prince’s ‘Purple Rain’ tonight at a campaign event in Minneapolis despite confirming a year ago that the campaign would not use Prince’s music,” the estate said in a Twitter message. “The Prince estate will never give permission to President Trump to use Prince’s songs.” The message included a letter from a lawyer for the Trump campaign dated nearly a year ago in response to a complaint from the estate. It said “without admitting liability, and to avoid any future dispute, we write to confirm that the campaign will not use Prince’s music in connection with its activities going forward.” Neil Young, Adele, the Rolling Stones and Elton John are among the many artists who have objected to the use of their songs by the Trump campaign. The complaint from the Prince estate came amid a cascade of furious tweets from Prince fans about the president’s use of “Purple Rain.”", 
      "date": "10/11/2019 12:25 am ET"
    }, 
    {
      "subtitle": "The former vice president reminisced about “gay bathhouses” and “round-the-clock sex” at the LGBTQ town hall on CNN.", 
      "author": "Josephine Harvey", 
      "url": "https://www.huffpost.com/entry/joe-biden-lgbtq-town-hall-gay-bathhouses_n_5d9fca2ce4b02c9da0479a2b", 
      "title": "Joe Biden Recalls ‘Gay, Gay Bathhouses,’ 24/7 Sex, And People Are So Confused", 
      "content": " On prime-time television Thursday night, Joe Biden reminisced about a time when LGBTQ discourse was all about “gay bathhouses” and ”round-the-clock sex” ― and viewers were not sure how to feel about it. The former vice president made the comments to CNN’s Anderson Cooper, who was moderating the Los Angeles town hall event, a forum for nine Democratic presidential candidates to discuss LGBTQ issues. After going on a tangent about stereotypes surrounding gay people, Biden concluded with a reflection on how the discourse about homosexuality had changed in recent years, compared with about two decades ago: “Remember, Anderson? Back 15, 20 years ago, when we talked about this in San Francisco, it was all about, well, gay bathhouses. It was all about round-the-clock sex. Come on, man. Gay couples are more likely to stay together longer than heterosexual couples,” he said. On a more serious note, Biden also discussed curtailing foreign assistance to countries who discriminate against LGBTQ citizens, the importance of passing the Equality Act in order to reduce hate crimes and protecting transgender people’s right to join the military. At one point, he referenced a time when he “came out” but rolled with the joke and walked across the stage to put his arm around Cooper, who is gay. “Well, that would be news,” Cooper joked back. “I kind of figured it out a while ago.” People on Twitter were very confused by, well, all of it. Although, there was one resounding thing viewers could agree with that they wanted out of this: A remix of “gay, gay, gay bathhouses.” It was quickly delivered:", 
      "date": "10/10/2019 11:35 pm ET"
    }, 
    {
      "subtitle": "President Donald Trump ranted against the Minnesota Democrat and vowed to prevent more Somalian refugees from entering the U.S.", 
      "author": "Carla Herreria", 
      "url": "https://www.huffpost.com/entry/trump-ilhan-omar-disgrace_n_5d9fdec4e4b06ddfc51730a2", 
      "title": "Trump Rips Rep. Ilhan Omar As ‘Fraud’ And ‘Disgrace’ During Rally In Her District", 
      "content": " President Donald Trump slammed Rep. Ilhan Omar (D-Minn.) while speaking at a rally in her home state on Thursday, calling her a “fraud” and “disgrace to our country.” “How the hell did that ever happen,” Trump said of Omar’s election to Congress in 2016. “How do you have such a person representing you in Minnesota?” President denounced Omar, a Somali American lawmaker, as an “America-hating socialist” and criticized her for using the phrase “some people did something” as she spoke about how the reaction to 9/11 affected the Muslim community in the U.S. Trump also described Omar as a “disgrace to our country.” His campaign held his rally in the Target Center in downtown Minneapolis, which is part of Omar’s voting district. “How do you have such a person representing you in Minnesota? She is a disgrace to our country,” he said, adding that she was the reason he was going to win Minnesota’s vote for reelection in 2020. Omar won the 5th Congressional District by a wide margin in the 2018 election. Omar is one of four Democratic congresswomen of color whom Trump sparred with this summer. The so-called “squad” included Omar as well as Reps. Alexandria Ocasio-Cortez (D-N.Y.), Rashida Tlaib (D-Mich.) and Ayanna Pressley (D-Mass.). Later in his rally Thursday night, Trump vowed to stop Somali refugees from coming into the country. Minneapolis has one of the largest populations of Somali refugees in the country. “For many years, leaders in Washington brought large numbers of refugees to your state from Somalia without considering the impact on schools, communities and taxpayers,” Trump said. “I promise you as president, I would give local communities a greater say in refugee policy and put in place enhanced vetting and responsible immigration controls.” In response, Omar called Trump’s attacks “xenophobic” and called for her supporters to donate to her campaign. Trump “shouted xenophobic conspiracy theories about me,” she tweeted Thursday night.", 
      "date": "10/10/2019 11:02 pm ET"
    }, 
    {
      "subtitle": "The president said Biden “was only a good vice president because he understood how to kiss Barack Obama’s ass.”", 
      "author": "Nick Visser", 
      "url": "https://www.huffpost.com/entry/trump-minnesota-rally_n_5d9fe91ce4b087efdbabb402", 
      "title": "Trump Lobs Insults At Biden, Omar In First Rally Since Impeachment Inquiry Began", 
      "content": " President Donald Trump went on a political rampage against anyone and everyone in his path during a campaign rally in Minneapolis on Thursday night, calling the impeachment inquiry into his behavior “insane” while lobbing a stream of unfounded conspiracy theories and vicious insults against many of his Democratic critics. “From day one, the wretched Washington swamp has been trying to nullify the results of a truly great and democratic election, the election of 2016. They’re trying, they’re not getting very far,” said Trump, who spent a majority of the rally going off-script. “They want to erase your vote like it never existed, they want to erase your voice and they want to erase your future. But they will fail because in America the people rule again.” Thursday’s event was the first since House Speaker Nancy Pelosi (D-Calif.) opened a formal impeachment inquiry into Trump’s July 25 call with the leader of Ukraine. During the conversation, Trump repeatedly pressed his counterpart, President Volodymyr Zelensky, to investigate one of his prime political rivals, Joe Biden, and his son Hunter Biden. Trump has maintained he did nothing wrong and has vehemently rejected assertions that he asked for a quid pro quo for releasing already-appropriated military aid to Ukraine. The president continued to attack the Bidens on Thursday, saying, without evidence, that they “got rich” and “sold out America” during the last administration. Hunter Biden served on the board of a Ukrainian energy company for a five-year period that ended in early 2019, but neither Biden has been accused of any wrongdoing. “He was never considered smart,” Trump said of Joe Biden. “He was only a good vice president because he understood how to kiss Barack Obama’s ass.” “True,” Trump said to a cheering crowd. “It’s true.” Biden, who spent the evening at a Human Rights Campaign event focused on LGBTQ issues, decried Trump’s message later that evening, saying America was “so much stronger than your weakness.” Trump also took aim at Pelosi, a frequent target of his ire, saying she was “either really stupid” or had “really lost it” when she announced the impeachment inquiry. “Or maybe there’s a certain dishonesty in there,” he said. During one of the president’s more venomous attacks, Trump took aim at Minnesota Rep. Ilhan Omar (D), calling her an “America-hating socialist” who was a “disgrace to our country.” “How do you have such a person representing you in Minnesota? I’m very angry at you people right now,” Trump said of the freshman congresswoman. “She is a disgrace to our country, and she is one of the big reasons that I am going to win and the Republican Party is going to win Minnesota.” Trump regularly turned from the teleprompter during the event, saying it was “much better when I go off-script.” During one such instance, he also acted out a bizarre conversation between former FBI agent Peter Strzok and FBI attorney Lisa Page. Thursday’s rally was emblematic of Trump’s latest attempts to turn the momentum behind the impeachment inquiry to favor his own political agenda. The White House has refused to comply with the House’s investigations, and the president’s campaign has been fundraising en masse since Pelosi first announced the impeachment proceedings. House Democrats, however, have remained undeterred, firing off subpoenas targeting many current and former Trump administration officials while telling the president that no one is above the law. This article has been updated with a reaction from Biden.", 
      "date": "10/10/2019 11:12 pm ET"
    }, 
    {
      "subtitle": "The presidential candidate had a sassy response for those who say marriage is between “one man and one woman.”", 
      "author": "Josephine Harvey", 
      "url": "https://www.huffpost.com/entry/elizabeth-warren-lgbtq-town-hall-zinger_n_5d9ff104e4b06ddfc5174b45", 
      "title": "Elizabeth Warren Drops A Total Zinger About Marriage At LGBTQ Town Hall", 
      "content": " Sen. Elizabeth Warren (D-Mass.) may as well have dropped the mic Thursday night after delivering a lippy response to a question about traditional views on marriage. Morgan Cox, chair of the Human Rights Campaign board of directors, asked the 2020 presidential candidate how she would respond if an “old-fashioned” supporter approached her on the campaign trail and said: “My faith teaches me that marriage is between one man and one woman.” “Well, I’m going to assume it’s a guy who said that, and I’m going to say, ‘then just marry one woman.’ I’m cool with that,” Warren fired back. “Assuming you can find one.” The audience erupted with cheers and laughter: In response to a follow-up question from CNN moderator Chris Cuomo, Warren said that, despite growing up in a conservative household, she couldn’t really recall a time where she felt differently about same-sex marriage. She cited the lyrics of a song she learned in church: “They are yellow, black and white. They are precious in his sight Jesus loves all the children of the world.” She said that, although her exposure to same-sex couples was gradual during her upbringing in Oklahoma, the hatefulness that could be directed at the gay community shocked her, particularly from people of faith. Warren also tackled how Democrats could expect to pass the Equality Act, medical care for transgender people in the military and correctional facilities, cost-reduction for HIV medications, and decriminalizing HIV transmission, among other topics. She had just released a wide-ranging LGBTQ policy plan Thursday morning.", 
      "date": "10/11/2019 12:11 am ET"
    }, 
    {
      "subtitle": "Experts warned the rule could discourage immigrants from seeking help, including for their U.S. citizen children.", 
      "author": "", 
      "url": "https://www.huffpost.com/entry/trump-public-charge-immigrants_n_5da0cae4e4b02c9da04a0d94", 
      "title": "U.S. Judge Blocks Trump Rule Limiting Visas, Green Cards For Poor Immigrants", 
      "content": "NEW YORK (Reuters) - A U.S. federal judge in New York on Friday temporarily blocked a Trump administration rule that would deny permanent residency to certain aspiring immigrants deemed likely to require government assistance in the future. The rule, which was finalized in August, vastly expanded who could be considered a possible “public charge” from someone who would be primarily dependent on the government to someone who might at some point need government help such as food stamps or housing vouchers. The Department of Homeland Security rule, pushed by Trump’s leading aide on immigration, Stephen Miller, was due to go into effect on Oct. 15. It will now be on hold while legal challenges against it proceed. Judge George Daniels of the Southern District of New York, issued a nationwide block of the rule, writing that plaintiffs were likely to succeed on the merits of their claims and would suffer “irreparable harm” if the rule were to go into effect. He wrote the government had failed to demonstrate why the current approach was inadequate. The rule, if it is ultimately allowed to go into effect, could be the most drastic of the Trump administration’s policies targeting the legal immigration system, experts have said.  The government has argued the rule is necessary to better ensure that immigrants will be self-sufficient. “The public charge standard was never intended to exclude working class immigrants from developing countries,” said Charles Wheeler, an attorney with the Catholic Legal Immigration Network, which is a plaintiff in the case. “This ruling confirms that the American dream remains open to them.” Reporting by Jonathan Stempel, Daniel Trotta and Kristina Cooke. Editing by Chris Reese and Cynthia Osterman.", 
      "date": "10/11/2019 02:38 pm ET"
    }, 
    {
      "subtitle": "The gunman accused of killing two people outside a Halle synagogue was using homemade firearms — a far cry from military-grade weaponry common in the U.S.", 
      "author": "Andy Campbell", 
      "url": "https://www.huffpost.com/entry/germany-shooter-would-have-killed-more-people-with-better-access-to-guns_n_5da085aae4b02c9da049400a", 
      "title": "Germany Shooter ‘Would Have Killed More People’ With Access To Better Guns", 
      "content": " The man accused of shooting two people to death in Halle, Germany, this week shares a lot of characteristics with American mass shooters: He’s a bigot with delusions of grandeur, and is part of an online community that fervently supports his hate. But one thing that set him apart ― and likely curbed the death toll in Wednesday’s shootings outside a synagogue ― was his choice of weapons. Police say he was armed with homemade guns that jammed repeatedly during the attack. American mass killers, on the other hand, typically strike with a cache of military-grade, semiautomatic weaponry. That’s in part due to Germany’s strict gun laws. Had the Halle shooter had access to better guns, the bloodshed could have been much worse, experts said. “It’s clear that if he had access to better weapons, the body count would have been higher,” said Vegas Tenold, a journalist and author with the Anti-Defamation League’s Center on Extremism. Tenold tweeted a photo of the shooter’s slam-bang tube, adding, “This is a direct result of Germany’s strict gun laws.” The shooter, in a gruesome, 36-minute video livestreamed on Twitch, used his improvised guns to kill two people after failing to get inside a synagogue filled with Yom Kippur worshippers. His guns ― including a so-called slam-bang tube and a homemade 9mm rifle ― repeatedly jammed or failed to fire as he attempted to shoot. He said he wanted to prove the effectiveness of rudimentary weapons in a country that makes it hard to obtain semiautomatic guns. Germany has some of the world’s strictest gun laws. All gun ownership is heavily regulated, and each legal purchase comes with a background check that considers addiction, mental health history, and criminal record. Gun buyers under 25 have to pass a psychological exam, and semiautomatic gun ownership requires special authorization. German gun laws were tightened after school shootings in 2002 and 2009. In turn, shooting incidents dropped dramatically, according to The Washington Post. Illegal weaponry and DIY guns are still a threat across much of Europe. But shooters need criminal connections to get their hands on semiautomatic firepower that is commonplace in America, said Nils Duquet, a weapons expert in Belgium with Flemish Peace Institute. “If you want to buy an illegal gun in Europe, what’s important is having the right networks. For assault rifles, you need better criminal connections,” Duquet told The Washington Post. “But there are many hot spots in Europe where you can try, and that is what’s worrying.” America’s gun laws, along with war-torn Yemen’s, are the world’s loosest. The U.S. is averaging more than one mass shooting per day this year. According to the nonprofit Gun Violence Archive, 329 mass shootings ― defined as an incident in which four people or more are shot, excluding the shooter ― have occurred in the U.S. in 2019. Military-grade, semiautomatic rifles are often easier to obtain in the U.S. than handguns, and they kill twice as many people as other types of weapons, according to researchers. “Active shooters are hell-bent on killing people,” Dr. Adil Haider, a trauma surgeon who was the lead author of a 2018 study on weapons used in “active shooter” incidents, told The Associated Press. “The big difference — and this is not such a big surprise — is if you give them a semiautomatic, they’re able to shoot twice the number of people.”", 
      "date": "10/11/2019 12:19 pm ET"
    }, 
    {
      "subtitle": "Oregon Rep. Peter DeFazio checks a lot of liberal boxes. But challenger Doyle Canning thinks he’s going easy on the president.", 
      "author": "Daniel Marans", 
      "url": "https://www.huffpost.com/entry/doyle-canning-peter-defazio-progressive-primary-challenge-democrats-oregon-donald-trump_n_5da0b70be4b02c9da049d348", 
      "title": "A Progressive Congressman’s Oversight Of Donald Trump Inspires Challenge From The Left", 
      "content": " The case for some progressive primary challenges is obvious. Those are the races where an incumbent Democrat in a safe seat has racked up a conservative voting record out of step with their constituents, used their seat for self-enrichment, or otherwise lost touch with their district. The theory behind challenging Rep. Peter DeFazio, 72, who has, since 1987, represented a seat in rural Oregon that now leans just barely Democratic, is more complex. DeFazio, who now serves as chairman of the House Transportation and Infrastructure Committee, is a member of the Congressional Progressive Caucus and longtime supporter of, among other progressive touchstones, “Medicare for All,” single-payer health care. But Doyle Canning, a 39-year-old community organizer and attorney who has announced a primary challenge against DeFazio, insists that the veteran congressman is past his expiration date. Canning, who hails from the liberal college town of Eugene, has some standard policy differences with DeFazio. Unlike the incumbent congressman in Oregon’s 4th Congressional District, she supports House Democrats’ legislation banning military-style “assault” rifles. She is also refusing to accept contributions from corporate political action committees, something DeFazio receives in abundance. Her hardest-hitting critique, however, is that as a committee chair, DeFazio has been milquetoast in his dealings with, and oversight of, the Trump administration. “This race is about the future ― of our district, of the country and of the Democratic Party,” Canning told HuffPost. “And we need leadership that is willing to take a stand against the corruption of the Trump administration.” DeFazio’s Transportation Committee is charged with oversight of federal government buildings, including the building that houses the Trump International Hotel in Washington; airplane manufacturers and the Federal Aviation Administration; and the conduct of the Secretary of Transportation. At one point or another in the past year, DeFazio has faced accusations of falling short in each of those three areas. DeFazio provided a lengthy statement defending his committee’s oversight; HuffPost also spoke to committee staff about their work. “I am running aggressive investigations to get answers about any number of Trump administration actions that fall within my Committee’s jurisdiction,” he said. Following a second major Boeing plane crash in March, which killed over 150 people, the Federal Aviation Administration grounded three of the manufacturer’s commercial airliners. The tragic crash prompted major questions about why the FAA, under Transportation Secretary Elaine Chao’s supervision, had failed to prevent the crashes. At the time, DeFazio suggested he would stop at nothing to obtain relevant communications about the scandal from both Boeing and the FAA. By early May, it emerged that Boeing knew about the absence of a warning light in one of the deadly planes, but delayed informing authorities, because it considered the light an optional feature available to customers paying a higher premium. But later that month, at a hearing on the crashes with Trump’s acting head of the FAA, DeFazio admitted that he still didn’t have the documents and did nothing to indicate he plans to use his subpoena power to get them. “I’m hoping that they will provide the documents we have requested voluntarily and in the not-too-distant future,” he said. In a May essay, Jeff Hauser, executive director of the Revolving Door Project, which monitors executive branch corruption, accused DeFazio of taking a softer line than Sen. Ted Cruz (R-Texas), who chairs the subcommittee on aviation and space. “We have had no serious inquiry into the collapse of government oversight of planes,” Hauser told HuffPost. Boeing’s CEO Dennis Muilenburg is due to testify before DeFazio’s committee on Oct. 30 ― more than seven months after the plane crash that prompted the FAA to ground planes. Matt Stoller, author of the forthcoming book “Goliath: The 100-Year War Between Monopoly Power and Democracy,” characterized DeFazio’s chairmanship unfavorably when compared to, among other colleagues, Rhode Island Rep. David Cicilline’s chairmanship of the House Judiciary Committee’s antitrust panel. “Cicilline is doing a great job investigating big tech. DeFazio needs to show that same urgency in investigating Boeing,” said Stoller, a former congressional aide, who now serves as a fellow at the antitrust-focused Open Markets Institute. “Being the party of the people means carrying on the legacy of [former California Rep.] Henry Waxman and [former Arkansas Rep.] Wright Patman, people who knew how to uncover the secrets powerful people don’t want the public to know.” Members of DeFazio’s committee staff told HuffPost that they are now sifting through hundreds of thousands of documents that they have obtained since May from both Boeing and the FAA. To call Muilenburg, the Boeing CEO, before the committee prior to obtaining those documents would waste the opportunity to grill him in a more informed way, they argued. They also said that forcing disclosure of documents through subpoenas could have delayed the process further by tying the committee up in court with legal challenges. Hauser did not buy those arguments. He maintains that there is no way to know whether documents shared voluntarily are as definitive as those that Boeing and the FAA would reveal if they had no choice. And he noted that the committee could have called Muilenburg in early on, when the political urgency was greatest, then recalled him a second time once the committee had assembled more documents. “Boeing is definitely happy with Chairman DeFazio’s oversight,” Hauser said. “The question is whether Chairman DeFazio is happy about that.” In his statement to HuffPost, DeFazio said that he was prioritizing substance over style. He noted that the has already held three hearings on the crashes, which have featured current and former Boeing employees, FAA officials and whistleblowers. “My record on safety and oversight is vast and determination dogged,” he said, citing his work on the ValuJet crash in the 1990s. “Anyone who knows my record knows that I fight for real results, not empty rhetoric.” Then there is the matter of DeFazio’s relative inactivity in response to Secretary Chao’s shady conduct. Chao is both the daughter of James Chao, a major Chinese shipping magnate, and the husband of Senate Majority Leader Mitch McConnell (R-Ky.). Politico reported in May that Chao has made a series of appearances indirectly promoting the company her father founded while serving as head of a federal agency overseeing the declining U.S. shipping industry in direct competition with companies like her family’s. Another Politico report just last week found that 25% of Chao’s meetings with local officials were with people from Kentucky, the state her husband represents in the Senate. The House Oversight and Reform Committee, which has broad supervision of the executive branch, has initiated an investigation into Chao’s conduct related to her family’s company, sending a letter to Chao in mid-September demanding documents related to her communication with the company. But DeFazio’s transportation committee, which has a narrower focus on Chao and her agency, has yet to pursue comparable action. The Transportation and Infrastructure Committee staff members who spoke to HuffPost said that given the committee’s resources it is letting the Oversight Committee take the lead on investigating Chao’s ethical queries, though it is acting in a supporting capacity. DeFazio’s committee is also in touch with the Department of Transportation’s inspector general to decide its next steps. Hauser, of the Revolving Door Project, considers it “feckless” that DeFazio has not called on Chao to testify before the committee either about Boeing, her own conduct or any other matter. (Committee staff said they would not hesitate to call Chao before the committee if they considered it necessary.) Critics of DeFazio’s tenure felt as though they had come across the secret to his motives in a Washington Post article at the end of August, which addressed a supposed lack of progress in the Transportation and Infrastructure Committee’s investigations into the Trump International Hotel in Washington. Trump built the hotel in the Old Post Office Building, which he is leasing from the federal government. That means that DeFazio’s panel has oversight over Trump’s apparent use of the hotel as a vehicle for self-enrichment over the course of his presidency. In the Post story, Rep. Dina Titus (D-Nev.), chair of the subcommittee overseeing the hotel, suggested that DeFazio was treading carefully in his investigations into the hotel in the hopes of negotiating infrastructure legislation with Trump. Titus subsequently took back the remarks, claiming the article “mischaracterizes” the progress that DeFazio’s committee has made. Shortly after the Post story came out, Titus joined a press release with DeFazio “correcting the record” on the committee’s work. The heart of the investigation, which began after Trump was elected in November 2016, entails requiring the General Services Administration, the agency that manages federal government buildings, to conduct an audit of the hotel. In his statement to HuffPost, DeFazio said that the GSA has handed over thousands of documents, but is still withholding many. He has given the administration a deadline to hand over the remainder and he will “not hesitate” to use his subpoena power to compel their release. The challenge for Canning is making the charges against DeFazio stick in a largely rural district that Democrats are hanging on to by a thread. Oregon’s 4th covers a large tract of land in the southwestern corner of the state, which was once home to a thriving timber industry. Eugene, which is home to the University of Oregon, and Corvallis, which is home to Oregon State, are blue dots in a sea of rural red terrain. As rural Oregon, like rural America, has trended away from Democrats, DeFazio has defied the fate of national Democrats. In 2016, DeFazio was re-elected by 16 percentage points, but Hillary Clinton edged out Trump in the same district by a mere 0.1 points. Canning, whose husband works at the University of Oregon, in many ways embodies the political leanings of the district’s liberal population hubs. She is a co-founder of the Center for Story-Based Strategy, a nonprofit that seeks to advance progressive causes through storytelling, and she has previously worked for an environmental justice organization that fights the racially disparate impacts of ecological depradation. Like many Democrats furious about Trump’s corruption and racism, Canning is calling for a sense of urgency to match the moment, including ruling out any significant cooperation with the administration until Trump is impeached. She took DeFazio to task on Twitter for suggesting that work on a federal highway bill, which would necessarily be bipartisan in order to pass, would proceed apace. DeFazio campaign manager Carly Gabrielson dismissed the criticism as contrary to Canning’s goals of taking action against climate change. “Under the Chairman’s direction, the House Transportation and Infrastructure Committee is moving legislation to implement the goals of the Green New Deal— goals that Doyle Canning claims to share, yet at the same time she believes that business should stop while Congress investigates Trump?” Gabrielson said. “You can’t have it both ways, and frankly it’s an absurd position.” HuffPost pressed Canning on the difficulty of prevailing against DeFazio in a rural swing seat. Canning responded that, like many progressive challengers before her, she is betting that a principled fighter is capable of expanding the electorate by turning out nonvoters. Among other groups, she wants to appeal to the growing number of eligible Latinx voters who moved to the district for work. “We’re building a coalition of the new face of the Democratic Party,” she said. “It’s younger, it’s more diverse, it’s more feminist, and it looks different than it did in ’86.”", 
      "date": "10/11/2019 02:52 pm ET"
    }, 
    {
      "subtitle": "St. Paul’s Betty McCollum is radically progressive on U.S. policy toward Israel. Why don’t you ever hear about it?", 
      "author": "Jessica Schulberg", 
      "url": "https://www.huffpost.com/entry/betty-mccollum-minnesota-israeli-palestinian_n_5d926349e4b0e9e760514c1f", 
      "title": "The Minnesota Congresswoman Who Can Criticize Israel", 
      "content": " Over the past few years, one member of Congress has stood up to the American Israel Public Affairs Committee (AIPAC), denounced Israel’s policies, which she likened to “apartheid,” and pushed laws that would place humanitarian conditions on U.S. military aid to Israel. Human rights advocates praise her, and she is popular in her progressive district. But she is neither the face of the progressive left nor the bogeyman of Fox News. Unless you’ve lived in Minnesota — or read MinnPost — there’s a good chance you’ve never heard of her. Her name is Betty McCollum, and she has represented St. Paul for almost 20 years. President Donald Trump — who loves to attack Rep. Ilhan Omar (D-Minn.), one of the first Muslim congresswomen, for her criticism of Israel — has never once tweeted McCollum’s name. That the Democratic congresswoman who leads the vanguard of progressive U.S. policy toward Israel in Congress is not the subject of constant bad-faith attacks from the right is a testament to her pragmatism. But it also exposes the inconsistency of the outrage campaign directed at Omar and the other members of the so-called “Squad,” a group of progressive first-term lawmakers who are all women of color. “Rep. Omar has a history of launching virulent anti-Semitic screeds,” Trump claimed at a campaign rally in Minneapolis on Thursday. “She is a disgrace to our country and she is one of the big reasons that I am going to win and the Republican Party is going to win Minnesota in 13 months,” he continued. Trump’s attacks on the Squad, which also includes Reps. Rashida Tlaib (D-Mich.), Alexandria Ocasio-Cortez (D-N.Y.) and Ayanna Pressley (D-Mass.), “are intentionally done to rile up the racist instincts of a portion of his base,” said Dylan Williams, of the left-leaning pro-Israel group J Street. “This double standard that’s being applied to these congresswomen is very clear, and it’s not a standard that has been applied to other congressional critics of Israeli policy and the occupation.” Omar, who is Black, Muslim and an immigrant from Somalia, represents “a perfect storm of characteristics that they could try to attack and portray as the problem to a white evangelical base,” said Yousef Munayyer, the executive director of the U.S. Campaign for Palestinian Rights. “Rep. McCollum,” Munayyer added, “didn’t fit the poster.” McCollum, who grew up in South St. Paul, trained as a social studies teacher. After she graduated, she had a hard time finding full-time work, so she took on long-term substitute teaching jobs and worked part-time at Sears. In 1984, McCollum’s toddler daughter fractured her skull falling off a playground slide that didn’t have enough sand at its base. The girl recovered quickly, but the city didn’t do anything about the playground until after McCollum pushed for it at a City Council meeting — a victory that prompted her to run for local office. She served on the City Council and in the Minnesota statehouse before she was elected to Congress in 2000. There is no one moment that prompted McCollum to become one of the most outspoken members of Congress on Israel and Palestine. She tends to talk about the conflict as just one of the many human rights crises bedeviling the world. As a lawmaker, she has shown a particular interest in policy aimed at protecting vulnerable kids: She has worked to provide HIV-AIDS assistance to orphans, prevent child marriage and fix crumbling schools for Native American children. In 2006, representatives of groups that provide humanitarian assistance to Palestinians warned McCollum of a looming humanitarian disaster. At the time, lawmakers were preparing to vote on the Palestinian Anti-Terrorism Act, a bill ostensibly intended to isolate Hamas, the group that has been designated by Israel and the U.S. as a terrorist organization and that had recently won a majority in the Palestinian parliament. The bill, humanitarian workers explained, would make it harder for aid organizations to provide lifesaving medical care to Palestinians. McCollum listened and was one of two members who voted against advancing the bill out of committee. The bill, which was backed by AIPAC, passed easily in the House. But McCollum’s dissenting vote set her up for a feud with one of the most powerful lobbying groups in the country. On a Friday after the vote, McCollum’s chief of staff, Bill Harper, got a phone call from Amy Rotenberg, an AIPAC member who had met with McCollum on behalf of the organization. McCollum’s “support for terrorists will not be tolerated,” Rotenberg said, according to Harper. Rotenberg, who declined an interview, described Harper’s characterization of the conversation as a “serious distortion.” “Bill Harper’s description of the conversation with me was false in 2006 and it is false now,” Rotenberg wrote. McCollum was shocked. She wrote a letter to AIPAC’s executive director slamming the group for attempting to use “threat and intimidation to stifle legitimate policy differences.” She banned AIPAC representatives from her offices pending a formal apology from the lobbying group. It was a lonely time to go up against AIPAC. J Street, the left-leaning alternative to AIPAC, didn’t exist yet. Members told McCollum that she had “written her death sentence,” she said. “I went, ‘OK, if I lose an election over standing up for medical supplies for kids, OK, I’m ready to go!’” McCollum said. “When I came back, the whisper kind of was, ‘You can survive!’” McCollum never got a public apology, but she did eventually let AIPAC representatives back into her office. “But they don’t bully her or do what they do to other members,” said Brad Parker, a senior adviser at Defense for Children International Palestine. McCollum wins reelections in her progressive district by huge margins — she received 91% of the vote in the 2018 primary and beat her Republican opponent by 36 percentage points. She has no interest in running for Senate, she said. In 2015, when a group of activists started organizing in opposition to Israel’s military detention of Palestinian children, McCollum’s office was one of the first places they visited on Capitol Hill. Palestinian human rights is an outlier issue on Capitol Hill — “You don’t even have access to a lot of offices; they don’t want to deal with Palestinian organizations,” said Parker, whose group briefed McCollum’s team on the issue. “Those barriers don’t exist with Betty.” They showed McCollum’s team a 2013 UNICEF report that described Israeli soldiers removing Palestinian kids from their homes in the middle of the night, blindfolding them and taking them to an interrogation center. The kids were beaten, deprived of sleep and forced to sign confessions in a language they did not understand, without a lawyer present, the report said. “It’s like, ‘Wait a second. We’re giving money, the U.S. government, to UNICEF, to do this report — and we’re giving money to the Israeli government to do the things that the report is about,’” Harper, McCollum’s chief of staff, said. “What’s wrong with this picture?” The U.S. currently gives Israel $3.8 billion a year in military aid. Since World War II, it has received more U.S. foreign assistance than any other country, according to the Congressional Research Service. Most countries that receive U.S. assistance are subject to extensive restrictions on how the aid is used. But for Israel, much of the money goes directly into its Ministry of Defense, with little American oversight, Harper said. In 2017, McCollum introduced a bill to block U.S. aid to Israel from being used to “support the military detention, interrogation, abuse, or ill-treatment of Palestinian children in violation of international humanitarian law.” She reintroduced the bill in April, this time with language that would amend the so-called Leahy law, which prohibits the U.S. from providing military assistance to foreign governments that commit “a gross violation of human rights.” The current bill would also set aside money to fund nongovernmental organizations that provide physical, psychological and emotional treatment for Palestinian children who have been detained by the Israeli military. Last March, the Minnesota delegation of American Muslims for Palestine traveled to Washington to meet with McCollum and talk about her bill. At the end of the meeting, McCollum tweeted out a picture of her posing with the group. The congresswoman didn’t think much of it — she tweets pictures of groups she meets with all the time. But Palestinian activists are used to being ignored by their elected officials, AMP chapter lead Mariam El-Khatib said. When El-Khatib saw the tweet, she thought, “Wow, she doesn’t mind being associated with AMP or Palestinians doing this kind of work.” The bill has 21 co-sponsors, all Democrats. Two additional Democrats withdrew their names as co-sponsors. When Rep. Debbie Dingell (D-Mich.) pulled her name, she tweeted that her “heart has always been with the children of Palestine” and that she was pushing leadership “hard” for a vote on a “resolution supporting a two-state solution.” McCollum pushed back: “Rep. Dingell removed her name from HR 2407, calling it ‘counterproductive to a peaceful, two-state solution,’” McCollum tweeted. “Does ongoing U.S. funding for Israeli military detention and abuse of Palestinian children promote peace or human rights violations?” McCollum estimates that if all of the members who told her in private they liked the bill were willing to support it publicly, she’d have another 20 co-sponsors. But she also knows the bill has almost no chance of making it out of the House Foreign Affairs Committee, headed by the staunchly pro-Israel Rep. Eliot Engel (D-N.Y.) — much less becoming law. Engel and Dingell did not respond to requests for comment. “It’s the obvious bill that still won’t get passed,” said Jaylani Hussein, head of the Minnesota chapter of the Council on American-Islamic Relations. Last year, McCollum accepted an award from the U.S. Campaign for Palestinian Rights. During her acceptance speech, she described Israel’s nation-state law — which reserves the right to self-determination in Israel for Jewish people — as a system of apartheid. For a sitting member of Congress to use the word “apartheid” in reference to Israel is radical — almost inconceivable. But her comments attracted almost no national attention. With the exception of fringe actors, such as Zionist Organization of American President Mort Klein, most of the people from the pro-Israel community who weighed in on her speech offered measured criticism. Steve Hunegs, of the Jewish Community Relations Council of Minnesota and the Dakotas, expressed disappointment with her word choice and her decision to attend the event, but he also emphasized her past support for a two-state solution. He didn’t accuse her of anti-Semitism. McCollum thinks the conversation about Israel is shifting among her colleagues. The leadership of Israeli Prime Minister Benjamin Netanyahu — who has vowed to annex parts of the West Bank — has Democrats concerned that prospects for a two-state solution are disappearing. Without a two-state solution, “do we have apartheid in Israel?” McCollum asked. “Do we have something similar to Jim Crow laws, which we had a struggle with in this country and we’re still facing the repercussions that are with race relations? Do we not say anything?” The conversation is slowly shifting, but it’s not hard to imagine what would have happened if Omar, the congresswoman who represents the district across the river from McCollum’s, had used the word “apartheid” in reference to Israel. Like McCollum, Omar has spoken out against the influence of AIPAC and criticized the right-wing government in Israel. But, unlike the more senior lawmaker, Omar’s critics usually assume the worst interpretation of her words. In the week immediately following Omar’s “It’s all about the Benjamins, baby” tweet — an observation that members of Congress are willing to infringe on Americans’ right to criticize Israel because of money directed their way by pro-Israel lobbyists — Omar was roundly accused of trafficking in anti-Semitic tropes about the influence of wealthy Jews. Her name was mentioned in 21 Fox News shows, 51 CNN shows and five MSNBC shows, The Intercept reported. Her name also appeared in nearly 500 newspaper articles, according to a Lexis Nexis search. Omar apologized after the “Benjamins” tweet and said she was grateful for colleagues and allies who educated her on the “painful history of anti-Semitic tropes.” Later that month, she spoke at a progressive policy town hall about her fear that her legitimate criticisms of Israel will be misconstrued as anti-Semitism because she is Muslim. She asked why she is allowed to criticize the influence of the National Rifle Association and Big Pharma but not the influence of the pro-Israel lobby. But people paid attention to only one line in her remarks: “I want to talk about the political influence in this country that says it is OK for people to push for allegiance to a foreign country.” Omar was talking about an effective political lobbying operation — one that includes plenty of evangelical Christians and is opposed by lots of American Jews. But Omar’s critics, including some liberals, insisted she was questioning the loyalty of American Jews. New York magazine’s Jonathan Chait proclaimed she no longer deserved “the presumption of good faith,” and Engel accused her of “invoking a vile anti-Semitic slur.” Within days, the House passed a resolution condemning all forms of anti-Semitism, listing “accusations of dual loyalty” alongside the neo-Nazi rally in Charlottesville, Virginia, and the massacre at a synagogue in Pittsburgh. McCollum’s staff say that the reason she doesn’t evoke the same reactions as Omar is because she is careful with her words and has spent years cultivating close relationships in Congress, including with leadership and members on the other side of the political spectrum. McCollum works “excruciatingly” hard to make sure that what she says about Israel is “based on evidence” and is backed on reports, Harper said. She goes out of her way to make clear that she is not attacking Jews or Israelis, but the policies of a government, Harper continued. I asked more than a dozen policy advocates and Capitol Hill staffers who work on Israeli-Palestinian issues about the disparate treatment between McCollum and Omar. All of them agreed that McCollum is careful and that she benefits from close relationships with her colleagues. But racism and Islamophobia are also part of the reason why Omar faces vitriolic backlash every time she weighs in on Israel while McCollum has gone relatively unnoticed, almost all of the advocates and Capitol Hill staffers said. “Undoubtedly, Rep. McCollum is one of the leading human rights champions on Palestinian human rights on the Hill, consistently for years, without fail,” said Beth Miller, the government affairs manager at Jewish Voice for Peace. “The fact that she has never been attacked in the way that Reps. Tlaib and Omar have been speaks to the racism and Islamophobia that is very present in this conversation.” Even if Omar used the same language that McCollum has in criticizing Israel, she would still be maligned as an anti-Semite, Munayyer argued. “You can try to be as careful as you want with your language, obviously it’s important that everyone should be careful with their language on this issue,” he said, “but when no matter what you say, you’re being attacked because of who you are. It’s not about what you’re saying, it’s about you having a voice on this issue.” From the outside, McCollum and Omar seem like the perfect duo to bring real change to the U.S. conversation around Israel: a veteran lawmaker who has goodwill among her colleagues and a fiery newcomer who isn’t afraid of raising hell. “People like Reps. Omar and Tlaib — and, to a certain degree, Bernie Sanders — are bringing much-needed attention to the occupation in ways that we’ve never seen before in Congress. But you also need workhorses like Rep. McCollum to quietly build consensus around legislation,” a senior Democratic Hill staffer said. “As in any movement, the two roles are complementary. You can’t make real change without both an inside and an outside strategy.” Omar, who, through a spokesperson, declined an interview, is a co-sponsor of McCollum’s bill — but most of the time, the two members do their own thing. “Ilhan is on the other side of the Mississippi River, and we talk sometimes in the break room in between votes,” McCollum said, adding that the same was true with Omar’s predecessors. But, at times, McCollum has seemed visibly annoyed with Omar and the controversies that surround her. In March, McCollum put out a rare statement on her Minnesota colleague: “Rep. Omar has the right to speak freely, and she also must take responsibility for the effect her words have on her colleagues, her constituents, and the policies Democrats seek to advance,” McCollum said. “Democrats have an important agenda to advance and for any Member of Congress to be successful it takes the support of at least 217 colleagues to pass a bill. No one does this job alone.” McCollum’s chief of staff put it more bluntly, “My own take on it is that she really derailed a lot of our work,” Harper said. But as anyone who has tried to talk, write or argue about Israel and the Palestinians knows, there’s no way to do it that will please everyone. “Given how detached the D.C. debate on Israel-Palestine is from the actual reality of what goes on there, there may be no way we move this debate closer to reality in a way that avoids tension entirely,” said Matt Duss, a foreign policy adviser to Sen. Bernie Sanders (I-Vt.). “We just have to do our best to be as honest and sensitive and constructive as we can, but it’s a debate we need to have.” This article has been updated to include a more extensive quote from Amy Rotenberg.", 
      "date": "10/11/2019 05:45 am ET"
    }, 
    {
      "subtitle": "There’s a direct line between John Solomon’s shaky allegations and the president’s brain.", 
      "author": "", 
      "url": "https://www.huffpost.com/entry/trump-ukraine-john-solomon-the-hill_n_5d9b9880e4b099389804c81b", 
      "title": "A Lot Of Trump’s Ukraine Conspiracy Theories Come From One Right-Wing Columnist", 
      "content": "Many of the allegations and fuzzy “facts” that President Donald Trump and his allies have cited to defend pressuring Ukraine to investigate Democratic rival Joe Biden gained traction in the press thanks to one journalist: John Solomon, whose stories and columns in The Hill have made him a Fox News regular (and now a contributor). Solomon, who announced plans to leave The Hill last month, is now under fire ― as he has been in the past ― for deviations from normal journalistic practice. In search of a convenient narrative, Solomon has embraced questionable sources and even shared a pre-publication copy of one story with a Ukrainian American businessman who federal authorities now say was illegally trying to influence American politics. Solomon’s articles are emblematic of the way the right-wing news pipeline to Trump functions: Shaky allegations get picked up by eager partisan journalists, who are then featured on Fox News where they grab the attention of the president. Last week, Solomon defended his decision to send a draft of a March 26 story on a Ukrainian anti-corruption organization to three Trump-associated operatives hours before its publication. The draft of his story ― titled “US Embassy pressed Ukraine to drop probe of George Soros group during 2016 election” ― was shown to Lev Parnas, an Ukrainian American associate of Rudy Giuliani’s who was arrested Thursday on charges of campaign finance violation, as well as frequent Fox News guests Joseph diGenova and Victoria Toensing. Solomon suggested this was part of his fact-checking process even though the story did not appear to concern those three beyond their interest in potentially damaging information about Trump’s opponents. “I typically spend a long period of time before any column or news story fact-checking information with numerous people,” Solomon tweeted. But Solomon’s dedication to “fact-checking information with numerous people” didn’t appear to extend to a main subject of his story, the Anti-Corruption Action Centre, which he suggested was “collaborating with FBI agents” who were investigating Trump’s then-campaign chair Paul Manafort. Solomon also suggested that AntAC, a Ukrainian organization, avoided an investigation because of the support of the Obama administration and billionaire George Soros, a common bogeyman for conservatives and target for conspiracy theorists. (AntAC receives funding from Soros’ Open Society Foundations, as well as from the U.S. government and a range of other donors.) Solomon never reached out to AntAC for comment about allegations made to him by former Ukrainian prosecutor general Yuri Lutsenko, according to AntAC’s executive director, Daria Kaleniuk. (Solomon’s story states that he repeatedly reached out to AntAC and Open Society Foundations, although he does not specify when.) And unlike the Republican operatives, Kaleniuk said AntAC received no draft of the article before The Hill published it. “I wonder why the same approach was not given to me, as he was naming my organization and he was actually sliming it,” Kaleniuk told HuffPost. Solomon did initially contact Kaleniuk in October 2018, many months before publishing his column in The Hill, saying he was “working on a story for publication Monday about the DOJ’s Kleptocracy Project and its success in Ukraine.” He asked for comment on a number of questions, including about connections between AntAC, Soros’ foundation and the FBI. Kaleniuk said she found the questions biased and conspiratorial and did not respond. Solomon did not publish anything to do with the Kleptocracy Project or Ukraine in the weeks after his email, according to The Hill’s archives. After Solomon’s story ran in March, Kaleniuk contacted The Hill’s editors requesting an opportunity to comment on the allegations against her organization. But her rebuttal clearly didn’t get as much traction: The Hill’s website says that Solomon’s original piece had over 36,000 shares, while Kaleniuk’s piece had just 118. A Twitter search of accounts run by The Hill or The Hill’s opinion section didn’t turn up any links to Kaleniuk’s piece, though the accounts did promote Solomon’s work. Solomon did not respond to a voicemail message and multiple emails from HuffPost. Editors at The Hill did not respond to requests for comment. Solomon has defended his journalistic practices on Twitter. In a series of tweets this month, he said he would sometimes send people a “summary of my reporting” before publication. But according to the Daily Beast, what Solomon sent to Republican operatives hours before his Ukraine story was posted online was no “summary.” It was a copy of his story ― headline, lede, and paragraph after paragraph. Solomon also tweeted that this was part of a fact-checking process that he had followed at every job he’d held, “starting when I was a young reporter at AP and continuing today at The Hill.” It is common for journalists to send a list of fact-checking questions to a subject of an article. But sharing full, unpublished drafts ― especially with partisan political operatives who are not directly involved in the story ― is a violation of journalistic standards that wouldn’t fly at his previous publications. “AP standards prohibit any behavior or activity that creates a conflict of interest, including sharing unpublished drafts of stories with sources,” a spokesperson for the Associated Press told HuffPost. Solomon said that he had over “three dozen communications over three days involved in the fact checking process for that particular story.” He said his fact-checking process could catch mistakes and lead to better context and comments. Solomon’s reporting has been a cause of concern for newsroom staff at The Hill, who have criticized his work for bias and shared their unease at his close ties to Trump associates. Over a dozen staff members sent a memo to The Hill’s management complaining about Solomon’s stories and accusing him of leaving out important context that didn’t fit his theories, The Washington Post reported last year. HuffPost last year debunked a misleading piece by Solomon that suggested FBI agents who’d exchanged anti-Trump text messages had leaked anti-Trump material to the media. They had not. Solomon was shifted to the role of “opinion contributor” following the staffers’ memo, according to The Daily Beast, while Solomon claimed he had requested the change. Questions have also been raised about the sources Solomon has used for his columns. His March series of stories on Ukraine ― a country with complex politics he had little prior history of covering ― carried a wide range of claims against U.S. Democratic officials and Obama-era appointees. He suggested that Ukrainian officials, urged along by then-U.S. Ambassador Marie Yovanovitch, conspired with Democrats to influence the 2016 presidential election and release damaging information against Trump. He also contended that then-Vice President Biden pressured the Ukrainian government to fire prosecutor general Viktor Shokin in order to quash an investigation into his son Hunter Biden, who had business ties in Ukraine. (Shokin was, in fact, widely criticized for not pushing corruption cases hard enough.) One of the main sources named in Solomon’s series on Ukraine was Yuri Lutsenko, who served as prosecutor general after Shokin. Many journalists, foreign policy experts and activists who focus on Ukraine have criticized the idea of treating Lutsenko as a reliable source, saying that he, too, is a discredited figure who has been an impediment to anti-corruption efforts. After the Trump administration recalled Ambassador Yovanovitch, Lutsenko texted AntAC’s Kaleniuk to brag about how he had gotten rid of the organization’s ally. Lutsenko has also repeatedly backtracked on his various claims, including telling the Los Angeles Times in late September that he never found any evidence of wrongdoing by the Biden family. Ukrainian authorities announced on Tuesday that they have launched a criminal investigation into Lutsenko over his alleged links to illegal gambling. Lutsenko, who traveled to the United Kingdom days before the announcement, has denied any wrongdoing. Nonetheless, Solomon boosted Lutsenko’s conspiracy claims against the Bidens, Yovanovitch and Clinton not only in his columns for The Hill but also on Sean Hannity’s Fox News show, which often serves as a direct pipeline to Trump. The president has tweeted about Solomon at least four times this year, usually in connection with the columnist’s Fox News appearances. After Solomon was on Hannity’s program in March, Trump tweeted, “John Solomon: As Russia Collusion fades, Ukrainian plot to help Clinton emerges.” He was quoting the headline of Solomon’s March 20 column, which was based on an interview with Lutsenko. Appearing alongside Solomon on Fox News that evening were diGenova and Toensing, two of the political operatives to whom he emailed his draft of a later March column. Solomon was back on Fox News nine days later, suggesting to host Laura Ingraham that Democrats were attempting to hide a conspiracy between Clinton and Ukrainian officials to target Trump during the 2016 campaign. “That’s what they don’t want people to start digging into,” Solomon said. “You’re digging in it. I’ve been reading your reporting on that,” Ingraham responded. “We look forward to the next report.”", 
      "date": "10/11/2019 06:05 pm ET"
    }, 
    {
      "subtitle": "A judge declared a mistrial after the jury was unable to reach a verdict on two counts against Frank Nucera, who was found guilty of lying to the FBI.", 
      "author": "Ryan J. Reilly", 
      "url": "https://www.huffpost.com/entry/frank-nucera-verdict-hate-crimes_n_5d9f2f29e4b06ddfc514fbf4", 
      "title": "Jury Hangs On Hate Crime, Civil Rights Charges Against Racist New Jersey Police Chief", 
      "content": " All 12 jurors deliberating the case against racist former New Jersey police chief Frank Nucera agree that he’s a liar: They’ve already convicted him of lying to the FBI. The former Bordentown Township police chief concedes he went on racist rants about nonwhite citizens that his underlings recorded. Two of his own officers testified under oath in federal court that Nucera slammed a Black teenager’s head into a metal doorjamb, and Nucera didn’t take the stand in his own defense. But a jury was unable to reach a verdict on two other charges ― hate crime assault and deprivation of civil rights under color of law ― that were directly related to the head slam his officers say he committed. U.S. District Court Judge Robert Kugler of Camden declared a mistrial on those two counts on Friday. U.S. Attorney Craig Carpenito announced after the mistrial that they’d retry Nucera on the outstanding counts. The jury began deliberations last Wednesday, and had held discussions for over 40 hours. The Philadelphia Inquirer reported that a white juror “stood in the jury box with his hands crossed when the panel solemnly filed into the courtroom” to deliver the verdict on the lying charge this week. The case against Nucera illustrated the challenges in holding officers accountable. Nearly two decades ago, according to The Trentonian, former Bordentown Township police officer Evan Jones says he was pushed out of the force after he filed an excessive force complaint about Nucera with the Burlington County Prosecutor’s Office. Current Bordentown Township Police Chief Brian Pesce testified that he had “lost all trust and confidence” that complaints about Nucera would be handled appropriately, and told the FBI that a former Burlington County Prosecutor told him to “let sleeping dogs lie” when he learned Nucera was under FBI investigation. Judge Kugler, according to the Inquirer, gave federal prosecutors until Nov. 13 to decide whether they would go to trial once again on the remaining counts. Nucera’s attorney said they’ll assess their options on the lying to the FBI conviction, and that Nucera “always... regretted” making those “ugly and embarrassing” comments.” “He’s held his head high throughout this process,” said Rocco Cipparone. “He’s handled it with grace and dignity.” This has been updated with Carpenito’s announcement that prosecutors will retry Nucera.", 
      "date": "10/11/2019 11:47 am ET"
    }, 
    {
      "subtitle": "Bureau of Land Management chief William Perry Pendley repeatedly dodged questions at an environmental journalism conference.", 
      "author": "", 
      "url": "https://www.huffpost.com/entry/william-perry-pendley-climate_n_5da0bcffe4b087efdbaddc0b", 
      "title": "U.S. Public Lands Chief Says His Position On Climate, Immigrants Don’t Matter", 
      "content": "FORT COLLINS, Colo. ― William Perry Pendley, the controversial acting director of the Bureau of Land Management, told a room full of journalists on Friday that his opinions on climate change and immigrants are “irrelevant” to his job overseeing 245 million acres of public land. Speaking on a panel at the Society of Environmental Journalists’ annual conference, Pendley, a conservative lawyer who has spent his career fighting federal land protections and environmental regulation, sparred repeatedly with reporters. He refused to comment about his past statements that cast doubt over basic climate science and compared immigrants to a “cancer.” He also repeatedly responded to questions by saying, “I disagree with your premise.” As recently as February, Pendley compared the climate crisis to a “unicorn” because “neither exists.” Asked to clarify his position on Friday, he deferred to his boss, Interior Secretary David Bernhardt, a former oil lobbyist who has said he hasn’t lost sleep over soaring atmospheric carbon dioxide and blamed Congress for his own inaction on climate. Bernhardt had been scheduled to appear at the conference but canceled. “I’m not a scientist, I’m a lawyer,” Pendley said. “I defer to the secretary. He’s been very clear on this subject. He believes that climate change is real, that mankind has an impact, that we’re unable to project future climate conditions, but that we need to understand the consequences.” Asked again about his own views, Pendley balked: “Nope, I’m not going to clarify. Those are my personal opinions,” he said. “I’m a Marine. I follow orders.” Pendley added that he has not been briefed on climate impacts to America’s public lands in the three months he’s been acting head of the  BLM. In 2007, Pendley referred to undocumented immigrants as “spreading like a cancer” in a fundraising mailer for his legal fund resurfaced by CNN this week. When pressed on Friday about the statement, Pendley brushed off the question entirely. “My personal opinions are irrelevant,” he said. “I have a new job now. I’m a zealous advocate for my client. My client is the American people and my bosses are the president of the United States and Secretary Bernhardt. What I thought, what I wrote, what I did in the past is irrelevant. I have orders, I have laws to obey, and I intend to do that.” Pendley didn’t hesitate, though, to slam Democratic presidential candidates who have pledged to stop new fossil fuel leasing on public lands for fossil fuel development if elected. “Such a policy would be absolutely devastating; it would be absolutely devastating not just to the American West, but to the entire country,” he said.  Leaving fossil fuels in the ground, he added, would be “absolutely insane” and “a terrible blow to the American people.” The room, as moderators requested, refrained from clapping or booing throughout the panel, which included a gas company executive, the Fort Collins mayor, an American Indian studies academic, an environmentalist and a representative of the outdoor recreation industry. But at one point, the audience in the packed auditorium at Colorado State University gasped as Pendley abruptly interrupted a Denver Post reporter as she asked a follow-up question, saying, “You want to ask a question and get an answer or do you want to keep talking?” Pendley was asked about the BLM’s decision in May to scrub language about land stewardship from its news releases, which now exclusively highlights the economic value of America’s public lands. He initially shrugged and whispered inaudibly to Shea Loper, the U.S. government relations chief for the Canadian gas giant Encana Corp. He said he was unable to speak to the decision because it occurred before he arrived at the agency. “I can’t respond to your question,” he said. “I’m sorry.” At the end of the discussion, panelists were asked what they view as the biggest threat facing public lands today. Pendley responded, “I’ll get really in the weeds. I think the biggest issue I see is the wild horse and burro issue. We have 88,000 wild horses and burros on our Western federal lands. They are causing havoc on the lands.”", 
      "date": "10/11/2019 02:36 pm ET"
    }, 
    {
      "subtitle": "“It’s time to get in impeachment formation,” one person responded on Twitter. “You’ll NEVER be The Boss,” added another.", 
      "author": "Lee Moran", 
      "url": "https://www.huffpost.com/entry/donald-trump-beyonce-jay-z-springsteen-backlash_n_5da031e1e4b087efdbac2178", 
      "title": "Donald Trump Belittles Beyoncé, Jay-Z, Bruce Springsteen And Invokes Fans’ Fury", 
      "content": " Hip-hop and rock fans united in their condemnation of Donald Trump after the president went after Beyoncé, Jay-Z and “The Boss” Bruce Springsteen during a campaign rally in Minneapolis on Thursday night. Trump bragged about the size of the crowds he attracted during the 2016 campaign and mocked his then-Democratic rival Hillary Clinton, who had a series of high-profile musicians perform at her events. “I didn’t need Beyoncé and Jay-Z,” said Trump. “And I didn’t need little Bruce Springsteen and all of these people.” Trump then claimed, without offering any evidence, that musicians like Springsteen would sing two songs at Clinton’s rallies before leaving and taking most of the crowd, while “she is still talking in front of the same lousy crowd.” The three artists haven’t responded publicly to Trump’s comments. Springsteen has previously said Trump is “deeply damaged at his core,” but predicted he’ll win reelection in 2020. Jay-Z has called Trump a “superbug.” Trump’s comments were condemned on Twitter, where one person backed Beyoncé by saying said “it’s time to get in impeachment formation” and another showed support for Springsteen by telling Trump “you’re President of the United States but you’ll NEVER be The Boss.” Democratic 2020 presidential candidate Sen. Cory Booker (D-N.J.) also chimed in:", 
      "date": "10/11/2019 04:43 am ET"
    }, 
    {
      "subtitle": "Republicans defended the president’s suggestion that China should investigate Joe Biden as a joke. But Trump isn’t laughing.", 
      "author": "Josephine Harvey", 
      "url": "https://www.huffpost.com/entry/trump-china-joke-republicans_n_5da00506e4b06ddfc5175d35", 
      "title": "Trump’s Not Rolling With GOP Theory He Was ‘Joking’ About China Probing Bidens", 
      "content": " President Donald Trump was given a chance Thursday to say whether his suggestion that China investigate his political rival Joe Biden was a joke ― and he passed. Trump, asked by reporters on the White House lawn if he had meant his comments in jest, replied: “China has to do whatever they want. If they want to look into something, they can look into it. If they don’t want to look into it, they don’t have to.” He added: “Frankly, as far as I’m concerned, if China wants to look into something, I think that’s great. And if they don’t want to, I think that’s great too. That’s up to China.” Trump told reporters last week that China should start an investigation into Joe Biden and his son Hunter Biden. He made the comments amid impeachment proceedings prompted by his July 25 phone call with Ukranian President Volodymyr Zelensky, in which he requested that foreign government’s aid in digging up dirt on Biden. Multiple Republican lawmakers, when asked if they believed Trump’s China comments were appropriate, defended them as being a joke, including Sen. Marco Rubio (R-Fla.), Rep. Jim Jordan (R-Ohio.), Sen. Roy Blunt (R-Mo.), and Rep. Kevin McCarthy (R-Calif.). “Do you really think he was serious about thinking that China is going to investigate the Biden family?” Jordan said last week. McCarthy commented: “You watch what the president said, he’s not saying China should investigate.” The president’s exact words were: “China should start an investigation into the Bidens.” Trump’s response on Thursday did not suggest he was joking about China. CNN reported last week that Trump raised the topic of Biden’s political prospects during a June 18 phone call with Chinese President Xi Jinping, according to sources familiar with the call. The call record was stored on the same highly secure White House computer system used to house the summary of Trump’s Ukraine call. Trump’s entreaties to China followed GOP questions over Hunter Biden’s position on the board of a Chinese private equity fund in 2013, while his father was the vice president. He accompanied his father on an official trip to China during that time.", 
      "date": "10/11/2019 06:39 am ET"
    }, 
    {
      "subtitle": "Since 2018, the troubled office space company has operated an expensive private school in Manhattan.", 
      "author": "Rebecca Klein", 
      "url": "https://www.huffpost.com/entry/wework-school_n_5da074dbe4b02c9da049128c", 
      "title": "WeWork Is Closing Its Private School In New York City After This Year", 
      "content": " WeWork informed parents on Friday that it would no longer operate its private school in Manhattan after the 2019-20 school year, HuffPost has learned. “WeWork will continue to operate WeGrow through the remainder of the 2019-2020 school year, providing a quality education and classroom experience for all students,” a WeWork spokesperson said in a statement. “As part of the company’s efforts to focus on its core business, WeWork has informed the families of WeGrow students that we will not operate WeGrow after this school year.” “WeWork and the families of WeGrow students are engaging in discussions with interested parties regarding plans for WeGrow for the following school year,” the spokesperson added. The small New York City private school has been open since 2018 and costs between $22,000 and $42,000 a year in tuition, depending on the age of the student. Its website calls it a “conscious entrepreneurial school,” offering students mentorship from WeWork employees, weekly trips to a farm, daily meditation and yoga, while preaching lofty goals about nurturing students’ souls. HuffPost spoke with several people close to the school in the past few weeks to get a better sense of the institution. They described a school that is run like the company of WeWork, subject to constant changes or “disruption,” sometimes without full consideration for the children these changes impact. However, they also described an idealistic learning space, where children for the most part seem to be happy and thriving. According to one former employee, the company recently redesigned part of the school, which they speculated cost up to several million dollars (a spokesperson for WeWork did not respond to questions about this). The school is a casualty of the company’s new efforts to downsize after the implosion of its planned public offering and a staggering reduction in its valuation. The past few weeks have been chaotic for the company, which rents out shared workspaces to businesses and entrepreneurs. Its CEO and co-founder Adam Neumann stepped down and there are rumors of mass layoffs that could impact thousands of employees. Amid the chaos, WeGrow parents wondered whether the school would even make it through the year, lining up backup options in case of an abrupt shuttering. “Parents and administrators are exploring all options to keep WeGrow open,” said parent Jessica Ducroux on Friday morning. The school was the brainchild of WeWork co-founder and chief brand and impact officer Rebekah Neumann, who served as the school’s CEO before stepping down from her roles at the company with her husband, Adam. Indeed, WeGrow mimicked WeWork, as the school’s day to day was sometimes rejiggered on short notice, which could be incompatible with the needs of children, sources said. The WeWork spokesperson did not comment on this characterization of school life at WeGrow. A representative for the Neumanns did not immediately have comment. But by its second year, the school’s enrollment had grown to about 100 students, including a number of children whose parents worked for the company. In 2018, Rebekah Neumann called the school ― and the ability to bring company employees closer to their children ― part of WeWork’s core goals, according to CNN. “We want to make a world where people can work to make a life and not just a living, but that’s part of a larger, more holistic mission to elevate the world’s consciousness, to create a world where people are happy and fulfilled and living in a sharing state,” she said. Indeed, the school employs staffers with titles like “creative expressions manager” and “manager of wisdom cultures.” In recent weeks, teachers have worked to shield kids from the disarray enveloping the larger company, according to a WeGrow parent. This parent praised the school for nurturing children’s social-emotional development, as opposed to perpetuating a rat race focused on test scores and achievement, and worries that the school’s true successes ― its focus on mindfulness and community building ― will be overshadowed by schadenfreude over WeWork’s shortcomings. The school ― like WeWork spaces ― emphasizes design, and is complete with “modular classrooms, tree houses and a vertical farm,” per the school’s website. WeGrow is one of WeWork’s auxiliary offerings. The company also rents out furnished apartments and has a gym. Rebekah Neumann appears to have had high ambitions for the institution, previously telling CNN that she hoped a WeGrow would operate in every city where there’s a WeWork office. “It will eventually be able to sustain independently for sure,” she said at the time.", 
      "date": "10/11/2019 10:01 am ET"
    }, 
    {
      "subtitle": "Faced with an impeachment inquiry, President Donald Trump has openly defied the core constructs of the Constitution.", 
      "author": "", 
      "url": "https://www.huffpost.com/entry/trump-impeachment-inquiry-constitution-above-the-law_n_5da06a90e4b06ddfc5187998", 
      "title": "Trump vs. The Constitution: In Impeachment Inquiry, Trump Insists He’s Above The Law", 
      "content": "NEW YORK (AP) — Donald Trump has spent his time in office trying to bend the conventions of the American presidency to his will. Now he appears to be trying to override a core principle of democracy: that no one is above the law. Faced with an impeachment inquiry, Trump has openly defied the core constructs of the Constitution. He chafes at the idea of co-equal branches of government and rejects the House’s right to investigate him. He has deployed a convoluted logic in which he has declared that the courts can’t investigate him because as president he cannot be charged with a crime but also that Congress cannot impeach him because its inquiry is politically illegitimate. It’s a “heads he wins, tails you lose” formulation. “It’s anathema to his character and his life story to be checked and balanced by anything,” said presidential historian Jon Meacham, a professor at Vanderbilt University. “The Constitution was formed to contain appetite. And we now have the president who is driven entirely by appetite.” In a scathing eight-page letter this week, the Republican president’s lawyers served notice there will be no cooperation with the impeachment inquiry. Trump’s White House has ignored document requests and subpoenas. It readily invokes executive privilege — going so far as to argue that the privilege extends to informal presidential advisers who never held White House jobs. And his team all but dares Democrats to hold them in contempt. The impeachment standoff follows a pattern Trump has established throughout his presidency as he has jettisoned experienced advisers and flouted conventions. The fact that he survived the special counsel’s Russia investigation without paying much of a political penalty left him all the more emboldened. One day after Robert Mueller’s faltering testimony brought an end to that threat, Trump unleashed a new one by asking Ukraine’s president to investigate his political foe Joe Biden. That prompted the fast-moving impeachment inquiry that Trump now resists. After two weeks of a listless and unfocused response to the impeachment probe, the White House letter to Democratic House Speaker Nancy Pelosi this week was a declaration of war. While it was filled with dubious legal arguments, its intent was clear: Trump would not play ball, claiming that the game was rigged against him. As for all the subpoenas flying from House Democrats, an exasperated Trump said Thursday, “You’re running a country, I just don’t think that you can have all of these people testifying about every conversation you’ve had.” And as for the Democrats, Trump claimed Wednesday they’re the ones playing dirty “because they have a tiny margin in the House.” “They have eviscerated the rules,” he said. “They don’t give us any — any fair play. It’s the most unfair situation people have seen.” The Constitution gives the House “the sole power of impeachment.” But it confers that authority without providing any guidelines, which the White House has seized upon in demanding that Pelosi call for a vote to authorize the inquiry as happened in the last two impeachment inquiries. No vote is required, and Trump’s strategy risks further provoking Democrats in the impeachment probe, setting up court challenges and the potential for lawmakers to draw up an article of impeachment for obstructing their investigations. “The president does not have all-consuming power,” said Nick Ackerman, a member of the Watergate prosecution team that investigated President Richard Nixon. “We play by certain rules, and we expect the rule of law to apply. We don’t have checks and balances if he ignores them. That itself is an impeachable defense, which is what Nixon faced.” It is unclear whether Democrats would wade into a lengthy legal fight with the administration over documents and testimony or if they would just move straight to considering articles of impeachment. Trump, for his part, has never been one to rely on legality or logic in making his arguments. In the last week alone, he called for the impeachment of Sen. Mitt Romney and Rep. Adam Schiff — events that can’t occur — and in part justified his decision to withdraw U.S. troops from Syria, leaving the Kurds vulnerable to Turkish attacks, by saying the Kurds did not assist at Normandy during World War II. Since taking office, he has taken repeatedly taken unilateral action to defy Congress and push the limits of his own power, declaring a national emergency so he could divert funds for a border wall and taking executive action to try to halt immigration from several Muslim-majority nations. Trump on Thursday punctuated a tweet about unfair media coverage with four words that seemed to sum up his entire viewpoint of the American system: “Oh well, I’m President!” The Constitution was built to withstand tests like this. “Both the strength of the American system and one of its most frustrating aspects is that it’s incredibly difficult to do anything quickly, particularly bad things, which the founders believed would happen more often than good things,” Meacham said. “Checks and balances were created so one bad actor could not dominate the proceedings. We now have that bad actor.” ___ EDITOR’S NOTE — Jonathan Lemire has covered politics and the White House for The Associated Press since 2013. ___ Follow Lemire on Twitter at http://twitter.com/@JonLemire", 
      "date": "10/11/2019 07:54 am ET"
    }, 
    {
      "subtitle": "The Council on American-Islamic Relations condemned the president’s Minnesota rally speech in which he targeted the state’s Somali refugee population.", 
      "author": "Amy Russo", 
      "url": "https://www.huffpost.com/entry/cair-condemns-trump-minnesota-rally-anti-somali-refugee-speech_n_5da09626e4b06ddfc518f1eb", 
      "title": "Major Muslim Civil Rights Group Rips Trump’s ‘Vile’ And ‘Disturbing’ Refugee Rant", 
      "content": " The country’s largest Muslim civil rights organization has condemned President Donald Trump’s “vile” and “corrosive” fearmongering aimed at Somali refugees during his campaign rally in Minnesota on Thursday night. The Council on American-Islamic Relations and its Minnesota chapter slammed Trump’s speech in Minneapolis in which he singled out the state’s Somali-born Democratic Rep. Ilhan Omar as an “America-hating socialist” before broadening his attacks to the local Somali refugee population as a whole. “Last night’s racist rant targeting Somali-Americans is just the latest example of Donald Trump’s use of white supremacist and anti-immigrant rhetoric to advance his twisted political agenda by dividing our nation along racial, ethnic and religious lines,” Nihad Awad, CAIR’s national executive director, said in a statement Friday. “It is all the more disturbing that the almost all-white audience welcomed this overt racism and that Republican political leaders remain silent or even support such bigotry.” During his speech at Minneapolis’ Target Center, Trump prompted boos from the audience when he said the state’s Somali refugees had been welcomed by Washington politicians “without considering the impact on schools and communities and taxpayers.” Continuing, he boasted of his plan to slash refugee resettlement by nearly 85% from 2016 levels, declaring that “in the Trump administration, we will always protect American families first, and that has not been done in Minnesota.” “We’ve also implemented the strongest screening and vetting mechanisms ever put into place,” he added. “We are keeping terrorists, criminals and extremists the hell out of our country.” Rebuking Trump’s scare tactics, Awad warned of their consequences. “Trump’s vile views and policies are having a corrosive effect on the ties that bind our nation together, and if left unchecked by those who value American traditions of inclusion and mutual respect, will do untold damage to our democracy,” he said. Jaylani Hussein, executive director of CAIR’s Minnesota branch, also called out the president’s “hate rhetoric,” raising concerns that it “places the entire Somali community in Minnesota and nationwide in danger from the growing white supremacist movement that looks to him for validation and encouragement.” Awad and Hussein’s remarks added to criticism from Democratic presidential candidate Sen. Amy Klobuchar, who also represents Minnesota. “Immigrants and refugees have helped make our state a wonderful place to live and work — which is far more than this President has done,” she tweeted Thursday. “Stop using immigrants and refugees as political pawns!” Another 2020 hopeful, former Rep. Beto O’Rourke (D-Texas) echoed Klobuchar’s remarks, tweeting that next week, Trump will bring “this same message of hate” at his Dallas rally next week, though O’Rourke plans to hold a counter-rally titled “Rally Against Fear﻿” to “show he doesn’t represent our country.”", 
      "date": "10/11/2019 01:59 pm ET"
    }, 
    {
      "subtitle": "The 81-year-old actress was outside Congress to demand that lawmakers take action to address the “existential threat” of climate change.", 
      "author": "Jenna Amatulli", 
      "url": "https://www.huffpost.com/entry/jane-fonda-climate-change-arrest_n_5da0c20be4b06ddfc5197bbf", 
      "title": "Jane Fonda Arrested At U.S. Capitol During Climate Change Protest", 
      "content": " Hollywood legend Jane Fonda was arrested alongside other climate change activists outside the U.S. Capitol on Friday after being repeatedly asked to leave. Fonda can be seen in the above video holding a sign that says “Vote. Speak. Act.” and “No new fossil fuels!” The 81-year-old actress was outside Congress to demand that lawmakers take action to address the “existential threat” of climate change, according to CBS affiliate WUSA9. “We have to be sure that the crisis that is climate change remains front and center like a ticking time bomb,” Fonda told the outlet. “We don’t have very much time, and it’s really urgent.” The Academy Award winner and lifelong activist was apparently inspired by Swedish youth climate activist Greta Thunberg. At 16, Thunberg has already become a major force in raising public awareness about the dangers of climate change and delivered a powerful speech to world leaders at the United Nations climate summit last month. Thunberg’s words informed Fonda’s decision to move to Washington for four months and spend every Friday attending “Fire Drill Friday,” which ABC News reports is “a weekly event featuring scientists, celebrities and activists addressing the various facets and impacts of climate change.”", 
      "date": "10/11/2019 02:25 pm ET"
    }, 
    {
      "subtitle": "The 2-1 ruling went against the president, who was seeking to block a subpoena for documents, including tax returns, held by his accounting firm.", 
      "author": "Paul Blumenthal", 
      "url": "https://www.huffpost.com/entry/trump-financial-records-democrats-subpoena_n_5da08f0de4b06ddfc518deda", 
      "title": "Appeals Court Rules House Democrats Can Subpoena Trump’s Financial Records", 
      "content": " The D.C. Circuit Court of Appeals on Friday upheld a subpoena that House Democrats sent to President Donald Trump’s accounting firm for his financial records and tax returns. The court issued a 2-1 ruling﻿ that the House Oversight & Reform Committee has the constitutional authority to investigate wrongdoing by the president of the United States and can therefore subpoena his financial records in pursuit of that investigation. The subpoena was initially filed by the committee to Mazars LLP, the president’s accounting firm, as part of its pursuit to evaluate and update existing ethics legislation. It came after former Trump lawyer Michael Cohen told the committee that the president routinely manipulated his finances to obtain loans and evade taxes. Lawyers for the committee argued that the pursuit of these documents was part of its legislative function as it evaluated new executive branch financial disclosure and conflict of interest laws. Trump’s personal lawyers intervened to argue that the House did not have a legitimate legislative purpose in pursuing the documents from the accounting firm and that the only valid way to subpoena any document connected to the president was through an impeachment. The two judges who voted to uphold the subpoena ― David Tatel, appointed by President Bill Clinton, and Patricia Millett, appointed by President Barack Obama ― ruled that the committee was acting under its legislative function in pursuit of potential legislation. They also ruled that the committee issued its subpoena under valid authority granted by House Rules and the Constitution. In doing so, Tatel and Millett upheld multiple precedents enabling congressional investigations into the executive branch that could uncover law-breaking and other wrongdoing. The judges knocked down arguments made by Trump’s lawyers that the public statements of committee members showed the committee was not pursuing a legitimate legislative purpose, but rather an unconstitutional law-enforcement action targeting the president. “Following that course, we conclude that the public record reveals legitimate legislative pursuits, not an impermissible law-enforcement purpose, behind the Committee’s subpoena,” Tatel and Millett wrote. “As a result, we need not decide precisely what deference we owe Congress, as we would reach the same conclusion absent any deference at all.” They also found that the committee was pursuing legislation that could be enacted. Trump’s lawyers tried to argue that the legislation would be found unconstitutional and therefore was not legitimate. “[W]e detect no inherent constitutional flaw in laws requiring Presidents to publicly disclose certain financial information. And that is enough,” the majority opinion reads. Their ultimate conclusion: “At bottom, this subpoena is a valid exercise of the legislative oversight authority because it seeks information important to determining the fitness of legislation to address potential problems within the Executive Branch and the electoral system; it does not seek to determine the President’s fitness for office.” Judge Neomi Rao, a Trump appointee, issued a dissent that broke with long-standing Supreme Court precedent by arguing that Congress has no right to investigate the president except under its impeachment authority. “[A]llegations of illegal conduct against the President cannot be investigated by Congress except through impeachment,” Rao wrote in her dissent. Such a determination would overturn a 1962 Supreme Court precedent that “a congressional committee which is engaged in a legitimate legislative investigation need not grind to a halt whenever...crime or wrongdoing is disclosed.” “The dissent would reorder the very structure of the Constitution,” Tatel and Millett argue in their majority opinion. “Throughout history, the Constitution has left to Congress the judgment whether to commence the impeachment process. But the dissent’s approach would not even allow Congress to make the quintessentially legislative judgment that some concerns about potential misconduct or illegality are better addressed through oversight and legislation than impeachment.” If Rao’s opinion overturned past precedent, Congress would be left with no recourse to investigate impeachable executive branch officials for wrongdoing unless it immediately opens an impeachment inquiry. This would gut congressional investigatory powers and tilt the balance of power between the branches of government even further to the benefit of the executive branch. House Democrats previously leaned on this case as an argument against pursuing impeachment earlier in 2019. House Speaker Nancy Pelosi (D-Calif.) argued that Democrats needed to pursue the president’s documents through the courts as part of the ordinary course of business. A whistleblower’s disclosure that Trump pressured the president of Ukraine to interfere in the 2020 election, however, changed that equation. The House is now engaged in an impeachment inquiry. This decision is expected to be appealed to the Supreme Court, to which Trump has appointed two justices: Neil Gorsuch and Brett Kavanaugh. Former House Speaker Newt Gingrich, an ally of Trump’s, was asked in 2018 whether the courts would allow House Democrats to obtain the president’s tax returns. “Then they’ll be trapped into appealing to the Supreme Court, and we’ll see whether or not the Kavanaugh fight was worth it,” Gingrich replied.", 
      "date": "10/11/2019 10:26 am ET"
    }, 
    {
      "subtitle": "U.S. diplomat Marie Yovanovitch told impeachment investigators she was attacked “by people with clearly questionable motives.”", 
      "author": "Antonia Blumberg", 
      "url": "https://www.huffpost.com/entry/marie-yovanovitch-ukraine-trump-impeachment_n_5da0ae2de4b02c9da049bcd1", 
      "title": "Ousted Ukraine Ambassador Tells Congress Trump Removed Her Over ‘False Claims’", 
      "content": " Marie Yovanovitch, the former U.S. ambassador to Ukraine, appeared before House impeachment investigators on Friday, telling them that she believed President Donald Trump pushed for her removal on the basis of “false claims,” according to her prepared remarks obtained by The Washington Post. The veteran foreign service officer, who reportedly delivered those remarks in a closed-door deposition, said she was “disappointed” and “incredulous that the U.S. government chose to remove an Ambassador based, as best as I can tell, on unfounded and false claims by people with clearly questionable motives.” Yovanovitch was abruptly removed from her Ukraine post on May 6 after what appeared to be a monthslong campaign by Trump’s personal lawyer, Rudy Giuliani, and others close to the president who complained she was undermining the administration’s efforts to pressure Ukrainian leaders to investigate former Vice President Joe Biden. She told investigators on Friday that John Sullivan, the deputy secretary of state, had informed her of “a concerted campaign” against her and said Trump had been pushing for her removal since the summer of 2018. Sullivan “also said that I had done nothing wrong and that this was not like other situations where he had recalled ambassadors for cause,” she said. Yovanovitch also said she’d had “only minimal contacts” with Giuliani. “I do not know Mr. Giuliani’s motives for attacking me,” Yovanovitch said. “But individuals who have been named in the press as contacts of Mr. Giuliani may well have believed that their personal financial ambitions were stymied by our anti-corruption policy in Ukraine.” Yovanovitch’s ouster has become a flashpoint in the House’s impeachment investigation into whether Trump abused his power to “advance his personal interests,” as a recent whistleblower complaint said. Congressional investigators are now looking into the administration’s alleged efforts to pressure Ukraine for damaging information about Biden, based on unsubstantiated allegations that he used his power as vice president during the Obama administration to kill an investigation into a gas company on whose board his son served. (In fact, Biden and others pushed the Ukrainian government to remove a top prosecutor for not pursuing corruption cases aggressively enough.) Yovanovitch was the subject of an attempted smear campaign earlier this year by Trump allies who sent a packet of documents with misinformation about her to Secretary of State Mike Pompeo. Conservative media outlets and the president’s eldest son, Donald Trump Jr., have also accused her of being part of an alleged Ukrainian attempt to support Hillary Clinton’s 2016 presidential campaign ― a claim she vehemently denied on Friday. During their July 25 phone call, President Trump ominously told Ukrainian leader Volodymyr Zelensky that Yovanovitch was “going to go through some things” in the aftermath of her removal from the ambassador’s post. In a joint statement on Friday, Reps. Adam Schiff (D-Calif.), chair of the House Intelligence Committee, Eliot Engel (D-N.Y.), chair of the House Foreign Affairs Committee, and Elijah Cummings (D-Md.), chair of the House Oversight and Reform Committee, said their panels learned Thursday evening that the White House had directed the State Department to tell Yovanovitch not to appear before House investigators. “This is the latest example of the Administration’s efforts to conceal the facts from the American people and obstruct our lawful and constitutionally-authorized impeachment inquiry,” said the three chairmen of committees conducting the impeachment inquiry. The Intelligence Committee subsequently issued a subpoena, they said, with which Yovanovitch complied. “Any efforts by Trump Administration officials to prevent witness cooperation with the Committees will be deemed obstruction of a co-equal branch of government and an adverse inference may be drawn against the President on the underlying allegations of corruption and coverup,” the chairmen said. Yovanovitch on Friday warned that her ouster and other recent events could signal larger problems at the State Department and for American diplomacy generally. “Today, we see the State Department attacked and hollowed out from within,” she said. “We need to rebuild diplomacy as the first resort to advance America’s interests and the front line of America’s defense,” Yovanovitch continued. “I fear that not doing so will harm our nation’s interest, perhaps irreparably.” Read her prepared remarks below:", 
      "date": "10/11/2019 02:42 pm ET"
    }, 
    {
      "subtitle": "Marie Yovanovitch appeared on Capitol Hill for a deposition in the Democrats’ impeachment inquiry.", 
      "author": "", 
      "url": "https://www.huffpost.com/entry/marie-yovanovitch-ukraine-ambassador-testifies_n_5da0b3f7e4b06ddfc519532b", 
      "title": "Former Ambassador To Ukraine Says Trump Pressured State Department To Fire Her", 
      "content": "WASHINGTON (AP) — Former U.S. Ambassador to Ukraine Marie Yovanovitch told lawmakers Friday that President Donald Trump pressured the State Department to oust her from her position. Yovanovitch said in an opening statement obtained by The Associated Press that she was “abruptly” recalled in May and told the president had lost confidence in her. She said she was told by an official that there was a “concerted campaign against me” and that Trump had pressured officials to remove her for almost a year. “Although I understand that I served at the pleasure of the president, I was nevertheless incredulous that the U.S. government chose to remove an ambassador based, as best as I can tell, on unfounded and false claims by people with clearly questionable motives,” Yovanovitch wrote in the statement. Yovanovitch appeared on Capitol Hill Friday for a deposition in the Democrats’ impeachment inquiry, accepting lawmakers’ invitation to testify despite Trump’s declaration that no one in his administration would cooperate with the probe. The Democrats are investigating Trump’s dealings with the Ukrainian president. Yovanovitch is now a State Department fellow at Georgetown University. Trump said earlier this week that he would block all officials from testifying, saying the probe was unfair and “illegitimate.” It was unclear if Yovanovitch’s appearance signaled a shift in that strategy or if she was breaking with White House orders. Democrats are investigating Trump’s pleas to Ukrainian officials to launch investigations of political rival Joe Biden and his family and to probe Ukraine’s involvement in the 2016 presidential election. Yovanovitch was recalled from Kyiv as Rudy Giuliani — who is Trump’s personal attorney and has no official role in the U.S. government — pushed Ukrainian officials to investigate baseless corruption allegations against the Bidens. Yovanovitch was removed from her post after insisting that Giuliani’s requests to Ukrainian officials for investigations be relayed through official channels, according to a former diplomat who has spoken with her. In a July 25 phone call, Trump told Ukrainian President Volodymyr Zelenskiy that Yovanovitch was “bad news,” according to a partial transcript released by the White House. Neither Giuliani nor Trump has publicly specified their objections to Yovanovitch. Businessmen with ties to Giuliani lobbied a U.S. congressman in 2018 for help ousting Yovanovitch, according to an indictment made public Thursday following the men’s arrest. It alleges that the men leveraged a flurry of GOP political donations to force Yovanovitch’s removal, an effort prosecutors say was aided by laundered foreign money. The former diplomat who spoke with Yovanovitch said the ambassador refused to do “all this offline, personal, informal stuff” and made clear that the U.S. government had formal ways to request foreign governments’ help with investigations. The former diplomat insisted on anonymity to disclose the private conversation. The State Department traditionally relies on mutual legal assistance treaties, under which U.S. and foreign officials agree to exchange evidence and information in criminal investigations. Yovanovitch was speaking to the House Intelligence, Foreign Affairs and Oversight and Reform committees behind closed doors Friday. The committees are scheduled to talk to several other U.S. diplomats next week, as well. On Monday, Fiona Hill, a former White House adviser who focused on Russia, is expected to testify. Three current State Department officials also are tentatively scheduled next week — Deputy Assistant Secretary of State George Kent, U.S. Ambassador to the European Union Gordon Sondland, and Ulrich Brechbuhl, a State Department counselor. Sondland was originally scheduled for a deposition this past Tuesday but did not show up. Trump tweeted immediately afterward that he couldn’t let Sondland testify because the Democratic-led probe was “compromised.” The committees subpoenaed Sondland hours later for a deposition next week, and his attorneys said Friday he would testify on Oct. 17, despite the administration’s position. “Notwithstanding the State Department’s current direction to not testify, Ambassador Sondland will honor the Committees’ subpoena, and he looks forward to testifying on Thursday,” said a statement from attorneys Robert Luskin and Kwame Manley. “Ambassador Sondland has at all times acted with integrity and in the interests of the United States. He has no agenda apart from answering the Committees’ questions fully and truthfully.” The statement said, however, that Sondland would not be able to product documents “concerning his official responsibilities,” as they were controlled by the State Department. Democrats want to ask him about text messages released last week that show him and two other U.S. diplomats acting as intermediaries as Trump urged Ukraine to investigate Ukraine’s involvement in the 2016 U.S. election and Hunter Biden’s involvement with a gas company there. Earlier this week, the White House sent Congress a letter outlining its opposition to the impeachment probe and refusing to cooperate with requests for information, including interviews with administration officials. The House committees have moved to subpoena officials instead. On Thursday, 10 Democratic senators sent a letter to Secretary of State Mike Pompeo demanding an explanation for Yovanovitch’s removal before the end of her three-year assignment. “In particular, her early recall raises questions about whether you put the personal interests of the President above the Department’s career personnel or U.S. foreign policy,” they wrote. Even before the testimony, the attention on Yovanovitch was renewed Thursday after U.S. prosecutors arrested two Florida businessmen tied to Giuliani, charging them with campaign finance violations. An indictment filed in the case alleged that the men, who were raising campaign funds for a U.S. congressman, asked him for help in removing Yovanovitch, at least partly at the request of Ukrainian government officials. Yovanovitch has led U.S. embassies in Kyrgyzstan and Armenia and is now a State Department fellow at Georgetown University. The director of the Georgetown program, Barbara Bodine, said the former envoy is declining all requests for interviews. Former colleagues of Yovanovitch said Trump allies’ characterizations of her as politically motivated are off-base. She is “a top-notch diplomat, careful, meticulous, whip smart,” and unlikely to have badmouthed Trump, either to Ukrainian officials or her colleagues, said John Herbst, a predecessor as ambassador in Ukraine who worked alongside Yovanovitch there in the early 2000s. Yovanovitch has always known that the role of diplomat “wasn’t about her” but about “serving American national interests and supporting the people around her,” said Nancy McEldowney, a former U.S. ambassador to Bulgaria who now directs a Foreign Service program at Georgetown. ___ Associated Press Writers Matthew Lee and Jocelyn Noveck contributed to this report.", 
      "date": "10/11/2019 12:59 pm ET"
    }
  ]
}