{
  "articles": [
    {
      "subtitle": "null", 
      "author": "SHANE GOLDMACHER", 
      "url": "https://www.nytimes.com/interactive/2019/10/11/us/politics/october-democratic-debate.html", 
      "title": "null", 
      "content": "", 
      "date": "null"
    }, 
    {
      "subtitle": "null", 
      "author": "Alexander Burns", 
      "url": "https://www.nytimes.com/2019/10/11/us/politics/2020-democrats-primary-polls.html", 
      "title": "Why Populist Democrats Have Gained the Upper Hand in the 2020 Race", 
      "content": "With a crucial debate looming next week in the Democratic presidential primary, the party’s populist wing appears increasingly in control of the race — rising in the polls, stocked with cash and with only a wounded leading candidate, Joseph R. Biden Jr., standing in its way. Several slow-building trends have converged to upend the race over the last few weeks: Senator Elizabeth Warren’s steady ascent in the polls has accelerated. Both she and Senator Bernie Sanders, a fellow progressive, have raised immense sums of money from small donors online, dominating the Democratic field and each collecting about $10 million more than Mr. Biden in the last quarter. And Mr. Biden’s numbers have gradually slipped in a way that has alarmed his supporters. The race is far from over: All three of the top candidates — Ms. Warren, Mr. Biden and Mr. Sanders — have a path to victory, and there is still time for longer-shot candidates to make a real run at the nomination. The CNN/New York Times debate in Ohio on Tuesday is likely to test Ms. Warren’s status as an emerging front-runner, subjecting her to new criticism from her fellow Democrats on matters ranging from health care policy to trade and the role of the government in overseeing the economy. Above all, she may need to allay lingering reservations about her appeal to swing voters in the general election. And Mr. Biden signaled on Thursday night that he will come into the debate fighting. “One of the problems I’m finding, I’ve got to be more aggressive,” he said at a fund-raiser in Los Angeles. He then used a roundabout example to explain that debate time restraints don’t allow time for lengthy answers. “When someone says, you know, you know, ‘Are you still beating your wife?’ And, and I go, ‘I have a long explanation,’ and they say, ‘You got 30 seconds to answer.’ And you say, ‘No. And then, wait a minute, what’d I just say? No, I’m not still beating my wife.’ But so, I’ve had, I’ve had some difficulties,” he said. If Tuesday’s debate could break in any number of directions, what may be resolved is the overall mood of Democratic primary voters, and whether they are more inclined to seek a politically cautious nominee who promises to restore normalcy in Washington, or a more confrontational standard-bearer with an ambitious and disruptive reform agenda. It is candidates in the latter category who now control the bulk of the financial might in the race, and are best positioned in most of the early primary states. Anna Greenberg, a Democratic pollster who is not aligned in the primary, said an “anti-establishment” current had plainly taken hold, with voters rewarding candidates for defying the conventional limits of political debate and “pushing boundaries in really productive ways.” She pointed not only to Ms. Warren and Mr. Sanders but also to former Representative Beto O’Rourke, who has embraced a new political identity for himself as a gun-control activist and a critic of his own party’s relatively cautious platform on the issue. “Across the board, whether it’s Beto talking about assault weapons or Warren and Sanders talking about Wall Street,” Ms. Greenberg said, “it does feel like there is a shift in the party that is kind of new.” Ms. Greenberg said there was still space for Mr. Biden to run a strong campaign because of the way voters perceive his values and character. Americans, she said, believe Mr. Biden “cares about people and working class people, regular people, and that’s not an insignificant asset.” Yet it has been Ms. Warren, rather than Mr. Biden, who has consistently gained strength. Campaigning on a message of purging corruption in Washington and restructuring the economy, Ms. Warren has closed Mr. Biden’s lead in the polls every week since the beginning of the summer and is now in a position to upset him in both Iowa and New Hampshire, the first two states to vote. Mr. Biden remains a strong contender for the nomination, largely because of the support he collects from African-American voters. But he has struggled for months to articulate a clear vision for the future and has relied heavily on Democratic nostalgia for the Obama administration. In recent weeks, he has been consumed in a grisly political clash with President Trump. So far, the support Mr. Biden has lost does not seem to have gone to another moderate, like Mayor Pete Buttigieg of South Bend, Ind. Only Ms. Warren has been moving up in the national polls, suggesting either that Mr. Biden’s lost supporters have defected to her camp or that they have become undecided altogether. If Ms. Warren has become the leading liberal standard-bearer, Mr. Sanders has been a steady third in national polls and his fund-raising power is likely to keep him among the most formidable competitors in the race. Yet his campaign has been grappling with the implications of Mr. Sanders’s heart attack in Las Vegas last week, a medical emergency that landed him in the hospital and has kept him off the trail for days. He has sent mixed signals about his path forward, first indicating that he would scale back his campaign schedule and then defiantly reversing that suggestion. It is unclear whether Mr. Sanders’s physical condition will affect his poll numbers: He has a solid base of support nationally and few other candidates believe his core followers will be easily dislodged. There is at least a new degree of uncertainty about whether he will be in a strong position to vie for liberal Democrats who have already been migrating toward Ms. Warren. Nearly all of the candidates feel pressure to do something in the Ohio debate to stop the race from becoming a contest entirely defined by a Warren-Biden rivalry, either by inflicting direct damage on Ms. Warren’s campaign or by outflanking her as an alternative to Mr. Biden. The ongoing impeachment inquiry targeting Mr. Trump has only added to the pressure on the Democratic field, since the tumult in Washington is likely to leave voters with even less time to devote to reviewing underdog options. Mr. Buttigieg in particular has been moving assertively in recent weeks to position himself as a center-left alternative to both Mr. Biden and Ms. Warren, using his considerable war chest to run television ads in Iowa. Several other candidates of different ideological stripes are counting on Iowa for a breakthrough, including Senators Kamala Harris, Cory Booker and Amy Klobuchar. A wild-card joining them onstage will be a new contender, Tom Steyer, a former hedge fund investor who has spent lavishly from his personal fortune to brand himself as a reform-minded outsider. For Ms. Warren, meanwhile, the debate may help reveal whether she can consolidate her gains across the Democratic Party. On Wednesday, she campaigned in South Carolina, where she has so far struggled to gain traction with the African-American voters who largely decide the primary there. To cement her status as a front-runner, she may have to win over a range of constituencies torn between their interest in her ideas and a more cautious political calculus that draws them to Mr. Biden. One of those voters is Ohio’s former governor, Ted Strickland, the only Democrat to hold that office this century. Like many Democratic voters, Mr. Strickland, a populist with close ties to organized labor, said he saw Mr. Biden as the safer bet for the general election but found it hard to resist the appeal of Ms. Warren’s proposals, most of all her plan for a new tax on vast private fortunes. “I think there may be something to the electability issue for Mr. Biden, in Ohio,” Mr. Strickland said. “But if I could just choose to put someone in the presidency — if that was my choice alone — it would be hard for me to pass up Elizabeth Warren.” Mr. Strickland said he had spoken with Mr. Biden recently and saw him as a seasoned diplomat and a reliable “economic progressive.” But Ms. Warren, he said, was gradually easing voters’ reservations about her ability to go up against Mr. Trump by talking about policy issues “in ways that are easily understood.” Mr. Biden remains a clear favorite in just one of the early states, South Carolina, and his advisers have predicted that he would fare better in larger, more diverse states that vote later in the calendar. He is counting, in particular, on older and more moderate African-American voters to hold back the party from stampeding toward a more ideological liberal candidate. In 2016, black and Latino voters helped Hillary Clinton withstand a persistent primary challenge from Mr. Sanders. Yet scattered polling in the later states has largely followed the national trend: Last week, for instance, the Public Policy Institute of California released a poll finding a statistical three-way tie in the nation’s most populous state between Mr. Biden, Ms. Warren and Mr. Sanders. Mark Baldassare, president of the institute, said there was no indication in his poll that the state’s diversity would represent a stumbling block for candidates on the left, as Mr. Biden is hoping. The primary debates would be crucial to determining Ms. Warren’s continued momentum, he said, because voters seemed to be using them for insight into the general election. “It has become kind of a proxy for: How are these candidates going to do when they stand up next to Trump?” Mr. Baldassare said. “I think this will be Elizabeth Warren’s moment now, because if she is in the mix for front-runner, people are going to be testing her and seeing: How does she do? How does she do when she has to be on defense?”", 
      "date": "null"
    }, 
    {
      "subtitle": "null", 
      "author": "null", 
      "url": "https://www.nytimes.com/2019/10/11/the-weekly/rudy-giuliani-trump-ukraine.html", 
      "title": "How Did Rudy Giuliani Get Here?", 
      "content": "The man once hailed as “America’s Mayor” is now at the center of the most confounding political story of the Trump presidency. Rudy Giuliani’s back-channel efforts to pressure Ukrainian officials on behalf of President Trump has helped prompt the impeachment inquiry that may tarnish both men. It’s a disquieting late act in Giuliani’s more than four decades in public life that has many people asking how a tumultuous political career that at times appeared transcendent has become a seemingly repetitive series of angry cable news appearances. Giuliani burst on the public stage as an aggressive prosecutor who used the same tactics to take down New York’s notorious mafia bosses as he did Wall Street’s felonious financiers. He earned top billing as a zero-tolerance mayor who cleaned up Gotham as he inflamed racial tensions. And when the city — and the country — came under terrorist attack, he stepped into his defining role as “America’s Mayor” by comforting the grief stricken and rallying the faithful. “The Weekly” examines his career and we ask New York Times reporters who observed the former New York mayor at every turn: How did Rudy Giuliani get here? [Join the conversation about @theweekly on Twitter and Instagram. #TheWeeklyNYT] Nearly a dozen Times reporters who covered Giuliani as mayor, presidential candidate, and high-priced conservative for hire contributed to this episode of “The Weekly.” They include columnists Dan Barry, Jim Dwyer and James B. Stewart; Metro reporters William K. Rashbaum and Sarah Maslin Nir; Jonathan Mahler, a staff writer for The Times Magazine;  correspondents in Washington Maggie Haberman, Michael S. Schmidt and Kenneth P. Vogel; and Elisabeth Bumiller, Washington bureau chief. ", 
      "date": "null"
    }, 
    {
      "subtitle": "Why are we so obsessed?", 
      "author": "Vanessa Friedman", 
      "url": "https://www.nytimes.com/2019/10/11/style/alexandria-ocasio-cortez-hair-cost.html", 
      "title": "Alexandria Ocasio-Cortez and the Political Cost of Hair", 
      "content": "Hair has once again caused a political tempest in a blow dryer. This week, the Washington Times published a story saying that Representative Alexandria Ocasio-Cortez had spent $80 on a haircut and $180 on color at a Washington, D.C. salon, a styling choice the newspaper presented as hypocritical, given she “regularly rails against the rich and complains about the cost of living inside the Beltway.” Almost immediately, charges of sexism and superficiality began to fly online (also, a debate about the average price of a woman’s haircut, and how little men seem to understand the cost of certain aspects of life). Ms. Ocasio-Cortez herself tweeted out a statement, saying that Vice President Mike Pence “used *taxpayer funds* — not personal ones — to spend several thousand haircuts’ worth of public money on a visit to Trump golf courses.” It would be easy to dismiss this as mere distraction, except it is also the latest in a long line of hair-related controversies in the corridors of power that have surrounded both men and women. Hair is, it seems, a particularly — well, tangled, subject. Not to mention an equal-opportunity target. Hillary Clinton acknowledged it in 2014, when she joked that the subtitle of her memoir, “Hard Choices,” should be “The Scrunchie Chronicles: 112 Countries and It’s Still All About My Hair.” Though Mrs. Clinton is probably the most famous hair lightning rod, whether it was her chopping and changing while in the White House as first lady (seen as reflecting the opportunism of her husband’s policies), her I-don’t-care-I’m-getting-down-to-work scrunchies as secretary of state, her John Barrett styling trip while on the campaign trail (average price per cut: $600) or her postelection lank and limp blues, she is far from the only politician scrutinized. Her husband was also mocked as far back as 1993 for having a plane wait on the tarmac in Los Angeles while he received a trim from Cristophe of Beverly Hills. The New York Times reported: “Questions about Mr. Clinton’s runway razor cut dominated the White House news briefing today, with the communications director, George Stephanopoulos, scrambling to explain why the populist President tied up one of the country’s busiest airports to have his hair trimmed.” John Edwards, of course, became something of a poster boy for follicular faux pas during the 2007 presidential campaign when it was revealed he had indulged in two haircuts totaling approximately $800 at a time when he was attempting to sell himself as a champion for working class Americans. It’s not just an American obsession. In 2016, François Hollande, then the president of France, came under fire for a reported $10,000 a month styling bill, which was seen as inappropriate for a socialist (it even got its own hashtag: #Coiffuregate). During the 2015 Canadian election, Justin Trudeau’s hair, which, in its lushness, seemed to represent his youth and privilege, had its own Twitter account — @TrudeausHair. The Economist referred to him as the “hair apparent” (a reference to his father, former Prime Minister Pierre-Elliott Trudeau). And he wasn’t the only one under a follicular microscope: the hair of all the (all-male) candidates played a fairly public role in that election. And British Prime Minister Boris Johnson’s singular flyaway blondness has inspired RTE, the Irish broadcaster, to write that his hair is “key” to his “political brand,” “symbolizing the chaotic and gaffe-prone style that charms his supporters and appals his critics.” It’s fair to say hair is not just some stringy stuff on the top of our heads. According to Grant McCracken, an anthropologist and author of “Big Hair,” our hair is “our court of deliberation, the place where we contemplate who and what we are.” It is visible, accessible, gender-freighted. It has associations with sex, punishment, class and power. It is probably not happenstance that the United States has not elected a bald president since Dwight D. Eisenhower left office in 1961. When it comes to politics, to care too much about hair, to spend too much on it, makes one seen as superficial and vain; focused on yourself at the expense (literally sometimes) of taxpayers. Ignore it and you are sloppy and lack attention to detail. Men have traditionally used their ability to get inexpensive barber-trims as bragging rights and something of a badge of honor. In the Washington Times story, former Attorney General Jeff Sessions is lauded for the fact he got his cuts at the Senate Hair Care Services in the basement of the Russell Senate Office Building for a mere $20 — though it is acknowledged that “men’s haircuts there and everywhere else are cheaper than women’s.” In turn, women have often complained about a double standard in price and scrutiny. This has only become more true in the age of Instagram, and during a White House administration where hair has played an outsize symbolic role, from the glossy, blow-dried locks of pretty much all the women in the Trump orbit (the first lady, Tiffany Trump, Vanessa Trump, Kimberly Guilfoyle, Hope Hicks — and Ivanka before the bob) to the orange-hued and complicated comb-over worn by the president himself. People joke about it, but no one forgets it. Fact is, we’re talking about hair more than ever these days, not less. All of which suggests that, whether we like it or not, when it comes to politics (as when it comes to a lot of life), a trim is rarely just a trim. It’s a weapon, and a tool. If we don’t admit that and wield it ourselves — with humor, ideally — then someone else will.", 
      "date": "Oct. 11, 2019"
    }, 
    {
      "subtitle": "For the way-too-young-to-vote crowd, 2020 events are still a draw.", 
      "author": "Reid J. Epstein", 
      "url": "https://www.nytimes.com/2019/10/11/us/politics/2020-candidates-children.html", 
      "title": "The Democrats Worth Staying Up Past Bedtime For", 
      "content": "IOWA CITY — Oliver Hanlon was beaming ear-to-ear as he stood next to Senator Elizabeth Warren of Massachusetts on a riverside stage at the University of Iowa. “I met the president,” he shouted, bounding down the steps two at a time. His mother gently corrected him: “Not yet,” she said, while the Warren photo line snaked on behind her. Oliver couldn’t be faulted for his civics proficiency; he’s 7 years old. The 2020 Democratic presidential campaign stops are crawling with children, some of whom spend most of the stump speeches crawling away from their parents. While all of the candidates seek to portray a family-friendly image, it takes work to bring a youngster to a campaign event: They often start late and run well into the evening, with a policy discussion not exactly accessible on the elementary-school level; bigger rallies often take place outdoors, regardless of weather. Kissing babies and tousling children’s hair has long been a staple of retail campaigning, but in 2020 it is about more than a photo op, even the cutest of photo ops. In a historically crowded field, in an era of uncertain polling, these campaign stops are something of a past-their-bedtimes straw poll, revealing which candidates young parents deem viable or famous enough to risk a tantrum or a sleep-deprived meltdown over the next morning. For now, the leaders appear to be Ms. Warren and former Vice President Joseph R. Biden Jr., who have both taken steps to cater to the children and parents who come see them. It’s one more subtle measure of their stature in race that is steadily narrowing from the largest primary field in history to just a handful of viable contenders. Ms. Warren and Mr. Biden, whose staffs both go to great lengths to present their events as family friendly, are currently atop the Democratic polls, which might explain the pep talk parents often give their children before meeting the two candidates: You are talking to the next president. Ms. Warren lets families with children cut to the front of her selfie line, a strong incentive given that supporters often wait hours for a 20-second interaction and photograph. Mr. Biden’s campaign stops over the summer and fall have often come with free ice cream — and if frozen dairy products are not available, he’s been known to hand out cash with instructions for children to tell their parents to stop for a treat on the way home. During a Labor Day swing through Iowa, Mr. Biden worked a chocolate-and-vanilla swirl machine at one union picnic and handed out ice cream sandwiches at another. Last month in Iowa City, Clara Engler, 5, spent hours before an evening Warren rally at the University of Iowa practicing the “pinkie promise” that has become a staple for young girls at Ms. Warren’s events. With her mother, Brooke Engler, an Iowa City cosmetologist, Clara worked on locking fingers briefly and looking up, so she could hear Ms. Warren tell her that running for president is “what girls do.” When the moment came, about a half-hour after Clara’s bedtime, Ms. Warren got down on one knee, looked her in the eye and made the promise. Clara jumped up with glee. Her mother beamed. “She’d seen it before on TV,” Ms. Engler said. “It’s nice that I can have my child sit back and watch politics without worrying about what will be said.” The others in the 19-candidate Democratic field aren’t overtly inhospitable to children, but former Representative Beto O’Rourke of Texas peppers his stump speech with profanity and Senator Bernie Sanders of Vermont isn’t a fuzzy figure while delivering his policy-heavy stemwinders. In early September he scolded a crying baby to “keep it down” during a campaign stop in New Hampshire. Mayor Pete Buttigieg of South Bend, Ind., whose most fervent supporters tend to be young enough not to have children of their own, often attracts older kids — particularly L.G.B.T. teens inspired by the first openly gay major candidate for president. “When you know that there’s something historic about your campaign, you feel a level of responsibility that goes with that,” Mr. Buttigieg said aboard his Iowa campaign bus last month. “It certainly adds a level of motivation when people come up to you, sometimes with tears in their eyes, just letting you know what the fact of your campaign means to them.” Even in Iowa, where rare is the weekend without a presidential hopeful stumping nearby, it takes a serious commitment and coordination to attend a campaign event with young children. “If she starts crying we’ll run out quickly,” Elizabeth Batey, a lawyer from Waverly, Iowa, said of her 2-year-old daughter, Hattie, while waiting for Mr. Buttigieg last month in a stuffy storefront in Iowa Falls. Ms. Batey, whose 4-month-old son, George, was asleep in his car seat, made it through Mr. Buttigieg’s event without having to flee. Afterward, she waited on the sidewalk in front of the Buttigieg campaign bus, holding one child in each arm. “Wow, you’ve got your hands full,” Mr. Buttigieg told her before pausing for a picture. Parents interviewed at a range of campaign events said they often felt like this political moment resembled a tawdry reality TV show, and they brought their children to see the 2020 candidates to try to demonstrate to them that politics can be something different. “I can’t let my kids listen to the TV without being ready to hit the mute button,” said Julia Privett, a physician assistant who brought her 2-year-old daughter, Alyssa, to see Mr. Biden talk about climate change in Cedar Rapids. Lytishya Borglum, a Cedar Falls small business owner, brought her three middle-school-aged children to see Senator Kamala Harris of California speak at the University of Northern Iowa. She’d taken her oldest daughter, 13-year-old Berlyn, to see Democratic caucus campaign events in 2008, but skipped 2016 because it was too toxic. “Nowadays, it’s impossible for them not to be exposed to the craziness in the White House,” Ms. Borglum said. At Ms. Warren’s Iowa City rally, a parade of children waited with their parents for a picture with the senator. Kohner Reynolds, who will turn 2 in November, blew past his 7:30 p.m. bedtime. “He fell asleep a couple times in the baby carrier,” said Kohner’s mother, Callie Reynolds. “I wanted him to be able to say he came to see her.” Burgundy Johnson, a child psychologist, kept her 5-month-old son, Archer, up past his 8 o’clock bedtime. She occupied Archer with toys. “I wanted a picture of Elizabeth Warren holding my baby,” she said while leaving the event at 8:40 p.m. “Now it’s going to be an interesting night.” The older children tend to be more attuned to issues. Evelynn Parlet, 11, an Iowa City sixth grader, said she approved of Ms. Warren’s campaign goal of reordering the American economy. “I liked what she said,” she said. “We need to help people who don’t have enough money.” Samara and Isa Murillo, sisters who are 10 and 8 years old, each had Ms. Warren autograph a white campaign placard. Ms. Warren got down on one knee and signed them on the floor of the stage. “We love her ideas about change and the two cents,” Samara said. “People out there are dying of hunger.” Isa said she was more focused on climate change. “Some people don’t have homes because of the flooding,” she said. And, because it is Iowa, there are parents who spend caucus season vying to get their children photographed with all of the candidates they can — just in case one of them makes it to the White House. Eric Heininger, a fund-raiser for nonprofit organizations, and his wife, Tiffani Milless, a physician, toted their 9-month-old daughter, Charlotte, around the Polk County Steak Fry last month to get her in pictures with as many contenders as possible. Dressed in a red-white-and-blue sundress, Charlotte met Ms. Warren, Mr. Buttigieg, Mr. O’Rourke and the entrepreneur Andrew Yang. At earlier campaign events, she was photographed with Mr. Sanders, Senator Cory Booker of New Jersey and former Gov. John Hickenlooper of Colorado, who ended his campaign in August. With Charlotte sleeping on her father’s chest, Dr. Milless filled out a card committing to caucus for Mr. O’Rourke and held it up while the Texan offered his toothy smile. “Thank you so much,” Mr. O’Rourke said, gently patting the sleeping child on her back. A campaign aide took Dr. Milless’s caucus card and stuffed it into a backpack. Afterward, Dr. Milless said she had only filled out the card in order to secure the picture with her daughter. “He’s in my top three,” she said. “It’s a loose commitment, kind of like a promise ring.”", 
      "date": "Oct. 11, 2019"
    }, 
    {
      "subtitle": "null", 
      "author": "Ana Swanson", 
      "url": "https://www.nytimes.com/2019/10/11/business/economy/us-china-trade-deal.html", 
      "title": "Trump Reaches ‘Phase 1’ Deal With China and Delays Planned Tariffs", 
      "content": "WASHINGTON — President Trump said Friday that the United States had reached an interim deal with China that would forestall a tariff increase slated for next week, providing a temporary détente in a prolonged and economically painful trade war. Mr. Trump, speaking from the Oval Office, said negotiators had reached a “Phase 1” agreement that would take several weeks to write and that both sides could officially sign by November. If completed, the agreement would provide relief to American farmers and businesses that have been battered by the trade war. Mr. Trump said the “substantial” agreement would involve China buying $40 billion to $50 billion worth of American agricultural products annually, along with guidelines on how it manages its currency, the renminbi. It would also strengthen Chinese protections for American intellectual property and give financial services companies more access to China’s market, the president said. In exchange, the United States will not move ahead next week with plans to raise tariffs on $250 billion worth of Chinese goods to 30 percent. The president has not made a final decision on whether to impose an additional round of tariffs on Dec. 15, as he has threatened. The announcement is a sharp turn from Mr. Trump’s posture several weeks ago, when the president — angry over China’s retaliatory tariffs — demanded that American companies stop doing business with China and threatened to tax every toy, shoe and computer from Beijing before the year’s end. The escalation has rattled investors, lawmakers and businesses, which have begun delaying investment and hiring amid continuing uncertainty about the trade war’s trajectory. The economic pain appears to have softened Mr. Trump’s appetite for a fight. On Friday, the president said the two sides would now work on a deal in phases, a reversal from his previous position that he was looking for a “complete” China deal, not an interim agreement. “It’s such a big deal that doing it in sections, in phases, is really better,” Mr. Trump said during a White House meeting with Liu He, China’s vice premier. “So you’ll either have two phases or three phases.” The first phase could be signed when Mr. Trump appears alongside Xi Jinping, his Chinese counterpart, at a meeting of global leaders in Santiago, Chile, in November. The next phase would begin soon after, Mr. Trump said. Despite the announcement, the deal has not been completed, and Steven Mnuchin, the Treasury secretary, said that more work remained, including on the agreements related to currency and access for American financial companies. “We have a fundamental agreement on the key issues,” he said. “But there is a significant amount of work to do.” The deal is far from the type of comprehensive agreement Mr. Trump has been pushing for, and it leaves some of the administration’s biggest concerns about China’s economic practices unresolved. Although exact terms are still under discussion, the details the president announced include some of the concessions that China has previously floated, including purchases of agricultural products and limits on Beijing devaluing its currency to gain a competitive advantage. Still, the agreement, which came during the 13th round of negotiations, will help to defuse trade tensions that have begun inflicting pain on the global economy and were set to escalate. In his quest to force China to acquiesce to America’s terms, Mr. Trump has already taxed $360 billion worth of Chinese products and had penciled in another round of tariffs on Dec. 15. Stock and commodity prices climbed on Friday as investors anticipated a resolution to the trade spat. The S&P 500 rose 1.1 percent. The technology-heavy Nasdaq composite index rose 1.3 percent. The Russell 2000 index of small capitalization stocks, typically viewed as closely tied to the health of the American domestic economy, rose 1.8 percent. Crude oil prices rose, as did prices for key industrial metals such as copper and iron ore, often looked to as a barometer of the outlook for China’s large industrial economy. Stocks of companies with heavy exposure to China soared. Shares of Deere & Company rose 1.9 percent, while Apple gained 2.7 percent and Wynn Resorts, which generates the bulk of its revenue from casinos in China, surged 6.3 percent. An index of semiconductor companies, which depend on Asian supply chains, gained 2.3 percent. Business groups expressed relief that the negotiations between the United States and China appeared to be making progress after more than a year of sputtering, yet they acknowledged that the agreement fell short of the sweeping deal that Mr. Trump had promised. John Neuffer, the president of the Semiconductor Industry Association, said the deal was “welcome news” for his industry that would give “both sides a chance to get back to the negotiating table to strike a more comprehensive deal.” The initial reaction among Republican lawmakers was cautiously optimistic. Senator Charles E. Grassley of Iowa, the Republican chairman of the Finance Committee, said that any progress was good news, but that Mr. Trump must reach a more substantial deal for the pain of the trade war to have been worthwhile. “After so much has been sacrificed, Americans will settle for nothing less than a full, enforceable and fair deal with China,” Mr. Grassley said. “I look forward to learning more details in the coming days.” Trade experts in China were quick to welcome the deal as a breakthrough. “It the first time since the start of the trade war that negotiators have reached some solid result,” said Cui Fan, a prominent professor of trade policy at the University of International Business and Economics in Beijing. Mr. Trump’s defenders say China’s concessions will generate positive momentum for future talks and result in more business for farmers and manufacturers as they continue to press Beijing for a broader pact to correct longstanding economic abuses. Critics say that the move will go only part way toward resolving a crisis of the president’s own making, and that the trade war will continue to slow the global economy. “Behind the hype, this is nothing more than a partial and ostensibly unsustainable deal lacking in real enforcement mechanism,” said Gregory Daco, the chief United States economist at Oxford Economics. “For businesses, this will mean less damage, not greater certainty.” The interim agreement also does not resolve some of the thorniest issues between the two countries, including whether the United States will continue to label China a currency manipulator and whether it will keep Huawei, the Chinese telecom giant, on a government blacklist. In August, the Treasury Department formally designated China a currency manipulator for the first time since 1994, at the direction of Mr. Trump. The largely symbolic move came amid frustration among American officials that China was counteracting the president’s tariffs by devaluing the renminbi. Mr. Mnuchin said that the United States would decide whether to rescind the designation in a future phase of negotiations. And Robert Lighthizer, Mr. Trump’s top trade negotiator, said the deal did not resolve the fate of Huawei, which is banned from buying American products — much to China’s dismay. “In this agreement we’re not dealing specifically with Huawei,” he said. “It’s not part of this agreement. That’s a separate process.” Mr. Trump and his advisers also did not mention any progress in areas that the American business community has identified as critical to its ability to compete with Chinese companies — including China’s subsidization of industries, the role of the government in the economy and the country’s restrictions on transfers of data across its borders. “Our hope and our aspiration is that they get to those harder issues,” said Myron Brilliant, the head of international affairs at the U.S. Chamber of Commerce. Still, he added that the steps taken this week might create positive momentum toward addressing those issues. “We’ve had nothing but bad news since May in the U.S.-China relationship,” Mr. Brilliant said. “And now we seemed to have put a halt to a further escalation of tensions, and that’s a step in the right direction.” Mr. Lighthizer said that the deal would require China to make structural changes to how it screened food imports and approved new genetically modified products that would allow more American farm goods to flow there. “It will be much easier now for American farmers to be able to ship to China,” he said. “And we’ve made some changes on our side too that will help the Chinese.” The agreement came after Chinese officials shifted their position on the trade talks over the past month, moving from an insistence on a complete removal of American tariffs to a willingness to accept a partial deal that would leave many of those tariffs in place. One important factor in China’s shifting stance involved a severe yet unexpected problem: a genuine need for food imports from the United States. African swine fever has killed an estimated two fifths of China’s pig herd over the past year, producing a sharp increase in pork prices. The need for increased food imports from the United States persuaded the Chinese that both sides could benefit from a partial deal even if it did not involve complete elimination of Mr. Trump’s new tariffs, a person familiar with the talks said. Mr. Trump acknowledged that tensions with China had spiraled as a result of the trade war but said that relations between the two countries were now “a love fest.” “Talk was getting tough,” the president said, adding that both sides had “planes” and “ships” and that “stupid things can happen.”", 
      "date": "Oct. 11, 2019"
    }, 
    {
      "subtitle": "The estate said that despite an agreement last year not to use Prince’s music, the song was played at the president’s rally on Thursday night in Minneapolis, the singer’s hometown.", 
      "author": "Christine Hauser", 
      "url": "https://www.nytimes.com/2019/10/11/us/prince-trump-rally-purple-rain.html", 
      "title": "Prince’s Estate to Trump Campaign: Don’t Play ‘Purple Rain’", 
      "content": "The estate of Prince, the musician who died in 2016, pushed back against President Trump’s campaign on Thursday night after the artist’s song “Purple Rain” was played at a Trump rally that night in Minneapolis, the singer’s hometown. On a Twitter account set up to celebrate the life of the singer, the estate said that Jones Day, the law firm that has represented Mr. Trump in election law matters and continuing lawsuits, had agreed last October that the campaign would not use Prince’s songs at rallies and other events. The estate posted a letter it said it had received from Jones Day last year. “Without admitting liability, and to avoid any future dispute, we write to confirm that the Campaign will not use Prince’s music in connection with its activities going forward,” the letter said. The estate said on Twitter that despite that understanding, “Purple Rain” had been played at the Minneapolis rally. “The Prince Estate will never give permission to President Trump to use Prince’s songs,” it said. A representative for Jones Day was not immediately available for comment on Friday. Other artists have asked the Trump campaign not to use their music, including Rihanna and Axl Rose, and the wording in the Jones Day letter resembled one also sent to representatives of Steven Tyler, the lead singer of Aerosmith, who had objected to the playing of his music at Trump events. Such requests are not unusual for politicians and the arenas where they drum up support. Usually, music rights agencies advise campaigns to buy blanket licenses so they can play music in the agencies’ catalogs wherever they are. Arenas where politicians appear often have a blanket license that allows the venue to play any song in an agency’s catalog. Sometimes artists find that their music has slipped through into an event for a politician they do not support. In 2018, Pharrell Williams sent a letter to the president after the song “Happy” was played at an event on the day of the synagogue shooting in Pittsburgh. But the group that hosted the event, the National FFA (Future Farmers of America) Organization, said its organist had played the song without any input from the campaign, The New York Times reported.", 
      "date": "Oct. 11, 2019, 10:51 a.m. ET"
    }, 
    {
      "subtitle": "null", 
      "author": "Charlie Savage", 
      "url": "https://www.nytimes.com/2019/10/11/us/politics/mazars-trump-tax-returns.html", 
      "title": "Congress Can Seek Trump’s Financial Records, Appeals Court Rules", 
      "content": "WASHINGTON — President Trump’s accounting firm must comply with a House committee’s demands for eight years of his financial records, a federal appeals court panel ruled on Friday in a major victory for House Democrats in their struggle against his vow to stonewall “all” of their oversight subpoenas. In a 66-page ruling, the panel rejected Mr. Trump’s argument that Congress had no legitimate legislative authority to seek his business records from the firm, Mazars USA, because the committee was trying to determine whether he broke existing laws — not weighing whether to enact a new one. “Having considered the weighty issues at stake in this case, we conclude that the subpoena issued by the committee to Mazars is valid and enforceable,” wrote Judge David S. Tatel of the United States Court of Appeals for the District of Columbia. Mr. Trump is virtually certain to appeal the ruling, either to the full Court of Appeals or to the Supreme Court. But the decision — affirming an earlier ruling by a Federal District Court judge — was the first test at the appeals court level of the Trump legal team’s sweeping challenges to the constitutional authority of Congress to conduct oversight of his activities. Judge Tatel was joined by Judge Patricia A. Millett in the majority of the three-judge ruling. Both were appointed by Democratic presidents. Judge Neomi Rao, a former Trump administration official whom Mr. Trump appointed to the bench in March, dissented, saying she would have quashed the subpoena as exceeding the House’s legislative powers. Representative Elijah E. Cummings, the Democratic chairman of the oversight committee, hailed the appeals court’s decision. “Today’s ruling is a fundamental and resounding victory for congressional oversight, our constitutional system of checks and balances and the rule of law,” he said in a statement. “For far too long, the president has placed his personal interests over the interests of the American people.” Lawyers for Mr. Trump were reviewing the decision, said one, Jay Sekulow. “We continue to believe that this subpoena is not a legitimate exercise of Congress’s legislative authority,” he said. Sarah E. Sutton, a spokeswoman for the Justice Department, declined to comment on the ruling. The scope of Congress’s power to compel the production of information — and the president’s power to keep information secret — has emerged as a recurring battleground between House Democrats and Mr. Trump, whose legal team has put forth novel legal arguments in carrying out his vow to systematically defy House subpoenas. This week, Mr. Trump’s White House counsel, Pat A. Cipollone, sent a letter to the House declaring that the administration would not cooperate with the House’s impeachment inquiry, such as by providing documents or permitting witnesses to testify. The Trump legal team has separately argued that Mr. Trump’s current and former White House aides are absolutely immune from subpoenas for their testimony — meaning they would not even have to show up — and that Congress lacks legitimate legislative authority to scrutinize potential wrongdoing in the executive branch. The appeals court ruling on Friday centered on that third argument, and it was in some respects already obsolete because the premise of the argument was that the House was relying only on its routine legislative and oversight authorities, rather than any extra investigative powers that lawmakers gain when engaged in an impeachment inquiry. But since the Mazars case started going through the courts, the House Judiciary Committee and Speaker Nancy Pelosi have declared that the chamber is conducting an impeachment inquiry. The Trump administration has disputed that premise, since the full House has not voted for a resolution approving such an investigation. Friday’s ruling did not address the question of whether an impeachment inquiry is underway — and, if so, whether that matters. The majority on the panel ruled for the House without any need to invoke its impeachment powers. Specifically, the fight centered on whether the House Oversight and Reform Committee had the authority to compel Mazars to turn over Mr. Trump’s financial records as part of its routine legislative and oversight powers, even if the committee’s purpose was in part to determine whether Mr. Trump committed crimes. The committee, led by Mr. Cummings, issued the subpoena after it came to light that Mr. Trump had failed to list on his ethics disclosure forms a debt that he owed and then repaid to his former lawyer and fixer, Michael D. Cohen, for paying hush money to a pornographic actress just before the 2016 election to keep quiet about an affair she claimed to have had with Mr. Trump. He has denied the relationship. Mr. Cohen also testified before Congress that Mr. Trump routinely changed the value of his assets for different financial purposes, like inflating their value for loan applications but deflating them for taxes. (Mr. Cohen was separately convicted of lying to Congress in earlier testimony.) In making the request for documents and then issuing the subpoena, Mr. Cummings said that Congress was trying to determine whether the president had broken laws, but he also said that lawmakers were trying to decide whether to update financial disclosure laws. Mr. Trump’s legal team, which sued Mazars to obtain a court order blocking it from complying with the subpoena, argued that this meant the committee was effectively trying to carry out a criminal investigation. That, they asserted, was an executive branch job, not a legislative one, and so the House’s subpoena was invalid. But Judge Tatel wrote that Supreme Court precedent granted broad authority to Congress to issue subpoenas for information that could be used to enact new laws — even if it could also be useful as criminal evidence — and imposed no requirement on lawmakers to say that legislation was their specific purpose. In any case, he also wrote, Mr. Cummings had made reference to investigating whether new legislation was necessary. “We conclude that the public record reveals legitimate legislative pursuits, not an impermissible law enforcement purpose, behind the committee’s subpoena,” he wrote. Judge Rao disagreed. Lawyers for the House, led by their counsel Douglas Letter, had relied only on the House’s normal oversight powers in support of the subpoena, she noted, arguing that permitting lawmakers to pursue such information without an impeachment inquiry would make it too easy to harass the presidency. “When the House chooses to investigate the president for alleged violations of the laws and the Constitution, it must proceed through impeachment, an exceptional and solemn exercise of judicial power established as a separate check on public officials,” she wrote. But Judge Rao did not address the House Democrats’ more recent assertions that they are, in fact, already conducting an impeachment inquiry — nor the Trump administration’s claims that there is no such inquiry for legal purposes. In a letter to Democrats celebrating the ruling, Ms. Pelosi wrote: “The president’s actions threaten our national security, violate our Constitution and undermine the integrity of our elections. No one is above the law. The president will be held accountable.”", 
      "date": "Oct. 11, 2019"
    }, 
    {
      "subtitle": "In a crowded field, experts agree, debates can result in a momentary spike in support for second-tier candidates — but it rarely lasts.", 
      "author": "Giovanni Russonello", 
      "url": "https://www.nytimes.com/2019/10/11/us/politics/latest-democratic-polls.html", 
      "title": "Democrats Will Hope for a ‘Bump’ at Next Week’s Debate. What’s It Worth?", 
      "content": "Welcome to Poll Watch, our weekly look at polling data and survey research on the candidates, voters and issues that will shape the 2020 election. After next week’s Democratic debate, pundits will inevitably argue over who won and who lost, and they’ll scour the polls to see if any presidential candidate has gotten a “bump” in support. But as high-profile as they are, debates rarely help a candidate break out of a crowded field. And strategists generally agree that post-debate spikes in the polls seldom last for long. A dozen candidates will be onstage at the CNN/New York Times debate on Tuesday, but experts broadly agree that none of them are likely to see a significant change in fortunes in a single night. Ahead of the 2016 Republican primaries, Donald J. Trump’s publicity-heavy campaign rolled along with impregnable strength, despite the fact that TV viewers rarely gave him high marks for his debate performances. The current Democratic race has been characterized by a similar steadiness, experts say, with former Vice President Joseph R. Biden Jr. continuing to command the support of around a quarter of Democratic respondents, and Senator Elizabeth Warren of Massachusetts rising consistently and sometimes surpassing him. “Democratic primary voters basically seem to be fine with their top three options,” said Sean McElwee, a co-founder of the polling and analytics firm Data for Progress, referring to Mr. Biden, Ms. Warren and Senator Bernie Sanders of Vermont. “There’s the possibility that a debate would drive a news cycle that would bolster a candidate,” Mr. McElwee added. “But instead, what we’ve seen is that those sorts of moments tend to fall off.” Senator Kamala Harris of California is the only Democratic candidate this cycle who has seen a statistically significant jolt in the polls after a debate. At the first round of Democratic debates in late June, she confronted Mr. Biden on his past opposition to federally mandated school busing. She immediately leapt up in the polls, enjoying double-digit support among primary voters nationwide throughout July. Perhaps more important, the exchange gave her fund-raising operation a shot of adrenaline: Just 24 hours after the debate, she had raised $2 million. But she soon fell from the race’s top tier, and has not broken into the double digits in any major national poll since the start of August. Mr. McElwee cited recent studies showing that candidates’ success is strongly driven by the sheer amount of news coverage they manage to receive — an argument that was borne out by the success of Mr. Trump in the run-up to the 2016 primaries, when he was able to reverse the unfavorable opinions that most Republican voters held of him, not by changing the tenor of his campaign, but by securing almost nonstop coverage. “There are lots of different earned-media opportunities in the current climate — and debates are very important,” Mr. McElwee said. “But if you look at the polling, there’s been lots of people who have had good debates, bad debates, and at the end of the day, it hasn’t really changed the broad structure of the race.” “In the broad scope of cable news coverage, the one hit per month of the debate is not enough to make a candidate break through,” he added. The Democratic pollster Celinda Lake said that debates can help drive future coverage, resulting in a snowball effect. But she added that candidates’ fortunes will largely be determined on the ground in early-voting states. “I think that honestly, the debates are having more impact on news coverage than they are having impact on voters,” Ms. Lake said. “Candidates don’t get known by unveiling a good plan at the debate. They become known by immersing themselves in these early states.” To qualify for November’s debate, candidates will need to reach 5 percent support in two polls in early nominating states, or 3 percent in four early-state or national polls. These are higher thresholds than for any debate thus far. A bump after next week’s debate could, at the very least, help candidates such as Senator Amy Klobuchar of Minnesota or the former housing secretary Julián Castro — who are now foundering in the low single digits — secure a spot onstage next month. But historically, early debates have been more likely to disqualify a candidate than to provide a lasting jolt of momentum. In 2011, Gov. Rick Perry of Texas pledged in an early debate to eliminate three agencies from the executive branch if elected president but couldn’t remember the name of one of the agencies. He never recovered from the flub. (When Mr. Trump became president, however, Mr. Perry was chosen to head the Department of Energy, the very agency he had forgotten to name.) Last election cycle, the businesswoman Carly Fiorina enjoyed a strong showing in the second Republican primary debate, seeing a sizable uptick in support in the days afterward. But she could not convert it into a consistent climb in the polls. “Successful first debate performances create buzz for a candidate but also generate expectations for continued success,” the historian and presidential scholar Bruce Buchanan wrote in an email. “If he or she does O.K. but less well in the second debate, the story is about underperformance.” Bob Shrum, a Democratic strategist and speechwriter, said that Ms. Warren had found success by performing strongly in debates — while not chasing a breakout moment. “She has done this by performing consistently well by not looking for a cute line, and my guess is that she’ll continue that,” he said. But Mr. Shrum noted that as the field of candidates narrows, and the remaining candidates each get more airtime, the opportunity for news-making moments will increase. “These early debates are more like skirmishes,” he said. “We’re now getting into the later debates — and they can have an impact.” It may not be until the general election that the debate stage once again assumes prime importance. “Primary debates are more like a beauty contest or a cameo appearance in a play,” Peter Hart, a longtime Democratic pollster, said. “It gives you a glimpse, it gives you an insight, and it allows a candidate to get noticed. More importantly, it can eliminate a candidate’s potential to be the nominee.” On the other hand, he said, “general election debates have a huge impact upon the dynamics of the election — and the outcome.”", 
      "date": "Oct. 11, 2019, 11:46 a.m. ET"
    }, 
    {
      "subtitle": "Many of the voters who back an inquiry have not reached the same conclusion on removal.", 
      "author": "Nate Cohn", 
      "url": "https://www.nytimes.com/2019/10/11/upshot/impeachment-trump-polling.html", 
      "title": "Support for Impeachment Has Grown but Also Slowed", 
      "content": "Public support for impeaching President Trump — and also for removing him from office — surged after Nancy Pelosi announced the House impeachment inquiry more than two weeks ago. For now, that support hasn’t reached the point where one might expect Republican members of Congress to feel substantial political pressure to turn on the president. And while Democrats hope support for impeachment has room for growth, there is not yet conclusive evidence that it’s still increasing. But the change in public opinion is more than enough for Democrats to avoid the most negative political consequences that they’ve long feared from pursuing impeachment. Many polls showing lopsided support for impeachment focus on the impeachment inquiry itself, including one this week from the Washington Post/George Mason University that showed adults supporting the inquiry by a 20-point margin, 58 percent to 38 percent. The high level of support suggests that, at least for now, Democrats are on firm political ground in examining Mr. Trump’s attempt to have Ukraine’s president investigate a political rival’s family. Many voters seem to be taking the allegations against Mr. Trump seriously, and they may eventually determine that his conduct merits removal from office. But for now, many of the voters who support an inquiry have not reached that conclusion. Polls asking whether voters support impeaching Mr. Trump and removing him from office show far more mixed results. The same Washington Post/George Mason University survey found that 49 percent supported removing Mr. Trump from office, while 44 percent opposed. And other recent polls, including one from NBC/WSJ, suggest that fewer Americans support impeaching and removing the president than not. Question wording, question order or even the timing of the survey in a rapidly unfolding news environment could explain the differences. On average, voters appear to support impeaching and removing the president by a narrow margin, 47 percent to 44 percent, in polls conducted over the last 10 days. It’s hard to say what level of political support for impeachment might begin to change the political calculus for members of Congress. There are very few precedents for impeachment, and the factual merits of the case against the president could be just as important as the politics. But it’s safe to say that the current political environment will not do much to pressure Republicans. Since the Pelosi announcement, the president’s approval rating has slumped to 42.8 percent from 44.3 percent among likely or registered voters, according to FiveThirtyEight. But this merely brings his ratings back to where they were on Sept. 10, and well within the normal range for the president since the end of the government shutdown in January. Support for impeachment and removal has increased to about the level of opposition to Brett Kavanaugh’s Supreme Court nomination; he wound up winning all but unanimous support from Senate Republicans. And there is limited evidence that support for impeachment and removal continues to increase. That may be surprising, given flashy headlines showing substantial increases in support. But those results are mainly being compared with those taken before the inquiry was announced. It is not obvious that the most recent polls are much worse for the president than those taken a week or two ago. Four pollsters have conducted two surveys since the announcement of the inquiry (HarrisX, YouGov, Morning Consult and Quinnipiac), and on average they show support for impeachment creeping up — from plus-4 to plus-5 over an average of 10 days between the initial and second survey. In other words, it is possible that impeachment support quickly rose as Democrats got on board, but has not necessarily increased much since. Data from Civiqs, an online firm, shows a similar trend, with support for impeachment growing by a net of one percentage point since an initial post-inquiry bounce. The higher level of support for the impeachment inquiry can give Democrats hope that there are many voters, including many Republicans, who might be open to reaching a verdict against the president. The Watergate scandal is often cited as a favorable precedent for the Democrats in this regard. Support for impeachment of President Richard M. Nixon tended to grow during that investigation. It is far too soon to say whether a similar story will play out for President Trump.", 
      "date": "Oct. 11, 2019"
    }, 
    {
      "subtitle": "The presidential debates will be held in Indiana, Michigan and Tennessee, and a vice-presidential debate will be held in Utah.", 
      "author": "Shane Goldmacher", 
      "url": "https://www.nytimes.com/2019/10/11/us/politics/when-are-the-2020-presidential-debates.html", 
      "title": "2020 Presidential Debate Schedule Announced for General Election", 
      "content": "The nonpartisan commission that governs presidential debates announced on Friday the dates and sites for the three presidential debates and one vice-presidential debate during the 2020 general election. All four debates will be held at universities, as has been recent custom. The presidential debates will kick off Sept. 29 at the University of Notre Dame in Indiana, according to the Commission on Presidential Debates. (The campus is adjacent to South Bend, Ind., where Pete Buttigieg, one of the candidates for the Democratic nomination, is mayor.) The others will be held Oct. 15 at the University of Michigan in Ann Arbor and Oct. 22 at Belmont University in Nashville. The lone vice-presidential debate is scheduled for Oct. 7 at the University of Utah in Salt Lake City.  President Trump won Indiana, Michigan, Tennessee and Utah in 2016, three of them handily. In Michigan, which will most likely be a battleground state in 2020, he beat Hillary Clinton by fewer than 11,000 votes. The debates will run for 90 minutes without commercial interruption, the commission said. The moderators and format will be announced later. The commission has sponsored and produced the general election debates since the 1988 campaign. Not only do general election debates attract more viewers than any other campaign event; historically, these matchups have ranked among television’s most-watched broadcasts, political or otherwise. In 2016, the first debate between Mr. Trump and Mrs. Clinton was seen by 84 million live television viewers, the biggest audience since television debates started in 1960. Roughly 18 million people watched the first Democratic presidential debate this year on live television, a record for a Democratic primary matchup. The next Democratic primary debate, hosted by CNN and The New York Times, is scheduled for this Tuesday night.", 
      "date": "Oct. 11, 2019"
    }, 
    {
      "subtitle": "null", 
      "author": "Alan Rappeport", 
      "url": "https://www.nytimes.com/2019/10/11/us/politics/turkey-sanctions-syria-kurds-trump.html", 
      "title": "White House Threatens Turkey With Crippling Sanctions", 
      "content": "WASHINGTON — The Trump administration on Friday belatedly threatened new sanctions against Turkey that officials said could cripple Turkey’s economy in response to its military offensive against Kurds in northern Syria. President Trump will sign an executive order giving the Treasury Department new powers to punish Turkish government officials if Turkey targets ethnic and religious minorities in its operations — which are specifically aimed at Kurdish fighters. The White House also warned that if Turkey allowed any Islamic State fighters being held in prisons in the area to escape, the United States would respond forcefully. “We can shut down the Turkish economy if we need to,” the Treasury secretary, Steven Mnuchin, said in a briefing at the White House, echoing a threat that Mr. Trump briefly made, and then retreated from, this week on Twitter. But the warning was, so far, just talk: Administration officials said they were not yet moving ahead with any new sanctions against Turkey, and left unclear what kind of transgressions might trigger enforcement of the threat. Some American diplomats said they viewed the warning as an effort to pre-empt congressional sanctions. Mr. Trump’s decision to remove American forces from the region in advance of the Turkish offensive has been met with condemnation from both parties in Congress, including from some of Mr. Trump’s staunchest supporters. Senator Mitch McConnell, the majority leader, denounced the president’s move as a betrayal of American allies; so did Senator Lindsey Graham of South Carolina, who declared that “the ability to recruit partners to fight radical Islam in the future has been virtually destroyed.” White House officials say they are concerned that lawmakers are moving forward with bipartisan sanctions legislation, which could have enough votes to override a presidential veto. That happened in 2017, involving sanctions on Russia. It was the timing of Friday’s threat, more than the substance, that seemed particularly mysterious. In the days since President Recep Tayyip Erdogan spoke with Mr. Trump by telephone about pulling American troops out of Syria, several senior American diplomats have said that Mr. Trump made a crucial error by not threatening sanctions before the withdrawal. By doing so after the fact, Mr. Erdogan would lose face if he changed course in response to such a warning. Nonetheless, Secretary of State Mike Pompeo, in an interview with The Tennessean during a visit to Nashville, seemed to be trying to contain the damage. “The president’s made very clear, both publicly and directly to Turkey as well as through State Department channels, that there will be a real cost to Turkey, to President Erdogan, if he continues down this path; that there’ll be an economic cost,” he said. “But the Kurdish people here and the leadership in Turkey should understand that we don’t think what President Erdogan did was right. It’s not proper, and he needs to stop.” Mr. Mnuchin said that he did not believe that the president’s actions were what led to the current situation in the region. Mr. Trump had told the Turkish president that American troops fighting alongside the Kurds in a counterterrorism mission against the Islamic State would be pulled back from the border with Syria, which critics of the president’s policy said effectively gave the Turks a green light to start their offensive. The executive order will give Treasury the authority to impose secondary sanctions against anyone engaging in “knowing and significant transactions” with designated individuals and entities of Turkey’s government. Mr. Mnuchin said that banks should be on notice for potential sanctions actions by the United States. A senior State Department official said sanctions were likely to be similar to economic penalties that were imposed in 2018 against the Turkish justice minister and interior minister. Those sanctions were meant to punish Mr. Erdogan’s government for detaining an American pastor, Andrew Brunson, on charges of espionage.", 
      "date": "Oct. 11, 2019"
    }, 
    {
      "subtitle": "Staff Sgt. Alex Conrad, 26, died from wounds he received during a militant attack on a small outpost in Somalia.", 
      "author": "Thomas Gibbons-Neff", 
      "url": "https://www.nytimes.com/2019/10/11/world/africa/soldier-death-somalia.html", 
      "title": "Botched Medical Procedures May Have Led to Death of U.S. Soldier", 
      "content": "A complex and difficult medical procedure that ultimately failed might have contributed to the death of an American Special Forces soldier killed last year in a firefight in Somalia, according to an investigation into the episode obtained by The New York Times. The redacted Army investigation illustrates the intense violence that can accompany the Pentagon’s quiet “train, advise and assist” missions in distant corners of the globe, and the limitations of the American military despite its ambitious reach, vast resources and extensive training. Staff Sgt. Alex Conrad, 26, died from wounds he received during an attack on June 8, 2018, at a small outpost near the town of Jamaame, about 200 miles southwest of Mogadishu, the capital. He was hit with shrapnel from a mortar round, peppering his face, neck, stomach and legs, starting an hourlong effort to save his life. Three other Americans and a Somali soldier were wounded in the attack by militants from al Shabaab. The investigation’s documents also highlight the disparity in resources between different countries overseen by the American military command in Africa. Failures from the Oct. 4, 2017, ambush in Niger that left four American soldiers and five Nigeriens dead pointed to a lack of medical evacuation support, overhead surveillance and intelligence about their enemy. But despite the influx of resources in Somalia, where troops there had medical helicopters minutes away and drones orbiting above them, the Shabaab militants still managed to organize a rapid and deadly attack that killed Sergeant Conrad before they quickly disappeared back into the underbrush without detection. Around 2:45 that afternoon, minutes after small-arms fire was directed at the American and Somali outpost, mortar fire landed within the position. The firefight was fast and intense. The blasts from the mortars immediately wounded Sergeant Conrad and the three other Americans. As the Americans scurried to tend to the wounded, Sergeant Conrad complained about the pain from the injury in his left leg, the documents say. Although he was still alert, blood from the wound in his jaw was slowly suffocating him. Ultimately, the team’s medic performed a surgical cricothyrotomy, in which he would cut into Sergeant Conrad’s neck — at his cricoid membrane — before inserting a tube that would allow unobstructed air to flow into his lungs. The medic, whose name was redacted in the report, noted the spot with a marker before making a vertical, then horizontal, incision. Sergeant Conrad twice dislodged the tube, labeled in the report as a Shiley tube. The team’s medic tried at least once to make his initial incision longer in an effort to open the newly made airway. Sergeant Conrad was still breathing when he was loaded in a truck to rush him to the landing zone. Two HH-60 Pave Hawk helicopters, crewed by elite Air Force pararescue medics, were racing from a larger American base outside the town of Kismayo, roughly 40 miles away. The helicopters arrived about 15 minutes after the Americans called for the medical evacuation. Three of the wounded Americans, including Sergeant Conrad, were loaded onto one of the Pave Hawks, where those aboard began their own assessment. One of the pararescue team members started using a bag valve mask to push air into a newly inserted tube that was placed in the same incision made by the Green Beret’s medic. The Air Force medic noted that “the compression of the bag valve mask had become more difficult.” At around 3:15, the flight arrived back at Kismayo, where a surgical team was waiting. Sergeant Conrad was pronounced dead about 15 minutes later. The investigation found that “although fully qualified medical personnel made multiple attempts to establish an airway via surgical cricothyrotomy” on Sergeant Conrad “after he received his injuries, no incision was made through the tissue plane into his airway. This might have contributed SSG Conrad succumbing to his injuries.” To be sure, a cricothyrotomy in a combat zone is fraught with hazard and is often a last-ditch effort to help someone’s breathing. Even in a controlled environment, such as a hospital, the procedure is extremely challenging. “The attempted procedure under the conditions that existed on June 8, 2018, was extraordinary in itself,” the report says. An addendum to the investigation stated that the Special Operations Command that oversees operations in Africa, and subsequent units, had already moved to review medical training related to the procedure. Ultimately, the investigating officer concluded that no “individual, unit or organization acted in a negligent manner” during the operation and ensuing medical care. The American military’s Africa Command had no immediate comment on the investigation. The Green Beret team’s mission on June 8, alongside their Somali counterparts, was to push into Shabaab-held territory, where the militants had been instigating attacks from, and build the small base that would later be renamed after Sergeant Conrad. Sergeant Conrad, from Chandler, Ariz., joined the Army in 2010 and was trained to interact with local populations to glean information about militant groups. He had been to Afghanistan twice before finding himself attached to a Green Beret team from Third Special Forces Group in Somalia. When he was killed, his team had less than a month left on their deployment. He was posthumously awarded a Bronze Star with valor for running out in the early minutes of the firefight on June 8 and ushering a civilian linguist to safety. The Shabab, an extremist group that has long tried to overthrow Somalia’s Western-backed government, has lost much of the territory it once controlled, but Pentagon officials fear the group still might be growing in Somalia and elsewhere in East Africa. Last month, Shabaab militants attacked a Somali air base used by American forces with multiple car bombs, injuring civilians there. About 500 American troops are in Somalia, and they are mostly Special Operations units. Last year, after a broad review under Jim Mattis, the defense secretary at the time, the Pentagon announced that it was reducing the number of troops on the continent. In 2017, a member of the Navy SEALs, Senior Chief Petty Officer Kyle Milliken, was killed and two other American troops were wounded in a raid 40 miles west of Mogadishu. The focus on providing emergency medical care to wounded troops in what is called “the golden hour” has long been a concern of Defense Department officials, especially during the height of combat in the wars that followed the attacks of Sept. 11, 2001. As defense secretary in 2009, Robert M. Gates became concerned that the rugged terrain and vast distances of the Afghanistan war zone were keeping wounded troops from reaching hospital care within 60 minutes. Mr. Gates ordered more helicopters to Afghanistan to evacuate wounded troops, and directed that helicopters previously set aside for rescuing downed pilots be reassigned to medical evacuation. Mr. Gates also increased the number of field hospitals. A peer-reviewed medical study published in 2015 found that those initiatives saved an estimated 359 lives from June 2009 to March 2014. Applying the same standard to operations elsewhere has proved difficult, as was evident in the ambush in Niger.", 
      "date": "Oct. 11, 2019, 2:26 p.m. ET"
    }, 
    {
      "subtitle": "null", 
      "author": "Noam Scheiber", 
      "url": "https://www.nytimes.com/2019/10/11/business/economy/democratic-candidates-labor-unions.html", 
      "title": "Democrats’ Bolder Stand on Labor Reflects Nation’s Ideological Shift", 
      "content": "When Bernie Sanders ran for president in 2016, his campaign was strikingly pro-labor. He proposed a $15-an-hour minimum wage, which was much further than most mainstream Democrats, including Hillary Clinton, were willing to go. He denounced a trans-Pacific trade deal that was anathema to many unions. He endorsed an organizing method, known as card check, that would allow workers to unionize without holding a secret-ballot election. Yet by the standards of the race for the 2020 Democratic nomination, the Bernie Sanders of four years ago was something of a piker. At least half the candidates who will appear in next week’s presidential debate — including Mr. Sanders — have labor platforms that are more ambitious than his 2016 version. Several candidates have pledged to ban noncompete agreements, which hold down wages for workers, and mandatory-arbitration clauses, which prohibit lawsuits against employers. They would effectively require many companies to treat independent contractors as employees, making the workers eligible for the minimum wage and unemployment insurance. They would enact a number of measures that would help workers unionize and strike, like allowing them to lead boycotts of an employer’s customers, which is currently illegal. “For the first time we see really robust agendas in labor and employment policy that are about unions and also about really high labor standards,” said Lawrence Mishel, the former president of the Economic Policy Institute, a liberal think tank. “Politicians have been willing to say some of this stuff, but they haven’t been public about it.” Perhaps the most ambitious proposal is an idea known as sectoral bargaining, in which workers would bargain with employers on an industrywide basis rather than employer by employer. Sectoral bargaining, which is common in Europe, would make it possible to increase wages and benefits for millions of workers in relatively short order, even for those who aren’t union members. It would also give employers an incentive to create better-paying jobs because doing so would no longer bestow a major cost advantage on competitors. Under a sectoral bargaining system, unions or worker groups would have to show support from a certain share of workers in order to begin negotiating on their behalf — for example, by getting 15 or 20 percent of workers in an industry to sign cards. At that point, a federal agency like the Labor Department would convene the bargaining, with employer groups on one side and the worker groups on the other. The agency would review any resulting agreement, which, once approved, would become binding on all employers in the industry. In recent months, Mr. Sanders and Elizabeth Warren, along with Pete Buttigieg, Cory Booker and Beto O’Rourke, have released labor plans that would either enact sectoral bargaining or take significant strides in that direction by allowing workers to negotiate with multiple employers at once. That such a range of Democratic candidates have signed on to far-reaching labor proposals reflects the ways that lackluster wage growth, economic insecurity and widening inequality are upending politics and shattering a longstanding policy consensus. In the early stages of the economic recovery a decade ago, most workers were primarily concerned with avoiding unemployment, said Celinda Lake, a Democratic pollster who has conducted research on voters’ economic concerns. But as the expansion has plodded on, the focus has shifted from having any job to having a good job, which workers see as rare. “You’re really trying to do something about what jobs pay,” Ms. Lake said. With people increasingly open to more radical tools for accomplishing this, joining a union can seem downright middle of the road. According to recent polling by Pew Research Center, 42 percent of Americans view socialism favorably, up from 29 percent in 2010. During roughly that same time, support for unions has climbed significantly, from less than half to about two-thirds of Americans. The increased openness to unions and collective bargaining has dovetailed with a palpable shift in expert opinion. For decades, economists tended to play down the importance of unions, attributing much of the increase in income inequality to a growing demand for skilled workers that resulted from automation and the spread of information technology. Some otherwise liberal economists were skeptical or even hostile to unions, seeing them as cartels that drove up wages for their members at the cost of reducing employment. “I learned this in graduate school in macro — anti-union stuff from people who were highly inclined toward government redistribution,” said the economist and columnist Noah Smith, who earned his Ph.D. at the University of Michigan and has written about economists’ suspicion of unions. “There was this definite anti-union bias among liberals in the economics profession.” But in recent years, many economists have begun to reconsider those views. Partly this reflects a broader ideological shift in the country away from the market-friendly policy approach of the 1980s and ’90s, which has lost credibility as inequality has widened. “We as social scientists live in a society where clearly the general social and political environment affects the questions we ask,” said Arindrajit Dube, a labor economist at the University of Massachusetts Amherst. And partly this reflects a proliferation of research, which some of the campaigns have specifically cited, showing that employers have considerable power to hold down wages below the level the market would set. Whatever the case, there appears to be a growing consensus among center-left economists that unions are a critical check on the tendency of capital to vacuum up the gains from economic growth. A recent paper by economists at Princeton and Columbia showed that unions raised wages for low-skilled workers in the decades in which inequality was narrowing and concluded that unions have “had a significant, equalizing effect on the income distribution.” A recent paper by the centrist Hamilton Project concluded that “unions lift wages, reduce inequality, and shape how work is organized.” And then there is the growing consensus among union experts, including labor leaders, that improving workers’ standards of living after decades of declining unionization requires a much more ambitious approach than the movement previously embraced. Before the 2004 and 2008 presidential elections, the politically powerful Service Employees International Union told candidates that they would have to present a detailed health care proposal to be considered for its endorsement. This year, the union asked candidates seeking its support to produce specific plans to help underpaid workers act collectively and urged them to incorporate industrywide bargaining as a key pillar. Other union experts have helped to deliver this message behind the scenes. Larry Cohen, a former president of the Communications Workers of America and a top volunteer adviser to Mr. Sanders in 2016 and now, said that he has been touting the importance of sectoral bargaining to Mr. Sanders in recent years. “The last time I talked to him about this was right before he decided to run,” said Mr. Cohen, who looked closely at sectoral bargaining systems in Norway and Argentina while traveling to those countries after the last election. “He was genuinely excited by it.” Mr. Cohen has also been involved in an effort by two faculty members at Harvard Law School, known as the Clean Slate for Worker Power project, to convene dozens of labor experts, activists and organizers to reimagine labor law from the ground up. The group won’t publish its recommendations until January, but in the meantime it has worked to disseminate ideas like sectoral bargaining across the campaigns. Sharon Block and Benjamin Sachs, the Harvard faculty members involved, have weighed in with several campaigns that have embraced this approach, according to aides to Ms. Warren, Mr. Buttigieg, Mr. O’Rourke and Mr. Booker. Ms. Block, a former Obama administration official and congressional staff member who is a veteran of legislative efforts to make unionizing and collective bargaining easier, said experience had taught her that advancing labor interests through provisions like card check doesn’t work: Such measures tend to be too small to matter substantively, and they fail to generate political excitement among those who would benefit. “The folks who don’t want this to happen will fight just as hard whether it’s small or big,” Ms. Block said. “But doing something bigger makes moving legislation easier because you have the potential to have a much bigger constituency behind it.”", 
      "date": "Oct. 11, 2019, 3:43 p.m. ET"
    }, 
    {
      "subtitle": "A perpetual state of aggression on trade has been a drag on business decision-making, especially in manufacturing.", 
      "author": "Neil Irwin", 
      "url": "https://www.nytimes.com/2019/10/11/upshot/trade-deal-trump-china.html", 
      "title": "Trump and China Have a ‘Phase One Deal.’ The World Economy Is Still at Risk.", 
      "content": "Financial markets are downright exuberant about the arrival of some trade peace — at least for now — between the United States and China. President Trump boasted Friday afternoon of a “substantial phase one deal,” including Chinese purchases of American agricultural products and an accord on currency policy. The United States is also holding off on tariffs that were to go into effect next week. Over the last few days, the expectation of such a “mini-deal” between the two superpowers drove up stocks and helped ease recession fears. There’s no question that this is good near-term news for the economy and the markets. But anybody who has followed the ups and downs of trade policy in the last two years — or who understands the actual ways that the trade wars are affecting the economy — won’t be nearly as optimistic as the president’s words suggest are warranted. In the Trump trade strategy over the last two years, tariffs have acted as a ratchet — moving  in only one direction or holding steady, never reversing. Apparent agreements are always subject to renegotiation. The administration turns up the pressure on China with sharp words, higher tariffs and promises of future tariffs. The Chinese retaliate, aiming to punish American interests. The stock market drops, which prompts negotiations to resume, and the administration backs off the pledged escalation. Friday’s events represent the latter stages of that cycle. It’s particularly evident when you look at what the de-escalation consists of. The deal did not reduce tariffs already in place on Chinese imports but rather further delayed an increase that was announced during the escalation phase over the summer. “The only things we’ve learned are that Trump loves tariffs and he doesn’t have a long-term plan,” said Mary Lovely, a senior fellow at the Peterson Institute for International Economics. “Are these guys in markets like Charlie Brown and the football?” The central tensions between the United States and China — and the domestic political constraints on each side that stand in the way of an overarching deal — remain very much in place. China’s president, Xi Jinping, cannot back away from goals of dominating many of the industries of the future; President Trump cannot acquiesce to those goals without huge political risks. The new “phase one” deal does not address one of the most fraught issues, around the ability of the Chinese telecommunications company Huawei to sell in the United States. Moreover, the recent history of American trade policy implies that even when a deal seems to be signed, sealed and delivered, it doesn’t mean trade peace has been achieved. In June, President Trump threatened to put new tariffs on Mexican imports to force the Mexican government to do more to curtail migration from Central America. The threat came after the conclusion of extended negotiations to rework Nafta into the United States-Mexico-Canada Agreement. Even though those particular Mexican tariffs never went into effect, the message to businesses was that trade tension is a new normal — not a limited, tactical war with achievable goals, but a perpetual state of aggression that can become more or less intense at any particular time. You can see that recognition in how businesses are behaving. The scale of the tariffs actually being collected thus far remains moderate relative to the scale of the United States economy. But there is plenty of evidence that this sense of trade chaos is hanging over business decision-making, especially in the export-focused manufacturing sector. “Markets may respond, but that doesn’t mean that firms will,” said Emily Blanchard, a trade economist at Dartmouth’s Tuck School of Business. “It’s firms’ decisions that matter for the economy.” Business investment spending subtracted from overall G.D.P. in the second quarter, and job creation by the factory sector has slowed enormously in 2019 — only 3,000 jobs a month, down from 22,000 in 2018. A report on September factory activity showed it in negative territory. “It is difficult to take that much comfort from the latest signs of progress given that we’ve had plenty of apparent truces in recent months end abruptly in a sudden further escalation in trade tensions,” Michael Pearce, senior United States economist at Capital Economics, said in a note to clients. He noted a twist: The agreement on currency policy that is a key part of the new deal was part of a previous truce that then fell apart during a period of re-escalation. As that shows, in Trump-era trade policy, the risk of a major disruption to world commerce never really goes away. It just arrives in unpredictable waves — and Friday’s deal represents a low ebb.", 
      "date": "Oct. 11, 2019"
    }, 
    {
      "subtitle": "A Wisconsin-based purveyor of pepper, paprika and poppy seeds spent more on impeachment-related Facebook ads than any entity besides President Trump.", 
      "author": "Jacey Fortin", 
      "url": "https://www.nytimes.com/2019/10/11/business/penzeys-spices-impeach-ads.html", 
      "title": "A Spice Company Spent $92,000 on Pro-Impeachment Facebook Ads in a Week", 
      "content": "Candidates, campaigns and companies have unleashed a flood of Facebook advertisements related to impeachment, and it might come as no surprise that President Trump and his re-election campaign are far outspending everyone else. But last week, the second biggest spender was an entity you might not be familiar with: a purveyor of pepper, paprika and poppy seeds based in Wisconsin. Penzeys Spices, a family-owned company in Wauwatosa, spent nearly $92,000 on Facebook advertisements related to impeachment from Sept. 29 to Oct. 5, according to data from a communications agency that tracks political spending. (That was eclipsed by Mr. Trump and his campaign, which spent more than $700,000.) Bill Penzey, who founded the company in 1986, said he found out about the second-place ranking on Wednesday when customers emailed him. When he shared the news with his wife, “she burst out laughing,” he said. “A sort of, ‘What have you done this time?’ kind of laugh.” Penzeys sells spices online and has dozens of brick-and-mortar stores across the United States. Mr. Penzey declined to share financial information but said the money he spends on Facebook ads is less than what he used to spend on print catalogs, which he stopped sending out about four years ago. The data on Facebook impeachment ads, which was reported by Axios on Wednesday, came from Bully Pulpit Interactive, a communications agency based in Washington whose 2020 Campaign Tracker shares information about political spending. The agency used an in-house program to identify Facebook ad copy with the words “impeach,” “impeachment” and “impeaching,” a spokeswoman said. By those parameters, Penzeys beat out every other ad buyer in the country, save its commander in chief. The spice company topped Tom Steyer, the billionaire Democratic presidential candidate; Senator Mitch McConnell, the Republican majority leader; the Democratic Governors Association; and the National Republican Senatorial Committee. Facebook’s publicly available data shows that from Oct. 2 to 8, Penzeys was the seventh-biggest spender on ads about “social issues, elections or politics” — a broader category than just impeachment — and the only entity in the top 10 that was not a politician or a policy-oriented organization. Penzeys spent nearly $120,000 on Facebook advertisements addressing politics during those seven days, Facebook data showed. (That’s less than Democratic presidential candidates like Joseph R. Biden Jr. and Elizabeth Warren, but more than Pete Buttigieg.) The company’s ads aren’t subtle. “This week the curtain was finally pulled back on how deeply un-American the Republican Party has become,” said one Facebook post on Oct. 3, referring to the impeachment inquiry against Mr. Trump. The same post encouraged readers to sign up for a cooking newsletter. But Mr. Penzey has been politically outspoken for a while, and that’s no secret to his customers. Followers of the chain’s Facebook page regularly see long messages criticizing the latest Trump administration news, with spice-related content sprinkled in. “I like to say it’s not a line we crossed,” Mr. Penzey said. “It’s a line that crossed us. We’ve alway been about kindness and compassion. And with the recent trends in the Republican Party and unlimited political spending, it’s created this message of anger toward marginalized people in order to create votes for tax cuts for the very wealthy.” In May, the company advertised a spice called “Justice” — the ingredients include shallots, garlic, onion and green peppercorns — while soliciting donations for the news organization Mother Jones. In July, it promoted a spice called Tsardust Memories — it has salt, garlic, cinnamon, pepper, nutmeg and marjoram — as a nod to Russian electoral interference, insisting in all caps that the issue was “NOT A NOTHING BURGER!!!!!” In November, the company used Facebook to encourage people to vote in the midterm elections. “Don’t let history lump you in with the white hoods and robes crowd,” Mr. Penzey said in a Nov. 2 post. “History has its eyes on all of us, and history remembers.” Facebook has been criticized for taking a hands-off approach to moderating political content — including paid ads — even when they include false information. But it has also been accused of censorship by conservative politicians, including Mr. Trump, who argue that the social network is more accommodating to liberal points of view. Penzeys may use “season liberally” as a trademarked slogan, but its outspokenness is not just a reaction to the president. The New York Times reported in 2006 that Mr. Penzey had started a food magazine that touched on prison reform, immigration policy and international adoption. He lost customers after his first issue featured a gay couple — two men who had triplets via a surrogate mother — long before gay marriage was legal in Wisconsin. The politics haven’t hurt Mr. Penzey’s business, he said, adding that he has lost some customers but gained some, too. “If you are a company and you have values, now is the time to share them,” Mr. Penzey said. “Now is the time that it’s important to share them.”", 
      "date": "Oct. 11, 2019"
    }, 
    {
      "subtitle": "null", 
      "author": "Eric Schmitt", 
      "url": "https://www.nytimes.com/2019/10/11/world/middleeast/trump-saudi-arabia-iran-troops.html", 
      "title": "Trump Orders Troops and Weapons to Saudi Arabia in Message of Deterrence to Iran", 
      "content": "WASHINGTON — The United States is sending about 3,000 additional troops to Saudi Arabia in the latest military response by the Trump administration after it accused Iran of attacks last month on Saudi oil facilities, the Pentagon said on Friday. The move came only five days after President Trump said that his desire to terminate America’s “endless wars” led to his decision to pull back from the border area between Syria and Turkey about 50 troops who were working to create a “safe zone” between Turkish and Kurdish troops. State Department officials struggled on Friday to answer questions about how the roles of the incoming American forces in the Persian Gulf kingdom and those being pulled back from the Syrian border differed, and whether the deployments to Saudi Arabia contradicted the president’s strategy of withdrawing from the Middle East. “The troops that we are sending into Saudi and the enhanced assets are defensive,’’ said Brian H. Hook, the State Department’s special representative for Iran. “They are there to defend our interests and to help Saudi defend itself.” At the Pentagon, Defense Secretary Mark T. Esper said he was dispatching two Air Force fighter squadrons, or about four dozen warplanes, as well as Patriot antimissile batteries and other air and missile defenses to the kingdom. “Saudi Arabia is a longstanding security partner in the Middle East, and has asked for additional support to supplement their own defenses,” Mr. Esper told reporters at the Pentagon, noting that he had called Saudi officials Friday morning to notify them. In the wake of the drone and missile strikes, which temporarily crippled about half of Saudi’s oil production, Mr. Trump initially weighed taking direct military action against Iran. The attacks, which Secretary of State Mike Pompeo recently called “an act of war,” rattled global energy markets. For the past two weeks, however, there has been no discussion of taking direct American military action against Iran for the strikes, apart from some consideration of proportionate cyber attacks. Last month, Mr. Trump opted for a modest deployment of a couple of hundred troops, along with Patriot air and missile defense systems. Friday’s announcement builds on those forces, although the fighter jets essentially will replace warplanes now flying off the carrier Abraham Lincoln, which will leave the Gulf of Oman in the coming weeks, military officials said. In response to Iranian attacks and provocations since May, Mr. Esper said the Pentagon has deployed about 14,000 additional forces to the gulf region. That includes airborne early warning aircraft, maritime patrol planes, Patriot air and missile defense batteries, B-52 bombers, a carrier strike group, armed Reaper drones and other engineering and support personnel. Since May, a spate of attacks have left six oil tankers damaged in the Gulf of Oman, with Washington accusing Tehran of inciting them. Iranian officials have denied that claim. The downing of an American drone in June by an Iranian surface-to-air missile only heightened tensions, prompting Mr. Trump to approve military strikes against Iran — before abruptly pulling back. Mr. Esper repeated the administration’s claim — backed by the United Kingdom, France and Germany — that Iran was also behind the attacks on the Saudi oil facilities. “Despite Iran’s attempts to deny their involvement, the evidence recovered so far proves that Tehran is responsible for these attacks,” Mr. Esper said, without providing any proof. The Saudis have recovered pristine circuit boards from one of the cruise missiles that fell short of its target, providing forensics specialists the possibility of tracing the missile’s point of origin, according to a senior American official briefed on the intelligence. One theory gaining traction among American officials is that the cruise missiles were launched from Iran and programmed to fly around the northern Persian Gulf through Iraqi air space instead of directly across the gulf where the United States has much better surveillance. Mr. Hook called the increased military presence part of a growing pressure campaign “to deprive the Iranian regime of the money that it needs to destabilize the Middle East and to terrorize other regions of the worlds” and “to bring Iran to the negotiating table.” He argued that Iran’s economy already has fallen into recession and could suffer an economic depression. But Mr. Hook struggled when asked how Mr. Trump squares his abhorrence of sending troops to the Middle East with his decision to bolster troop levels in Saudi Arabia. Mr. Hook differentiated between forces that are actively at war and those that are largely in peacekeeping or deterrent roles. Mr. Hook avoided saying much about the Turkey decision, which many of his colleagues in the State Department — and many Republican lawmakers — regarded as a major error. But he said that it was Mr. Trump himself who sent Mr. Pompeo to Saudi Arabia after the mid-September attack on its oil facilities “so that we could have this discussion about their defensive needs.”", 
      "date": "Oct. 11, 2019"
    }, 
    {
      "subtitle": "null", 
      "author": "Eric Lipton", 
      "url": "https://www.nytimes.com/2019/10/11/us/politics/donald-trump-jr-eric-trump-business.html", 
      "title": "Those Foreign Business Ties? The Trump Sons Have Plenty Too", 
      "content": "Last month, the Trump family business received approval from a local government in Scotland for a major expansion of its golf resort near Aberdeen, marking the largest real estate development financed by the Trump Organization since the 2016 election. In August, President Trump’s eldest son, Donald Jr., flew to Jakarta to help kick-start sales at a pair of Trump-branded luxury resorts planned for Indonesia. He appeared at a private event with wealthy prospective buyers and joined his politically connected billionaire Indonesian business partner at a news conference. And last year, Donald Jr. visited India to sell condos at future Trump-branded towers, appearing at an event that also featured India’s prime minister. “I’m here as a businessman,” Mr. Trump told the gathering in New Delhi. “I’m not representing anyone.” But for the children of the politically powerful, personal business and public dealings can often be indistinguishable, especially when private projects depend on foreign governments that are looking to bolster ties with Washington. In recent weeks, as the president has become embroiled in a scandal involving his interactions with Ukraine, Donald Trump Jr. and his brother Eric have taken to attacking Hunter Biden, the son of former Vice President Joseph R. Biden Jr., for his business dealings in Ukraine and China. The brothers have accused him of leveraging his family name for personal gain while his father served in the Obama administration. Among other things, Hunter Biden was on the board of a Ukrainian energy company that has been a focus of Mr. Trump’s interest in the country. “At the VERY LEAST, there’s the appearance of impropriety,” Donald Trump Jr. wrote on Twitter. “A clear conflict of interest.” At a rally in Minneapolis on Thursday, Eric Trump’s charged remarks about the former vice president’s son inspired the crowd of Trump supporters to chant, “Lock him up!” Republicans, led by the president, have sought to make Hunter Biden’s international business dealings an issue in the impeachment debate in Washington. But the high-profile attack roles being played by Mr. Trump’s eldest sons have now thrust their own business dealings into the spotlight too. Both sons have operated and promoted the Trump family business overseas during their father’s presidency, even as he retains ownership. And while the Trump and Biden father-son relationships differ in many ways, the business dealings have set up a simple parallel. “They are criticizing the vice president’s son for doing exactly what they are doing themselves,” said Martin Ford, a member of the Aberdeenshire Council in Scotland, which voted last month to approve a proposal by the Trumps to build a 500-unit housing development. “They are conducting international business here in Scotland.” Eric Trump, in a statement to The New York Times, said there was a distinction between his father’s career in business, with his recent turn to politics, and Mr. Biden’s decades in public office. “When my father became president, our family stopped doing international business deals,” he said, a reference to a pledge by the Trump Organization not to begin new overseas projects during the Trump presidency. Hunter Biden, he said, did the opposite when his father became vice president. The Trump business activities in India, Indonesia and Scotland were considered in compliance with the pledge, according to the company’s ethics rules, because they were building on deals already in the works. Mr. Biden’s campaign declined to comment on Friday. But in a tweet, the former vice president once again suggested that the attacks on his son were part of a political smear campaign. “Let me make something clear to President Trump: I’m not going anywhere,” he wrote. “You’re not going to destroy me. And you’re not going to destroy my family. I don’t care how dirty the attacks get.” Conducting business on the international stage has long been standard for the Trump Organization, which has placed the Trump name on hotels and towers in several countries. But its international dealings have become far more complicated since Mr. Trump took office and his sons took leadership of the business, especially when foreign governments have been involved to the company’s benefit. When the Trump Organization tangled with the majority owner of a property in Panama, for example, its local lawyers at one point called on the Panamanian president for an assist. In Indonesia, the government is helping to build a major new highway that will make a new Trump development more accessible. Construction is scheduled to begin soon on what will be known as Trump Residences Lido, which will include 280 homes, a golf course and a hotel, south of Jakarta. The Trump family’s partner in Indonesia — a billionaire named Hary Tanoesoedibjo — is financing the project, with the Trump family getting a cut of the sales. In marketing materials released this summer, which featured the Trump family logo and a photograph of Donald Trump Jr., the company noted that the “Trump Residences Lido can be accessed directly through the newly opened Bocimi Toll Road.” In Scotland, the Aberdeenshire Council recently dropped an earlier requirement that the new housing development could not be built until the Trumps spent tens of millions of dollars on other investments at the resort. Sebastian Leslie, a local official who supported the project, said the family received no special consideration. “We don’t do that — we don’t give anybody special favors,” Mr. Leslie said. But Mr. Martin, a council member who opposed the approval, said the Trumps benefited handsomely from the change. “It is a much, much more lucrative deal now,” he said. Revenues coming to the Trump family in the United States have drawn scrutiny too, including at the Trump International Hotel in Washington — a property, opened in the final stages of the 2016 campaign, that has flourished while Donald Trump Jr. and Eric have run the company. The hotel has been a magnet for Republican lobbyists and political fund-raisers, and companies and foreign officials with business before the Trump administration have thrown parties there, including the Kuwait embassy and the government of Azerbaijan. Mr. Trump’s daughter Ivanka has also retained a stake in the family business even as she serves as a White House adviser, and last year she received trademarks in China related to her separate fashion ventures. Her husband, Jared Kushner, a senior adviser to the president, maintains a stake in his own family’s real estate business, which has received and sought funding from international sources as well. In 2017, Mr. Kushner met privately at the White House with top executives from Citibank and the private equity firm Apollo Global Management. Those meetings came as the firms were contemplating sizable loans to his family’s business, Kushner Companies, which they did eventually make. And since Mr. Kushner entered the White House, his family has courted state-connected investors in China and the Middle East — both regions that were in Mr. Kushner’s government portfolio — to bail out the firm’s headquarters at 666 Fifth Avenue in Manhattan. But the presidency has also come with some costs for the Trump family business since the sons have been at the helm. The company had been banking on global expansion to drive its growth, but when the president agreed to put a hold on new foreign deals, it curtailed those ambitions for his sons. George Sorial, the company’s chief compliance counsel when the policy was developed, said it was the right thing to do even though it was not required by law and had cost the company significantly. Eric Trump, in his statement to The Times, suggested that even the decision to forgo new foreign deals could be seen through the prism of Hunter Biden. “My father was one of the most famous businessmen on earth and he sacrificed billions to be our president,” he said. “Joe Biden was an incredibly influential politician — his family made millions.” The Biden campaign also sees opportunity in the nasty dispute. In a fund-raising email sent on Friday, the campaign singled out the Trump sons and the “lock him up” chant at the Thursday rally. “We are fighting back against this nonsense as hard as we know how every single day,” the campaign wrote.", 
      "date": "Oct. 11, 2019, 7:33 p.m. ET"
    }
  ]
}