{
  "articles": [
    {
      "title": "",
      "url": "",
      "subtitle": "",
      "author": "",
      "content": "   ",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "'Passive aggression. It's a lifestyle': Ocasio-Cortez responds to a GOP congressional critic",
      "url": "https://www.usatoday.com/story/news/politics/2019/07/30/alexandria-ocasio-cortez-responds-rep-jody-hices-comments-migrant-detention/1872484001/",
      "subtitle": "The hearing held by House Democrats targeted the administration's immigration policies and the rapidly deteriorating conditions in detention centers.\n    USA TODAY",
      "author": "Nicholas Wu",
      "content": " WASHINGTON – Rep. Alexandria Ocasio-Cortezresponded Tuesday to criticism from a Republican congressman by saying he lied about her and asking for civility in their shared workplace of the House of Representatives. Ocasio-Cortez chided Rep. Jody Hice, R-Ga., writing on Twitter that Hice was \"lying about this.\" \"We’re going to see each other at work & you’re going to pretend to be nice to me. Passive aggression. It’s a lifestyle,\" she continued, adding the thumbs-up emoji at the end of the tweet. Hice had accused her of having \"deliberately misled the American people\" about the treatment of migrants in detention. Ocasio-Cortez had previously said migrants in Border Patrol custody were held in substandard conditions and \"forced to drink out of toilets.\" Hice disagreed. In the first of two videos posted on Twitter on Monday, Hice drank out of one of the combined drinking fountains and toilets at the center of controversy. \"There's drinkable water within this toilet system, AOC is giving fallacious information, here's the truth,\" Hice said, after drinking from it. In another video, Hice visited a warehouse he called a \"miniature Walmart,\" full of basic necessities like socks, toothbrushes, and clothing for detained migrants. The disagreement stemmed from comments Ocasio-Cortez had made after a visit to a Border Patrol facility at the beginning of July. On July 1, after touring the facility, Ocasio-Cortez tweeted to say Border Patrol officers were telling detained migrant women  \"to drink out of the toilets,\" sparking a social media firestorm. More: Illinois GOP group apologizes for offensive 'Jihad Squad' post about AOC, Omar, Tlaib and Pressley More: AOC to DHS chief: Border agents shared 'Photoshopped images of my violent rape' in secret Facebook group More: Chilling first-hand reports of migrant detention centers highlight smell of 'urine, feces,' overcrowded conditions Twitter users noted that Ocasio-Cortez was likely referring to a kind of combined drinking fountain, sink, and toilet. A day later, Ocasio-Cortez tweeted a picture of the toilet to explain that the sink portion of the toilet wasn't working on the day when she and other members of Congress toured the Border Patrol facility. More: Lawmaker describes 'unacceptable' border detention conditions, meets with US citizen in Border Patrol custody The federal government's treatment of detained migrants at the U.S.-Mexico border has drawn increased scrutiny after a Department of Homeland Security inspector general report called conditions in detention facilities in the Rio Grande Valley a \"ticking time bomb.\" Ocasio-Cortez's group was one of several congressional delegations to visit border detention facilities in an effort to draw attention to poor conditions for detained migrants.",
      "date": "Published 7:40 p.m. ET July 30, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "'She should be shot': Ohio man charged after Facebook threat against Ocasio-Cortez",
      "url": "https://www.usatoday.com/story/news/politics/2019/08/10/toledo-ohio-man-charged-after-post-facebook-ocasio-cortez/1975362001/",
      "subtitle": "An Ohio fugitive has been charged with making threats after allegedly writing on Facebook that Rep. Alexandria Ocasio-Cortez quote “should be shot.”\n    Buzz60",
      "author": "Nicholas Wu",
      "content": " WASHINGTON – Federal prosecutors announced on Friday that a 41-year-old Toledo, Ohio, man has been charged after making threats against Rep. Alexandria Ocasio-Cortez, D-N.Y., and illegal possession of ammunition. Ireland was charged with \"one count of being a felon in possession of a firearm, one count of being a fugitive in possession of a firearm and one count of making interstate threats,\" according to the Department of Justice. According to the criminal complaint, at the end of July, the U.S. Capitol Police received a report from a person who'd perceived a Facebook post from Timothy J. Ireland, Jr. as potentially threatening against Ocasio-Cortez. More: AOC says she gets death threats after organizations air 'hateful messages' about her More: AOC calls out McConnell after photo shows 'Team Mitch' supporters 'groping and choking' cardboard cutout “She should be shot. Can’t fire me, my employer would load the gun for me,” Ireland had written on Facebook, along with a link to a story about Ocasio-Cortez. On August 2, the Capitol Police called Ireland at a number found in public records and asked him if he made the post and if he owned firearms. The Capitol Police said Ireland told them he was \"very proud of that post he made,\" and admitted to owning firearms. Six days later, Capitol Police and the Bureau of Alcohol, Tobacco, Firearms and Explosives agents searched Ireland's house after obtaining a search warrant. They detained him at the scene and found seven rounds of ammunition inside his kitchen drawers – three rounds of .32 caliber ammunition and four rounds of .45 caliber ammunition. Ireland told agents he did not have a gun in his house but brought ammunition with him when he moved into the house. An FBI criminal background check of Ireland found he had two outstanding warrants for failure to appear charges in Florida and Georgia, which stemmed from a marijuana possession charge. The criminal complaint noted Ireland had also been convicted in 1996 of four felony counts of dealing in stolen property in Sarasota County, Fla. “There is absolutely no place in the marketplace of ideas for threats of violence against any person, especially those who are elected to represent the American people,” U.S. Attorney Justin Herdman said in a press release. “Disagreement on political issues cannot lead to acts of violence, and if it does, we will seek federal prison time.” More: Louisiana police officer's Facebook post says Alexandria Ocasio-Cortez 'needs a round,' report says Ocasio-Cortez has been outspokenabout the number of threats that she receives as a high-profile member of Congress. \"I‘ve had mornings where I wake up & the 1st thing I do w/ my coffee is review photos of the men (it’s always men) who want to kill me,\" she wrote on Twitter at the end of May.",
      "date": "Published 11:50 a.m. ET Aug. 10, 2019 | Updated 4:45 p.m. ET Aug. 10, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "AOC makes student loan payment during congressional hearing on student loans",
      "url": "https://www.usatoday.com/story/news/politics/2019/09/10/aoc-makes-student-loan-payment-during-congressional-hearing-loans/2276327001/",
      "subtitle": "Representative Ocasio-Cortez told her peers that she had made a student loan payment while attending a hearing on student debt.\n    USA TODAY",
      "author": "Nicholas Wu",
      "content": " WASHINGTON – Rep. Alexandria Ocasio-Cortez used her bank account to make a point during a House Financial Services Committee hearing on student debt. Ocasio-Cortez opened her remarks by telling the witnesses and audience that she had made a student loan payment while attending the hearing. \"I literally made a student loan payment while I was sitting here at this chair, and I looked at my balance, and it was $20,237.16,\" she said. \"I just made a payment that took me down to $19,000 so I feel really accomplished right now.\" Student loan hearing: Hasan Minhaj calls student debt 'paywall to the middle class' during congressional testimony More AOC: Alexandria Ocasio-Cortez says tweets by her ex-chief of staff were 'divisive' She called for action on the nation's student debt. “I’m hearing people on this committee say it’s not our job,\" Ocasio-Cortez said, referring to congressional Republicans' testimony during the hearing. \"This is our job.” The committee had been discussing ways to address the nation's estimated $1.5 trillion in student debt and featured testimony from consumer advocates and experts. Comedian Hasan Minhaj, whose Netflix show \"Patriot Act\" had run an episode about student debt, talked about how student debt had become a \"paywall to the middle class.\" Ocasio-Cortez is one of many members of Congress with student debt burdens. Roll Call reported in March 2019 that 68 members of Congress had their own student loans or loans for a dependent, with an average debt burden of $37,000. Eight members had more than $100,000 in student debt.",
      "date": "Published 2:35 p.m. ET Sept. 10, 2019 | Updated 9:23 a.m. ET Sept. 11, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez's chief of staff, spokesman leave her congressional office",
      "url": "https://www.usatoday.com/story/news/politics/2019/08/02/alexandria-ocasio-cortezs-chief-staff-spokesman-leave-her-office/1906807001/",
      "subtitle": "Democratic socialist Alexandria Ocasio-Cortez is the newest political figure everyone loves or loves to hate. From her ‘Green New Deal’ proposal to combat climate change to her clapbacks against Trump and her critics, here’s how AOC danced her way into the spotlight.\n    USA TODAY",
      "author": "Rebecca Morin",
      "content": " WASHINGTON — Rep. Alexandria Ocasio-Cortez's chief of staff, Saikat Chakrabarti, who has been criticized by some Democratic lawmakers, will be leaving the New York Democrat's congressional office to join an organization working on the Green New Deal, according to severalreports. Corbin Trent, Ocasio-Cortez's communications director, will also be leaving the congressional office to join the congresswoman's 2020 reelection campaign. The Intercept first reported both staff moves. Trent, in a statement to The Intercept, said that Chakrabarti will work with a group called New Consensus, a nonprofit focused on climate issues and promoting the Green New Deal. Tulsi Gabbard:  Bashar al-Assad is 'a brutal dictator, just like Saddam Hussein' Russia investigation: The final bill for former special counsel Robert Mueller's Russia inquiry: $31. 7 million “We are extraordinarily grateful for his service to advance a bold agenda and improve the lives of the people in NY-14,\" Trent said in the statement. \"From his co-founding of Justice Democrats to his work on the Ocasio-Cortez campaign and in the official office, Saikat’s goal has always been to do whatever he can to help the larger progressive movement, and we look forward to continuing working with him to do just that.\" Chakrabarti, who co-founded Justice Democrats -- a political organization that helped Ocasio-Cortez get elected -- was criticized last month by Democratic Rep. William Lacy Clay of Missouri. The comments came amid intra-party bickering between House Speaker Nancy Pelosi and Reps. Ayanna Pressley of Massachusetts, Ilhan Omar of Minnesota, Rashida Tlaib of Michigan and Ocasio-Cortez. More: Donald Trump’s picks for administration jobs keep dropping out with John Ratcliffe latest to go 'Self-inflicted wound': Trump signs budget bill as experts warn he's on track to add trillions to U.S. debt Clay called out Chakrabarti in July for a tweet where he compared moderate Democrats to \"new Southern Democrats\" that \"certainly seem hell bent to do to black and brown people today what the old Southern Democrats did in the 40s.\" The tweet has since been deleted. In a separate tweet, Chakrabarti said centrist Democrats \"still enable a racist system.\" “It shows you how ignorant and little history [Chakrabarti] knows, how ignorant he is to American history. How dare he,” Clay said at the time. The intra-party differences seemed cool once President Donald Trump began to target Ocasio-Cortez, Pressley, Omar and Tlaib -- colloquially known as the \"Squad\" -- with repeated racist attacks that were condemned by Pelosi, other Democrats, some Republicans and by a resolution passed in the House of Representatives. In an apparent effort to further defuse tensions, Pelosi and Ocasio-Cortez recently met one-on-one. And news of the departures of Trent and Chakrabarti broke a week later. Pelosi: 'We don't have that many differences' Like what you’re reading?: Download the USA TODAY app for more",
      "date": "Published 9:49 p.m. ET Aug. 2, 2019 | Updated 12:40 a.m. ET Aug. 3, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Republicans air ad about the dangers of 'socialism' and AOC during the Democratic debate",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/09/12/republicans-slam-aoc-and-socialism-ad-during-democratic-debate/2307163001/",
      "subtitle": "Health care was the dominant issue, and front runner Joe Biden was the main target for the other nine candidates on the stage.\n    USA TODAY",
      "author": "Nicholas Wu",
      "content": " A Republican-affiliated PAC ran an ad during the Democratic presidential debate calling out \"socialism\" and asking if voters wanted progressive Democrats like Rep. Alexandria Ocasio-Cortez, D-N.Y., to be the future of America. The video is narrated by Elizabeth Heng, a former Republican congressional candidate in California, and was run by a PAC that aims to recruit more diverse Republican political candidates. \"This is the face of socialism,\" Heng says, as a picture of Ocasio-Cortez burns and cuts away to scenes of the Cambodian genocide. \"That's socialism,\" she says of the authoritarian Khmer Rouge regime in Cambodia. \"Mine is a face of freedom, my skin is not white, I'm not outrageous, racist, nor socialist. I'm a Republican,\" she concludes. Republicans have accused Democrats of being socialists as the 2020 elections heat up. President Donald Trump has said voting for Democrats would be a vote for the \"rise of radical socialism.\" The freshman congresswoman responded shortly after, calling the ad a \"love letter to the GOP’s white supremacist case.\" \"Republicans are running TV ads setting pictures of me on fire to convince people they aren’t racist,\" she wrote on Twitter. \"Life is weird!\"",
      "date": "Published 10:03 p.m. ET Sept. 12, 2019 | Updated 3:07 p.m. ET Sept. 13, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez says tweets by her ex-chief of staff were 'divisive'",
      "url": "https://www.usatoday.com/story/news/politics/2019/08/08/alexandria-ocasio-cortez-ex-chief-staff-tweets-were-divisive/1957146001/",
      "subtitle": "House Speaker Nancy Pelosi expressed \"some level of confidence, and actually joy\" at the diversity of the House Democratic caucus and its ability to unify around issues.\n    USA TODAY",
      "author": "Rebecca Morin",
      "content": " WASHINGTON – Rep. Alexandria Ocasio-Cortez, D-N.Y., criticized her controversial ex-chief of staff's tweets about moderate Democrats, saying they were \"divisive.\" Ocasio-Cortez, however, maintained that she parted on good terms with Saikat Chakrabarti, during an exclusive interview with the New York Daily News posted Thursday. “I think it was divisive,” she told the Daily News. “I believe in criticizing stances, but I don’t believe in specifically targeting members.\" Chakrabarti resigned last week to join a group called New Consensus, a nonprofit focused on climate issues and promoting the Green New Deal. Corbin Trent, Ocasio-Cortez's communications director, also announced he was transitioning out of the congressional office to join the congresswoman's 2020 reelection campaign. Chakrabarti, who co-founded Justice Democrats — a political organization that helped Ocasio-Cortez get elected, was criticized last month by Missouri Democratic Rep. William Lacy Clay. More: Trump 'thinking very seriously' about commuting prison sentence for Rod Blagojevich The comments came amid intra-party bickering between House Speaker Nancy Pelosi and Reps. Ayanna Pressley of Massachusetts, Ilhan Omar of Minnesota, Rashida Tlaib of Michigan and Ocasio-Cortez. Clay called out Chakrabarti in July for a tweet where he criticized moderate Democrats who voted in favor of an emergency border funding bill, which Ocasio-Cortez, Omar, Tlaib and Pressley voted against. Chakrabarti compared centrist Democrats, known as the Blue Dogs, to \"new Southern Democrats\" that \"certainly seem hell bent to do to black and brown people today what the old Southern Democrats did in the 40s.\" The tweet has since been deleted. In a separate tweet, Chakrabarti said centrist Democrats \"still enable a racist system.\" “It shows you how ignorant and little history [Chakrabarti] knows, how ignorant he is to American history. How dare he,” Clay said at the time. Ocasio-Cortez told the Daily News that the tweet was deleted following an “internal conversation\" in her office after the tweet. More: Tucker Carlson's fellow Fox News host Shepard Smith says 'white nationalism is real' “We’ve corrected it,” she said. “He immediately took the tweet down.” In addition, Ocasio-Cortez said that the two \"had been discussing this transition before that whole incident happened.\" However, the announcement of the departure of Chakrabarti and Trent broke a week after Pelosi and Ocasio-Cortez met one-on-one in apparent effort to defuse tensions within the party. Prior to that meeting, the intra-party bickering seemed to cool after President Donald Trump began to target Ocasio-Cortez, Pressley, Omar and Tlaib — colloquially known as the \"Squad\" — with repeated racist attacks. Pelosi, many other Democrats and even some Republican condemned Trump's attacks on the four congresswomen. The House of Representatives also passed a resolution to formally condemn Trump's tweets calling on the four congresswomen to \"go back\" to their countries as racist. Like what you’re reading?: Download the USA TODAY app for more",
      "date": "Published 3:22 p.m. ET Aug. 8, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "AOC says bigger scandal than Trump's 'lawbreaking behavior' is Dems' refusal to impeach",
      "url": "https://www.usatoday.com/story/news/politics/2019/09/22/aoc-says-bigger-scandal-than-ukraine-dems-refusal-impeach-trump/2410671001/",
      "subtitle": "Biden's son Hunter had business interests in Ukraine, said Trump is using his power to get a foreign government to find dirt on a political rival.\n    Wochit, Wochit",
      "author": "Nicholas Wu",
      "content": " WASHINGTON – Rep. Alexandria Ocasio-Cortez, D-N.Y., added further fuel to the impeachment fire in a Saturday evening tweet where she said the even bigger scandal than the controversy over Biden, Ukraine, and the Trump-Congress whistleblower fight was House Democrats' refusal to impeach Trump. \"At this point, the bigger national scandal isn't the president's lawbreaking behavior - it is the Democratic Party's refusal to impeach him for it,\" she wrote. Although House Speaker Nancy Pelosi still opposes impeachment, it appears that the controversy is starting to shift the calculus for some Democrats. Rep. Adam Schiff, D-Calif., the chair of the House Intelligence Committee, said in a Sunday morning television interview, \"we very well may have crossed the Rubicon here.” \"If the president is essentially withholding military aid at the same time he is trying to browbeat a foreign leader into doing something illicit...then [impeachment] might be the only remedy that is co-equal to the evil that this conduct represents,\" he said on CNN's \"State of the Union.\" The growing controversy surrounds an August whistleblower complaint by a U.S. intelligence community official and ongoing efforts by Democrats to learn more about Trump's contacts with Ukraine. Democrats have demanded access to the whistleblower complaint. Warren on the rise: As the 2020 Democrat gains in the polls, criticism from her rivals is growing Trump acknowledged he had discussed an investigation into Biden with the Ukrainian president while speaking with reporters en route to a trip to Texas and Ohio on Sunday morning. Trump said: \"The conversation I had was largely congratulatory, with largely corruption – all of the corruption taking place – and largely the fact that we don't want our people like Vice President Biden and his son creating to the corruption already in the Ukraine.\" He described the call as \"absolutely perfect.\" More: What's going on with Biden and Ukraine? And how does it involve the Trump-Congress whistleblower fight? More: Trump said he had 'absolutely perfect' call with Ukraine president about political rival Biden On Fox News on Sunday morning, congressional Republicans called for investigations of their own and denounced the drive for impeachment as a goal of \"socialists.\" Sen. Lindsey Graham, R-S.C., said on Fox News' \"Sunday Morning Futures\" that he wanted the Department of Justice to \"appoint an investigator to look at all things Ukraine\" and what he said the Ukrainian government had done to help Democrats in the 2016 election. And later in the show, Rep. Devin Nunes, R-Calif., who is the top Republican on the House Intelligence Committee, accused Ocasio-Cortez of promoting a \"socialist\" agenda of \"one-party control\" of government. \"The more I think that they’re out there promoting this kind of craziness and silliness, the more that the American people are put off, and the more likely President Trump is re-elected,” Nunes added. Contributing: Bart Jansen, Michael Collins, David Jackson",
      "date": "Published 11:46 a.m. ET Sept. 22, 2019 | Updated 1:34 p.m. ET Sept. 22, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Save up to $1,800",
      "url": "https://www.usatoday.com/story/news/politics/2019/10/10/aoc-slams-story-criticizing-her-price-her-hairstyle/3928926002/",
      "subtitle": "The Washington Times published an article and quoted \"sources familiar\" with AOC's hair salon and estimated she spends $300 on her hair.\n    USA TODAY",
      "author": "Nicholas Wu",
      "content": " WASHINGTON – Rep. Alexandria Ocasio-Cortez, D-N.Y. shot back after a story in the conservative Washington Times criticized her for a \"high-dollar hairdo.\" \"40 million Americans live in poverty under today’s extreme inequality, yet the right-wing want you to blame Democratic socialism for their own moral failures. Our policies, like Medicare for All, advance prosperity for working people,\" wrote Ocasio-Cortez. \"They're just mad we look good doing it,\" she added, with the hair-flip emoji. She later tweeted another response to the story with criticism of Vice President Mike Pence's stay at a Trump Organization-owned resort in Ireland. \"Won’t you look at that: Mike Pence used *taxpayer funds* - not personal ones - to spend several thousand haircuts’ worth of public money on a visit to Trump golf courses. I wonder if Republicans care about corruption as much as they care about a woman’s cut & color,\" she wrote. On Wednesday, the Washington Times had published a story quoting \"sources familiar\" with Ocasio-Cortez's hair salon in Washington, D.C. The article estimated Ocasio-Cortez spent $300 on her haircut, lowlights, and the tip. “AOC is the Eva Peron of American politics. She preaches socialism while living the life of the privileged,” said Richard Manning, president of Americans for Limited Government, to the Washington Times. Manning was making a reference to Argentinian political leader Eva Perón, who served as the First Lady of Argentina from 1946 to 1952. More: Fringe group claims it planned 'eat the babies' stunt at AOC town hall More: Two Rudy Giuliani associates who once dined with Trump and Trump Jr. arrested Ocasio-Cortez had quoted a tweet from Jacobin, a leftist magazine, about the article. \"Sad to see democratic socialists like Bernie and @AOC do things like buy winter coats and get haircuts. Don’t they know that real socialists avoid purchasing goods and services?\" the magazine's Twitter account said sarcastically. Other critics of the article observed the relative pricing of women's haircuts. \"I regret to inform the Washington Times that women's haircuts are, indeed, unconscionably expensive,\" said Lawfare Managing Editor Quinta Jurecic. \"$80 for a women's haircut and $180 for lowlights (likely quarterly) is cheap in a major city tbh, much less if you're on TV every day,\" observed left-leaning magazine Mother Jones editor-in-chief Clara Jeffrey.",
      "date": "Published 11:11 a.m. ET Oct. 10, 2019 | Updated 8:01 p.m. ET Oct. 10, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "AOC tells Donald Trump it's better to be a 'wack job' than a 'criminal who betrays our country' in Twitter spat",
      "url": "https://www.usatoday.com/story/news/politics/2019/10/03/aoc-donald-trump-better-wack-job-than-criminal-twitter/3861231002/",
      "subtitle": "Rep. Alexandria Ocasio-Cortez said it's better to be a \"wack job\" than a \"criminal who betrays our country\" in Twitter spat with President Trump.\n    USA TODAY",
      "author": "Savannah Behrmann",
      "content": " WASHINGTON – President Donald Trump and Rep. Alexandria Ocasio-Cortez exchanged words on Twitter on Thursday night after the president sent out a storm of tweets lashing out at AOC, House Speaker Nancy Pelosi, House Intelligence Chairman Adam Schiff, “Do Nothing Democrats” and the media. “AOC is Wack Job!” Trump tweeted. She responded: \"Better than being a criminal who betrays our country.” That was only one of Trump's tweets. “As the President of the United States, I have an absolute right, perhaps even a duty, to investigate, or have investigated, CORRUPTION, and that would include asking, or suggesting, other Countries to help us out!” Trump said on the same day he declared that China should investigate former Vice President Joe Biden. With the tweet, Trump again emphasized that he doesn't see wrongdoing in asking foreign governments to dig up dirt on his political opponents, though the head of the Federal Election Commission reminded candidates earlier Thursday that asking for help from foreign governments is illegal in an apparent subtweet of Trump. Trump's tweet caught the attention of one Democratic representative, California's Katie Hill, who responded on Twitter: \"Dude, no. No. Nope. No. Just no.\" Later, Trump threatened to “sue” Pelosi for saying “that Adam Schiffty Schiff didn’t fabricate my words in a major speech before Congress” while further describing that it is \"always tough to beat the “Press,” but people are beginning to see how totally CORRUPT they are, and it makes our job a whole lot easier!\" The president tweeted eight times within one hour. California senator and 2020 Democratic presidential hopeful Kamala Harris has called for Trump's Twitter account to be suspended.",
      "date": "Published 11:43 p.m. ET Oct. 3, 2019 | Updated 11:23 a.m. ET Oct. 4, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Fringe group claims it planned 'eat the babies' stunt at AOC town hall",
      "url": "https://www.usatoday.com/story/news/politics/2019/10/04/fringe-group-planned-eat-babies-stunt-aoc-town-hall/3869116002/",
      "subtitle": "Rep. Alexandria Ocasio-Cortez said it's better to be a \"wack job\" than a \"criminal who betrays our country\" in Twitter spat with President Trump.\n    USA TODAY",
      "author": "Savannah Behrmann",
      "content": " WASHINGTON — A fringe political group claimed responsibility for a strange stunt at a town hall speech by Rep. Alexandria Ocasio-Cortez, who was interrupted repeatedly by a woman who boisterously claimed people need to save the planet by \"eating babies.\" The woman, who had taken off her jacket to reveal a T-shirt that read “Save the planet. Eat the children,” was acting on behalf of the political group LaRouchePAC, the group tweeted Thursday night.. Video shows the woman continuing to raise her voice as Ocasio-Cortez shows little reaction. The woman goes on, saying, “Even if we would bomb Russia, we still have too many people, too much pollution, so we have to get rid of the babies. Just stopping having babies is not enough; we need to eat the babies.” The freshman New York Congresswoman attempted to regain control of the room by largely ignoring the outburst, saying, “One of the things that’s very important to us is that we need to treat the climate crisis with the urgency that it does present. Luckily, we have more than a few months.” The woman tried to interrupt again and was escorted from the room. A Twitter account belonging to the LaRouchePAC, a group that has supported President Donald Trump, claimed responsibility. The group was created by Lyndon LaRouche Jr., until he died in February at the age of 96. He was a cult-like figure, who espoused a wide range of conspiracy theories and advocated for an overhaul of the world’s economic and financial systems. He ran for president in every election from 1976 to 2004, including a campaign waged from federal prison. The outburst at the town hall spurred a flurry of conservatives, including the president, using the comments against Ocasio-Cortez, . “AOC is Wack Job!” Trump tweeted, re-tweeting his son commenting on the ordeal. She responded: \"Better than being a criminal who betrays our country.” In response to the woman's outburst, originally Ocasio-Cortez reprimanded critics for attempting to “mock or make a spectacle” of the woman who “may have been suffering from a mental condition… Be a decent human being and knock it off.” #EatTheBabies and #EatTheChildren were trending on twitter by Friday morning. Ocasio-Cortez then responded Friday that although the woman was a \"Trump supporter,\" it “doesn’t rule out potential mental issue (Drs do that) but good to know they were not in crisis.” LaRouche followers do not believe in climate change and often refer to global warming as “population reduction, not science.” His conspiracy theories included a claim that the International Monetary Fund was “engaged in mass murder” by spreading AIDS through its economic policies, that former Secretary of State Henry Kissinger and former Vice President Walter Mondale were Soviet “agents of influence” and that the Queen of England was involved in the drug trade. He said former Philippines President Ferdinand Marcos “was opposed to me and he fell as a result.” Contributing: The Associated Press",
      "date": "Published 9:37 p.m. ET Oct. 4, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "AOC on DC statehood: 'Disenfranchisement' of DC rooted in the 'history of slavery'",
      "url": "https://www.usatoday.com/story/news/politics/2019/09/19/ocasio-cortez-disenfranchisement-d-c-rooted-legacy-slavery/2375336001/",
      "subtitle": "Representative Ocasio-Cortez told her peers that she had made a student loan payment while attending a hearing on student debt.\n    USA TODAY",
      "author": "Nicholas Wu",
      "content": " WASHINGTON – Rep. Alexandria Ocasio-Cortez, D-N.Y. weighed in on D.C. statehood during a Thursday hearing on the issue and discussed the \"disenfranchisement\" of the District's people as rooted in the \"history of slavery.\" She opened her statement by talking about her family's roots in Puerto Rico, a U.S. territory, and how her family had lacked the right to vote in federal elections. \"I wish that upon no citizen of the United States of America,\" she said. \"Where the disenfranchisement of Puerto Ricans was rooted in the colonialist and imperialistic history that we've had in policies of the United States, the issue of D.C. statehood is rooted in a different evil in our history, which is the history of slavery in the United States,” she added. Ocasio-Cortez cited the disenfranchisement of the majority-minority city as \"upholding the injustice of the practices enacted during slavery.\" \"It is a profound injustice and a thick irony of our history that the people who fled here to the District of Columbia to free slavery because of the enlightenment of this community are now disenfranchised,\" she said, observing that the District was the first part of the Union to emancipate slaves. The hearing before the House Committee on Oversight and Reform was to debate a D.C. statehood bill, aptly named \"H.R. 51,\" in the first House of Representatives hearing on statehood since 1993. How does statehood work?: Will DC become the 51st state? Advocates to make their case in Congress with boost from Elizabeth Warren Other debate in the hearing surrounded practical matters like the governance of buildings like the Trump International Hotel, which is in a building still owned by the federal government, but would be included within the boundaries of the new state. Rep. Thomas Massie, R-Ky., asked about its fate. D.C. Mayor Muriel Bowser told him that all hotels would be included in the new state. The question drew derision from Rep. Jamie Raskin, D-Md., who joked that the hotel was the \"Washington Monument.\" \"It's amazing to me that the political rights of 700,000 people might be conditioned on the business interests of one man,\" said Rep. Jamie Raskin, D-Md.",
      "date": "Published 2:58 p.m. ET Sept. 19, 2019 | Updated 10:50 a.m. ET Sept. 20, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "AOC to endorse Bernie Sanders in 2020 Democratic presidential primary",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/10/15/democratic-primary-aoc-endorse-bernie-sanders-president/3994047002/",
      "subtitle": "Democratic socialist Alexandria Ocasio-Cortez is the newest political figure everyone loves or loves to hate. From her ‘Green New Deal’ proposal to combat climate change to her clapbacks against Trump and her critics, here’s how AOC danced her way into the spotlight.\n    USA TODAY",
      "author": "Nicholas Wu",
      "content": " Rep. Alexandria Ocasio-Cortez, D-N.Y., plans to endorse Sen. Bernie Sanders, I-Vt., and appear with him at an event this weekend, The USA TODAY Network has learned. A person with knowledge of the plans confirmed the endorsement. The Washington Post had first reported the planned endorsement. Nina Turner, a former state senator and current Sanders campaign national co-chair, said to The USA TODAY Network that Ocasio-Cortez was returning the favor for the groundwork Sanders' campaign had laid in 2016. \"So the foundation that he laid in 2016 allowed for candidates to stand up and be bold and run their race,\" Turner said. \"This is coming full circle. One person doesn't make or break a campaign, but the level of excitement, it's going to take it to the next level for us.\" Later in the evening, Rep. Ilhan Omar, another member of the group of progressive House freshmen colloquially known as \"the Squad\" announced her endorsement of Sanders. Omar cited Sanders' leadership of a \"working class movement to defeat Donald Trump,\" and his leadership on other major progressive issues – \"And it’s why I believe Bernie Sanders is the best candidate to take on Donald Trump in 2020,\" she said in a release. Sanders had promoted the rally, which will take place in Queens, New York, during the debate, along with the promise of a \"special guest.\" Ocasio-Cortez's district includes part of Queens, though the rally would take place right outside her district. The two also interacted on Twitter during the debate. \"Tax the rich,\" she tweeted, during a debate over income inequality. The Sanders campaign then quoted her tweet with the comment, \"When we are in the White House, that is exactly what we will do.\" The New York congresswoman and liberal firebrand was an organizer for Sanders' 2016 presidential campaign when the senator's insurgent campaign in the Democratic primary caught fire against establishment pick Hillary Clinton. The endorsement by the outspoken progressive could help the Sanders campaign, which has recently lagged in polls amid the rise of Sen. Elizabeth Warren, D-Mass., and questions about Sanders' health after he had a heart attack. Contributing: Ledyard King, USA TODAY; Jessie Balmert, Cincinnati Enquirer",
      "date": "Published 11:11 p.m. ET Oct. 15, 2019 | Updated 11:52 a.m. ET Oct. 16, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "'@JulianCastro coming with the straight up truth': AOC livetweets the Democratic debate",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/10/15/aoc-livetweets-democratic-presidential-debate/3993646002/",
      "subtitle": "Democratic socialist Alexandria Ocasio-Cortez is the newest political figure everyone loves or loves to hate. From her ‘Green New Deal’ proposal to combat climate change to her clapbacks against Trump and her critics, here’s how AOC danced her way into the spotlight.\n    USA TODAY",
      "author": "Nicholas Wu",
      "content": " Although Rep. Alexandria Ocasio-Cortez, D-N.Y. was not at the Democratic debate, her presence loomed large as an outspoken, progressive member of the Democratic caucus. As candidates sparred over issues like Medicare for All and income inequality, Ocasio-Cortez delivered her own commentary on Twitter. The New York Democrat has not yet endorsed a presidential candidate. As Sen. Bernie Sanders, I-Vt., defended Medicare for All, Ocasio-Cortez tweeted a video fo the exchange, saying, \"Thank you! There are too many plans out there that seem more interested in protecting corporate profits than protecting the lives of working Americans. We need #MedicareForAll, and we need it now.\" More: A 'purity test'? Democratic candidates clash over guns in feisty debate She shared another update about Sen. Cory Booker's comments on abortion rights, in which the New Jersey Democrat argued men needed to be allies to women as fellow human beings. She quoted another line from former HUD Secretary Julian Castro, who had quipped that President Donald Trump was \"caging kids at the border while letting ISIS go free.\" \"@JulianCastro coming with the straight up truth,\" she wrote. \"Tax the rich,\" she tweeted, during a debate over income inequality. The Sanders campaign then quoted her tweet with the comment, \"When we are in the White House, that is exactly what we will do.\" That tweet prompted some speculation about the Sanders' campaign strategy, especially as the Sanders campaign promoted a coming rally in Queens, New York, with a \"special guest.\" \"Subtweet: Endorse me plssssss,\" wrote Newsday reporter Emily Ngo. Others guessed the \"special guest\" would be Ocasio-Cortez.",
      "date": "Published 10:55 p.m. ET Oct. 15, 2019 | Updated 11:53 a.m. ET Oct. 16, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "'The halls of Congress are no joke': AOC reflects on Congress as she endorses Sanders",
      "url": "https://www.usatoday.com/story/news/politics/2019/10/19/aoc-bernie-sanders-endorsement/4038312002/",
      "subtitle": "Trump and impeachment: Can President Trump block witnesses and subpoenas, and what can Congress do about it? Lawyer and author David Stewart explains.\n    Hannah Gaber, USA TODAY",
      "author": "Nicholas Wu",
      "content": " On Saturday afternoon, Rep. Alexandria Ocasio-Cortez, D-N.Y., made her endorsement of Sen. Bernie Sanders, I-Vt., official at a rally in Queens, N.Y., that marked Sanders' return to the campaign trail after recently having a heart attack. \"I'm in the United States Congress now,\" said Ocasio-Cortez as she gave a 20-minute speech introducing Sanders, \"a long, long way from being a sexually harassed waitress in downtown Manhattan one year ago.\" \"The halls of Congress are no joke,\" she continued. \"It is no joke. Standing up to corporate power, and established interests is no joke. It's not just about standing up and saying these things, but behind closed doors, your arm is twisted, the vise pressure of political pressure gets put on you, every trick in the book, psychological, and otherwise is to get us to abandon the working class,\" she said before a massive crowd. More: AOC to endorse Bernie Sanders in 2020 Democratic presidential primary More: Alexandria Ocasio-Cortez told Bernie Sanders about her endorsement while he was still in the hospital More: 'I'm feeling great': Bernie Sanders reassured voters of his health following heart attack Ocasio-Cortez said that the pressure she'd felt in Congress led her to \"appreciate the enormous, consistent, and non-stop advocacy\" of Sanders. The 30-year-old New York Democrat has served as a lightning rod in Congress and a frequent target of criticism on the right as one of the most outspoken House Democrats. She has attracted much more attention than a freshman member of Congress might otherwise receive, becoming an outspoken voice on high-profile issues like student debt, D.C. statehood, and climate change. Sanders said during his speech that he planned to campaign with Ocasio-Cortez, ensuring that Ocasio-Cortez will continue to have a high-profile role in the presidential campaign. President Donald Trump has frequently criticized her, and retweeted a post from the Republican Party Twitter this afternoon that criticized Ocasio-Cortez and Rep. Ilhan Omar, D-Minn., as \"far-left Democrats\" who wanted to \"spend taxpayer dollars & have the government take control over every aspect of American life.\" Ocasio-Cortez seems aware of the criticism and often responds sharply. Last week, she was the subject of a story in the conservative Washington Times that had criticized her for the cost of her hairstyle. \"They’re just mad we look good doing it,\" she had said on Twitter of her conservative critics, adding the hair flip emoji. More: 'They’re just mad we look good doing it': AOC responds to story about the price of her hairstyle She addressed the issue in her speech today as well. \"You all like my haircut. It got a lot of attention last week,\" she joked at the beginning of her speech.",
      "date": "Published 5:12 p.m. ET Oct. 19, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez told Bernie Sanders about her endorsement while he was still in the hospital",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/10/16/aoc-ilhan-omar-told-bernie-sanders-endorsements-after-heart-attack/4003249002/",
      "subtitle": "Aamer Madhani discusses how Bernie Sanders' health scare brings questions about age to the forefront, not just for Bernie.\n    USA TODAY",
      "author": "Jeanine Santucci",
      "content": " News that Rep. Alexandria Ocasio-Cortez, a progressive icon, would be endorsing Sen. Bernie Sanders for president came as he took the stage alongside his 2020 rivals and showed he was still in the game after a health scare. But Sanders got the news from the New York representative herself as he was still recovering in the hospital from a heart attack earlier this month, according to a new report. Sanders' campaign manager, Faiz Shakir, told Politico he answered the phone that day and passed it over to Sanders, who was in his hospital bed. \"Think about the courage of this person who says, ‘You know, I know what you just went through but I have so much trust and confidence in you that you are the one who will fight the fight that I believe in. I'm with you,' \" Shakir said. Minnesota's Ilhan Omar, another freshman Democrat in Congress who announced her support of Sanders Tuesday night, also told the senator about her decision after his heart attack, according to Politico. Sanders said during Tuesday's debate that a \"special guest\" would be joining him at a rally this weekend, and it was later confirmed the guest would be Ocasio-Cortez and that she would make her endorsement then. In response to a question about his heart attack and recovery at the debate, the 78-year-old said, \"I’m healthy, I’m feeling great.\" Sanders had canceled several campaign events after his surgery. He released a video in which he said being in a Las Vegas hospital “made me feel even more strongly the need for us to continue our efforts to end this dysfunctional and cruel health care system.” 'I'm feeling great': Bernie Sanders reassured voters of his health following heart attack He also said in an NBC interview, \"We're going to get back into the groove of a very vigorous campaign, I love doing rallies and I love doing town meetings.” Sanders is currently trailing former Vice President Joe Biden, 76, and Massachusetts Sen. Elizabeth Warren, 70, according to a rolling average of national polls by RealClearPolitics. The three frontrunners are the oldest Democrats in the race. President Donald Trump is 73 years old. Candidates' ages: 4 decades separate 2020's presidential candidates. Here's what that looks like. Contributing: Nicholas Wu, Courtney Subramanian, Rebecca Morin",
      "date": "Published 7:10 p.m. ET Oct. 16, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Bernie Sanders is big Democratic debate winner, and only partly due to his performance",
      "url": "https://www.usatoday.com/story/opinion/2019/10/16/alexandria-ocasio-cortez-bernie-sanders-democratic-debate-column/3990254002/",
      "subtitle": "Debate winners and losers, Warren on the defensive, and what we're watching for before the next Democratic debate.\n    Hannah Gaber, USA TODAY",
      "author": "",
      "content": "All 12 leading Democratic candidates for president got a chance to demonstrate why they were able to meet the requirements to pack on the stage for the fourth debate Tuesday. Sen. Elizabeth Warren of Massachusetts stayed feisty and focused in her new role as front-runner. Former Vice President Joe Biden was optimistic and self-congratulatory as he tried to win the John McCain name-dropping contest. Rep. Tulsi Gabbard of Hawaii confounded everyone by spreading the blame for the slaughter of the Kurds in northern Syria that Donald Trump invited to members of “both parties.” And Andrew Yang got to say lots of things as if no one had ever thought of them before. But the winner of the night was older than the two youngest candidates on stage — Gabbard, 38, and South Bend, Indiana, Mayor Pete Buttigieg, 37 — combined. Vermont Sen. Bernie Sanders, 78, returned to the campaign trail after recovering from a heart attack to deliver his strongest debate performance of the campaign. He was lively, funny and persuasive. At one point, he even seemed to convince billionaire Tom Steyer that billionaires shouldn’t exist. Sanders also took on Biden’s constant praise of bipartisanship and his pointed boast, “I'm the only one on this stage that has gotten anything really big done.” “Joe, you talked about working with Republicans and getting things done,” Sanders said. “But you know what you also got done — and I say this as a good friend — you got the disastrous war in Iraq done. You got a bankruptcy bill, which is hurting middle-class families all over this country. You got trade agreements like NAFTA and PNTR (permanent normal trade relations) with China done, which have cost us 4 million jobs. Now, let's get to 'Medicare for All.' ... If we stood together, we could create the greatest health care system in the world.” A conservative's take: Winners and losers in the Democratic debate from columnist Glenn Harlan Reynolds But Bernie’s biggest moment of the night didn’t happen onstage. In the closing minutes of the debate, news broke that one of the brightest young stars on America’s left, Rep. Alexandria Ocasio-Cortez of New York, will endorse the 2016 Democratic primary runner-up this weekend. This gives the democratic socialist from Vermont the chance to break the momentum of Warren’s steady rise in the polls, though he notably hasn’t taken a shot at the senator from Massachusetts on the debate stage yet. Instead, he sided with her several times as she was cornered, echoing her arguments for systemic change. The format of the debate flowed much better than the previous three. It’s unclear whether this was because the moderators allowed the candidates more air to answer and rebut each other, or because self-help guru Marianne Williamson wasn’t on the stage. Whatever it is, they should do more of it. While there are still miles to go before anyone actually votes for a nominee, the race for the chance to oppose Trump will likely remain a tossup among Sanders, Warren and Biden. This is mostly because the rest of the candidates have done a better job of canceling each other out than breaking through. While the debates have led to some blips in the polls — most notably for Sen. Kamala Harris of California after the second debate — the crowded stage format has the effect of blurring candidates together, especially since every debate seems to rehash the same Medicare for All contentions over and over until even Sanders seems a little bored by the fray. Another huge winner of the night was impeachment, which is now polling 50%. Every candidate on stage backs the inquiry in the House, and no candidate showed any willingness to echo the attacks on Hunter Biden that Trump pressured Ukrainian President Volodymyr Zelensky into trumping up. Unfortunately, the biggest loser of the night was human civilization. While there was a question about Ellen DeGeneres’ defense of her kindness to former president and torture purveyor George W. Bush, there wasn’t one question about climate change. Future generations will have to be satisfied knowing that we were much too busy worrying about rich people getting along in luxury boxes to stop the planet from boiling. Jason Sattler, a writer based in Ann Arbor, Michigan, is a member of USA TODAY’s Board of Contributors and host of \"The GOTMFV Show\" podcast. Follow him on Twitter: @LOLGOP",
      "date": "Published 7:10 a.m. ET Oct. 16, 2019 | Updated 4:36 p.m. ET Oct. 16, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    }
  ]
}