{
  "articles": [
    {
      "title": "",
      "url": "",
      "subtitle": "",
      "author": "",
      "content": "   ",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Joe Biden defends son Hunter against Trump's attacks, says he will be part of 2020 campaign",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/10/03/joe-biden-2020-campaign-trail-defends-son-against-donald-trump-remarks/3851700002/",
      "subtitle": "Former Vice President Joe Biden defended his son against attacks by President Trump and said his family has been through much worse\n    Reno Gazette Journal",
      "author": "Siobhan McAndrew",
      "content": " Former Vice President Joe Biden defended his son Hunter, who he said will be part of Biden's campaign for president. \"I knew it was going to be this way,\" Biden said in an interview with the Reno Gazette Journal on Wednesday night after a campaign stop in Reno. Biden said he knew his family would come under attack, but after a sit-down with his five grandchildren three weeks before announcing he was entering the race, he made the decision. \"They came to me and said, 'Pop, you got to run.'\" When Biden said it would get really mean, his grandchildren responded, \"We know how he is,\" they said about President Donald Trump, \"but, Pop you got to do it.\" Hunter Biden has come under scrutiny after Trump asked the Ukrainian president to Biden. Trump claims that Biden tried to remove a Ukrainian prosecutor investigating a company where Hunter Biden served on the board. But sources ranging from former Obama administration officials to an anti-corruption advocate in Ukraine say the official, Viktor Shokin, was ousted for the opposite reason Trump and his allies claim. Impeachment pressure: Trump says China should investigate Joe Biden, family On Wednesday, Trump called Biden and his son \"stone cold crooked.\" But Biden fiercely defended his family during the Reno campaign rally. “Let me make something clear to Trump and his hatchet men and the special interests funding his attacks against me. I’m not going anywhere,” Biden said. \"I think it's the beginning not the end,” Biden said about what he anticipates will be more attacks against his family. \"I'm also confident the American people know me, and they know my son.\" Biden said his son will be a visible part of the campaign. Ukraine explained: Biden, allies pushed out Ukrainian prosecutor because he didn't pursue corruption cases \"He's a fine man. He's been through hell.\" Biden's wife and infant daughter were killed in a car accident in 1972, just weeks after he won his first Senate race.  In 2015, his oldest son Beau Biden, 46, died from a deadly form of brain cancer. Biden said Trump’s attacks are tough but won’t stop him from winning come November. \"Look, we are a family. We have been through a lot worse,\" Biden said. \"We know what real pain is.\" Impeachment poll: By 45%-38%, Americans support impeaching him over Ukraine allegations, poll finds Biden talked about the tragedy of losing his son to cancer. When asked about Reno mom Kristin Sumbot, who he met at a hospital in 2016, Biden remembered her. \"I should call her,\" Biden said about Sumbot’ s mother. He then called her twice including during the end of an interview with the RGJ and then later from his car back to the airport. Read more: Reno woman battles cancer, relishes time with her son Biden helped Sumbot get into a clinical trial at MD Anderson Cancer, a top research hospital in Texas. \"She was so brave,\" Biden said of Sumbot. “Like my son, she let me know she wasn't afraid but that she had a lot to live for.” Sumbot, who recovered from childhood leukemia when she was a student at Galena High School, was diagnosed with the fatal brain cancer nine years later and just days after giving birth to her son, August. Sumbot died in 2017 after being diagnosed with the same deadly form of  brain cancer that killed Beau Biden, but her family credited the clinical trial for giving her an extra six months. “If I'm elected president it is going to be one of the overwhelming priorities,” Biden said of cancer research and how investments can chance cancer survival rates.  \"It is one of the missions of my life.” Siobhan McAndrew tells stories about the people of Northern Nevada and covers education in Washoe County.",
      "date": "Published 11:41 a.m. ET Oct. 3, 2019 | Updated 12:20 p.m. ET Oct. 3, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Hunter Biden: Who is former Vice President Joe Biden's son mentioned in Ukraine-Trump call?",
      "url": "https://www.usatoday.com/story/news/politics/2019/09/26/who-hunter-biden-joe-biden-son-ukraine-call/3773527002/",
      "subtitle": "Joe Biden's full remarks at the Hotel Du Pont in Wilmington, amid calls for the impeachment of Donald Trump on Tuesday, Sept. 24.\n    Delaware News Journal",
      "author": "Meredith Newman,",
      "content": "   WILMINGTON, Del. – He's been featured in countless newspaper articles, and even got his own New Yorker profile. Some might enjoy that kind of exposure, but it's been a major headache for Hunter Biden – and for his father Joe's presidential campaign. It's nothing new. The former vice president's middle child has long faced public scrutiny, much of it while his father was still in office. Hunter Biden is the younger son of Joe Biden and Neilia Hunter, who married in 1966. They had three children – Beau, Hunter and Naomi – before Neilia and Naomi were killed in a car crash in 1972. Joe went on to marry Jill in 1977, and the couple had their daughter, Ashley, in 1981. Hunter, like his dad and brother, went to Archmere Academy. He graduated from Georgetown University and Yale Law School. Hunter Biden has three children, Naomi, Finnegan and Maisey, with his ex-wife Kathleen Buhle. In 2016, Hunter Biden began dating Hallie Biden, the widow of his brother, Beau. His parents supported the couple. In 2017, they said, \"We are all lucky that Hunter and Hallie found each other as they were putting their lives together again after such sadness. They have (our) full and complete support and we are happy for them.” When asked to comment on his family life for a January 2019 article in Vanity Fair, Hunter Biden wrote: \"Even though my life has been played out in the media, because I am a Biden, my father never once suggested that the family's public profile should be my priority. The priority has always been clear for my dad, as it is, now, for me: Never run from a struggle. Love people and find a way to love yourself.\" In May, Hunter Biden met Melissa Cohen, a 32-year-old South African filmmaker. Less than a week later, he proposed. The Biden family was not at the wedding. Hunter told The New Yorker of his father's support for the marriage. Read the full declassified text of the Trump whistleblower complaint Complaint released: Whistleblower says Trump used 'the power of his office' to solicit foreign help to discredit Joe Biden, complaint says “I called my dad and said that we just got married. He was on speaker, and he said to her, 'Thank you for giving my son the courage to love again.' “And he said to me, 'Honey, I knew that when you found love again that I'd get you back ... And my reply was, I said, 'Dad, I always had love. And the only thing that allowed me to see it was the fact that you never gave up on me, you always believed in me.' \" In 2013, Hunter Biden was selected to be a direct commission officer in the U.S. Naval Reserve, but was discharged months later after he tested positive for cocaine. That wasn't the first time drugs and alcohol took a toll on his life. In the New Yorker profile, Hunter Biden opened up about his struggle with alcohol and drugs. “Look, everybody faces pain,” he said in the story. “Everybody has trauma. There's addiction in every family. I was in that darkness. I was in that tunnel – it's a never-ending tunnel. You don't get rid of it. You figure out how to deal with it.” Although Joe Biden, who had relatives with alcohol problems, has never had a drink, Hunter Biden started drinking alcohol as a teenager. The story describes how he occasionally used cocaine while a student at Georgetown, even once buying crack. In the early 2000s, he tried to get sober, including rehab in 2003. He relapsed in 2010, after seven years of sobriety, when he had drinks during a business trip. Hunter Biden then told his brother, Beau, and he returned to rehab. But after suffering from shingles, for which he was prescribed painkillers, he started drinking again. Baseless accusations? Trump's efforts to discredit Joe Biden backfired on him. Will they hurt the former VP anyway? July 25 call: 'I would like you to do us a favor.' What Trump and Zelensky said in their phone call After Beau died in 2015, Hunter Biden began doing yoga, but also continued to drink heavily. \"Several times a day, his father called him, and Hunter assured him that he was OK. Eventually, Biden showed up unannounced at the apartment,\" The New Yorker reported. \"Hunter said that his father told him, 'I need you. What do we have to do?' \" In the fall of 2016, Hunter Biden arranged to go to rehab in Sedona, Arizona. During an unexpected layover in Los Angeles, he bought crack several times that week, The New Yorker reported. After days of not sleeping, on Oct. 28, Hunter was driving on Interstate 10 near Palm Springs and eventually lost control of the car. He eventually dropped off the rental car and called the rehab center to pick him up. Shortly after the article was published last summer, Joe and Jill Biden commented on it during an interview on CNN. \"Beau was my soul, Hunter is my heart,\" Joe Biden said. \"Hunter has been through some tough times, but he's fighting.\" Hunter Biden is a lawyer and founder of the venture capital firm Eudora Global, which specializes in health care, online gambling and renewable energy. But that's not why he's been in the spotlight recently. In 2014, Hunter Biden joined the board of Burisma Holdings, a Ukrainian natural gas company. During his tenure, Ukrainian prosecutor Viktor Shokin investigated the company. Joe Biden: I never talked to son Hunter about overseas business dealings Put focus on Trump: Biden campaign to media: Focus on 'dishonest' Trump, not Hunter Biden The New York Times reported in May that Joe Biden, while in office in 2016, threatened to withhold $1 billion in U.S. loan guarantees unless Ukraine reduced its corruption. Part of that demand called for removing the country's top prosecutor, Shokin, who was investigating the oligarch behind an energy company where Hunter Biden served on the board. Shokin was accused by U.S. officials of ignoring corruption in his own office. The Ukrainian Parliament eventually voted him out. But Yuriy Lutsenko, a former Ukraine prosecutor, told Bloomberg News Service in May that he had no evidence of wrongdoing by Joe Biden or Hunter Biden. “Hunter Biden did not violate any Ukrainian laws – at least as of now, we do not see any wrongdoing,” Lutsenko told Bloomberg. “A company can pay however much it wants to its board.” Trump admission: He delayed aid for Ukraine but says he didn't do it to force a Biden investigation Hunter Biden told the Times in May that he had \"no role whatsoever\" in the Ukrainian investigation of the company or any of its officers. The Washington Post has reported there is \"no evidence\" Joe Biden was trying to help his son. As President Donald Trump criticized the Bidens, the former vice president swung back, appearing in Wilmington on Tuesday to state that he supports the impeachment of Trump if the White House does not comply with Congress' requests for details about a call he made to Ukraine's president in which they discussed the former vice president. On Wednesday, the president released notes about the call. Trump campaign officials also fought back prior to Joe Biden's speech, sending out a list of questions that they said Biden should answer. It included \"an explanation for why he believes it was appropriate for Hunter (Biden) to make millions of dollars in Ukraine at the same time Joe Biden was leading diplomatic relations with Ukraine.\" Contributing: Bart Jansen, USA TODAY. Follow Meredith Newman and Andrew Sharp on Twitter: @MereNewman and @buckeye_201",
      "date": "Published 11:18 a.m. ET Sept. 26, 2019 | Updated 2:29 p.m. ET Sept. 26, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Hunter Biden speaks out amid Ukraine controversy, admits 'mistake,' denies he did anything 'improper'",
      "url": "https://www.usatoday.com/story/news/politics/2019/10/15/hunter-biden-speaks-out-amid-ukraine-controversy-admits-mistake/3983320002/",
      "subtitle": "President Donald Trump slammed Democrats, including former Vice President Joe Biden, at his campaign rally in Minnesota.\n    USA TODAY",
      "author": "William Cummings",
      "content": " Hunter Biden repeatedly admitted he made a \"mistake\" in not calculating the political ramifications of joining the board of a Ukrainian natural gas company while his father had official business in the country as vice president but denied doing anything \"improper,\" in an ABC News interview that aired Tuesday. Biden, speaking with reporter Amy Robach at his Los Angeles home, described his dealings with the company, Burisma, as \"poor judgment\" on his part that \"gave a hook to some very unethical people to act in illegal ways to try to do some harm to my father,\" former Vice President Joe Biden. But he said he did not do anything \"improper\" in \"any way whatsoever.\" \"I joined a board. I served honorably. I focused on corporate governance,\" he said. Ukrainian officials have previously said they found no evidence of wrongdoing on the Bidens part. President Donald Trump's effort, led by his personal attorney Rudy Giuliani, to pressure Ukraine into investigating potential corruption tied to Burisma and the Bidens' role with the company has sparked an impeachment inquiry alleging the president was using the power of his office to go after a political rival. Ukraine: Trump's conspiracy theories thrive as young democracy battles corruption and distrust At a rally last week in Minneapolis last week, Trump tore into the former vice president and implied his son had gone into hiding. \"Whatever happened to Hunter? Where the hell is he?\" Trump asked the crowd. Hunter Biden said he was \"hiding in plain sight.\" \"I don't regret being on the board, what I regret is not taking into account that there would be a Rudy Giuliani and a president of the United States that would be listening to this ridiculous conspiracy idea,\" Hunter Biden told ABC News. Ukraine: Ukraine to review investigation of company tied to Hunter Biden \"You know what, I'm a human, did I make a mistake? Maybe in the grand scheme of things, yeah. But did I make a mistake based upon some ethical lapse? Absolutely not,\" he said. \"It's crazy,\" Biden said of the political hay that has been made of his role with Burisma. as well as his business dealings in China. \"They feel like they have the license to go out and say whatever they want. It feels to me like living in some kind of 'Alice in Wonderland.'\" Biden said he felt he was qualified to sit on Burisma's board but acknowledged that he would \"probably not\" have been offered the seat were it not for the fact that his father was vice president. Hunter Biden: Hunter Biden will resign from board of Chinese firm, says he won't serve on foreign boards if Joe Biden elected president \"I don't think that there's a lot of things that would have happened in my life if my last name wasn't Biden,\" he said. He said that he never discussed Burisma with his father except for one \"brief exchange\" when the elder Biden said, \"I hope you know what you're doing,\" after seeing news reports that his son had joined the company's board. \"I made a mistake in retrospect as it related to creating any perception that it was wrong,\" Biden said of his decision. He vowed not to have any business dealings with foreign companies if his father becomes president. Hunter Biden: Who is former Vice President Joe Biden's son mentioned in Ukraine-Trump call? Joe Biden: 'No one in my family will have an office in the White House' or be 'a cabinet member' More: Trump told U.S. envoy that Ukraine was full of 'terrible people' who 'tried to take me down'",
      "date": "Published 10:26 a.m. ET Oct. 15, 2019 | Updated 12:36 p.m. ET Oct. 15, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Ukraine to review investigation of company tied to Hunter Biden",
      "url": "https://www.usatoday.com/story/news/world/2019/10/04/ukraine-official-review-probe-tied-joe-bidens-son-hunter/3862796002/",
      "subtitle": "Whistleblowers have been at time essential and detrimental to a country's democracy, but what makes them different than a leaker? We explain.\n    Just the FAQs, USA TODAY",
      "author": "Kim Hjelmgaard",
      "content": " KIEV, Ukraine — Ukraine’s top legal official said Friday that his office would review a probe into the owner of a natural-gas company linked to former Vice President Joe Biden’s son. Ruslan Ryaboshapka, Ukraine’s general prosecutor, said during a press conference that the review is part of a wider audit of at least 15 high-profile past investigations that were closed or dismissed by his predecessors. The announcement Friday comes as an impeachment inquiry over President Donald Trump's dealings with Ukraine consumes Washington. But Ryaboshapka said the decision to review the cases was not specifically related to the time Hunter Biden spent on the board of Burisma, Ukraine’s largest private natural-gas firm, or allegations from the Trump administration that Joe Biden improperly applied pressure on Ukraine to have an investigation into Burisma halted. The allegations from Trump and his lawyer Rudolph Giuliani have played a key role in the impeachment inquiry into Trump by Democratic lawmakers. Ukraine:Text messages show U.S. diplomats believed U.S. aid was linked to Trump's demand for Biden probe Ukraine’s previous general prosecutor, Yuriy Lutsenko, closed a money-laundering and tax-irregularity probe into Burisma’s owner, Mykola Zlochevsky, in 2016. The case did not focus on Hunter Biden. There is also no evidence that Joe Biden acted improperly in applying pressure on Ukraine to dismiss Lutsenko’s predecessor, Viktor Shokin. Shokin was widely and publicly viewed by international organizations such as the European Union and International Monetary Fund, and anti-corruption investigators in Ukraine, as an impediment to reforming the country’s culture of graft. Ryaboshapka said the audit has been planned since he took office one month ago. Friday’s press conference was his first public one since taking up the role. Impeachment testimony: Intelligence watchdog to testify about 'credible' whistleblower complaint before key House committee Vitali Kasko, Ryaboshapha’s deputy, told USA TODAY after the news conference that an affidavit by Shokin highlighted in recent days by Giuliani’s office that claims he was fired in 2016 because he was leading a “wide-ranging corruption investigation” into Burisma had no merit. “Shokin is not a reliable figure,” he said. Shokin was not available for comment.",
      "date": "Published 8:36 a.m. ET Oct. 4, 2019 | Updated 11:18 a.m. ET Oct. 4, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Biden says Trump's decision to withdraw from Syria is ‘most shameful thing’",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/10/15/democratic-debate-biden-syria-decision-shameful-thing/3993057002/",
      "subtitle": "null",
      "author": "John Fritze and",
      "content": "  Joe Biden came out swinging during the Democratic debate on Donald Trump’s decision to withdraw U.S. troops from Syria but declined to answer a direct question: Would he, as president, place special forces troops back in the region? Biden called Trump’s decision the “most shameful thing any president has done in modern history in terms of foreign policy,” as he excoriated the president for clearing the way for Turkey to attack U.S. allied Kurds in Syria. More: The Democratic candidates are making big promises for their first day in office. What can they get done? Biden said he believed the U.S. should be involved in air support, but declined to say whether he would order troops back. The issue is a complicated one for Democrats, many of whom have criticized Trump’s move in Syria but who have also called for the U.S. to withdraw from entanglements in the Middle East. Trump has defended the move by saying he wants to extract American soldiers from overseas commitment.",
      "date": "Published 9:40 p.m. ET Oct. 15, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Joe Biden answers Donald Trump during campaign event in Nevada: 'I'm not going anywhere'",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/10/02/joe-biden-donald-trump-im-not-going-anywhere/3848497002/",
      "subtitle": "Joe Biden sent a message to President Trump during a campaign event in Nevada. The Democratic presidential hopeful said he's \"not going anywhere.\"\n    USA TODAY",
      "author": "Savannah Behrmann",
      "content": " WASHINGTON — Former Vice President and Democratic presidential hopeful Joe Biden had one message for President Donald Trump on Wednesday night: He’s “not going anywhere.” Speaking in Nevada, Biden had choice words regarding Trump's rhetoric and remarks surrounding an impeachment inquiry related to a phone call with Ukraine's president where Trump asked him to dig up dirt on Biden and his son Hunter for past business in the country. At the time of the phone call, the White House was holding up a military aid package Congress had approved for Ukraine. During a press conference earlier in the day, Trump slammed the Bidens as “stone cold crooked,” and vented on Twitter, saying that Democrats are \"wasting everyone’s time and energy.\" 'Did you hear me?': Furious Donald Trump blasts media over Ukraine, impeachment inquiry “Let me make something clear to Trump and his hatchet men and the special interests funding his attacks against me – I’m not going anywhere,” Biden said in Reno. “You’re not going to destroy me. And you’re not going to destroy my family. I don’t care how much money you spend or how dirty the attacks get. \"I’m not backing down. And I’m not going to be distracted by the lies, smears, distortions and name calling. I’m going to let Congress do its job on impeachment. And I’m going to stay focused on your lives.\" Trump declined to answer a specific question during Wednesday's press conference about whether he would honor subpoenas over the Ukraine call that Democrats promised by week's end. He also did not answer a question about what he wanted Ukraine President Volodymyr Zelensky to do about Biden. Trump continued his defense Wednesday night, accusing Democrats of trying to steal the election, and posted a video about Joe and Hunter Biden, featuring the song \"Photograph\" by Nickelback and a 2014 picture of the duo with Devon Archer, who also served on the board of the Ukrainian natural gas company Burisma Holdings. Biden continued to call Trump \"desperate and defensive,\" pointing out the president's comments about the whistleblower being executed, wanting to prosecute the chairman of the House Intelligence Committee for treason, and warning of a civil war. \"The world can’t wait for America to once again lead a stable, peaceful international order,\" Biden concluded Wednesday.",
      "date": "Published 9:34 p.m. ET Oct. 2, 2019 | Updated 10:31 a.m. ET Oct. 3, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Hunter Biden will resign from board of Chinese firm, says he won't serve on foreign boards if Joe Biden elected president",
      "url": "https://www.usatoday.com/story/news/politics/2019/10/13/hunter-biden-resign-board-chinese-firm-bhr/3968481002/",
      "subtitle": "Trump and impeachment: Can President Trump block witnesses and subpoenas, and what can Congress do about it? Lawyer and author David Stewart explains.\n    Hannah Gaber, USA TODAY",
      "author": "Nicholas Wu",
      "content": " In a statement released through his attorney Sunday morning, Hunter Biden, the son of Democratic presidential candidate and former Vice President Joe Biden, said he would resign from the board of a Chinese company and pledged not to serve on boards of foreign companies if Joe Biden were elected president. Hunter Biden had received criticism from President Donald Trump and Republicans for his work on foreign boards as House Democrats escalated an impeachment inquiry into Trump for pressuring the Ukrainian government into opening an investigation into Hunter Biden. Trump has also said China should investigate Hunter Biden, though the Chinese government has said publicly that it would not. USA TODAY has spoken to two dozen leaders and investigators in Ukraine who say  Trump's accusations against Hunter Biden's work in Ukraine are baseless. George Mesires, Hunter Biden's attorney, wrote in a statement posted on Medium that Hunter Biden had decided to resign his seat on the board of the Chinese investment firm BHR. Mesires said Biden had not received any compensation for being on the board, nor did he receive any equity in it while Joe Biden was vice president. \"To date, Hunter has not received any compensation for being on BHR’s board of directors,\" Mesires wrote. \"He has not received any return on his investment; there have been no distributions to BHR shareholders since Hunter obtained his equity interest. Moreover, Hunter played no role in directing or making BHR’s investments.\" Mesires said Hunter Biden was going to resign from the BHR board by Oct. 31. More: Trump's conspiracy theories thrive in Ukraine, where a young democracy battles corruption and distrust According to Mesires, \"Hunter undertook these business activities independently,\" never discussed them with Joe Biden, and \"When Hunter engaged in his business pursuits, he believed that he was acting appropriately and in good faith.\" Hunter Biden \"never anticipated the barrage of false charges\" from Trump, Mesires wrote. If Joe Biden were elected president in 2020, Hunter Biden pledged \"not to serve on boards of, or work on behalf of, foreign owned companies\" and comply with all ethics and guidelines related to conflicts of interest, Mesires concluded. Joe Biden has defended his son on the campaign trail and has said Hunter Biden would serve a visible role on his 2020 campaign. \"He's a fine man. He's been through hell,\" Joe Biden said of his son in an Oct. 3 interview with the Reno Gazette-Journal, part of the USA TODAY Network.",
      "date": "Published 10:42 a.m. ET Oct. 13, 2019 | Updated 1:42 p.m. ET Oct. 13, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "'Whatever happened to Hunter?' Donald Trump steps up attacks on Joe Biden and his son at Minneapolis rally",
      "url": "https://www.usatoday.com/story/news/politics/2019/10/10/donald-trump-slams-joe-biden-new-speech-during-minneapolis-rally/3934242002/",
      "subtitle": "President Donald Trump says he's planning to get involved in the case of an American diplomat's wife who left the U.K. after becoming a suspect in a fatal wrong-way crash. (Oct. 9)\n    AP, AP",
      "author": "John Fritze,",
      "content": "   MINNEAPOLIS – Breaking out a new stump speech amid the ongoing impeachment inquiry into his interactions with Ukraine, President Donald Trump on Thursday delivered an extended attack on rival Joe Biden while largely ignoring the rest of the Democratic field. Frequently raising unsubstantiated claims, Trump mostly bypassed his standard lines touting the economy and his get-tough stance on immigration in favor of offering supporters a series of broadsides against the former vice president, hometown Rep. Ilhan Omar and congressional Democrats probing his White House. Trump's retooled remarks in a state he lost narrowly to Hillary Clinton in 2016 came as he is facing a widening impeachment inquiry into whether he pressured Ukraine President Volodymyr Zelensky to dig up dirt on Biden by withholding foreign aid. Trump, who has denied doing so, has sought to shift attention to Biden and his son, Hunter. \"He was never considered a good senator,\" Trump said of Biden. \"He was only a good vice president because he understood how to kiss Barack Obama’s ass.\" The former vice president, who spoke Thursday at an LGBTQ town hall sponsored by the Human Rights Campaign and CNN, later responded on Twitter, saying \"I spent my night at the HRC forum talking about the fundamental respect every human being deserves. You spent yours showing how little respect for anyone else you have.\" Explainer: Biden, allies pushed out Ukrainian prosecutor because he didn't pursue corruption cases More: A visual timeline of the text messages in the Trump-Ukraine affair The Trump campaign has tried for days to focus voters' attention on Hunter Biden, who had business dealings in Ukraine and China. Trump, without offering evidence, said that Hunter Biden was hired by companies in other countries because of his last name, and his father's position as vice president, rather than his business acumen. \"Whatever happened to Hunter? Where the hell is he?\" Trump said, as current Vice President Mike Pence and Karen Pence watched from just off stage. The line was clearly a point officials close to Trump wanted to emphasize. Midway through his remarks, Trump's campaign began selling t-shirts emblazoned with the words \"Where's Hunter?\" Trump's attacks on Biden came during an unusually long address – running over an hour and a half – in which he also blasted the city's mayor for forbidding police officers to wear uniforms to his rally and touted efforts to reduce the number of refugees resettled in U.S. cities. Before Trump took the stage, the crowd chanted \"lock him up,\" reprising a taunt his supporters often used against Clinton in 2016 but aiming it at Biden. Joe Biden, who called for Trump's impeachment earlier in the week, accused the president of \"shooting holes in the Constitution.\" \"Donald Trump has violated his oath of office, betrayed this nation and committed impeachable acts,\" Biden said Wednesday. \"His lying is matched only by his manifest incompetence as president.\" Andrew Bates, rapid response director for Biden's campaign, tweeted that Trump's \"presidency’s spiraling after he was caught trying to force a foreign country to lie about the candidate who terrifies him, and apparently this is all he’s got left.\" Biden’s lead in national polling has slipped amid the back-and-forth with Trump as Massachusetts Sen. Elizabeth Warren has steadily increased her support. The president also renewed his attacks on Omar, D-Minn., who represents much of Minneapolis. At one point, the president described Omar as a \"American-hating socialist.” Trump has previously claimed that Biden strong-armed the Ukrainian government to fire its top prosecutor in order to thwart an investigation into a company tied to Hunter Biden. But an anti-corruption advocate in Ukraine and others have countered that the official was ousted because he wasn't pursuing corruption aggressively enough. Contributing: Jeanine Santucci",
      "date": "Published 10:34 p.m. ET Oct. 10, 2019 | Updated 2:58 p.m. ET Oct. 11, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "China rejects Trump's request to investigate Joe Biden, hoping to steer clear of U.S. politics",
      "url": "https://www.usatoday.com/story/news/politics/2019/10/08/donald-trump-china-declines-presidents-request-probe-joe-biden/3908397002/",
      "subtitle": "President Donald Trump is acknowledging Democrats in the House \"have the votes\" to begin a formal impeachment inquiry, but he says he's confident it will backfire politically and they won't have the votes to convict in the GOP-controlled Senate. (Oct. 4)\n    AP, AP",
      "author": "John Fritze and",
      "content": "  WASHINGTON – China has reportedly rejected President Donald Trump's request to investigate Democratic presidential candidate Joe Biden, with officials saying the country doesn't want to get involved in U.S. domestic politics. “We have no intention of intervening in the domestic affairs of the United States. Our position is consistent and clear,\" China foreign ministry spokesman Geng Shuang said in a report in the South China Morning Post, the main English-language newspaper in Hong Kong. Already under investigation for asking Ukraine to dig up dirt on Biden, Trump on Thursday said on the South Lawn of the White House that China should also investigate his political foe. \"By the way, likewise, China should start an investigation into the Bidens because what happened in China is just about as bad as what happened with Ukraine,\" Trump told reporters. Democrats and some Republicans denounced Trump for invoking China. Impeachment pressure: Trump says China should investigate Joe Biden, family Trump and Beijing have been locked in a months-long trade war with both countries imposing an ever escalating series of tariffs. A delegation of Chinese negotiators is expected to arrive in Washington later this week.",
      "date": "Published 12:36 p.m. ET Oct. 8, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Elizabeth Warren leading Joe Biden in recent Democratic presidential primary polls",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/10/09/elizabeth-warren-leads-joe-biden-national-polls/3916886002/",
      "subtitle": "Elizabeth Warren is vying for the Democratic Party nomination for 2020.  Here are five things you should know about the senator from Massachusetts.\n    USA TODAY",
      "author": "William Cummings",
      "content": " WASHINGTON – Massachusetts Sen. Elizabeth Warren has taken over the top spot in several recent national presidential primary polls as candidates prepare to debate Oct. 15. Most national polls since the end of September have found Warren – not former Vice President Joe Biden – leading the pack, but by relatively narrow margins. Biden had led in almost every national poll, usually by double digits, going back to 2018. But Warren has come out on top in four of the past five and six of the past 10. And she recently pulled ahead in the RealClearPolitics average, a frequently cited polling benchmark. Though she is in front of Biden only by 0.2%, it marks the first time Biden has not held the lead in the race's RCP average since the site began comparing the polls in December. The most recent poll to place her at the top was released Tuesday by Quinnipiac University. That poll found her ahead of Biden 29%-26%. Sen. Bernie Sanders of Vermont came in third at 16%. Among those who described themselves as \"very liberal,\" Warren led Biden 38%-26%, and among the \"somewhat\" liberals she led 37%-23%. Biden led among moderate and conservative Democrats 35%-22%. Democratic primary: Elizabeth Warren is on the rise and so is the criticism from her Democratic rivals \"Warren maintains her strength in the Democratic primary, which has been consistently growing since the start of her campaign. This poll confirms her status as a co-frontrunner with Biden,\" said Quinnipiac University Polling Analyst Tim Malloy. The poll found that Warren held narrow leads with both men and women and that she had a 12-percentage-point lead with white voters. Biden was favored by black voters 36%-20% and by voters over 65 by a 41%-26% margin. The survey was conducted  Oct. 4-7 from among 1,483 self-identified registered voters with a margin of error of plus or minus 3.1%. Warren also has performed well in the early primary states that can be key to securing the nomination. Last month, a Des Moines Register/CNN/Mediacom Iowa Poll found her leading in the first-in-the-nation caucus state, and a Monmouth University poll put her narrowly ahead of Biden in New Hampshire. A  Suffolk University/USA TODAY Network Poll released on Sept. 24 placed her just 4 points behind Biden in Nevada, the third state where primary voters will cast their ballots. Elizabeth Warren: Elizabeth Warren leads Iowa Poll for the first time, besting Joe Biden and Bernie Sanders Biden maintains a comfortable 41%-12% lead over Warren in South Carolina, the fourth state on the primary calendar, according to a recent Fox News poll. The former vice president's drop in the polls comes as President Donald Trump and his personal attorney Rudy Giuliani have mounted a public campaign accusing Biden of impropriety in Ukraine during his time in office. Trump's effort to pressure Ukraine to dig deeper into the matter has sparked an impeachment inquiry. Warren’s latest hurdle to the presidency: Democrats' belief women face tougher fight against Trump Tuesday's poll from Quinnipiac shows that voters approve of the impeachment inquiry 53%-43% and that 45% think Trump should be removed from office while 49% do not. The margin had been 37%-57% in a Quinnipiac poll before the inquiry launched. Only 34% said they approved of the way Trump has responded to the impeachment inquiry, compared with 57% who disapproved. But 43% agreed with the president that it was a \"political witch hunt,\" while 51% said it was a \"legitimate investigation.\" Though Trump has said his effort to push Ukraine to investigate Biden was motivated by a desire to battle corruption rather than taint a political opponent, only 33% of voters bought that explanation, and 48% said he was out to hurt a rival. Twenty percent weren't yet certain or thought both reasons were true. Polls have consistently found that Democratic voters care more about picking a candidate in 2020 who can defeat Trump than any particular policy issue. When asked whom they would vote for if the election was held today, Quinnipiac found that both Warren and Biden would beat the incumbent president – Biden by a margin of 51%-40% and Warren by a margin of 49%-41%. Trump indirectly acknowledged Warren's rise in the polls in a tweet Tuesday in which he called on his 2016 Democratic opponent Hillary Clinton to \"enter the race to try and steal it away from Uber Left Elizabeth Warren.\" Speaking to House Republicans in Baltimore last month, Trump said Warren had \"emerged from the ashes. And now it looks like she can beat Sleepy Joe (Biden).\" \"He has no idea what’s going on,\" Trump said. Opinion: 5 reasons why Elizabeth Warren has the best chance to beat Donald Trump Policy: Here's how Elizabeth Warren would change Social Security Elizabeth Warren: Elizabeth Warren campaign staffer fired for unspecified 'inappropriate behavior'",
      "date": "Published 10:23 a.m. ET Oct. 9, 2019 | Updated 2:40 p.m. ET Oct. 9, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Joe Biden, for the first time, calls for Trump's impeachment",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/10/09/joe-biden-calls-trumps-impeachment-first-time/3920985002/",
      "subtitle": "Impeaching a U.S. president might not be the be-all-end-all for their career. We explain why this is the case.\n    Just the FAQs, USA TODAY",
      "author": "Nicholas Wu",
      "content": " Former Vice President Joe Biden, for the first time, called for President Donald Trump's impeachment. Speaking in Manchester, N.H., Biden said, \"Donald Trump has violated his oath of office, betrayed the nation, and committed impeachable acts.\" \"To preserve our Constitution, our democracy, our basic integrity, he should be impeached,\" Biden added. \"The United States cannot afford to have a president who will abuse whatever power available to them to get re-elected,\" Biden said, slamming Trump's request to the Ukrainian government to open an investigation into Biden and his son Hunter Biden. Trump asked the Ukrainian government in a July 25 phone call with Ukrainian President Volodymyr Zelensky to investigate Biden and probe allegations about Ukraine's role in the 2016 U.S. presidential election. Democrats have cited evidence showing that the U.S. government withheld military aid from Ukraine as part of the effort to pressure Ukraine into opening the investigation. Trump has accused Biden's son of \"corruption\" relating to his board seat on a Ukrainian gas company, though Ukrainian prosecutors have said Hunter Biden did not do violate any laws. And on Oct. 3, Trump urged China to investigate Biden, though the Chinese government has publicly declined to do so. In his speech today, Biden said there was \"no truth in [Trump's] charges against me and my son. Zero.\" Previously, Biden had hedged his comments about Trump despite the launching of an impeachment inquiry into Trump. \"If the president does not comply with such a request of the Congress, if he continues to obstruct Congress, and flaunt the law,\" Biden had said on Sept. 24, \"Donald Trump will leave Congress, in my view, no choice but to initiate impeachment.\" Shortly after Biden made his remarks, Trump tweeted in response and posted a campaign ad about Bide. \"So pathetic to see Sleepy Joe Biden, who with his son, Hunter, and to the detriment of the American Taxpayer, has ripped off at least two countries for millions of dollars, calling for my impeachment - and I did nothing wrong,\" Trump wrote. Biden later responded on Twitter. \"Thanks for watching. Stop stonewalling the Congress. Honor your oath. Respect the Constitution,\" Biden wrote, also calling on Trump to release his tax returns. Contributing: Aamer Madhani, Deirdre Shesgreen",
      "date": "Published 2:17 p.m. ET Oct. 9, 2019 | Updated 3:16 p.m. ET Oct. 9, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Tensions flare between Joe Biden and Elizabeth Warren at Democratic debate over big ideas vs. pragmatism",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/10/15/democratic-debate-westerville-ohio-event-test-biden-warren-sanders/3978928002/",
      "subtitle": "Medicare for All is one of the most hotly debated topics in the 2020 election. But what is it? And how will it work? We explain.\n    Just the FAQs, USA TODAY",
      "author": "Maureen Groppe,",
      "content": "    Twelve Democratic presidential candidates sparred Tuesday over healthcare, guns and other issues at a debate in Westerville, Ohio. Here's a play-by-play of the event: 11 p.m. EDT Welcome to the lead, Elizabeth Warren. Throughout a feisty three-hour Democratic debate in Ohio on Tuesday, the Massachusetts senator, who has risen to frontrunner status in recent polls, drew sharp and repeated attacks from other candidates on how to pay for health care, whether to tax the wealthy and what has caused the erosion of American middle class jobs. “Your idea is not the only idea,” Amy Klobuchar said at one point as she turned to Warren during an exchange over taxing billionaires. The sixth debate night of the 2020 presidential election cycle came during an inflection point in the race, as Joe Biden’s longstanding status as the frontrunner has been battered by Warren’s momentum. A common and telling refrain from the moderators throughout the debate: “I want to give Senator Warren a chance to respond.” The piling on began almost immediately, on the issue of health care. After five debates in which health care has been a top issue, the candidates drew sharper battle lines over how they would pay a Medicare-for-All system that has divided the field. Warren once again declined to say explicitly whether more government involvement in health care under Medicare for All would require Americans to pay more in taxes. “So let me be clear on this,” Warren said. “Costs will go up for the wealthy. They will go up for big corporations. And for middle-class families, they will go down.” Pete Buttigieg jumped, noting the lack of concrete response. “Well, we heard it tonight, a yes or no question that didn't get a yes or no answer,” he said in response to Warren. “Look, this is why people here in the Midwest are so frustrated with Washington in general and Capitol Hill in particular.” Bernie Sanders acknowledged that taxes would go up but said that families would save more than enough money in their health insurance plans to make up for it. “At least Bernie’s being honest here,” Klobuchar said at one point. “I think we owe it to the American people to tell them where we’re going to send the invoice.” It was a frontrunner’s debate, with Warren and Biden getting far more airtime than the other candidates on stage. The two had one of their first extended scuffles over a fundamental rift in the field: Whether the nominee should pursue a more ambitious agenda, catering to a progressive wing that wants major change, versus the more pragmatic approach favored by Biden and others on stage. President Donald Trump remained a central theme throughout the debate. Democrats were unified in their support of the impeachment inquiry launched this month by House Democrats. On the other hand, the flap over Joe Biden’s son – Hunter Biden – and his business ties to Ukraine was addressed quickly in the debate and then dispensed with. Biden said his son “did nothing wrong” and that his interview on ABC earlier Tuesday “speaks for itself.” Other Democrats on stage did not seek to attack Biden over the issue. Quite the contrary, in fact. “That was so offensive,\" Cory Booker said of Biden having to answer a question on his son’s foreign business. Another theme in the debate was criticism of Trump's abrupt withdrawal of U.S. troops from northern Syria, which cleared the way for Turkey to invade and battle with U.S.-allied Kurds. The Democratic candidates largely agreed that Trump’s decision was a betrayal of the Kurds, but they disagreed on what to do next. Biden indicated that he would maintain a troop presence in the region. “I would want those thousand troops to be protected by air cover, those thousand troops that are being – having to withdraw under fire, make it clear that they're not going anywhere, and have them protected, and work my way back toward what, in fact, needs to be done, protecting those Kurds,” Biden said. The debate about what to do in Syria drew in others into a clash on stage. “So really what you’re saying, Mayor Pete, is that you would continue to support having U.S. troops in Syria for an extended period of time,” Tulsi Gabbard told Buttigieg. “You can put an end to endless war without embracing Donald Trump’s policy,” Buttigieg responded. “What we were doing in Syria was keeping our word.” Eight of the candidates on stage Tuesday had already qualified for the next debate – to be held Nov. 20 near Atlanta. That meant fewer of the lesser-known candidates this time around needed a breakout moment to stay alive. But the Iowa caucuses are fast approaching, and the window for moving from “staying alive” to potentially clinching the nomination is narrowing. Four candidates who were on stage Tuesday aren’t yet a lock for November: Klobuchar, Tulsi Gabbard, Julian Castro and Beto O’Rourke. – John Fritze, Maureen Groppe, Ledyard King and Courtney Subramanian 10:47 p.m. EDT In one of the more tense moments in the debate, Joe Biden sparred with Elizabeth Warren over how to get things done in Washington. The back-and-forth came during a debate over whether Democrats should pursue a more ambitious agenda, catering liberal elements of the party that want major structure change, versus Biden’s more pragmatic approach and argument that the party should not overreach. To underscore her argument that Democrats should pursue bold ideas, Warren touted her role in setting up the Consumer Financial Protection Bureau in 2010 after the Great Recession and 2007-2009 financial crisis. The effort required a big fight. Republicans bitterly opposed the idea, viewing it as government overreach. “I went on the floor and got you votes,” a visibly upset Biden told Warren. “I got you votes.” Warren looked past Biden’s remarks and instead thanked his former boss, President Barack Obama. “I am deeply grateful to President Obama for fighting so hard,” Warren said. “You did a hell of job in your job,” Biden acknowledged. “Thank you,” Warren said. – John Fritze, Maureen Groppe, Ledyard King and Courtney Subramanian 10:40 p.m. EDT Democrats name check ... Robert Bork? The most unusual name check of Democratic debate night: The late conservative jurist Robert Bork. Cory Booker first invoked his name in mocking proposals to enforce antitrust law, saying that \"Robert Bork is just laughing in his sleep.\" Numerous commentators pointed out an inconvenient fact. \"Bork has been dead for six years. He’s more than asleep,\" tweeted political writer Walter Shapiro. (Bork actually died in December of 2012, almost seven years ago.) Political scientist Jack Pitney invoked the words of writer Raymond Chandler: “You were dead, you were sleeping the big sleep, you were not bothered by things like that, oil and water were the same as wind and air to you.” Later in the debate, Joe Biden also jumped on the Bork bandwagon. Biden noted that, in 1987, he led the Senate effort to reject Bork's nomination to the Supreme Court, a pivotal event in the hyper-partisanship that has marked so many judicial nominations. – David Jackson 10:29 p.m. EDT In the middle of his criticism of big corporations, Cory Booker playfully chided the moderators for asking older candidates – Bernie Sanders, Joe Biden and Elizabeth Warren – about their health. “I feel qualified to say this as the vegan on the stage,” the New Jersey senator said. “It’s rich to me that we asked three people about their health when, looking at this stage, we know that the most unhealthy person running for the presidency in 2020 is Donald Trump.” In February, after Trump took his annual physical exam, then White House press secrer Sarah Sanders said Trump is “in very good health and I anticipate he will remain so for the duration of his Presidency, and beyond.” A Huffpo/YouGov poll released Monday found that voters age 65 and older are more likely (61%) than voters age 18 to 29 (51%) to question a candidate’ physical health. – Ledyard King 10:15 p.m. EDT When pressed about whether he’s “up to the stress” of the presidency after suffering a heart attack earlier this month, Sen. Bernie Sanders responded, “I’m healthy. I’m feeling great.” The 78-year-old canceled several campaign events after undergoing surgery, releasing a video in which he said lying in a Las Vegas hospital “made me feel even more strongly the need for us to continue our efforts to end this dysfunctional and cruel health care system.” But as the Vermont senator seeks to turn his heart attack into a conversation about Medicare for All, the scare has renewed questions about whether his age will affect his stamina in the race and in the White House should he win in 2020. A Huffpo/YouGov poll released Monday found that voters age 65 and older are more likely (61%) than voters age 18 to 29 (51%) to question a candidate’ physical health. Sanders said he’s reassuring Americans about his fitness by “mounting a vigorous campaign” across the country and he plugged a rally in Queens he is planning on Saturday. The Vermont senator also drew cheers after he thanked his supporters and those who sent prayers and well wishes for his recovery. The same question was put to another septuagenarian – Joe Biden, who would be 78 if elected to office. “One of the reasons I’m running is because of my age and my experience – with it comes wisdom,” Biden said. 9:55 p.m. EDT Beto O’Rourke and Pete Buttigieg got into an extended personal debate in a continuation of an argument they’ve been having over O’Rourke’s proposal to require people to give up assault-style weapons. Asked how he would enforce a mandatory buyback program, O’Rourke said he expects “my fellow Americans to follow the law.” Buttigieg, who has called O’Rourke’s proposal a “shiny object” that distracts from taking gun control steps for which there is widespread support, said O’Rourke’s response makes clear that he doesn’t know how the plan would work. “We cannot wait for purity tests,” Buttigieg said. “We have to just get something done.” O’Rourke countered that Democrats should decide what they’re going to believe in and not be limited by polls, consultants and focus groups. Buttigieg said the problem isn’t the polls; the problem is the policy. “I don’t need lessons from you on courage, political or personal,” Buttigieg added. “Everyone on this stage is determined to get something done.” O’Rourke then said Buttigieg’s “shiny object” description of the buyback plan was a slap in the face to every survivor of a mass shooting. Buttigieg responded that the best response for gun shooting survivors is to “actually deliver a solution.” Amy Klobuchar echoed Buttigieg’s criticism when asked what’s wrong with a mandatory buyback program. “I just keep thinking of how close we are to finally getting something done on this,” she said. “Let’s not mess this up with this fight.” Kamala Harris, when asked why she supports a mandatory buyback program, replied by saying there are 5 million assault weapons are on the streets. “I have personally hugged more mothers of homicide victims that I care to tell you,” the former prosecutor said. “I’m done and we need action.” – Maureen Groppe 9:46 p.m. EDT It’s hard to make the argument on why voters should support you when you don’t get much of a chance to talk. While Elizabeth Warren, Joe Biden, and Pete Buttigieg got most of the air time, Andrew Yang, Julian Castro, Cory Booker and new-to-the-stage Tom Steyer are having a harder time making their case. According to a word count of the first hour of the debate, candidates at the top of the poll led the scramble for air time Warren dominated speaking times for the first parts of the debate, based on a USA TODAY analysis of preliminary transcripts. She spoke about 1,251 words during the first two parts of the debate, followed by Biden, who spoke 668 words. Buttigieg had the third-most speaking time, at 658 words. On the other end, Beto O’Rourke (190 words) Tulsi Gabbard (157 words), and businessman Tom Steyer had the least speaking time so far, with about 140 words. – Ledyard King and Nicholas Wu 9:42 p.m. EDT Elizabeth Warren used the debate to make a statement about the Middle East that is sure to get some attention in coming days as the Democrats clashed on stage over how to respond to the ongoing conflict in Syria. \"I think that we ought to get out of the Middle East,\" Warren said during a discussion of Turkey's invasion of northern Syria. \"I don't think we should have troops in the Middle East. But we have to do it the right way, the smart way.\" Commentators on social media clamored for Warren to be more specific. \"Warren is making big news when she says we should have no troops in the Middle East,\" tweeted Joe Lockhart, a press secretary for President Bill Clinton. \"We have important bases all over the region that are important to our national security.” Warren’s comments came during an extended debate how to proceed in the region. Democrats largely agree that President Donald Trump’s decision to withdraw troops from Syria was an abandonment of U.S.-allied Kurds, but they disagreed somewhat on what to do next. “So really what you’re saying, Mayor Pete, is that you would continue to support having U.S. troops in Syria for an extended period of time,” Tulsi Gabbard told Buttigieg. “You can put an end to endless war without embracing Donald Trump’s policy,” Buttigieg responded. “What we were doing in Syria was keeping our word.” Gabbard and Buttigieg are the only two Democrats on stage who served in uniform. – David Jackson and John Fritze 9:38 p.m. EDT Steyer: Trump’s America First ‘worst idea I’ve ever heard’ Tom Steyer, who has spent millions trying to combat climate change, made it clear how little he thinks of President Trump’s “Make America Great Again” platform that champions the massive development and expansion of carbon-causing fossil fuels to power the U.S. economy. “We can’t solve the climate crisis by ourselves,” the one-time California hedge fund billionaire said. “We have to work with our allies and our frenemies around the word.” “We’re going to have to lead the world morally,” he continued. “We’re going to have to lead it technologically, financially and commercially. This is the proof that this kind of America first, go-it-alone, trust nobody and be untrustworthy is the worst idea I’ve ever heard, and I would change it one day one in every single way.” – Ledyard King 9:29 p.m. EDT Kamala Harris got in one of her signature lines on Donald Trump while criticizing his foreign policy. Harris said Trump has given 10,000 ISIS fighters a get-out-of-jail-free card, calling what’s happening in Syria a crisis of Trump’s own making. And he has a long list of those, she added. “That’s why Dude gotta go,” Harris said. 9:27 p.m. EDT Joe Biden came out swinging on Donald Trump’s decision to withdraw U.S. troops from Syria but declined to answer a direct question: Would he, as president, place special forces troops back in the region? Biden called Trump’s decision the “most shameful thing any president has done in modern history in terms of foreign policy,” as he excoriated the president for clearing the way for Turkey to attack U.S. allied Kurds in Syria. Biden said he believed the U.S. should be involved in air support, but declined to say whether he would order troops back. The issue is a complicated one for Democrats, many of whom have criticized Trump’s move in Syria but who have also called for the U.S. to withdraw from entanglements in the Middle East. Trump has defended the move by saying he wants to extract American soldiers from overseas commitment. “What we were doing in Syria was keeping our word,” said Pete Buttigieg. – John Fritze and David Jackson 9:08 p.m. EDT In the first debates, Joe Biden who led the polls was the target of rivals’ slings and arrows. On Tuesday, riding polls that show her now on top, Elizabeth Warren discovered that she’s wearing the bullseye. On health care, Bernie Sanders, Amy Klobuchar, Pete Buttigieg and Joe Biden took turns hitting Warren on her Medicare For All plan that they said was costly and unrealistic. On wealth distribution, Klobuchar took umbrage at how she thought Warren was painting her ”ultra-millionaire tax” as the best plan. “We just have different approaches,” Klobuchar told Warren. “Your idea is not the only idea.” Beto O’Rourke piled on: “I think it’s part of the solution but I think we need to be focused on lifting people up and sometimes I think Sen. Warren is focused on being punitive or pitting one side of the country against the other.” – Ledyard King and Courtney Subramanian 9 p.m. EDT Democrats on stage largely agreed on at least one thing: Tax the rich. Even the rich agreed. Bernie Sanders took a question directly in his wheelhouse: Does he believe the billionaires should be taxed out of existence? Sanders didn’t go that far, but he did say that the country could not “afford to continue this level of income and wealth inequality.” Tom Steyer, a philanthropist and longtime Democratic donor making his first appearance on the presidential debate stage, said he largely agreed with Sanders’ assessment. “Sanders is right,” Steyer said during an extended debate about whether the candidates supported a wealth tax. “There have been 40 years where corporations have bought this government.” Amy Klobuchar captured the sense of the debate a minute later: “Not even the billionaire wants to protect billionaires.” – John Fritze 8:53 p.m. EDT Bernie Sanders' support of the Green New deal and its guarantee of federal work for millions of Americans didn’t sit well with businessman Andrew Yang, whose signature campaign proposal would give Americans a $1,000 monthly “dividend.” Yang said he likes the “spirit” of a federal jobs guarantee, which Sanders said is needed with the onset of automation. But “the fact is most Americans don’t want to work for the federal government,” Yang said. “And saying that is the vision of the economy of the 21st century to me is not a vision that most American would embrace.” Yang said he’s rather put money directly in American’s pocket than rely on government to address the problem because “it will result in failed retraining programs and jobs that no one wants.” – Ledyard King 8:51 p.m. EDT Senator Kamala Harris was asked to weigh in on the back-and-forth over Medicare for All and instead turned the conversation to abortion rights. “There are states that have passed laws that will virtually prevent women from having access to reproductive healthcare,” she said. She said it was not an exaggeration to say poor women and women of color “will die” because of the restrictive state laws. Harris lambasted Republican lawmakers for being “out of touch” with American women and called on them to let women make their own decisions about their reproductive rights. – Courtney Subramanian 8:37 p.m. EDT Elizabeth Warren, the candidate who boasts that she has a plan for everything, was pushed on why she hasn’t said how she would pay for expanding health are to all Americans. Bernie Sanders, who like Warren supports Medicare for All, has acknowledged that taxes would need to go up to pay for it, but has said premiums would go down. Asked whether her plan would require higher taxes on the middle class, Warren said costs will go up for the wealthy and for big corporations but down for middle class families. \"I will not sign a bill into law that does not lower costs for middle class families.” Warren said. Buttigieg, who has criticized Warren on the issue, said she dodged the question – what he called an example of why people are “so frustrated with Washington.” “I don’t understand why you believe the only way to deliver affordable coverage for everyone is by obliterating private plans,” Buttigieg said. Warren said Buttigieg’s “Medicare for All Who Want It” proposal is really “Medicare for All Who Can Afford It.” “That’s the problem we’ve got,” she said. “Medicare for All is the gold standard.” Amy Klobuchar, another contender trying to distinguish herself by warning that the more liberal candidates are going too far, said Warren was handing Republicans a gift by offering up a plan they can attack as too expensive.​ “I think we owe it to the American people to tell them where we’re going to send the invoice,\" Klobuchar said. \"The difference between a plan and a pipe dream, is something that you can actually get done,\" she said. Joe Biden argued that taxes increases for some would exceed what they would save on health care costs. \"The issues is whether the Democratic Party has the guts to stand up to the health care industry,” Sanders shot back. – Maureen Groppe and Courtney Subramanian 8:23 p.m. EDT Everyone knew the question was coming: Why was it okay for Hunter Biden to have a business interest in Ukraine when, as vice president, Joe Biden was the Obama administration’s lead on that country? Biden largely demurred on the question. “Look, my son did nothing wrong. I did nothing wrong,” Biden said. “My son’s statement speaks for itself,” Biden said, before pivoting back to Trump. “What we have to do now is focus on Donald Trump. I’m proud of the judgment (Hunter) he made.” The question had been guaranteed to come up early in this debate, the first since House Democrats launched an impeachment inquiry and the Trump campaign began firing back with television ads highlighting Hunter Biden’s former business dealings in the Ukraine and China. Hunter Biden hours earlier acknowledged he made a \"mistake\" and showed “poor judgement” in not calculating the political ramifications of joining the board of a Ukrainian natural gas company while his father had official business in the country as vice president. Speaking to ABC News, Hunter Biden denied doing anything \"improper\" in the Ukraine. Some Democrats saw the flap as a chance for Joe Biden to hit back at Trump, including by noting that Trump’s children also have overseas business tied to Donald Trump’s real estate empire. The former vice president didn't raise the issue. – John Fritze 8:20 p.m. EDT Steyer pushes his signature issue: impeachment Billionaire Tom Steyer, who launched his campaign in July, has long pushed for President Donald Trump’s impeachment before the formal inquiry began and made that his first point in his debut on the Democratic debate stage tonight. Before calling every candidate on the stage more patriotic than the president, Steyer pointed out he launched the Need to Impeach, an online campaign focused on Trump’s impeachment in October 2017, two years before House Democrats opened a formal impeachment inquiry into the president’s interactions with Ukraine. “Impeaching and removing the president is something the American people are demanding,” he said. – Courtney Subramanian 8:17 p.m. EDT President Donald Trump has faced considerable blowback for his decision to pull U.S. troops out of Syria this month, a move that all but paved the way for Turkey to begin airstrikes against U.S.-allied Kurds. It didn’t take long for that issue to pop up at the Democratic debate. Amy Klobuchar raised it in the answer to her first question, tying it to a question about whether the president should be impeached and removed from office. Klobuchar asked how \"leaving the Kurds for slaughter, our allies for slaughter\" would make \"Make America Great Again.\" Look for this issue to come up a lot more over the next three hours. – John Fritze 8:11 p.m. EDT The debate launched with a question about House Democrat’s impeachment inquiry, which all the Democratic presidential candidates support. But with a presidential election year coming up, why shouldn’t voters determine whether Trump stays in office, Elizabeth Warren was asked. “Because sometimes there are issues that are bigger than politics,” she said. Up next, Bernie Sanders called Trump the most corrupt president in history. “I agree with Bernie,” Joe Biden echoed. Because the White House has refused to cooperate with Democrats’ investigation, Biden added, Congress has no choice but to act. Kamala Harris said she doubts the impeachment inquiry will last long. “As a former prosecutor,” Harris said. “I know a confession when I see it.” – Maureen Groppe 8 p.m. EDT The latest debate of the Democratic presidential primary is underway in Ohio. With the impeachment inquiry in full swing, fighting along the Syria-Turkey border, Bernie Sanders’ recent health trouble and questions about Hunter Biden’s business dealings in the Ukraine, the moderators of the three-hour CNN/New York Times debate will have plenty to ask about. Stay tuned here (and hit refresh often) for up-to-minute developments. – John Fritze 7:50 p.m. EDT Democrats will be on the debate stage Tuesday, but President Donald Trump's campaign is still looming large. The Trump campaign, campaign committees, and the Republican National Committee announced a $125.7 million fundraising haul for the third Federal Elections Commission filing quarter as Democrats prepared to take the stage for the fourth Democratic presidential debate. In a release, the campaign said all of the groups would have $158 million cash on hand. “President Trump’s campaign is a juggernaut on an unstoppable path to victory in November 2020,” Trump campaign manager Brad Parscale said. According to the Trump campaign, it received 1,056,126 individual donations last quarter, with an average donation of $44.50. Sen. Bernie Sanders, I-Vt., raised about $25 million last quarter, the most out of any of the Democratic contenders. – Nicholas Wu 7:40 p.m. EDT Expect sharper elbows from South Bend, Ind., Mayor Pete Buttigieg, who has already called out Sens. Elizabeth Warren and Bernie Sanders this week while trading barbs with former Texas congressman Beto O’Rourke. The Indiana mayor launched a digital ad Monday explicitly attacking Sanders and Warren for their support for “Medicare for All” and instead touting his “Medicare for All Who Want It” plan. Earlier this week, Buttigieg faced off with former Texas Rep. Beto O’Rourke over a mandatory buyback program for assault rifles, a policy O’Rourke made headlines over in the last debate. Earlier this month O’Rourke slammed Buttigieg for his hesitancy over support for the program. The mayor responded to the criticism earlier this week in an interview with Snapchat’s “Good Luck America.” “I get it. He needs to pick a fight in order to stay relevant,” Buttigieg said Monday. O’Rourke responded in a tweet: “Pete can belittle the grassroots; he can call buybacks a ‘shiny object.’ He can say whatever he wants, but guns kill 40,000 people year.” – Courtney Subramanian 7:15 p.m. EDT The dozen Democrats on the debate stage in Ohio will have to answer a boatload of uncomfortable questions Tuesday about health issues, the age of the field's frontrunners and foreign entanglements in the Ukraine – to name a few. House Speaker Nancy Pelosi just threw another touchy issue into the queue: Should the House hold a vote to formalize the impeachment Democrats announced at a press conference three weeks ago? Less than two hours before the debate got underway, Pelosi announced that he House would hold off on that vote for now. Republicans have noted that every previous impeachment inquiry was preceded with a vote in the House to set up a special committee to conduct the investigation. Democrats say they don’t need to do that – and the Constitution doesn’t explicitly require it – but Republicans have raised process questions to hammer away at the inquiry and the White House has said it won’t provide documents absent a vote. – John Fritze 7:05 p.m. EDT President Donald Trump won Ohio in 2016 by 8 points, rebranding a state long seen a presidential battleground into one that is older, whiter and more Republican. When Trump won the state it raised questions about Ohio's ability to mirror the national mood, according to Kyle Kondik, author of \"The Bellwether.\" By holding their debate Otterbein University outside of Columbus, Democrats are signaling they’re not conceding the state. \"I am absolutely confident that battleground Ohio will once again be in Democratic hands,\" Democratic National Committee chairman Tom Perez told reporters from state and national news organizations. Democrats see hope in the suburbs, which have swung their way. That’s why Tuesday night’s debate will take place in an Ohio suburb that voted for Mitt Romney in 2012 but switched to Hillary Clinton in 2016. The reason Ohio has become much more Republican relative to the nation? It's significantly whiter with a smaller share of college graduates than average. That’s not the case in Westerville, however, the town where the debate is being held. So unless Democrats can improve their standing with white voters without four-year college degrees, they'll have a hard time carrying Ohio in 2020, Kondik concludes in an analysis for the University of Virginia’s Center for Politics. -- Cincinnati Enquirer, Maureen Groppe, Maureen and John Fritze 7 p.m. EDT Is former New York Mayor Michael Bloomberg still considering a run for president? Based on an op-ed published hours before the debate Tuesday in the Washington Post, it sure looks like he’s eager to remain in the mix. Bloomberg – who initially announced he wouldn’t run but who more recently has reportedly told allies he’d consider it if Biden falters – writes that the current field of candidates is talking about the wrong things. “Rarely are the candidates asked, and more rarely still do they talk about, how they would go about achieving their goals,” said Bloomberg, who is known for overseeing a technocratic administration that came on the heels of another former New York leader who’s been in the news a lot lately: Rudy Giuliani. “The job’s essential skills primarily involve leadership and management, not policy analysis,” Bloomberg writes. “The country elects a commander in chief, and yet based on the campaign so far, one might think we are electing a legislator in chief.” Bloomberg also uses the piece to take a swipe at Trump. Bloomberg says he spoke with the president shortly after the 2016 election and advised him to hire people “who are smarter than you.” So how did Trump do? A few good hires, Bloomberg opines, otherwise not very well. “Mostly he hired cronies, ideologues and sycophants,” Bloomberg wrote, “while also leaving hundreds of important senior level positions unfilled and paying less attention to many agencies than he does to cable TV news.” – John Fritze 6:50 p.m. EDT Betting sites are taking all kinds of wagers on tonight’s debate, including on whether Bernie Sanders will withdraw from the race, whether anyone will curse on stage, who will be tweeted about most, and how many times certain words will be said. Can you rank these words by the frequency in which SportsBetting.ag thinks they will be uttered? Billionaire. Impeach. China. Obama (as mentioned by Biden). If you guessed China, impeach, billionaire and then Biden references to Obama, you’re thinking like a bookie. (The over/under on the China mentions is 40.5 and the over/under on Biden references to Obama is 3.5.) – Maureen Groppe 6:45 p.m. EDT A growing battle between Pete Buttigieg and the party’s progressive wing escalated in the lead-up to the debate. Buttigieg released a new digital ad drawing a distinction between his “Medicare for all who want it” health care plan and the proposal backed by Elizabeth Warren and Bernie Sanders. The ad says Sanders and Warren “believe that we have to force ourselves into `Medicare for all,’ where private insurance is abolished.” The ad is running in Iowa where a new poll from Firehouse Strategies has Buttigieg in third place, having moved ahead of Sanders. Buttigieg’s increased attempts to go after the frontrunners include this comment he made Monday about Warren’s eschewing small donor strategy: “We're not going to beat Trump with pocket change.” In a tweeted response, Progressive icon Alexandria Ocasio-Cortez said the grassroots campaigning that Buttigieg “insults” has outraised him. And the Progressive Change Campaign Committee boasted that “numerous progressive voices sent warning flares to Mayor Pete before Tuesday's debate.” “Mayor Pete has been a rising star. But he needs to stop this,” the political action committee wrote in a fundraising email to supporters Tuesday. 6:40 p.m. EDT The Trump campaign’s response to the Democratic debate can be summed up in one word: socialism. In a full-page ad in today’s Columbus Dispatch the campaign argues that Democrats’ “big government socialism will wreck Ohio’s economy.” Banners scheduled to fly above the city of Westerville during the afternoon shouted “SOCIALISM DESTROYS OHIO JOBS.” The campaign says Democrats would raise taxes, eliminate private health insurance and increasing electrical bills by “ending fossil fuels.” – Maureen Groppe 5:50 p.m. EDT The Westerville debate is the first since House Democrats launched an impeachment inquiry of President Donald Trump last month over the Ukraine scandal. Joe Biden will have a chance to push back forcefully on the president's efforts to get officials in Ukraine to investigate him and his son, Hunter. But Biden also may face questions about the appropriateness of his son's having served on  the board of a Ukrainian gas company when Biden was vice president. Vermont Sen. Bernie Sanders will take the stage two weeks after having a heart attack. And Elizabeth Warren has been making a strong case – through fundraising, organizing and poll numbers – for why she should be considered the frontrunner. Still, Biden will stand in the center of the stage, flanked by Warren and Sanders, based on the average of the 10 most recent qualifying polls as of Oct. 2. October Democratic debate: Will Sanders attend? What are the issues? Here are 4 things you need to know The nine other candidates on stage will make the debate the largest presidential primary debate in the nation's recorded history, according to the New York Times. They will have three hours, in snippets of 75 seconds or less, to make their case to the voters. – Maureen Groppe On stage for the first time will be billionaire Tom Steyer who has pumped millions of dollars into a campaign to impeach Trump. A half dozen Democrats still in the race didn't make tonight's cut, including Montana Gov. Steve Bullock, the only remaining governor running, and self-help author Marianne Williamson. The polling numbers and fundraising support required to participate will ratchet up further for the November debate. Impeachment: 5 ways the Trump impeachment inquiry will loom large at Tuesday's Democratic debate – Maureen Groppe Joe Biden told supporters at a California fundraiser last week that he's had a target on his back at the debates because he began the race as a frontrunner. He's facing competition for his frontrunner status, though. Elizabeth Warren has been climbing in the polls. In some surveys, she polls slightly higher than him while in others Biden maintains an edge. Biden also enters the debate facing questions about how well he's handled the Ukrainian controversy and having just been outraised by three of his opponents in the last quarter. Plus, in an interview that aired Tuesday morning, Hunter Biden repeatedly admitted he made a \"mistake\" in not calculating the political ramifications of joining the board of a Ukrainian natural gas company while his father had official business in the country as vice president. So should we expect a different Biden from the last three rounds? “One of the problems I’m finding, I’ve got to be more aggressive,” Biden said at the fundraiser. “Which is good, I’m not complaining, I’m a big boy,” he said, while explaining that the debates' time restraints don’t allow time for full answers. – Maureen Groppe While debates offer a chance for contenders to stand out by attacking an opponent, that can be difficult to do while remaining likable. And a poll out Tuesday underscores why Democrats need to stay in good graces with voters. The latest findings from the Georgetown Institute of Politics and Public Service Battleground Poll show Trump isn’t the only one who has a higher unfavorability than favorability rating. For six of the seven Democratic hopefuls tested, more voters had a negative opinion than a positive one. The exception was Pete Buttigieg, but 39% of respondents had no opinion of him or had never heard of him. – Maureen Groppe Contributing: Nicholas Wu",
      "date": "Published 5:50 p.m. ET Oct. 15, 2019 | Updated 11:28 p.m. ET Oct. 15, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Joe Biden: 'No one in my family will have an office in the White House' or be 'a cabinet member' if I'm president",
      "url": "https://www.usatoday.com/story/news/politics/2019/10/13/joe-biden-family-wont-serve-white-house-if-hes-president/3971338002/",
      "subtitle": "Democratic presidential candidate Joe Biden said Wednesday for the first time that President Donald Trump must be impeached for alleged abuses of the powers of his office to help his own reelection. (Oct. 9)\n    AP, AP",
      "author": "Stephen Gruber-Miller",
      "content": " Altoona, IOWA — Former Vice President Joe Biden said if he is elected president, no one in his family will hold a job or have a business relationship with a foreign corporation or foreign government. \"No one in my family will have an office in the White House, will sit in on meetings as if they are a cabinet member, will, in fact, have any business relationship with anyone that relates to a foreign corporation or a foreign country. Period. Period. End of story,\" Biden told reporters in Iowa after giving remarks at a labor conference. Biden's remarks to reporters at the United Food and Commercial Workers 2020 presidential forum in Altoona, Iowa, on Sunday came hours after his son, Hunter, announced he would step down from the board of a Chinese private equity firm and committed to not do any foreign work if his father is elected president. Biden said his son's lawyers had told him they would be issuing a statement but he did not consult with his son about the statement and only saw it when it was released publicly Sunday morning. Biden said no one has asserted he or his son have done anything wrong, except President Donald Trump. Hunter Biden: Will resign from board of Chinese firm, says he won't serve on foreign boards if Joe Biden elected president The younger Biden has become a target of Trump’s criticism for his work on the boards of companies in Ukraine and China, although there is no evidence that he engaged in unlawful behavior. Trump’s request of the Ukrainian president to investigate Hunter Biden’s business dealings in that country has become the basis for an impeachment inquiry in the U.S. House. Democrats allege the request amounted to using the power of the presidency to improperly ask a foreign power to investigate the family of one of his domestic political rivals. Trump has said he did not do anything wrong. Biden said no news organizations that have investigated his son's business dealings have found that there was any wrongdoing by the Bidens. \"No one, no one has asserted my son did a single thing wrong. No one has asserted that I have done anything wrong, except a lying president,\" Biden told reporters. 'Whatever happened to Hunter?': Donald Trump steps up attacks on Joe Biden and his son at Minneapolis rally Biden's appearance at the labor forum was his first visit to Iowa since calling for Trump to be impeached last week. Biden is one of the last Democratic presidential contenders to signal his support for the U.S. House's impeachment inquiry against Trump. Failing to pursue the impeachment inquiry against the president could give future presidents license to engage in unethical behavior, Biden said at the forum. \"If, in fact, the House doesn’t move and let the facts fall where they may, what does the next unethical president, if we elect another one, what does that say they can do?\" Biden said. \"What’s that say? What’s going to happen? They have to know there’s consequences.\" Biden suggested growing public opinion on impeachment will sway more Republicans in Congress to support it. Several public polls in recent days have found that public support for an impeachment inquiry tops 50%. \"What’s going to change Republican minds in the United States Congress is when their constituents start changing their minds,\" Biden told the labor forum. \"And you’re seeing it start to happen: More Republican voters, independent voters are saying, 'Whoa, whoa, whoa. I didn’t know this.'\" Follow Stephen Gruber-Miller on Twitter: @sgrubermiller",
      "date": "Published 7:00 p.m. ET Oct. 13, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Joe Biden and Elizabeth Warren lead the pack in polling before fourth Democratic debate in Ohio",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/10/15/elizabeth-warren-joe-biden-lead-ahead-of-debate/3985093002/",
      "subtitle": "Democratic debate recap and what to watch for from Bernie Sanders, Joe Biden, Elizabeth Warren and how health care divides the field.\n    Hannah Gaber, USA TODAY",
      "author": "William Cummings",
      "content": " WASHINGTON – As 12 of the remaining 19 Democratic presidential candidates head into Westerville, Ohio, on Tuesday for the fourth primary debate, former Vice President Joe Biden and Sen. Elizabeth Warren of Massachusetts are at the front of the pack, according to polls. Who's leading between Biden and Warren? It depends on which polling outfit you ask. Biden leads Warren 32%-21% in the latest update from Politico-Morning Consult and 32%-22% in a poll released last week by Fox News.  Warren leads by 3 percentage points in a Quinnipiac University poll published Monday and by 4 points in an Economist-YouGov poll published last week. Until recently, Biden had led in virtually every major poll published since the end of 2018, but Warren has come out on top in eight of the past 15 national polls. Monday's poll is the third survey in a row from Quinnipiac in which Warren finished ahead of Biden. \"For Sen. Warren, the third straight time essentially tied at the top is the charm,\" Quinnipiac polling analyst Tim Malloy said. \"Her candidacy clearly has staying power going into the debate.\" October Democratic debate: Will Sanders attend? What are the issues? Here are 4 things you need to know Voters have the highest expectations for Warren heading into Tuesday's debate: 29% of Democrats and those who lean Democrat say they think she will perform the best, 25% say Biden and 13% say Bernie Sanders, according to a Politico-Morning Consult poll conducted from Oct. 11-13. Fifty-eight percent of those voters say they are motivated to watch the debate, and 27% say they are not motivated. Among all registered voters, 49% say they are motivated to watch, and 46% say they aren't. Fifty-eight percent of registered voters say the debate is at least \"somewhat important,\" and 33% say it is \"not very important\" or \"not important at all.\" Among Democrats and Democrat-leaning voters, 71% say it is important, and 12% say it is not. Last month, Warren began to pull ahead of Vermont Sen. Sanders, who has come up third in most recent polls. More: Tulsi Gabbard says she will attend Tuesday Dem debate after considering a protest Since July, Warren and Sanders had been locked in a virtual tie for second place in a majority of polls. The two have been the favorites of liberal voters in contrast with Biden who is the choice of more moderate Democrats. As Warren surged to compete with Biden for the top spot, Sanders – who suffered a heart attack this month – faded, finishing third in all but four of 22 polls conducted since mid-September. Warren is the choice of 50% of Democratic voters and independents who lean Democratic who identify as \"very liberal\" in the poll from Quinnipiac. Sanders and Biden are tied at 14% within that group. Among those who call themselves \"somewhat liberal,\" Warren finishes first at 34%, Sanders comes in at 17% and Biden at 15%. Biden is the clear favorite among those who identify as conservative Democrats at 36%; Warren comes in  second at 19%, and Sanders is third at 6%. Democratic debate: Why the 2020 election will be decided in suburbs such as Westerville, Ohio More: Why Democrats have a tough road in 2020 in Ohio Warren – whose declaration \"I have a plan for that\" has become synonymous with her campaign – holds a decisive lead as the candidate with the best policy ideas at 40%, ahead of Biden at 16% and Sanders at 12%, according to Quinnipiac. But Democratic voters indicate defeating President Donald Trump in the general election is their top priority, and about half of Democratic voters see Biden as the candidate best equipped to pull that off. Forty-eight percent say Biden has the best chance of defeating Trump, and 21% see Warren as the candidate with the best shot. While Biden has hovered at 42% to 56% in Quinnipiac polls on this question, Warren had never finished higher than 9% in previous surveys from the pollster. More: Elizabeth Warren leads Joe Biden in Democratic presidential primary polls When asked which Democratic candidate they think would be the best leader, 32% say Biden and 28% say Warren. On the question of impeachment, 46% say Trump should be removed from office, and 48% oppose such a move. A narrow majority of 51% approve of the Democrat-controlled House's move to open an impeachment inquiry, and 59% say they disapprove of the way Trump has responded to the inquiry. Fifty-one percent say the impeachment is a \"legitimate\" investigation, and 43% say it is a \"political witch hunt.\" Though 66% say it is \"not acceptable\" for a president to ask a foreign leader to investigate a political rival, as Trump encouraged Ukraine to look at Biden, only 44% say that is a good enough reason to remove a president from office. The Quinnipiac poll was conducted Oct. 11-13 among 1,195 registered voters. It has a margin of error of plus or minus 3.5%. Age, health and impeachment: What to watch for in this week's Democratic debate More: 5 ways the Trump impeachment inquiry will loom large at Tuesday's Democratic debate More: Schedule set for 2020 general election presidential and vice presidential debates",
      "date": "Published 2:17 p.m. ET Oct. 15, 2019 | Updated 3:07 p.m. ET Oct. 15, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "'Trump sold them out': Joe Biden hits the president over Syria troop withdrawal",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/10/16/syria-joe-biden-criticizes-donald-trumps-troop-withdrawal-abandoning-kurds/4002870002/",
      "subtitle": "President Donald Trump denied giving Turkey a green light to invade Syria, insisting what he gave \"was just the opposite of a green light.\" He also took on South Carolina Sen. Lindsey Graham after he criticized Trump's handling of the situation. (Oct. 16)\n    AP, AP",
      "author": "Stephen Gruber-Miller",
      "content": " DAVENPORT, Ia. — President Donald Trump sold out United States allies and gave ISIS \"a new lease on life\" by withdrawing troops from Syria, former Vice President Joe Biden said Wednesday. Biden, who is seeking the 2020 Democratic presidential nomination, used a speech in Iowa to criticize several aspects of Trump's foreign policy, including the trade war with China and his withdrawal from the Iran nuclear deal. Trump is \"a complete failure\" and \"the most reckless and incompetent commander-in-chief we've ever had,\" Biden said. 2020 Election: 5 things we learned from the Democratic debate in Ohio But he saved his harshest words for Trump's decision earlier this month to remove U.S. armed forces from northern Syria. Turkey subsequently invaded the country, including territory held by the Kurds, who were U.S. allies in the fight against ISIS. \"The events of this past week in Syria have brought devastating clarity to just how dangerous he is to our national security, to our leadership around the world, and to the lives of our brave men and women serving in uniform,\" Biden said, according to prepared remarks. The decision to withdraw troops from Syria, Biden said, created a humanitarian crisis and gave ISIS \"a new lease on life by forcing the Kurds to defend themselves against Turkey instead of fighting ISIS remnants.\" \"These brave Kurdish and Arab forces paid a steep price, with over 10,000 making the ultimate sacrifice,\" Biden said, according to the prepared remarks. \"And then, Trump sold them out.\" Trump has stood by his decision. \"It's not our problem,\" the president told reporters Wednesday as Vice President Mike Pence and Secretary of State Mike Pompeo prepared to travel to Turkey to try to negotiate a ceasefire and avoid a humanitarian crisis on the Syrian border. \"Imagine how demoralizing this must be for our troops: Russian mercenaries taking victory laps inside the bases that President Trump ordered them to abandon. Turkey attacking the very people they fought alongside,\" Biden said. Biden also used the speech to highlight the Obama administration's efforts against ISIS. \"The Obama-Biden administration worked with and alongside partners in Syria with just a few hundred Americans supporting tens of thousands of local fighters to take the fight to ISIS on the ground,\" Biden said. \"Our strategy was so successful, it turned out that Trump’s secret plan to defeat ISIS was to just keep doing what we were doing — until last week.\" Trump has faced bipartisan criticism for the withdrawal of troops, with the U.S. House voting overwhelmingly Wednesday afternoon to condemn the move. \"Even Republicans in Congress know this is irresponsible,\" Biden said. \"It's about the only time they've mustered the backbone to publicly criticize Trump.\"",
      "date": "Published 5:52 p.m. ET Oct. 16, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Joe Biden dodges question on son's interest in Ukraine during Democratic debate",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/10/15/democratic-debate-joe-biden-dodges-question-sons-ukraine-interest/3992266002/",
      "subtitle": "Impeaching a U.S. president might not be the be-all-end-all for their career. We explain why this is the case.\n    Just the FAQs, USA TODAY",
      "author": "John Fritze",
      "content": " Everyone knew the question was coming: Why was it okay for Hunter Biden to have a business interest in Ukraine when, as vice president, Joe Biden was the Obama administration’s lead on that country? Biden largely demurred on the question. “Look, my son did nothing wrong. I did nothing wrong,” Biden said. “My son’s statement speaks for itself,” Biden said, before pivoting back to Trump. “What we have to do now is focus on Donald Trump. I’m proud of the judgment (Hunter) he made.” The question had been guaranteed to come up early in this debate, the first since House Democrats launched an impeachment inquiry and the Trump campaign began firing back with television ads highlighting Hunter Biden’s former business dealings in the Ukraine and China. WHERE IS MARIANNE?: Marianne Williamson isn't on the debate stage but reminded people she's still running Hunter Biden hours earlier acknowledged he made a \"mistake\" and showed “poor judgement” in not calculating the political ramifications of joining the board of a Ukrainian natural gas company while his father had official business in the country as vice president. Speaking to ABC News, Hunter Biden denied doing anything \"improper\" in Ukraine. Some Democrats saw the flap as a chance for Joe Biden to hit back at Trump, including by noting that Trump’s children also have overseas business tied to Donald Trump’s real estate empire. The former vice president didn't raise the issue.",
      "date": "Published 8:31 p.m. ET Oct. 15, 2019 | Updated 10:17 p.m. ET Oct. 15, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Joe Biden digs at Elizabeth Warren after debate: Polls don't show 'anybody else as a frontrunner'",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/10/17/joe-biden-digs-elizabeth-warren-medicare-all-polling-numbers/4012345002/",
      "subtitle": "Debate winners and losers, Warren on the defensive, and what we're watching for before the next Democratic debate.\n    Hannah Gaber, USA TODAY",
      "author": "Jeanine Santucci",
      "content": " Former Vice President Joe Biden dodged some of the piling on from other 2020 candidates he has seen in previous Democratic debates, as Sen. Elizabeth Warren took on a lot of that heat on Tuesday. Biden thinks that's a good thing, but questioned Warren's standing as a frontrunner in comments to reporters in Ohio on Wednesday. \"Well, it's kind of about time other people get questioned,\" he said. \"You know, I haven't seen any polling showing that nationally, on average, that anybody else is a frontrunner. You guys keep talking about that.\" \"I think Elizabeth Warren's done very well,\" Biden added. \"She's moved, but now that she has moved and is taken more seriously, people are going to ask her about a little candor here. Tell us how you're going to do what you say you're going to do\" More: Elizabeth Warren is a new front-runner in town. Just ask her Democratic rivals The Massachusetts senator has led Biden by a slim margin in several national polls and in some early voting states like Iowa. While Biden had a significant lead on both Warren and Vermont Sen. Bernie Sanders earlier this year, data shows Warren steadily closing that gap. Warren faced attacks at the debate from South Bend, Indiana, Mayor Pete Buttigieg and Minnesota Sen. Amy Klobuchar, who both pressed her on issues such as her Medicare for All plan. Warren has repeatedly skirted a direct answer when asked if her plan will require tax increases on the middle class, something Biden has criticized her for heavily. But she maintains that overall costs will go down. “It’s fascinating that the person who has a plan for everything has no plan for the single most consequential thing in this election in the minds of the American people, across the board,\" Biden said Wednesday. At the debate, tensions flared between Biden, whose vision for the Democratic Party includes an approach akin to the Obama-Biden administration, and Warren, who is an icon for some in the more progressive wing in the party. When Warren discussed her work on the Consumer Financial Protection Bureau during the Obama era, Biden jumped in, saying he had rounded up votes in the Senate for it. \"Let's get that straight,\" he said. Warren responded after a pause, \"I am deeply grateful to President Obama, who fought so hard to make sure that agency was passed into law.\" Biden later cut her off, \"You did a hell of a job in your job.\" “Thank you,” Warren deadpanned.",
      "date": "Published 5:23 p.m. ET Oct. 17, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    }
  ]
}