{
  "articles": [
    {
      "title": "",
      "url": "",
      "subtitle": "",
      "author": "",
      "content": "   ",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders will not participate in LGBTQ town hall after heart attack",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/10/07/bernie-sanders-wont-attend-cnn-lgbtq-town-hall-after-heart-attack/3903074002/",
      "subtitle": "Aamer Madhani discusses how Bernie Sanders' health scare brings questions about age to the forefront, not just for Bernie.\n    USA TODAY",
      "author": "Savannah Behrmann",
      "content": " Clarification: A quote texted to USA TODAY about Bernie Sanders pulling out of the town hall was misattributed to the campaign. The story has been updated to remove the erroneous quote. WASHINGTON — After suffering a heart attack last week, Vermont senator and 2020 Democratic hopeful Bernie Sanders will no longer be participating in a televised LGBTQ town hall on Thursday, according to CNN. The 2020 presidential hopeful felt chest discomfort during a campaign event in Las Vegas last week and had a blockage in one artery. Two stents were inserted, his campaign said last week, and he was released from Desert Springs Hospital Medical Center on Friday. His doctors said Sanders’ “hospital course was uneventful with good expected progress.” Sanders, 78, was seen walking about his neighborhood in Burlington, Vermont, with his wife, Jane, Monday, and told reporters he'd be back on the campaign trail \"soon.\" He said on Sunday that he was “glad to be home in Burlington to rest for a little bit” and is “recovering well and feeling much better.” Sanders will participate in the upcoming Democratic primary debate, his campaign confirmed to USA TODAY last week. But he has cancelled some other campaign events since his heart attack. CNN and LGBTQ advocacy group the Human Rights Campaign announced at the end of CNN's 7-hour forum on climate change that they would be partnering to host the Thursday town hall. The event focused on LGBT issues comes after Trump administration policies that have banned transgender Americans from serving in the military, prohibited embassies from flying rainbow flags during Pride Month and rolled back certain Obama-era nondiscrimination protections. Sanders, an independent who ran for the Democratic nomination for president in 2016, has been consistently among the top three Democratic contenders in the large field. He currently stands in third place in national polling, according to a Real Clear Politics' averaging of major polls. The Vermont senator’s health scare has brought age to the forefront of the 2020 race. Sanders is the oldest person running for President. The other top democratic contenders are also the oldest. Former Vice President Joe Biden follows Sanders at 76, and Massachusetts Senator Elizabeth Warren is 70. President Donald Trump is also 73 years old. Contributing: Jeanine Santucci and Aamer Madhani.",
      "date": "Published 6:10 p.m. ET Oct. 7, 2019 | Updated 4:17 p.m. ET Oct. 8, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "2020 White House hopeful Bernie Sanders hospitalized after suffering chest pains",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/10/02/bernie-sanders-hospitalized-after-suffering-chest-pains/3840418002/",
      "subtitle": "Democratic presidential hopeful Bernie Sanders was hospitalized after experiencing chest pains during a campaign rally in Las Vegas.\n    USA TODAY",
      "author": "Aamer Madhani",
      "content": " Democratic presidential hopeful Bernie Sanders had a heart procedure after suffering chest discomfort during a campaign event Tuesday evening in Las Vegas, a top campaign aide confirmed Wednesday. “Following medical evaluation and testing, he was found to have a blockage in one artery and two stents were successfully inserted. Sen. Sanders is conversing and in good spirits,” senior campaign adviser Jeff Weaver said. \"He will be resting up over the next few days. We are canceling his events and appearances until further notice, and we will continue to provide appropriate updates.” Sanders, 78, later wrote on Twitter that he was \"feeling good\" and that his medical episode underscored the need for Medicare for All, his signature policy proposal that would lead to a massive expansion of the government backed health-care system while doing away with private insurance. \"I'm fortunate to have good health care and great doctors and nurses helping me to recover,\" Sanders added. \"None of us know when a medical emergency might affect us. And no one should fear going bankrupt if it occurs. Medicare for All!\" The Vermont senator is among the top contenders vying for the 2020 Democratic nomination. He trails former Vice President Joe Biden and Sen. Elizabeth Warren in the polls. Sanders has kept a breakneck campaign schedule since entering the race in February and has been a prolific fundraiser. He announced this week that he had collected $25.3 million from small donors – the largest quarter for any Democratic candidate this year. The Democratic socialist has boasted that most of his campaign war chest comes from small donors. The heart problem led to the postponement of a $1.3 million television advertising buy in Iowa this week, said the campaign's Midwest spokesman, Bill Neidhardt. Sanders had been scheduled to take part in a gun safety forum in Las Vegas on Wednesday and campaign in California in the coming days. President Donald Trump's reelection campaign and Sanders' Democratic presidential rivals took to social media to wish the Vermont senator a speedy recovery. Tim Murtaugh, the Trump campaign's communication director, said his team sent Sanders \"our prayers and wish him a speedy recovery.\" Biden tweeted: \"Anyone who knows Bernie understands what a force he is. We are confident that he will have a full and speedy recovery and look forward to seeing him on the trail soon.\" Warren said, \"Bruce, Team Warren, and I are sending all our best wishes for a speedy recovery to@BernieSanders. I hope to see my friend back on the campaign trail very soon.\" \"Thinking of @BernieSanders today and wishing him a speedy recovery,\" Sen. Kamala Harris, another 2020 Democratic contender, tweeted. \"If there's one thing I know about him, he's a fighter and I look forward to seeing him on the campaign trail soon.\" The Vermont senator is one of four septuagenarians battling for the White House in 2020. Does age matter? Trump vs. Biden in Iowa: Septuagenarian rivals try to demonstrate vigor in head-to-head stops Trump is 73, Biden is 76 and Warren is 70. The age of the contenders has been mostly a backburner issue in the campaign. Forty-six percent of voters planning to attend Iowa’s Democratic caucuses said it would be a disadvantage for a candidate to be older than 70, and 50% said it would make no difference, according to a Des Moines Register/CNN/Mediacom poll published in June. Three percent said they were unsure, and 1% said it would be an advantage. The stent procedure comes at a moment when Sanders – despite maintaining a strong fundraising haul – had found his candidacy in a “slow-moving decline” as fellow progressive candidate Warren has moved up in the polls, said Daniel Schlozman, a political scientist at Johns Hopkins University. In his unsuccessful 2016 run for the Democratic nomination, Sanders found success in his head-to-head competition consolidating a range of opposition among Democratic primary voters to former Secretary of State Hillary Clinton and those on the left who questioned the centrist trajectory of the party. But in a crowded field – there are still 19 major Democratic candidates vying for the nomination – Sanders has had more difficulty making headway with voters. He stands in third place in national polling, according to a Real Clear Politics' averaging of major polls. Sanders also sits in third place in polling of three of the first four caucus and primary states. “As of yesterday, Sanders faced strategic challenges in a multi-candidate race, where he faced a closely (ideologically) aligned and fast-rising candidate in Elizabeth Warren,” Schlozman said. “Those challenges haven’t disappeared, and now there is a new concern on top of them. \"How he thinks his way through the issues of age and health is another difficult issue for a campaign that was already facing a ceiling as far as we could see unless something pretty substantial happened to shake the field out.” Contributing: Nick Coltrain in Des Moines",
      "date": "Published 11:04 a.m. ET Oct. 2, 2019 | Updated 5:02 p.m. ET Oct. 2, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders will attend October debate after heart procedure",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/10/03/democratic-debate-bernie-sanders-attend-october-debate-after-heart-procedure/3854262002/",
      "subtitle": "Democratic presidential hopeful Bernie Sanders was hospitalized after experiencing chest pains during a campaign rally in Las Vegas.\n    USA TODAY",
      "author": "Rebecca Morin",
      "content": " WASHINGTON – After canceling several campaign events following a heart procedure, Sen. Bernie Sanders will participate in the upcoming Democratic primary debate, his campaign confirmed to USA TODAY Thursday. Sanders, 78, had two stents inserted earlier this week after doctors found blockage in one artery. His campaign said Wednesday that he experienced chest discomfort during a campaign event Tuesday evening in Las Vegas. The debate will be held on Oct. 15 at Otterbein University in Westerville, Ohio. CNN and The New York Times will be hosting the debate, which will air live at 8 p.m. ET. Sanders' wife, Jane, in a statement Thursday said the Vermont Senator's doctors \"are pleased with his progress, and there has been no need for any additional procedures.\" More: 2020 White House hopeful Bernie Sanders hospitalized after suffering chest pains \"Bernie is up and about,\" she said in the statement. \"Yesterday, he spent much of the day talking with staff about policies, cracking jokes with the nurses and doctors, and speaking with his family on the phone.\" The senator will likely be discharged before the end of the weekend and will be heading back to Burlington where he will take a few days to rest, the statement said. Jane Sanders said her husband is \"ready to get back out there and is looking forward to the October debate.” Sanders, who ran for president in 2016, has been consistently among the top three Democratic contenders. He currently stands in third place in national polling, according to a Real Clear Politics' averaging of major polls. Contributing: Aamer Madhani",
      "date": "Published 2:32 p.m. ET Oct. 3, 2019 | Updated 3:09 p.m. ET Oct. 3, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders released from the hospital after having heart attack earlier in the week",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/10/04/bernie-sanders-released-hospital-after-heart-attack/3869887002/",
      "subtitle": "Aamer Madhani discusses how Bernie Sanders' health scare brings questions about age to the forefront, not just for Bernie.\n    USA TODAY",
      "author": "Savannah Behrmann",
      "content": " WASHINGTON — Sen. Bernie Sanders was released from the hospital Friday evening after doctors say he had a heart attack earlier in the week. The 2020 presidential hopeful felt chest discomfort during a campaign event in Las Vegas Tuesday. He had a blockage in one artery and two stents were inserted, his campaign said earlier this week. Sanders' treating physicians Arturo E. Marchand Jr and Arun Guraraj released a statement via the campaign Friday saying that Sanders was “diagnosed with a myocardial infarction” at another facility before being transferred to Desert Springs Hospital Medical Center. A myocardial infarction is the medical term for a heart attack. “After two and a half days in the hospital, I feel great, and after taking a short time off, I look forward to getting back to work,” Sanders, 78, said in a statement Friday. The doctors said Sanders’ “hospital course was uneventful with good expected progress.” The Vermont Senator will participate in the upcoming Democratic primary debate, his campaign confirmed to USA TODAY Thursday. He had previously cancelled planned campaign events, as well as a planned television ad buy in Iowa. Sanders, who ran for president in 2016, has been consistently among the top three Democratic contenders. He currently stands in third place in national polling, according to a Real Clear Politics' averaging of major polls. Contributing: Aamer Madhani",
      "date": "Published 6:56 p.m. ET Oct. 4, 2019 | Updated 1:59 p.m. ET Oct. 5, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Save up to $1,800",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/10/11/trump-sanders-heart-attack/3949636002/",
      "subtitle": "Aamer Madhani discusses how Bernie Sanders' health scare brings questions about age to the forefront, not just for Bernie.\n    USA TODAY",
      "author": "Savannah Behrmann",
      "content": " WASHINGTON – During a rally in Lake Charles, Louisiana, Friday night, President Donald Trump commented on the recent health scare of Senator Bernie Sanders, who is running for the Democratic nomination and recovering after having a heart attack. “Looks like Bernie lost his chance, huh?” Trump said, drawing up some reaction from the audience. “Bernie was hitting a baseball today to show how strong he was,” referencing a video the Senator posted yesterday, \"It just wasn't a lot of bat head speed.\" “Bernie... get better fast,” the President said on Friday, continuing, “That’s the only time I’ve ever said anything good about him.” Sanders was released from the hospital last week after doctors said he had a heart attack, and his campaign announced that doctors inserted two stents after he felt chest discomfort during a campaign event in Las Vegas. He has taken some time off of campaigning, but recently stated that “We're going to get back into the groove of a very vigorous campaign, I love doing rallies and I love doing town meetings.” Sanders, at 78 years-old, is the oldest person running for president in 2020. Former Vice President Joe Biden is 76 and President Donald Trump is 73. Sen. Elizabeth Warren is 70. Sanders, who ran for president in 2016, has been consistently among the top three Democratic contenders. He currently stands in third place in national polling, according to a Real Clear Politics' averaging of major polls. Commenting on his campaign's response to the heart attack, Sanders said, \"You know, this is not a baseball game. So I think we acted absolutely appropriately.\"",
      "date": "Published 9:57 p.m. ET Oct. 11, 2019 | Updated 7:09 a.m. ET Oct. 12, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders: Billionaires shouldn't exist. Mark Zuckerberg doesn't disagree",
      "url": "https://www.usatoday.com/story/money/2019/10/04/mark-zuckerberg-weighs-bernie-sanders-attack-billionaires/3869852002/",
      "subtitle": "When Facebook went public several years ago, CEO and founder Mark Zuckerberg instantly became one of the richest people on the planet.  Like an increasing number of the hyper-rich, he's promising to do something useful with all that wealth?\n    USA TODAY",
      "author": "Joel Shannon",
      "content": " When a software engineer employed by Facebook asked billionaire Mark Zuckerberg to comment on Democratic presidential candidate Sen. Bernie Sanders' position that billionaires should not exist, fellow employees began to laugh. Facebook CEO and co-founder Zuckerberg also chuckled after a moment's pause. Those in attendance at Thursday's live-streamed town hall-style internal meeting began supportively to applaud. \"It's a good question ... All right,\" Zuckerberg said. In the answer that followed, Zuckerberg – who, with a net worth of $67 billion, is listed by Forbes as the fourth wealthiest American – said he was sympathetic to Sanders' views on income inequality. \"I understand where he's coming from,\" he said, noting he couldn't put a threshold on how much wealth is too much. \"At some level, no one deserves to have that much money.\" He went on to say he sees potential advantages to some Americans' ability to accumulate even \"unreasonable\" amounts of wealth, too. Forbes 400: Jeff Bezos, Bill Gates and Warren Buffett remain the richest people in the US Facebook encryption: Here's why the government doesn't want Facebook to encrypt your messages He cited his own philanthropic pledges as an example: Zuckerberg and wife Dr. Priscilla Chan have pledged to give away 99% of their Facebook shares in their lifetime. Zuckerberg said that while critics might argue billionaires' charitable gifts would benefit the nation more as tax dollars, he says his philanthropy is funding scientific research projects that would likely be ignored by the government. \"I think the alternative would be the government chooses all of the funding for all of the stuff,\" he commented. \"Part of what makes progress happen is people taking different approaches to different things,\" he went on to say. The exchange happened at a weekly \"internal Q&A\" that was publicly live-streamed on Zuckerberg's Facebook page. Usually the sessions are only for employees but a previous Q&A session made headlines this week when Zuckerberg was heard saying in leaked audio that he would \"go to the mat\" to fight efforts aimed at breaking up the social networking giant. That sparked a response from another Democratic presidential hopeful: Sen. Elizabeth Warren, who defended her plan to break up big tech companies. Zuckerberg was asked Thursday about Warren's plans and responded: \"Let's try not to antagonize her further.\" On Friday, Warren tweeted a video clip of the question and the start of Zuckerberg's response. \"If Facebook finds my scrutiny uncomfortable, here's what Mark Zuckerberg and his team could work on,\" Warren tweeted, listing protecting consumers' privacy, ensuring Facebook \"isn’t undermining our election security\" and ending \"his company's illegal anticompetitive practices.\" Contributing: Kelly Tyko, Jessica Guynn, Brett Molina",
      "date": "Published 8:02 p.m. ET Oct. 4, 2019 | Updated 9:52 a.m. ET Oct. 7, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Following heart attack, Bernie Sanders plans return to 'very vigorous campaign,' but no Iowa plans yet",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/10/10/bernie-sanders-iowa-campaign-continues-heart-attack-health-scare/3928574002/",
      "subtitle": "\"Brothers and sisters, will you stand with me,'\" Sanders, a Vermont senator, asks the crowd from the Register's Political Soapbox on Sunday, Aug. 11, 2019.\n    Des Moines Register",
      "author": "Nick Coltrain",
      "content": " DES MOINES — Sen. Bernie Sanders canceled several planned Iowa events to recover from a heart attack, but his Iowa campaign staff are moving forward with or without him on the stump. Sanders, who was hospitalized the night of Oct. 1 to have two stents inserted to clear blockages in his heart, has no current plans to return to Iowa. His only public event scheduled now is Tuesday's televised debate in Ohio. Tuesday evening, he told reporters assembled outside of his home in Burlington, Vermont, that he's going to \"change the nature of the campaign a bit, and make sure I have the strength to do what I need to do.\" The Democratic presidential candidate told NBC News on Wednesday he plans to \"get back into the groove of a very vigorous campaign,\" albeit one where \"I want to start off slower and build up and build up and build up.\" What that means for Sanders' Iowa campaign strategy wasn't immediately clear. Sanders canceled one Iowa swing immediately after he was hospitalized and a second appearance at an Iowa labor forum, planned for Oct. 13. Sanders is slated to participate in a Des Moines forum on issues important to Latino voters on Oct. 24, but his campaign staff couldn't confirm if that would happen. Before his heart attack, when Sanders would campaign through Iowa, he'd pack his schedule with town halls, forums and rallies. At the end of September, his most recent visit, he held 11 public events over four days, starting in Des Moines before moving from north-central Iowa down to its southeast corner. During those four days, he also included two events in Oklahoma. The heart attack led the campaign to delay a $1.3 million ad buy on Iowa TV markets. The two-week buy launched Tuesday, four days after it initially planned to air, campaign spokesperson Bill Neidhardt said. The Iowa campaign hasn't stopped, however. In early October, the campaign's national co-chair, U.S. Rep. Ro Khanna of California, traveled across Iowa as volunteers canvassed neighborhoods and worked phonebanks. \"We began this campaign with the intent to win Iowa, and we continue to intend to win Iowa,\" Neidhardt said. Iowa tends to see fewer presidential candidates in the days leading up to televised Democratic debates, so Sanders' absence does not stand out as much as it would during other stretches. The Des Moines Register's candidate event tracker showed a bare schedule wrapping up October among all candidates. Sanders, so far, has held the most public events in Iowa among the top-polling candidates. Among candidates with more than 1% support in the latest Des Moines Register/CNN/Mediacom Iowa Poll, only U.S. Sen. Amy Klobuchar, who has held 85 events, has had more Iowa stops than Sanders. Sanders has held 76 Iowa events this cycle. But campaigns tend to come to Iowa more frequently in the fall and winter leading up to the February caucuses. U.S. Sen. Kamala Harris in particular has said she plans to focus on the first-in-the-nation nominating contest to prove her mettle as a candidate. She was in Iowa the first weekend of October and will be back next weekend. Sam Roecker, a Democratic strategist and consultant, said Sanders' absence from the campaign trail likely won't hurt him as much as it would a lesser-known candidate. But Sanders will need to keep his name in the national conversation and pivot focus away from concerns of his health and fitness for the job. \"It's up in the air,\" Roecker said. \"We're still at that point where people haven't made up their mind on who they're going to caucus for.\" But Sanders' health scare has not dissuaded his most fervent supporters. Alyssa Rooney, a 25-year-old social worker in Waterloo, has supported Sanders since the 2016 race. She points to his demanding schedule, routine of walks and basketball, and general vigor during campaign stops as evidence of overall physical fitness. \"People have health issues all the time,\" Rooney said in an interview. \"Young people have health issues. For me, I read that he had this health scare but he was OK. For me, that was the end of it. It happened, but he can move on from it. \"I still believe he's the best person for the job.\"",
      "date": "Published 12:07 p.m. ET Oct. 10, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Sanders: It's 'nonsense' to suggest his campaign was hiding his heart attack",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/10/09/bernie-sanders-its-nonsense-he-hid-heart-attack/3923551002/",
      "subtitle": "Democratic presidential candidate Bernie Sanders took to Twitter to thank well-wishers after he was released from a Las Vegas hospital Friday. His campaign confirmed that Sanders had a heart attack. (Oct. 4)\n    AP, AP",
      "author": "Rebecca Morin",
      "content": " WASHINGTON – Presidential candidate and Sen. Bernie Sanders said Wednesday that it's \"nonsense\" to think his campaign was trying to hide the fact he had a heart attack last week. During his first sit-down interview since leaving a Nevada hospital Friday, Sanders swatted back claims that his campaign was concealing the medical issue. \"That's nonsense,\" he told NBC News. \"I don't know what people think campaigns are, you know we're dealing with all kinds of doctors and we wanted to have a sense of what the hell was going on really.\" Sanders said he believes his campaign \"acted absolutely appropriately.\" \"The first thing that we're trying to do is understand what's going on and not run to the New York Times and have to report every 15 minutes,\" he said. \"You know, this is not a baseball game. So I think we acted absolutely appropriately.\" Sanders' campaign last Wednesday announced that doctors found the Vermont Senator had blockage in one artery and two stents were inserted after he felt chest discomfort during a campaign event in Las Vegas. More: Bernie Sanders will not participate in LGBTQ town hall after heart attack It wasn't until Friday that Sanders' campaign officially noted he'd had a heart attack. Arturo E. Marchand Jr. and Arun Guraraj, Sanders' treating physicians, said in a statement that the senator was “diagnosed with a myocardial infarction” at another facility before being transferred to Desert Springs Hospital Medical Center. A myocardial infarction is the medical term for a heart attack. Sanders at 78 years old is the oldest person running for president in 2020. Former Vice President Joe Biden is 76 and President Donald Trump is 73. Sen. Elizabeth Warren is 71. More: 4 decades separate 2020's presidential candidates. Here's what that looks like. More: Sanders says heart attack won't hurt campaign According to NBC News, Sanders also said he \"misspoke\" when he said Tuesday that he would \"change the nature\" of his campaign post-heart attack. \"I misspoke the other day, I said a word I should not have said and media drives me a little bit nuts to make a big deal about it,\" Sanders said. \"We're going to get back into the groove of a very vigorous campaign, I love doing rallies and I love doing town meetings.” Contributing: Savannah Behrmann",
      "date": "Published 5:13 p.m. ET Oct. 9, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez told Bernie Sanders about her endorsement while he was still in the hospital",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/10/16/aoc-ilhan-omar-told-bernie-sanders-endorsements-after-heart-attack/4003249002/",
      "subtitle": "Aamer Madhani discusses how Bernie Sanders' health scare brings questions about age to the forefront, not just for Bernie.\n    USA TODAY",
      "author": "Jeanine Santucci",
      "content": " News that Rep. Alexandria Ocasio-Cortez, a progressive icon, would be endorsing Sen. Bernie Sanders for president came as he took the stage alongside his 2020 rivals and showed he was still in the game after a health scare. But Sanders got the news from the New York representative herself as he was still recovering in the hospital from a heart attack earlier this month, according to a new report. Sanders' campaign manager, Faiz Shakir, told Politico he answered the phone that day and passed it over to Sanders, who was in his hospital bed. \"Think about the courage of this person who says, ‘You know, I know what you just went through but I have so much trust and confidence in you that you are the one who will fight the fight that I believe in. I'm with you,' \" Shakir said. Minnesota's Ilhan Omar, another freshman Democrat in Congress who announced her support of Sanders Tuesday night, also told the senator about her decision after his heart attack, according to Politico. Sanders said during Tuesday's debate that a \"special guest\" would be joining him at a rally this weekend, and it was later confirmed the guest would be Ocasio-Cortez and that she would make her endorsement then. In response to a question about his heart attack and recovery at the debate, the 78-year-old said, \"I’m healthy, I’m feeling great.\" Sanders had canceled several campaign events after his surgery. He released a video in which he said being in a Las Vegas hospital “made me feel even more strongly the need for us to continue our efforts to end this dysfunctional and cruel health care system.” 'I'm feeling great': Bernie Sanders reassured voters of his health following heart attack He also said in an NBC interview, \"We're going to get back into the groove of a very vigorous campaign, I love doing rallies and I love doing town meetings.” Sanders is currently trailing former Vice President Joe Biden, 76, and Massachusetts Sen. Elizabeth Warren, 70, according to a rolling average of national polls by RealClearPolitics. The three frontrunners are the oldest Democrats in the race. President Donald Trump is 73 years old. Candidates' ages: 4 decades separate 2020's presidential candidates. Here's what that looks like. Contributing: Nicholas Wu, Courtney Subramanian, Rebecca Morin",
      "date": "Published 7:10 p.m. ET Oct. 16, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders' daughter-in-law dies at 46 after cancer diagnosis",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/10/09/bernie-sanders-daughter-law-raine-riggs-dies/3917146002/",
      "subtitle": "Aamer Madhani discusses how Bernie Sanders' health scare brings questions about age to the forefront, not just for Bernie.\n    USA TODAY",
      "author": "",
      "content": "The daughter-in-law of Democratic presidential candidate Bernie Sanders has died, shortly after being diagnosed with cancer. Rainè Riggs was 46. The Lee & Martin Funeral Home in Burgettstown, Pennsylvania, says Riggs died Saturday, the day Sanders returned to Vermont after suffering a heart attack. Her obituary said she was diagnosed with neuroendocrine cancer. Riggs, a neuropsychologist, was married to Levi Sanders, who ran unsuccessfully for a New Hampshire congressional seat in 2018. Riggs' obituary says she met Levi Sanders while the two worked at an emergency food shelter in Vermont. The obituary said Riggs was the director of behavioral medicine at Dartmouth Medical School for several years, and she started the Palliative Care Department for Dartmouth Medical Center. She also owned Riggs Geriatric Psychology in Windsor, Vermont. Riggs and Sanders had three children.",
      "date": "Published 9:32 a.m. ET Oct. 9, 2019 | Updated 10:48 a.m. ET Oct. 9, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders is big Democratic debate winner, and only partly due to his performance",
      "url": "https://www.usatoday.com/story/opinion/2019/10/16/alexandria-ocasio-cortez-bernie-sanders-democratic-debate-column/3990254002/",
      "subtitle": "Debate winners and losers, Warren on the defensive, and what we're watching for before the next Democratic debate.\n    Hannah Gaber, USA TODAY",
      "author": "",
      "content": "All 12 leading Democratic candidates for president got a chance to demonstrate why they were able to meet the requirements to pack on the stage for the fourth debate Tuesday. Sen. Elizabeth Warren of Massachusetts stayed feisty and focused in her new role as front-runner. Former Vice President Joe Biden was optimistic and self-congratulatory as he tried to win the John McCain name-dropping contest. Rep. Tulsi Gabbard of Hawaii confounded everyone by spreading the blame for the slaughter of the Kurds in northern Syria that Donald Trump invited to members of “both parties.” And Andrew Yang got to say lots of things as if no one had ever thought of them before. But the winner of the night was older than the two youngest candidates on stage — Gabbard, 38, and South Bend, Indiana, Mayor Pete Buttigieg, 37 — combined. Vermont Sen. Bernie Sanders, 78, returned to the campaign trail after recovering from a heart attack to deliver his strongest debate performance of the campaign. He was lively, funny and persuasive. At one point, he even seemed to convince billionaire Tom Steyer that billionaires shouldn’t exist. Sanders also took on Biden’s constant praise of bipartisanship and his pointed boast, “I'm the only one on this stage that has gotten anything really big done.” “Joe, you talked about working with Republicans and getting things done,” Sanders said. “But you know what you also got done — and I say this as a good friend — you got the disastrous war in Iraq done. You got a bankruptcy bill, which is hurting middle-class families all over this country. You got trade agreements like NAFTA and PNTR (permanent normal trade relations) with China done, which have cost us 4 million jobs. Now, let's get to 'Medicare for All.' ... If we stood together, we could create the greatest health care system in the world.” A conservative's take: Winners and losers in the Democratic debate from columnist Glenn Harlan Reynolds But Bernie’s biggest moment of the night didn’t happen onstage. In the closing minutes of the debate, news broke that one of the brightest young stars on America’s left, Rep. Alexandria Ocasio-Cortez of New York, will endorse the 2016 Democratic primary runner-up this weekend. This gives the democratic socialist from Vermont the chance to break the momentum of Warren’s steady rise in the polls, though he notably hasn’t taken a shot at the senator from Massachusetts on the debate stage yet. Instead, he sided with her several times as she was cornered, echoing her arguments for systemic change. The format of the debate flowed much better than the previous three. It’s unclear whether this was because the moderators allowed the candidates more air to answer and rebut each other, or because self-help guru Marianne Williamson wasn’t on the stage. Whatever it is, they should do more of it. While there are still miles to go before anyone actually votes for a nominee, the race for the chance to oppose Trump will likely remain a tossup among Sanders, Warren and Biden. This is mostly because the rest of the candidates have done a better job of canceling each other out than breaking through. While the debates have led to some blips in the polls — most notably for Sen. Kamala Harris of California after the second debate — the crowded stage format has the effect of blurring candidates together, especially since every debate seems to rehash the same Medicare for All contentions over and over until even Sanders seems a little bored by the fray. Another huge winner of the night was impeachment, which is now polling 50%. Every candidate on stage backs the inquiry in the House, and no candidate showed any willingness to echo the attacks on Hunter Biden that Trump pressured Ukrainian President Volodymyr Zelensky into trumping up. Unfortunately, the biggest loser of the night was human civilization. While there was a question about Ellen DeGeneres’ defense of her kindness to former president and torture purveyor George W. Bush, there wasn’t one question about climate change. Future generations will have to be satisfied knowing that we were much too busy worrying about rich people getting along in luxury boxes to stop the planet from boiling. Jason Sattler, a writer based in Ann Arbor, Michigan, is a member of USA TODAY’s Board of Contributors and host of \"The GOTMFV Show\" podcast. Follow him on Twitter: @LOLGOP",
      "date": "Published 7:10 a.m. ET Oct. 16, 2019 | Updated 4:36 p.m. ET Oct. 16, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "'I'm feeling great': Bernie Sanders reassured voters of his health following heart attack",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/10/15/democratic-debate-bernie-sanders-reassured-voters-his-health/3993614002/",
      "subtitle": "null",
      "author": "Courtney Subramanian",
      "content": " When pressed about whether he’s “up to the stress” of the presidency after suffering a heart attack earlier this month, Sen. Bernie Sanders responded, “I’m healthy. I’m feeling great.” The 78-year-old canceled several campaign events after undergoing surgery, releasing a video in which he said lying in a Las Vegas hospital “made me feel even more strongly the need for us to continue our efforts to end this dysfunctional and cruel health care system.” Tuesday Democratic debate served as a return to the campaign trail for Sanders. But as the Vermont senator seeks to turn his heart attack into a conversation about Medicare for All, the scare has renewed questions about whether his age will affect his stamina in the race and in the White House should he win in 2020. A Huffpo/YouGov poll released Monday found that voters age 65 and older are more likely (61%) than voters age 18 to 29 (51%) to question a candidate’s physical health. Sanders said he’s reassuring Americans about his fitness by “mounting a vigorous campaign” across the country and he plugged a rally in Queens he is planning on Saturday. The Vermont senator also drew cheers after he thanked his supporters and those who sent prayers and well wishes for his recovery. More: Beto O'Rourke defends plan to confiscate assault-style weapons The same question was put to another septuagenarian – Joe Biden, who would be 78 if elected to office. “One of the reasons I’m running is because of my age and my experience – with it comes wisdom,” Biden said.",
      "date": "Published 10:39 p.m. ET Oct. 15, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "'The halls of Congress are no joke': AOC reflects on Congress as she endorses Sanders",
      "url": "https://www.usatoday.com/story/news/politics/2019/10/19/aoc-bernie-sanders-endorsement/4038312002/",
      "subtitle": "Trump and impeachment: Can President Trump block witnesses and subpoenas, and what can Congress do about it? Lawyer and author David Stewart explains.\n    Hannah Gaber, USA TODAY",
      "author": "Nicholas Wu",
      "content": " On Saturday afternoon, Rep. Alexandria Ocasio-Cortez, D-N.Y., made her endorsement of Sen. Bernie Sanders, I-Vt., official at a rally in Queens, N.Y., that marked Sanders' return to the campaign trail after recently having a heart attack. \"I'm in the United States Congress now,\" said Ocasio-Cortez as she gave a 20-minute speech introducing Sanders, \"a long, long way from being a sexually harassed waitress in downtown Manhattan one year ago.\" \"The halls of Congress are no joke,\" she continued. \"It is no joke. Standing up to corporate power, and established interests is no joke. It's not just about standing up and saying these things, but behind closed doors, your arm is twisted, the vise pressure of political pressure gets put on you, every trick in the book, psychological, and otherwise is to get us to abandon the working class,\" she said before a massive crowd. More: AOC to endorse Bernie Sanders in 2020 Democratic presidential primary More: Alexandria Ocasio-Cortez told Bernie Sanders about her endorsement while he was still in the hospital More: 'I'm feeling great': Bernie Sanders reassured voters of his health following heart attack Ocasio-Cortez said that the pressure she'd felt in Congress led her to \"appreciate the enormous, consistent, and non-stop advocacy\" of Sanders. The 30-year-old New York Democrat has served as a lightning rod in Congress and a frequent target of criticism on the right as one of the most outspoken House Democrats. She has attracted much more attention than a freshman member of Congress might otherwise receive, becoming an outspoken voice on high-profile issues like student debt, D.C. statehood, and climate change. Sanders said during his speech that he planned to campaign with Ocasio-Cortez, ensuring that Ocasio-Cortez will continue to have a high-profile role in the presidential campaign. President Donald Trump has frequently criticized her, and retweeted a post from the Republican Party Twitter this afternoon that criticized Ocasio-Cortez and Rep. Ilhan Omar, D-Minn., as \"far-left Democrats\" who wanted to \"spend taxpayer dollars & have the government take control over every aspect of American life.\" Ocasio-Cortez seems aware of the criticism and often responds sharply. Last week, she was the subject of a story in the conservative Washington Times that had criticized her for the cost of her hairstyle. \"They’re just mad we look good doing it,\" she had said on Twitter of her conservative critics, adding the hair flip emoji. More: 'They’re just mad we look good doing it': AOC responds to story about the price of her hairstyle She addressed the issue in her speech today as well. \"You all like my haircut. It got a lot of attention last week,\" she joked at the beginning of her speech.",
      "date": "Published 5:12 p.m. ET Oct. 19, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "AOC to endorse Bernie Sanders in 2020 Democratic presidential primary",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/10/15/democratic-primary-aoc-endorse-bernie-sanders-president/3994047002/",
      "subtitle": "Democratic socialist Alexandria Ocasio-Cortez is the newest political figure everyone loves or loves to hate. From her ‘Green New Deal’ proposal to combat climate change to her clapbacks against Trump and her critics, here’s how AOC danced her way into the spotlight.\n    USA TODAY",
      "author": "Nicholas Wu",
      "content": " Rep. Alexandria Ocasio-Cortez, D-N.Y., plans to endorse Sen. Bernie Sanders, I-Vt., and appear with him at an event this weekend, The USA TODAY Network has learned. A person with knowledge of the plans confirmed the endorsement. The Washington Post had first reported the planned endorsement. Nina Turner, a former state senator and current Sanders campaign national co-chair, said to The USA TODAY Network that Ocasio-Cortez was returning the favor for the groundwork Sanders' campaign had laid in 2016. \"So the foundation that he laid in 2016 allowed for candidates to stand up and be bold and run their race,\" Turner said. \"This is coming full circle. One person doesn't make or break a campaign, but the level of excitement, it's going to take it to the next level for us.\" Later in the evening, Rep. Ilhan Omar, another member of the group of progressive House freshmen colloquially known as \"the Squad\" announced her endorsement of Sanders. Omar cited Sanders' leadership of a \"working class movement to defeat Donald Trump,\" and his leadership on other major progressive issues – \"And it’s why I believe Bernie Sanders is the best candidate to take on Donald Trump in 2020,\" she said in a release. Sanders had promoted the rally, which will take place in Queens, New York, during the debate, along with the promise of a \"special guest.\" Ocasio-Cortez's district includes part of Queens, though the rally would take place right outside her district. The two also interacted on Twitter during the debate. \"Tax the rich,\" she tweeted, during a debate over income inequality. The Sanders campaign then quoted her tweet with the comment, \"When we are in the White House, that is exactly what we will do.\" The New York congresswoman and liberal firebrand was an organizer for Sanders' 2016 presidential campaign when the senator's insurgent campaign in the Democratic primary caught fire against establishment pick Hillary Clinton. The endorsement by the outspoken progressive could help the Sanders campaign, which has recently lagged in polls amid the rise of Sen. Elizabeth Warren, D-Mass., and questions about Sanders' health after he had a heart attack. Contributing: Ledyard King, USA TODAY; Jessie Balmert, Cincinnati Enquirer",
      "date": "Published 11:11 p.m. ET Oct. 15, 2019 | Updated 11:52 a.m. ET Oct. 16, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    }
  ]
}