{
  "articles": [
    {
      "title": "",
      "url": "",
      "subtitle": "",
      "author": "",
      "content": "   ",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Democratic debate featured frontrunners who battled each other, attacked Trump",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/09/12/democratic-debate-stage-features-front-runners-joe-biden-bernie-sanders-elizabeth-warren/2291858001/",
      "subtitle": "Health care was the dominant issue, and front runner Joe Biden was the main target for the other nine candidates on the stage.\n    USA TODAY",
      "author": "Maureen Groppe,",
      "content": "     WASHINGTON – Ten Democrats running for president slugged their way through a three-hour debate Thursday that featured sharp jabs and underscored deep divisions among the candidates hoping to take on President Donald Trump next fall. In a debate that put all of the leading candidates on the same stage for the first time, the top tier candidates in polling – namely, Joe Biden, Bernie Sanders and Elizabeth Warren – largely fended off early and sometimes fiery attacks from the lesser-known Democrats. Ultimately, there were few breakout moments to shake up the status of the race. \"It's no longer time to postpone,\" Biden said in Houston. \"We should get moving.\" Amy Klobuchar, Julian Castro and Beto O'Rourke were among the candidates seeking to target Biden, who has held a steady lead in polls for months. But there were few fireworks among the front runners, and the long-expected sparks between Biden and Warren, who has been climbing in polls, never fully materialized. The debate highlighted deep chasms within the Democratic Party, including on health care. Some of those differences were framed by Barack Obama's presidency, though most of the candidates praised the direction he took the country over eight years. Sanders and Warren continued their push for a Medicare-for-All health care system while others, such as Biden, Pete Buttigieg and Klobuchar, questioned the cost. “While Bernie wrote the bill, I read the bill,” Klobuchar fired at Sanders, arguing his plan would force millions of Americans off their health plans. “I don’t think that’s a bold idea, I think it’s a bad idea.” Though the candidates were quick to criticize Trump’s “erratic” decision on trade, they were less willing to denounce tariffs he has imposed on China. Throughout the debate, Biden tied himself closely to Obama, whose approach to healthcare, immigration and foreign policy were dissected by the candidates almost as much as Trump’s. But when Biden was pressed to answer for the high level of deportations under Obama, he demurred by noting that he was only the vice president. That answer drew a sharp rebuke from Julian Castro. “He wants to take credit for Obama’s work but not have to answer any questions,” Castro said. Biden shot back that he stood by Obama’s decisions “good, bad and indifferent.” While the Democrats were hashing out how to defeat Trump, the president was on a stage in Baltimore mocking front runners with his trademark scathing nicknames. \"I hit Pocahontas way too early,\" Trump said of Warren as he spoke with GOP lawmakers meeting for their annual retreat. \"I thought she was gone – she’s emerged from the ashes. And now it looks like she can beat Sleepy Joe.” With less than five months to go before the Iowa caucuses, the knock-down battle for the nomination has remained remarkably steady. Biden has held a consistent lead in polling – both nationwide and in Iowa – for months. Warren has gained on Sanders, who remains in second place in most national polls. The candidates – at least some of them – will do it all over again next month. The fourth Democratic presidential debate will take place in Ohio on Oct. 15. After plenty of Trump-bashing, Vice President Mike Pence got a reference when the candidates were asked at the end of the debate to talk about a significant setback and how they dealt with it. Buttigieg talked about his struggles with coming out as gay as he was facing re-election in Indiana when Pence was governor. The Pence reference got a brief rise out of the audience, which quickly quieted as Buttigieg talked about coming back from serving in Afghanistan. His deployment had made him realize that you only get one life. “I was not interested in not knowing what it was like to be in love any longer,” he said. “So I just came out.” The fact that he was re-elected to a second term as mayor with 80% of the vote taught Buttigieg that “part of how you can win, and deserve to win, is to know what’s worth more to you than winning.” --Maureen Groppe Joe Biden was briefly shouted down by audience members during a question about his professional setbacks. Biden began saying that he didn’t believe any of his professional setbacks were significant when members of the audience began shouting. It was not immediately clear what issues the protesters, who shouted over each other,  were raising. Biden appeared to turn to Warren to ask if she knew what the audience members were yelling about. Biden continued his remarks a few minutes later. “You deal with it by finding purpose,” Biden said of setbacks. And his purpose, he said, was to stay engaged in politics. -- John Fritze Education Secretary Betsy DeVos, a big Democratic boogeyman, became an applause line for Buttigieg. The first step in improving education, he said, is appointing a secretary of education \"who actually believes in public education.” DeVos is a major advocate of charter schools. Buttigieg, whose husband is a teacher, also said that the country needs to respect teachers “the way  we do soldiers and pay them the way we do doctors.” Warren, calling herself the only one on stage who has been a teacher, said her secretary of education would be a public school teacher. “I know I shouldn’t really comment on the debate,” tweeted Chasten Buttigieg, “but I am SO GLAD we are *finally* talking about education and teachers.” --Maureen Groppe Beto O’Rourke promised to spend $5 trillion over the next decade on technology and incentives to reach net-zero greenhouse gas emissions by 2050. Amy Klobuchar vowed to keep the United States in the Paris Climate Accord, restore Obama’s Clean Power Plan to lower greenhouse gas emissions and increase fuel efficiency standards for vehicles. And Elizabeth Warren said she’s embracing a plan proposed by former presidential candidate Jay Inslee to eliminate carbon emissions from new buildings by 2028, carbon emissions from new cars by 2030, and carbon emissions from power production by 2035. “We are running out of time,” she said. It took two hours before the candidates were asked about climate change, an issue Klobuchar called “the existential crisis of our time.” And it was a dud. Everyone who chimed in agreed with the need for dramatic, immediate action. --Ledyard King Kamala Harris compared Donald Trump’s trade strategy to the Wizard of Oz. And not in a good way. “We’ve got a guy in the White House who’s been erratic on trade policy,” the California senator said about the president’s trade policy with China. “He conducts trade policy by tweet, frankly borne out of his fragile ego.” She called for a more consistent trade policy and made a reference to the iconic 1939 movie that starred Judy Garland. More: Republicans air ad about the dangers of 'socialism' and AOC during the Democratic debate “The bottom line is this: Donald Trump in office on trade policy … reminds me of that guy in “The Wizard of Oz”,” she said. “You know, when you pull back the curtain, it’s a really small dude.” That drew a chuckle from ABC moderator George Stephanopoulos, a diminutive man whose height is listed as 5 feet and five inches. “OK,” Stephanopoulos dead-panned. “I’m not going to even take the bait, Sen. Harris.” “I wasn’t talking about you,” she said laughing as well. -- Ledyard King Booker referenced his bald pate in attacking Trump for using a national security waiver to impose tariffs on Canada, a country led by a prime minister with a healthy head of hair. “I’m the only person on this stage that finds (Justin) Trudeau’s hair very menacing,” Booker said, “but they are not a national security threat.” Booker’s larger point was that Trump’s “America first” policy has turned into an “America alone” policy in which he is pulling away from allies, making it harder to take on competitors like China. --Maureen Groppe One by one, the Democratic candidates slammed President Donald Trump’s trade policy, which they described as “erratic.” “The president clearly has no strategy,” Pete Buttigieg said. More: Trump may not be watching the debate, but his team is. Campaign defends record in emails Buttigieg recalled that when he entered the race, Trump derisively said he’d like to see Buttigieg make a deal with Chinese leader Xi Jinping. “I’d like to see HIM making a deal with Xi Jinping,” Buttigieg said. “Is it just me, or was that supposed to happen in, like, April?” Buttigieg said that Trump’s inability to follow through on what he promises is being taken note of by both competitors and allies with serious consequences. “We can use trade to help build a stronger economy,” Elizabeth Warren said. Donald Trump’s “American first” policy is actually an “American alone” policy, Corey Booker said. What they didn’t say: Whether they would be willing to eliminate the tariffs that Trump has slapped on Chinese imports as leverage designed to force China to agree to a new trade pact. Amy Klobuchar came the closest. She said she would not have imposed the tariffs in the first place. --Michael Collins, Maureen Groppe During a busy night of Republican response to debating Democrats, President Donald Trump first took a low-key approach by saying he respected his opponents – but later mocked frontrunners Joe Biden and Elizabeth Warren with scathing nicknames. \"I hit Pocahontas way too early,\" Trump said, referring to Warren while speaking to a group of House Republicans in Baltimore. \"I thought she was gone – she’s emerged from the ashes. And now it looks like she can beat Sleepy Joe (Biden) ... He has no idea what’s going on.\" Trump also threw in a jab at South Bend, Indiana, Mayor Pete Buttigieg: “He’s doing a rotten job running his own city.” As the president spoke in Baltimore, Democrats who debated in Houston accused Trump of fomenting racism by attacking people of color and denouncing immigrants as invaders. Former Texas congressman Beto O'Rourke described Trump as a \"white supremacist\" who poses a \"mortal threat\" to the country, particularly minorities. -- David Jackson Dissecting President Barack Obama and his administration’s record has become a central theme of the Democratic presidential debate. It started, during the first hour, with health care, as the candidates sought to chart a direction on what to do with Obamacare. It continued during a discussion on immigration, when Joe Biden was pressed directly on the administration’s record on deportations. Obama adopted many progressive policies on immigration, including allowing young people brought to the country illegally as children to avoid deportation. But his administration also deported immigrants in the country illegally at a rate that surprised fellow Democrats. Biden was pressed directly on whether he stood by those deportations. “We didn’t lock people in cages, we didn’t separate families,” Biden said. “I’m proud to have served with him.” But when questioned again specifically about deportations, Biden noted that he was only the vice president at that time. That drew a fiery response from Julian Castro. “He wants to take credit for Obama’s work but not have to answer any questions,” Castro said. Biden dismissed that criticism, arguing that he “stood with” Obama’s decisions for eight years, “good, bad and indifferent.” “I did not say I did not stand with him,” Biden said. -- John Fritze President Donald Trump may not be watching the Democratic presidential debate, but his people are. The Trump campaign’s rapid response team is firing off emails to reporters in defense of his record as Democrats go after him from the stage. “President Trump is addressing gun safety while defending the 2nd Amendment,” read one message sent just minutes after Democrats slammed Trump failing to take on the issue of gun violence. “Thanks to President Trump, black Americans are making historic progress and enjoying growing opportunities,” read another rebuttal when Democrats accused him of promoting racism. “President Trump is fighting to bring down prescription drug prices for working families,” said another message when Democrats blasted Trump for trying to undo the Affordable Care Act. --Michael Collins Sanders, rather than attacking the candidate with whom he is competing for the most liberal voters, grabbed at the chance to reiterate their joint call that the system is broken. On the issue of gun control, Warren has said it can’t be addressed “until we attack the systematic problems.” Asked a question about the Senate filibuster, Sanders said he wanted to get back to Warren’s point. “What we are looking at is a corrupt political system,” he said, accusing drug companies, insurance companies and the fossil fuel industry for “determining what is happening in Washington.” --Maureen Groppe When it came to gun violence, Kamala Harris talked about how difficult it is to see school children drill for mass shooters. “It is traumatizing our children,” she said. Then she brought up the president’s words as a contributing factor, bringing up the Walmart shooting in El Paso last month that left 22 dead and dozens more wounded. Before the shooting, the gunman penned a racist, anti-immigrant manifesto that the president’s critics have said echo the president’s rhetoric. “People asked me in El Paso, ‘Well do you think Trump is responsible for what happened?’, she said. “I said ‘Well, look, he obviously didn’t pull the trigger, but he’s certainly been tweeting out the ammunition’.” -- Ledyard King After several of his competitors praised O’Rourke for his advocacy of gun control after a mass shooting in his home town, one of the moderators pressed him about his proposal to buy back military-style assault weapons. Critics call that confiscation. O’Rourke said the weapons have to go when they’re being used against children. He described meeting a mother who watched her daughter bleed to death in Odessa after being shot with an AR-15. “Hell, yes, we’re going to take your AR-15, your AK-47,” O’Rourke said. --Maureen Groppe One key theme to emerge from the third Democratic presidential debate, so far: The gloves are off. The ten candidates on stage have engaged in some of the sharpest exchanges Americans have witnessed so far in the race to replace President Donald Trump. Much of that tension in the first hour has been wrapped around the fight over how the nation should proceed on health care. Candidates had zingers ready, but their fire was not directed in all directions – and not necessarily just at front runner Joe Biden. Many observers were watching for fireworks between Biden and Elizabeth Warren, who has been steadily gaining grounds in polling. But, so far, most of the debate has played out between the three front runners – Biden, Warren and Bernie Sanders – and the rest of the field. It was Julian Castro who claimed Biden was “forgetting what you said two minutes ago,” a not-so-subtle knock on Biden’s propensity for gaffes. It was Amy Klobuchar who was among the most forceful critics of Sanders’ plan to expand government health care. -- John Fritze First Kamala Harris thanked Barack Obama for passing the Affordable Care Act that expanded health care for millions. Then the California senator thanked Bernie Sanders for proposing Medicare for All. Finally, she brought up the ghost of Arizona Republican Sen. John McCain, who died last year, when talking about how he stopped Donald Trump’s plan to kill Obamacare. “Donald Trump came into office and spent almost the entire first year of his office trying to get rid of the Affordable Care Act,” she said. “We all fought against that, and then the late, great John McCain at about 2 in the morning killed his attempt to kill health care for millions of people in this country.” As she spoke she pointed her right thumb down, mimicking McCain’s famous gesture when he broke from his party and became the deciding vote in 2017 against Trump’s plan to repeal Obamacare. -- Ledyard King More than 30 minutes into the debate, Cory Booker had not had a chance to speak since his opening statement. During a spirited debate over health care, Booker was mainly silent while other candidates had a chance to jump in multiple times. Booker got the last word on the debate over health care. “There’s an urgency right now in this nation, everybody feels it,” Booker said when the camera turned to him. “We cannot sacrifice progress on the altar of purity.” -- John Fritze Amy Klobuchar came out swinging against the progressive plan to prove government health insurance for all Americans – and what has become a Bernie Sanders campaign mantra. “While Bernie wrote the bill, I read the bill,” Klobuchar fired at Sanders, arguing that the plan would drop millions of Americans off their private health insurance. “I don’t think that’s a bold idea, I think it’s a bad idea.” The line was a response to Sanders' oft-repeated line that he \"wrote the damn bill\" to move to a Medicare-for-All health insurance system. Health care, and the fight over whether to make adjustments to Obamacare or to scrap it for additional government coverage, has dominated the opening moments of virtually every Democratic debate this year – and it has widely split the field. -- John Fritze Bernie Sanders, in an extended defense of his Medicare for All plan, argued the proposal would be cost-effective. Then he added, “I wrote the damn bill!” It was a recycled line that he first used in a presidential debate in July, when he claimed the plan would provide union members with better health care coverage than they have now. Tim Ryan interjected, \"You don't know that, Bernie. \"I do know that — I wrote the damn bill,\" Sanders fired back. --Michael Collins Moderator George Stephanopoulos immediately tried to get the top three candidates engaged in a debate over how far left the party should go. He asked Biden whether Sanders and Warren are pushing too far beyond where most Democrats are on health care, climate change and college costs. “That’s for voters to decide,” Biden said. “Let me tell you what I think.” After saying Obamacare worked, Biden went after the cost of Medicare for All, saying Sanders and Warren haven’t explained how it will be paid for. Warren responded that the question is how to improve on Obamacare. “And I believe the best way we can do that is we make sure everybody gets covered with health care at the lowest possible cost,” she said. “And middle-class families are going to pay less.” -- Maureen Groppe Beto O’Rourke, who has made gun control a centerpiece of his campaign, went hard on the issue in his opening statement. O’Rourke used his first words to note the El Paso shooting on Aug. 3 that left 22 people dead. The former Texas congressman also went after President Donald Trump, arguing that the shooter was “inspired to kill by our president.” -- John Fritze It didn’t take long for someone to use the most famous line associated with the city hosting the debate. “Houston we have a problem,” said Sen. Amy Klobuchar, D-Minn. a reference to the message from Apollo 13 astronauts to Mission Control in Houston. The NASA mission in 1970 returned to Earth after technical problems prevented it from reaching the moon. -- Ledyard King The third Democratic presidential debate is underway in Houston. Appearing on stage from left to right; Amy Klobuchar; Pete Buttigieg; Bernie Sanders; Joe Biden; Elizabeth Warren; Kamala Harris; Andrew Yang, Beto O’Rourke and Julian Castro. Buckle up: The debate, which is airing on ABC and Univision, is expected to last three hours. Follow along here for the latest. -- John Fritze In July, it was the season finale of The Bachelorette. This time, football fans who are following the Democratic presidential race will face a choice: NFL Thursday Night Football will feature a match-up between the Tampa Bay Buccaneers and Carolina Panthers. Politics observers – including President Donald Trump – have often paid close attention to the ratings captured by networks hosting the debates. Are Americans still tuning in? Is interest in the race already waning, less than five months from the Iowa caucuses? Are Americans, as the president claimed after ratings were released for one of two debates in July, just “desperate for Trump”? In July, both the debate and the Bachelorette finale were slated to run from 8 p.m. to 10 p.m. ET, forcing millions of Americans to choose between national politics and reality-TV politics. Some 8.7 million viewers watched the first night’s debate live on CNN. Another 2.8 million watched on CNN’s live stream. That bested The Bachelorette, which drew 7.4 million viewers. This time, the debate is almost certain to have a major advantage in the ratings battle. The candidates will scrimmage on the ABC broadcast network; the game is on the cable-only NFL Network. The game is also being played in Charlotte, N.C., the site of next year's Republican nominating convention. -- David Jackson and John Fritze Andrew Yang promised this week to do something unusual at tonight’s debate. It turns out, he will deliver on that promise. Buzzfeed News reported Thursday that Yang is planning to announce a contest in which he will award 10 families with $1,000 a month for one year. Yang has pulled out the marketing move before (though not at a debate). The effort is intended to highlight his plan for a universal basic income – a central part of his economic message – in which every American citizen over the age of 18 would be guaranteed $1,000 a month. The idea has gained prominence among some economists who argue a universal income would offset job loss caused by advances in technology. -- John Fritze The candidates have been warned. Or maybe begged. ABC, which is hosting tonight’s Democratic debate, would really appreciate it if the Democrats can keep from swearing during the three-hour event. It’s not that the network doesn’t appreciate passion and authenticity. But the network is governed by Federal Communication Commission indecency rules. And because there will be no delay on broadcasting the live event, ABC will not be able to edit out foul language, the network told the candidates. They may be particularly concerned about former Texas Rep. Beto O’Rourke, who has been dropping the F-bomb to express his anger about gun violence. His campaign is even selling T-shirts with the expression he’s used. Asked Saturday if he would swear on the debate stage, O’Rourke had a five-letter response: Maybe. During the first debates in June, entrepreneur Andrew Yang said the Russians are laughing their (behinds) off at the United States as they try to manipulate the elections. New Jersey Sen. Cory Booker used the S-word during the last debates. But he was repeating President Donald Trump’s reported description of countries from which he did not want to accept immigrants. Booker has also sworn on social media, such as when he tweeted in June a defense of fellow competitor Kamala Harris’ heritage, saying she doesn’t have “sh—t” to prove. When a follower questioned whether someone else had taken over Booker’s account, he responded: “Oh, this is definitely me.” -Maureen Groppe Former Vice President Joe Biden will need to prove himself against Massachusetts Sen. Elizabeth Warren who has been rising in the polls. Vermont Sen. Bernie Sanders is still competing with Warren for support from the most progressive wing of the party. And California Sen. Kamala Harris will try to reignite the spark she lit from the first debate that has since faded. How to watch: Warren, Biden face off in tonight's debate. Here's how to watch What to watch: Five questions the Democratic debate may answer Relive the highlights: Top moments from the last debate The six other candidates on stage still have to show that they belong in the top tier. Democrats who didn’t meet the party’s qualifying rules for tonight’s debate – including Hawaii Rep. Tulsi Gabbard, Montana Gov. Steve Bullock, Colorado Sen. Michael Bennet, New York Mayor Bill de Blasio and Ohio Rep. Tim Ryan – will have a harder time qualifying for next month’s debate without tonight’s exposure. Billionaire Tom Steyer didn't make this debate but has met the conditions for the next one, in October. After opening statements, tonight’s contenders will have one minute and 15 seconds for direct responses to questions. They’ll get an additional 45 seconds for responses and rebuttals. Airing on ABC and Univision, the three-hour event will be moderated by ABC’s George Stephanopoulos, David Muir, Linsey Davis and by Univision’s Jorge Ramos. The candidates are debating at Texas Southern University, a historically black university in Houston. Texas is also home to two of the competitors, former Texas Rep. Beto O'Rourke and former Housing and Urban Development Secretary Julián Castro who will be standing next to each other on one end of the stage. The order was determined by polling averages. Here’s the full list from left to right: Minnesota Sen. Amy Klobuchar; South Bend, Indiana, Mayor Pete Buttigieg; Sanders; Biden; Warren; Harris; entrepreneur Andrew Yang, O’Rourke; Castro. – Maureen Groppe President Donald Trump will miss the Democratic debate on Thursday because he’s speaking to Republican lawmakers holding their annual retreat in Baltimore. But that doesn’t mean that the president doesn’t have thoughts. Trump predicted that Joe Biden will prevail so long as “he doesn’t make any major mistakes.” Like many Americans, the president also seems eager to view the Democratic field as being much smaller than it is on paper. “You have three people leading,” Trump told reporters on the South Lawn. “I think it’s going to be one of those three.” -- David Jackson and John  Fritze If tonight’s candidates took the stage based on how often they’ve been Googled this past week instead of by their polling averages, the center stage would look a little different. Joe Biden and Bernie Sanders would still be there. But Andrew Yang, not Elizabeth Warren, would be in the top three, according to Google. Warren ranked fourth. The search engine also looked at the top questions people had about the candidates this week. Googlers wanted to know if Beto O’Rourke, Julian Castro and Amy Klobuchar are still running. Searchers were curious about whether Cory Booker is dating or married. The top question people had about the three oldest candidates – Joe Biden, Bernie Sanders and Elizabeth Warren – was how old they are. And one of the top five questions for nearly every candidate was how tall they are. But despite a common belief that the tallest candidate usually wins, the shorter person won three of the last five presidential elections. --Maureen Groppe What are the candidates who didn’t qualify for tonight’s debate doing instead? Ohio Rep. Tim Ryan is speaking at the University of New Hampshire Franklin Pierce School of law, his alma mater. Billionaire Tom Steyer and Montana Gov. Steve Bullock campaigned in Iowa Thursday. “See you in Iowa today, and over the next 143 days!” Bullock tweeted. After her watch party at the Writers Guild of America in California, author Marianne Williamson planned to talk about what she would have said had she been on stage. Her take, moderated by a writer with The Hollywood Reporter, will be livestreamed. Supporters of Hawaii Rep. Tulsi Gabbard are gathering at Veggie Street Restaurant where they will “blast searches and inundate social media with our support for Tulsi.” --Maureen Groppe President Donald Trump will, of course, be center stage at the Democratic presidential debate on Thursday without having ever stepped into Houston. But the Trump campaign apparently also wanted to own the skies. Trump’s campaign hired a plane to fly a banner over the debate’s host city. The message drew from the president’s leading reelection mantra: That Democrats running to replace him 2020 have veered too far to the left. “Socialism will kill Houston's economy,” the banner read. “Vote Trump 2020.” -- John Fritze",
      "date": "Published 6:42 p.m. ET Sept. 12, 2019 | Updated 3:03 p.m. ET Sept. 13, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "A charter school faces ugly segregation history of racist school choice in the Deep South",
      "url": "https://www.usatoday.com/story/news/education/2019/09/20/racist-charter-school-choice-segregation-mississippi-clarksdale-collegiate/2383034001/",
      "subtitle": "null",
      "author": "",
      "content": "CLARKSDALE, Miss. — It was a rainy February morning, but Clarksdale Collegiate Principal Amanda Johnson was fired up. “You know how Ms. Johnson feels about Friday,” she told the students as she paced around the cafeteria in an “I am black history” shirt. “If you didn’t get it all done … Friday’s the day you turn it around.” The former church youth-group multipurpose room had become a shrine to academic achievement, the stained-glass window overshadowed by bold purple banners listing the students’ future college graduation years, the school’s values and the slogan “#RUReady.” The students were just in kindergarten, first and second grade, but Johnson was projecting far into the future. “Raise your hand if you know your stretch goal,” Johnson said — referring to students’ personal better-than-best target score on their upcoming standardized tests. “I need you to know what you’re aiming at.” Ricky Taylor, a skinny first grader with a gap between his front teeth, raised his hand up until it practically lifted him off the bench. “My stretch goal in math is 191,” he said. Johnson hustled over and gave Ricky a dollar. Johnson opened the doors of Mississippi’s first rural charter school in this temporary space a year ago. Pulling students from Coahoma County and its county seat of Clarksdale, the school was a bid to cultivate the greatness she saw in these local kids, including her own daughters. They were so bright, so eager, and yet if the current statistics held, 25% would not graduate from high school. But Clarksdale Collegiate opened in the face of protest. The Clarksdale school board and Advocates for Public Education, a group of local parents and educators formed to oppose the charter, submitted an amicus brief in support of the Southern Poverty Law Center lawsuit aiming to overturn the state’s entire charter law. In a county with fewer than 27,000 residents, more than 1,300 people signed a petition opposing the school. They wanted a better education for all students, not just a few, Coahoma County lawmaker Johnny Newson told the Mississippi Charter School Authorizer Board. Nationally, controversy over opening a charter school is nothing new. But in Clarksdale, it had a particularly painful resonance. In 1970, when the courts ordered schools to desegregate and controversies over busing erupted across the country, white parents in Coahoma County fled the public system for private segregation academies, calling it “school choice.” White abandonment of the public system impoverished the public schools that served Clarksdale’s African American majority. Fifty years later, the term “school choice” still evokes injustice to the elderly African American educators and NAACP civil rights activists who led the drive to stop Clarksdale Collegiate. They saw the charter school as a new way to create a free but essentially private education for the privileged. Public schools still fight segregation, too: 63 years after landmark Brown v. Board case, segregated classrooms persist Despite the opposition, parents came to Clarksdale Collegiate. Ricky’s foster parents, Sakenna and Keithan Dear, worked in public school systems, but they signed Ricky up anyway. They hoped this school would support the child they were trying to adopt, who had come to them at age 3 from the children’s hospital in Memphis barely speaking, and left kindergarten at a local public school unable to read basic sight words. Ricky had his own hopes for his new school. He wanted his teachers to pay attention to him. He wanted them to build a playground. He wanted to learn how to fly an airplane, only not too far off the ground, because heights were scary. Like Ricky's foster family, most families who came to the charter were black, and they believed Johnson when she said her school would be different. It would, first and last, be better than the schools the area already had. Johnson was opening outside the traditional public system not to create some kind of segregated fiefdom but because that’s where she knew how to run a great school. But she faced an uphill battle against public sentiment strong enough to silence even supporters. She would have to convince them by following through on her promises, helping kids like Ricky learn to read. In 1969, Clarksdale schools were still separate and unequal, 14 years after the Brown v. Board Supreme Court decision. But that October, the court decided Alexander v. Holmes County Board of Education, ruling against the “freedom of choice” plans school districts had maintained in Mississippi and elsewhere. In response, the Clarksdale Press-Register outlined how white parents could leave the districts. About 500 white parents attended the first meeting to discuss opening a private, segregated school; 115 registered on the spot for the future school, which would later be named Lee Academy. When the Clarksdale Public schools reopened Feb. 2, 1970, after a one-day integration reorganization break, 574 of Clarksdale Junior High’s 585 white students did not show up, the newspaper reported. White children vanished entirely from the public schools in nearby counties — Indianola lost almost 1,000 to private schools. Mississippi’s public school enrollment fell by 23,000 students that month, the Associated Press reported. “We never really integrated,” former high school teacher Josephine Rhymes said. Where it all began: How an accidental encounter brought slavery to the United States The racial divide between the private and public sector is still stark, and the decades of disinvestment took their toll. It’s no secret now that the condition of the public schools is a roadblock to Clarksdale’s revitalization, residents said. While the city has capitalized on its history as “the birthplace of the blues” with festivals and artsy shops, many downtown sidewalks are littered with shattered glass and poverty remains at 36%. Superintendent Dennis Dupree came to the city 12 years ago, promising innovation. He brought in more than $15 million in federal and state funding. He introduced literacy and social-emotional learning programs backed by major funders such as The Walton Family Foundation. Dupree’s initiatives were buttressed by community youth programs focused on creativity, employability and college readiness. But the grants ran out, and any lingering positive effects were not visible in test scores. Both the Clarksdale and Coahoma systems were rated F on the state’s 2018 school report cards and are eligible for state takeover. Dupree, who retired from Clarksdale schools at the end of the 2018-19 school year, declined several requests for an interview. Amanda Johnson, a Little Rock native, came to the Arkansas side of the Delta in 2003 with Teach For America. She felt comfortable in the Delta in a way most of her TFA peers did not. Her father knew people in her district; she was close enough to her college in Memphis, Tennessee, to drive back for church. Because she is African American, like most of the residents, “no one knew I was Teach For America,” she said. She liked the people and the culture and the history. “There’s a lot of greatness that’s here that I want to be a part of and help grow and support,” she said. After TFA, she joined the KIPP charter network at KIPP Delta in Helena, Arkansas; when the network opened an elementary school, she became its leader. Johnson fell in love with the organization’s college-prep focus and refusal to let poverty dictate outcomes. As Johnson settled in Clarksdale in 2010, the reasons for her to do that work in her adopted hometown multiplied. She had two daughters to educate, and she believed high school failure rates showed the lower schools weren’t getting the job done. She knew she could find a way for her daughters in the local district if she had to. But she wanted something better and different for them, and for her neighbors. When Mississippi’s Legislature voted in 2016 to let students cross district lines to attend charter schools, Johnson was ready. Johnson began working her connections, and her experience and low-key magnetism worked wonders. First, she got a fellowship with Building Excellent Schools, a charter leadership incubator. Using the program’s resources, Johnson planned Clarksdale Collegiate down to the smallest detail as she tackled the Mississippi charter school application process. Clarksdale Collegiate would be “unapologetically college preparatory,” she wrote in her application. She incorporated elements that were familiar in charter-heavy places like Detroit and Memphis but new in Clarksdale, such as decking the hallways with college pennants, illustrations of the school’s core values and graphs of scholars’ academic progress, including the number of words each grade had read as tracked by Accelerated Reader, one of the school’s educational software programs. Johnson planned an extended, highly structured day, more than eight hours, with 75-minute blocks of math — even for kindergarteners — and literacy rotations for two hours at a stretch, including daily library class. The year ran almost three weeks longer than that of the district. Clarksdale Collegiate would be lightning-focused on metrics and testing even though the official state tests on which its renewal would hang didn’t start until the third grade. Everything would be done with urgency — a trait she observed at the charter schools she thought were most successful, places like Nashville Classical. There was no time to waste. “Kids don’t do well K through fourth and then start failing in fifth grade,” Johnson said. “What we’re doing now matters.” Halfway through the school’s first year, parents had embraced the intensity. At report card night in February, a kindergartener danced with a stuffed unicorn as her mother frowned at her data binder. “I think this is great,” kindergarten teacher Latasha Capers said. “It’s great, but it can be exceptional,” the mom said. Johnson’s vision for the school has it serving about 675 children. That size would let Clarksdale Collegiate “impact change outside of our own school,” she said. Over the next decade, it also would amount to as much as a quarter of Coahoma and Clarksdale’s current public school enrollment, and siphon off a lot of money that might otherwise go to the regular public systems. The charter school pulled roughly $149,000 in local taxes from the Clarksdale district in its first year alone, Cocke said, “and each year it will go up.” During Clarksdale Collegiate’s first year, an additional 29 students who chose to attend the school would have attended Coahoma County public schools, according to school data. The charter may not be siphoning out white students as the old segregation academies did, but to many critics of the school, pulling resources from the traditional public schools is just as unforgivable. Donell Harrell became the Clarksdale district’s first black superintendent in the 1990s. Sitting at McDonald’s where he meets with other retired men in the mornings, Harrell said he might have supported the charter school had the district been adequately funded. The Mississippi Legislature has fully funded the state’s public education system only twice in more than 20 years. “I think at some point choice would be appropriate, but don’t shortchange public schools,” he said. In theory, as a public school, Clarksdale Collegiate’s finances should have been about the same as the local districts. In 2017-18, Coahoma spent $9,279 and Clarksdale $8,424 in state and local per-pupil funds. The charter school received $1.2 million in per-pupil funds for its 145 students for 2017-18, or about $8,200 per child, the school’s financial manager Stacie Landry said. However, Johnson increased the amount she could spend on her students by raising a lot of private money. Clarksdale Collegiate recorded almost $820,000 in philanthropy for the past school year, Landry said. In total, Clarksdale Collegiate had revenues of $2.5 million for 145 students in its first year, Landry said — roughly $17,000 per student. Johnson said that much of that money went to one-time startup costs, such as stocking the library. The largest slice went to personnel: She paid teachers about 5% more than the Coahoma County system average, and paid her instructional aides almost double the state minimum of $12,500. Her own salary was $90,000 during the school’s first year, she said. Critics like Harrell and Rhymes said the money would be better spent supporting schools in the district. Even A-rated Kirkpatrick Elementary, next door to Clarksdale Collegiate, is hurting for funds. Kirkpatrick kindergarten teacher Teresa Scheider implemented some of the same rules followed at Clarksdale Collegiate: Be nice, do your very best. She had the same high expectations: The state required that students write their numbers up to 30, she said, but her students furrowed their brows writing their numbers up to 100. “She’s the best teacher,” kindergartener Raniya Berry said. “We be doing rhyming words and we be doing compound words and we write stories.” Still, Scheider seemed ground-down. Standardized examinations were something to be endured, not celebrated like across the street. “Education is not what I want it to be anymore,” she said — too much testing, not enough focus on kids’ social development, to their detriment. She no longer visits students’ homes: “I’m afraid to now,” she said. Clarksdale Collegiate special education teacher Sakenna Dear — Ricky's foster mom — knows the frustrations. She and her husband Keithan are Coahoma-born and -bred, and they want to stay in the area. “If you were born here, you want to succeed,” she said. She became a teacher and did the best she could working at a traditional public school, even though the leadership rarely provided meaningful professional development or transparency, she said. Then Ricky started kindergarten, and she saw how deep the problems went. He had a substitute teacher all year, who sent home bad reports about Ricky’s academic progress. Yet at dinner, Ricky described days of coloring and watching movies. Keithan Dear, the Coahoma system’s web developer and computer technician, worried a bit about “the conflict of interest” when they applied for Clarksdale Collegiate. But “being a parent now, it’s whatever’s best for the kid,” he said. “Around here we need to try something different.” When Sakenna Dear brought Ricky in to register, Johnson invited her to interview for a job. She did, and took it. She wanted something different for herself, too. One way that Clarksdale Collegiate is different from the choice schools of the past is in the composition of its student body. In its first year, Clarksdale Collegiate’s student body was 93% black, according to data the school provided. The State of Mississippi reported that 63% of the charter’s students were eligible for free lunch, compared to 74% of students in the Clarksdale public school district and 77% of Coahoma students. Coahoma High graduate Adrienne Hudson, who runs the education-improvement group RISE MS, was initially skeptical of charters. She feared cherry-picking and thought of charter administrators as “this outside force basically coming in trying to rescue this community from itself,” she said. “My answer would always be no, no, no, probably an expletive no.” Mississippi lawmakers tried to build in preventive measures to keep the new schools of choice from exacerbating Mississippi’s stark educational disparities. Lisa Karmacharya, the Mississippi Charter School Authorizer Board’s executive director, said the purpose of the charter law was to help “the underserved population.” The law requires charters’ enrollment of special education, low-income and English-language learning students to be within 80% of that in the district in which the schools operate. However, even the best law is nothing without enforcement. Penn State University education researcher Erica Frankenberg cautioned that it’s rare for states to make sure charters are following laws requiring them to enroll a representative proportion of students. “I’ve never seen a charter revoked for these reasons,” she said. The rubric by which Mississippi charters are evaluated puts significant weight on requirements that charters serve special education students and conduct non-discriminatory admissions, but the more general stipulation that a charter serve a representative percentage of “underserved” students ” counts for only 3 of 100 points. And even then, the state may renew a school even if it has organizational problems. Karmacharya said discussions were underway to revise the evaluation form to better reflect the law. The state board has not yet made any renewal decisions. Karmacharya is adamant that she and her board are committed to ensuring that the state’s charter schools serve a student population that is similar to that of the district’s non-charter public schools. Johnson felt just as strongly about reflecting the community. In contrast to the state teaching workforce as a whole, Johnson’s staff, like the students, is mostly African American. Critics like Hudson came to believe in Johnson’s commitment to creating a school that reflected and empowered the community. “She is working very hard to be a public charter school,” Hudson said. As the school’s first year drew to a close, everyone at Clarksdale Collegiate felt good. Ricky walked with his fellow Vanderbilt University homeroom students past his achievements, which papered the walls around him. He smoked through the ST Math computer program and beamed from a Scholar of the Week photo. He had earned a popcorn party, a trampoline trip and a special recess. Clarksdale Collegiate had lived up to his hopes. The night before, he vroomed around the Dears’ circular driveway on the bike he’d learned to ride without training wheels in three days. He paused briefly to gush about first grade. “My favorite thing to do in school is to play on the playground. We finally have one! Finally finally finally,” he said. He also loved science class, though “it’s not like real ones. I want to make potions and stuff. That’s what a real scientist does.” But that was OK. “I love school so much I just want to hug the school,” Ricky said. He zoomed off again. Sakenna Dear felt much the same way, both for the changes in Ricky and for herself. Johnson “really sets the tone and makes school fun,” she said. “It pushes me as a teacher and administrator to want to do more.” Johnson rejoiced in May over the kindergarten scores: 78th percentile in reading and 81st in math on the nationally used Measures of Academic Progress test. Her vision was on track. Only one staffer was leaving, while 68 people had applied for the 15 jobs that would be available when the school reopened in July after a short summer break. Clarksdale Collegiate had a wait list at every grade, with 88 applications for kindergarten alone. “I hate telling people they’re on the wait list — which is a good problem to have,” Johnson said. Maybe, she thought, it meant the community was coming around. Ricky Taylor, however, would not be coming back. His adoption was finalized in April, and he had a new name. “Ricky Dear!” he said. “Dear, like the rest of my family.” He had already begun to write it on his worksheets. Emmanuel Felton contributed to this report. This story about Clarksdale, Miss., was produced by The Hechinger Report, a nonprofit, independent news organization focused on inequality and innovation in education. Sign up for Hechinger’s newsletter.",
      "date": "Published 6:00 a.m. ET Sept. 20, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "We're mixing disasters now",
      "url": "https://www.usatoday.com/story/news/2019/09/05/hurricane-dorian-nassar-nicki-minaj-raiders-thursdays-news/2221056001/",
      "subtitle": "null",
      "author": "Ashley Shaffer",
      "content": " A tornado-spawning hurricane. A British insult. And a record fine. It’s Ashley. Here’s Thursday’s news, in short. But first, a thing of nightmares: A rare, two-headed rattlesnake was found slithering around New Jersey. 🐍🐍 At least 10 tornadoes were reported in South Carolina and North Carolina over the past day as Hurricane Dorian approached, adding another layer of worrisome weather threatening nervous residents. Parts of historic Market Street in Charleston, North Carolina, were under a foot of water Thursday as the hurricane continued its advance on the U.S. coast. Hundreds of thousands of coastal residents of the Carolinas packed up to flee their homes or were already gone. Almost 250,000 homes and businesses across the region were without power. As of midafternoon, the eye of Dorian was just offshore of Cape Romain, South Carolina. Michigan State University will pay a record $4.5 million fine for its poor handling of the Larry Nassar case, the federal Education Department announced Thursday. \"What happened at MSU was abhorrent ... so was the university's response to their crimes,\" U.S. Education Secretary Betsy DeVos said, referring to former MSU and USA Gymnastics doctor Nassar and his boss, former osteopathic college Dean William Strampel. Over and over in a 54-page document, the Office of Civil Rights says MSU knew about issues with Nassar and Strampel and brushed them aside. The outcome of that burying of problems was to create an environment in which female students knew they would not be believed, the report says. Once a week, we'll feature some 🔥 story picks from my USA TODAY colleagues. This week: \"Golden Girls\" enthusiast Felicia. Nicki Minaj tweeted Thursday that she's \"decided to retire\" to focus on having a family, promptly setting the interwebs on fire. But is she really leaving music behind? Though the 36-year-old rap diva didn't expand on her tweet publicly, her announcement left fans reeling on Twitter. \"PLS SAY SIKE,\" one person tweeted. \"Delete this now,\" another wrote. Minaj's tweet comes about a month after she announced her plans to marry Kenneth Petty. British Prime Minister Boris Johnson had some dietary advice for Vice President Mike Pence: \"We’re not too keen on that chlorinated chicken,\" Johnson told Pence during a meeting Thursday on the prospects of a U.S.-U.K. trade deal. Seems random, but let's back up: During trade deal talks, some British officials expressed concern that U.S. farmers engage in chlorine washing of chickens. The British prime minister used the poultry term as a political taunt against Labour Party leader Jeremy Corbyn this week. \"We have a gigantic chlorinated chicken of our own, here, on the opposition benches,” he told Pence. Oh, and Johnson told Pence that Americans don't eat enough British lamb and haggis. Young men have died in fraternities every year for two decades. They died from alcohol poisoning, extreme physical labor or complications from injuries – all in the name of fraternal brotherhood. Yet Greek initiations roll on. In response, frats banned hard liquor – but mothers of the students who died say that’s not enough. The deaths will keep coming, they say. “It’s certainly not perfect,” one fraternity advocate acknowledged. “We’re dealing with college students.” Recent deaths have increased pressure on fraternities to change and revived an old discussion: Are the benefits of fraternity membership worth the lives of young adults? This is a compilation of stories from across the USA TODAY Network. Want this snappy news roundup in your inbox every night? Sign up for \"The Short List\" newsletter here.",
      "date": "Published 6:12 p.m. ET Sept. 5, 2019 | Updated 6:28 p.m. ET Sept. 5, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "High school journalists were blocked from Betsy DeVos event. So, they wrote about it",
      "url": "https://www.usatoday.com/story/news/nation/2019/04/22/betsy-devos-visit-shut-out-lexington-student-journalist/3541119002/",
      "subtitle": "null",
      "author": "Matthew Glowicki",
      "content": " LOUISVILLE, Ky. - High school journalists who were barred last week from a roundtable event with U.S. Secretary of Education Betsy DeVos in Kentucky have made national news after calling out the event's lack of openness. \"We are student journalists who wanted to cover an event in our community featuring the Secretary of Education, but ironically, we couldn’t get in without an invitation,\" the students said in an editorial in their newspaper at Paul Laurence Dunbar High School, a public school in Lexington. The editorial caught the attention of local and national news outlets. The Washington Post wrote a piece about how the student's turned their travails into the story. In the students' piece, \"No Seat at the Roundtable,\" the  newspaper's two editor-in-chiefs said they were waved away the morning of April 17 when an event bouncer learned they hadn't RSVP'd to the event. The roundtable, hosted by the Bluegrass Community & Technical College in Lexington, focused on a a possible federal tax credit scholarship. 'Yeah, how is that illegal?': Kid reporter confronts officer who threatened to arrest her near Arizona-Mexico border DeVos' department is proposing \"Education Freedom Scholarships,\" which would offer up to $5 billion in annual federal tax breaks to those choosing to donate to state-based scholarship programs. Beyond their own problems attempting to enter the event, the students questioned the 11 a.m. Wednesday timing of the event, saying it's an inconvenient time for teachers and students to attend. The editorial questioned why only one student, who attends a private school in Louisville, had a seat at the table. \"... As students, we are the ones who are going to be affected by the proposed changes discussed at the roundtable, yet we were not allowed inside,\" the students, Olivia Doyle and Abigail Wheatley, wrote. And as the Courier Journal reported last week, while many state education officials and school-choice supporters attended, no public school employees were included in the roundtable. Charter schools: Betsy DeVos calls for more charter schools even as they spark investigations across the country What we know: Betsy DeVos wants to cut Special Olympics funds and people are outraged \"The bottom line is that we do not think that it is fair to have a closed roundtable about education when it affects thousands of Kentucky teachers, students, and parents,\" the students wrote. A media advisory on the education department's website included press contacts and noted reporters needed to have RSVP'd for the event by 8 a.m. on the day of the events. The students say they learned of DeVos' visit the day before and started making plans to attend. But when they arrived at the public school campus for the event they knew was open to reporters, the students said, a man wearing a college badge told them they needed an invitation to attend. The Lexington Herald-Leader reported that U.S. Department of Education Press Secretary Liz Hill said no one on DeVos' staff knew that student journalists were trying to get into the event. \"We welcome student journalists and would have been happy for them to be in attendance,\" she said. \"We are looking into what, if any, miscommunication might have happened between other staff on site for the event.” Follow Matthew Glowicki on Twitter: @MattGlo ",
      "date": "Published 3:02 p.m. ET April 22, 2019 | Updated 9:20 a.m. ET April 23, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Michigan State to pay record $4.5 million fine in Larry Nassar sexual assault scandal",
      "url": "https://www.usatoday.com/story/sports/2019/09/05/larry-nassar-scandal-michigan-state-pay-record-fine/2221059001/",
      "subtitle": "Before Larry Nassar was sentenced to 40 to 175 years, the prosecutor said if it weren't for the investigative reporting of the Indianapolis Star, Nassar would still be abusing gymnasts. Those reporters now share how they gave a voice to the victims.\n    USA TODAY",
      "author": "David Jesse",
      "content": " DETROIT – Michigan State University will pay a record $4.5 million fine for its poor handling of the Larry Nassar case, the federal education department announced Thursday. \"What happened at MSU was abhorrent. .... so was the university's response to their crimes,\" U.S. Education Secretary Betsy DeVos said in announcing the findings, referring to Nassar and his boss, former osteopathic college Dean William Strampel. In immediate fallout from the report, MSU Provost June Youatt resigned from the university, sources told the Free Press. Youatt, the No. 2 person at the university responsible for the academic side of the institution, was specifically called out in the report for failing to take action in the Strampel case. Nassar: She surrendered her secrets to put away a sexual predator. But her sacrifice isn't over Start the day smarter: Get USA TODAY's Daily Briefing in your inbox This is the second time in less than five years that the federal government has found major violations of Title IX at MSU. In 2015, before Nassar was publicly known, the Office of Civil Rights said MSU did not act promptly to handle two reports of sexual assault. The office also found the university did not have proper procedures and policies in place to handle sexual assault reports, which created a sexually hostile environment on campus. In addition, the school must hire an outside law firm to review all sex assault case decisions made by the school's Title IX office and issue a report to the federal government. MSU's board and president must also receive a regular report of all cases and decisions. MSU also must conduct a sweeping investigation into who knew what and didn't act on both the Nassar case and his boss, Strampel, who was recently convicted of criminal charges. That includes former MSU President Lou Anna Simon, who is currently facing criminal charges of lying to police in the Nassar investigation; Provost Youatt, who knew for years of sexual harassment claims by Strampel and cleared him; along with the associate vice president for academic human resources, employees of the Office of the General Counsel, and the former head coach of the women's gymnastics team. \"Because it failed to promptly and equitably respond to reports and grievances alleging sexual harassment perpetrated by Employee X (Larry Nassar) and the Dean (William Strampel) and failed to take appropriate actions reasonably calculated to end the harassment, eliminate the hostile environment, and prevent the harassment from recurring,\" the Office of Civil Rights finding says. Identity revealed: Survivor in the Brock Turner rape case Over and over in the 54-page finding, the OCR found MSU knew about issues with Nassar and Strampel and brushed them aside. The outcome of that burying of problems was to create an environment where female students knew they would not be believed, the report says. For example, in the section in Strampel, the OCR writes: \"The university's inaction in response to so many complaints ... over so many years very likely perpetuated the belief expressed by many that they had no choice but to tolerate the dean's behavior because the university would not take any effective measures reasonably calculated to end it.\" Nassar was a doctor at MSU, along with the team doctor for USA Gymnastics. He was sentenced to 60 years in federal prison on child pornography charges. He also faces a 40- to 175-year sentence issued in Ingham County and a 40- to 125-year sentence from Eaton County for sexual assaults. Those sentences will not begin until he finishes the federal sentence. Strampel was sentenced to a year in jail in June, after jurors found he used his power as dean of MSU's College of Osteopathic Medicine to proposition and control female medical students. The jury also determined there was enough evidence to support prosecutors' argument that Strampel displayed \"complete indifference\" about whether Nassar was following protocols meant to decrease risk for the university following a complaint of sexual assault in 2014. Olympic skier: Blanca Fernandez Ochoa found dead in mountains MSU settled lawsuits by more than 300 Nassar survivors with a payment of $500 million. However, other lawsuits are pending from more than 100 Nassar survivors. Late last month, MSU said in legal filings it shouldn't be held legally responsible for Nassar. \"Although Nassar’s actions were repugnant and merit the heavy criminal penalties imposed upon him, the law does not support Plaintiffs’ attempts to hold the MSU Defendants liable for his wrongs,\" the university said in a court filing of more than 100 pages, backed by nearly 900 pages of exhibits. Follow David Jesse on Twitter: @reporterdavidj",
      "date": "Published 12:35 p.m. ET Sept. 5, 2019 | Updated 3:51 p.m. ET Sept. 5, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "After a rocky start with the Aussies, Donald Trump hosts state dinner for PM Scott Morrison",
      "url": "https://www.usatoday.com/story/news/politics/2019/09/20/state-dinner-trump-hosts-australian-prime-minister-scott-morrison/2344441001/",
      "subtitle": "President Donald Trump says in a welcoming ceremony for Australian Prime Minister Scott Morrison that \"today we celebrate the long-cherished and unwavering friendship between the United States and Australia.\" (Sept. 20)\n    AP, AP",
      "author": "Michael Collins",
      "content": " WASHINGTON – What a difference a couple of years – and a couple of elections – can make. President Donald Trump, who famously hung up on Australian Prime Minister Malcolm Turnbull during a protocol-shattering phone call just a week after taking office, gave the red-carpet treatment to Turnbull’s successor, Scott Morrison, at the White House on Friday. Morrison and his wife, Jennifer, were feted with a formal state dinner – only the second of Trump’s presidency. Dinner was served al fresco-style in the Rose Garden, which was lit by huge lights that bathed the area in a golden glow. The menu included ravioli drizzled with a lemony Parmigiano-Reggiano cheese emulsion and topped by shavings of carrots, baby kale and sunchoke chips. The main course was roasted Dover sole accented with fennel mousseline. Dessert was a Lady Apple tart with ice cream. Here are five things you should know about Morrison’s visit: Morrison, 51, is Australia’s 30th prime minister. He took office in 2018, succeeding Turnbull, and held onto power after his center-right government scored an astounding win in an election that pundits and pollsters had predicted it was certain to lose. Sound familiar? Morrison’s upset victory has drawn comparisons to Trump’s unexpected win against Democrat Hillary Clinton in the 2016 presidential election. Before he became prime minister, Morrison served in the Australian parliament, where he once carried a chunk of coal onto the Parliament floor and proclaimed: “This is coal! Don’t be afraid!” Morrison was using the prop – against Parliament rules – to attack the Labor Party, which wanted to phase out coal power and press for more renewable energy. He also previously served as Australia’s immigration minister, where he helped develop a hardline policy to keep asylum-seekers from entering the country through its seaports. At the White House, Morrison and his wife arrived on the South Lawn Friday morning to a 19-gun salute and were greeted by Trump and First Lady Melania Trump. After the traditional inspection of the troops, the two leaders spoke of what Trump called \"the unbreakable bond\" between the two countries. “Australians and Americans understand each other like few other people,” Morrison said. Friday night, the Morrisons were back at the White House for the state dinner. They were met on the red carpet at the North Portico by the Trumps and were flanked by soldiers holding the Australian and American flags. Melania Trump was dressed in a J. Mendel aqua silk chiffon gown, with inserted pleats and bias cut waves. Hardly. Though Morrison’s political views are in line with Trump’s on issues like immigration and energy, they are very different people, said Michael Fullilove, executive director of the Lowy Institute, an independent think tank based in Sydney. Morrison is a lifelong politician, a devout Christian (he’s Australia’s first Pentecostal prime minister) and an “everyman figure,” Fullilove said. “Australian political values – including a belief in alliances and free trade – deviate from (President Trump’s) brand,” Fullilove said. “But they are both conservative figures. Prime Minister Morrison made his name as a tough immigration minister, which would appeal to the president.” While they aren’t from the same mold, the American press tends to cast them that way, “which probably flattered and pleased the president,” Fullilove said. “So President Trump was primed to like Prime Minister Morrison, and the (prime minister) has used that to his advantage,” he said. More: Trump greets Australian prime minister in attempt to revive 'mateship' with U.S. ally Morrison said in a statement released by his office that he will be visiting the U.S. from Sept. 19-27. Besides Washington, he also will travel to Chicago, Ohio and New York. “There is no deeper friendship than that which exists between Australia and the United States,” he said. “We see the world through the same eyes, with shared values and a deep commitment to promoting peace, liberty and prosperity.” Morrison described his visit as “a valuable opportunity to further strengthen our security and economic partnership.” At the White House, he held a bilateral meeting with Trump. The meeting was followed by a news conference with the two leaders and, Friday night, the formal state dinner. On Sunday, Trump and Morrison will tour a new Pratt Industries paper-recycling mill in Wapakoneta, Ohio. The plant is owned by Australian billionaire Anthony Pratt, who has been a prominent Trump supporter. More: Think America can ditch Trump in 2020? The world says otherwise At a news conference following their meeting, Trump said they chatted about the military, trade and \"everything you can talk about.\" China is Australia’s leading trade partner and the U.S. is one of its closest allies, so the Aussies are uncomfortably caught in the middle of Trump’s trade war with Beijing. The trade war “hasn’t had a big impact yet in Australia, except maybe to dampen some business confidence,” said Alan Tidwell, director of Georgetown University’s Center for Australian, New Zealand and Pacific Studies. “The Australian economy was beginning to show a little fatigue even before the trade war got under way.” Australia has agreed to join U.S.-led operations patrolling the Strait of Hormuz following Iran’s seizure of tankers passing through the critical waterway earlier this summer, so that likely was part of the discussion, along with last weekend’s crippling drone and missile strikes on Saudi Arabia’s oil facilities, Tidwell said. More: France's Emmanuel Macron hopes to set up meeting between Donald Trump and Iran in 'coming weeks' The guest list for the dinner — the first for an Australian prime minister since George W. Bush hosted one for then-Prime Minister John Howard in 2006 — included a number of prominent Australians and Americans. Golfer Greg Norman attended, as did Lachlan Murdoch, executive chairman and chief executive officer of the Fox Corp. Other guests included Australian astronaut Andy Thomas, who chatted with reporters about moon travel; Joseph Hockey, Australia's ambassador of Australia to the United States; and Arthur Culvahouse, the U.S. ambassador to Australia. Several members of the Trump administration and Congress were on the guest list, including Vice President Mike Pence and his wife Karen, presidential adviser Kellyanne Conway, Treasury Secretary Steven Mnuchin, Education Secretary Betsy DeVos, Trump lawyer Rudolph Giuliani, Democratic Sen. Joe Manchin of West Virginia and Republican Sen. Roy Blunt of Missouri. In the Rose Garden, the guests sat at tables covered with a pale yellow tablecloth and white floral arrangements. A large carpet covered the grass on the lawn. Trump delivered a toast in honor of \"a century of loyal and devoted friendship\" between the two countries. \"May our values always unite us,\" he said. In his toast, Morrison raised a glass and celebrated \"100 years of mateship and 100 more.\"",
      "date": "Published 4:00 a.m. ET Sept. 20, 2019 | Updated 9:48 p.m. ET Sept. 20, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Trump signs executive order to eliminate federal student loan debt for disabled vets",
      "url": "https://www.usatoday.com/story/news/2019/08/21/trump-signs-order-eliminate-student-loan-debt-disabled-vets/2078416001/",
      "subtitle": "Many older veterans didn't get the welcome home they deserved. This group is showing them that we care.\n    Militarykind, USA TODAY",
      "author": "Savannah Behrmann and",
      "content": "  President Donald Trump announced Wednesday a new plan to relieve disabled veterans totally of federal student loan debt. \"The debt of disabled veterans will be entirely erased,\" Trump said during his prepared remarks at the American Veterans 75th National Convention in Louisville, Kentucky. \"In a few moments, I will sign a memorandum directing the Department of Education to eliminate every penny of federal student loan debt owed by American veterans who are completely and permanently disabled.\" About half of the roughly 50,000 disabled veterans who are qualified to have their federal student loan debt forgiven have received the benefit because of an application process that has proven burdensome, the administration said. The memo directs the government to develop an \"expedited\" process, which the Department of Education said would mean loans are forgiven unless veterans opt out. Trump addressed a large crowd of veterans at the event, saying, \"You fought courageously for your country, and now we’re fighting courageously for you.\" He also vowed to eliminate \"every penny\" of an average of $30,000 in federal student loan debt for each of about 25,000 disabled veterans. At the conclusion of his address, the president stayed on stage to sign the executive order in front of the crowd, flanked by Secretary of Education Betsy DeVos, among others. “That's hundreds of millions of dollars in student debt held by our severely wounded warriors. It's gone forever,” Trump said.",
      "date": "Published 6:26 p.m. ET Aug. 21, 2019 | Updated 6:34 p.m. ET Aug. 21, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Betsy DeVos: It's not about me, it's about students",
      "url": "https://www.usatoday.com/story/news/education/2019/05/06/betsy-devos-education-secretary-schools/1120719001/",
      "subtitle": "null",
      "author": "David Jesse",
      "content": " BALTIMORE — While the media may focus on U.S. Education Secretary Betsy DeVos, she told the nation's education reporters Monday that the focus should be on students and families. \"As much as many in the media use my name as clickbait or try to make it all about me, it’s not,\" she said. \"Education is not about Betsy DeVos nor any other individual.\" Defining herself as a conservative with a distrust of government, DeVos used her appearance at the Education Writer's Association annual conference to promote her Education Freedom Scholarships and to continue her call for a redefinition of public schooling. \"It should surprise no one that I am a common-sense conservative with a healthy distrust of centralized government,\" she said. \"Instead, I trust the American people to live their own lives and to decide their own destinies. That’s a freedom philosophy.\" For DeVos, a wealthy former Michigan Republican Party chairwoman whose Cabinet term has been marked with controversy, that means giving students and families the choice to move between schools. She says this will force traditional public schools to innovate and get better. Betsy DeVos roundtable: High school journalists were blocked from Betsy DeVos event. So, they wrote about it What we know: Betsy DeVos wants to cut Special Olympics funds and people are outraged It's a familiar mantra for DeVos, who pushed the establishment of charter schools in Michigan and helped to push an unsuccessful school vouchers ballot question in Michigan. She has proposed an Education Freedom Scholarship, which would use private scholarships to allow students who couldn't normally afford it to go to private schools. It ties in with DeVos' broader philosophy. \"Let’s stop and rethink the definition of public education,\" she said. \"Today, it’s often defined as one type of school, funded by taxpayers, controlled by government. But if every student is part of 'the public,' then every way and every place a student learns is ultimately of benefit to 'the public.' That should be the new definition of public education.\" DeVos furthered her push for school choice under questioning from New York Times reporter Erica Greene. \"More choices and more freedom in education will ultimately mean better schools overall, even a neighborhood traditional public schools,\" DeVos said. \"Having the ability to direct where resources go on the child or family level helps families become wise consumers.\" During the question-and-answer period with the reporters, a Michigan-based reporter asked DeVos about Detroit schools and the charter schools in the city, which have a generally poor record, as does the Detroit traditional school system and why DeVos hadn't visited the city to talk to families about the schools. DeVos was instrumental in pushing Michigan's charter school law, including through political action groups and donations to Michigan legislators. DeVos said she had been to Detroit schools before she was Education secretary. She also said she doesn't think Michigan has true education \"freedom.\" She added that she hoped that would change. Teacher of the year: Kentucky's 2019 teacher of the year shuns White House visit in protest of Trump Campus sexual assault: Students accused of sexual assault are suing colleges — and winning most of the time DeVos was also asked about private, for-profit companies that run charter schools and make profits off doing so, sometimes by skirting laws. DeVos said all public schools — charter and traditional — must follow laws, but said the bigger thing to focus on is why there are waiting lists in many places for charter schools and why more of those schools aren't available. In other news, DeVos said: Follow David Jesse on Twitter: @reporterdavidj ",
      "date": "Published 3:13 p.m. ET May 6, 2019 | Updated 4:43 p.m. ET May 6, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "'Inexcusable failure': Chicago schools mishandled sex abuse claims, federal probe finds",
      "url": "https://www.usatoday.com/story/news/nation/2019/09/12/chicago-schools-mishandled-sex-abuse-claims-violated-title-ix-probe/2300861001/",
      "subtitle": "null",
      "author": "Grace Hauck",
      "content": " CHICAGO – The nation’s third largest public school district violated Title IX by failing to respond promptly and equitably to complaints alleging sexual harassment, federal education officials announced Thursday, concluding a years-long investigation. The federal probe revealed that the district's \"patchwork\" and disorganized investigations into sexual misconduct were poorly managed and were often conducted by staff who were not properly trained. The probe pertained to 2,800 student-on-student sexual harassment complaints and 280 adult-on-student complaints at over 400 district schools across four school years. Chicago Public Schools on Wednesday voluntarily entered into an agreement with the U.S. Department of Education to take steps to begin to address concerns identified by the probe, the department's Office of Civil Rights said in a release Thursday. \"For years, the district’s management, handling and oversight of complaints of student-on-student and adult-on-student sexual harassment have been in a state of disarray, to the great detriment of the students the District is responsible for educating,\" the release said. Consider this: The murder of 9-year-old Tyshawn Lee horrified Chicago. Now, gang members will stand trial CPS failed to respond promptly and equitably to complaints; did not provide services and remedies to the complainants; did not notify the complainants of investigation outcomes; and did not take effective action to provide a safe environment for all students, according to a DOE press release. The probe noted that the district did not have a Title IX coordinator from 1999 to December 2018 and that the coordinators who followed did not have full authority to carry out their responsibilities, among other concerns. Title IX of the Education Amendments of 1972 prohibits discrimination on the basis of sex in education programs and activities that receive federal funds, obliging schools districts like CPS to respond promptly and equitably to allegations of sex-based harassment. \"The Chicago Public Schools have inexcusably failed, for quite some time, to provide their students with the basic protections required by law. I am glad that CPS has now agreed to make a number of serious, substantive changes to come into compliance with Title IX,\" said Kenneth L. Marcus, assistant secretary for civil rights, in the Department of Education news release. Click here to read more about the investigation. The investigation began in 2015 but grew in 2018 after the Chicago Tribune documented more than 500 police reports of sexual assault or abuse of a child inside a Chicago public school during the prior decade. District CEO Dr. Janice K. Jackson addressed the findings in a letter to the CPS community Thursday. \"While we have made significant progress, we will not be satisfied until I and every CPS parent believes we have created a safe and supportive district culture,\" Jackson wrote. Jackson noted in the letter that CPS began addressing many of the investigation's findings in June 2018, when the district implemented a Comprehensive Plan of Action to bolster protections of students. The plan strengthened the district's Title IX procedures. Secretary of Education Betsy DeVos promised accountability Thursday. \"The failures of Chicago Public Schools were widespread, glaring & heartbreaking. Too many innocent students suffered because adults didn’t do their jobs. We will continue to ensure every student can learn in a safe environment & hold schools accountable,\" DeVos said in a Tweet. The Office of Civil Rights is requiring CPS to: The Office of Civil Rights has given CPS a Nov. 27, 2019, deadline to submit documents demonstrating that the district has made required structural changes. Follow Grace Hauck on Twitter at @grace_hauck.",
      "date": "Published 2:08 p.m. ET Sept. 12, 2019 | Updated 2:36 p.m. ET Sept. 12, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "51 attorneys general call on Betsy DeVos to cancel up to 42,000 disabled veterans' student debts",
      "url": "https://www.usatoday.com/story/news/politics/2019/05/25/attorneys-general-ask-devos-cancel-student-debt-up-42-000-disabled-vets/1235996001/",
      "subtitle": "Education Secretary Betsy DeVos defends deep budget cuts to programs including Special Olympics while urging Congress to spend more on charter schools\n    USA Today",
      "author": "Nicholas Wu",
      "content": " WASHINGTON — In a letter sent to Education Secretary Betsy DeVos on Friday evening, 51 attorneys general called on the Education Secretary to automatically cancel disabled veterans' student debt, something that is not currently done by the Department of Education. \"We write to...urge the Department of Education to take prompt action to satisfy its statutory mandate to discharge the student loans of veterans who are permanently and totally disabled or otherwise unemployable,\" wrote the attorneys general. \"As a nation, we have a moral obligation to assist those who have put their lives on the line to defend us.\" The group included attorneys general from 47 states, three territories, and the District of Columbia. Alabama, Arizona, and Texas did not sign on. More: Buttigieg's huge student debt Three fast facts: Robert F. Smith gift to Morehouse highlights burden of student loan debt In April last year, DeVos announced a new partnership between the Departments of Education and Veterans Affairs that would match borrowers in the Department of Education's records system with disabled veterans in the Department of Veterans Affairs records system. People deemed eligible for loan discharges would be mailed a letter including an application for \"totally and permanently disabled\" (TPD) status. Under the Higher Education Opportunity Act of 2008, if student borrowers die or become permanently disabled, they are eligible to have their loans forgiven, so a successful granting of TPD status would allow for the complete discharge of student loans. The attorneys general argued that automatically canceling the student debt would benefit veterans whose severe disabilities might prevent them from filling out the necessary forms. Like what you’re reading?: Download the USA TODAY app for more Education Department spokesperson Liz Hill told Politico that “while ‘automatic discharge’ may seem like a simple solution, there are long-term impacts we want all veterans to have the chance to consider before their loans are discharged.” Hill also cited \"potential state and local tax liabilities\" that could burden veterans after their loans were forgiven and veterans' potential inability to take out other student loans in the future if their current ones were forgiven. Anticipating this criticism, the attorneys general wrote that \"we think it likely that most borrowers would prefer to have one hundred percent of their outstanding loans discharged, even if this resulted in an increase to their state tax bill,\" though they considered adding a way to opt out of the automatic loan forgiveness. According to a FOIA request filed by Veterans Education Succes, an advocacy group, with the Department of Education, more than 42,000 veterans are eligible for TPD status, but fewer than 9,000 people had applied as of the beginning of May 2018, More than 25,000 eligible veterans were in default.",
      "date": "Published 2:58 p.m. ET May 25, 2019 | Updated 9:25 a.m. ET May 29, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Betsy DeVos used personal email for work in 'limited' cases, according to internal investigation",
      "url": "https://www.usatoday.com/story/news/nation/2019/05/20/betsy-devos-emails-investigation-limited-personal-accounts/3748270002/",
      "subtitle": "U.S. Education Secretary Betsy DeVos said the Federal Commission on School Safety —established in response to the deadly Parkland shooting — won’t look into the role of guns in school shootings\n    Time",
      "author": "Kristin Lam",
      "content": " Education Secretary Betsy DeVos used her personal email accounts for government business in \"limited' cases and did not always properly save messages, according to an internal investigation released Monday. The report said DeVos sent or received fewer than 100 messages on four personal email addresses during her first 15 months in office, joining other Trump administration officials in improper email practices. DeVos sent six emails on private accounts, including five about official business. according to the report. Investigators could not prove she followed federal law on saving official emails created on personal accounts. “We did not identify any instances where the secretary forwarded emails from her personal accounts to her department email accounts,” the report said. It added that “the secretary’s emails related to government business were not always being properly preserved.” Charters: DeVos calls for more charter schools even as they spark investigations across the country Betsy DeVos: It's not about me, it's about students Department rules forbid employees from using personal emails for work except when their government accounts are unavailable. In those cases, employees must forward the messages to their work accounts within 20 days. In all, the Education Department's Office of Inspector General concluded there was no evidence of “active or extensive” use of DeVos’ personal email. Her office told investigators it was taking “additional steps to identify and preserve” emails in her personal accounts. Most of the fewer than 100 emails linked to DeVos' personal accounts were from the first six months of 2017, soon after DeVos took office, the inquiry found. Most were also from a single unidentified person recommending candidates for agency jobs. Ironic twist: Now Trump's team has to deal with private email questions Report: Ivanka Trump sent hundreds of messages from personal email account, according to report The report noted other emails were from people who congratulated DeVos or offered other job advice. House Democrats requested the review in October 2017, but the inspector general’s office said it began work “well into 2018” because of staffing challenges. Other Trump administration officials who have faced questions about private emails include Ivanka Trump, Jared Kushner, former chief of staff Reince Priebus and former senior adviser Steve Bannon. Contributing: The Associated Press",
      "date": "Published 9:12 p.m. ET May 20, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Washington Monument reopens, iOS 13 rollout: 5 things you need to know Thursday",
      "url": "https://www.usatoday.com/story/news/2019/09/19/washington-monument-reopens-ios-13-student-loans/2347662001/",
      "subtitle": "On Tuesday, Apple unveiled its iPhone 11, the iPhone 11 Pro and the iPhone 11 Pro Max as well as the latest Apple Watch Series 5.\n    Harrison Hill, USA TODAY",
      "author": "",
      "content": "Twelve Democratic presidential candidates will participate in a climate town hall Thursday and Friday at Georgetown University. Dubbed \"Climate Forum 2020,\" the event comes after the U.N. Intergovernmental Panel on Climate Change warned that carbon dioxide emissions need to fall by as much as 45% from 2010 levels by 2030 to avoid a climate change apocalypse.  Several top Democrats have yet to confirm their participation, including former Vice President Joe Biden, Sens. Elizabeth Warren, Kamala Harris and Amy Klobuchar, as well as former Texas Rep. Beto O'Rourke. The conversation will be moderated by MSNBC hosts Chris Hayes and Ali Velshi. The Trump administration is revoking California's waiver on auto emissions, a move that would undercut the state's decades-long ability to set stringent standards on tailpipe discharges. Officials with the Environmental Protection Agency (EPA) and the Department of Transportation have scheduled a joint news conference Thursday to announce details of the decision. EPA officials sent the state a letter last week warning that the tougher emission rules violate federal law. Several other states had considered adopting California's standard, and four automakers — Ford, Volkswagen, BMW and Honda — signed an agreement this summer embracing the lower emission requirements, drawing a rebuke from President Donald Trump. State officials are threatening to sue the administration over the move. Prefer to listen? Check out the 5 things podcast: iOS 13: Apple rolls out new features for iPhones Apple on Thursday officially releases iOS 13, the freshest version of its mobile operating system, which is compatible with models dating back to iPhone 6s and 6s Plus. Some of its new features include an optional darker design aesthetic, \"look around\" Maps, and a Photos app makeover with new editing tools for video. There's also a new \"Sign in with Apple\" service that's billed as an alternative to instant sign-on with Facebook or Google, with less sharing of our personal data with app makers. (Here are 13 hidden ways Apple's new software can breathe life into your aging iPhone.) The iOS launch comes a day before the official release of Apple's new iPhone 11 models. After three long years, the Washington Monument is ready to welcome tourists. The 555-foot marble obelisk honoring America's first president will reopen Thursday morning. The monument will be open daily from 9 a.m. to 5 p.m.The tallest structure in Washington, the monument has been closed to the public since 2016. During that time, construction crews updated its elevator system and built a new security screening facility. Out of control? Student loan debt hits all-time high The class of 2018 graduated college a little deeper in debt than the classes before them, a new report released Thursday finds. The average bachelor's degree holder owes about $29,200, about a 2% increase from the class of 2017, according to a newly released report by the Institute for College Access and Success. The conversation surrounding the nation’s $1.6 trillion of student loan debt has never been louder with Democratic presidential hopefuls, including U.S. senators Elizabeth Warren and Bernie Sanders, proposing sweeping plans that would reduce the price of college.  The Institute for College Success and Access collected data from about half of all public and private, not-for-profit universities for its report, and it says the figures represent more than 70% of all graduates.",
      "date": "Published 3:03 a.m. ET Sept. 19, 2019 | Updated 7:33 a.m. ET Sept. 19, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Donald Trump vs. Boris Johnson: America could get off easy compared with Britain",
      "url": "https://www.usatoday.com/story/opinion/2019/09/19/donald-trump-boris-johnson-volatile-dangerous-cynical-column/2347040001/",
      "subtitle": "null",
      "author": "",
      "content": "This is a tale of two cynics: Donald Trump and Boris Johnson. They’re equally volatile and dangerous, but they afflict their two nations differently. Trump is a president who says a hurricane is threatening Alabama when, actually, it isn't; who believes wind turbines cause cancer; who purges references to climate change in government reports; and on, and on. He doesn’t read, and he likes to be surrounded by ignoramuses. Few of his lieutenants are appointed for their expertise. Dr. Ben Carson, a former neurosurgeon, knows nothing about housing policy; Betsy DeVos is the Education secretary who visited the nation’s largest school district and didn't stop at a single public school. And few of Trump’s notions are original: They are the fancies of his evangelical-oligarchic-Fox News alliance, who believe that climate change is either nonexistent or part of the cosmic order of things, that America is “infested” by nonwhites, that open-carry laws save lives, and so on. But among eminences, Trump stands out as a weirdo. His contempt for knowledge would not fly at the top of a serious business. His economic advisers are outliers. And his reversals cause whiplash. When Trump named Exxon Mobil CEO Rex Tillerson as secretary of State, for instance, he commended him for his “tenacity, broad experience and deep understanding of geopolitics.” When he fired Tillerson after a year in office, he tweeted that Tillerson was “dumb as a rock” and “lazy as hell.” By contrast, the wild spins of Britain’s new prime minister, Boris Johnson, do not betray his class. They express its follies and foibles. Johnson and most of his predecessors learned the arts of debate, slapdash generalization and high-level schmoozing at Oxford. They cultivated “debating skills and ambition without a cause,” in the words of the Financial Times’ Simon Kuper. Eventually, the future anti-Europe campaigners would forge what Kuper calls “a cross-class alliance with (Brexit Party leader) Nigel Farage and the tabloids.” Johnson even knows how to go lowbrow, having recently boasted: “The madder Hulk gets, the stronger Hulk gets.” Such cocky men (almost entirely men) stand for an entire class that journalists James Ball and Andrew Greenway write about in their book, \"Bluffocracy.\" They run Britain’s politics, civil service and media — “people who are bluffing, winging it, obsessed with process over substance, and dominated by short-termism.” Ball has referred to Johnson’s career as “the politician-as-nihilist: a genteel version of Donald Trump’s post-truth politics, reliant on charm to get away with an approach to the truth (that) could be set out as flexible.” Trump was once charming, I’m told, but he must have lost the knack. Certainly he never had the knack of argument. One difference between the British and American versions of fakery is that the Brits practice argument as a game. They tend to talk well and write well. Most attended fancy private schools (which, perversely, the Brits call “public”), before going on to Oxford, which serves as “the bluffer’s finishing school.” Unintended consequences: Trump is proving publicity can be bad. From Twitter to Fox News, he's walked into a trap. (Thus, en route to Oxford, Johnson headed Eton’s debate team.) They learn how to defend any old proposition. (In 2016, Johnson, still a columnist, prepared two columns, one published and pro-Brexit, the other unpublished and anti-Brexit, to be ready for all contingencies.) At Oxford, they acquire a style of knowledge that, for them, is “another form of trickery — intellect being a quality that should run a mile wide, if only an inch deep.” Actual skill and expertise are, in the bluffocracy canon, disposable. As Michael Gove, Johnson’s fellow Oxford University graduate and Cabinet minister, put it, “People in this country have had enough of experts.” Never mind that a University of Sheffield survey — real data — refutes his claim. In the long run, the UK's bluffocracy may prove even more toxic and deeply rooted than our own political afflictions. Anthony Barnett, writing in openDemocracy, cautions that Johnson is not really an insouciant free spirit. However slapdash his maneuvers, such as comic photo opportunities with a bull and a kipper, there’s an underlying consistency: \"Their aim (is) to encourage us to lower our guard and regard his government as irrational bluster and boosterism. Whereas he and his hedge-fund backers seek to turn us into the playthings of deregulated capitalism.” Exit strategy: A Donald Trump coup if he loses in 2020? With all the norms he's busted, don't rule it out In this sense, America could get off relatively easy. Next year, Trump may be discarded as a whacked-out disturbance — if, once defeated, he agrees to go quietly. Donald Trump doesn’t speak for a whole class; he embarrasses them as he enriches them. We have a Constitution, centuries old, and flawed, as it is. In principle, violations are punishable by Congress. Boris Johnson’s crowd will prove harder to dislodge. Todd Gitlin, a professor of journalism and sociology, is chair of the Ph.D. program in Communications at Columbia University. Follow him on Twitter: @toddgitlin",
      "date": "Published 6:00 a.m. ET Sept. 19, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Because of Larry Nassar, Michigan State has the most rapes reported in a year in campus safety report",
      "url": "https://www.usatoday.com/story/news/education/2019/10/03/michigan-state-university-clery-report-most-rapes-reported-2018/3850652002/",
      "subtitle": "Simone Biles speaks out against USA Gymnastics for not protecting its athletes from convicted sexual predator Larry Nassar.\n    USA TODAY",
      "author": "David Jesse",
      "content": " DETROIT – Michigan State University set a record it wants no part of – the most rapes reported by a university on its annual Clery Act report. There was a total of 1,013 rapes reported across all campuses, most attributed to Larry Nassar. Clery Act report: MSU cited for 'serious noncompliance' with federal campus safety law related to Larry Nassar case Record fine: Michigan State to pay record $4.5 million fine in Larry Nassar sexual assault scandal That's a record for any higher education institution in one year, said S. Daniel Carter, president of Safety Advisors for Educational Campuses, who has monitored Clery Act reports since schools were required to start reporting crime stats in 1992. A decade ago, all campuses nationally reported no more than 3,000 sexual assaults total, Carter said. Nassar was a doctor at Michigan State University, as well as the team doctor for USA Gymnastics. He was sentenced to 60 years in federal prison on child pornography charges. He faces a 40- to 175-year sentence issued in Ingham County, Michigan, and a 40- to 125-year sentence from Eaton County, Michigan, for sexual assaults. Those sentences will not begin until he finishes the federal sentence. The university settled lawsuits by more than 300 survivors with a payment of $500 million. Other lawsuits are pending from more than 100 people. Late last month, the university said in legal filings it shouldn't be held legally responsible for Nassar. \"Although Nassar’s actions were repugnant and merit the heavy criminal penalties imposed upon him, the law does not support Plaintiffs’ attempts to hold the MSU Defendants liable for his wrongs,\" the university said in a court filing of more than 100 pages, backed by nearly 900 pages of exhibits. Nassar survivor: She surrendered her secrets to put away a sexual predator. But her sacrifice isn't over Lou Anna Simon: Larry Nassar is guilty of sexual assault. Did Michigan State's ex-president lie to police about him? Other major universities reported large numbers  after scandals involving doctors abusing and assaulting students. \"Ohio State University is facing a somewhat similar situation in the Dr. (Richard) Strauss case,\" Carter said. Strauss was a former wrestling team doctor at Ohio State. \"The University of Southern California is likewise bulk reporting incidents from their Dr. (George) Tyndall case,\" Carter said. Tyndall was a former campus gynecologist. Last month, Michigan State was fined $4.5 million – a record fine – for its failures in the Nassar case, including violations of the Clery Act, by the federal Department of Education. \"What happened at MSU was abhorrent. ... So was the university's response to their crimes,\" U.S. Education Secretary Betsy DeVos said, referring to Nassar and his boss, William Strampel, former osteopathic college dean. The report said the school must hire an outside law firm to review all sex assault case decisions made by the school's Title IX office and issue a report to the federal government. MSU's board and president must receive a regular report of all cases and decisions. MSU must conduct a sweeping investigation into who knew what and didn't act on Nassar or Strampel, who was convicted of criminal charges. That includes former MSU President Lou Anna Simon, who faces criminal charges of lying to police in the Nassar investigation; former Provost June Youatt, who knew for years of sexual harassment claims against Strampel and cleared him; along with the associate vice president for academic human resources; employees of the Office of the General Counsel; and the former head coach of the women's gymnastics team. Follow David Jesse on Twitter: @reporterdavidj",
      "date": "Published 11:53 a.m. ET Oct. 3, 2019 | Updated 3:53 p.m. ET Oct. 3, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "College student loans: Debt hits a new high in 2018, though growth slows, as free tuition plans spread",
      "url": "https://www.usatoday.com/story/news/education/2019/09/19/college-student-loan-average-debt-forgiveness-free-tuition-crisis/2368805001/",
      "subtitle": "Caitlin Boston paid off $222,817.26 in student loan debt over the course of 10 years.\n    USA TODAY",
      "author": "Chris Quintana",
      "content": " Correction: A prior version of this story misspelled the name of Mark Huelsman, an associate director of Demos. About 2 in 3 members of the class of 2018 graduated a little deeper in debt than the classes before them. Last year’s graduates with a bachelor’s degree averaged about $29,200 in student loan debt – a record in the USA. That is about a 2% increase from the class of 2017, whose members graduated with an average debt of $28,650, according to a new report by the Institute for College Access and Success. The growth of student loan debt has slowed, but the institute said college affordability remains an “urgent concern.” \"Millions of students continue to struggle with their debts,\" said the group's executive vice president, Debbie Cochrane. She credited states' investments in public colleges with the slower growth in debt loads. The conversation surrounding the nation’s $1.6 trillion of student loan debt has never been louder. Democratic presidential hopefuls, including U.S. Sens. Elizabeth Warren of Massachusetts and Bernie Sanders of Vermont, proposed sweeping plans they said would eliminate billions in student loan debt while greatly reducing the price of college. Betsy DeVos on loan forgiveness: Rule change means college students must fight for forgiveness A few state schools have tried introducing aid programs meant to ease the burden for low- and middle-income students, including the University of Michigan and University of Virginia. New York offers free tuition to residents who earn up to $125,000, and New Mexico Gov. Michelle Lujan Grisham proposed a free tuition plan for any state resident who attends a public institution, regardless of income. Critics of such plans say a bachelor's degree generally results in higher lifetime earnings for students, and roughly $30,000 in debt may be a reasonable price to pay for the greater earning power it brings. They say money spent on \"free\" college might be better spent elsewhere, such as on health care. The Institute for College Success and Access collected data from about half of all public and private, not-for-profit universities for its report, and it said the figures represent more than 70% of all graduates. (For-profit colleges were not included because \"virtually no for-profit colleges report what their graduates owe.\") Some for-profit colleges have closed: How to keep it from happening to you The debt loads vary heavily by region. Borrowers who attended college in the Northeast had the highest average debt, whereas those in the West graduated with the lowest. Connecticut had the highest average, $38,650, and Utah had the lowest at $19,750. Black students and those from low-income backgrounds were more likely to have debt at graduation, the report says. About 17% of the debt comes from private student loans, which generally have higher interest rates and fewer protections than those issued by the federal government. To reduce student debt loads, the institute offered numerous suggestions, including: If the method of paying for higher education remains the same, average student debt is likely to continue to rise, according to Mark Huelsman, an associate director at Demos, a left-leaning think tank, who studies student debt. The slowed growth, he said, might be thanks to some families' ability to pay for college after rebuilding some of their wealth after the recession. Unemployment is low, which means people have jobs to help pay off their loans. A few decades ago, it was unusual to graduate with a lot of debt. The growth in debt loads is especially troubling, Huelsman said, given how diverse college students are compared with the predominately white classes of the past. “We have depressed ourselves into a mindset in which $30,000 in debt is acceptable for a degree,” Huelsman said. Jason Delisle, a fellow at the right-leaning American Enterprise Institute, said he doesn’t expect that figure to change substantially, even after the introduction of increased financial aid at public colleges. Students, he said, often use the loan money to help cover living expenses and other costs associated with college. Many students use federal loans to pay for private colleges, which are unlikely to be affected by free college plans. “There’s still a lot of demand for loans that are a really good deal,” thanks to low interest rates, Delisle said. Monthly payments can be rather affordable, too, depending on the repayment option each borrower chooses. A typical borrower earning $35,000 and paying back a $29,200 federal loan could pay  $136 to $310 a month over 10 to 16 years, according to the federal government repayment calculator. Education coverage at USA TODAY is made possible in part by a grant from the Bill & Melinda Gates Foundation. The Gates Foundation does not provide editorial input.",
      "date": "Published 12:01 a.m. ET Sept. 19, 2019 | Updated 4:21 p.m. ET Sept. 19, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Six-figure parent loans: When college dreams for students mean nightmarish debt for family",
      "url": "https://www.usatoday.com/story/news/education/2019/10/10/student-loans-financial-aid-debt-parent-plus-loan-college-hbcu/3916173002/",
      "subtitle": "Bernie Sanders and Elizabeth Warren are already vowing to do something about student loan debt. This is why the $1.6 trillion issue could play a big part in the 2020 election.\n    Just the FAQs, USA TODAY",
      "author": "",
      "content": "ATLANTA – While Aaron Greene was packing to head back to Clark Atlanta University for his junior year, he stumbled upon a college bill at his mother’s house in Stone Mountain, Georgia. The number was so large that he figured it had to be a phone number. “I know my mother is not paying this much money for school,” he said. “We don’t have that.” Though his mother, Di-Anne, already had $40,000 in student loans from her own graduate school education, she has taken out $42,000 in Parent PLUS Loans for Aaron – and she had kept him in the dark about the cost. “I didn’t want to give him the pressure of starting out in college, worrying about grades as well as the finances,” she said. “But I probably should have (told him) so that he could get a better understanding of the sacrifice that’s been made.” Student loans: Debt hits a new high in 2018, though growth slows Parent borrowing is a sacrifice many black parents make to pay for their children’s college education, and it is especially prevalent among families whose children attend historically black colleges and universities. The federal government’s Parent PLUS program helps make attending college a reality, closing the gap between the cost of college and what the student receives in grants and other loans. Though it may sound like a lifeline, the Parent PLUS Loan program can cause economic complications for families. The loan program was introduced in the 1980s as a way for middle- and upper-income parents to help their children pay for college while keeping their assets liquid. It has since become more popular among lower-income parents. That's possible because the program does not check the ability to repay, considering only the borrower's credit history. When parents borrow, the debt can weigh down families for generations. But the burden falls particularly hard on low-income black families. Few white families with low incomes take out the loan – just 10% of white Parent PLUS borrowers earn $30,000 or less. Comparatively, 40% of black Parent PLUS borrowers have incomes that low. Atlanta colleges illustrate this dichotomy of borrowing. Parents of students at three of the city’s historically black colleges – Clark Atlanta University, Morehouse College and Spelman College – combined took out more than $102 million in Parent PLUS Loans in 2018. Meanwhile, parents of students at majority-white Emory University – which has nearly the same number of students as those three historically black colleges and universities together – borrowed only $7 million in Parent PLUS Loans that year. Parents borrowing for their children’s education isn’t new. The program has existed long enough for families to see one of the consequences of taking out large loans: generations of overlapping debt. In Texas, Prairie View A&M University graduate Tania White needed her mother to take out Parent PLUS Loans for her undergraduate education 30 years ago. White’s mother borrowed $12,000 for White’s three years of college. She is still paying it back. Since White’s graduation in 1992, her mother’s debt has accrued to more than $100,000. White said the interest rate on Evans’ $100,000 debt is about 9%. “You know how something is so outrageous where you have no expression or feeling behind it? That’s where we are with that,” White said, remarking that paying back student debt has become a routine for her family. Loan forgiveness: Betsy DeVos rule change means college students must fight for it Despite seeing her mother’s debt accumulate, White resorted to Parent PLUS Loans to pay for her daughter’s trip to study abroad. White now owes more than $200,000 between her own and her children’s student debt. This generational pattern of borrowing is not uncommon, since the Parent PLUS program casts debt across all generations – not just young people affected by federal student loans. “We wanted to be the group that breaks generational poverty,” said Joy Evans, mother of a Paul Quinn College graduate, referring to her family’s three generations of college loan borrowing. Intergenerational student debt may be a product of the length of time it takes families to repay the hefty loans. Parent PLUS Loans often take five to 20 years to repay because many of the borrowers are approaching retirement age, leaving less opportunity for promotions or time for them to accumulate enough money. As a result, some parents said they hope their children will help pay off the PLUS Loans after they graduate. For instance, one father took out Parent PLUS Loans for his youngest daughter to attend Coppin State University in Baltimore. “I’m concerned and a little worried about the debt,” said Perry Collins. But “it is our hope that (our children) will get to the point where they can provide for themselves.” Collins said his debt is accumulating quickly between a mortgage and his children’s student loans. He hopes his children will help pay off the debt. This woman's dad couldn't help her: She paid off over $222K in student debt anyway. This is how she did it. Families that attend HBCUs are a prime example of the program’s consequences, Collins said, “because it’s the less privileged and less wealthy that are sending their children out to these things and that’s their only means in most cases.” Parent PLUS Loans may add another struggle: instant repayment. Unlike federal student loans, parent borrowers are expected to immediately begin repaying the loan. Depending on how much they owe, the amount could take decades to pay back, furthering the chance of debt overlapping across generations. Morehouse mother Vanessa Manley predicted it will take her and her husband 15 to 20 years to pay back their $30,000 in Parent PLUS Loans, but the loans were worth the investment. “Some parents invest in material things. I invest in my child,” Manley said. Her son started at Morehouse in fall 2019. For many parents, the value of sending their child to an HBCU is worth any cost. They see these institutions as pathways to success. Roderick Hester just dropped off his third daughter at Spelman College. He took out Parent PLUS Loans for each of them. “If this will give my child the best opportunity to be successful in life,” he said, “This was the avenue I had to pursue. There wasn't a lot of options.” Hester owes more than $200,000 in Parent PLUS Loans. “I don't really know how I'm going to pay it back, but I'm planning on it,” Hester said. “Whatever I need to do is what I have to do.” Some parents consider HBCUs a unique opportunity for their children to experience a predominantly black environment. In order to pay for her son’s first two years at Morehouse, Carmelita Farrah borrowed $70,000 in Parent PLUS Loans. The idea that he would “experience his heritage” at Morehouse trumped her financial strain. “The obstacles are stacked against him as a black man, so what will set them apart?” she said. “Hopefully an education. After that, a career. Because it’s a struggle. It really is.” At Morehouse’s graduation ceremony last May, billionaire Morehouse alum Robert Smith brought national attention to the student loan problem at HBCUs when he made a surprise announcement at graduation: He said he would pay off every 2019 graduate’s student loans. Morehouse later said that gift would include Parent PLUS Loans. Student debt: What about those of us without a billionaire? Frank Lawrence Jr., a Morehouse Alumni Association member and 2019 graduate whose debts were cleared by Smith’s gift, said the Alumni Association is “trying to encourage more alumni to give back.” Other HBCUs have employed their own strategies to reduce student debt. In 2015, Paul Quinn College implemented a work-study model. The number of parents borrowing PLUS Loans has decreased over the four years since the program’s launch, according to President Michael Sorrell. In addition to institutions trying to lower college debt, the nonprofit United Negro College Fund reported that this year alone, it is providing nearly $100 million in scholarships to more than 7,200 students of color. Not every student wins a scholarship, though. “Loans are almost necessary without any scholarships, but students and their families have to shop around to find the best loans for them,” said Brian Bridges, UNCF’s vice president of research and member engagement. “Parent PLUS Loans are an essential college financing option for some students and parents that can be improved; however, the program must be repaired, not repealed,” Bridges added. Other experts agree that the Parent PLUS program should be improved. The program is “doing a huge disservice to students of color and families of color when we’re saying that they can borrow however much they want,” said Colleen Campbell, director for postsecondary education at the liberal think tank American Progress. Campbell added that families should not be allowed to spend more than they can contribute. “If a family can only contribute $5,000 to their student’s education in a year,” Campbell said, “that’s probably the amount you should allow them to borrow.” For families that have used the federal Direct PLUS Loans, or are considering the loan, experts offer advice about how to navigate the process and make decisions appropriate for their specific case. Lodriguez Murray, vice president of public policy and government affairs for the United Negro College Fund: Rachel Fishman, deputy director for research with the Education Policy Program at New America. Colleen Campbell, director for postsecondary education at the Center for American Progress: Noah Broder This story was reported by Holly Barker, Noah Broder, Josephine Chu, Ebony Curry, Andre Earls, Apoorva Mittal, Lu Zhao and Priscilla Zhu. It was written by Ariana Puzzo and Kelly Rissman. Open Campus, a nonprofit news organization focused on higher education, contributed to this project.",
      "date": "Published 6:00 a.m. ET Oct. 10, 2019 | Updated 1:27 p.m. ET Oct. 10, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "The Trump administration is repealing an Obama-era policy of policing for-profit colleges",
      "url": "https://www.usatoday.com/story/money/2019/06/28/trump-department-education-devos-remove-gainful-employment-rule/1601251001/",
      "subtitle": "Education Secretary Betsy DeVos defends deep budget cuts to programs including Special Olympics while urging Congress to spend more on charter schools\n    USA Today",
      "author": "",
      "content": "WASHINGTON – The U.S. Education Department is rescinding an Obama-era rule that aimed to police ineffective for-profit colleges. Department officials said Friday that the 2014 gainful employment rule will be removed entirely effective July 1, 2020. The rule sought to cut federal funding for programs that consistently left graduates with high debt compared to their incomes. The department's announcement says the rule focused too much on student earnings and unfairly targeted for-profit colleges. Rep. Bobby Scott, D-Va., chairman of the House Education and Labor Committee, said that removing the rule rather than revising it \"will prop up low-quality for-profit colleges at the expense of students and taxpayers.\" A worthless degree?: Betsy DeVos wants to change rules for colleges College closed, leaving graduates no degree: How to keep it from happening to you The rule has never been enforced by the Education Department, which says it no longer has access to earnings data from the Social Security Administration. A trade group of for-profit colleges is praising the rule change. “The U.S. Department of Education’s final decision commits our nation’s entire higher education system to full transparency. The Department has implemented the most significant consumer protection for all students, in all programs, at all schools in years,\" Steve Gunderson, President and CEO of Career Education Colleges and Universities, said in a statement. \"This standard is universally fair and applies to all students, in all programs, at all schools, regardless of sector – something that previous Administrations did not do.”",
      "date": "Published 5:56 p.m. ET June 28, 2019 | Updated 5:57 p.m. ET June 28, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "A worthless degree? Betsy DeVos wants to change rules for which colleges stay open, close",
      "url": "https://www.usatoday.com/story/news/education/2019/06/21/college-closing-accreditation-betsy-devos-u-s-department-education/1505318001/",
      "subtitle": "Trump's education secretary's plans for reforming U.S. education revolve around charter schools and vouchers.\nVideo provided by Newsy\n    Newslook",
      "author": "Chris Quintana",
      "content": " Going to Brightwood College in the 2018 fall semester was supposed to be a safe bet. So thousands of students enrolled across the country. For those students and others, a degree is supposed to be a lifeline. They sink in time and money that could be spent in the workforce, all for the prospect of higher earnings and a more fulfilling career. But Brightwood students’ investment didn’t pay off. What’s more, a regulatory group had signed off on the college’s programs – only to change its mind. Accreditation, as it’s called, is meant to prevent predatory or shoddy schools from leading students astray. And the Accrediting Council of Independent Colleges and Schools had given its signal to students that Brightwood was a worthwhile investment. Yet in December 2018, the agency revoked the accreditation of Education Corp. of America, which ran the Brightwood locations and other colleges across the country. The closures of dozens of institutions followed swiftly. Students had spent the time and money but still had no degrees and no clear path forward. Don't be one of them: A college closed, leaving thousands without a degree. How to keep it from happening to you Many of them still struggle. In a Facebook group for students of the closed college, some commiserate over what they call worthless degrees. Others try to give advice about how to get their student loan discharged or receive their transcripts. What’s more, the Accrediting Council of Independent Colleges and Schools had a checkered history itself. President Barack Obama's administration had moved to strip it of its powers to OK school programs, but after a legal battle, President Donald Trump's administration undid that move. The Education Corp. of America colleges were just some of the institutions that suddenly closed in recent years. ITT Tech closed in 2016. Corinthian Colleges did the same in 2015. Both had been accredited by ACICS. The accrediting group said it gave multiple warnings, but the colleges weren't able to meet its standards. What happened?: The trouble at for-profit colleges, in 5 graphs Now, the Education Department is looking to change the arcane and bureaucratic process of accreditation. Education Secretary Betsy DeVos  and accreditors of universities say new rules will ultimately allow colleges to offer programs more quickly and effectively. That means students landing a job in fields that are hiring, they say. “With these reforms, our nation’s colleges and universities can spend more time and effort on serving students and less time, energy, and money focused on bureaucratic compliance,” DeVos said in a statement. Critics of the newly proposed rules say they would make it easier for shady colleges to operate for longer and with less federal oversight. Many colleges are already doing a poor job of preparing students, said Clare McCann of the think tank New America. Giving them more latitude under the guise of innovation may lead to students taking chances on junk programs, she argued. “What these regulations really do is make it so it is much harder to hold those schools accountable,” McCann said. If anything, the government should hold these agencies to a higher standard, she said. The public has until July 12 to give feedback on the proposed changes. Here’s what you should know. Did your college close? Why Brightwood College, Virginia College closed — and what students should do To receive federal money, universities must meet the quality standards of an accrediting organization. According to the Education Department, these agencies ensure schools have “qualified instructors, an adequate curriculum, and necessary support services” for students. In other words, they’re meant to prevent students from ending up with worthless degrees. Accreditation can essentially be seen as a seal of quality for students, the government and even future employers. And students atunaccredited colleges can’t access federal money in the form of student loans. The government doesn’t directly accredit schools, but the Department of Education does decide who is and isn’t fit to be an accreditor. The new rules were agreed upon by department officials, accreditors, college leaders and students during several negotiation sessions. Among the changes, the proposed rules would allow colleges to offer new programs with less scrutiny from accreditors. The idea is that colleges could see a hole in the workforce and quickly come up with a new degree or credential to fill it. Accrediting agencies and for-profit colleges like this proposed change. Under the current rules, it may take months to make changes to a program’s curriculum, said Judith Eaton, president of the Council for Higher Education Accreditation. The group is made up of 3,000 colleges, and it focuses on accreditation. The new rules, she argued, would mean a less onerous process for accreditors when dealing with the federal government. And, she said, the new rules may make it so that universities feel free to experiment with, for example, new credentialing programs or increased online courses. If a college or accrediting group abused the new rules, the Education Department should crack down quickly, she said. The proposed rules would also allow schools that have failed to meet accreditation standards up to four years to fix their problems – double the previous amount of two years. The rationale? These changes sometimes take a long time, and allowing the university to fix a problem may lead to more students graduating. Closing an underperforming college right away, in contrast, may leave those students without an education and nowhere to go to finish their degree. That is a change welcomed by Nicholas Kent, a vice president at Career Education Colleges and Universities, a group of for-profit colleges. Critics have said the measure may allow bad colleges to do more damage, but Kent called that description “disingenuous,” saying different programs will have different needs. A nine-month certificate program, he said, will need less time to fix a problem compared with a 6-year-doctoral program. And he said accreditors are not required to give four years to everyone. Instead, they have the discretion to do so, and they can set up other check-ins. But allowing a bad institution to operate longer may mean more students attend the failing institution, wasting time and money. And it could cost taxpayers more money because the school could continue to get federal grants and loans, Antoinette Flores, an associate director at the liberal Center for American Progress, has argued. Plus, she said, the proposed rules could make it easier for outside entities to buy failing colleges. The Department of Education wants to limit a new owner's liability. “In practice, that means we’re never going to see any of these institutions going away,” Flores said. “That increases the likelihood we’re recycling failed, toxic assets in the system, and we’re never really getting rid of the lowest performances.” Want to review the proposed rules yourself?  Visit the Federal Register, where the proposal is available in its entirety. The period for public comment ends July 12, so if you have an opinion, file it on the Federal Register's website. Any rule changes would follow the public comment period. Education coverage at USA TODAY is made possible in part by a grant from the Bill & Melinda Gates Foundation. The Gates Foundation does not provide editorial input.",
      "date": "Published 11:54 a.m. ET June 21, 2019 | Updated 3:50 p.m. ET June 26, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Student loans: Betsy DeVos rule change means college students must fight for loan forgiveness",
      "url": "https://www.usatoday.com/story/news/education/2019/08/30/college-student-loans-loan-forgiveness-betsy-devos-department-of-education/2168669001/",
      "subtitle": "null",
      "author": "Chris Quintana",
      "content": " WASHINGTON – The U.S. Department of Education issued new rules late Friday that could make it more difficult for students to get federal loan forgiveness  if they attended colleges that close suddenly. The rules, which have been known as \"borrower defense,\" have been the subject of controversy for much of Betsy DeVos’ turn as education secretary. She has long sought to overturn the 2016 rules from former President Barack Obama's administration on the grounds that it was too easy for students to seek loan forgiveness. The new rules would require student borrowers to provide more evidence that they had been misled about the college’s outlook and, as a result, can’t find employment. It also shifts more of the responsibility onto students to vet the colleges they attend. “I called for this regulatory reset more than two years ago, as it became clear the old rules just weren’t working,” DeVos said in a news release. “We believe this final rule corrects the wrongs of the 2016 rule through common sense and carefully crafted reforms that hold colleges and universities accountable and treat students and taxpayers fairly.” The new rules apply to loans issued on or after July 1, 2020. The department said the changes would save roughly $11 billion over the next decade – in part because the feds would forgive fewer loans. DeVos is pushing the changes while the national discussion about student loans has never been louder. The nation has about $1.6 trillion in student loan debt, and several Democratic presidential hopefuls have rolled out student loan forgiveness into their platforms. One plan:How much does Warren's debt forgiveness plan cost? A lot. Upping the stakes: What's different about Bernie Sanders' student loan plan? It would help more rich people Critics were quick to voice their concerns on Friday, warning borrowers might struggle to get the Education Department to agree to forgive their loans. The Project on Predatory Student Lending went so far as to say it would have to sue to prevent the rules from taking effect. The department argued the new rules would save taxpayer money while still protecting those who might have been genuinely defrauded. The department also said the new rules discourage borrowers from making false claims in an attempt to game the system. Among the many changes in the 846-page document, borrowers now must apply for loan forgiveness if their college closes suddenly. Before, they were automatically eligible for forgiveness. (The window for applying for forgiveness after a school closes has been extended to 180 days instead of the prior 120.) Groups of people – such as whole classes at a college that’s closing – no longer can file for forgiveness, as they had been able to in the past. Borrowers will also have to provide evidence they searched for a job, including emails that would confirm they had applied for work or attended a career fair. A version of the borrower-defense rules had been in place since 1995, but they weren’t widely used until 2015. That’s about the same time the for-profit Corinthians College closed abruptly, leaving thousands of students with millions in debt. The DeVos department has argued the Obama administration expanded the rules to serve these students. As of March 2019, roughly 180,000 applications for debt forgiveness were awaiting approval, despite court rulings in 2018 ordering the department to act. DeVos has spent much of her time as education secretary focusing on school choice for children. Her emphasis in the higher education sector has been reducing regulations. Critics have said these moves disproportionately benefit for-profit colleges. Earlier this summer, DeVos’ department repealed a rule that would have barred federal money to institutions that burden their graduates with high levels of debt compared with their actual earnings. DeVos has also pushed to loosen the federal rules surrounding college accreditation. The department argued less bureaucratic rigmarole will mean colleges can more quickly place students in high-demand jobs, while critics have said laxer standards could leave students more indebted with worthless degrees. For-profits have attracted close public scrutiny in recent years due to the high-profile and sudden closure of several institutions. In addition to Corinithians, ITT closed in 2016 and the Education Corp. of America’s 75 campuses shut their doors in 2018. Most recently, Argosy University closed earlier this year, leaving thousands of students in the lurch. Education coverage at USA TODAY is made possible in part by a grant from the Bill & Melinda Gates Foundation. The Gates Foundation does not provide editorial input.",
      "date": "Published 7:07 p.m. ET Aug. 30, 2019 | Updated 11:11 a.m. ET Sept. 3, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "No, Betsy DeVos is not going to jail",
      "url": "https://www.usatoday.com/story/news/education/2019/10/08/betsy-devos-jail-sallie-kim-department-of-education-corinthian-college/3912609002/",
      "subtitle": "Trump's education secretary's plans for reforming U.S. education revolve around charter schools and vouchers.\nVideo provided by Newsy\n    Newslook",
      "author": "Chris Quintana",
      "content": " Education Secretary Betsy DeVos is unlikely to go to jail, but the internet might have you think otherwise. The furor online stems from a case involving the now-defunct Corinthian College, a for-profit college that closed in 2015. The U.S. Department of Education had been ordered to stop collecting on the federal loans of students who attended the school. But the departmentdisclosed it had continued to garnish wages and seize tax returns of hundreds of borrowers. Others had erroneously paid money toward the loans when they didn't have to. The judge's order is part of a lawsuit by former students at Corinthian College, who are suing the department with the hope of discharging their student loans. Colleges keep closing: Their students are left without degrees. How to keep it from happening to you Sallie Kim, a federal magistrate judge in California, admonished the department on Monday during a hearing. Among her remarks, she said: \"I am not sending anyone to jail yet, but it’s good to know that I have that ability.” Some interpreted those remarks as though DeVos herself might be facing jail time. And several news outlets ran headlines linking DeVos to time behind bars. In a written order issued Tuesday, Kim wrote the court would consider if “a finding of contempt, or monetary sanctions, or both are warranted.” Her order does not mention jail time. Contempt of court can end in fines or jail time, but people usually obey the court's rule before that. It's hard to see DeVos doing otherwise. In fact, the judge has already given DeVos an out. In her Tuesday ruling, Kim asked both the Education Department and the former Corinthian students to submit responses to the possibility of a contempt order. She also asked them to give some ideas of how the department could \"remedy\" its illegal collection of student loan payments from the former students and ensure it didn't happen again. Angela L. Morabito, the press secretary for the Education Department, said the agency does not comment on ongoing litigation, and that  \"we are working to faithfully comply with the judge’s orders in this case.\" And in previous court filings, the department wrote it was letting borrowers know about the error and issuing refunds. During her tenure as President Donald Trump's education secretary, DeVos has always attracted fierce controversy. She has become especially reviled by critics on the left for her support of school choice and for rolling back federal regulations in higher education. Education coverage at USA TODAY is made possible in part by a grant from the Bill & Melinda Gates Foundation. The Gates Foundation does not provide editorial input.",
      "date": "Published 7:05 p.m. ET Oct. 8, 2019 | Updated 2:04 a.m. ET Oct. 10, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    }
  ]
}