{
  "articles": [
    {
      "title": "",
      "url": "",
      "subtitle": "",
      "author": "",
      "content": "   ",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "How would Warren pay for 'Medicare for All'? Enough evasion, it's past time for answers.",
      "url": "https://www.usatoday.com/story/opinion/2019/10/18/warren-tell-2020-voters-truth-about-taxes-medicare-for-all-column/3997249002/",
      "subtitle": "null",
      "author": "",
      "content": "When it comes to doing things, Elizabeth Warren has a plan for everything — and she’s happy to tell you all about it. But when it comes to paying for things, I'm sorry to say, the Massachusetts senator dodges and deflects like a Donald Trump defender. It’s estimated that \"Medicare for All\" will cost the federal government an extra $3 trillion a year. That’s more than $9,000 annually from every man, woman and child in America. Despite being asked, again and again, Warren refuses to acknowledge that paying for this is going to require an across-the-board tax increase — and a pretty massive one, at that. Instead, she keep talking about how “costs” will go down before she changes the subject to how stressful it is to have your insurance canceled when you get sick or when you have to cope with your mom having diabetes. That’s very true, I’m sure. But we’re talking fiscal policy here. There’s a very unpleasant collectivist feel to this. It’s all very well to say you can’t make an omelet without breaking some eggs … unless you’re the egg. About 56% of Americans — more than 180 million — have private health insurance through an employer. Medicare for All would sweep that all away, whether the people who have that insurance like it or not, in the name of the common good. Perhaps worse, as Warren knows perfectly well but steadfastly refuses to admit, there are going to be winners and losers. Costs might go down in the aggregate, but individuals and families aren’t aggregates. Elizabeth Warren's choice: 'Medicare for All' purity or a path to beating Trump? For example, Warren keeps saying that the total you pay for health care would end up being less under Medicare for All because it will eliminate out-of-pocket costs like premiums and copays. That’s an oversimplification at best, especially since she hasn’t said how she would finance this enormously expensive project. But it is a given that everyone will pay higher taxes, and it’s older people who spend more in premiums and out-of-pocket health care costs — a lot more. Consequently, older people will be far more likely to see these higher taxes offset by a decrease in the cost of their health care. By contrast, younger people and families at healthier stages of their lives would still be paying new taxes but will see fewer benefits. On average, would people be better off with lower taxes and more disposable income to buy a home, invest, or raise a family when they were younger and then absorb higher health care costs when they are older? Or would they be better off forgoing that income and avoiding those health care costs later? I don’t know, and neither does Sen. Warren. But this is exactly the kind of thing we need to have an open and honest debate about. Warren is treating the American public like children and insisting that she knows best. This is foolish in the extreme. Even if she doesn’t want to discuss the costs and trade-offs of Medicare for All, she can be sure that, should she become the Democratic nominee, the Republicans will do it for her. Her refusal to admit the obvious makes her look dishonest. Doing it wrong: 2020 Democrats, stop arguing about health care and show leadership. Medicare for All is not a good idea. It’s just an idea. It’s up to the American people, after considering the pros and cons — which, yes, do include much higher taxes for everyone — to decide whether, on balance, the trade-offs make it worthwhile or whether something else, like an expanded and fortified Obamacare or a public insurance option, would be better. Mayor Pete Buttigieg of South Bend, Indiana, is exactly correct when he says that Americans want choices, and that we should trust them to make the right decisions for themselves, for their families — and for the country. You do that by being straight with them. There are many possible paths to beating Donald Trump in 2020, but I can guarantee you that trying to out-spin and out-dodge him is not one of them. Chris Truax is an appellate lawyer in San Diego and a member of USA TODAY's Board of Contributors.",
      "date": "Published 5:00 a.m. ET Oct. 18, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Trump administration imposes sanctions on Turkey, as critics slam decision to withdraw U.S. troops",
      "url": "https://www.usatoday.com/story/news/politics/2019/10/14/donald-trump-threatens-sanctions-turkey-soon-syria-invasion/3978904002/",
      "subtitle": "Public opinion polling has shown noticeable shifts in attitudes towards impeachment, though every single poll has asked about impeachment differently.\n    USA TODAY",
      "author": "John Fritze,",
      "content": "   WASHINGTON – Facing blowback for his decision to allow Turkey's invasion against Kurdish fighters in Syria, President Donald Trump imposed sanctions on Ankara as his administration called for an \"immediate\" ceasefire in the fragile region. \"Punishing sanctions have been placed on Turkey,\" Vice President Mike Pence told reporters during a surprise gathering at the White House. \"The sanctions that are imposed today are a beginning.\" The White House took the steps as Trump's decision to withdraw U.S. troops from the region has been slammed by lawmakers of both parties as well as American allies in the region. Hours earlier, Senate Republican leader Mitch McConnell warned of a \"strategic calamity\" in Syria. Pence said Trump pressed Turkish President Recep Tayyip Erdogan in phone call Monday. Trump has also ordered Pence and Trump's top national security aide Robert O’Brien to lead a delegation to Turkey.A senior administration official speaking on the condition of anonymity to detail internal discussions said Trump believes there's \"at least a chance of getting to a ceasefire\" but added that he reached that conclusion only hours before announcing the sanctions. \"Indiscriminate targeting of civilians, destruction of civilian infrastructure, and targeting of ethnic or religious minorities is unacceptable,\" Trump said in a lengthy statement. \"Additionally, the return of refugees must be conducted in a safe, voluntary, and dignified manner.\" Trump had repeatedly threatened to impose the sanctions. Mnuchin on Friday saidthat the U.S. could \"shut down the Turkish economy\" if his administration decides that Erdogan crosses a line the White House has declined to define. Mnuchin said three senior Turkish officials – the ministers of defense, interior and energy – and two Turkish ministries were designated for the sanctions authorized by Trump's executive order. Trump said steel tariffs imposed on Turkey would increase to 50% from 25% and said his administration would stop talks on a proposed $100 billion trade deal. The president has so far declined to provide a specific answer to questions about what would trigger U.S. sanctions. \"We do a lot of trade with Turkey,\" Trump told reporters on Friday. \"But we don’t want them killing a lot of people.\" Critics say the president's decision has set the stage for a humanitarian crisis in northern Syria and power vacuum that Russia, Iran and other strategic foes of the U.S. will attempt to fill. Critics have put the blame squarely on Trump, saying he all but green-lighted the invasion during a phone call with Erodgan a week ago Sunday. They said U.S. troops had stabilized the area, and their withdrawal made conflict more likely. “I am gravely concerned by recent events in Syria and by our nation’s apparent response thus far,\" McConnell said. The sanctions and talk of a ceasefire appeared to satisfy Sen. Lindsey Graham, the South Carolina Republican and Trump ally who has nevertheless been critical of the president's decision to withdraw U.S. troops from the region. Graham said in a statement that the president asked him to sit in on several calls about the conflict on Monday. \"The president’s team has a plan and I intend to support them as strongly as possible, and to give them reasonable time and space to achieve our mutual goals,\" Graham said. Speaking in a television interview Sunday, Defense Secretary Mark Esper said Trump had ordered a \"deliberate withdrawal\" of U.S. forces from northern Syria, an even more comprehensive withdrawal than had been previously ordered. In his statement, Trump said that troops withdrawing from Syria will \"now redeploy and remain in the region\" to monitor the situation and prevent a resurgence of ISIS. White House officials had previously said that the troops pulled back from the line of fire would remain in the region. Contributing: Nicholas Wu",
      "date": "Published 5:51 p.m. ET Oct. 14, 2019 | Updated 7:24 p.m. ET Oct. 14, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Telling numbers from President Trump's first 1,000 days",
      "url": "https://www.usatoday.com/in-depth/news/2019/10/17/president-donald-trump-numbers-first-1000-days/3995787002/",
      "subtitle": "null",
      "author": "",
      "content": "",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "7 of our top opinion columns this week: ICYMI",
      "url": "https://www.usatoday.com/story/opinion/2019/10/18/elizabeth-warren-debate-donald-trump-impeachment-columbus-day-top-columns/4011213002/",
      "subtitle": "null",
      "author": "",
      "content": "In today's fast-paced news environment, it can be hard to keep up. For your weekend reading, we've started in-case-you-missed-it compilations of some of the week's top USA TODAY Opinion pieces. As always, thanks for reading, and for your feedback. — USA TODAY Opinion editors By Lauren Leader \"It has been a big month for Sen. Elizabeth Warren. ... But rising along with Warren is anxiety among corporate leaders, especially the growing number of women working in the corporate sector, who fear her strident anti-corporate rhetoric could actually cost Democrats the presidency if she is the nominee. ... They fear that if offended, big-company employees stay home in 2020, especially women, President Donald Trump could win again.\" By The Editorial Board \"(House Speaker Nancy Pelosi) needs to call for a vote on launching an inquiry — sooner rather than later. ... Americans should know where their elected representatives stand on launching an inquiry. This isn't an impeachment vote. And it isn't a mystery whether it would pass. ... Moreover, such a vote would give the House impeachment investigation a stronger hand in court for obtaining White House documents and testimony.\" By Kevin Gover \"The observance of Columbus Day is the outgrowth of a whitewashed history, perpetuated in public discourse and in our schools, where native and nonnative children, from the earliest age, are taught simplistic, incomplete and inaccurate information about American Indians. ... These narratives, in turn, influence government policies and shape how nonnatives respond to their Native American neighbors.\" By Tom Nichols \"When (Democrats and I) watched CNN's LGBTQ town hall for the Democratic candidates Thursday, we had very different reactions. ... You thought it was great. You saw a ringing defense of LGBTQ rights and a reaffirmation of what Democrats stand for. I saw it and thought: Are these people insane? Are they trying to lose the election?\" By Ross K. Baker \"Presidents have often been nettled by congressional committees but no president has ever successfully challenged the right of committees to take testimony from witnesses thereby obstructing their ability to function as the framers intended. ...  This act of subversion by President Donald Trump ... is a frontal attack on a time-honored power of a legislative body handed down to us from centuries of British lawmakers.\" By Bandy X. Lee \"I have been compelled to blow two whistles: first, by publishing a book to alert the public that Donald Trump was more dangerous than perhaps any president in history, for psychological reasons; and second, on the American Psychiatric Association's actions that have effectively silenced those of us trying to fulfill our professional responsibility to society as outlined in its own code of ethics.\" By Yolonda Wilson \"Convicted murderers don’t usually get hugs from the family of the victim. But last week, Brandt Jean explicitly told former Dallas police officer Amber Guyger that he forgave her for shooting his brother Botham and asked the judge for permission to hug her. ... Jean has every right to do the thing that helps him heal and honor the memory of his brother. But in instances of unjust killings of black victims, why does the public laud responses of forgiveness and criticize those that include anger?\"",
      "date": "Published 7:00 a.m. ET Oct. 18, 2019 | Updated 12:49 p.m. ET Oct. 18, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Democrats’ impeachment inquiry is ‘baseless, unconstitutional’",
      "url": "https://www.usatoday.com/story/opinion/2019/10/13/donald-trump-impeachment-inquiry-baseless-unconstitutional-editorials-debates/3971336002/",
      "subtitle": "Impeaching a U.S. president might not be the be-all-end-all for their career. We explain why this is the case.\n    Just the FAQs, USA TODAY",
      "author": "",
      "content": "Pat Cipollone,  White House counsel: “President Donald Trump and his administration reject your baseless, unconstitutional efforts to overturn the democratic process. Your unprecedented actions have left the President with no choice. In order to fulfill his duties to the American people, the Constitution, the executive branch and all future occupants of the office of the presidency, President Trump and his administration cannot participate in your partisan and unconstitutional inquiry.” David O. Stewart,  USA TODAY: \"A popular saying among lawyers is that if the facts are against you, argue the law; if the law is against you, argue the facts. And 'if the law and the facts are against you, pound the table and yell like hell.' Cipollone took that last alternative in his Tuesday letter to leaders of the House of Representatives, announcing that the Trump White House will provide neither witnesses nor testimony in response to the House impeachment inquiry. If that letter were produced by a law student, the grade would be an F.\" The Wall Street Journal, The Editorial Board:  “A president and Congress controlled by opposing parties fight over documents all the time. We don’t recall Democrats fretting when President Bill Clinton made executive-privilege claims that were more sweeping than President Richard Nixon’s during Watergate. The media that now profess horror at Trump raised not a whit of concern when Attorney General Eric Holder denied documents to Congress and was held in contempt.” Paul Kane,  The Washington Post:  “Normally, a president in such peril would simply turn this fight into a battle between him and Congress — something Trump has been doing — and usually that sets a path to victory because Congress is such a reviled institution. ... But there are some early signs that Democrats might be able to weather this storm, or at least that congressional Republicans could come out of this situation in much worse shape. ... Democrats, in some ways, are now taking President Lincoln’s 1858 words to heart, not merely as observers of public sentiment but forcefully engaged in trying to shape voters’ minds. ... ‘Consequently he who molds public sentiment, goes deeper than he who enacts statutes or pronounces decisions,’ Lincoln wrote. ‘He makes statutes and decisions possible or impossible.’ ” Samantha Vinograd,  CNN: \"As the House prepares to meet with a mix of current and former administration officials this week — including Fiona Hill, a former top Russia and Ukraine official at the White House, U.S. Ambassador to the European Union Gordon Sondland, Deputy Assistant Secretary of European and Eurasian affairs George Kent, and senior adviser to the secretary of State Ulrich Brechbuhl — the world is watching to see just what these staffers have to say about where and when Trump's personal insecurities trumped our national security. ... The House has said that more depositions will be scheduled — and this may be the tip of the iceberg when it comes to officials wanting to share their experiences with Congress. The White House and the State Department may try to block officials from speaking up, but that may only motivate them further.\" OUR VIEW: Nancy Pelosi doesn't have to hold House impeachment inquiry vote. But the speaker should.",
      "date": "Published 6:52 p.m. ET Oct. 13, 2019 | Updated 11:36 a.m. ET Oct. 15, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Democratic leaders walk out of meeting with Donald Trump on Syria, claim president had 'meltdown'",
      "url": "https://www.usatoday.com/story/news/politics/2019/10/16/nancy-pelosi-donald-trump-had-meltdown-during-meeting-syria/4001551002/",
      "subtitle": "The House condemned Trump's decision to withdraw U.S. troops from Syria because now Turkey is attacking Kurds, who have been our allies against ISIS.\n    USA TODAY",
      "author": "Maureen Groppe",
      "content": " WASHINGTON – Congressional Democrats walked out of a White House meeting on Syria on Wednesday, claiming President Donald Trump was demeaning to House Speaker Nancy Pelosi. \"He was insulting, particularly to the speaker. He called her a ‘third-rate politician,'\" said Senate Minority Leader Chuck Schumer, D-N.Y. \"This was not a dialogue, it was sort of a diatribe.\" Pelosi said Trump was “shaken up” by having lost most Republicans in a Wednesday vote condemning Trump's decision to withdraw U.S. troops from Syria, “What we witnessed on the part of the president was a meltdown, sad to say,\" Pelosi said. Hours later, in a series of tweets attacking her, Trump said it was Pelosi who had an \"unhinged meltdown.\" In another tweet, Trump claimed Pelosi \"needs help fast,\" adding, \"Pray for her, she is a very sick person!\" Pelosi then took the photo in Trump's tweet – which showed her standing up and pointing her finger at Trump – and made it the background photo of her Twitter and Facebook pages. The White House meeting came soon after the House overwhelmingly passed bipartisan resolution condemning Trump's decision to withdraw U.S. troops from Syria, all but clearing the way for Turkey to invade territory held by the U.S.-allied Kurds. White House Press Secretary Stephanie Grisham called Pelosi's decision to walk out \"baffling, but not surprising.\" “Speaker Pelosi had no intention of listening or contributing to an important meeting on national security issues,\" Grisham said in a statement. \"While Democratic leadership chose to storm out and get in front of the cameras to whine, everyone else in the meeting chose to stay in the room and work on behalf of this country.” Democrats said Pelosi left after Trump called her a third-rate politician, but not before Pelosi said she responded: \"I wish you were a politician, Mr. President. Then you would know the art of the possible.\" 'The Kurds are being slaughtered': House votes to condemn President Trump’s troop pullout from Syria Schumer said some lawmakers from both parties stayed behind, as he did initially, because he wanted to ask a question. House Minority Leader Kevin McCarthy, R-Calif., said the meeting, which included top Pentagon officials, was “very productive” with “the Democrats who actually stayed in the meeting.” “Those who would stay in the room are those who care the most for the process of solving this problem and making sure America is safe,” McCarthy said. Democrats are also complaining that the administration has cancelled a briefing for lawmakers on Syria that had been scheduled for Thursday.",
      "date": "Published 4:40 p.m. ET Oct. 16, 2019 | Updated 9:33 p.m. ET Oct. 16, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Forget Donald Trump, Republicans. Save the GOP for the sake of your party's future.",
      "url": "https://www.usatoday.com/story/opinion/2019/10/17/forget-donald-trump-republicans-save-gop-future-editorials-debates/3979356002/",
      "subtitle": "null",
      "author": "",
      "content": "It has long been said that Republicans ought to put country over party and stop defending the indefensible behavior of President Donald Trump. For the most part, this argument has fallen on deaf ears for the obvious reason that Trump still enjoys the support of the very same rank-and-file voters whom Republican lawmakers face in primary elections. A better argument might be that Republicans need to stand up to Trump — for the sake of their party's future. Some GOP lawmakers have, to their credit, challenged the president on foreign policy issues such as Russian sanctions and Trump's hasty, ill-conceived decision to withdraw from Syria. But in repeatedly turning a blind eye to his abuses of office, the GOP is branding itself as bankrupt of principle and interested only in clinging to power. More ominously, the GOP is turning independent voters against it and abandoning positions — such as support for law and order, fiscal responsibility, science, free trade, ethics in government and standing up to dictators abroad — that long formed its political high ground. For much of Trump's first 1,000 days in office, a party that supposedly values the rule of law sat by as the president attacked prosecutors and judges who dared to question his actions. More recently, nearly all of its ostrich-like officeholders have put their heads in the sand as Trump used the power and prestige of the United States to pressure Ukraine to investigate a potential general election opponent, former Vice President Joe Biden. This is the same party that tried to politicize a tragedy at a U.S. compound in Benghazi, Libya, in 2012 to make it look like a Hillary Clinton scandal. It is also the party that impeached President Bill Clinton in 1998 after he had an affair with a former White House intern. As the chart below shows, many of the same Republicans who were quick to impeach or convict then are now drooling poodles on Trump's lap. RNC: The future for Republicans, and America, has never looked brighter If the GOP doesn’t recover its values, it will be hard to take the party seriously when it claims that a Democrat is doing something wrong. Its candidates, moreover, will struggle to articulate what their party stands for: ►Family values? Not when the president brags of grabbing women and pays hush money to a porn star. ►The rule of law and constitutional governance? Not when the president misuses his powers for political gain. ►Limited government? Not when the president uses levers of power to go after the head of Amazon, the chairman of the Federal Reserve, the state of California, the auto industry, America’s closest allies and many others — simply because they refuse to carry his water. ►Concern for conflicts of interest? Not when the president selects one his own resorts to host the summit of the Group of Seven major industrial nations. (One can only imagine how Republican politicians and conservative media outlets would have reacted if a Democratic president had done the same.) To be sure, Republican lawmakers are politicians who can't ignore their constituents. But they are also the stewards of the GOP’s future who shouldn't be cowering in fear of nasty tweets. How is it going to help conservatives get elected if their party has offended large swaths of the electorate? How is toleration for self-dealing and misuse of power going to be a selling point? As they contemplate these questions, they might actually find that doing the right thing turns out to be the politically expedient thing. Rep. Robert Aderholt, Ala. Sen. (then-Rep.) Roy Blunt, Miss. Rep. Kevin Brady, Texas Sen. (then-Rep.) Richard Burr, N.C. Rep. Ken Calvert, Calif. Rep. Steve Chabot, Ohio Sen. (then-Rep.) Mike Crapo, Idaho Sen. Mike Enzi, Wyo. Sen. (then-Rep.) Lindsey Graham, S.C. Rep. Kay Granger, Texas Sen. Charles Grassley, Iowa Sen. James Inhofe, Okla. Rep. Frank Lucas, Okla. Sen. Mitch McConnell, Ky. Sen. (then-Rep.) Jerry Moran, Kan. Sen. (then-Rep.) Rob Portman, Ohio Sen. Pat Roberts, Kan. Rep. Hal Rogers, Ky. Rep. Jim Sensenbrenner, Wis. Sen. Richard Shelby, Ala. Rep. John Shimkus, Ill. Rep. Chris Smith, N.J. Rep. Mac Thornberry, Texas Sen. (then-Rep.) John Thune, S.D. Rep. Fred Upton, Mich. Sen. (then-Rep.) Roger Wicker, Miss. Rep. Don Young, Alaska If you can't see this reader poll, please refresh your page.",
      "date": "Published 5:52 p.m. ET Oct. 17, 2019 | Updated 5:58 p.m. ET Oct. 17, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "President Trump to attend criminal justice forum at HBCU along with Democrats",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/10/18/donald-trump-to-attend-criminal-justice-forum-at-hbcu-in-south-carolina/4026450002/",
      "subtitle": "null",
      "author": "Zoe Nicholson",
      "content": " GREENVILLE, S.C. – President Donald Trump will attend a criminal justice reform forum at the historically black Benedict College in Columbia on Friday, Oct. 25. The event is the 2019 Second Step Presidential Justice Forum. Hosted by the 20/20 Bipartisan Criminal Justice Center, the event is set to host numerous presidential candidates in South Carolina's capital. A number of Democratic  presidential candidates, including Bernie Sanders, Elizabeth Warren, Joe Biden, Kamala Harris and Cory Booker, will also be in attendance at the event on Saturday, Oct. 26. The list: Who is running for president in 2020? An interactive guide Every presidential candidate was invited to attend the forum, which is focused on the \"second step\" of justice reform after the passing of the 2018 First Step Act. The event's description details that all candidates who attend will be asked to speak about their plans for criminal justice reform by presenting \"specific and articulable policy proposals with measurable results to be achieved by 2024.\" The event is scheduled to run from Friday, Oct. 25 to Sunday, Oct. 27.",
      "date": "Published 5:20 p.m. ET Oct. 18, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "'To me it will always be Columbus Day.' Trump dismisses criticism of Christopher Columbus",
      "url": "https://www.usatoday.com/story/news/politics/2019/10/16/donald-trump-dismisses-criticism-columbus-day-italian-president/3998570002/",
      "subtitle": "President Trump says his meeting with the parents of a British teen killed in a traffic accident involving an American diplomat's wife was \"beautiful.\"  (Oct. 16)\n    AP",
      "author": "John Fritze and",
      "content": "  WASHINGTON – President Donald Trump, who made his support for the \"Merry Christmas\" greeting a part of his campaign, weighed into the ongoing controversy over Columbus Day on Wednesday, slamming some who have eschewed the holiday's namesake. \"To me it will always be called Columbus Day,\" Trump said during a press conference at the White House with Italian President Sergio Mattarella. \"Some people don't like that,\" he said. \"I do.\" For many Americans, the second Monday in October is a celebration of Italian heritage and Christopher Columbus' 1492 voyage to the Americas. But a growing number of cities, states and universities are abandoning ship and replacing Columbus Day with Indigenous Peoples Day, also known as Native Americans Day. At least eight states, 10 universities and more than 130 cities across 34 states now observe Indigenous Peoples Day as an alternative to the federally recognized Columbus Day, which they say glorifies the mistreatment and colonization of Native Americans. Mattarella also weighed in Columbus. \"It seems to me that he did a good job back then,\" Mattarella said. Contributing: Grace Hauck",
      "date": "Published 1:14 p.m. ET Oct. 16, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Trump's unmatched sleaze: Grifters, women, trampling Constitution and now G-7 at Doral",
      "url": "https://www.usatoday.com/story/opinion/2019/10/18/trump-grifter-family-corrupt-cabinet-attacks-on-constitution-column/3999665002/",
      "subtitle": "Impeaching a U.S. president might not be the be-all-end-all for their career. We explain why this is the case.\n    Just the FAQs, USA TODAY",
      "author": "",
      "content": "We’ve had presidents who were used by members of their own family for personal gain, like Ulysses S. Grant. We’ve had presidents who stocked their Cabinet with greedy, self-serving mediocrities who took advantage of the public trust, like Warren G. Harding. We’ve had presidents who swore to “preserve, protect and defend” the Constitution, only to then abuse it, like Richard Nixon. And we’ve had presidents who, thanks to a presumptive sense of entitlement, lived slimy private lives, using countless women before tossing them aside — Harding again, plus John F. Kennedy and Bill Clinton. President Donald Trump falls into every single sleazy category, squarely and shamelessly. Just Thursday, we learned that he'll hold next year's Group of Seven meeting (with leaders of Canada, France, Germany, Italy, Japan and the United Kingdom) at his own Doral golf resort in Miami. It’s the latest example of how Trump, who never divested from his businesses, continues to make millions from them. It’s also the latest reminder that he constantly violates the Constitution’s emoluments clause, which is supposed to ban presidents from accepting money from foreign governments. This while the House is in the middle of an impeachment inquiry and there are two lawsuits pending over the emoluments clause. \"This is unbelievable,\" said Noah Bookbinder, executive director of Citizens for Responsibility and Ethics in Washington, which filed one of those suits, speaking for much of America. Grant was an honest man, yet under his nose, his own brother-in-law and two other grifters tried to corner the gold market. The financial panic that followed was called “Black Friday.” Then there was the “Whiskey Ring Scandal,” in which the president’s own secretary played a role in attempting to defraud the government of millions. And Trump? Unlike other presidents, he never bothered to place his assets in a blind trust. Instead he allows his family to run his trust, and he remains its one and only beneficiary. Unconstitutional: G-7 at Trump's Doral resort? The original sin of this presidency is failure to divest And the emoluments clause hasn’t stopped diplomats, representatives of government-owned businesses and other foreign visitors from buying his properties and running up big tabs at his resorts and hotels. That's stuffing cash, albeit indirectly, into Trump's pocket. Meantime, finger-pointing at Hunter Biden diverts media attention — a time-honored Trump tactic — from his own children's brazen exploitation of their father’s office. As Bloomberg's Stephanie Baker notes, they \"have continued working with foreign business partners from Dubai to Indonesia and India while their father sits in the White House.\" First daughter Ivanka and hubby Jared Kushner raked in an estimated $82 million in 2017 alone, records show. “Time and again,” notes the Los Angeles Times, “Trump’s children have blurred the lines of family, nation and business — essentially the charge the president makes against the Bidens.” Perhaps you’ve heard of “Teapot Dome,” a huge oil reserve scandal involving Warren G. Harding’s Interior secretary, Albert Fall. Fall was convicted of accepting a bribe and went to prison. Meanwhile, Harding’s Veterans secretary, Charles Forbes, looted the 2019 equivalent of $2.8 billion in a string of shady deals; he, too, was convicted of bribery and went to prison. No one in Trump’s revolving-door Cabinet has ripped off taxpayers on that scale, but many have fleeced we the people for everything from private air travel (former Health and Human Services Secretary Tom Price and Treasury Secretary Steven Mnuchin), running up big tabs in Europe for spouses (former Veterans Affairs Secretary David Shulkin), and ripoffs for everything from new office doors (ex-Interior Secretary Ryan Zinke), dining room furniture (Housing Secretary Ben Carson) and more. Then there is fellow swamp monster Scott Pruitt, whose list of grifting while he headed the Environmental Protection Agency was almost as long as the list of clean water and clean air regulations he helped the president gut. And need I mention that Trump’s campaign chief (Paul Manafort) and first national security adviser (Michael Flynn) are now convicted felons? And that one of his top Oval Office aides (Rob Porter) had to leave after it became known that not one but both of his former spouses accused Porter of physical and verbal abuse. Even a president as shameless as Trump has had to ditch many of these let-them-eat-cake mediocrities to appease critics. Isn't this the guy who bragged that he hires only the very best? And his base still buys this claptrap. We all know what Nixon did. And Trump? It goes well beyond ignoring the emoluments clause to monetize the presidency. Trump took an oath to “preserve, protect and defend the Constitution of the United States.” But just this month he publicly invited an adversary, China, to interfere in the 2020 presidential election. He has attacked the First Amendment by trying to ban reporters who ask unpleasant questions from the White House and suggesting that TV networks he dislikes lose their broadcast licenses. He has suggested cutting corners on due process for illegal immigrants, a violation of the Fifth Amendment. He has suggested ending birthright citizenship, a violation of the Fourteenth Amendment. “Preserve, protect and defend the Constitution of the United States?” Rubbish. Trump only wants to bother with the parts that are convenient to him. Harding was so sleazy that — as president — he once had sex with one of his mistresses in Central Park. He had an illegitimate daughter with one woman, a long affair with another who was suspected of being a German agent during World War I, and trysts in the Oval Office itself. Kennedy's voluminous affairs were beyond sleazy. One with the girlfriend of a Mafia kingpin, and another with a woman believed to be an East German spy, even exposed him to potential blackmail. Then there is our most recent philanderer in chief, Bill Clinton, whose lies about an affair with a White House intern got him impeached. Clinton’s liaisons showed him to be impulsive and sexually reckless in way that left a stain (literally and figuratively) on the presidency. Making Nixon look good: Donald Trump is much worse than Richard Nixon. He may even have committed treason. Trump’s infidelities fall short of Harding and Kennedy. But sleaze is sleaze: He has cheated on all three wives and, in the case of porn star Stormy Daniels, did it right after his third wife, Melania, gave birth to their son, Barron. And at last count, no fewer than 25 women accuse him of either “misconduct” or flat-out assault. It's certainly obvious why evangelicals continue to call Trump a good, God-fearing Christian, isn't it? Trump, who even lies about the weather, says every single one of these women is making it all up. Trump, as you know, is a Boy Scout and would never lay so much as an orange finger on anyone. And that “Access Hollywood” tape that surfaced in 2016, in which he bragged about assaulting women? Fake. Sure. A grifting family. A sleazy what’s-in-it-for-me Cabinet. Trampling on our beloved Constitution. And all these women. All the boxes, checked. Paul Brandus, founder and White House bureau chief of West Wing Reports, is the author of \"Under This Roof: The White House and the Presidency\" and is a member of USA TODAY's Board of Contributors. Follow him on Twitter: @WestWingReport",
      "date": "Published 3:15 a.m. ET Oct. 18, 2019 | Updated 11:05 a.m. ET Oct. 18, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Trump administration's effort to speed removal of migrants seeking asylum headed to Supreme Court",
      "url": "https://www.usatoday.com/story/news/politics/2019/10/18/supreme-court-consider-donald-trump-crackdown-asylum-seekers/4013142002/",
      "subtitle": "The situation along the U.S.-Mexico border is complex. We break down how asylum seekers are seeking refuge and why it’s different than ever before.\n    Hannah Gaber, USA TODAY",
      "author": "Richard Wolf",
      "content": " WASHINGTON –One of President Donald Trump's many efforts to crack down on asylum-seekers at the border is headed to the Supreme Court. The justices agreed Friday to consider the administration's effort to speed the removal of thousands of migrants without allowing them federal court hearings. A federal appeals court in California ruled earlier this year that efforts to remove asylum-seekers under \"expedited review\" procedures violated their constitutional rights. The Justice Department argues that extending the streamlined process could add years of court wrangling. The case is one of several challenging the Trump administration's efforts to crack down on migrants seeking asylum after crossing the Mexican border: • In December, the Supreme Court temporarily blocked a policy aimed at denying asylum to migrants crossing the border illegally rather than at designated crossings. • Last month, the justices temporarily upheld a different policy denying asylum to those who do not seek protection first from a country they pass through, such as Mexico. The high court already has a major immigration case on its plate this year. In November, it will hear the administration's argument for ending the Deferred Action for Childhood Arrivals (DACA) program created in 2012 by President Barack Obama. The case granted Friday concerns a citizen of Sri Lanka who crossed the border illegally and was apprehended immediately by U.S. Customs and Border Protection. He said he feared returning to his native country, but those claims were deemed to be unfounded in immigration court. Congress in 1996 created the expedited review system in which thousands of undocumented immigrants are removed each year, often within days of arrival. But the U.S. Court of Appeals for the 9th Circuit declared the truncated system unconstitutional. The Justice Department argues in court papers that the 9th Circuit's ruling will \"significantly delay removal of aliens ... undermining the government’s ability to control the border.\" After losing the case, the administration in July expanded the expedited removal system to incorporate asylum-seekers apprehended anywhere in the country who have not been continuously present in the United States for two years. The American Civil Liberties Union, representing the Sri Lankan asylum-seeker, had urged the justices to reject the administration's appeal \"so that the political branches are not entirely unchecked when they deprive individuals of liberty.\"",
      "date": "Published 2:50 p.m. ET Oct. 18, 2019 | Updated 3:58 p.m. ET Oct. 18, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Lights, camera, Trump: Get ready for the Donald Trump-James Comey miniseries",
      "url": "https://www.usatoday.com/story/news/politics/2019/10/07/donald-trump-james-comey-cbs-miniseries/3899537002/",
      "subtitle": "null",
      "author": "David Jackson",
      "content": " WASHINGTON – The saga of President Donald Trump and fired FBI Director James Comey will soon hit the small screen as a television miniseries, CBS Studios announced Monday. Comey will be portrayed by Jeff Daniels, most recently idealistic anchorman Will McAvoy in the HBO series \"The Newsroom,\" as well as idealistic Southern lawyer Atticus Finch in the Broadway production of \"To Kill A Mockingbird.\" Who plays Trump? The distinguished Irish actor Brendan Gleeson, who won an Emmy for his portrayal of Winston Churchill in the 2009 HBO film \"Into The Storm.\" The new miniseries is based on Comey's memoir, “A Higher Loyalty: Truth, Lies and Leadership.” Trump said he fired Comey in 2017 for incompetence; Comey said Trump sacked him because he refused the president's request to back off an investigation of adviser Michael Flynn, a key figure in the investigation of Russian election interference in 2016. Filming is scheduled to begin next month, CBS said; the actual air date will be announced later.",
      "date": "Published 1:45 p.m. ET Oct. 7, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Trump presidential campaign threatens to sue CNN, news network calls it a 'PR stunt'",
      "url": "https://www.usatoday.com/story/news/politics/2019/10/18/donald-trump-2020-campaign-threatens-sue-cnn-letter/4022715002/",
      "subtitle": "President Trump said Syria has \"got a lot of sand\" while talking about Turkey's invasion of the country.\n    USA TODAY",
      "author": "David Jackson",
      "content": " WASHINGTON – President Donald Trump's re-election campaign threatened to sue CNN Friday over what they allege is biased reporting, a move opponents denounced as an attempt to intimidate the media in general. \"Never in the history of this country has a President been the subject of such a sustained barrage of unfair, unfounded, unethical and unlawful attacks by so-called 'mainstream' news, as the current situation,\" said a letter to CNN from attorney Charles Harder, representing Trump and his campaign. In a statement, CNN said that \"this is nothing more than a desperate PR stunt and doesn't merit a response.” Attorneys said such a lawsuit, if filed, would go nowhere. “Any such lawsuit, at least based on the statute specifically identified so far, is nothing more than a PR stunt designed to rev up the president’s political base,\" said Bradley Moss, an attorney who specializes in national security and transparency issues. Moss, who has done work for USA TODAY, said \"facts and legal reality have no relation\" to the threatened lawsuit. Syria: Trump says Kurds are 'very happy' with U.S.-brokered deal and U.S. has 'taken control' of oil Neal Katyal, a former acting Solicitor General, said: \"If the legal claims in his letter are any indication, I would think CNN will want him to sue and have a court decide this one.\" Trump frequently sued rivals during his business career. This latest threat cites reports from a conservative group that obtained tapes of CNN employees discussing coverage of the president. The complaint is the latest salvo in the long-running war between him and the news media, particularly CNN. \"But CNN is a voice that really seems to be the voice out there,\" Trump said before signing a health care executive order in Florida this month. \"And it’s a terrible thing for our country. And we ought to start our network and put some real news out there because they are so bad.\" After a Trump attack in August of 2018, CNN said in a statement: \"Make no mistake, Mr. President, CNN does not lie. We report the news. And we report when people in power tell lies. CNN stands by our reporting and our reporters.\" Jim Mattis: 'I guess I'm the Meryl Streep of generals,' Mattis jokes after Trump's insult Legal analysts pointed out that this would not be a libel suit. Trump's attorneys cite alleged violations of the Lanham Act, which is designed to prohibit trademark infringement and “false advertising” \"Trump suing CNN isn't about winning in court,\" Moss said. \"The case will go nowhere. It's about appealing to his base with a PR stunt.\" Contributing: John Fritze",
      "date": "Published 3:13 p.m. ET Oct. 18, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Blue Texas? Donald Trump visits Lone Star State as Democrats seek inroads",
      "url": "https://www.usatoday.com/story/news/politics/2019/10/17/election-2020-donald-trump-texas-democrats-make-waves/3970045002/",
      "subtitle": "President Donald Trump was defiant in the face of an impeachment probe Thursday as he sought to convert the threat to his presidency into a weapon on the campaign trail. He held a rally in Minneapolis on Thursday night. (Oct 11)\n    AP, AP",
      "author": "David Jackson",
      "content": " DALLAS – In the political heart of Texas, a state Republicans have dominated for decades, Democrats say they are gaining ground – and one of the reasons rode into Dallas-Fort Worth on Thursday. His name: Donald Trump. While Trump's policies on immigration, trade and the economy remain popular in Republican-leaning Texas, Democrats say the president's actions are helping them build a base of their own among Hispanics, city dwellers and college-education professionals in the Lone Star State. \"Texas Democrats are rising,\" Dallas County Judge Clay Jenkins said as Trump supporters gathered for a rally at a sports arena in downtown Dallas. He added, \"once Texas turns blue, the White House will follow for a long time.\" At the rally later in the evening, Trump scoffed at the notion that the Lone Star State is somehow in play, telling supporters: \"Donald Trump is not going to lose Texas, I can tell you that.\" 'Don't kid yourself': Donald Trump tells Dallas rally the fate of democracy is at stake in 2020 Indeed, the president is still favored to carry Texas in the 2020 election – he won it by nine percentage points in 2016. But members of both parties said Democrats are in a position to make it more of a challenge. And while Texas Democrats haven't won a statewide race since 1994, they nearly captured a Senate seat last year and are closing the gap in legislative and congressional elections. \"It's fair to say the state is more competitive than it has been, and the threat is real,\" said Texas-based Republican political consultant Matt Mackowiak, though he added: \"I do not think it will be in play in the presidential race.\" Trump supporters could not be more confident about Texas, noting that the state has seen increases in job creation and energy production since Trump took office, while Democrats are promoting \"socialist\" ideas on health care and gun control. \"There are too many people who feel the way I do\" in Texas, said Brenda Lewis, 72, a Fort Worth retiree who grabbed a front-row seat at the rally. \"They don't want to change it to Cuba.\" Trump didn't visit Texas on Thursday because he's worried about losing the state, aides said. From Texarkana to El Paso, the state is a giant ATM for presidential candidates in both parties, and Trump began his day by raising an estimated $5.5 million at fundraisers in Fort Worth. Trump then headed to nearby Johnson County to help cut the ribbon at a new Louis Vuitton leather manufacturing workshop, an appearance in which he highlighted plans to make jobs a major campaign issue. What to know from a busy Thursday: Trump's Syria-Turkey cease-fire, Rick Perry resigns, the death of Elijah Cummings As he did at rallies last week in Minnesota and Louisiana, Trump used his Texas gig to buck up his base as he faces numerous challenges back in Washington, D.C. – most notably an impeachment inquiry led by House Democrats. Trump and his Texas supporters predicted that a backlash against impeachment will help Trump. \"People like us will come out in force,\" said Sandra Brewer, 52, a flight attendant from Granbury, Tex. Standing outside American Airlines Center hours before the rally, Brewer added that \"President Trump goes through so much day after day. Most people would have been crushed by now. But he keeps going and going.\" Democrats and some political scientists have talked about it for years: An emerging \"Blue Texas,\" the color that television news networks use to identify states that go Democratic in presidential elections. Proponents cite major demographic shifts in one of the nation's fastest growing states. Much of that growth is in Hispanic communities and the big city areas of Dallas, Houston, Austin and San Antonio; Democrats said many of these new Texas residents are voting with them. \"All of our new voters are going Democratic by a ratio of 5-to-1,\" said Ed Espinoza, executive director of a political organization called Progress Texas. More: Can Democrats win Texas? Houston debate put Lone Star politics at the forefront Trump is a trigger for many of these voters, according to state Democrats. His efforts to crack down on immigration are alienating Hispanic voters; his aggressive style, including attacks on allies and lawmakers of color, turn off many suburbanites, particularly women. \"Trump is a huge liability for the Republican Party,\" said Brittany Switzer, a spokesperson for the Texas Democratic Party. One result, she said, is \"we see a huge coalition and we're looking to build that coalition.\" Republicans said the demographic argument is overstated. There are many conservative Hispanic people, they said, and GOP candidates in Texas can get a fair share of their votes; same with the growing suburbs. Still, there is Republican concern that manifested itself in a high-profile Senate race just last year. Supporters from around Texas, along with throngs of street vendors from all over the country who hop from Trump rally to Trump rally, began arriving at the 20,000-seat American Airlines Center around daybreak. By noon, the lines with a dozen or more people standing abreast filled about four city blocks north of downtown. The crowd at the arena's northeast side was entertained by a talk show-style political program produced by the Trump campaign. A live band that covered such singles as Merle Haggard's \"Mama Tried,\" Pink Floyd's \"The Wall\" and \"The Joker\" by the Steve Miller Band kept the burgeoning crowd entertained. During the performance of \"The Wall,\" the line stating \"we don't need no thought control\" was changed to \"we don't need no gun control.\" Franklin Hughes, a vendor from South Carolina attending his 30th rally, said business was steady despite the competition. The talk of impeachment in the nation's capital has done nothing but improve sales, he said. \"It isn't hurting my business one bit,\" Franklin said. \"It's making it better.\" O'Rourke, a former House member, did not defeat the first-term incumbent Sen. Ted Cruz – but he came as close to winning as any Texas-wide Democratic candidate has in a quarter-century. While Cruz won 50.9% to 48.3%, some analysts said the race foreshadowed the emerging and more politically competitive Texas. O'Rourke raised around $80 million and activated hundreds of thousands of new voters, particularly in the growing urban areas. O'Rourke certainly sees it as a sign of the future. In seeking the Democratic presidential nomination, he claims he could carry Texas and its 38 electoral votes, foreclosing Trump's hopes to victory nationwide. After Trump announced his rally in Dallas, O'Rourke scheduled a counter-rally Thursday evening in nearby Grand Prairie. He called it a \"rally against fear.\" Cruz also sees a changing Texas. In September, he told a group of reporters that suburban voters, particularly women, are \"moving left,\" and \"that’s turning states with big suburban populations – states like Texas, states like Georgia, states like Arizona – much more purple.” Referring to fellow Republicans, Cruz said: \"If we lose Texas, it’s game over.” Beto O'Rourke: Bill O'Reilly's Twitter attack on Beto O'Rourke backfires Texas Republicans say they don't see a Democratic state anytime soon. Some called 2018 an anomaly, in part because Cruz was relatively unpopular among other Republicans. GOP members noted that the incumbent governor, Greg Abbott, won his reelection easily. O'Rourke's fundraising would be hard for a presidential candidate to duplicate, they said. It's questionable as to whether the Democrats would be willing to spend that kind of money on a presidential race in Texas, and might to want to spread it to more competitive states. Said Mackowiak: \"2018 was a very weird year in Texas.\" As for 2020, Texas Republicans noted that Trump did win by 9 percentage points in  2016, and a reversal of that size is hard to imagine. Steve Munisteri, a former GOP state chairman in Texas, said it all boils down to numbers. Generally, in recent elections, statewide Republican candidates get around 4.5 million votes, he said; Democrat candidates have a base of around 4 million. 'I guess I'm the Meryl Streep of general: Ex-Defense Sec. Jim Mattis jokes after Trump's insult Given the state's growth, Munisteri's new target is 5.5 million voters. And, as usual, it will boil down to whichever party can turn out that many votes. \"If the Republicans don't get out their vote, and the Democrats do turn out their vote, the Democrats can win a statewide race,\" he said. It doesn't look like the Alamo for either party; Munisteri said getting out all those new voters in future elections is more like another battle. \"It's going to be like the western front in World War I,\" Munisteri said. \"Trench warfare.\" At the rally in Dallas, Trump backers predicted an easy win next year, though some were less certain about the future. They acknowledged that Democrats are coming on in the state. \"Maybe in 2024, later on down the line,\" said Heather Box, 43, a \"lifelong Texan\" and \"lifelong Republican\" who lives in Addison, Texas, near Dallas. \"I just don't think it's going to happen now. There's just not enough of them yet.\" Contributing: John C Moritz Austin Bureau USA TODAY NETWORK, Corpus Christi Caller-Times",
      "date": "Published 5:00 a.m. ET Oct. 17, 2019 | Updated 10:08 a.m. ET Oct. 18, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Erdogan says Turkey hasn't 'forgotten' Trump's 'tough guy' letter on Syria invasion",
      "url": "https://www.usatoday.com/story/news/politics/2019/10/18/donald-trumps-tough-guy-letter-dont-be-a-fool-is-dismissed-by-turkeys-erdogan/4020772002/",
      "subtitle": "A senior U.S. delegation led by Vice President Mike Pence pursued an uphill mission Thursday to persuade Turkish President Recep Tayyip Erdogan to call for a cease-fire in his fight with Kurdish forces in northern Syria. (Oct. 17)\n    AP, AP",
      "author": "David Jackson",
      "content": " DALLAS – President Donald Trump's unusual letter to Turkey counterpart Recep Tayyip Erdogan in which he told the country's president \"don't be a tough guy\" and \"don't be a fool!\" over his invasion into Syria – did not get a good review from the recipient. \"President Trump's letter, which did not go hand in hand with political and diplomatic courtesy, has appeared in the media,\" Erdogan told reporters on Friday. \"Of course we haven't forgotten it. It would not be right for us to forget it.\" Erdogan also said, \"this is not a priority for us, but when the time comes we would like it to be known that we will take the necessary steps.\" He did not elaborate. Meanwhile, Turkey's ambassador to the U.S., Serdar Kilic, told PBS' NewsHour that \"I hope history will not record that letter,” and it should never have been sent because \"it lacks all the niceties, and it’s void of any established practices in that regard.\" Trump sent the letter days after announcing he would withdraw U.S. troops from Syria, allowing Turkish troops to attack Kurdish allies who helped the U.S. fight ISIS. Trump took severe criticism for the move, which critics argue is an abandonment of a U.S. ally and one to inject chaos into the region. Kurds and Turkey: Fighting continues in Syria despite Trump's 'cease-fire,' Kurds say. Turkey denies clashes The White House confirmed the authenticity of the Oct. 9 letter in which Trump demanded that Erdogan call off his invasion of northern Syria, advice the Turkish leader pretty much ignored. \"Let's work out a good deal!\" Trump said to Erdogan. \"You don't want to be responsible for slaughtering thousands of people, and I don't want to be responsible for destroying the Turkish economy – and I will.\" He ended it by saying: \"History will look upon you favorably if you get this done the right and humane way. It will look upon you forever as the devil if good things don't happen. Don't be a tough guy. Don't be a fool!\" A BBC report claimed Erdogan angrily threw the letter in the trash after reading it. Erdogan's dismissal came after he and U.S. negotiators agreed to a cease-fire, a development for which Trump took credit. The Turkish president is \"a friend of mine and I'm glad we didn't have a problem because frankly, he's a hell of a leader and he's a tough man,\" Trump told reporters during a trip to Texas. \"He's a strong man. And, he did the right thing.\"",
      "date": "Published 10:50 a.m. ET Oct. 18, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Donald Trump pulls his Doral property from consideration for G-7 after bipartisan blowback",
      "url": "https://www.usatoday.com/story/news/politics/2019/10/19/donald-trump-doral-out-g-7-following-criticism-lawmakers/4014702002/",
      "subtitle": "President Trump said Syria has \"got a lot of sand\" while talking about Turkey's invasion of the country.\n    USA TODAY",
      "author": "John Fritze and",
      "content": "  WASHINGTON – President Donald Trump announced late Saturday that he will not use his Doral golf resort in Miami for the G-7 summit next year, reversing course after the decision drew swift condemnation from Democratic and Republican lawmakers. \"Based on both Media & Democrat Crazed and Irrational Hostility, we will no longer consider Trump National Doral, Miami, as the Host Site for the G-7 in 2020,\" Trump posted on Twitter shortly before 10 p.m. ET Saturday. \"We will begin the search for another site, including the possibility of Camp David, immediately.\" In announcing the Doral pick just days earlier, White House acting chief of staff Mick Mulvaney described the resort as \"the best place\" to host the leaders of the world's most industrialized economies. Mulvaney tried to head off criticism about the propriety of using one of the president's properties, saying it was well suited for the summit. Republicans expressed relief Saturday. Former White House press Secretary Ari Fleischer simply tweeted: “Good call.” Bradley Moss, a national security lawyer, tweeted: “Wow, the pressure from within the Republican caucus must have been immense for him to so quickly back off.” Several analysts said the sudden reversal reflects Trump’s concerns about holding Republican support as impeachment heats up. Tony Schwartz, who ghost wrote Trump’s \"The Art of the Deal,\" tweeted. \"Trump never admits being wrong on anything. Now, after fierce criticism for clear self-dealing, he says he won't hold G-7 at his own hotel after all. One more sign that he is feeling threatened and running scared.” Matt Mackowiak, a veteran GOP consultant, said the reason for the backtrack was clear: \"Loss of Republican support and he never does anything at cost.\" Mulvaney had initially dismissed Camp David, the presidential retreat in Maryland. President Barack Obama held the meeting there in 2012. Where the White House could look next: The other finalists for G-7 were two sites in Utah and one in Hawaii, Mulvaney said Thursday. Mulvaney said the White House advance team surveyed 10 locations, in California, Colorado, Florida, Hawaii, Michigan, North Carolina, Tennessee and Utah. Doral: White House: Next G-7 meeting will take place at Trump's Doral facility in Florida Democrats swiftly denounced the Doral pick as nothing more than self-dealing that involves the nation's foreign policy. They pointed out Trump is making the move as his campaign hammers away on the notion that Democratoc rival Joe Biden's son Hunter profited from his father's role as vice president during the Obama administration. \"This is corruption, plain and simple,\" Sen. Elizabeth Warren, D-Mass., one of the Democratic presidential candidates, tweeted at the time. Rep. Jerry Nadler, D-N.Y., chairman of the House Judiciary Committee, said he would investigate what he called the \"most brazen\" example of how the president violates the emoluments clause of the U.S. Constitution. Trump faces several lawsuits questioning whether foreign leaders staying at his properties is a violation of the clause. \"He is exploiting his office and making official U.S. government decisions for his personal financial gain,\" Nadler said at the time. Democrats weren't alone in balking at the move. Sen. Lisa Murkowski, R-Alaska, told reporters it was not appropriate to use taxpayer dollars at a Trump resort. \"You have to go out and try to defend him. Well, I don’t know if I can do that!\" Rep. Mike Simpson, R-Idaho, told the Washington Post. \"I have no doubt that Doral is a really good place – I’ve been there, I know. But it is politically insensitive. They should have known what the kickback is going to be on this, that politically he’s doing it for his own benefit.\" The G-7 will take place June 10-12, 2020, less than five months before the U.S. presidential election in which Trump seeks a second term. The G-7 is a high-profile, annual gathering of leaders from the world's largest industrialized economies: the United States, Italy, Japan, France, the United Kingdom, Canada and Germany. The most recent took place in August in the resort town of Biarritz, France. Mulvaney initially appeared to dismiss Camp David out of hand. “I understand the folks who participated in it hated it and thought it was a miserable place to have the G-7,” he said. “It was way too small. It was way too remote. My understanding is this media didn’t like it because you had to drive an hour on a bus to get there either way.”",
      "date": "Published 10:18 p.m. ET Oct. 19, 2019 | Updated 10:46 p.m. ET Oct. 19, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "'Don't kid yourself:' Donald Trump tells Dallas rally the fate of democracy is at stake in 2020",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/10/17/donald-trump-dallas-rally-fate-democracy-stake-2020/4007362002/",
      "subtitle": "President Donald Trump is crediting his threat of sanctions on Turkey as \"tough love\" that led the country to agree to a five-day cease-fire with Kurds in northern Syria. Touting the agreement, Trump said it's \"a great day for civilization.\" (Oct. 17)\n    AP, AP",
      "author": "David Jackson,",
      "content": "   DALLAS – Capping a day of wild swings in the ongoing impeachment saga and the conflict in Syria, President Donald Trump told Texas supporters Thursday that next year's election puts \"the survival of American democracy itself\" at stake. \"Don't kid yourself,\" Trump said during a rowdy rally while attacking his Democratic opponents. \"They are destroying this country, but we will never let it happen.\" Democrats say Trump risked impeachment by abusing the power of his office and asking Ukraine to investigate a U.S. election opponent, former Vice President Joe Biden. As at other recent political rallies, Trump responded by questioning his opponents' patriotism in front of adoring supporters in a Republican-friendly state. The president peppered his speech with bracing claims that Democrats – \"leftists, socialists, and globalists\" – are trying to \"overthrow the results\" of the 2016 election. He called them \"crazy\" and \"sick\" and said he doesn't believe they love their country. Democrats said Trump's recent harsh rhetoric reflects another emotion: Fear. \"The fact that he feels the need to do a rally in Texas suggests to me that he knows that he is going to be impeached in the House,\" said Democratic strategist Jim Manley. \"And so he has to throw all this red hot rhetoric to his base to help build up a firewall in the Senate.\" He added: \"To me it’s a sign of weakness.\" The pro sports arena in Dallas where Trump rallied was nearly full, but not totally. Trump delayed his speech by some 40 minutes as fans filled in what had been empty upper decks behind the stage. \"Will be out shortly as we wait for more of you to get in!\" he tweeted about 20 minutes after his remarks were supposed to have started. Earlier in the afternoon, Trump hosted fundraisers in Fort Worth and attended the ribbon-cutting of a new Louis Vuitton factory before arriving at the American Airlines Center in downtown Dallas. As Trump traipsed through Texas, acting White House Chief of Staff Mick Mulvaney held a rare news briefing at the White House and said Trump held up financial aid to Ukraine – a central point in the impeachment investigation – because of concern about corruption in Kyiv. Mulvaney later rowed back on an assertion that Trump had wanted Ukraine officials to look into the 2016 election before freeing the money. Mulvaney also announced that Trump would host next year's G-7 economic summit at his golf club in Miami. Critics called it another example of Trump using his position to enrich himself. Vice President Mike Pence, meanwhile, was in Turkey negotiating a ceasefire in the Turkish invasion of Syria. Turkey agreed to halt its military assault in Syria for five days. Also during the Texas trip, Trump announced that Energy Secretary Rick Perry – who is involved in the Ukraine investigation – would be leaving the Cabinet by the end of the year. Trump praised Perry during the rally in Dallas, and touted the ceasefire as a way to withdraw U.S. troops from northern Syria. \"It was unconventional what I did,\" Trump said. \"Sometimes you have to let them fight a little while; then people find out how tough the fighting is ... It's like two kids ... you gotta let them fight and then you pull them apart.\" While attacking the impeachment inquiry, Trump defended his July phone call with the president of Ukraine by saying he only wanted to see an investigation of corruption. He accused Biden and his son Hunter Biden over the latter's business interests in Ukraine and China, though there is no evidence of wrongdoing. The Texas fans were in as aggressive a mood as Trump, cheering as Trump assailed \"Crazy Nancy\" Pelosi, the House Speaker who authorized the impeachment inquiry; Hillary Clinton, whom he defeated in the 2016 election; the Bidens; the \"fake news\" media; and critics in general. \"These crazy Democrats,\" he said at one point. Outside, as people lined up for the rally throughout the day, vendors hawked T-shirts that included one with an image of Trump urinating on a CNN logo. Another said, \"roses are red/violets are blue/you're a LIBERAL/this for you\" next to an image of Trump giving the finger. One seller used a bullhorn to advertise that \"I've got the 'Impeach Nancy Pelosi' hat!\" Inside the arena, as Trump prepared the speech, one supporter kept yelling \"fake news!\" at the denizens of the press pen. Trump has been notably more aggressive on the campaign trail since Democrats launched their impeachment inquiry, throwing around words like \"crazy\" and \"hateful\" to describe his opponents. He is also aggressively defending his decision to withdraw U.S. troops from northern Syria, effectively allowing an invasion by Turkey that has caused much bloodshed. Even normally supportive Republicans like Sen. Lindsey Graham, R-S.C., criticized Trump's sudden decision, and both houses of Congress are poised to pass bipartisan resolutions condemning the move. While Trump is a strong favorite to carry Texas again in 2020, Democrats are making a big push in the Lone Star State by appealing to growing Hispanic and urban populations. About 15 miles away in Grand Prairie, Democratic presidential Beto O'Rourke, who narrowly lost a Senate race in Texas just last year, held a rally of his own to denounced Trump. One prominent local Democrat, Dallas County Judge Clay Jenkins, said Trump wouldn't be holding a big rally in such a supposedly Republican state \"if he was not scared\" of losing it in 2020. Citing issues like immigration and heath care, Jenkins said that \"Trump has failed this state time and time again,\" and Texas Democrats are poised to take advantage in 2020. \"Trump is terrified of losing this election,\" Jenkins said. Trump and his allies scoffed at the thought. The idea that \"Texas is in play\" is \"a hoax,\" Trump said. Aides said Trump visits Texas and other large Republican states because he has so many supporters – and donors – in those places. \"You have to go campaign and show love to the people who got you here,\" said campaign spokesman Tim Murtaugh. \"Did people think he was never going to campaign in Texas?\"",
      "date": "Published 10:51 p.m. ET Oct. 17, 2019 | Updated 8:22 a.m. ET Oct. 18, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Noah reveals the genius of Donald Trump in Best of Late Night",
      "url": "https://www.usatoday.com/story/opinion/best-of-late-night/2019/10/18/noah-reveals-genius-donald-trump-best-late-night/4021284002/",
      "subtitle": "This week was busier than most for the Trump administration. Trevor Noah and Jimmy Kimmel take a look.\n    Eileen Rivers, USA TODAY Opinion",
      "author": "Eileen Rivers",
      "content": " This was a busy week for President Donald Trump or, as late-night comic Trevor Noah points out, a busy 24 hours. In that time, he and his administration racked up about half-a-dozen scandalous moments (a potential record). Among them: Energy Secretary Rick Perry resigned (causing Jimmy Kimmel to wonder how one of the longest-standing members of Trump's Cabinet will react); House Speaker Nancy Pelosi and Trump got into an \"I know you are but what am I\" contest (Noah explains, above); and an ambassador drops a bomb during his testimony about the Ukraine scandal. And all of this somehow contributes to Trump's genius. How? Noah reveals all in today's Best of Late Night, above. After you watch our favorite jokes from last night's late-night lineup, vote for yours in the poll below. Follow Eileen Rivers on Twitter @msdc14. Want more laughs? Check out these cartoon galleries:",
      "date": "Published 3:10 p.m. ET Oct. 18, 2019 | Updated 3:12 p.m. ET Oct. 18, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    }
  ]
}