{
  "articles": [
    {
      "title": "",
      "url": "",
      "subtitle": "",
      "author": "",
      "content": "   ",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Forget Donald Trump, Republicans. Save the GOP for the sake of your party's future.",
      "url": "https://www.usatoday.com/story/opinion/2019/10/17/forget-donald-trump-republicans-save-gop-future-editorials-debates/3979356002/",
      "subtitle": "null",
      "author": "",
      "content": "It has long been said that Republicans ought to put country over party and stop defending the indefensible behavior of President Donald Trump. For the most part, this argument has fallen on deaf ears for the obvious reason that Trump still enjoys the support of the very same rank-and-file voters whom Republican lawmakers face in primary elections. A better argument might be that Republicans need to stand up to Trump — for the sake of their party's future. Some GOP lawmakers have, to their credit, challenged the president on foreign policy issues such as Russian sanctions and Trump's hasty, ill-conceived decision to withdraw from Syria. But in repeatedly turning a blind eye to his abuses of office, the GOP is branding itself as bankrupt of principle and interested only in clinging to power. More ominously, the GOP is turning independent voters against it and abandoning positions — such as support for law and order, fiscal responsibility, science, free trade, ethics in government and standing up to dictators abroad — that long formed its political high ground. For much of Trump's first 1,000 days in office, a party that supposedly values the rule of law sat by as the president attacked prosecutors and judges who dared to question his actions. More recently, nearly all of its ostrich-like officeholders have put their heads in the sand as Trump used the power and prestige of the United States to pressure Ukraine to investigate a potential general election opponent, former Vice President Joe Biden. This is the same party that tried to politicize a tragedy at a U.S. compound in Benghazi, Libya, in 2012 to make it look like a Hillary Clinton scandal. It is also the party that impeached President Bill Clinton in 1998 after he had an affair with a former White House intern. As the chart below shows, many of the same Republicans who were quick to impeach or convict then are now drooling poodles on Trump's lap. RNC: The future for Republicans, and America, has never looked brighter If the GOP doesn’t recover its values, it will be hard to take the party seriously when it claims that a Democrat is doing something wrong. Its candidates, moreover, will struggle to articulate what their party stands for: ►Family values? Not when the president brags of grabbing women and pays hush money to a porn star. ►The rule of law and constitutional governance? Not when the president misuses his powers for political gain. ►Limited government? Not when the president uses levers of power to go after the head of Amazon, the chairman of the Federal Reserve, the state of California, the auto industry, America’s closest allies and many others — simply because they refuse to carry his water. ►Concern for conflicts of interest? Not when the president selects one his own resorts to host the summit of the Group of Seven major industrial nations. (One can only imagine how Republican politicians and conservative media outlets would have reacted if a Democratic president had done the same.) To be sure, Republican lawmakers are politicians who can't ignore their constituents. But they are also the stewards of the GOP’s future who shouldn't be cowering in fear of nasty tweets. How is it going to help conservatives get elected if their party has offended large swaths of the electorate? How is toleration for self-dealing and misuse of power going to be a selling point? As they contemplate these questions, they might actually find that doing the right thing turns out to be the politically expedient thing. Rep. Robert Aderholt, Ala. Sen. (then-Rep.) Roy Blunt, Miss. Rep. Kevin Brady, Texas Sen. (then-Rep.) Richard Burr, N.C. Rep. Ken Calvert, Calif. Rep. Steve Chabot, Ohio Sen. (then-Rep.) Mike Crapo, Idaho Sen. Mike Enzi, Wyo. Sen. (then-Rep.) Lindsey Graham, S.C. Rep. Kay Granger, Texas Sen. Charles Grassley, Iowa Sen. James Inhofe, Okla. Rep. Frank Lucas, Okla. Sen. Mitch McConnell, Ky. Sen. (then-Rep.) Jerry Moran, Kan. Sen. (then-Rep.) Rob Portman, Ohio Sen. Pat Roberts, Kan. Rep. Hal Rogers, Ky. Rep. Jim Sensenbrenner, Wis. Sen. Richard Shelby, Ala. Rep. John Shimkus, Ill. Rep. Chris Smith, N.J. Rep. Mac Thornberry, Texas Sen. (then-Rep.) John Thune, S.D. Rep. Fred Upton, Mich. Sen. (then-Rep.) Roger Wicker, Miss. Rep. Don Young, Alaska If you can't see this reader poll, please refresh your page.",
      "date": "Published 5:52 p.m. ET Oct. 17, 2019 | Updated 5:58 p.m. ET Oct. 17, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Hillary and Chelsea Clinton are writing their first book together about 'gutsy' women through history",
      "url": "https://www.usatoday.com/story/entertainment/books/2019/08/06/hillary-clinton-and-chelsea-clinton-writing-book-gutsy-women/1930237001/",
      "subtitle": "Chelsea Clinton reads from her new children's book about endangered animals, at Bronx Zoo. (May 3)\n    AP",
      "author": "",
      "content": "NEW YORK (AP) — Hillary Rodham Clinton and Chelsea Clinton have teamed up for “The Book of Gutsy Women,” honoring everyone from scientist Marie Curie to climate activist Greta Thunberg. Simon & Schuster announced Tuesday that the book will come out Oct. 1. It’s the first time the former secretary of state and presidential candidate has written a book with her daughter. Each has published several previous works, including Hillary Clinton’s “What Happened” and “Living History” and Chelsea Clinton’s children’s book “She Persisted: 13 American Women Who Changed the World. ” “The Book of Gutsy Women” includes portraits of more than 100 women, including presidential candidate Shirley Chisholm, Saudi activist Manal al-Sharif, entertainer Ellen DeGeneres and author Chimamanda Ngozi Adichie. The Clintons also will tell of heroines among their friends and family members. “To us, they are all gutsy women — leaders with the courage to stand up to the status quo, ask hard questions, and get the job done,” Hillary Clinton said in a statement. “This book is a continuation of a conversation Chelsea and I have been having since she was a little girl, and we are excited to welcome others into that conversation.” Chelsea Clinton said in a statement that the women in their book “share a fierce optimism that their work and lives will make a difference in the world.” “We hope readers will draw strength from their stories as we have, because if history shows one thing, it’s that the world needs more gutsy women,” she said. Financial terms for the book were not disclosed. The Clintons were represented by Robert Barnett, the Washington, D.C. attorney who has worked on book deals for Hillary Clinton, former President Bill Clinton and former President Barack Obama. Chelsea Clinton welcomes baby No. 3, Hillary and Bill are 'so thrilled' Mariah Carey makes her politics clear, posts photos of 'President Clinton and her husband'",
      "date": "Published 6:47 a.m. ET Aug. 6, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Twitter loves Hillary Clinton's 'epic' 'Truth Hurts' tweet: 'I just took a DNA test...'",
      "url": "https://www.usatoday.com/story/entertainment/celebrities/2019/08/21/twitter-stans-hillary-clintons-epic-truth-hurts-tweet-im-dead/2071011001/",
      "subtitle": "null",
      "author": "Erin Jensen",
      "content": " There are many on Twitter \"with her\" after Hillary Clinton responded to a tweet from singer Lizzo Wednesday. The day prior, the \"Juice\" singer tweeted a clip from a Democratic presidential debate with then-candidates like Clinton and Bernie Sanders on their feet for the national anthem. Only instead of \"The Star-Spangled Banner,\" Lizzo's \"Truth Hurts\" plays instead: \"Why men great 'til they gotta be great?\" Clinton responded with the next line of the track, stopping before an expletive is dropped. \"I just took a DNA test, turns out...\" she tweeted. The line is: \"I just took a DNA test, turns out I'm 100% that (expletive).\" Members of the Twitterverse promptly lost their minds. Some shared GIFs of people falling to the floor. \"HILLARRRYYYYYYYYY I’m dead,\" a user said in response. Hillary and Chelsea Clinton are writing their first book together about 'gutsy' women through history Lizzo, the flute-playing singer, is back in the studio with a 'really different' sound \"simply epic ma’am\" another gushed. \"Yaaaaaas Madam President!\" a person cheered. \"#StillWithHer\" Others filled in the rest of Clinton's sentiment. \"I 100% won the popular vote,\" a person posted, recalling Clinton beat Trump by millions of votes. \"I am 1000% more intelligent than Donald Trump!\" read another tweet. Lizzo calls Summerfest security guard a 'racist bigot,' says he attacked her team Chelsea Clinton welcomes baby No. 3 and her parents are 'so thrilled'",
      "date": "Published 11:09 a.m. ET Aug. 21, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "'Debunked': Hillary Clinton slams Trump's claim of voter manipulation",
      "url": "https://www.usatoday.com/story/news/politics/2019/08/20/hillary-clinton-responds-trump-tweet-google-vote-manipulation/2059138001/",
      "subtitle": "President Trump questioned the financial side of the New York Times and said the paper will endorse him in 2020 just to keep their business going.\n    Buzz60, Buzz60",
      "author": "Nicholas Wu",
      "content": " WASHINGTON – Former Democratic presidential nominee Hillary Clinton responded on Monday to President Donald Trump's claim that Google had \"manipulated from 2.6 million to 16 million votes\" for her in the 2016 election by noting that the study Trump appeared to be referring to was \"debunked.\" Clinton said on Twitter the study was actually \"based on 21 undecided voters.\" She added, \"For context that’s about half the number of people associated with your campaign who have been indicted.\" She had been referring to Trump's post earlier Monday about alleged voter fraud in the 2016 election. Trump had said on Twitter that because of Google's misdeeds, \"Google must be sued\" and added that his electoral victory should have been larger. PolitiFact, a nonpartisan fact-checking website, rated Trump's claim \"false.\" The site noted that Trump appeared to be referring to a 2017 research paper by psychologists Robert Epstein and Ronald Robertson. The paper had claimed that users' search results were biased in favor of Clinton, which could have possibly shifted votes to her. The paper's methodology and findings have been questioned by other academics. who said the paper had failed to adequately explain its methodology or even define what \"bias\" was. More: Donald Trump touts voter ID laws as an issue in the 2020 election. Here’s why. More: FEC chair Ellen Weintraub on Trump claims: 'No evidence of rampant voter fraud in 2016' When reached by the outlet, Epstein said Trump mischaracterized his work. \"I have never said that Google deliberately manipulated the 2016 election,\" he told PolitiFact. Epstein and Robertson had hedged their findings in their paper, too. \"We don’t know what caused these patterns of bias,\" wrote Epstein and his co-author in the paper. Trump has frequently vented about his loss in the popular vote to Clinton. Trump won the electoral vote but lost the popular vote to Clinton by several million votes, and Trump has claimed that millions of Americans voted illegally for Clinton. The president has not provided evidence for these claims.",
      "date": "Published 6:55 a.m. ET Aug. 20, 2019 | Updated 8:45 a.m. ET Aug. 20, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Senate report calls for action against foreign election interference amid Trump-Ukraine controversy",
      "url": "https://www.usatoday.com/story/news/politics/2019/10/08/senate-russia-helped-trump-against-clinton-2016/3909680002/",
      "subtitle": "Russia interfered in the 2016 presidential elections and helped Donald Trump win. We look back at history and ask: Will they do it again?\n    Just the FAQs, USA TODAY",
      "author": "Nicholas Wu",
      "content": " WASHINGTON – A new report released by the Senate Intelligence Committee on Russian interference in the 2016 election has concluded that Russia acted to boost Donald Trump at the expense of Democratic nominee Hillary Clinton and delivers a call for future action to prevent foreign election interference. The report's release comes as controversy swirls around President Donald Trump's requests to foreign nations to open investigations into his political opponent former Vice President Joe Biden. Trump asked Ukrainian President Volodymyr Zelensky to investigate the Biden family and has also called on China to investigate them as well, though China said it would reject the request. The report says that the Kremlin-backed Internet Research Agency (IRA) \"sought to influence the 2016 U.S. presidential election by harming Hillary Clinton’s chances of success and supporting Donald Trump at the direction of the Kremlin.\" Russia has denied any involvement in the 2016 election interference, though Russian President Vladimir Putin has joked about future interference in the 2020 election. The IRA's activities were part of \"a broader, sophisticated, and ongoing information warfare campaign designed to sow discord in American politics and society\" the committee wrote. More: China rejects Trump's request to investigate Joe Biden, hoping to steer clear of U.S. politics More: 'Don't tell anyone': Putin jokes about Russia meddling in 2020 election Among other controversial issues, Russia attempted to inflame tensions around race and \"targeted African-Americans more than any other group or demographic.\" Sen. Kamala Harris, D-Calif., a Democratic presidential candidate, warned of future efforts to suppress African American voters and called on social media companies to hire more diverse staff in order to recognize future attempts to exploit racial tensions. “Russian operatives fraudulently posed as Black Americans to actively discourage the Black community from voting,\" Harris said in a statement. \"Social media companies must step up their efforts to fight disinformation and remove inflammatory content on their platforms, including by ensuring their workforces are diverse enough to identify and understand the cultural nuances that foreign actors exploit to divide and harm Americans. According to the Committee, the election interference efforts did not end with the 2016 election. The IRA actually increased its efforts after the conclusion of the 2016 election, in what Senate Intelligence Committee Chair Richard Burr described as a \"broader\" goal \"to sow societal discord and erode public confidence in the machinery of government,\" said Burr, warning of other election interference efforts by countries like China, North Korea, and Iran.\" The Committee concluded its findings with a call to action and efforts to fight back against future election interference. More: Donald Trump defends Syria policy, saying US is not abandoning Kurds by withdrawing troops As part of an effort to fight back against future interference, the Senate Intelligence Committee says \"the Executive Branch should, in the run up to the 2020 election, reinforce with the public the danger of attempted foreign interference in the 2020 election.\" They recommend the creation of an interagency task force to combat misinformation efforts and a public information campaign against foreign interference. Additionally, the Committee wants Congress to \"establish guardrails\" around social media to prevent future efforts. “Congress must step up and establish guardrails to protect the integrity of our democracy. At minimum, we need to demand transparency around social media to prevent our adversaries from hiding in its shadows,\" said Sen. Mark Warner, the top Democrat on the Committee.",
      "date": "Published 2:40 p.m. ET Oct. 8, 2019 | Updated 5:07 p.m. ET Oct. 8, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "'Found my emails': Hillary Clinton flips through her emails at an Italian art exhibit",
      "url": "https://www.usatoday.com/story/news/politics/2019/09/11/hillary-clinton-leafs-through-her-emails-italian-art-exhibit/2295637001/",
      "subtitle": "Hillary Clinton visited an art exhibition in Venice, Italy where 62,000 pages of her emails were displayed.\n    USA TODAY",
      "author": "Savannah Behrmann",
      "content": " WASHINGTON-- Hillary Clinton, former secretary of State and the 2016 Democratic presidential nominee, spent time Tuesday leafing through her emails that were on display at an art exhibit in Italy. Clinton, whose 2016 campaign was shadowed by lingering questions after an FBI investigation into her use of a private email server while leading the State Department, sat at a replica of the Oval Office Resolute Desk and thumbed through thousands of emails during a visit to an art exhibit in Venice titled \"HILLARY: The Hillary Clinton Emails.\" According to the description from exhibit co-organizer Zuecca Projects, the exhibit makes public “for the first time in printed format” some 60,000 pages of Clinton’s emails which, according to WikiLeaks, “were sent from the domain clintonemail.com between 2009 and 2013.” \"Hillary Clinton spent an hour yesterday reading her emails at my exhibition of all 62,000 pages of them in Venice,\" Artist Kenneth Goldsmith tweeted. The former Democratic presidential candidate and first lady was “guided on a closed-door visit” of the exhibition, the curators say in a statement. \"I think the scene was so extraordinary that many customers believed that she was just a lookalike at first,\" the show's curator, Francesco Urbano Ragazzi, told the Huffington Post. Clinton posted a picture of herself at the exhibit Instagram, saying that she \"found\" the emails, so someone needed to \"alert the House GOP.\" Answering reporters questions outside the exhibit, Clinton told Italian news outlet TGR Veneto, \"It was and is still one of the strangest, most absurd events in American political history.\" \"And anyone can go in and look at them -- there's nothing there,\" Clinton says. \"It's an artistic way of making the same point that I made in the book I wrote, 'What Happened,' and that is, there was nothing wrong, there was nothing that should have been so controversial.\" On Twitter on Thursday morning, she said: \"Found my emails at the Venice Biennale. Someone alert the House GOP.\" During the 2016 White House race, then-candidate Donald Trump highlighted the long-simmering controversy surrounding Clinton’s usage of a private email server during her tenure as secretary of State, and chants of “lock her up” would often break out at his campaign rallies. Then-FBI Director James Comey penned a letter to lawmakers after the investigation that stated the FBI stood by its original findings, made in July of 2016, that Clinton should not be prosecuted for her handling of classified information over email while secretary of State. The often-derided refrain of \"but her emails\" was heard on the trail and on social media during the 2016 campaign to justify support for Donald Trump over Clinton. The remark was often attributed to Clinton opposers who were searching for a way to offset the latest negative news about Trump. Clinton was reportedly already in Italy to attend an economic forum. In a statement provided to the Hill, the curatorial team said “The exhibition is a way to allude to an alternative world that will never exist. We are happy that the real Hillary Clinton has been part of this image full of possibilities. \"The exhibition is indeed the portrait of a powerful woman, but also the portrait of a historical change in our understanding of notions such as transparency, propaganda, public and private space,” they also said. Contributing: William Cummings, USA TODAY",
      "date": "Published 10:13 p.m. ET Sept. 11, 2019 | Updated 5:43 p.m. ET Sept. 12, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Could Chelsea Clinton run for a New York House seat?",
      "url": "https://www.usatoday.com/story/news/politics/2019/10/11/chelsea-clinton-make-run-nita-loweys-house-seat-2020/3946455002/",
      "subtitle": "Chelsea Clinton reveals the inspiration behind her new book, 'Start Now!' and tells why she responds to bullying on Twitter. (Oct. 4)\n    AP",
      "author": "Swapna Venugopal Ramaswamy",
      "content": " The internet was abuzz with speculation this week on whether Chelsea Clinton would throw her hat in the political ring after longtime Rep. Nita Lowey, D-N.Y., announced Thursday that she would not seek re-election in 2020. After all, rumors of Clinton, 39, being groomed for New York's 17th Congressional District, have long been circulating. The district represents Rockland County and part of Westchester County, including Chappaqua, where her parents, former president Bill Clinton and Hillary Clinton, live. In an interview with The Journal News/lohud.com last year, Chelsea Clinton said she would consider a political run under certain circumstances. “I think if someone were to step down or retire and I thought I could do a good job and it matched my talents, I’d have to think if it’s the right choice for me,” she said. While she didn’t have any immediate plans to run for office, she told the paper, it was something she thought about. “If you care about what’s happening in the world, you have to care about running for and holding elected office,” she said. “I hope it’s a question that we ask ourselves.” Chelsea Clinton's spokeswoman did not respond to an email this week about her plans, but whether she'll run is a question many are asking. On Twitter, PopularismUpdates posted a side-by-side photo of Chelsea and Hillary Clinton (who recently caused a Twitter storm of her own with her “Don’t tempt me” response to President Donald Trump tweet urging her to run) tweeting: “Today Nita Lowey the Democratic representative for NY 17th Congressional District announced she is retiring. Chelsea Clinton has been speculated to run for this seat. America, it's not too late. Come 2020 we could have them BOTH in office at the same time.” Chelsea Clinton does not live in the district, but unlike her mother, who had to establish residency in New York when she ran for a Senate seat in 2000, she would not have to engage the services of a real estate agent any time soon. Members of the House of Representatives are not required to live in the district they represent; they are required to be at least 25 years old, have been a U.S. citizen for at least seven years, and live in the state they represent. Chelsea Clinton lives in Manhattan with her husband and three children, but could easily relocate to the 17th District by moving next door to her parents in Chappaqua. The Clintonsbought the neighboring 3,600-square-foot home at 33 Old House Lane for $1.16 million in August 2016. Referring to reports it would be used as a getaway home for the couple's daughter and her family, Roni Jacobson, who has lived on Old House Lane since 1984, said when the Clintons bought the house: \"It's a perfect house for (their daughter) Chelsea. Perfect mother-daughter situation. The neighbors are delighted for them.\" What does Lowey, the first woman to lead the powerful House Appropriations Committee, think about a possible Clinton run? \"She can do whatever she wants. She’s an adult,\" said Lowey in an interview with The Journal News/lohud last November. \"When I decide to retire, I am sure the list will be very long (of people interested in the seat).” More: Here are the lawmakers who aren't running again in 2020 On Sunday, Hillary and Chelsea Clinton will be in Hyde Park where Chelsea is set to receive the Eleanor Roosevelt Val-Kill Medal — which honors the legacy of the late first lady — at the Eleanor Roosevelt National Historic Site in Hyde Park. She'll be presented the medal by her mother, a former honoree. The mother-daughter duo have also been hitting the talk show circuit and making public appearances to promote their new book, \"The Book of Gutsy Women: Favorite Stories of Courage and Resilience.\" On Dec. 2, they will speak at the Chappaqua Performing Arts Center for an event sponsored by the Chappaqua Public Library. Swapna Venugopal Ramaswamy covers women and power for the USA Today Network Northeast. Write to her at svenugop@lohud.com SECOND HOME: Clintons buy adjacent Chappaqua home for $1.16 M LOWEY ANNOUNCEMENT: Longtime Rep. Nita Lowey won't seek reelection in 2020 REACTION:Chuck Schumer, Nancy Pelosi react to Rep. Nita Lowey's retirement WHO'LL RUN?: Chelsea Clinton, Rob Astorino: Who could run for Nita Lowey's seat?",
      "date": "Published 3:58 p.m. ET Oct. 11, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Chelsea Clinton says she won't run for Nita Lowey's New York House seat in 2020",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/10/16/chelsea-clinton-congress-nita-lowey-us-house-of-representatives/3998039002/",
      "subtitle": "Amid speculation that she may run for congress, Chelsea Clinton criticized leadership while receiving the Eleanor Roosevelt Val-Kill Medal.\n    Seth Harrison/lohud, The Journal News/lohud",
      "author": "Mark Lungariello",
      "content": " Chelsea Clinton ended speculation that she might run for Congress next year during an appearance on the talk show \"The View\" on Wednesday. Clinton, 39, emerged as a possible candidate immediately following 30-year Rep. Nita Lowey's announcement on Thursday she wouldn't seek reelection in 2020. She was considered a frontrunner in what is expected to be a crowded field, even though Clinton herself never said she was considering entering the race. On Wednesday, she directly addressed the rumors. \"I'm not considering running for Congresswoman Lowey's seat,\" Clinton said in response to a question from co-host Whoopi Goldberg. Chelsea Clinton: Could Chelsea Clinton run for a New York House seat? Clinton, daughter of former President Bill Clinton and U.S. Secretary of State Hillary Clinton, said she understood why people asked her about running. \"Someone has asked me some version of this question literally as long as I can remember,\" she said before recounting that she remembers being asked if she'd run for governor of Arkansas at age 3 or 4. \"I share that because I think it’s a question that shouldn’t just be asked of people whose last name is Clinton or Huntsman,\" she said, referring to co-host Abby Huntsman, the daughter of former Utah governor and U.S. Ambassador to Russia Jon Hunstman. \"It’s a question we should be asking kids, like, 'Do you think about running for office one day?'\" she said. \"I hope that if the answer to that question is, 'Yes, I'm considering it,' that you'll really think about doing it and go to run for something.\" She said she wasn't sure if she'd run for office one day, but \"right now, the answer's no.\" October debate: Here are the winners and losers from Tuesday's Democratic debate Lowey, 82, is a longtime fixture in New York's 17th Congressional District, which includes Rockland County and part of Westchester County. Clinton's parents have lived in the ritzy hamlet of Chappaqua in the Westchester part of the district since leaving the White House at the turn of the century. Chelsea Clinton lives outside of the district in New York City, but the U.S. Constitution doesn't require a House member to live within the district he or she represents. Lowey, chairwoman of the powerful House Appropriations Committee, is the first woman to head the committee. Since the district is reliably blue and overwhelmingly Democratic, her retirement has sparked interest from a number of local Democrats. 'To me it will always be Columbus Day.': Trump dismisses criticism of Christopher Columbus But the Clinton name propelled her to the front of the pack without so much as a public statement from the would-be candidate, and drew comparisons to Lowey's own abandoned U.S. Senate race in 2000. The congresswoman, a Harrison resident, had eyed a run for the Senate seat that year but stepped aside to allow Hillary Clinton a clear path to the nomination. Hillary Clinton went on to win election against Republican Rick Lazio. In 2006, she won reelection to the Senate against former Westchester County District Attorney Jeanine Pirro, now a Fox News host and friend of President Donald Trump. Clinton left the Senate in 2009 after running unsuccessfully for president to become President Barack Obama's Secretary of State. With Chelsea Clinton out of the running for the seat, there are two Democrats who are officially seeking the party nomination: David Buchwald, a state Assemblyman from White Plains who once interned for Lowey, and Mondaire Jones, who launched a primary challenge from the left in July well before Lowey's announcement she wouldn't seek reelection. Debate: CNN slammed for asking about Ellen, but not climate change, at Democratic debate Jones, 38, grew up in Spring Valley and attended Harvard Law School, raised $218,000 since launching his candidacy with the goal of becoming the first gay black man elected to Congress. Registered Democrats outnumber Republicans by more than 2-to-1 in the 17th district, according to state Board of Elections figures. Registered voters without party affiliation also outnumber Republicans in the district, 110,000-103,000, according to state active voter numbers. Follow Mark Lungariello on Facebook: @lungariello; and Twitter: @marklungariello.",
      "date": "Published 12:32 p.m. ET Oct. 16, 2019 | Updated 1:57 p.m. ET Oct. 16, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Calling Trump a 'corrupt human tornado,' Hillary Clinton backs impeachment",
      "url": "https://www.usatoday.com/story/news/politics/2019/09/24/hillary-clinton-backs-trumps-impeachment-over-ukraine-call/2433661001/",
      "subtitle": "President Donald Trump is defending his decision to withhold $250 million in aid to Ukraine at the same time he was asking the country's leader to investigate the son of political rival Joe Biden. (Sept. 24)\n    AP, AP",
      "author": "Savannah Behrmann",
      "content": " WASHINGTON — Former Secretary of State Hillary Clinton, who ran against Donald Trump in the 2016 presidential election, said in an interview exerpt released Tuesday that she is “favor of moving toward impeachment” and that \"we are in a crisis.\" “I did not come to that decision easily or quickly, but this is an emergency as I see it,” Clinton told PEOPLE. “This latest behavior around Ukraine, trying to enlist the president of Ukraine in a plot to undermine former Vice President Biden or lose the military aid he needs to defend against Trump’s friend, Vladimir Putin — if that’s not an impeachable offense, I don’t know what is.” The former first lady called Trump a “corrupt human tornado,” continuing that “the president of the United States is betraying our country on a daily basis.” “This man who is in the Oval Office right now is a clear and present danger to the future of the United States,” she added. The interview was published minutes after House Speaker Nancy Pelosi announced a formal impeachment inquiry into Trump over the president's efforts to get Ukraine to investigate former vice president Joe Biden and his son's business dealings in the Eastern European country. More: Read Nancy Pelosi's full remarks as she called for an impeachment inquiry of President Trump \"The president must be held accountable. No one is above the law,\" said Pelosi, who accused Trump of betraying his oath of office and endangering national security. Additionally, Clinton's comments for impeachment came after a flood of Democrats, some of whom had previously held out against impeachment, joined the effort. Trump tweeted after Pelosi’s announcement that the inquiry was “presidential harassment” and a “total witch hunt.” Trump and his personal attorney Rudy Giuliani have pushed claims for months that Biden as vice president sought the ouster in 2016 of Ukraine’s then-prosecutor general Viktor Shokin to stop an investigation into Burisma Group, a Ukrainian energy company where his son Hunter served on the board of directors. The push by the vice president came alongside calls for Ukraine to get rid of Shokin from European diplomats and the U.S. State Department because international leaders said Shokin did too little to fight corruption in the Eastern European country. The Ukrainian Parliament voted Shokin out. Ukrainian officials have found no evidence of wrongdoing by Biden or his son. Contributing: Bart Jansen and Christal Hayes",
      "date": "Published 6:10 p.m. ET Sept. 24, 2019 | Updated 9:00 p.m. ET Sept. 24, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Hillary Clinton questions Pompeo's handling of Trump's Ukraine call and mocks Giuliani",
      "url": "https://www.usatoday.com/story/news/politics/2019/10/01/hillary-clinton-mike-pompeo-late-show/3828685002/",
      "subtitle": "Whistleblowers have been at time essential and detrimental to a country's democracy, but what makes them different than a leaker? We explain.\n    Just the FAQs, USA TODAY",
      "author": "William Cummings",
      "content": " During an appearance on CBS' \"Late Show with Stephen Colbert\" on Monday, former Secretary of State Hillary Clinton took issue with his handling of the phone call between President Donald Trump and Ukrainian President Volodymyr Zelensky that helped prompt an impeachment inquiry. \"How many times, when you were secretary of state, did you have to say to Barack Obama, 'You can't extort foreign countries to get dirt on your political enemies'?\" Colbert jokingly asked Clinton. \"Yeah, that never happened,\" Clinton replied, laughing. \"The secretary of state's job is to make sure that he knows, number one, what the president is going to say on those calls,\" she said. \"These are usually highly prepared calls.\" According to media reports, Secretary of State Mike Pompeo was one of the officials who listened in on Trump's call in which the president asked Zelensky to investigate former Vice President Joe Biden and his son, Hunter Biden. \"If the secretary of state was on the call, as is now being reported, he should have been one of the very first people to just say, 'Wait a minute, we have to clean this up. You can't let that stand.'\" Clinton said. \"But we don't know what he did.\" Colbert asked how she would have reacted – when she was America's top diplomat – to the president sending out his personal attorney to \"handle foreign policy,\" a nod to Rudy Giuliani's admission that he contacted Ukrainian officials at the direction of the State Department. Pompeo: Democrats' impeachment inquiry an effort to 'intimidate, bully' State Dept. workers Full text: Read the summary of President Trump's call with Ukraine president about Biden \"Presidents often use – as do secretaries of state – they might use an envoy or a special adviser to deliver a message,\" she said. \"But again, it is supposed to be carefully thought through. And from what we’ve seen on television, carefully thinking through is not one of Rudy’s strong points.\" Clinton appeared on the \"Late Show\" with her daughter Chelsea Clinton to promote their new book, \"The Book of Gutsy Women: Favorite Stories of Courage and Resilience.\" Colbert warned that the book would have to be discussed later in the segment because it was \"Ukraine week\" and an impeachment inquiry was underway. \"Is it time to – dare I say – lock him up, lock him up?\"  Colbert asked, beginning to pump his fist. \"Lock him up,\" the crowd began to chant. 'This is a moment of reckoning': Hillary Clinton praises Pelosi for impeachment inquiry More: Calling Trump a 'corrupt human tornado,' Hillary Clinton backs impeachment Clinton said an impeachment inquiry to examine the evidence was \"exactly what should be done.\" She said this alleged abuse of power by Trump was resonating with voters. \"We've known for a long time that he was a corrupt businessman who cheated people. And we've known that he and his campaign asked for aid from Russia. We've known that,\" she said. \"But to see him in the office of the president, putting his own personal and political interests ahead of the national security of our country, just pierced through whatever confusion or denial people had.\" Poll: Support for Trump's impeachment over Ukraine jumps 8 points in one week More: Americans approve of impeachment probe by slim margin, split on removal from office",
      "date": "Published 1:10 p.m. ET Oct. 1, 2019 | Updated 11:35 a.m. ET Oct. 2, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "'This is a moment of reckoning': Hillary Clinton praises Pelosi for impeachment inquiry",
      "url": "https://www.usatoday.com/story/news/politics/2019/09/27/hillary-clinton-praises-nancy-pelosi-impeachment-inquiry/3785377002/",
      "subtitle": "Impeaching a U.S. president might not be the be-all-end-all for their career. We explain why this is the case.\n    Just the FAQs, USA TODAY",
      "author": "Rebecca Morin",
      "content": " WASHINGTON – Former Secretary of State Hillary Clinton praised Nancy Pelosi Thursday for opening an impeachment inquiry into President Donald Trump after he urged the Ukraine president to investigate Democratic presidential candidate Joe Biden over Biden's son's connections to a Ukrainian gas company. Clinton, who was Trump's Democratic presidential opponent in 2016, said Thursday evening that Pelosi is not making a \"political statement\" and is instead confronting a \"harsh reality.\" \"This is a moment of reckoning, a historic moment, and I'm very grateful to Speaker Pelosi for her leadership,\" Clinton said Thursday during a speech at the NARAL Pro-Choice America 50th anniversary dinner. Clinton was receiving NARAL's Lifetime Achievement Award. More: As whistleblower report on Trump and Ukraine reverberates through Washington, scandal will test Pence Pelosi opened an impeachment inquiry into Trump's actions during a July phone call with Ukraine President Volodymyr Zelensky. A whistleblower issued a complaint on the phone call, expressing concern that Trump \"used the power of his office\" to solicit foreign help to discredit Biden during his call with the Ukrainian president. Since Pelosi's announcement, Clinton has said she is in favor of impeachment. Clinton said Thursday that Pelosi has \"addressed the question of impeachment is exactly in line with what a sobering decision she had to make.\" \"This occupant of the Oval Office poses a clear and present danger to our future, to our democracy,\" Clinton said. Clinton continued criticize Trump during her remarks, saying that \"we have known who Donald Trump is for some time now.\" \"We knew he was a corrupt businessman who cheated people,\" she said. \"We knew that his campaign invited foreign adversaries to tamper with our elections. And now we know that in the course of his duties as our president, he's endangered us all by putting his personal and political interests ahead of the interests of the American people.\" 'Almost a spy': Donald Trump suggests whistleblower source committed treason as Ukraine firestorm builds Trump has in the past criticized Clinton, often referring to her as \"Crooked Hillary.\" Clinton also warned that \"there's so much more at stake\" for this impeachment inquiry than just Trump's call with Zelensky. \"We are living through a crisis in our democracy,\" she concluded.",
      "date": "Published 10:41 a.m. ET Sept. 27, 2019 | Updated 11:13 a.m. ET Sept. 30, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Save up to $1,800",
      "url": "https://www.usatoday.com/story/news/politics/2019/10/01/hillary-clinton-gutsiet-thing-ive-ever-done-stay-my-marriage/3835228002/",
      "subtitle": "Hillary Clinton on Thursday said President Donald Trump, the man who beat her in the 2016 election, posed a \"clear and present danger\" to the future of the country. Clinton was speaking at an event in Washington, DC. (Sept. 27)\n    AP, AP",
      "author": "Savannah Behrmann",
      "content": " WASHINGTON — Former Secretary of State and presidential candidate Hillary Clinton said Tuesday that the “gutsiest” personal thing she's ever done was \"stay in my marriage.\" The frank comments from Clinton came as she and her daughter, Chelsea, appeared on ABC’s “Good Morning America” to promote their new book, “The Book of Gutsy Women.” At the end of the joint interview, host Amy Robach asked Clinton “what's the gutsiest thing you've ever done?\" “Ah, boy, I think the gutsiest thing I've ever done — well, personally, make the decision to stay in my marriage,” Clinton answered. “Publicly, politically, run for president. And keep going. Just get up every day and keep going.” The former First Lady, who was the 2016 Democratic presidential nominee, has been married to former President Bill Clinton for more than 40 years. While Bill Clinton was president, he engaged in a sexual relationship with White House intern Monica Lewinsky and was eventually impeached for perjury and obstruction of justice in the wake of the extramarital affair. However, the Senate acquitted him of both charges, and Clinton went on to serve the remainder of his second term in office. Chelsea Clinton, when asked the same question after her mother, said she was “overwhelmed by my mother's answer that I'm a bit out of words.” Clinton also told ABC that she had not been questioned in relation to recent reports that the Trump administration is investigating the email records of dozens of current and former State Department officials who sent emails to her private email address. “I think it's an unfortunate diversion,” Clinton said. “You go and you talk to people who've been experienced diplomats for many years, and then you retroactively classify what they said 10 years ago? I think it's really a shame that they're doing that, and hopefully people will not be distracted.” On Tuesday, Clinton also sarcastically responded to Rudy Guiliani, President Donald Trump’s personal lawyer, who invoked the Clinton Foundation while defending his involvement in the Ukraine controversy that has led to an impeachment inquiry into Trump. “WP [Washington Post], NBC, and CNN are going after me because I’m the messenger, and covering up the message, Dem corruption,” Giuliani tweeted. “Meanwhile, they have yet to ask Biden difficult questions because he is protected and immune like the Clintons and crooked Clinton Foundation!” Clinton quote-tweeted his statement and quipped, “Yes, I am famously under-scrutinized.”",
      "date": "Published 6:18 p.m. ET Oct. 1, 2019 | Updated 10:19 p.m. ET Oct. 1, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Simone Biles makes history. Again.",
      "url": "https://www.usatoday.com/story/news/2019/10/08/simone-biles-trump-hillary-clinton-ellen-degeneres-tuesdays-news/3903933002/",
      "subtitle": "null",
      "author": "Ashley Shaffer",
      "content": " Ashley Shaffer writes The Short List newsletter for USA TODAY. To subscribe to this snappy news roundup, click here. President Trump wants Hillary Clinton to run for president, and Simone Biles reminds us why she's the greatest of all time. Here's the news to know Tuesday. But first, 🐍🐍🐍: California crooks stole a man’s duffel bag that he left in the car. Here’s the thing: It was full of snakes. Simone Biles has done it again. The American team won its fifth consecutive title at the world gymnastics championships Tuesday despite having to count a fall for the first time in almost a decade. The win gives Simone Biles her 21st medal, the most for a female gymnast. Humble reminder: The Americans have won EVERY world and Olympic title since 2011. Having Biles, the greatest gymnast of any generation, definitely helps. Now we wait for the all-around finals Thursday, where Biles is all but assured of winning. If you’re a gymnastics fan, this is a big moment. Even if you’re not a gymnastics fan but appreciate incredible achievements in sports, know that you are witnessing greatness. Why? Because they are friends, and \"that's OK.\" Eagle-eyed fans spotted Ellen DeGeneres sitting next to former President George W. Bush during an NFL game Sunday. Unsurprisingly, that set the internet ablaze. One Twitter user wrote, \"Ellen, this isn’t just a simple difference of opinion. George Bush, his administration, and his colleagues actively discriminated and worked against the LGBT community.\" DeGeneres made light of the situation on \"The Ellen DeGeneres Show\" Tuesday, calling for more tolerance and kindness. \"I’m friends with George Bush,\" she said. \"In fact, I’m friends with a lot of people who don’t share the same beliefs that I have. We’re all different, and I think that we've forgotten that that’s OK.\" Oh, and apparently Bush still owes her cash for nachos. Engaging in a favorite pastime, President Donald Trump taunted Hillary Clinton and the 2020 Democratic candidates Tuesday by saying she should run for the White House again – only to have Clinton taunt back. \"Don’t tempt me,\" she tweeted. \"Do your job.\" Earlier in the day, Trump wrote, \"I think that Crooked Hillary Clinton should enter the race to try and steal it away from Uber Left Elizabeth Warren.\" He listed one \"condition\" of her renewed candidacy, saying Clinton should disclose the reason she deleted emails from her time as secretary of state for President Barack Obama. The U.S. ambassador to the European Union flew all the way from Brussels to speak to congressional investigators about his role in urging Ukraine's president to investigate former Vice President Joe Biden. But Gordon Sondland was a no-show. The State Department directed Sondland not to appear before House Democrats pursuing an impeachment inquiry of the president. Trump defended the decision to block the testimony, saying the Democrats' inquiry is illegitimate. The Dems called the order to block the testimony obstruction of justice, and they plan to subpoena the ambassador for his testimony, as well as documents. Look, it's Spooky Season, and since I'm too old for trick-or-treating, I'm asking for one thing this Halloween: pictures of your pets in costume. If you send them to me (ashley@usatoday.com or Twitter), there's a chance I'll include your pet in a special Halloween edition of The Short List. Need some ideas? We've got you covered. Here are some of the most popular Halloween costumes for pets. This is a compilation of stories from across the USA TODAY Network.",
      "date": "Published 5:41 p.m. ET Oct. 8, 2019 | Updated 5:56 p.m. ET Oct. 8, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Parents may not let you miss class, but Hillary Clinton will. 'Please excuse Grace'",
      "url": "https://www.usatoday.com/story/life/parenting/2019/10/03/hillary-clinton-writes-note-excusing-student-class-the-view/3851281002/",
      "subtitle": "null",
      "author": "Rasha Ali",
      "content": " A student was ready to risk it all to see Hillary Clinton live and in person. A young woman was in the audience during the former presidential candidate's appearance on \"The View\" and expressed that she was missing class to be there. Clinton decided to write her teacher a note excusing her absence. \"Please excuse Grace from missing class, she was at 'The View' with me,\" the former First Lady wrote on a blue note card and signed it. \"The View\" tweeted out a photo Thursday morning showing Grace smiling and holding the note alongside three of her friends. \"Nothing like getting a note to excuse you from class from @HillaryClinton!\" the tweet read. Opal Vadhan, one of Clinton's people, also tweeted out a photo of Clinton taking time to sign the note during a commercial break. Clinton appeared on \"The View\" on Wednesday with her daughter, Chelsea Clinton, to talk about Donald Trump's impeachment inquiry and their new book, \"The Book of Gutsy Women.\" The duo also visited \"Good Morning America\" on Tuesday to promote the book where Former Secretary of State Clinton said that the “gutsiest” personal thing she's ever done was \"stay in my marriage.\" Clinton added that publicly and politically, her presidential run took the most courage. \"And keep going. Just get up every day and keep going.” We're not sure if Grace's gutsy move will be approved by her teacher, but at least she got a pretty cool souvenir out of it. Contributing Savannah Behrmann​​​​​ READ MORE",
      "date": "Published 12:09 p.m. ET Oct. 3, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Donald Trump to Hillary Clinton: Run for president again! Clinton to Trump: Do your job!",
      "url": "https://www.usatoday.com/story/news/politics/2019/10/08/donald-trump-hillary-clinton-run-again-she-replies-do-your-job/3907084002/",
      "subtitle": "US President Donald Trump says the impeachment inquiry is a \"scam\" that is driving his poll numbers higher and he says he sort of thrives on it, but admits it \"makes it harder to do my job.\" (Oct. 7)\n    AP, AP",
      "author": "David Jackson",
      "content": " WASHINGTON – Engaging in a favorite pastime, President Donald Trump taunted Hillary Clinton and the 2020 Democratic candidates on Tuesday by saying she should run for the White House again – only to have Clinton taunt back. \"Don’t tempt me,\" she tweeted at Trump. \"Do your job.\" She was responding to an earlier post in which Trump said: \"I think that Crooked Hillary Clinton should enter the race to try and steal it away from Uber Left Elizabeth Warren.\" He also listed one \"condition\" of her renewed candidacy, saying Clinton should disclose the reason she deleted emails from her time as secretary of State for President Barack Obama. Clinton responded a few hours later with her own taunting tweet. Trump's hit came as he as under impeachment investigation for asking Ukraine's president to investigate another Democratic presidential candidate, former Vice President Joe Biden.",
      "date": "Published 3:22 p.m. ET Oct. 8, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Hillary Clinton says Duchess Meghan's race is 'certainly part of' media's treatment of her",
      "url": "https://www.usatoday.com/story/entertainment/celebrities/2019/10/14/hillary-clinton-says-race-part-medias-coverage-meghan-markle/3973203002/",
      "subtitle": "Hillary Clinton on Thursday said President Donald Trump, the man who beat her in the 2016 election, posed a \"clear and present danger\" to the future of the country. Clinton was speaking at an event in Washington, DC. (Sept. 27)\n    AP, AP",
      "author": "Rasha Ali",
      "content": " Hillary Clinton is not fond of the way the British media has treated Duchess Meghan of Sussex. In an interview with The Sunday Times the former Secretary of State was asked about Prince Harry's decision to sue media outlets for their \"relentless\" and \"malicious\" coverage of his wife. \"I do want to say that the way she’s been treated is inexplicable,\" Clinton told the outlet. The former presidential candidate was asked if she believed race was a factor in the media's portrayal. \"It’s certainly part of it... Well, I think if the explanation is that she’s biracial, then shame on everybody,\" Clinton said. Chelsea Clinton, who was also interviewed, noted that the media's treatment of the former Meghan Markle is probably due to her advocacy work and willingness to break the mold of what a royal is expected to be like. \"She proudly had a career first and has a voice that she thankfully continues to use,\" Clinton said. \" Anyone who has the temerity to break the mold of what has previously been established and expected often, unfortunately, receives criticism and bile that I don't understand. We've seen this pattern repeatedly.\" Chelsea Clinton added that while she doesn't personally know Meghan, she respects her. \"I’m so grateful that she persists, and is unbowed, and is doing work she feels called to do,\" she said. \"And isn’t willing to be bullied.\" Earlier this month, Prince Harry issued an open letter denouncing the coverage of his wife. \"Unfortunately, my wife has become one of the latest victims of a British tabloid press that wages campaigns against individuals with no thought to the consequences – a ruthless campaign that has escalated over the past year, throughout her pregnancy and while raising our newborn son,\" he wrote in a statement. The royal, 35, continued: \"I have been a silent witness to her private suffering for too long. To stand back and do nothing would be contrary to everything we believe in.\" Harry compared the media treatment of Meghan to that of his late mother, Princess Diana, who died in a car crash in Paris in 1997 while evading paparazzi. \"My deepest fear is history repeating itself,\" he wrote. \"I’ve seen what happens when someone I love is commoditised to the point that they are no longer treated or seen as a real person. I lost my mother and now I watch my wife falling victim to the same powerful forces.\" Contributing: Cydney Henderson",
      "date": "Published 8:23 a.m. ET Oct. 14, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Tulsi Gabbard fires back at Hillary Clinton suggestion that she's Russia's pawn",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/10/18/tulsi-gabbard-fires-back-hillary-clinton-suggestion-shes-russia-pawn/4027196002/",
      "subtitle": "The congresswoman from Hawaii is joining a growing pool of Democrats ready to take on President Trump. Here are 5 things to know about Rep. Tulsi Gabbard.\n    USA TODAY",
      "author": "",
      "content": "MANCHESTER, N.H.  — It's Hillary Clinton vs. Tulsi Gabbard on the sidelines of the 2020 presidential race. The Hawaii congresswoman fought back unsparingly after Clinton appeared to call her \"the favorite of the Russians\" in a recent interview and said she believes the Russians have \"got their eye on somebody who's currently in the Democratic primary and are grooming her to be the third-party candidate.\" Clinton, the former senator, U.S. secretary of state and 2016 Democratic presidential candidate, did not name Gabbard directly. In a series of tweets Friday, Gabbard called Clinton the \"personification of the rot that has sickened the Democratic Party for so long.\" Gabbard also alleged there has been a \"concerted campaign\" to destroy her reputation since she announced her presidential run in January. \"It's now clear that this primary is between you and me,\" Gabbard tweeted about Clinton. \"Don't cowardly hide behind your proxies. Join the race directly.\" More: Mueller sounded an alarm on Russian meddling in the 2020 election. Here is what happened last time There is lingering trepidation in the Democratic Party of a repeat of the 2016 presidential race, when Russia interfered in the U.S. election in an effort to help Donald Trump defeat Clinton. U.S intelligence agencies have warned that Russia intends to meddle in the 2020 presidential election, as well. Russian President Vladimir Putin has mocked that possibility, joking earlier this month that Moscow would \"definitely intervene\" again. During a Democratic presidential debate on Tuesday, Gabbard criticized a TV commentator who she said had called her \"an asset of Russia.\" She called the comments \"completely despicable.\" Without naming Gabbard, Clinton seemed to echo the commentator's remark during a podcast appearance this week on \"Campaign HQ with David Plouffe.\" Plouffe was campaign manager for President Barack Obama in 2008 and served as served as a senior adviser to the president. \"She's the favorite of the Russians,\" Clinton said, referring to the person she had earlier identified as a woman \"who's currently in the Democratic primary.\" ''They have a bunch of sites and bots and other ways of supporting her so far.\" Clinton also called Trump \"Vladimir Putin's dream\" in the interview. She went on to say that Trump's inauguration speech was \"like a declaration of war on half of America.\" Clinton also describes 2016 Green Party presidential candidate Jill Stein as \"a Russian asset.\" The Russians know they can't win without a third-party candidate, Clinton added. Stein, who ran against Trump and Clinton as a Green Party candidate, received about 1% of the vote in the 2016 election, but some Democrats said her candidacy syphoned votes away from Clinton and helped Trump win, particularly in states like Wisconsin. The Senate Intelligence Committee asked Stein for documents as part of its probe into Russian interference in the election because she attended a 2015 dinner in Moscow sponsored by Russian television network RT with Putin. Stein has said she attended \"with a message of Middle East peace, diplomacy and cooperation.\" In a tweet Friday, Stein accused Clinton of \"peddling conspiracy theories to justify her failure instead of reflecting on real reasons Dems lost in 2016.\"",
      "date": "Published 6:52 p.m. ET Oct. 18, 2019 | Updated 10:05 a.m. ET Oct. 19, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "U.S. Rep. Tulsi Gabbard says Hillary Clinton 'knows she can't control me'",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/10/19/tulsi-gabbard-hillary-clinton-russia-claims-iowa-city-tailgate-election-2020/4037543002/",
      "subtitle": "Democrat Tulsi Gabbard, a U.S. representative from Hawaii, spoke Friday, Aug. 9, 2019, at the Des Moines Register Political Soapbox at the Iowa State Fair.\n    Des Moines Register",
      "author": "Robin Opsahl",
      "content": " As U.S. Rep. Tulsi Gabbard walked around tailgate parties for Homecoming weekend at the University of Iowa, one man gave her a Hawkeyes-themed Russian cossack hat. Another shouted \"screw Hillary!\" as Gabbard drove from party-to-party on a golf cart. Some Iowans showed their support for Gabbard after former Secretary of State Hillary Clinton suggested that Russians are \"grooming\" a Democratic presidential candidate to run as a third-party candidate Friday. While Clinton did not name Gabbard, the comment appeared to be directed at the Democrat from Hawaii. On Saturday, Gabbard said the past 24 hours had \"a lot of news,\" but it brought to the forefront the reasons why she believes her campaign is important: it threatens the party's establishment. More: Tulsi Gabbard fires back at Hillary Clinton suggestion that she's Russia's pawn Gabbard has said multiple times she is not considering a third-party run, both before and after Clinton's statement. \"She knows she can't control me,\" Gabbard told the Des Moines Register on Saturday. \"She knows that if I'm the nominee, if I become president, she can't have any influence or any control over the kind of foreign policy I would lead our country in. Both her and her proxies and the foreign policy establishment.\" Gabbard said Clinton was the \"queen of warmongers\" on Twitter Friday in response to her comments. Despite the back-and-forth between Gabbard and Clinton, Gabbard was met with good cheer by Hawkeyes fans Saturday morning. A group of people at a tiki bar tailgate drank a round of Fireball whiskey shots in her honor, shouting \"Tulsi time!\" as she mingled with the crowd. Maria Frazer, a 21-year-old University of Iowa student, is still deciding who she wants to support in the Iowa caucus. She's heard allegations about Gabbard's ties with Russia, but while she doesn't \"necessarily buy into it,\" Frazer said Americans should be wary of foreign governments' influence in the presidential election. \"I am concerned, not necessarily about Tulsi,\" she said. \"But it's something I'm very cautious about. I think we need to be cautious about in the future.\" Chris Forbes, a 52-year-old man in Iowa City, gave Gabbard a Twinkie as they talked politics. He already committed to caucus for U.S. Sen. Kamala Harris, but said it's important for foreign policy to take a bigger role in the presidential election — something Gabbard brings. He doesn't agree entirely with Gabbard's positions. Forbes said the U.S. military should still play some role in foreign conflicts, especially in cases when allies are at risk, like the Kurds in northern Syria following President Donald Trump's decision to leave the region. \"I agree that steps should be made to pull away from some of the actions of being the world's policemen,\" Forbes said. \"But I also believe the standard of American democracy for 240 years has been to be a beacon of freedom for the rest of the world. And as such, we need to have just enough present to represent that freedom and world leadership toward democracy so that all groups can feel safe in being free to stand openly for what they believe.\" Gabbard said Clinton and other Democrats accusing her of being a \"Russian asset\" is a strategy to stop Americans from criticizing U.S. foreign policy decisions. \"This threatens our freedom of speech and is very revealing about the real motives behind this smear campaign that literally began the day I announced my candidacy for president,\" Gabbard said. Robin Opsahl covers political trends for the Register. Reach them at ropsahl@registermedia.com or 515-284-8051. Support reporters who follow your government by becoming a subscriber. Sign up at DesMoinesRegister.com/Deal.",
      "date": "Published 3:35 p.m. ET Oct. 19, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "38 people cited for violations in Hillary Clinton email probe",
      "url": "https://www.usatoday.com/story/news/politics/2019/10/18/hillary-clinton-email-probe-people-cited-but-no-evidence-deliberate-mishandling/4027787002/",
      "subtitle": "Hillary Clinton on Thursday said President Donald Trump, the man who beat her in the 2016 election, posed a \"clear and present danger\" to the future of the country. Clinton was speaking at an event in Washington, DC. (Sept. 27)\n    AP, AP",
      "author": "",
      "content": "WASHINGTON — The State Department has completed its internal investigation into former Secretary of State Hillary Clinton's use of private email and found violations by 38 people, some of whom may face disciplinary action. The investigation, launched more than three years ago, determined that those 38 people were \"culpable\" in 91 cases of sending classified information that ended up in Clinton's personal email, according to a letter sent to Republican Sen. Chuck Grassley this week and released on Friday. The 38 are current and former State Department officials but were not identified. Although the report identified violations, it said investigators had found \"no persuasive evidence of systemic, deliberate mishandling of classified information.\" However, it also made clear that Clinton's use of the private email had increased the vulnerability of classified information. The Associated Press sent an email seeking comment to a Clinton representative. More: Fact check: 12 questions and answers about Hillary Clinton’s emails The investigation covered 33,000 emails that Clinton turned over for review after her use of the private email account became public. The department said it found a total of 588 violations involving information then or now deemed to be classified but could not assign fault in 497 cases. For current and former officials, culpability means the violations will be noted in their files and will be considered when they apply for or go to renew security clearances. For current officials, there could also be some kind of disciplinary action. But it was not immediately clear what that would be. The report concluded \"that the use of a private email system to conduct official business added an increased degree of risk of compromise as a private system lacks the network monitoring and intrusion detection capabilities of State Department networks.\" The department began the review in 2016 after declaring 22 emails from Clinton's private server to be \"top secret.\" Clinton was then running for president against Donald Trump, and Trump made the server a major focus of his campaign. Then-FBI Director James Comey held a news conference that year in which he criticized Clinton as \"extremely careless\" in her use of the private email server as secretary of state but said the FBI would not recommend charges. The Justice Department's inspector general said FBI specialists did not find evidence that the server had been hacked, with one forensics agent saying he felt \"fairly confident that there wasn't an intrusion.\" Grassley started investigating Clinton's email server in 2017, when he was chairman of the Senate Judiciary Committee. The Iowa Republican has been critical of Clinton's handling of classified information and urged administrative sanctions.",
      "date": "Published 8:10 p.m. ET Oct. 18, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    }
  ]
}