{
  "articles": [
    {
      "title": "",
      "url": "",
      "subtitle": "",
      "author": "",
      "content": "   ",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Meghan McCain rips 'Mindy Project' producer for 'cruel' tweet, brings Mindy Kaling into it",
      "url": "https://www.usatoday.com/story/entertainment/celebrities/2019/08/05/meghan-mccain-rips-mindy-project-producer-cruel-tweet-mindy-kaling/1919949001/",
      "subtitle": "\"The View\" co-host Meghan McCain thinks Gwyneth Paltrow's part-time living setup with her husband Brad Falchuk is \"rich people stuff.\"\n    USA TODAY",
      "author": "Erin Jensen",
      "content": " Meghan McCain is standing up for herself in reaction to a tweet from \"Mindy Project' writer/producer David Stassen. When \"The View\" co-host responded to Stassen's post, she tagged Mindy Kaling, who created and starred on the comedy series that wrapped up in 2017 after six seasons. It was revealed Friday that McCain is set to release an audiobook in 2020. The new work will cover her dad, the late Sen. John McCain, as well as give her thoughts on politics. According to a screenshot, Stassen tweeted: \"Who in the (expletive) is going to buy this (expletive)?\" \"Sad to find out that you work with someone I greatly admire (and have for a long time) @mindykaling,\" McCain wrote on Twitter Saturday, \"I know we can’t be judged by everyone we work with but still. \"What a cruel thing to say,\" she added. \"And my book is for women who are judged for being conservative (among many other people).\" Meghan McCain on getting booed by 'The View' audience, reveals her major regret Mindy Kaling shares bikini photo with body positive message: 'You don’t have to be a size 0' Stassen has deleted his post that set off McCain. Responding to a tweet from a commentor who reminded him, \"You don’t have to. Don’t be so rude,\" Stassen replied, \"Fair enough.\" Some on Twitter questioned why Kaling was brought into it. \"Not Mindy's problem, Meghan,\" one Twitter user responded. \"Why bring Mindy into it? Publicly too?\" a person inquired. \"This is the 'I’m speaking to your manager' of tweets,\" another posted. Another guessed: \"@mindykaling is somewhere like why the hell did you have to drag me into this?!?!\" \"So you’re judging & condemning. @mindykaling because .@davidstassen had the nerve to voice an opinion (which I believe is still legal),\" another remarked. \"Don’t you get outraged when ppl hold you accountable for Ben’s opinions or vice versa?\" the person added, sharing a screenshot from a June 23 tweet where McCain asked followers to see her and husband Ben Domenech as separate entities. \"Do you hold Ben accountable for everything I say on @TheView?\" asked McCain in her previous tweet. \"I know this is a hard concept for some but we are not the same person, believe different things and love and respect each other’s differences.\" Mindy Kaling won't talk about daughter's father, but opens up on finding her maternal instinct Meghan McCain felt 'petrified' about revealing miscarriage but decided to 'take the leap' USA TODAY has reached out to reps for Kaling and Stassen for comment. The Associated Press contributed to this report.",
      "date": "Published 9:33 a.m. ET Aug. 5, 2019 | Updated 10:37 a.m. ET Aug. 5, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "John Legend opposes Felicity Huffman's sentence: 'We don't need to lock people up for' this",
      "url": "https://www.usatoday.com/story/entertainment/celebrities/2019/09/16/felicity-huffman-prison-sentence-john-legend-opposes-lock-up/2339221001/",
      "subtitle": "John Legend opposes Felicity Huffman's 14-day prison sentence for her role in the college admissions scandal. Legend shared his thoughts on Twitter.\n    USA TODAY",
      "author": "Erin Jensen",
      "content": " John Legend disagrees with the sentence fellow celebrity Felicity Huffman received Friday from being a part of the college admissions scandal. In a Boston courtroom, the \"Desperate Housewives\" alum was sentenced to 14 days in prison, a $30,000 fine, supervised release for one year and 250 hours of community service for paying $15,000 to have someone correct answers on the SAT exam of her and William H. Macy's oldest daughter, Sophia. \"I get why everyone gets mad when rich person X gets a short sentence and poor person of color Y gets a long one,\" read a Saturday tweet from Legend, founder of FreeAmerica, \"a campaign to transform America’s criminal justice system,\" according to its website. \"The answer isn't for X to get more; it's for both of them to get less (or even none!!!) We should level down not up.\" \"Americans have become desensitized to how much we lock people up,\" he shared in another post. \"Prisons and jails are not the answer to every bad thing everyone does, but we've come to use them to address nearly every societal ill.\" Felicity Huffman sentenced: 2 weeks in prison, $30,000 fine for college admissions scandal Though he did not address Huffman by name, he did reference her 2-week sentencing, describing it as ultimately meaningless. \"And no one in our nation will benefit from the 14 days an actress will serve for cheating in college admissions,\" he wrote. \"We don't need to lock people up for any of this stuff.\" Legend explained that he preferred other alternatives to prison when a Twitter user opposed his view. \"Yeah let's not have any consequences to crime... that'll work well,\" the critic remarked. \"When you think no prison = no consequences,\" Legend replied. \"There are other ways to hold people accountable than the state paying 10s of thousands a year to hold them in a secure facility\" Read Felicity Huffman's full, emotional statement about her 14-day prison sentence That's not the only Twitter opponent Legend has had to face of late. The artist's Sept. 8, appearance on MSNBC's final installment of Lester Holt's \"Justice For All\" series, a report about the criminal justice system, ruffled the feathers of President Donald Trump. The nation's leader complained that he and his political party were not receiving the appropriate credit and dragged the \"boring musician\" and his \"filthy mouthed wife\" Chrissy Teigen, who was not mentioned in the report. The judge in Huffman's case, U.S. District Judge Indira Talwani, addressed the actress' sentencing in court. \"I don’t think anyone wants to go to prison,\" Talwani said. \"I do think this is the right thing here. I think without this sentence you would be looking at a future with a community around you asking how you got away with this.\" Meghan McCain defends Chrissy Teigen after President Trump targets Teigen, John Legend Friday, Huffman said she was ready to \"accept the court’s decision today without reservation.\" \"I broke the law. I have admitted that and I pleaded guilty to this crime. There are no excuses or justifications for my actions. Period,\" she said. \"I would like to apologize again to my daughter, my husband, my family and the educational community for my actions,\" she added. \"And I especially want to apologize to the students who work hard every day to get into college, and to their parents who make tremendous sacrifices supporting their children.\" Contributing: Joey Garrison, Hannah Yasharoff and Anika Reed 'Legitimate donations': Lori Loughlin attorney previews college admissions defense in court 'I can't figure it out': John Stamos is still perplexed over Lori Loughlin scandal",
      "date": "Published 8:01 a.m. ET Sept. 16, 2019 | Updated 11:37 a.m. ET Sept. 16, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Meghan McCain to release audiobook next year discussing dad John McCain, politics",
      "url": "https://www.usatoday.com/story/entertainment/books/2019/08/02/meghan-mccain-to-discuss-dad-john-mccain-politics-new-audiobook/1900771001/",
      "subtitle": "\"The View\" co-host, 34, revealed in an op-ed for the New York Times Friday that she lost a pregnancy weeks ago.\n    USA TODAY",
      "author": "",
      "content": "NEW YORK  — Meghan McCain will share some thoughts about politics and her late father, Sen. John McCain, on an audiobook coming out next year. Audible.com announced Friday that McCain would offer a \"blueprint\" for conservative politics while also drawing on what she learned from her father, the war hero, Arizona Republican and 2008 presidential candidate. John McCain died last year at age 81. Meghan McCain is an author, a commentator and a co-host of \"The View.\" Her book is currently untitled and does not yet have an exact release date. McCain's previous books include \"My Dad, John McCain,\" a picture story published in 2008. More: 'Where are you in this': Meghan McCain calls out Ivanka Trump after 'send her back' chant Audible, a leading producer and distributor of audiobooks, is owned by Amazon.com.",
      "date": "Published 12:38 p.m. ET Aug. 2, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Cindy McCain says there is no 'voice of reason' in GOP, nearly a year after John McCain's death",
      "url": "https://www.usatoday.com/story/news/politics/2019/08/21/cindy-mccain-says-there-no-voice-reason-republican-party/2079486001/",
      "subtitle": "Former Vice President Joe Biden spoke about the patriotism of his long-term friend John McCain and their unexpected friendship.\n    USA TODAY",
      "author": "Savannah Behrmann",
      "content": " WASHINGTON -- Nearly a week before the one-year anniversary of her husband Sen. John McCain's death, Cindy McCain said the current Republican Party is \"not the party of Abraham Lincoln ... nor the party of Ronald Reagan.\" Known for his habit of being a political maverick, the late Sen. McCain, R-Ariz., forged a record of bipartisanship through a willingness to create relationships with lawmakers across the aisle in order to seek solutions. The six-term U.S. senator disclosed in July 2017 that he had been diagnosed with a deadly form of brain cancer called glioblastoma. Speaking out a year after her husband’s passing, Cindy McCain emphasized that she doesn’t see anyone carrying on in the bipartisan way that her husband had for years in Washington. \"That was a tough torch to carry and, as John said, there were many lonely days because he always said what was on his mind,\" Cindy McCain said in an interview with ABC News. She continued explaining that her husband \"never did anything deliberately to be hurtful or anything … I don't see anybody carrying that mantle at all, I don't see anyone carrying the voice -- the voice of reason.\" More: Trump calls the Danish Prime Minister 'nasty' after she nixes notion of Greenland sale She also touched on the Trump administration’s immigration policies and rhetoric. “I think John would be very discouraged about the border situation right now with our immigrants and our refugees coming across the border now and their treatment.” When pressed on how she thought her husband would have reacted to the “send her back” chants that broke out at a Trump campaign rally referring to the “Squad”, McCain said her husband \"would not have accepted it.\" “I'm quite certain he would have spoke out about it,\" she continued. \"These are American citizens -- these are our citizens.\" More: Cindy McCain's first year without John McCain: 'Trying to put our family back together' As the Arizona Republic reported, Cindy McCain likes to remind people of the momentduring the 2008 campaign when the senator, who was running against Barack Obama for the presidency, corrected a woman at a town hall who said she couldn’t trust Obama because he was “an Arab.” “No, ma’am,” John McCain said. “He’s a decent family man, citizen, that I just happen to have disagreements with on fundamental issues and that’s what this campaign is all about.” In an op-ed published by the Washington Post Wednesday, Cindy McCain also called for civility in government. “John was a passionate partisan. But he was a statesman, too, and statesmen accept the necessity of cooperation and compromise to make some progress on the challenges our country faces,” she wrote. \"When Congress returns from its August recess, I hope its veteran members, many of whom my husband was proud to call his friends, and its newest ones will energetically contest the issues of the day. I hope they will fight for their beliefs and enjoy the contest. But I hope, too, as John would, that they do it with minds open to the possibility of compromise for the country's sake, and hearts open to the possibility and joys of unexpected friendships,\" McCain also wrote. Through a video, Cindy McCain is also asking Americans to perform an act of civility and post about it on social media with the hashtag #ActsOfCivility. “I believe most Americans would find great value in that approach to politics and governing, and to well-lived lives. It is time to inspire a renewal of civil engagement that is so critical to meet the challenges of the future,” she concluded in the op-ed. Speaking to the Arizona Republic, Cindy McCain shared some of her family's struggles in coping with the senator's death.  \"My job is to make sure they’re OK  — that’s my job,\" Cindy McCain said of her children. \"I have gotten calls in the middle of the night. I’ve gotten calls from ones I didn’t ever think that they would call me … Each situation is different.\" The Republic reported that Cindy McCain \"declined to comment directly about the president’s attacks over the past year on her husband, and his rhetoric.\" ABC News likewise reported Wednesday that \"Despite her comments about the Republican Party as a whole, McCain did not call out Trump directly even with his frequent attacks on John McCain, including after his passing.\" Perhaps she felt that task had already been completed in some way by her late husband. As the Republic wrote \"the retired Navy captain and Vietnam prisoner of war had become a fixture in American and global politics before his death\" and \"when he spoke to condemn the incivility and dysfunction that permeates American politics today, his voice was widely accepted as a counterweight to the combative style of politics and leadership embraced by President Donald Trump.\" Contributing: Yvonne Wingett Sanchez, Arizona Republic",
      "date": "Published 11:24 p.m. ET Aug. 21, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Beto O'Rourke takes on Meghan McCain over gun rights amid gun control debate after mass shootings",
      "url": "https://www.usatoday.com/story/news/politics/elections/2019/09/05/beto-orourke-takes-meghan-mccain-over-gun-rights-gun-control/2227409001/",
      "subtitle": "\"The View\" co-host Meghan McCain says she is \"not living without guns.\" She added there will be \"a lot of violence\" if assault weapons are banned.\n    USA TODAY",
      "author": "Savannah Behrmann",
      "content": " WASHINGTON -- Former Texas Rep. and Democratic presidential candidate Beto O’Rourke is pushing back against Meghan McCain's recent assertion that implementing a mandatory buyback policy for assault weapons -- which O'Rourke has proposed -- would lead to violence. O'Rourke told the Daily Beast in an interview published Thursday that \"I think the response should be, ‘We’re doing nothing now and we’re seeing people slaughtered in their schools, at work, at a Walmart, in a synagogue, in a church, at a concert,'\" adding \"We should be worried about that kind of violence right now.” Earlier this week, McCain, daughter of the late Sen. John McCain, R-Ariz., and an outspoken conservative in her own right commented on \"The View\" that the “AR-15 is by far the most popular gun in America, by far. I was just in the middle of nowhere Wyoming, if you're talking about taking people’s guns from them, there’s going to be a lot of violence.” “I just I think that kind of language and rhetoric is not helpful,” O'Rourke said in response, according to the Daily Beast. “It becomes self-fulfilling; you have people on TV, who are almost giving you permission to be violent and saying ‘you know this is this is going to happen.’” Meghan McCain: 'There's going to be a lot of violence' if assault weapons are banned O’Rourke used to represent El Paso, Texas, where a shooting at a local Walmart left 22 people dead. He asserted that McCain’s comments dismiss the problems surrounding gun violence. He continued, “When someone says 'if you do this, then this will happen,' almost as though that’s a natural response or maybe even something that should happen or deserves to happen.\" \"When I think the response should be: ‘We’re doing nothing now and we’re seeing people slaughtered in their schools, at work, at a Walmart, in a synagogue, in a church, at a concert. There is violence right now and it is horrifying and it is terrifying and it is terrorizing.’....We should be worried about that kind of violence right now.” Meghan McCain responded to O'Rourke's comments in a tweet, saying: \"Beto is the only man in all of Texas who would revise ‘Come and Take It’ to ‘Please, Come and Take It.’” The original phrase has come to represent defiance and pride to Texans dating back nearly 200 years. As the Houston Chronicle reported, the saying symbolizes \"defiance against someone or something looking to grind you down or deprive you of a right or privilege.\" O’Rourke and McCain have clashed before when he was a guest on “The View” and stood by comparing a controversial rally in North Carolina put on by President Donald Trump's re-election campaign to a \"Nuremberg rally.\" in Nazi Germany. \"You’re talking about Trump supporters, comparing them to Nazis in Nuremberg, that sounds extreme to me as well,\" McCain told O'Rourke at the time. \"When Democrats come on here and wax poetic about extremism—I’m not saying Trump isn’t doing it, but you’re calling everybody who was in that North Carolina rally a Nazi.\" \"From my standpoint, it seems like the left is pretty extreme as well,\" she added. “We all have accountability for our actions and everyone who shouted to send them back is responsible for that as well,\" he said to cheers from the studio audience on \"The View\" in July More: Meghan McCain challenges O'Rourke on comment about Trump rally He later continued, “I don't care who you voted for last time. I don’t care if you’re a Trump supporter or a Republican. You’re an American first before you are anything else and I call you to this country’s greatness.” O’Rourke recently appeared on CNN where he discussed gun violence after the shooting rampage in Odessa and Midland, Texas that left seven dead. He said, \"To protect our kids, our families, our fellow Americans in public places. At a Walmart in El Paso where 22 were killed. In Sutherland Springs, in a Church. One or two a day all over this country. A hundred killed daily in the United States of America. We’re averaging about 300 mass shootings a year. No other country comes close.\" \"So yes, this is f***** up,\" the former Texas congressman concluded. The comments echoed remarks he'd made at an event the night before. And his presidential campaign recently started selling a new T-shirt on the website that repeats \"This is f*cked up\" and concludes with a call to action: \"End gun violence now.\" \"Beto for America\" is printed at the bottom of the t-shirt. Gun control: Sen. Ted Cruz agrees to meet with actress Alyssa Milano, spars with Chicago mayor Contributing: Nicholas Wu, Rebecca Morin",
      "date": "Published 9:53 p.m. ET Sept. 5, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Meghan McCain: 'There's going to be a lot of violence' if assault weapons are banned",
      "url": "https://www.usatoday.com/story/news/politics/2019/09/03/meghan-mccain-a-lot-violence-if-assault-weapons-banned/2204989001/",
      "subtitle": "\"The View\" co-host Meghan McCain says she is \"not living without guns.\" She added there will be \"a lot of violence\" if assault weapons are banned.\n    USA TODAY",
      "author": "Savannah Behrmann",
      "content": " WASHINGTON -- Meghan McCain started the 23rd season of ABC's \"The View” Tuesday by sparring with her liberal co-hosts on gun control, saying that there would be “a lot of violence” if people’s assault weapons were taken from them. The daytime talk show panel quarreled over gun control, noting the shooter in the Labor Day weekend mass shooting in Odessa, Texas that killed seven people, failed a federal background check but purchased a firearm through a private purchase. Abby Huntsman, a former Fox News host and daughter of Republican politician Jon Huntsman Jr., said “If nothing is going to happen after Sandy Hook, I don’t know what it’s going to take.” McCain, daughter of the late GOP Sen. John McCain of Arizona, responded as the “chick on the panel that spent most of her break shooting” by declaring there “should be a ‘gun beat’ in the media” because there are a lot of people on TV “talking about guns that have clearly never shot a gun.” More: Gunman in Texas shooting bought gun in private sale She continued by going after 2020 Democratic presidential candidate and former Vice President Joe Biden for wanting to reinstitute the federal assault weapons ban that expired in 2004 and former Rep. Beto O’Rourke for his proposal for a mandatory buyback of assault-style rifles. O'Rourke used to represent El Paso, Texas, where an alleged shooter killed 22 people in a Walmart. “This is a ground-level issue for me. If you’re going to be a gun-grabber, you don’t get my vote,” McCain stated. Co-host Joy Behar responded by pointing out that Democratic presidents have overseen enactment of gun control legislation, saying, \"Democrats, when they're in office, they do do something about guns. So if you keep rooting for Republicans, you're going to get nothing done.” McCain  responded with, “The AR-15 is by far the most popular gun in America, by far. I was just in the middle of nowhere Wyoming, if you're talking about taking people’s guns from them, there’s going to be a lot of violence.” “I'm not living without guns,\" McCain said.  \"It's just that simple!\" McCain also commented on the recent controversy surrounding the NRA, saying, “As someone who has been an NRA member and has given a lot of money, I have a lot of problems with the way the money is being allocated at the moment.” More NRA drama: Legal team shaken up as group cuts ties with longtime outside attorney A day after the Odessa shooting, the fourth high-profile mass shooting since the House of Representatives went on recess at the end of July, President Donald Trump said lawmakers have \"a lot of thinking to do\" about ways to address gun violence. Tuesday, Senate Majority Leader Mitch McConnell told conservative radio host Hugh Hewitt that any gun control legislation would have to wait until Trump decides on measures that the administration could support. More: After Texas shooting, McConnell says gun control legislation is up to Trump to decide “Well, we’re in a discussion about what to do on the gun issue in the wake of these horrendous shootings,” McConnell said. “I said several weeks ago that if the president took a position on a bill so that we knew we would actually be making a law and not just having serial votes, I'd be happy to put it on the floor.” In a full-page editorial that will run in Wednesday's paper, the Washington Post implores of the Senate's top Republican: \"Do Something, Mr. McConnell,\" adding \"When the Senate returns from its Labor Day recess, it must act on guns.\" More: Sen. Ted Cruz agrees to meet with actress Alyssa Milano, spars with Chicago mayor Contributing: Nicholas Wu",
      "date": "Published 10:54 p.m. ET Sept. 3, 2019 | Updated 12:46 p.m. ET Sept. 4, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Meghan McCain challenges Bernie Sanders to name Republicans he'll work with if elected president",
      "url": "https://www.usatoday.com/story/news/politics/2019/09/04/view-meghan-mccain-challenges-bernie-sanders-bipartisanship/2210622001/",
      "subtitle": "\"The View\" co-host Meghan McCain says she is \"not living without guns.\" She added there will be \"a lot of violence\" if assault weapons are banned.\n    USA TODAY",
      "author": "Jeanine Santucci",
      "content": " WASHINGTON -- Vermont Sen. Bernie Sanders, a top-tier candidate for the Democratic presidential nomination, sparred with the hosts of \"The View\" on Wednesday as he defended his policies and electability. The 77-year-old independent said he would work with politicians on the other side of the aisle if elected president in 2020. Sanders said he has \"conservative friends that I like and respect\" while expressing his view that President Donald Trump is a danger to the country. Co-host Meghan McCain, daughter of the late Republican Sen. John McCain of Arizona, cut Sanders off. \"Can I hear, any in Congress or the Senate?\" she said. \"I’m generally curious about bipartisanship. Can you name one?\" Sanders named Johnny Isakson, the Georgia Republican senator who recently announced his retirement due to health reasons. As Meghan McCain noted Isakson would be vacating his seat, Sanders continued by touting his relationship with John McCain. \"But they're dead,\" McCain started to say. \"Johnny is not dead,\" Sanders shot back. More: Meghan McCain says there will be 'a lot of violence' if assault weapons are banned Isakson's announcement that he will step down at the end of this year came in the middle of his term. He was diagnosed with Parkinson's Disease, a degenerative nervous system disorder, in 2013. Meghan McCain pressed Sanders to name a Republican currently in office that he can work with to achieve bipartisanship. Sanders finally named Sen. Lamar Alexander of Tennessee: \"Lamar is not a liar, Lamar is not a sexist, he's not a racist, he's not a homophobe. He's a conservative guy. It's called American politics.\" During Sanders' appearance on the daytime talk show, he was also pressed by co-host Whoopi Goldberg to address how he will deal with income inequality. She asked if he will change that, as she said candidate and entrepreneur Andrew Yang had pledged to do on a previous episode of the show. Sanders said, \"Of course I'll change it,\" Sanders said. \"Well, how do I know this?\" Goldberg replied. \"Because I've been talking about it for 25 years,\" Sanders said, seemingly frustrated. Sanders also talked about his ability to defeat the current president in the 2020 election should he win the Democratic nomination, disagreeing with the idea that only a moderate Democratic candidate could take on Trump. \"I think the agenda that I am bringing forth is the most progressive agenda ever brought forth by any candidate —serious candidate⁠—running for president of the United States,\" Sanders said.",
      "date": "Published 4:50 p.m. ET Sept. 4, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "'A trailblazing figure': Barack Obama, Katie Couric mourn veteran journalist Cokie Roberts",
      "url": "https://www.usatoday.com/story/entertainment/celebrities/2019/09/17/cokie-roberts-dead-jake-tapper-kellyanne-conway-mourn-journalist/2350957001/",
      "subtitle": "Roberts' Emmy-winning career earned her top-tier journalism awards, including the Edward R. Murrow Award and the Walter Cronkite Award for Excellence in Journalism.\n    USA TODAY",
      "author": "Hannah Yasharoff",
      "content": " Reporters and celebrities mourn the death of Cokie Roberts, a veteran journalist and political commentator who died Tuesday at age 75. \"Our dear friend and colleague Cokie Roberts passed away this morning in Washington, surrounded by her family and closest friends,\" ABC News President James Goldston said in a statement. \"She will be dearly missed. Cokie’s kindness, generosity, sharp intellect and thoughtful take on the big issues of the day made ABC a better place and all of us better journalists,\" Goldston said. Roberts died of complications from breast cancer, according to a statement from her family. More: Journalist and political commentator Cokie Roberts dies at 75 CNN anchor Jake Tapper remembered Roberts as a \"kind and supportive\" mentor to many. \"Cokie was a giant,\" he tweeted. \"She was smart and pithy and tough as nails,\" which he said was \"the highest of compliments for a DC journalist.\" \"There wasn’t anyone else like her,\" he said. \"What a loss. I’m so sorry for her family and close friends.\" The office of Barack Obama issued a statement on behalf of the former president and first lady. \"She was a trailblazing figure; a role model to young women at a time when the profession was still dominated by men; a constant over forty years of a shifting media landscape and changing world, informing voters about the issues of our time and mentoring young journalists every step of he way,\" the statement read. \"She will be missed – and we send our condolences to her family.\" President Donald Trump called her a \"real professional\" while speaking with reporters aboard Air Force One. “I never met her. She never treated me nicely. But I would like to wish her family well,” he said. “She was a professional, and I respect professionals. I respect you guys a lot, you people a lot. She was a real professional. Never treated me well, but I certainly respect her as a professional.” Speaker of the House Nancy Pelosi mourned the loss of Roberts' \"warmth, wit and wisdom.\" “Cokie Roberts was a trailblazer who forever transformed the role of women in the newsroom and in our history books,\" Pelosi said in a statement. \"Over five decades of celebrated journalism, Cokie shone a powerful light on the unsung women heroes who built our nation, but whose stories had long gone untold.  As she helped tell the full story of America’s history, she helped shape its future – inspiring countless young women and girls to follow in her groundbreaking footsteps.\" \"The View\" co-hosts shared news of Roberts' passing on air Tuesday. Meghan McCain said she always respected Roberts' ability to ask \"really hard-hitting questions in times when women really weren’t doing that.\" McCain said, \"She was a road dog, who was on every campaign, asking candidates questions in the forefront. I remember her and my dad (Sen. John McCain) going at it and then off-camera laughing, shaking hands, having the collegial relationship that reporters and principals used to have, and she’s just one of the greats of all time, ever.” Whoopi Goldberg praised Roberts as “an amazing giant in the world of journalism, a great woman,” adding that her \"influence and impact cannot be overstated.\" Joy Behar called Roberts “reliable and smart and to the point, and she had a great sense of humor.” \"Cokie Roberts was kind. She disagreed agreeably,\" tweeted Kellyanne Conway. \"Cokie listened, offered advice, showed patience and poise, worked hard, put faith & family first. God bless. RIP.\" Katie Couric praised Roberts as \"a pioneer for so many\" who \"will be sorely missed.\" ABC News Chief White House Correspondent Jonathan Karl shared a video of himself on air with Roberts at the 2016 Democratic National Convention. \"RIP Cokie Roberts, mentor, friend and one of my favorite people in the world,\" he wrote on Twitter. \"Cokie attended 22 national political conventions – that may be a record – I had the privilege of interviewing her on the floor of her last convention.\" PBS NewsHour anchor Judy Woodruff called Roberts' death a \"huge loss. Cokie Roberts was the best of American journalism and a fierce advocate for women. She was active till the very end; my heart is with her wonderful family.\" NBC News' Deepa Shivaram sent \"love and light to the Roberts family – especially to Prof. Steve Roberts, her husband, who couldn’t go 5 minutes in class or at coffee without telling a story about Cokie and their wonderful, adventurous life.\" Former New Jersey Gov. Chris Christie tweeted that he and his wife will \"miss her good humor and kindness.\" \"She was a staple of Sunday morning TV news for so long and a great example of loving our democracy and politics but also being an able critic of both,\" Christie said. \"Such a deep well of knowledge and history and analysis and humanity,\" marveled actress Jamie Lee Curtis. \"A loss for the entire world.\" Maria Shriver shared that she was \"heartbroken\" over the news. \"She was such an inspiration to me,\" she tweeted. \"A great journalist, wife, mom, public advocate. She did it all with grace. She worked to give other women a seat at a table. I’m going to pull up a chair today and think of her.\" \"Inside Edition\" anchor Deborah Norville offered prayers for Roberts' family. \"One of the women who made it possible for ME to have the career I do. #grateful\" \"Mourning the passing of legendary @ABC correspondent Cokie Roberts, who passed away at the age of 75,\" tweeted Fox News Chief White House Correspondent John Roberts. \"She was a true pioneer of the business, and a revered colleague.\" ABC News Senior National Correspondent Terry Moran mourned his \"friend, colleague and hero.\" \"Brilliant. Brave. Kind. Hilarious. A fierce patriot. And one of the best human beings I have ever known,\" he said. \"Morning Joe\" co-host Joe Scarborough tweeted he \"grew up loving her political analysis and insights into Washington. She will be terribly missed.\" \"Cokie Roberts spoke to my ‘01 Capitol Hill summer intern class and encouraged all of us – Republicans and Democrats – to always seek consensus where we could,\" tweeted Rep. Eric Swalwell, D-Calif. \"I’ll never forget how moving she was. We’ve lost a journalism icon. Rest In Peace, Cokie.\" Contributing: Anika Reed, David Oliver and Erin Jensen",
      "date": "Published 11:15 a.m. ET Sept. 17, 2019 | Updated 3:30 p.m. ET Sept. 17, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Meghan McCain speaks her mind: 7 times 'The View' host has been blunt about her opinions",
      "url": "https://www.usatoday.com/story/entertainment/celebrities/2019/09/12/meghan-mccain-the-view-co-host-gets-blunt-conservative-views/2148585001/",
      "subtitle": "During \"The View,\" Meghan McCain called out to President Donald Trump's daughter and advisor on her stance.\n    USA TODAY",
      "author": "Cydney Henderson",
      "content": " Meghan McCain isn’t afraid to speak her mind. And that rings more true than ever since the outspoken daughter of the late Arizona Sen. John McCain joined \"The View\" in October 2017 as the lone conservative voice. \"My presence on the show has been, 'Nobody’s going to bully me, nobody’s going to talk down to me, and nobody’s going to pull the kind of (expletive) that’s been pulled on a lot of people in this chair,' \" she told Elle in June. Her time on the ABC talk show has sometimes been contentious, to say the least, as she frequently spars with liberal co-host Joy Behar, even resulting in some name calling. In June, she frankly said, \"It's not a fun job for me every day.\" But love her or hate her, McCain is committed to standing her ground, whether it's popular or not. In honor of the return of \"The View,\" here are seven times McCain has been blunt about her politics. 'The View' is back! Where did we leave off? McCain, who referred to herself as the \"chick on the panel that spent most of her break shooting,\" quarreled with her co-hosts on gun control during the Season 23 premiere. \"This is a ground-level issue for me,\" McCain said during a discussion around the Aug. 31 mass shooting in Odessa, Texas. \"If you’re going to be a gun-grabber, you don’t get my vote.\" She was referring to two 2020 Democratic presidential candidates: former Vice President Joe Biden, who said he wanted to reinstate the federal assault weapons ban that expired in 2004, and former Rep. Beto O’Rourke, who proposed a mandatory buyback of assault-style rifles. Meghan McCain: 'There's going to be a lot of violence' if assault weapons are banned \"The AR-15 is by far the most popular gun in America,\" McCain said. \"If you're talking about taking people’s guns from them, there’s going to be a lot of violence.” She declared: \"I’m not living without guns. … It’s just that simple!” McCain takes her job as the talk show's only conservative voice seriously. \"I try to just remind myself that I'm representing 50% of the country,\" McCain told Entertainment Tonight. \"I'm representing a bunch of women even though I only have one chair, and it's really important.\" She continued: \"I know there's people in the middle of the country that feel like they're really happy that someone is representing them.\" More: Meghan McCain on being 'The View's only conservative voice Being the only conservative voice on the panel also has its down sides. McCain said she's often scapegoated for President Donald Trump's actions. \"I get that you’re angry that Trump’s president, like a lot of people are, but I don’t think yelling at me is gonna fix the problem,\" McCain said to Behar during an argument over one of Trump's rallies. McCain dubbed herself the show's \"sacrificial Republican.\" More:Meghan McCain hurls harsh words at Joy Behar on 'The View' After saying on CNN in January that she no longer self-identifies as a Republican, McCain clarified her political views – where else but on \"The View.\" \"I said I consider myself a conservative first and foremost before being a Republican – which, by the way, people like Ted Cruz say all the time – then I also said I'm still in the party and l vote Republican and I will going forward. But Trump gets nothing from me,\" she said, rehashing her interview with Van Jones. McCain continued: \"That somehow got interpreted as I have led this mass exodus out of the Republican party. It's not true at all: I am still a Republican. But not voting for Trump doesn't necessarily mean you're no longer a conservative.\" 'I consider myself a conservative first':Meghan McCain clarifies her politics In her eulogy at her father’s memorial in Washington, D.C., in September 2018, McCain took a direct jab at President Trump and his campaign motto, without repeating it. “The America of John McCain has no need to be made great again, because America was always great,” she said. She said her father was \"the real thing, not cheap rhetoric from men who will never come near the sacrifice he gave so willingly, nor the opportunistic appropriation of those who lived lives of comfort and privilege while he suffered and served.\" John McCain memorial:Meghan McCain jabs Trump, says 'America was always great' McCain – who previously said she's \"liberal on social issues\" such as gay marriage – has also faced criticism from her own party. \"Every day of my life I come against a conservative who wants me to shut up,” McCain told Politico in October 2014. “I do believe I’m right and they are wrong. I do believe that unless we start reaching out to minorities and women, and honestly start supporting the LGBT community, there is no more future for the Republican party.” Meghan Mccain column: Conservative case for gay marriage McCain, a former contributor for the Daily Beast, told the outlet in 2012: \"I don’t fit into the traditional Republican box that the wingnuts who have hijacked my party think all Republicans should.\" Contributing: Hannah Yasharoff, Savannah Behrmann, Joel Shannon See our full coverage of entertainment news",
      "date": "Published 7:00 a.m. ET Sept. 12, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Cindy McCain's first year without John McCain: 'Trying to put our family back together'",
      "url": "https://www.usatoday.com/story/news/politics/2019/08/21/cindy-mccain-first-year-since-husband-sen-john-mccain-died/2070067001/",
      "subtitle": "Cindy McCain, joined by White House Chief of Staff John Kelly and Secretary of Defense General James Mattis, lay a wreath at the Vietnam Veterans Memorial.\n    USA TODAY",
      "author": "Yvonne Wingett Sanchez",
      "content": " Frank Sinatra’s “My Way” was playing from John McCain’s playlist as the senator took his final breath a year ago Sunday, out on the porch of his family’s home near Cornville, Arizona. Cindy McCain, his widow, also remembers a hawk that nested on their property each year, swooping across the lush grass. It landed on a nearby tree, facing the senator’s family. “And that was it,” she recalled this week in a den adorned with political memorabilia inside her north-central Phoenix home. Their life together had ended after nearly 39 years of marriage, raising kids, welcoming grandchildren, traveling the world, grinding through two presidential races and six runs for the Senate, and facing the searing scrutiny of public life. Before he died, they talked about what this would look like. She knew what steps needed to be done. But she wasn’t prepared for how difficult it would be to do it alone. Meghan McCain: Meghan McCain to release audiobook next year discussing dad John McCain, politics She would return to the central Phoenix neighborhood where she grew up, a familiar place just off the sandy bridal path shaded by giant trees. When she wasn't with their kids, she would be working to grow the McCain Institute for International Leadership at Arizona State University, the foreign-policy think tank that bears her husband's name. It’s still difficult to return to the family's home in Cornville. Happy memories have, at least temporarily, been overshadowed by more painful ones. Even as she tries to heal by filling her time with work to carry on her husband’s legacy, she is helping her children cope with the loss of their father. \"My job is to make sure they’re OK  — that’s my job,\" McCain said. \"I have gotten calls in the middle of the night. I’ve gotten calls from ones I didn’t ever think that they would call me … Each situation is different.\" The family lost its patriarch. The world, she said, lost a voice of reason. The retired Navy captain and Vietnam prisoner of war had become a fixture in American and global politics before his death Aug. 25, 2018, at the age of 81. When he spoke to condemn the incivility and dysfunction that permeates American politics today, his voice was widely accepted as a counterweight to the combative style of politics and leadership embraced by President Donald Trump. John McCain: Sen. John McCain, American 'maverick' and political giant, dies at 81 After burying her husband at the U.S. Naval Academy Cemetery in Annapolis, Maryland, she became chair of the McCain Institute. She is working to expand and develop new programs to combat human trafficking around the world, to develop new leaders in the mold of her husband, and to advance human rights and democracy by encouraging people to vote. At the same time, she is working with ASU to construct a John McCain library, which would house his artifacts, writings and memorabilia. She envisions a research institute on par with presidential libraries that can host presidential debates. In her mind, McCain sees a building with high glass to encourage open discussion. The desert terrain is perfect for an outdoor path for walking, she said, and she wants to work with a wildlife rehabilitation center as part of the project. A replica of the type of plane he was shot down in while flying a combat mission over North Vietnam, an A-4E Skyhawk, could hang from the ceiling. McCain hopes to break ground within the next two years, depending on funding. McCain funeral: Meghan McCain says father's 'America was always great' during speech at National Cathedral To commemorate the anniversary of her husband’s death, she is asking Americans to perform an act of civility and post about it on social media with the hashtag #ActsOfCivility. This could mean sitting down for a conversation with someone you disagree with or volunteering alongside someone you disagree with for a cause that benefits others. This week, McCain plans on visiting elderly people at a local care facility where her mom once lived. McCain mentioned the recent mass shootings when talking about the civility campaign. “I’m no different from anybody else who lives here: I’m worried about our country right now,” she said. “How many shootings have we had, just in a two-week period? … I’m concerned about that as a parent, as a grandmother, as a citizen. “... I would like people to take a step back and just remember: An act of civility can change someone’s life.” McCain said she is troubled by the rhetoric surrounding immigrants and minorities. Investigators are treating the mass shootings in California and in El Paso as domestic terrorism. While the motive in the California shooting at a garlic festival remains unclear, the suspect in the Texas shooting posted a racist screed online and admitted to police that he traveled to El Paso to target Latinos. “We are a country of diversity. We’re a country that has succeeded because of our diversity,” McCain said. “I’m not saying we don’t have problems — we do. But we are rich in heritage, right here in Arizona because of our Hispanic culture.” Cindy McCain: Cindy McCain responds to report her family supports Biden in 2020, has 'no intention' to get involved Condemning anti-immigrant rhetoric, McCain added: “It’s just wrong and it offends me as an American, and it offends me as John’s wife, as a McCain. He stood for so much more than that. And our country is better than that.” She declined to comment directly about the president’s attacks over the past year on her husband, and his rhetoric. “My message is more to my family and to my community and to the people that loved John and people that loved him but didn’t vote for him,” she said. She likes to remind people of the moment during the 2008 campaign when the senator, who was running against Barack Obama for the presidency, corrected a woman at a town hall who said she couldn’t trust Obama because he was “an Arab.” “No, ma’am,” John McCain said. “He’s a decent family man, citizen, that I just happen to have disagreements with on fundamental issues and that’s what this campaign is all about.” His wife said: “I would have expected nothing less for him … I would hope people would remember things like that.” McCain and Trump: What's driving Donald Trump's feud with John McCain? War record, Obamacare among the themes This new chapter brings new traditions for McCain. A baby is coming. A boy, the first child of their youngest son, Jimmy. She hopes he will be born on Aug. 29, her husband's birthday. \"I think he looks like John,\" she said of a sonogram photo of the baby that hangs on a wall near the kitchen. On the eve of the anniversary of her husband's death, McCain will host a party with close friends and family to celebrate her husband. Last year around this time, the family threw a “Great Gatsby”-themed party at the cabin to say goodbye to him, knowing the end was near. A year later: Jack McCain reflects on his father's death “What he asked me to do after that, was, ‘Every year, I want you to have a party … and I want you to celebrate. No one’s gonna cry, no one’s gonna be upset,’” she recalled him saying. The kids groaned, she said, when they found out he wanted his playlist — filled with Linda Ronstadt, Andy Williams and Frank Sinatra — on repeat. They will toast him with a version of the Gibson, a martini-like cocktail with an onion. (He hated olives). They will celebrate his birthday with family, friends and former McCain staffers on Aug. 29 at a local restaurant. He would have turned 83 this month. Looking ahead toward 2020, Cindy McCain says she doesn’t expect to get involved in politics. A special election for the Senate seat once held by her husband could determine which party controls the Senate. \"I think I’m going to sit back and kind of see what happens,\" she said. \"We’re still trying to put our family back together.\" Have news to share about Arizona's U.S. senators or national politics? Reach the reporter on Twitter and Facebook. Contact her at yvonne.wingett@arizonarepublic.com.",
      "date": "Published 8:12 a.m. ET Aug. 21, 2019 | Updated 9:03 a.m. ET Aug. 21, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Meghan McCain announces social media break in a tribute to her 'hero,' late father John McCain",
      "url": "https://www.usatoday.com/story/entertainment/celebrities/2019/08/24/meghan-mccain-pays-tribute-john-mccain-announces-social-media-break/2108274001/",
      "subtitle": "\"The View\" co-host, 34, revealed in an op-ed for the New York Times Friday that she lost a pregnancy weeks ago.\n    USA TODAY",
      "author": "Sara M Moniuszko",
      "content": " Meghan McCain is remembering her late father John McCain on the day before the anniversary of his death. The former United States senator died last year at age 81. The co-host of \"The View\" took to Twitter on Saturday to pay tribute to her \"hero\" in a series of tweets. \"Last year tomorrow, August 25th was the worst day of my life. I lost my hero. I miss my father every single day, I will for the rest of my life. Grief is omnipresent and relentless\" she wrote. \"For every single person who has sent prayers, love & support to my family, we are truly grateful\" In a follow-up tweet, she also announced she would be going on a social media break until her father's birthday. \"On this anniversary until his birthday after the 29th I am going to take a break from social media. The memory of my father's life continues to guide me today, as it always will,\" she said. \"Remember to cherish your loved ones. I still can’t believe my heart didn’t stop when yours did, Dad..\" McCain is set to share more thoughts about her late father and politics in an audiobook coming out next year. Audible.com announced earlier this month that McCain would offer a \"blueprint\" for conservative politics while also drawing on what she learned from her father, the war hero, Arizona Republican and 2008 presidential candidate. McCain's previous books include \"My Dad, John McCain,\" a picture story published in 2008. Contributing: The Associated Press More: Meghan McCain rips 'Mindy Project' producer for 'cruel' tweet, brings Mindy Kaling into it 'I am not hiding anymore': Meghan McCain opens up about 'horrendous' miscarriage",
      "date": "Published 1:27 p.m. ET Aug. 24, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "A year after John McCain's death, Cindy McCain says 'Our country is not well right now'",
      "url": "https://www.usatoday.com/story/news/politics/2019/08/25/john-mccain-year-later-cindy-mccain-says-our-country-not-well/2115445001/",
      "subtitle": "null",
      "author": "Ronald J. Hansen",
      "content": " One year after her husband's death, Cindy McCain said the nation is not well and needs to return to a more civil style of politics. In an interview with ABC's \"This Week,\" the widow of Sen. John McCain said she still misses the Arizona Republican as much as ever, and insisted she was not overly hurt by Sen. Lindsey Graham's now-close relations with President Donald Trump. McCain said she is \"doing OK,\" but could not offer the same sense for America, saying that her husband, who famously feuded with Trump, would be most upset by what is happening in immigration and border security these days. \"Our country is not well right now,\" she said. \"We need to get our act together, No. 1, and step back and take a breath. This country is made up of immigrants. We're made up of people of every color, every creed and that's what makes us special. \"John would be very discouraged about the border situation right now. He would also be the voice of reason in all of this, which is what we're sorely lacking right now,\" she added. \"I don't see anyone carrying the voice-of-reason mantle right now. I'm hoping someone will bubble up.\" McCain could not offer encouraging words about the Republican Party, either. She said the GOP is not the party of former Presidents Abraham Lincoln and Ronald Reagan. Even so, McCain, who last week called for acts of civility touted on social media as a tribute to her husband, tried to sound an optimistic tone for the future. John McCain: Biography of Arizona's senator and political maverick \"I believe this pendulum is going to swing back,\" she said. \"I don't know when, but I just don't believe we're going to stick right here on the side that's just disruptive and mean and non-progressive in any way.\" McCain said she remained friends with her husband's colleagues in the Senate, but reacted coolly when asked specifically about Graham, R-S.C., who was often McCain's sidekick in the Senate, but who has more recently emerged as a reliable booster for Trump. He is up for re-election next year. \"Lindsey has his own political career to worry about and his own political life,\" McCain said. \"I would just hope that in the long run everyone would begin to move in the right direction, including Lindsey or anybody else. Lindsey's a part of my family. He's a good friend and I cannot and will not be critical of Lindsey.\" For his part, Graham, in an interview Sunday with CBS's \"Face the Nation,\" was respectful of McCain and her family and remained steadfast in his support of Trump. Asked about the lack of civility that McCain has cited, Graham said: \"It's a rough-and-tumble America, but America's always been pretty rough-and-tumble.\" \"Cindy McCain has taken over his job for the family. Nobody was ever better taken care of in an illness than Cindy provided care to John,\" Graham added. \"She's doing a great job on her own, in (fighting) human trafficking, and to the four boys and three daughters, they're doing great. They miss their dad. I miss him, but my job is to carry on and help this president where I can and I will.\" Reach the reporter Ronald J. Hansen at ronald.hansen@arizonarepublic.com or 602-444-4493. Follow him on Twitter @ronaldjhansen. Subscribe to our free political podcast, The Gaggle.",
      "date": "Published 2:21 p.m. ET Aug. 25, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Meghan McCain defends Chrissy Teigen after President Trump targets Teigen, John Legend",
      "url": "https://www.usatoday.com/story/entertainment/celebrities/2019/09/09/donald-trump-launches-twitter-spar-john-legend-chrissy-teigen/2261710001/",
      "subtitle": "Meghan McCain tweeted in defense of Chrissy Teigen after President Trump called her a \"filthy mouthed wife\" on Twitter.\n    USA TODAY",
      "author": "Hannah Yasharoff",
      "content": " Following President Donald Trump targeting singer John Legend and TV/social media personality Chrissy Teigen online Sunday night, Meghan McCain has taken a side. The daughter of late Republican Sen. John McCain, who serves as a conservative voice on \"The View,\" showed support for Teigen the day after Trump slammed her and Legend on Twitter. \"Since when is there something wrong with being a filthy mouthed wife?\" McCain tweeted Monday, referencing the words the president used to describe Teigen. \"#teamchrissy\" Trump began tweeting about the celebrity couple after Legend was featured in MSNBC's final installment of Lester Holt's \"Justice For All\" series, a report about the criminal justice system. Sunday's report included an interview with Legend discussing his organization Free America, which aims to \"amplify the voices of individuals impacted by the criminal justice system and those who are working to change it,\" according to the official website. Trump complained Sunday night that \"people pushing so hard for Criminal Justice Reform... came to me as a group and asked for my help,\" but now isn't getting any credit, seemingly referring to the First Step Act he signed into law in December, which allows prisoners to get more days removed from their sentences for good behavior. \"Guys like boring musician @johnlegend, and his filthy mouthed wife, are talking now about how great it is - but I didn’t see them around when we needed help getting it passed,\" Trump tweeted. \"'Anchor' @LesterHoltNBC doesn’t even bring up the subject of President Trump or the Republicans when talking about the importance or passage of Criminal Justice Reform. They only talk about the minor players, or people that had nothing to do with it...And the people that so desperately sought my help when everyone else had failed, all they talk about now is Impeaching President Trump!\" The final part of Holt's report, which originally aired Friday and re-played Sunday night before a town hall event, gave Trump credit for signing the First Step Act, acknowledging its potential to reduce sentences for thousands of nonviolent offenders in federal prisons. It also noted that the bill doesn't help over 90% of people in US prisons at the state and local levels. Teigen and Legend are frequent, outspoken critics of Trump – the couple marked his 72nd birthday last year by donating a $72,000 check from every person in their family to the ACLU, for a total of $288,000 from Teigen, Legend, and their two children, Luna, 3, and Miles, 1. \"lol what a (expletive). tagged everyone but me. an honor, mister president,\" Teigen tweeted, repeatedly calling the president a three-word expletive and referring to his tweets as his \"9th meltdown of the day.\" She added: \"the absolute best part of his tweet is I literally didn't speak in the special, nor was I mentioned. I'm cackling at the pointless addition of me because he cannot not be a (expletive).\" Legend also chimed in: \"Imagine being president of a whole country and spending your Sunday night hate-watching MSNBC hoping somebody--ANYBODY--will praise you. Melania, please praise this man. He needs you. \"Your country needs you, Melania,\" he added, before retweeting a photo of the first lady smiling while leaning in to greet Canadian Prime Minister Justin Trudeau at the G-7 summit that previously had the hashtag #MelaniaLovesTrudeau trending. \"Ah yes, Melania is otherwise occupied. My apologies, @realDonaldTrump,\" Legend wrote. Fox News host Laura Ingraham mocks Chrissy Teigen, star claps back with fiery tweets",
      "date": "Published 6:52 a.m. ET Sept. 9, 2019 | Updated 7:02 a.m. ET Sept. 10, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Meghan McCain visits her dad John McCain on his birthday: 'I love you'",
      "url": "https://www.usatoday.com/story/life/parenting/2019/08/29/meghan-mccain-wishes-dad-john-mccain-a-happy-birthday-in-sweet-tribute-after-social-media-break/2150901001/",
      "subtitle": "null",
      "author": "Sonja Haller",
      "content": " Meghan McCain ended her social media break for the best reason — to wish her dad, late United States senator John McCain, a happy birthday. The co-host of \"The View\" kept it simple with a short Instagram post that showed his headstone at the U.S. Naval Academy Cemetery surrounded by miniature American flags, an Arizona state flag, flowers, a cactus terrarium and her kneeling in front. \"Happy birthday Dad. I love you,\" she captioned the Thursday post. McCain died last year after a battle following a year-long battle with a rare form of brain cancer. He was 81. McCain announced five days ago, on the eve of her father's death, that she was missing her father and that her grief was always there. \"Last year tomorrow, August 25th was the worst day of my life. I lost my hero,\" McCain wrote on Twitter. \"I miss my father every single day, I will for the rest of my life. Grief is omnipresent and relentless. For every single person who has sent prayers, love & support to my family, we are truly grateful.\" McCain also shared that she quitting was social media until her father's birthday. She believed it was a fitting way to honor him. \"On this anniversary until his birthday after the 29th I am going to take a break from social media. The memory of my father's life continues to guide me today, as it always will. Remember to cherish your loved ones. I still can’t believe my heart didn’t stop when yours did, Dad..\" READ MORE",
      "date": "Published 12:02 p.m. ET Aug. 29, 2019 | Updated 12:10 p.m. ET Aug. 29, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Meghan McCain addresses dangers of body shaming: This 'can lead women to eating disorders'",
      "url": "https://www.usatoday.com/story/entertainment/celebrities/2019/10/03/meghan-mccain-shuts-down-body-shaming-twitter/3854286002/",
      "subtitle": "Meghan McCain tweeted in defense of Chrissy Teigen after President Trump called her a \"filthy mouthed wife\" on Twitter.\n    USA TODAY",
      "author": "Erin Jensen",
      "content": " Meghan McCain's view is that she's just fine, hear that critics? The \"View\" co-host responded to a Twitter user who commented on her size in a since-deleted tweet. \"How many pounds ago was that profile picture?\" the user asked. \"Jenny Craig, NutriSystem or Weight Watchers (WW) would endorse you without hesitation.\" McCain, who has a reputation for not hesitating to speak her mind, put the person in their place. \"Hey Jacklynn - it's harassment like this that can lead women to eating disorders,\" she tweeted in response. \"I am one of the lucky ones who never suffered from it.\" McCain added: \"I never dieted to get a man or a job and some how landed my dream both - hope young girls see me and know they don't have to diet either.\" Meghan McCain on being 'The View's only conservative voice: 'I'm representing 50% of the country' 'Please excuse Grace': Parents may not let you miss class, but Hillary Clinton will McCain isn't alone in celebrities calling out their trolls. Last month, late night host James Corden delivered a pointed message to Bill Maher, telling his fellow talk-show host that his comments about fat-shaming \"needing to make a comeback\" are unacceptable. \"There is a common and Insulting misconception that fat people are stupid and lazy and we're not,\" Corden said on \"The Late Late Show.\" \"Like we get it. We know. We know that being overweight isn't good for us. And I've struggled my entire life trying to manage my weight. And I suck at it.\" \"We're not all as lucky as Bill Maher, you know,\" he added. \"We don't all have a sense of superiority that burns 35,000 calories a day, right?\" Also in September, Demi Lovato posted an unedited bikini picture to Instagram that embraced her imperfections. \"This is my biggest fear. A photo of me in a bikini unedited,\" Lovato wrote in the NSFW caption, calling attention to her cellulite, which she dubbed \"CELLULIT.\" Lovato went on to write that she was \"literally sooooo tired of being ashamed of my body,\" admitting that the other bikini photos she's posted have been edited, and telling fans that she's \"back in tv/film while not stressing myself with a strenuous workout schedule before 14 hour days.\" \"This is what I got,\" she wrote. \"I want this new chapter in my life to be about being authentic to who I am rather than trying to meet someone else’s standards. So here’s me, unashamed, unafraid and proud to own a body that has fought through so much and will continue to amaze me when I hopefully give birth one day.\" Contributing: Maeve McDermott Meghan McCain announces social media break in a tribute to her 'hero,' late father John McCain",
      "date": "Published 2:21 p.m. ET Oct. 3, 2019 | Updated 2:25 p.m. ET Oct. 3, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Meghan McCain on husband Ben Domenech: 'Conservative men have better family values'",
      "url": "https://www.usatoday.com/story/entertainment/celebrities/2019/10/09/meghan-mccain-conservative-men-have-better-family-values/3915535002/",
      "subtitle": "\"The View\" co-host Meghan McCain said \"conservative men have better family values\" on \"The Ben Shapiro Show Sunday Special.\"\n    USA TODAY",
      "author": "Cydney Henderson",
      "content": " Meghan McCain is opening up about her marriage. The \"View\" co-host praised the family values of her conservative pundit husband Ben Domenech during an appearance on \"The Ben Shapiro Show Sunday Special\" over the weekend. \"When we went out the first time, I was like, this is a totally different vibe and it’s way better. I tell women: Conservative men have better family values, and they take dating and family and marriage more seriously,\" McCain told Shapiro. She continued: \"I think if you’re serious, which I was when I met my husband, about getting married and having kids and wanting to go to the next phase, I just found … finally dating a conservative man was the one. He took it seriously.\" Meghan McCain speaks her mind:7 times 'The View' host has been blunt about her opinions McCain tied the knot to Domenech in November 2017 at her family's ranch in Sedona, Arizona. Their relationship came as a surprise to many, including McCain herself, after Domenech publicly slammed the idea of dating her on Twitter in 2012. \"Nobody is more surprised by the man I ended up marrying than me,\" McCain said. \"I say that with supreme love and respect. I'm deeply in love and he's the best decision I've ever made, but he's the most conservative man I've ever met.\" This 'can lead women to eating disorders': Meghan McCain addresses dangers of body shaming McCain said Domenech was a huge support system during \"the worst year of my life between August of 2018 and August of 2019,\" referring to her recent miscarriage and the death of her father, Arizona Sen. John McCain. \"My husband has been the most incredible (man),” she shared. \"I hope every woman has the kind of husband I have. I say that as someone who dated every (expletive) in West Hollywood possible before I met my husband.\" 'I am not hiding anymore': Meghan McCain opens up about 'horrendous' miscarriage More: Meghan McCain announces social media break in a tribute to her 'hero,' late father John McCain",
      "date": "Published 12:06 a.m. ET Oct. 9, 2019 | Updated 7:59 a.m. ET Oct. 9, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "John McCain would convict Donald Trump in an impeachment trial. He said as much in 1999.",
      "url": "https://www.usatoday.com/story/opinion/2019/10/10/john-mccain-would-vote-impeach-donald-trump-trial-column/3931855002/",
      "subtitle": "Impeaching a U.S. president might not be the be-all-end-all for their career. We explain why this is the case.\n    Just the FAQs, USA TODAY",
      "author": "EJ Montini",
      "content": " The closed door statements made by senators voting in the impeachment trial of former President Bill Clinton were published in the Congressional Record in 1999. So while we can't ask the late Sen. John McCain what he thinks about the actions of President Donald Trump, we can, through McCain’s statement on Clinton, understand what he expected of a president and what, in McCain’s mind, should cause a president to be removed from office. Every Republican in the Senate should read McCain’s statement, particularly the person gifted McCain’s seat, Sen. Martha McSally. McCain voted to convict Clinton. He says early in his statement, “Indeed, I take no satisfaction at all from this vote, with one exception – and an important exception it is – that by voting to convict I have been spared reproach by my conscience for shirking my duty.” The senator then speaks about the rationale used by Clinton’s defenders, who said that the articles of impeachment against Clinton did not rise to the level of high crimes and misdemeanors but were offenses, as McCain put it, “committed to cover up private not public misconduct.” McCain understood the argument, but wasn’t buying it. He said, “This, too, is an appealing rationalization for acquittal. But it is just that, a rationalization. Nowhere in the Constitution or in the expressed views of our founders are crimes intended to conceal the President's character flaws distinguished from crimes intended to subvert democracy. What they owe us: Trump is in free fall. We need insights on his fitness from Mattis, Kelly and others. Now. “The President thwarted justice. No matter how unfair he or we may view a process that forces a President to disclose his own failings, we should not excuse or fail to punish in the constitutionally prescribed manner evidence that the President has deliberately thwarted the course of justice.” Weird, isn’t it? The same kind of “rationalization” is being used these days by Republicans looking to protect President Donald Trump. They say Trump’s alleged transgressions are more a reflection of character flaws than impeachable offenses. It's similar to the argument Clinton's defenders used. McCain wasn't having it. He said, “I have done things in my private life that I am not proud of. I suspect many of us have. But we are not asked to judge the President's character flaws. We are asked to judge whether the President, who swore an oath to faithfully execute his office, deliberately subverted – for whatever purpose – the rule of law.” The time for waiting is over: The House must move on Trump impeachment articles now. That’s the heart of it, as far as McCain is concerned. The president's sworn oath. He said, “All of my life, I have been instructed never to swear an oath to my country in vain. In my former profession, those who violated their sworn oath were punished severely and considered outcasts from our society. “I do not hold the President to the same standard that I hold military officers to. I hold him to a higher standard. Although I may admit to failures in my private life, I have at all times, and to the best of my ability, kept faith with every oath I have ever sworn to this country. I have known some men who kept that faith at the cost of their lives.” McCain also brushed off the argument – like one we hear from Trump apologists today – that no ordinary citizen would be treated the way the president is being treated. McCain said of this, “No, an ordinary citizen would not be treated as the President has been treated. But ordinary citizens don't enforce the laws for the rest of us. Ordinary citizens don't have the world's mightiest armed forces at their command. Ordinary citizens do not usually have the opportunity to be figures of historical importance.\" He continued, “Presidents are not ordinary citizens. They are extraordinary, in that they are vested with so much more authority and power than the rest of us. We have a right; indeed, we have an obligation, to hold them strictly accountable to the rule of law.” Imagine that. An obligation to hold the president strictly accountable. When was the last time Trump was held “strictly accountable” for … anything? Even worse, when was the last time McCain’s former Republican colleagues fulfilled their obligation? E.J. Montini is a columnist for the Arizona Republic, where this piece first appeared. Follow him on Twitter: @ejmontini",
      "date": "Published 1:50 p.m. ET Oct. 10, 2019 | Updated 3:34 p.m. ET Oct. 10, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    }
  ]
}