{
  "articles": [
    {
      "title": "",
      "url": "",
      "subtitle": "",
      "author": "",
      "content": "   ",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "2020 Democrats shy from 'socialist' label. Not Bernie Sanders",
      "url": "https://www.usatoday.com/story/news/politics/2019/06/12/bernie-sanders-debate-over-democratic-socialism-key-2020-campaign/1431323001/",
      "subtitle": "2020 presidential candidate Bernie Sanders talked about Trump, democratic socialism, and socialism in America at George Washington University.\n    Hannah Gaber, USA TODAY",
      "author": "John Fritze,",
      "content": "   WASHINGTON – As some Democratic presidential candidates are pushing back on blistering criticism from President Donald Trump that their party has become \"socialist,\" Sen. Bernie Sanders on Wednesday doubled down on his embrace of the label. Touting his \"democratic socialism\" approach to politics as the best way to address income inequality, the U.S. senator from Vermont sought to rebrand the controversial term during a high-profile address – even as some within his party worry that a leftward lurch could hurt Democrats in states like Ohio, Pennsylvania and Wisconsin next year. \"Over 80 years ago, Franklin Delano Roosevelt helped create a government that made transformative progress in protecting the needs of working families,\" Sanders said. \"Today, in the second decade of the 21st century, we must take up the unfinished business of the New Deal and carry it to completion.\" Trump has labeled the entire Democratic field socialist and has repeatedly warned that a Democratic president would embrace policies that led to economic ruin in Venezuela. In a crowded field of nearly two dozen candidates – and a strong desire to beat Trump in November – the criticism has resonated with some. \"I fundamentally disagree that we should do away with the democratic, regulated capitalism that has guided this country for over 200 years,\" said former Colorado Gov. John Hickenlooper, a Democat who is also seeking the presidential nomination. \"This position is shared by many of my Democratic colleagues, but for some reason, our party has been hesitant to express their opposition to democratic socialism.\" More: Bernie Sanders to defend democratic socialism in face of attacks Jim Kessler, executive vice president at the center-left think tank Third Way, said the socialist tag, if it sticks, could be damaging to Democrats. In November, both Trump and the Democratic nominee will be fighting for swing voters not tied rigidly to ideology. “We have never elected a national Democrat to the White House who is far to the left,” Kessler said. “Walter Mondale won one state. George McGovern won two. We are whistling past the graveyard if we think that's changed.” More: Trump looks to pin 'socialism' label on Democrats before 2020. Will it stick? For a nation that became the global counterweight to the Soviet Union after World War II, the term \"socialism\" has long been used as a stand-in for \"communism,\" and it has been viewed as anathema to American politics. Sen. John McCain and his running mate, Alaska Gov. Sarah Palin, used the word during the 2008 presidential campaign to attack Barack Obama's income tax proposals. During the 2016 Democratic primary, Hillary Clinton sought to use the S-word against Sanders, indicating she had heard from party officials who were \"concerned\" about the his policies. Clinton, who ran as a centrist, won the nomination, but it was Sanders who fired up much of the Democratic base. Sanders acknowledged opponents would continue to use the term socialism as a “slur.” “I have faced and overcome these attacks for decades,” Sanders said. Fifty-one percent of U.S. adults say socialism would be a bad thing for the country, and 43% say it would be a good thing, according to a Gallup poll published last month. That marks a sharp contrast with a Roper/Fortune survey in 1942 that found 40% describing socialism as a bad thing, 25% a good thing and 34% not having an opinion. Sanders stands alone among the field of nearly two dozen major Democratic presidential candidates to identify as a “democratic socialist.” Sanders defined the philosophy as not shaped by Marxism but rather embracing the ideals of President Roosevelt's New Deal. In practice, that has meant endorsing \"Medicare for all,\" which would allow the government-run Medicare program for seniors to provide health insurance for every American. Sanders has supported free or debt-free college tuition, paid for by taxpayers, and the ambitious Green New Deal to curb climate change. \"Economic rights are human rights,\" Sanders said. \"And that is what I mean by democratic socialism.\" Like what you’re reading? Download the USA TODAY app for more",
      "date": "Published 2:08 p.m. ET June 12, 2019 | Updated 7:19 p.m. ET June 12, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "'Teach your sons:' Kourtney Kardashian talks Menstrual Hygiene Day in bikini pic",
      "url": "https://www.usatoday.com/story/life/allthemoms/2019/05/28/kourtney-kardashian-menstrual-hygiene-day-not-embarrassing-teach-sons-instagram-bikini-pic/1259997001/",
      "subtitle": "null",
      "author": "Sonja Haller",
      "content": " Kourtney Kardashian is here to remind you that Tuesday is Menstrual Hygiene Day. The annual day aims to raise global awareness and break the silence around menstrual hygiene, and Kardashian, a mother of three, wanted to do her part. The reality star took to Instagram posting a snapshot of herself and girlfriend Stephanie Shepherd lying on their stomachs on the beach in booty-revealing swimsuits. \"Is my tampon string showing?” @steph_shep whispered to me,\" she wrote. \"The source of life shouldn’t be embarrassing or hard to talk about.\" Kardashian, 40, added that period knowledge isn't something that mothers and daughters should keep to themselves. 'It's diabolical and genius': John Mayer isn't dating Kourtney Kardashian – and has a conspiracy theory about the rumor They're co-parenting goals: Kourtney Kardashian says her co-parenting style has a 'good message\" The \"Keeping Up With the Kardashians\" star and ex Scott Disick co-parent sons Mason, 9 and Reign, 4 and daughter Penelope, 6. \"Mother’s, teach your sons too,\" she added. \"Join me and Steph in the conversation on poosh.com, and Happy Menstrual Hygiene Day.\" READ MORE",
      "date": "Published 3:29 p.m. ET May 28, 2019 | Updated 3:34 p.m. ET May 28, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Jessa (Duggar) Seewald welcomes a baby girl! See baby's adorable photo",
      "url": "https://www.usatoday.com/story/life/allthemoms/2019/05/28/jessa-duggar-seewald-and-ben-seewald-welcome-baby-girl/1262199001/",
      "subtitle": "null",
      "author": "Sonja Haller",
      "content": " Jesse (Duggar) and Ben Seewald now have more children than they each have hands to hold as they welcomed a third child into their family. Ivy Jane Seewald was born at their Arkansas home on Sunday, May 26 weighing 7 pounds, 14 ounces, the couple announced. She was 20½ inches long. \"She feels so tiny compared to her siblings!\" they wrote in a statement. Her big brother Spurgeon, 3, weighed almost 10 pounds and Henry, 2, weighed almost 9 pounds, the family wrote. \"We’re so grateful to God for this precious gift. She is already so loved. Her big brothers adore her!\" Jessa shared a photo on Tuesday of a sleeping Ivy and what looked almost like a slight grin on her face. See cute babies, tiny toes, more: Celebrities who have welcomed new babies this year The \"Counting On\" stars announced their pregnancy in January. \"From the day we found out we were expecting, we both guess boy...we would absolutely love it if we found out we were having a girl  — though we've joked that we'd be starting from square one and might have to learn a few things,\" the couple wrote on their website. Jessa, 25, and Ben, 23, married in Bentonville, Ark. in November 2014. READ MORE",
      "date": "Published 5:15 p.m. ET May 28, 2019 | Updated 5:54 p.m. ET May 28, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Kid Rock talks golfing with President Trump, calls him 'down-to-earth and cool'",
      "url": "https://www.usatoday.com/story/life/music/2019/06/26/kid-rock-golfed-trump-calls-him-down-earth-and-cool/1568754001/",
      "subtitle": "Kid Rock takes the course at Detroit Golf Club on Tuesday ahead of the 313 Area Celebrity Challenge during the week of Rocket Mortgage Classic week.\n    Brian McCollum, Detroit Free Press Pop Music Critic",
      "author": "Brian McCollum",
      "content": " Kid Rock has golfed shirtless in overalls, swigged beers on the links with John Daly, and gone red-white-and-blue for a round with the president. But he played it low-key on Tuesday at Detroit Golf Club, where he was part of the 313 Area Celebrity Challenge, a three-team scramble, ahead of the Rocket Mortgage Classic PGA tour event. There were no crazy outfits, no wild shenanigans, not even a drink in hand, as the cigar-chomping Michigan rocker joined a team with pro golfer Rickie Fowler, the Red Wings' Justin Abdelkader and Golf Channel host Blair O'Neal. \"There's always tomorrow!\" he told the Free Press ahead of the afternoon outing. He'll be back Wednesday at Detroit Golf Club, where he's a member, for an 18-hole pro-am competition. Shouts of \"Let's go, Bobby!\" and \"American bad (expletive)!\" rang out from the gallery Tuesday as Rock teed off on the competition's fourth hole. An hour later, it was Rock hollering to onlookers down the fairway as he hooked his drive left. A team led by Dustin Johnson ultimately prevailed on the day, beating Rock and Fowler's team through a tiebreaker. More from Detroit Golf Club: Tom Izzo hard on his golf game, too: 'I didn't maim anybody' As with wild rock 'n' rollers like Alice Cooper before him, golf has come to loom large in the leisure life of Kid Rock. He's uncharacteristically modest about his abilities (\"I stay in my lane\"), but said he feels less pressure now than when he started playing in public events a decade ago. He was turned on to the game by his lead guitarist, Marlon Young, with encouragement from drinking buddy Daly. \"These guys were doing it so much on the road,\" he said of his touring band. \"And I'm sitting there in the hotel room bored. I had visited every antique shop and strip club when we were younger. So it's something productive to do.\" Moreover, Rock said, \"Where else am I going to spend five hours uninterrupted with the (expletive) president? Who gets to do that?\" Kid Rock was alluding to his \"awesome\" March round of golf with President Donald Trump, where they talked politics among \"everything else.\" Trump, he said, was \"down-to-earth and cool.\" \"I always thought Obama was cool as (expletive). I didn't like his politics, but I'm like: That's one cool-ass (expletive). You kind of have to be for president,\" Rock said. \"Trump was just off the map, I have to say. And that's politics aside.\" The May golf outing was Kid Rock's second encounter with President Trump, following a 2017 White House dinner with Sarah Palin and Ted Nugent. More: Michigan rockers Kid Rock, Ted Nugent meet and dine with Donald Trump March also included an outing where Kid Rock nailed his first hole-in-one — with golf giant Jack Nicklaus looking on. \"How do you top that? That's just my stupid luck,\" Rock said, laughing. \"After that, golf seems pretty much (pointless) — like, how do you top that?\" Rock, who splits his time now among Nashville, Florida and his multiple Michigan homes, will be back in front of hometown audiences in September, when he plays four shows at DTE Energy Music Theatre. More: Kid Rock to perform on 2 consecutive weekends in September at DTE Energy Don't expect the politically charged \"stump speech\" that marked Rock's shows here in 2017, when he opened Little Caesars Arena amid a mock run for U.S. Senate that much of the media and punditry took seriously. \"I'm just going to play the jams and entertain,\" he said of the upcoming DTE dates. Rock is a member of the Bears Club in Jupiter, Florida, founded by Nicklaus, and the two have become buddies. When Rock showed up in camouflage shorts at a pro-am event with Nicklaus, he said he offered an explanation to the 79-year-old legend: \"Make no mistake, Bob Ritchie is a member of this club, and he dresses appropriately. But (expletive), you're golfing with Kid Rock today.\" Contact Detroit Free Press music writer Brian McCollum: 313-223-4450 or bmccollum@freepress.com.",
      "date": "Published 7:57 a.m. ET June 26, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Stephanie Grisham's unlikely path from Arizona politics to Trump's White House",
      "url": "https://www.usatoday.com/story/news/politics/2019/06/29/stephanie-grisham-path-new-white-house-press-secretary/1604930001/",
      "subtitle": "Stephanie Grisham, who also serves as the first lady's deputy chief of staff, will become President Trump's third press secretary in three years.\n    USA TODAY",
      "author": "Yvonne Wingett Sanchez and",
      "content": "  Many people heard of Stephanie Grisham, President Donald Trump's new White House press secretary, for the first time Tuesday. What they don't know is the bumpy ride — much of it in Arizona — that preceded her move into the national spotlight. Grisham, 42, was born in Washington state and began her professional career in Arizona, records show. She declined to comment about her path to one of the most high-profile jobs in government. Those who know and worked with Grisham describe a woman who brought professionalism and dogged advocacy to her jobs, even as she faced personal challenges behind the scenes. Jobs with increasing pressure, financial problems and drunken-driving arrests shaped her life before she became the new voice of the White House. New WH press secretary: President Trump hires Stephanie Grisham to replace Sarah Sanders as press secretary If Trump seems under siege from his many critics, he has tapped a spokeswoman who has helped manage high-profile embattled officials before. Grisham’s mother, Ann Schroder of Nebraska, told The Arizona Republicshe is \"excited and thrilled\" for her daughter, but otherwise declined to discuss Grisham's life. Similarly, Grisham’s ex-husband Dan Marries told The Republic he’s happy for Grisham. Marries, a former firefighter for the Bureau of Land Management, is an evening news anchor for KOLD News 13 in Tucson. Marries said he and Grisham married in 1997. Court records show the couple filed for divorce in 2004. Marries called the divorce amicable. They have a son. She has a second son. Trump-Putin: Trump defends his exchange with Vladimir Putin over election meddling Grisham began voting in Arizona as a registered Democrat in 1997, when she was in her early 20s, according to the Arizona Secretary of State's Office. She didn't become a Republican for at least a decade. There is no record she voted in the 2016 election in which she was heavily involved. Grisham's rapid rise within Arizona Republican politics can be traced to her meeting Republican Tom Horne, who was the state's superintendent of public schools. At the time, he said, she was working with the Arizona Charter Schools Association. According to Horne, Grisham saw how Horne handled historical trivia questions from students and decided to work with him after he was elected Arizona attorney general in 2010. She also worked for Mitt Romney's 2012 presidential campaign, for AAA Arizona, and had formed Sound Bite Public Relations LLC. Marianne Williamson: Republicans start donating to Marianne Williamson to keep her in future Democratic debates Grisham's tenure as Horne's press secretary, who served one term as attorney general, thrust her name into the Arizona news. Horne wound up the target of an FBI investigation into allegations of campaign-finance wrongdoing. Grisham tried to cast him and the office as functional even as Horne's political career was unraveling. After Republican Mark Brnovich defeated Horne in the 2014 GOP primary, Grisham landed as a spokeswoman for the Republican caucus for the Arizona House of Representatives. Then-House Speaker David Gowan, R-Sierra Vista, soon found himself under public scrutiny for charging $12,000 in personal and campaign travel expenses to taxpayers. During Grisham's tenure at the state House, Gowan issued a new rule in 2016 that required reporters to undergo extensive background checks in order to access the floor of the chamber. 'Lives depend on it': AG William Barr declares public safety 'emergency' in Alaska The unprecedented order was widely viewed as retribution for hard-hitting coverage by the Arizona Capitol Times’ Hank Stephenson, who broke the story of Gowan’s use of state vehicles while running for Congress. Gowan, who said the measure was for security reasons, relented after reporters refused to submit to background checks and after criticism by state lawmakers from both sides of the aisle. No other state required a criminal background check for reporters to be issued a press credential or obtain access to the legislative floor. Stephenson described Grisham as \"very firm with her opposition or complaints\" about his coverage. The stories triggered apparent retaliation, he said. \"I still don’t know how much of it was her brainchild or her job to deliver orders from her bosses,\" he said. The Democratic debates: 5 things we learned from two nights of debates The newspaper's access to the House floor was revoked — but later reinstated — for opening day ceremonies. Then came the background checks, which were widely seen by the Arizona press corps as retaliation for Stephenson's reporting, a view he shared. \"There's no question in my mind that's what that was about,\" Stephenson said. Former Democratic state Rep. Ken Clark of Phoenix said Grisham was \"the constant apologist\" for Gowan's \"terrible\" leadership during his tenure as speaker. Former state Rep. Bob Robson, R-Chandler, said Grisham didn't deserve the blame. \"She was very good at getting out the message that she was asked to get out,\" he said. \"She performed very well at a time with a lot of turmoil, quite candidly. I think she was blamed for a lot of things she didn’t do. … She took … the hit.\" Sometimes hits came from her own party. State Sen. Michelle Ugenti-Rita, a Scottsdale Republican who served in the House in 2015, tangled with Grisham publicly at a party after a political awards show, according to a June 24, 2015, write-up of the altercation that relied on anonymous sources in the Yellow Sheet Report, a political insider newsletter published by the Arizona Capitol Times. Jimmy Carter on Trump: Donald Trump blasts Jimmy Carter as a 'nice man' but a 'terrible president' Grisham won the \"Best PR Person\" award from the Arizona Capitol Times that year. There were no signs of bad blood this week. \"Look, I'm not interested in tearing someone down,\" Ugenti-Rita said. \"She's a qualified individual who has accomplished some really amazing stuff, and I sincerely wish her all the best and only congratulations are going to come from me.\" Not long after the incident, Grisham connected with Trump's nascent presidential campaign in 2015 as he was set to make an early appearance in downtown Phoenix. State Rep. Travis Grantham, R-Gilbert, dealt with Grisham as she helped organizea later Trump event in the hangar of a Mesa business that Grantham owned at the time. When is the next debate?: The next Democratic primary debate is July 30 and 31 in Detroit \"She helped set up the stage, set up the angles, made sure the event ran smoothly,\" Grantham said in an interview from Afghanistan, where he is deployed. \"She did a great job. ... We were very happy with how the event turned out.\" So was Trump. He kept Grisham on the campaign and brought her into the White House after his surprise victory. On the campaign, she helped manage the traveling press corps. In the White House, she was named deputy press secretary before becoming first lady Melania Trump's spokeswoman. Even as Grisham's professional success grew, she grappled with personal problems at home. On Jan. 9, 2013, when she was working for Horne, Gilbert police arrested Grisham on suspicion of driving under the influence and driving faster than reasonable, records show. She planned to go to trial and the matter dragged out for more than a year before she pleaded guilty to misdemeanor reckless driving in August 2014. She spent a night in jail and was placed on two years' probation. The case returned to court twice over Grisham's failure to pay the $779 in fines and her not completing a session with Mothers Against Drunk Driving about the impact of impaired driving. SCOTUS and abortion: Supreme Court refuses to hear Alabama's defense of abortion ban struck down last year Horne said Tuesday he wasn't aware of Grisham's run-in with the law. \"I don’t know about it, but I don’t think it’s really relevant,\" Horne said of Grisham's DUI case. \"She did a fabulous job. She was a great colleague, very friendly, conscientious, great advocate, had a good relationship with the press, and she’ll do a great job.\" On Dec. 5, 2015, months after joining the Trump campaign, Grisham found trouble again. Scottsdale police arrested her that night on suspicion of DUI and driving without her headlights on shortly after midnight. She failed to show in court on Jan. 19, 2016, a day when Trump received the endorsement of former Alaska Gov. Sarah Palin in Ames, Iowa. Her absence in court cost Grisham her driver’s license for a month. Debate winners and losers: The winners and losers from 2 nights of sparring at the Democratic debates in Miami Grisham pleaded guilty to misdemeanor DUI in July 2016, days before her attendance at the Republican National Convention in Cleveland, where Trump officially became the GOP nominee. As part of that case, she had to pay nearly $1,600 in fines and fees, records show. Two weeks after Trump’s victory over Democrat Hillary Clinton, Grisham failed to appear in Scottsdale court again. That was the day Trump convened a meeting with national media figures at Trump Tower in New York to shred them for coverage of his campaign. Grisham finished paying her debt in the case on Jan. 9, 2017, less than two weeks before Trump was sworn into office. She disclosed the DUI arrests to the White House during the transition, according to the Washington Post. Grisham had another debt to settle at that time. In March 2017, Capital One Bank sued Grisham in Maricopa County Superior Court over an unpaid debt totaling about $1,700. Three days later, Melania Trump named Grisham her communications director. Trump and Kim: Trump on possible Korean DMZ meeting with Kim Jong Un: 'We'll see' The debt wasn't settled until April 2018, according to court records. Her co-workers said her work never suffered. Robson recalled Grisham as a professional who worked with the dozens of GOP lawmakers to arrange media interviews, write opinion columns and posts for social media. \"I knew (the arrests) were there, but I didn’t think they inhibited the job,\" he said. \"There are people that work with DUIs in newspaper reporting. It’s unfortunate, but that stuff will happen. Human frailty has to be dealt with.\" Arizona Republic reporter Jeannette Hinkle contributed to this report. Reach Ronald J. Hansen at ronald.hansen@arizonarepublic.com. Reach Yvonne Wingett Sanchez at yvonne.wingett@arizonarepublic.com. Follow them on Twitter @ronaldjhansen and @yvonnewingett.",
      "date": "Published 9:12 a.m. ET June 29, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Lindsey Graham on criticism of Trump: 'I don't remember John McCain having to go through this crap'",
      "url": "https://www.usatoday.com/story/news/politics/2019/07/18/lindsey-graham-john-mccain-trump-contrast/1768382001/",
      "subtitle": "\"Send her back\" chants erupted at a Trump rally as the president criticized Rep. Ilhan Omar for her \"contempt\" for the \"hard-working Americans.\"\n    Storyful",
      "author": "William Cummings",
      "content": " WASHINGTON – When asked about the difference between former Sen. John McCain and President Donald Trump criticism of their political opponents, Sen. Lindsey Graham angrily told reporters, \"I don't remember John McCain having to go through this crap every day.\" Graham made the remark when CNN's Manu Raju asked him how much the Republican Party had changed in light of the \"send her back\" chant that Trump supporters leveled at Rep. Ilhan Omar, D-Minn., at a North Carolina rally on Wednesday. Raju contrasted that with how McCain famously defended his Democratic opponent in the 2008 presidential race, then-Sen. Barack Obama, from a woman at a rally who said she did not trust Obama because he was \"an Arab.\" \"No ma'am,\" McCain said at that Oct. 2008 rally before taking the microphone from the audience member. \"He's a decent, family man, citizen, that I just happen to have disagreements with on fundamental issues.\" Earlier at that rally in Lakeville, Minnesota, another man told McCain, \"We're scared of an Obama presidency.\" \"I want to be president of the United States and obviously I do not want Sen. Obama to be,\" McCain responded. \"But I have to tell you, he is a decent person and a person that you do not have to be scared as president of the United States.\" That response drew boos from some members of the audience. \"I was proud of John,\" Graham said Thursday. \"My differences with President Obama were real but I never doubt that he loved the country.\" The South Carolina Republican was a close friend of McCain, who died in August 2018. \"President Trump would never do that,\" Raju said. \"He took a different tack. He's fighting back,\" Graham said. But he said he didn't remember \"anybody treating John McCain the way they're treating Trump. I don't remember John McCain having to go through this crap every day, all the time.\" \"Something I have learned: If you are a Republican nominee for President – or President – you will be accused of being a racist.,\" Graham tweeted later on Thursday. \"John Lewis compared John McCain’s campaign to being like that of George Wallace. It comes with the territory unfortunately.\" The day after McCain's 2008 rally in Minnesota, Rep. John Lewis. D-Ga., said he was \"deeply disturbed by the negative tone of the McCain-Palin campaign\" and accused them \"sowing the seeds of hate and division,\" comparing it to the \"atmosphere of hate\" created by segregationist Gov. George Wallace. Later the same night. Lewis issued a clarification, which said it was not his intention to \"compare Sen. John McCain or Gov. Sarah Palin to George Wallace.\" \"I am glad that Sen. McCain has taken some steps to correct divisive speech at his rallies,\" Lewis said, apparently in light of McCain's comments the day before. Trump has faced heavy criticism this week following tweets that told four progressive congresswomen of color to \"go back\" to their countries of origin and fix the problems there before \"telling the people of the United States, the greatest and most powerful Nation on earth, how our government is to be run.\" At his rally Wednesday, Trump said Omar, along with Reps. Alexandria Ocasio-Cortez of New York, Ayanna Pressley of Massachusetts and Rashida Tlaib of Michigan, \"hate our country\" and, \"If they don't like it, let them leave.\" All four women are U.S. citizens. When Trump went after Omar – who was born in Somalia – the crowd began to chant, \"send her back. Though Trump did not object to the chanting at the time, on Thursday he told reporters, \"I wasn't happy with that message.\" \"Let me be clear, my beef is with policy, not personality,\" Graham said Thursday when asked about the chants. \"All of these congressmen won their elections. They're American citizens. This is their home as much as mine. \"I believe their policies will change America for the worse, and that's the debate for me.\" Graham also told reporters he did not believe Trump was being racist with his comments, which he compared to the 1960s refrain of \"love it or leave it\" that was often leveled against protesters opposed to the Vietnam War. \"A Somali refugee embracing Trump would not have been asked to go back,\" Graham said. \"If you're a racist you want everybody from Somalia to go back because they're black or they're Muslim.\" Somalia was one of the nations in each version of Trump's controversial travel ban. Before his death, McCain was one Trump's fiercest Republicans critics. In 2016 he told The New Yorker that Trump had \"fired up the crazies.\" \"We have a very extreme element within our Republican Party,\" McCain said. \"Now he galvanized them\" and \"really got them activated.\"",
      "date": "Published 3:55 p.m. ET July 18, 2019 | Updated 5:44 p.m. ET July 18, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Democratic debates don't match the moment. Time to get serious about beating Donald Trump.",
      "url": "https://www.usatoday.com/story/opinion/2019/08/01/donald-trump-president-democratic-debates-must-get-better-column/1868147001/",
      "subtitle": "On the second night of the second Democratic primary debate, Joe Biden was center stage, and took the brunt of challenger attacks. Biden was prepped.\n    USA TODAY",
      "author": "",
      "content": "Democrats have proved they have a big tent. Now it’s time to kick the clowns out. We have now watched four Democratic debates in which the vast majority of the participants have about 1% or less support in the polls. And what have we learned from this? Way too many names. With 10 people on stage answering questions about trillion dollar policies in half-minute blips, the debates resembled AOL chat rooms more than a rhetorical standoff between Lincoln and Douglas. Candidates desperate to creep into the next round of debates seek any way to claw themselves into the discourse and end up debating the moderators, spewing questions that often seem they were posed by the White House press secretary, as much as each other. Let’s take a breath and focus on what we do know. Barring a miracle or a mass kidnapping, the Democratic nominee to take on President Donald Trump will be Joe Biden, Bernie Sanders, Elizabeth Warren, Kamala Harris or Pete Buttigieg — if he holds on to the donors who helped him rake in more than any other candidate, $24.8 million, in the last quarter. Four debates have barely changed that. Biden recognized that Harris almost delivered a TKO to his campaign in the first debate and decided to greet the senator from California on Wednesday with, “Take it easy on me, kid.” It functioned as a variation on Sarah Palin’s “Can I call you Joe?” move that opened the 2008 vice presidential debate. Though it might have come off as smarmy and belittling to some, especially women, it set a tone that Biden would come out swinging, with “P-A-L-OF-O-B-A-M-A” tattooed on his knuckles. The former vice president also fended off telegraphed attacks by Sens. Cory Booker and Kirsten Gillibrand. Booker took on his criminal justice record and Gillibrand his comments from the early 1980s when, as a senator, he said women working outside the home were \"avoiding responsibility.\" Biden's responses were far from impressive. But ties go to the front-runner. Biden is nearly doubling his closest opponent in the polls and seems to have shaken off the “Jeb Bush of 2020” sign that many commentators, including me, tried to pin to his back. Biden’s greatest asset thus far might be not having to be on stage with both Sanders and Warren, whose withering critiques of our political and economic system necessarily indict his four decades at the top of American politics. Beyond those leading the field, there is a second tier of fine candidates who would be front-runners in a normal year, including Booker, Gillibrand, former Housing and Urban Development Secretary Julian Castro, Minnesota Sen. Amy Klobuchar and Washington Gov. Jay Inslee. There are a couple who would be formidable were they running for the Senate, namely former Texas Rep. Beto O’Rourke and former Colorado Gov. John Hickenlooper. And Montana Gov. Steve Bullock deserves some consideration for being the only candidate who has actually won a statewide election in a red state. Detroit Night One: Odd couple: Marianne Williamson, Bernie Sanders were among the Democratic debate standouts The rest of the candidates have so little to lose and such a minuscule chance of winning that they’re wasting all of our time and some of our brain cells. But who can blame a politician for seeking free prime time? The Democratic National Committee is doing its best to avoid the debacles of 2016 —as Republicans nominated a birther known for his ability to bankrupt casinos and Democrats were divided by charges that the party's leadership favored Hillary Clinton and Russian hacks amplified those divisions. But the DNC strategy has crammed all the candidates into two NCAA-like brackets that pit the top seed against small state schools lucky to make the tournament. The result is a mess that makes a mockery of the seriousness of this moment. This is the most consequential primary of our lifetime for too many reasons — the foremost being that Donald Trump is the president of the United States. He has an attorney general who has all but declared that if a Republican president does it, it’s legal. He wants to appoint a man to run our intelligence community who seems to think investigating attacks on our democracy is a bigger threat than the attacks themselves. And then there’s the climate crisis. Inslee has centered his campaign on confronting carbon pollution. As he put it Wednesday night, “I am running for president because the people in this room and the Democrats watching tonight are the last best hope for humanity on this planet.” This is both true and — if you tried to digest all four of these messy debates — terrifying. Ideally, this will be the last Democratic primary for the next eight years, and not because Trump declared martial law and refused to leave office. There is still time to get this right. Time to cull: Winners, losers and who needs to drop out Relegating the also-rans to earlier, separate debates in 2016 might be the only good idea Republicans have come up with in this century. The next Democratic debates are scheduled for Sept. 12 and 13 in Houston. Only Biden, Sanders, Warren, Harris, Buttigieg, O’Rourke and Booker have qualified so far. Let’s hope the DNC sees the wisdom of one debate with just the top contenders from now on. One clown in the White House is plenty. Let’s clear out the center ring and have a real debate. Jason Sattler, a writer based in Ann Arbor, Michigan, is a member of USA TODAY’s Board of Contributors and host of \"The GOTMFV Show\" podcast. Follow him on Twitter: @LOLGOP",
      "date": "Published 12:25 a.m. ET Aug. 1, 2019 | Updated 5:57 p.m. ET Aug. 1, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "'Gut punch': Sarah Palin embarrassed she wasn't invited to John McCain's funeral",
      "url": "https://www.usatoday.com/story/news/politics/2019/04/03/sarah-palin-getting-disinvited-sen-john-mccain-funeral-gut-punch-good-morning-britain/3350531002/",
      "subtitle": "Sarah Palin says being publicly uninvited to her former 2008 running mate, John McCain's funeral was a \"gut punch.\" Veuer's Justin Kircher has more.\n    Buzz60, Buzz60",
      "author": "Alexis Egeland",
      "content": " Sarah Palin called it a \"gut punch\" to be \"publicly disinvited\" to Sen. John McCain's funeral last year. Palin, the former Alaska governor, was McCain's running mate in the 2008 presidential election and was the first woman nominated by the Republican Party to be vice president. In a television interview on \"Good Morning Britain\"on Monday, Palin said she was surprised to find she was on the list of people who had been close with McCain who didn't get an invite to the funeral. \"They didn't have to embarrass me and embarrass others,\" she said. \"And it wasn't just me, it was other good people in our campaign back in 2008 who were very, very loyal to Senator McCain.\" Cindy McCain: Late senator's wife tweets aggressive message she received about husband, Meghan McCain McCain-Trump feud: What's driving the feud? War record, Obamacare among the themes In \"The Restless Wave,\" his final memoir, out in April 2018, McCain, R-Ariz., said he regretted choosing Palin as his running mate. He said he wished he had gone with his friend former Sen. Joseph Lieberman, I-Conn. But in the same book, McCain defended Palin. \"She stumbled in some interviews, and had a few misjudgments in the glare of the ceaseless spotlight and unblinking cameras,\" McCain wrote. \"Those missteps, too, are on me. She didn't put herself on the ticket. I did. I asked her to go through an experience that was wearing me down, that wears every candidate down. I made mistakes and misjudgments, too.\" Palin attributes the ridicule she faced during and after the 2008 race to a poorly run presidential campaign. The GOP ticket lost to Democrats Barack Obama and Joe Biden. \"They were looking for someone to blame for the really crappy type of campaign they ran,\" she said. \"And I was a scapegoat. So that's just in the past, though. Sometimes you win, sometimes you learn, and I certainly learned through that.\" Palin said she and the six-term senator had \"a perfectly fine relationship,\" and their families got along. She said she corresponded with Meghan McCain, McCain's daughter, expressing her condolences about McCain's illness, a deadly form of brain cancer. McCain died Aug. 25. \"I heard it from the media – I didn't hear it from him – that he was disappointed,\" Palin said. While he was alive, McCain was always complimentary of Palin in his public remarks. \"Sarah and I have maintained a very close and warm relationship,\" he told The Arizona Republic in 2014. Follow Alexis Egeland on Twitter @alexis_egeland.",
      "date": "Published 8:29 a.m. ET April 3, 2019 | Updated 12:54 p.m. ET April 3, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Indian troops lock down its only Muslim-majority state, Pakistan warns of war",
      "url": "https://www.usatoday.com/story/news/world/2019/08/06/indian-troops-invade-kashmir-pakistan-warned-war/1939894001/",
      "subtitle": "null",
      "author": "",
      "content": "NEW DELHI – Indian lawmakers passed a bill Tuesday that strips statehood from the Indian-administered portion of Muslim-majority Kashmir, which remains under an indefinite security lockdown, actions that archrival Pakistan warned could lead to war. Prime Minister Narendra Modi’s Hindu nationalist-led government submitted the Jammu and Kashmir Reorganization Bill for a vote by the lower house of Parliament a day after the surprise measure was introduced alongside a presidential order. That order dissolved a constitutional provision, known as Article 370, which gave Kashmiris exclusive hereditary rights and a separate constitution. “After five years, seeing development in J&K (Jammu and Kashmir) under the leadership of PM Modi, people of the valley will understand drawbacks of Article 370,” Indian Home Minister Amit Shah said just before the bill was passed. Kashmir is claimed by both India and Pakistan and divided between them. Two of the three wars the nuclear-armed neighbors have fought since their independence from British rule were over Kashmir. Yemen: Airport closure is 'death sentence' for thousands of sick civilians How the 7 million people in the Kashmir Valley were reacting was unclear, because the Indian government shut off most communication with it, including internet, cellphone and landline networks. Thousands of additional troops were deployed to the already heavily militarized region out of fear the government’s steps could spark unrest. Kashmir is India’s only Muslim-majority state and most people there oppose Indian rule. Indian TV news channels in Srinagar, the main city in India’s portion of Kashmir, showed security personnel including armed soldiers in camouflage standing near barbed wire barricades in the otherwise empty streets. Jammu and Kashmir Director General of Police Dilbagh Singh said Srinagar was “totally peaceful,” the Press Trust of India news agency reported. Hundreds of people around Pakistan and the portion of Kashmir it controls rallied against Modi, burning him in effigy and torching Indian flags to condemn India’s moves. Pakistan Prime Minister Imran Khan said in an address to Parliament on Tuesday night that he feared the Kashmiri people could attack Indian security forces out of anger and New Delhi could blame Pakistan for it. “If India attacks us, we will respond,” Khan said. “We will fight until the last drop of blood.” Back from the dead: Sarah Palin's defamation lawsuit against New York Times In February, a bombing in Indian-controlled Kashmir killed 40 Indian troops. India responded with an airstrike inside Pakistan, blaming a Pakistani group for the attack. The Pakistani military was on high alert Tuesday following reports that New Delhi was continuing to send additional troops to its portion of Kashmir. Pakistan’s top military commanders met in the garrison city of Rawalpindi to discuss the changes in Kashmir. China, which also lays claim to a portion of Kashmir, is “seriously concerned” about the situation, foreign ministry spokeswoman Hua Chunying said. “The relevant sides need to exercise restraint and act prudently. In particular, they should refrain from taking actions that will unilaterally change the status quo and escalate tensions,” she said. The bill passed in India’s Parliament changes Jammu and Kashmir from a state to a union territory with a legislature, and carves out Buddhist-majority Ladakh, a pristine, sparsely populated area that stretches from the Siachen Glacier to the Himalayas, as a separate union territory without a legislature. The lower house approved the bill Tuesday, a day after upper house approved it by a two-thirds majority, with many opposition lawmakers voting with the ruling Hindu-nationalist Bharatiya Janata Party. It was unclear when the security measures would be eased in Kashmir, but an outpouring of condemnation by Kashmiris living outside the region or who were able to access the internet despite the government blocks suggest the population will resist the New Delhi government’s actions. El Paso wasn't the first incident: Walmart wrestles with how to respond to active shooters Ordinary Kashmiris have feared the measures would be a prelude to intensifying an ongoing crackdown against anti-India dissenters. Rebels have been fighting Indian control for decades, and most Kashmiris support the rebels’ demand that all of Kashmir be united under Pakistani rule or become independent. Security lockdowns, general strikes and civilian street demonstrations against Indian control are routine. About 70,000 people have been killed in the rebel uprising and the ensuing Indian crackdown. Contributing: Munir Ahmed, The Associated Press",
      "date": "Published 10:20 p.m. ET Aug. 6, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "'Headline was flawed': New York Times changed headline about Trump speech after backlash",
      "url": "https://www.usatoday.com/story/news/nation/2019/08/05/new-york-times-criticism-donald-trump-speech-headline/1929546001/",
      "subtitle": "President Donald Trump said our nation must condemn racism, bigotry and white supremacy following two mass shootings in Dayton and El Paso.\n    USA TODAY",
      "author": "Jordan Culver and",
      "content": "  A photo of the front page of Tuesday's New York Times sparked immediate criticism on Monday night – including from several 2020 Democratic presidential candidates. The headline read \"Trump urges unity vs. racism.\" It comes after President Donald Trump addressed the nation after mass shootings in Dayton, Ohio, and El Paso, Texas, that killed nine and 22 people, respectively. The headline ran in the Times' first print edition and was changed in subsequent editions, The Times told USA TODAY in a statement Tuesday. The original headline didn't sit well with a number of Democrats. \"Let this front page serve as a reminder of how white supremacy is aided by – and often relies upon – the cowardice of mainstream institutions,\" tweeted Rep. Alexandra Ocasio-Cortez of New York. Defamation suit: Sarah Palin's lawsuit against New York Times back from the dead Start the day smarter: Get USA TODAY's Daily Briefing in your inbox New Jersey Sen. Cory Booker, who told CNN over the weekend that Trump was \"responsible for this,\" said via Twitter: \"Lives literally depend on you doing better, NYT. \"Please do.\" Fellow Democratic presidential candidates Kirsten Gillibrand and Beto O'Rourke – who called the headline \"unbelievable\" – also sounded off on Twitter. Even a New York Times contributor was taken aback by the headline. Op-ed contributing writer Wajahat Ali tweeted: \"I write for the NYT. This is a terrible headline.\" Trump has repeatedly faced criticism for his stance on immigration. He also recently tweeted four Democratic congresswomen should \"go back\" to the \"crime infested places from which they came.\" Trump's tweets were condemned as racist by the U.S. House of Representatives. The Times' headline was changed for the newspaper's next edition, reading \"Assailing hate but not guns.\" Ali tweeted appreciation: \"This one is on point! Thank you!\" \"The original headline was flawed and was changed for all editions of the paper following the first edition,\" Danielle Rhoades Ha, vice president of Communications for The Times, said in an emailed statement Tuesday. \"The headline in question never appeared online, only in the first print edition.\" As a result of the controversy, the hashtag #CancelNYT began trending on Twitter Tuesday afternoon as social media users expressed outrage about the headline. Many demanded the resignation of Times editors while pledging to unsubscribe from the paper and calling for others to do the same. Some have criticized the hashtag, arguing The Times buckled too easily by changing the headline under liberal pressure. Both front pages were shared by New York Times associate masthead editor Tom Jolly on Twitter.",
      "date": "Published 12:10 a.m. ET Aug. 6, 2019 | Updated 1:31 p.m. ET Aug. 6, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "US stocks finish higher Tuesday after a tough start to the week",
      "url": "https://www.usatoday.com/story/money/2019/08/06/futures-up-stock-market-mixed-amid-donald-trump-trade-war-china/1930324001/",
      "subtitle": "President Trump's 'America First' approach has relied on slapping tariffs on countries, such as China and Mexico, which have led to current trade wars. What is a tariff and how do they work? We explain.\n    Just the FAQs, USA TODAY",
      "author": "Janna Herron",
      "content": " Traders on Tuesday brushed off fears of a worsening trade war with China that had sent U.S. stocks spiraling down just a day before. China’s move to stabilize its currency helped to calm jittery investors. The Dow Jones Industrial Average closed up around 312 points, or 1.2%, to nearly 26,030, while the Standard & Poor’s 500 rose 37 points, or 1.3%, to almost 2,882 on Tuesday. The Nasdaq, which suffered the worst blow on Monday, finished 107 points, or 1.4%, higher at 7,833. “Reading the headlines that came out overnight, it seems China wanted to show they really aren’t manipulating their currency,” said Charlie Ripley, senior investment strategist for Allianz Investment Management LLC in Minneapolis. “That eased investors’ minds.” The stage appeared set on Tuesday for further declines after the  Treasury Department declared China a currency manipulator after trading closed on Monday. Stock futures initially dropped around 1.5% Monday evening. $145,000 at a steakhouse? Employee charged with embezzling $5 million from his company Technology stocks, which bore the brunt of Monday’s sell-off, helped drive the market’s broad gains Tuesday. Apple rose 1.3% and Microsoft added 1%. The companies get significant revenue from China and have been highly sensitive to swings in the trade dispute. Communications services companies also notched solid gains. Facebook added 1.5%. Industrials also rose. Aircraft components maker TransDigm jumped 13.7% after raising its profit forecast and delivering solid quarterly earnings. Energy stocks dropped along with the price of crude oil. Materials sector stocks also fell. Man throws away $23K in lifetime savings: Somehow recovers it at a recycling facility The gains on Tuesday were not enough to erase the year’s worst losses from the previous day when the Dow dropped 2.9%, the S&P 500 plunged 3% and the tech-heavy Nasdaq plummeted 3.47%. “The news flow is very fluid,” Ripley said. “The real worry in front of investors is how much further will this trade war escalate.” Investors dumped stocks Monday after a sharp decline in China’s currency ignited fears that the country was retaliating against President Donald Trump’s latest tariff vow. China allowed the yuan to drop to seven per U.S. dollar, an 11-year low and a politically sensitive level, while its central bank blamed the devaluation on \"trade protectionism.” News that the country also planned to halt purchases of all U.S. agricultural goods further fueled the sell-off on Monday. Last week, Trump vowed to enact 10% tariffs on the remaining $300 billion of Chinese imports from Sept. 1. Many of these goods would directly hit American consumers. Back from the dead: Sarah Palin's defamation lawsuit against New York Times A government report suggesting a cooling U.S. job market kept bond yields in check after an early gain. The yield on the 10-year Treasury briefly rose to 1.77%, but then declined to 1.71% when stock markets closed on Tuesday. Contributing: The Associated Press",
      "date": "Published 7:25 a.m. ET Aug. 6, 2019 | Updated 4:38 p.m. ET Aug. 6, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Pregnant celebrities 2019: Who's due, baby bump pics and gender reveals",
      "url": "https://www.usatoday.com/story/life/parenting/2019/09/02/pregnant-expecting-celebrities-whos-due-baby-bump-pics-gender-reveals/2162199001/",
      "subtitle": "null",
      "author": "Rasha Ali,",
      "content": "   What celebrities are expecting new babies? Duchess Meghan and Amy Schumer are off the list, having welcomed sons within hours of each other. But plenty of other stars are expecting their first children this year, including Olympic gymnast Shawn Johnson and actress Shay Mitchell. Then there are the veteran parents. Baby No. 3 is coming for these couples: Blake Lively and Ryan Reynolds, Alanis Morissette and her husband Mario Treadway, as well as Michael Phelps and his wife Nicole. See the remaining parents-to-be or to-be-again who can't wait to meet their newest family members. Much to their surprise, Bode and Morgan Miller announced in August that they are expecting twin boys, who are scheduled to arrive in November. The couple's pregnancy announcement comes just over a year after their daughter, Emeline, died in a tragic drowning accident. The actress surprised fans with the announcement of her pregnancy in June by sharing a photo of her prominent baby bump on Instagram. In a YouTube video, titled \"Guess Who's Preggers,\" Mitchell detailed the lengths she went to hide this pregnancy early on, describing it as a \"really lonely journey.\" Her announcement comes five months after she shared that she experienced a miscarriage. Anne Hathaway announced that she is pregnant with her second child in a social media post where she shared a black and white mirror photo of herself in denim shorts and a long white tee while wearing a prominent accessory — a growing baby bump. Hathaway assured fans that this in fact is a real pregnancy and that she's not wearing a baby bump for any upcoming movie roles. The actress and her husband currently share one child together. The model shared that she and her husband, Justin Ervin, are expecting their first child in a surprise reveal to Instagram. The couple looked like they were angling the camera for a selfie and then panned down to show Graham's baby bump. The singer and actress announced her pregnancy in July on Instagram with a photo of herself hugging French singer Pokora, who is seen holding a sonogram in front of her belly. The musical couple dropped the announcement like they were dropping a joint album. Milian captioned the photo: \"New release 2020! What a blessing.\" The meteorologist and 'Today\" show third hour co-host announced on air that she was expecting her second child with her husband Brian Fichera. Baby number two is expected to arrive in January. The 37-year-old mom revealed in April that she had suffered a miscarriage and was struggling with secondary infertility. She and husband Fichera share 2-year-old Calvin, but were having trouble conceiving again and were planning to try in vitro fertilization, but ended up getting pregnant without it. \"Orange is the New Black\" star shared that she was expecting her first child. She made the announcement to social media when she was 20 weeks pregnant and shared a photo of her smiling, holding a positive pregnancy test. \"So elated to finally share this news with you all,\" she captioned the grinning image, adding on Twitter: \"So happy to announce I’m preggers. 20 weeks in and feeling good!\" The \"U and Me\" singer and her fiancé Alex Fine announced on their respective Instagram accounts that they're expecting a baby girl together. This marks Cassie's first child with Fine, whom she began dating in December 2018 after splitting from her on-again, off-again beau, Sean “Diddy” Combs, earlier that year. Fine and Cassie shared that they got engaged in August. About two years after suffering an emergency abortion, Milla Jovovich shared that she was expecting her third child with director husband Paul W.S. Anderson. \"After I found out I was pregnant 13 weeks ago, I had a mixture of feelings ranging between complete joy and utter terror,\" Jovovich wrote. \"Because of my age and losing the last pregnancy I didn’t want to get attached to this potential baby too quickly.\" The actress said her last few months have been filled with visits to doctors and a \"slew of different test results,\" describing the time as \"living on pins and needles.\" The \"Little People, Big World\" star and his wife Audrey are expecting their second child, a boy! The couple shared the news on Instagram with a gender reveal party. More: 'Little People, Big World's Jeremy Roloff reveals he and wife Audrey are having a boy Meanwhile, brother Zach Roloff and his wife Tori, also from \"Little People, Big World,\" are expecting their second child too, a girl! Thomas Rhett and his family are going through some big \"Life Changes!\" The country singer's wife Lauren Akins shared on Instagram that the couple is expecting their third daughter. \"Excited to share that I will now be paying for 3 weddings😂,” Thomas Rhett joked in his post. The \"19 Kids and Counting\" stars shared the news on Instagram that they are expecting their first child. Sarah Palin's daughter announced on Instagram that she was pregnant with twins. Mom and former Alaska governor Palin commented on her daughter's post with congratulatory emojis and wrote \"ECSTATIC &BLESSEDx2.\" Willow and Bailey married in September 2018. The Backstreet Boy posted that he and his wife were expecting on Instagram with a photo of him holding his wife's belly and a rainbow – likely a nod to their rainbow baby, a term used to describe a child that is born after a miscarriage. Carter had announced that wife Kitt suffered a miscarriage last September. The couple currently shares a son, Odin. \"The Big Bang Theory\" star shared on Instagram that he and his girlfriend were expecting their first child together. The dad-to-be admitted that he would \"kind of prefer a girl,\" but a gender reveal party showed all blue. Blake Lively debuted a baby bump at the premiere of her husband Ryan Reynolds' new movie, \"Detective Pikachu.\" She showed off her newest curve in a yellow gown. This will be baby No. 3 for the power couple, who share daughters, James, 4, and Inez, 2. Shawn Johnson and her husband Andrew East have revealed on social media that they are expecting their first baby. The announcement came more than year after the couple shared in a heartbreaking blog post that they had a miscarriage. More: Shawn Johnson, Andrew East reveal genetic test results after pregnancy complications The \"19 Kids and Counting\" couple announced that they were expecting their sixth child. The country singer is so excited to \"be a daddy\" he shared on Instagram with a sonogram. This will be the first child for Brown and wife Katelyn Jae. The model announced on Instagram that she and boyfriend Alexander Edwards were expecting a baby boy , their first child together. Rose is also mother to 6-year-old Sebastian Taylor Thomaz with rapper Wiz Khalifa. Dan Reynolds told US Weekly that he and his wife, Aja Volkman, are expecting their fourth child. They currently share three girls: Arrow, 6, and twins Coco and Gia, 2. The announcement came just three months after the couple decided to \"rebuild\" their marriage. The fashion designer shared with fans on Instagram that she and husband William Tell are expecting their second baby. Wearing a floral dress, she embraced her baby bump. Their son, Liam James, was born in 2017. The Olympic swimmer announced that this wife, Nicole, is pregnant on Instagram with a sweet photo of his two sons. His boys, Boomer, 2, and Beckett, 1, are seated in a toy green jeep with their helmets on and the word \"Baby\" spelled out in balloons along the front bumper. Alanis Morissette, 44, posted a photo on Instagram showing off her baby bump, while recording music in her home in headphones and a black turtleneck. This will be the third for the singer and her husband and rapper Mario \"Souleye\" Treadway. Morissette gave birth to the couple's daughter Onyx Solace in 2016 after son Ever Imre was born on Christmas Day 2010. The HGTV star, who previously went by Christina El Moussa on \"Flip or Flop,\" and new husband Ant Anstead announced on Instagram that they are expecting a baby due in the fall. El Moussa shares two children, daughter Taylor, 8, and son Brayden, 3, with her ex-husband and \"Flip\" co-star Tarek El Moussa. Ant shares son Archie, 12, and daughter Amelie, 15, with his ex Louise. Contributed: Patrick Ryan, Rasha Ali, Hannah Yasharoff, Sonja Haller, Cydney Henderson READ MORE",
      "date": "Published 7:00 a.m. ET Sept. 2, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sacha Baron Cohen moves on to drama with 'The Spy': 'I am done with the undercover work'",
      "url": "https://www.usatoday.com/story/entertainment/tv/2019/09/05/sacha-baron-cohen-moves-on-i-am-done-undercover-work/2216784001/",
      "subtitle": "From mayors to mutants, your new fall TV and streaming obsessions are right here.\n    USA TODAY",
      "author": "Andrea Mandell",
      "content": " Sacha Baron Cohen is done going undercover. Instead, he’s playing Israel’s most famous spy. “I am done with the undercover work,” Cohen says in an interview this week. The English actor’s character-driven comedies – which often doubled as political satire – spanned films (2006's “Borat,\" 2009's \"Bruno,” 2012's \"The Dictator\") and TV shows (HBO's \"Da Ali G Show,” Showtime's “Who Is America”). But those prankster-driven passion projects, which had Cohen interviewing everyone from Sarah Palin to O.J. Simpson, took a toll on the 47-year-old actor, who has three children with his actress wife, Isla Fisher. ‘It’s incredibly consuming in every aspect,\" he says. \"It’s draining. It can be dangerous. It’s often unrewarding. You’re living a fairly miserable life. Obviously, when you produce good stuff, then it’s rewarding in the end. But the process itself is not fun.” Friday, Cohen ditches his comedy roots for \"The Spy,\" a chilling six-episode Netflix series created by Gideon Raff (“Homeland”). Cohen plays real-life Mossad agent Eli Cohen, who went undercover in Syria in the 1960s as a wealthy businessman who swiftly climbed the political ranks. (Despite sharing a last name, the late spy and the Jewish actor, whose mother was born in Israel, are not related.) Memorable Sacha Baron Cohen moments: From Borat's mankini to the Ryan Seacrest ash-dumping Over six years, the real Mossad agent provided intelligence to Israeli forces that helped stop Syria’s burgeoning nuclear program, ultimately helping Israel prevail in 1967’s Six-Day War. But it also required living apart from his young family, eventually resulting in his capture and public hanging. “I see Eli Cohen as perhaps the greatest character actor of the past century, because he stayed in character for many years. I think he puts Daniel Day-Lewis to shame,” says Cohen, whose family had a copy of a book about him, \"Our Man in Damascus,\" on its bookshelf in London. Cohen took the Netflix role six months after his own father died. Cohen, who has dabbled in dramatic roles including “Les Miserables” and “Hugo,\" says he was not wholly unprepared to play an at-risk spy. Going undercover in his comedic characters, \"if I make a mistake, if there’s a tell, the interview has ended and the subject walks out. And there can be worse repercussions: The rodeo in \"Borat\" or the cage fight in \"Bruno\" – had people seen through it, the results could have been quite violent,\" he says. \"I was never risking my life,  but I could imagine the stakes of an interview or an encounter going wrong. A lot of what I do when I’m in character is I am trying to read the other person … which obviously Eli was doing as well.” In “The Spy,” Cohen builds such a rich double life as a fat-cat Syrian businessman that he struggles when returning to his humble life with wife Nadia in Israel. In his own life, Cohen says, he sheds his characters easily. \"It can be a matter of seconds at the end of the shoot day,\" he says, though playing Bruno, the Austrian fashionista,  gave off a bit of PTSD for months after the 2009 film wrapped. \"Whenever I heard a police siren, I experienced a little bit of anxiousness because I was so used to the police coming to arrest me.\" Cohen remains invested in politics, though he calls \"The Spy\" a story about \"three-dimensional people, rather than (just) enemies and heroes.\" On the Moroccan set, Cohen quizzed cast members, including Arab Muslims, Palestinian Arabs, Israeli Arabs and African Muslims, on whether they felt the script was biased, and he engaged in casual conversations about political solutions in the Middle East. But publicly, Cohen is keeping his cards closer to his chest. Despite the looming 2020 election and his native country agonizing over Brexit, he has no plans to add his voice, comedically or otherwise. “I’m still very frustrated about the news, and there are still things I read that worry me deeply or get me angry,” says Cohen, who will next play activist Abbie Hoffman in Aaron Sorkin’s \"Trial of the Chicago 7.\" \"'Who is America?' was a way to do something personally. I had to make that show to deal with the stress of what was going on with the country at the time. Whenever I do these things, I don’t know if anyone will ever agree with me, or find it remotely interesting or even funny. But they are often projects that I feel compelled to do.\" He pauses. \"We shall see.\"",
      "date": "Published 1:46 p.m. ET Sept. 5, 2019 | Updated 8:42 p.m. ET Sept. 9, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin's daughter Willow is pregnant and she's having twins",
      "url": "https://www.usatoday.com/story/life/allthemoms/2019/05/28/sarah-palins-daughter-willow-pregnant-and-shes-having-twins/1256828001/",
      "subtitle": "Sarah Palin's family is getting a lot bigger. Her 24-year-old daughter announced she is pregnant with twins.\n    USA TODAY",
      "author": "Rasha Ali",
      "content": " Sarah Palin's family is about to get a lot bigger this holiday season. Palin's 24-year-old daughter Willow announced on Monday that she was pregnant with twins. She broke the news to social media with a photo of two baby outfits, a sonogram, and a frame with the words \"and then there were four.\" \"@rickyb901 and I are so excited to welcome TWO little babies into this world!\" Palin captioned the photo and added the hashtag #twins. Mom and former Alaska governor Palin commented on her daughter's post with congratulatory emojis and wrote \"ECSTATIC &BLESSEDx2.\" Palin and Ricky Bailey got married in September 2018, almost a year after getting engaged in December 2017 in New York. \"Good things happen!!!\" her mom wrote on social media during the engagement. \"My happiest baby girl Willow and Ricky, last night at Rockefeller Center!!! So, so happy.\" READ MORE",
      "date": "Published 10:14 a.m. ET May 28, 2019 | Updated 10:43 p.m. ET May 28, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin's defamation lawsuit against New York Times back from the dead",
      "url": "https://www.usatoday.com/story/news/nation/2019/08/06/new-york-times-faces-reinstated-sarah-palin-defamation-lawsuit/1931916001/",
      "subtitle": "Sarah Palin says being publicly uninvited to her former 2008 running mate, John McCain's funeral was a \"gut punch.\" Veuer's Justin Kircher has more.\n    Buzz60, Buzz60",
      "author": "",
      "content": "NEW YORK — An appeals court has revived a defamation lawsuit Sarah Palin brought against The New York Times. The 2nd U.S. Circuit Court of Appeals restored the lawsuit Tuesday, saying Palin must be allowed to collect evidence to support her claims. Still, it said Palin's burden of proof was high to show the Times acted with actual malice when it published an editorial titled \"America's Lethal Politics\" in 2017. The onetime Republican vice presidential nominee sued over the editorial published after a gunman opened fire on Republican lawmakers in Virginia, wounding U.S. Rep. Steve Scalise. The Times' editorial was corrected twice when readers complained it appeared to blame a political action committee belonging to Palin for \"political incitement.\" A Times' spokesperson says the newspaper is disappointed and will vigorously fight the lawsuit. 'Headline was flawed': New York Times changed headline about Trump after backlash",
      "date": "Published 11:17 a.m. ET Aug. 6, 2019 | Updated 11:36 a.m. ET Aug. 6, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "It’s \"he said, Trump said\" in today’s news",
      "url": "https://www.usatoday.com/story/news/2019/09/10/trump-bolton-apple-iphone-11-sarah-palin-aoc-tuesdays-news/2274958001/",
      "subtitle": "null",
      "author": "Ashley Shaffer and",
      "content": "  The new iPhone is here. A \"Most Wanted\" suspect is on the loose. And we wonder who really said what in the White House. It's Ashley and Alex. Here's the news everyone's talking about Tuesday. But first, everything's bigger better in Texas: West University Place, Texas, was named one of the best cities to live in. Did your city make the list? President Donald Trump fired John Bolton as his national security adviser Tuesday, noting that the two \"disagreed strongly\" on many issues. Trump wrote in a tweet, \"I informed John Bolton last night that his services are no longer needed at the White House.\" But Bolton said he offered to resign, contradicting Trump's characterization of his departure. He texted several reporters that he had not been fired, as the president said. Bolton's departure comes amid internal tension at the White House, particularly over negotiations with the Taliban and the president's hopes for a withdrawal of U.S. troops from Afghanistan. Other things he said, they said: Apple unveiled the brand-spanking-new iPhone 11 on Tuesday during its annual event at its headquarters in Cupertino, California. Apple is rolling out three new phone models: a lower-priced iPhone 11, the iPhone 11 Pro and the iPhone 11 Pro Max. Dare I say I want them all? Because I do. All three smartphones will be available for preorder Friday, and you can get your hands on one for $699. Let's talk about this camera situation (look at the image below). The Pro editions will sport a redesigned camera with a third lens that can capture extreme wide-angle shots. Hello, group selfies. But wait! There's more: Apple unveiled new versions of its iPad and Apple Watch. The Wildlife Photographer of the Year competition released a few images from its 2019 contest – and they're incredible. The photo contest, representing plant and animal life from across the globe, is developed annually by the Natural History Museum in London. You really need to see these stunning – and sometimes heartbreaking – images. The gleeful rescue team that pulled four trapped crewmen from a capsized cargo ship off the Georgia coast left behind more than 4,000 cars and one big question: Why did the Golden Ray capsize? There are not many possibilities to explore. One Short List reader got a close-up look at the overturned vessel with her dog, Samuel. \"I was out playing ball, and you can see the cargo ship in the background,\" Denise Rocawich, who lives in Brunswick, Georgia, said. \"Glad to hear that all the crew has gotten out safely.\" As Hurricane Dorian approached the Bahamas, John Slack knew better than to stay in his house. What he didn't know was that despite relocating to a \"safer\" place to ride out the monster storm, it really didn't matter.r. A few snap decisions would result in Slack and four others, including a man with pancreatic cancer, spending the duration of Dorian trapped inside a vehicle for 17 hours. “We just feel blessed to be alive and are so thankful to be here after this life-altering experience,\" Slack said. Alex Connor chipped in on this compilation of stories from across the USA TODAY Network. Want this snappy news roundup in your inbox every night? Sign up for \"The Short List\" newsletter here.",
      "date": "Published 4:45 p.m. ET Sept. 10, 2019 | Updated 9:39 p.m. ET Sept. 10, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Citing 'incompatibility,' Sarah Palin's husband wants divorce, according to reports",
      "url": "https://www.usatoday.com/story/news/politics/2019/09/09/documents-appear-show-sarah-palins-husband-wants-divorce/2268107001/",
      "subtitle": "The court documents use their initials instead of full names: T.M.P against S.L.P, the AP reported.\n    USA TODAY",
      "author": "Savannah Behrmann",
      "content": " WASHINGTON -- It appears Todd Palin, the husband of former Alaska Gov. and 2008 Republican VP nominee Sarah Palin, is filing for divorce, the Associated Press and the Anchorage Daily News reported Monday. The court documents appear to show that Todd Palin asked to dissolve the 31-year-marriage, citing “incompatibility of temperament between the parties such that they find it impossible to live together as husband and wife,” according to the Anchorage Daily News. The documents use their initials instead of full names: T.M.P against S.L.P, respectively, as Todd’s middle name is Mitchell and Sarah’s is Louise, the AP reported. The documents accurately cite the Palins' marriage date as August 29, 1988, and the birthdates for the couple correspond as well, the AP also reported. The documents also list a child under initials T.P.V.P born April 18, 2008, also according to the AP. The youngest Palin child, Trig Paxson Van Palin, was born that day. The rest of the couple's children are over the age of 18. Sarah Palin rose overnight to national prominence when John McCain tapped her to run as his VP in 2008 on the GOP ticket against Barack Obama and Joe Biden. The divorce filing was first reported by Anchorage blogger Craig Medred and the Anchorage Daily News.",
      "date": "Published 4:22 p.m. ET Sept. 9, 2019 | Updated 9:01 p.m. ET Sept. 9, 2019",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    }
  ]
}