{
  "articles": [
    {
      "title": "Gutfeld: Questions I'd ask Bernie Sanders",
      "url": "https://www.foxnews.com/opinion/gutfeld-questions-id-ask-bernie-sanders",
      "subtitle": "Gutfeld: Questions I'd ask Bernie Sanders",
      "author": "Greg Gutfeld",
      "content": " Monday night Fox News hosted a town hall with Bernie Sanders. I wasn't invited.  So I guess I was out of town. But if I had an hour with our leading pre-eminent socialist, here's what I'd ask him: 1. If you had to teach a course on Marxism/Leninism, how would you address the 100 million-plus dead left behind?   What caused it, beyond \"administrative error?\" 2. Socialists bring up small successes in Europe without mentioning that economic growth is miserable compared to the U.S. Why hide that? SANDERS NABS TOP SPOT IN NEW DEMS POLL AS PETE BUTTIGIEG GAINS MOMENTUM 3. You live in the greatest economic system in history. Yet, you see in socialism – a system rejected by nearly every nation that has tried it – as better. Given the previous questions: why? 4. Do you see equality of opportunity and outcome as the same? Should there have been a cap on the book royalties which made you a millionaire? Should you only have one home instead of three? Also, can you give an example of economic inequality that exists after you factor in age, experience and education? Older people tend to have higher incomes and more wealth. You are older and richer than most. Aren't you proof of economic mobility, not inequality? CLICK HERE TO GET THE FOX NEWS APP 5. Since you became a millionaire, you've trained your sights on billionaires. There are 585 of them in the U.S. If we took all their money, would our problems be solved? 6.  It's been said that if you aren't a liberal when you're young you have no heart, but if you aren't a conservative when you're old you have no brain. What’s your excuse? Adapted from Greg Gutfeld’s monologue on “The Five” on April 15, 2019. CLICK HERE FOR MORE FROM GREG GUTFELD",
      "date": "April 15",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Michael Moore endorses Bernie Sanders: 'He isn't afraid to say capitalism is the problem'",
      "url": "https://www.foxnews.com/entertainment/michael-moore-endorses-bernie-sanders",
      "subtitle": "Michael Moore endorses Bernie Sanders: 'He isn't afraid to say capitalism is the problem'",
      "author": "Joseph A. Wulfsohn",
      "content": " Documentary filmmaker Michael Moore endorsed Sen. Bernie Sanders, I-Vt., for president on Friday. He said Sanders isn't \"afraid\" to say that capitalism is the problem. Moore revealed on MSNBC that he will make a formal appearance at a Sanders campaign rally over the weekend. \"Why me for Bernie? Because Bernie understands that capitalism and the greedy form of capitalism, especially that we have now, is at the core of so many of the problems that we're talking about. And he's not afraid to come out and just say that -- that it's the problem,\" Moore said, adding that he thinks Bernie could beat President Trump. MICHAEL MOORE WARNS DEMS 'PROFESSIONAL POLITICIAN' CAN'T BEAT TRUMP: 'I LOVE JOE BIDEN... BUT WE GOTTA WIN' The Oscar-winning filmmaker said he endorsed Sanders \"30 years ago\" when he ran for Congress, adding that the politician's two other major backers at the time were the founders of Ben & Jerry's Ice Cream. Last month, the \"Fahrenheit 9/11\" director suggested that one of Sanders' rivals, Sen. Elizabeth Warren, D-Mass, doesn't believe it when she calls herself a \"capitalist,\" a label she has repeatedly given herself. CLICK HERE TO GET THE FOX NEWS APP",
      "date": "1 day ago",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders’ campaign workers complaining, fleeing over ‘poverty wages’: report",
      "url": "https://www.foxnews.com/politics/bernie-sanders-campaign-workers-complaining-fleeing-over-poverty-wages-report",
      "subtitle": "Bernie Sanders’ campaign workers complaining, fleeing over ‘poverty wages’: report",
      "author": "Dom Calicchio",
      "content": " Presidential candidate Sen. Bernie Sanders has pledged to American workers that he would institute a $15-per-hour minimum wage if he wins the White House in 2020. But unionized workers on Sanders’ own campaign say they wish he would start now -- by paying a higher wage to them. According to a report, members of Sanders’ staff have been using the senator's own campaign rhetoric against him as they try to wrestle more pay from the self-described democratic socialist. BERNIE SANDERS SAYS HIS $40 TRILLION MEDICARE-FOR-ALL PLAN WOULD HELP US SAVE MONEY In a letter to Sanders campaign manager Faiz Shakir, the campaign staffers claim they “cannot be expected to build the largest grassroots organizing program in American history while making poverty wages,” the Washington Post reported. “Given our campaign’s commitment to fighting for a living wage of at least $15.00 an hour,” the letter continues, “we believe it is only fair that the campaign would carry through this commitment to its own field team.” According to the Post, field organizers claim that their long hours working on behalf of Sanders drop their actual pay to about $13 per hour. “Many field staffers are barely managing to survive financially,” the union letter says, “which is severely impacting our team’s productivity and morale. Some field organizers have already left the campaign as a result.” But when contacted by the Post on Thursday, Shakir seemed to paint a different picture. “We know our campaign offers wages and benefits competitive with other campaigns, as is shown by the latest fundraising reports,” Shakir said in a statement, according to the Post. “Every member of the campaign, from the candidate on down, joined this movement in order to defeat Donald Trump and transform America. Bernie Sanders is the most pro-worker and pro-labor candidate running for president.” As for Sanders himself, the Post said it was unclear whether the candidate was aware of the grievances among his campaign staff. The Post report surfaced on the same day that the Democrat-controlled House voted in favor of a bill to gradually raise the federal minimum wage to $15 per hour. The current federal minimum wage is $7.25 per hour, unchanged since 2009. The situation in the Sanders campaign seems a far cry from March, when Sanders’ campaign proudly announced that its employees had chosen to be represented by the United Food and Commercial Workers Local 400. In May, the campaign ratified a union contract with the workers, making it the first presidential campaign in history to do so. At the time, the campaign touted \"unprecedented standards for campaign workers,\" including pay transparency, a defined wage scale, access to mental health care coverage, an anti-discrimination policy that protects immigrant and transgender staff members, and a \"pro-worker grievance and arbitration process.” Meanwhile, President Trump has offered a different perspective on conditions facing U.S. workers. CLICK HERE TO GET THE FOX NEWS APP During a campaign rally in Greenville, N.C., earlier this week, the president said 6 million new jobs had been created in the U.S. since he was elected and the nation’s unemployment rate of 3.7 percent was at its lowest point in decades. Republican leaders have said a minimum wage hike would be “devastating” for middle-class families, citing research from the Congressional Budget Office. The CBO report found that the Democrats’ bill would boost wages for about 17 million people – but it would also reduce business income, raise consumer prices and reduce the nation’s output. Overall, the CBO said the move would reduce real family income by about $9 billion in 2025 – or 0.1 percent. Fox News’ Ronn Blitzer and Fox Business’ Brittany De Lea contributed to this story.",
      "date": "July 19",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Michael Moore joining AOC at Bernie Sanders rally in NYC to announce endorsement",
      "url": "https://www.foxnews.com/politics/director-michael-moore-joining-aoc-at-bernie-sanders-rally-to-announce-endorsement",
      "subtitle": "Michael Moore joining AOC at Bernie Sanders rally in NYC to announce endorsement",
      "author": "Brie Stimson",
      "content": " Liberal filmmaker Michael Moore announced Friday that he will be joining Rep. Alexandria Ocasio-Cortez, D-N.Y., at a rally in New York City on Saturday for 2020 Democratic presidential candidate Sen. Bernie Sanders. “I am joining Alexandria Ocasio-Cortez tomorrow to officially & publicly endorse a true hero of the people, Senator Bernie Sanders, as our next President of the United States!” Moore posted on Twitter on Friday afternoon. “I will speak tomorrow for him at his “Bernie Is Back!” rally at 1pm in Queensbridge Park in NYC. Join us!” Ocasio-Cortez is also expected to formally endorse Sanders for president at the event. Her ally in Congress, Rep. Ilhan Omar, D-Minn., endorsed Sanders earlier this week. MICHAEL MOORE MOCKS ELIZABETH WARREN'S 'ACCOUNTABLE CAPITALISM' PLAN, SAYS 'THERE IS NO SUCH THING' Sanders’ “Bernie is Back” rally in Queensbridge Park, across the East River from Manhattan, will be the senator's first campaign rally since he was sidelined after undergoing a medical procedure following a heart attack Oct. 4. Moore also endorsed Sanders for president in 2016, saying at the time that he first backed Sanders when he was running for Congress in 1990. “I’ve been a supporter of his ever since, and he’s never given me reason to not continue that support,” Moore wrote at the time. Sanders addressed his recent health problems during Tuesday night’s debate in Ohio. “I’m healthy. I’m feeling great,\" he told the audience. \"We are going to be mounting a vigorous campaign all over this country. That is how I think I can reassure the American people.” CLICK HERE TO GET THE FOX NEWS APP The rally will be held near the country’s largest public housing development and a power plant, the Huffington Post reported, and Sanders plans to speak about affordable housing and Ocasio-Cortez's Green New Deal. The rally is meant as a reset after his heart attack and his lagging poll numbers behind surging progressive Sen. Elizabeth Warren, D-Mass.",
      "date": "21 hours ago",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Marc Thiessen: Bernie Sanders runs into socialist reality",
      "url": "https://www.foxnews.com/opinion/marc-thiessen-bernie-sanders-runs-into-socialist-reality",
      "subtitle": "Marc Thiessen: Bernie Sanders runs into socialist reality",
      "author": "Marc Thiessen",
      "content": " Sen. Bernie Sanders, I-Vt., proudly announced this year that his presidential campaign would be the first in history to have a unionized workforce. Well, he just became the first presidential candidate in history to face a labor revolt from his unionized workforce. The Sanders campaign workers union, United Food & Commercial Workers Local 400, complained that field organizers are \"making poverty wages\" and that \"many field staffers are barely managing to survive financially.\" Because field organizers are working 60 hours a week, according to the union, their annual salary of $36,000 works out to $13 an hour -- well below the $15-an-hour federal minimum wage Sanders has called for. BERNIE SANDERS' UNIONIZED 2020 STAFFERS TO RECEIVE PAY RAISE It gets worse. When the Sanders campaign offered to raise salaries to that level, the union rejected the offer. Why? Because \"the raise would have elevated field staff to a pay level responsible for paying more of their own health-care costs.\" It turns out that Sanders pays only 85 percent of health care premiums for campaign staff making more than $36,000 – despite campaigning on a promise of free health care for all with \"no premiums, no deductibles, no co-payments, no out-of-pocket expenses.\" So, what was Sanders's solution? First, he cut the hours of his field staffers from 60 to about 43 a week -- which meant the campaign could say it was paying $15 an hour without actually increasing field organizers' pay. Then on Monday, his campaign finally gave in and agreed to raise salaries to $42,000, preserve full health premium coverage and limit workers' hours to 50 per week. During the dispute, Sanders's campaign defended its policies, declaring: \"We know our campaign offers wages and benefits competitive with other campaigns.\" Well, McDonald's offers wages competitive with other fast-food chains, but that has not been good enough for Sanders. He has marched with McDonald's workers, and attended Walmart shareholder meetings, to demand they be more generous with their workforces. How could he demand those companies provide pay and benefits that he was resisting giving his own employees? Now the union has forced Sanders to capitulate on wages and health care. But why stop there? The Sanders union seems to be suffering from a lack of imagination. If union organizers really want to hold Sanders to his own standards, then a $15 minimum wage and premium-free health care should be only the beginning. Sanders has promised to cover the cost of prescription drugs and make sure \"no one in America pays over $200 a year for the medicine they need.\" He has promised to pay for \"universal childcare and pre-kindergarten.\" He has promised free college, because \"you are not truly free when the vast majority of good-paying jobs require a degree that requires taking out tens or hundreds of thousands of dollars of debt to obtain.\" Sanders has promised to \"free generations of Americans from the outrageous burden of student loans by canceling all existing student debt.\" Is he setting an example by providing all these benefits to workers on his campaign? Of course not. Because if he did, his campaign would quickly run out of cash. Ah, but there's the rub. As former British Prime Minister Margaret Thatcher famously put it, \"the trouble with socialism is that eventually you run out of other people's money.\" A political campaign literally runs on other people's money. It is bare-bones operation, in which staffers choose to work ridiculous hours for low pay, and rely on donations from supporters to get the candidate's message out. In Sanders's case, the majority of his donations come from small donors – ordinary Americans who are sacrificing their hard-earned money to help get him elected, not to fund social welfare for political operatives. CLICK HERE TO GET THE FOX NEWS APP Every dollar his campaign spends on higher pay and free stuff for campaign workers is a dollar not spent on campaign ads in Iowa and New Hampshire. And if his campaign can't get those ads on the air, then Sanders will lose – and his entire team will lose their jobs, their benefits and their chances of a cushy White House job. Then they won't ever get access to the United States Treasury and the chance to really spend other people's money. So, we should all be grateful to the UFCW Local 400 for pulling more Sanders campaign money off the airwaves and into the pockets of Sanders's field workers, while limiting the hours they can work to spread his socialist message. They've done the country a great service. CLICK HERE TO READ MORE BY MARC THIESSEN",
      "date": "July 24",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Ben & Jerry's founder releases Bernie Sanders-inspired flavor: hot cinnamon",
      "url": "https://www.foxnews.com/food-drink/bernie-sanders-ben-jerrys-hot-cinnamon",
      "subtitle": "Ben & Jerry's founder releases Bernie Sanders-inspired flavor: hot cinnamon",
      "author": "Michael Hollan",
      "content": " Joe Biden might be leading in the polls, but there’s one area where he’s definitely losing to Bernie Sanders — ice cream flavors. Ben Cohen, co-founder of Ben & Jerry’s, unveiled a new Bernie-Sanders-inspired flavor of ice cream. While it won’t be an official Ben and Jerry’s flavor, the creamy dessert was created in Ben’s kitchen with the help of Jerry Greenfield (aka Jerry from Ben & Jerry’s). Being released under the “Ben’s Best” banner, Bernie’s Back is a hot cinnamon ice cream with a large chocolate disc on the top and a stiff butter toffee “backbone” running down the middle. Only 40 pints are being made and fans will have to sign up on Sanders’ website for a chance to win one of the limited items. Each pint will be signed by Ben Cohen. According to the website, each aspect of the dish represents part of Sanders’ message. The chocolate disc is a reference to the “wealth that has risen to the top 1%,” while the toffee “backbone” is meant to show Sanders’ “steadfast determination to unrig” the economy. Lastly, the hot cinnamon flavor represents “holding politician’s feet to the fire.” BEN & JERRY'S VOWS TO DEBUT CBD-INFUSED ICE CREAM 'AS SOON AS IT'S LEGALIZED' CLICK HERE TO SIGN UP FOR OUR LIFESTYLE NEWSLETTER Ben Cohen announced the flavor on Twitter, writing, “This is just the first in a full line of Bernie flavors. We’re going all the way this time. And when Bernie’s in the White House and I become the Minister of Ice Cream — a pint in every freezer, a sundae in every bowl.” In another tweet, Cohen compared the cinnamon flavor to an Atomic Fireball. This isn’t the first time Sanders has been turned into an ice cream flavor. In 2016, Ben’s Best released “Bernie’s Yearnings,” which similarly featured a solid chocolate disc at the top. That time, however, fans were treated to mint ice cream once they broke through. CLICK HERE TO GET THE FOX NEWS APP The release of this ice cream might make Bernie Sanders the tastiest candidate in the field.",
      "date": "August 5",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Debra Messing slams Susan Sarandon (again!) over Bernie Sanders support",
      "url": "https://www.foxnews.com/entertainment/debra-messing-susan-sarandon-bernie-sanders-twitter-feud",
      "subtitle": "Debra Messing slams Susan Sarandon (again!) over Bernie Sanders support",
      "author": "Jessica Sager",
      "content": " Debra Messing got roasted on Twitter after slamming Susan Sarandon once again over the Oscar winner's support for Bernie Sanders. On Monday, Messing, 50, tweeted, \"Hey Susan Sarandon, how are you liking the revolution?\" She didn't tag Sarandon, 72, in her tweet, but the \"Thelma & Louise\" star still spotted the dig. DEBRA MESSING DENIES GETTING PLASTIC SURGERY Sarandon replied with a photo advertising BernieSanders.com and wrote, \"Happy so many ideas labeled impossible/radical in 2016 like Medicare 4 All, fighting climate change, $15 min wage & tuition free college are now mainstream & supported by majority. Racial, economic & social injustice must be addressed with systemic change. You’re welcome to join.\" Sanders' supporters and Sarandon fans were quick to blast Messing, including resurfacing a 2017 tweet in which she complained about higher taxes for the wealthy. DEBRA MESSING SAYS 'GOD IS CRYING' OVER ENVIRONMENTAL DAMAGE The \"Will & Grace\" actress has attacked Sarandon repeatedly for not voting for Hillary Clinton in 2016. Sarandon, a longtime supporter of Sanders, said she'd voted for Jill Stein once the Vermont senator was eliminated from the Democratic primary. SUSAN SARANDON THINKS HILLARY CLINTON WOULD HAVE BEEN 'VERY DANGEROUS' AS PRESIDENT In September 2018, Messing slammed “Thelma & Louise” actress Susan Sarandon in a series of tweets, telling her to “shut the f--- up” after Sarandon told Variety in an interview that Trump has “if anything, inspired more women and people of color to run for office.” \"STFU SUSAN,\" Messing tweeted. \"Oh yes, PLEASE let’s give Trump CREDIT. I mean how else are you able to walk out on the street.\" DEBRA MESSING SLAMMED FOR 'SICK' TWEET DIRECTED AT MITCH MCCONNELL, DANA LOESCH Sarandon responded, “Debs, before you get yourself all self-righteous try clicking on the video and listening to what I actually say, not @Variety's clickbait headline, which btw has no quotation marks. That’s a clue...\" DEBRA MESSING CALLS US ARMY 'DISGUSTING' AFTER BORDER WALL FUNDING In a two-minute video, Variety's interviewer asked Sarandon what “grade” she would give President Trump, to which the actress replied: \"I'd tell him to start all over again.\" Without giving Trump a grade, Sarandon went on to give an overview of the political landscape. During her explanation, Sarandon briefly mentioned how more women and people of color are running for office, but did not seem to directly credit Trump. In October 2018, Messing admitted she'd rather share an elevator with Trump than with Sarandon. CLICK HERE TO GET THE FOX NEWS APP According to People, Messing and Sarandon first got into it in 2016 after Sarandon seemed to suggest she would vote for Trump over Clinton during an appearance on MSNBC’s \"All In With Chris Hayes.\" Fox News' Sasha Savitsky contributed to this report.",
      "date": "August 13",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders supporter files labor complaint against Elizabeth Warren’s campaign",
      "url": "https://www.foxnews.com/politics/bernie-sanders-supporter-labor-complaint-elizabeth-warren-campaign",
      "subtitle": "Bernie Sanders supporter files labor complaint against Elizabeth Warren’s campaign",
      "author": "Bradford Betz",
      "content": " A Colorado-based Bernie Sanders supporter has filed a labor complaint against Sen. Elizabeth Warren’s presidential campaign, taking aim at its use of a confidentiality agreement that says keeps staffers from speaking out on workplace conditions. Jason Legg, a tenant-rights attorney -- he has not worked for Warrent's campaign -- filed the challenge on Tuesday. Legg’s complaint said the Warren campaign’s use of a non-disparagement clause, which prohibited employees, interns, and fellows from making “any statement that may impair or adversely affect the goodwill or reputation of the organization,” flew “in the teeth” of the National Labor Relations Act. Legg has denied the complaint was a “politically motivated” move. He’s a supporter of Senator Sanders, I-Vt., but said Warren was his second choice. “I hope people think about the substance of the charge rather than my interest,” he said. BERNIE SANDERS’ CAMPAIGN WORKERS COMPLAINING, FLEEING OVER ‘POVERTY WAGES’: REPORT The National Labor Relations Board will review Legg’s charges and issue a government-backed complaint if it finds them credible, Bloomberg Law reported. Warren’s campaign did not return Fox News' request for comment. CLICK HERE TO GET THE FOX NEWS APP The charge was the second labor complaint against a Democrat’s presidential campaign this cycle. Late last month, a former employee from the Sanders campaign filed a labor complaint, alleging that some employees faced retaliation for involvement in organizing for a collective bargaining agreement.",
      "date": "August 15",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders wants to ban police use of facial recognition",
      "url": "https://www.foxnews.com/tech/bernie-sanders-ban-police-facial-recognition",
      "subtitle": "Bernie Sanders wants to ban police use of facial recognition",
      "author": "Christopher Carbone",
      "content": " Bernie Sanders has called for a complete ban on the police use of facial recognition. The Vermont senator's proposal to \"ban the use of facial recognition software for policing\" is part of his broader criminal justice reform agenda. Facial recognition technology has drawn the ire of lawmakers on both sides of the aisle, some of whom have called for a \"time out\" on its development. However, that seems unlikely, since the technology is already being used in some form or another in dozens of U.S. cities — as this interactive map details. HATE SPEECH ALGORITHMS BIASED AGAINST BLACK PEOPLE, RESEARCHERS FIND The activist group responsible for the map, Fight for the Future, is calling for a total federal ban on the technology. Sanders is the first 2020 presidential candidate to do so. \"The rapid spread of facial recognition surveillance is one of the most urgent threats to our basic freedom and human rights today. Every single 2020 candidate should be calling for a ban on this invasive, biased and dangerous technology,\" said Evan Greer, deputy director of Fight for the Future, in a statement shared with Fox News. Several American cities, including Oakland and San Francisco in California, along with Somverville, Mass., have voted to ban the municipal use of facial recognition technology. Berkeley, Calif. and Cambridge, Mass. are also considering bans on the controversial technology. Sens. Kamala Harris and Cory Booker expressed strong reservations about the technology's potential ability to fuel racial bias in a letter to the Federal Trade Commission last September. WARREN WON'T SUPPORT SANDERS WASHINGTON POST-BIAS CLAIMS \"Banning facial recognition is not a radical idea. It's common sense. Allowing government agencies to build a face-scanning panopticon with no oversight or accountability is reckless and puts people in danger,\" Greer said. Fight for the Future opposes any attempts by Big Tech to get Congress to pass a \"regulatory framework\" for facial recognition because the nonprofit believes that would only bolster the technology's spread in the U.S. CLICK HERE FOR THE FOX NEWS APP",
      "date": "August 19",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders tells crying baby to keep it down",
      "url": "https://www.foxnews.com/politics/sanders-crying-baby",
      "subtitle": "Bernie Sanders tells crying baby to keep it down",
      "author": "Brooke Singman",
      "content": " A squealing baby tested Bernie Sanders' cool during a town hall event on Tuesday in New Hampshire. The Democratic presidential candidate was about to answer a health care question from an audience member when the little one broke out into a shrill cry. BIDEN PLUNGES, TIED WITH WARREN AND SANDERS IN NEW NATIONAL POLL “Thank you very much, because it’s not easy getting up in front of a TV camera to talk about this,” Sen. Sanders, I-Vt., began. “Did I hear you correctly say you have to cut your pills in half?” Then Sanders snapped his head to the right, as the baby started making a racket. “If we could keep that down a little bit?” he said, pointing in the direction of the crying baby. “OK. Thanks.” SANDERS SAYS HE'D BACK US FUNDING FOR THIRD WORLD ABORTIONS, BIRTH CONTROL, AS PART OF CLIMATE PLAN The Trump campaign zinged Sanders Wednesday after the awkward moment. CLICK HERE TO GET THE FOX NEWS APP “Sanders not feeling the Bern for kids in the audience yesterday…” a Trump campaign official tweeted.",
      "date": "September 5",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders’ Iowa political director has left campaign, reports say",
      "url": "https://www.foxnews.com/politics/bernie-sanders-iowa-political-director-has-left-campaign-reports-say",
      "subtitle": "Bernie Sanders’ Iowa political director has left campaign, reports say",
      "author": "Dom Calicchio",
      "content": " Just days after a shakeup in the New Hampshire leadership of Sen. Bernie Sanders’ 2020 presidential campaign comes word that the candidate’s Iowa political director has departed as well. According to reports, a Sanders aide on Wednesday confirmed that Jess Mazour, who was named Sanders’ Iowa director in March, was let go from the campaign in recent weeks. The aide confirmed the departure on condition of anonymity because the aide wasn’t authorized to discuss personnel matters, The Associated Press reported. SANDERS SHAKES UP CAMPAIGN LEADERSHIP IN NEW HAMPSHIRE Prior to joining the sanders campaign, Mazour was an organizer for the progressive group Iowa Citizens for Community Improvement. The Washington Post was first to report that she had left the campaign. On Sunday, the Sanders campaign announced changes to its New Hampshire leadership after backers of the campaign expressed concern that the independent U.S. senator from neighboring Vermont could lose the first-in-the-nation New Hampshire primary early next year. The campaign announced that Shannon Jackson, who ran Sanders’ Senate reelection campaign in Vermont in 2018, would take over New Hampshire leadersip duties from Joe Caiazzo, who was transferred to Sanders’ operation in Massachusetts, according to the Washington Times. The Caiazzo-Jackson switch came one day after the Sanders campaign parted ways with senior New Hampshire adviser Kurt Ehrenberg. The changes in the Sanders campaign coincide with the loss of a key endorsement for Sanders to rival 2020 progressive candidate Sen. Elizabeth Warren, D-Mass., who this week attracted the backing of the Working Families Party -- a group that had supported Sanders in 2016. “Seeing the campaign not be able to outshine Warren with WFP progressives doesn’t have me questioning WFP’s process,” Rafael Shimunov, a 2016 Sanders volunteer and past national creative director for WFP told Politico. “It has me questioning where the Bernie campaign could have done better, because I want to make sure the strongest candidate unmasks Biden and unseats Trump.” CLICK HERE TO GET THE FOX NEWS APP A Fox News Poll released Wednesday shows that Warren has pulled virtually even with Sanders in second place behind former Vice President Joe Biden, with Sanders attracting support from 18 percent of respondents, Warren 16 percent, and Biden leading with 29 percent. Fox News’ Paul Steinhauser and The Associated Press contributed to this report.",
      "date": "September 18",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders wants to ban advertising during presidential primary debates",
      "url": "https://www.foxnews.com/politics/bernie-sanders-wants-to-ban-advertising-during-presidential-primary-debates",
      "subtitle": "Bernie Sanders wants to ban advertising during presidential primary debates",
      "author": "",
      "content": "Democratic presidential candidate Bernie Sanders says he wants to ban advertising during presidential primary debates. Sanders, a self-identified Democratic socialist, tweeted Tuesday that the relationship between media organizations hosting such debates and their corporate advertisers, which may prefer one candidate over another, is untenable. \"Private media outlets charge outrageous sums to run ads during presidential primary debates like tonight's — and many of their advertisers have vested interest in who is elected,\" he said. \"This type of influence must end. We're going to ban advertising during presidential primary debates.\" BERNIE SANDERS CAMPAIGN VIDEO CREATOR HIRED, FIRED WITHIN 24 HOURS OVER CONTROVERSIAL YOUTUBE COMEDY Tuesday's debate is co-hosted by The New York Times and CNN. For the two primary debates it broadcast in July, CNN required companies to commit to at least $300,000 worth of advertising on the network in order to have a spot appear during a debate, according to Variety. The price for one 30-second ad in a CNN debate was $110,000, Variety reported, which is approximately 11 times higher than an average spot in its primetime programming. CLICK HERE TO GET THE FOX NEWS APP Sanders regularly directs his ire against the rich and corporations as he pushes policies that aim to redistribute wealth from the rich to poor and middle-class Americans through high tax rates on higher earners and expansive entitlements such as so-called \"Medicare-for-all.\"",
      "date": "4 days ago",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Ocasio-Cortez, Omar, Tlaib to endorse Bernie Sanders",
      "url": "https://www.foxnews.com/politics/ocasio-cortez-omar-tlaib-reportedly-will-endorse-bernie-sanders",
      "subtitle": "Ocasio-Cortez, Omar, Tlaib to endorse Bernie Sanders",
      "author": "Dom Calicchio",
      "content": " Three members of the so-called “Squad” of far-left freshman members of Congress are lining up behind Sen. Bernie Sanders for president. Fox News has learned that Rep. Alexandria Ocasio-Cortez, D-N.Y., will appear with Sanders on Saturday in Queens, N.Y., at a “Bernie’s Back” rally designed to generate excitement for the senator’s campaign following his recent heart procedure. Rep. Ihan Omar, D-Minn., will also endorse the candidate, Fox News confirmed. SANDERS PROMISES NEW JOBS FOR 'TENS OF MILLIONS OF AMERICANS' DURING DEMOCRATIC DEBATE In addition, CNN reported that Rep. Rashida Tlaib, D-Mich., will endorse Sanders as well. It was not immediately clear if Omar and Tlaib will appear at Saturday's event. \"Bernie is leading a working class movement to defeat Donald Trump that transcends generation, ethnicity and geography,\" Omar was quoted as saying in a statement posted on Twitter by the Sanders campaign — and that Omar retweeted on her own Twitter page. \"I believe Bernie Sanders is the best candidate to take on Donald Trump in 2020,\" Omar added. The endorsements would be a significant blow to the campaign of Sen. Elizabeth Warren, who, like Sanders, has been representing the party’s progressive wing. Word of the endorsements also followed Tuesday night’s Democratic debate in Ohio, where Warren was under attack from multiple candidates after rising in the polls in recent weeks. CLICK HERE TO GET THE FOX NEWS APP Winning the OK of the “Squad” members was also viewed as crucial in attracting young voters, as the top three Democrats in the polls are all senior citizens — Sanders is 78, former Vice President Joe Biden is 76 and Warren is 70 years old. There was no indication that the fourth member of the Squad, Rep. Ayannna Pressley, D-Mass., was ready to make an endorsement — either of Sanders or any other candidate. ​​​​​​​Fox News’ Paul Steinhauser and Andrew Craft contributed to this report.",
      "date": "3 days ago",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Biden dismissive of Ocasio-Cortez’s expected endorsement of Bernie Sanders",
      "url": "https://www.foxnews.com/politics/biden-dismissive-of-ocasio-cortezs-expected-endorsement-of-bernie-sanders",
      "subtitle": "Biden dismissive of Ocasio-Cortez’s expected endorsement of Bernie Sanders",
      "author": "Ronn Blitzer",
      "content": "  Former Vice President Joe Biden appeared to shrug off Rep. Alexandria Ocasio-Cortez, D-N.Y., on Wednesday in light of the freshman congresswoman's expected endorsement of Biden's 2020 rival, Sen. Bernie Sanders, I-Vt., in the presidential race. When asked about his plan to convince voters in light of the left-wing Democrat's support of Sanders, Biden smiled broadly and gave a dismissive response. TOMI LAHREN: AOC SHOULD WORRY ABOUT HER OWN REELECTION, NOT ENDORSING BERNIE \"That's how I do it,\" Biden said with a chuckle, while campaigning the day after the debate in Ohio. Ocasio-Cortez is one of three members of the so-called \"Squad\" of far-left first-year representatives who are throwing their support behind the Vermont democratic socialist. Rep. Ilhan Omar, D-Minn., is backing Sanders, tweeting a statement that Sanders is \"fighting for the soul of our democracy,\" along with a video explaining her endorsement. She touted Sanders' campaign promises, including his vow to cancel student debts. In addition, CNN reported that Rep. Rashida Tlaib, D-Mich., will endorse Sanders as well. CLICK HERE TO GET THE FOX NEWS APP Ocasio-Cortez is expected to join Sanders at a campaign event Saturday in Queens, N.Y. The rally is called \"Bernie's Back,\" and is meant to spark renewed enthusiasm for the Sanders campaign following his recent heart attack. So far, there is no indication as to whether the fourth \"Squad\" member, Rep. Ayanna Pressley, D-Mass., is endorsing any candidate. Fox News' Dom Calicchio contributed to this report.",
      "date": "3 days ago",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders slams Elizabeth Warren as ‘capitalist’",
      "url": "https://www.foxnews.com/politics/dividing-lines-bernie-sanders-slams-elizabeth-warren-as-capitalist",
      "subtitle": "Bernie Sanders slams Elizabeth Warren as ‘capitalist’",
      "author": "Alex Pappas",
      "content": " Vermont Sen. Bernie Sanders – the self-proclaimed Democratic socialist whose standing in the 2020 primary has become threatened by Massachusetts Sen. Elizabeth Warren’s surge in the Democratic primary with progressive voters – is seeking to cut into the support of his rival by dismissing her as a “capitalist.” “There are differences between Elizabeth and myself,” Sanders said during an interview Sunday on ABC’s “This Week.” “Elizabeth I think, as you know, has said that she is a capitalist through her bones. I’m not.” BILLIONAIRES COULD FACE UP TO 97.5 PERCENT TAX RATES UNDER SANDERS’ PLAN: ECONOMISTS The comments come amid a rise in socialism in the Democratic Party, as candidates become more willing to openly embrace socialism over capitalism. It also follows polling showing that Democrats now view socialism more positively than they do capitalism. Last year, when asked if she was a capitalist, Warren reportedly said, \"I am a capitalist to my bones.\" Sanders explained he is not a capitalist because he \"will not tolerate for one second the kind of greed and corruption and income and wealth inequality and so much suffering that is going on in this country today, which is unnecessary.” A Gallup poll this year found that 43 percent of Americans think socialism would be a good thing for the United States, while 51 percent say it would be a bad thing. Gallup noted that in 1942, a Roper/Fortune survey that found 40 percent of Americans described socialism as a bad thing while only 25 percent called it a good thing. The polling is fresh evidence that attitudes toward socialism are changing, amid the popularity in the Democratic Party of Democratic socialists like Sanders and New York Rep. Alexandria Ocasio-Cortez, who pushes policies like “Medicare-for-all” and the Green New Deal. Meanwhile, two economists at the University of California, Berkeley, claim that billionaires could face a 97.5 percent average effective tax rate under Sanders' plan, which would easily thump other Democrats running for president in 2020. Emmanuel Saez, one of the professors, told Bloomberg that “with the wealth tax, you get directly at the stock instead of hitting the flow of income, making it a much more powerful de-concentration tool than income taxes.\" The report pointed out that Sanders has said that the number of billionaires in the U.S. would be cut in half within 15 years under the plan. The plan unveiled by Sanders seeks a 1 percent levy on households worth more than $32 million and proposes tax rates that would increase for wealthier people, up to 8 percent for fortunes in excess of $10 billion. Sanders vowed to go further than Warren and generate more than $4 trillion over the next decade, substantially reducing billionaires’ fortunes. Billionaires would face a 62 percent average effective tax rate under Warren. Sanders’ plan goes further because it starts on fortunes worth less, kicking in at $32 million. Warren also proposes increasing the wealth tax up to 3 percent on any net worth of more than $1 billion, while Sanders’ tax rates don’t top out until 8 percent for the richest households. CLICK HERE TO GET THE FOX NEWS APP The Massachusetts senator has topped Sanders in recent polls of Democrats in Iowa and New Hampshire that show her running about even with the longtime front-runner, former Vice President Joe Biden, in those states. Fox News' Edmund DeMarche and the Associated Press contributed to this report.",
      "date": "5 days ago",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Sen. Bernie Sanders: We need an economy and government that works for all, not just the 1 percent",
      "url": "https://www.foxnews.com/opinion/sen-bernie-sanders-we-need-an-economy-and-government-that-works-for-all-not-just-the-one-percent",
      "subtitle": "Sen. Bernie Sanders: We need an economy and government that works for all, not just the 1 percent",
      "author": "Sen. Bernie Sanders",
      "content": " Editor’s Note: Fox News Channel will televise a town hall with Vermont senator and presidential candidate Bernie Sanders from 6:30 to 7:30 p.m. EDT on Monday, April 15.  “Special Report” anchor Bret Baier and “The Story” anchor Martha MacCallum will question Sen. Sanders and take audience questions in the live broadcast from Bethlehem, Pennsylvania. In America today, we have more wealth and income inequality than any other major country on Earth and it is worse now than at any other time since the 1920s. Unbelievably, while millions of American workers are forced to work two or three jobs to pay the bills and over half of our people live paycheck to paycheck, the three wealthiest families in our country now own more wealth than the bottom half of Americans – 160 million people. BERNIE SANDERS HITS THE CAMPAIGN TRAIL, REACHING OUT TO WORKING CLASS VOTERS Today, while hundreds of thousands of bright young people cannot afford to go to college and millions are struggling with high levels of student debt, the top 1 percent owns more wealth than the bottom 92 percent. Today, while CEOs of major corporations make over 300 times what their average workers earn, thousands of veterans sleep out on the street and 20 percent of senior citizens are trying to survive on a paltry $13,500 income or less. For 40 years, under Democratic and Republican administrations, we have seen a massive redistribution of wealth and income from the working class of this country to the top one percent.  In fact, if the distribution of income remained what it was 40 years ago the average household in America would have about $11,000 more in income today. Do you want to know why the American people are angry? Today, despite an explosion in technology and worker productivity, the average worker has seen his/her income go up by just 5 cents an hour over the last 43 years after adjusting for inflation. And, if we don’t turn the economy around, economists predict that the younger generation will have an even a lower standard of living than their parents. This is not acceptable to me.  We need an economy that expands the middle class and reduces poverty and not one that makes the very rich much richer. When Donald Trump ran for president he made a lot of promises to working families.  He told them that he would protect their interests while standing up to the Establishment.  Unfortunately, he did not tell the truth. During his campaign, Trump said he would provide \"health insurance for everybody,” but as president he has pushed to repeal the Affordable Care Act and throw 32 million Americans off of the health insurance they have.  His efforts would also end the protections that are currently in existence for pre-existing conditions and end the ability of people under 26 to stay on their parents’ insurance plans.  Meanwhile, while 34 million Americans currently have no health insurance and even more are under-insured with high deductibles and co-payments, a handful of health care CEOs paid themselves more than $1 billion last year. In my view, at a time when we spend almost twice as much per capita on health care as do the people of any other nation, we should not be throwing millions of Americans off of health care they have.  Quite the contrary!  We should join every other major country on earth and guarantee health care to all people as a right through a Medicare for All, single-payer program.  Medicare today is a popular and effective health insurance program for seniors.  Over a 4-year period it should be expanded and improved to cover every man, woman and child in the country.  And when we do that we significantly reduce the cost of health care for the average American family. During his campaign, Trump said that he would stop the pharmaceutical companies from “getting away with murder.” Well, that didn’t happen.  They’re making more money than ever.  During the first half of last year there were 96 drug price increases for every price cut.  Today, in the United States, we pay by far the highest prices in the world for prescription drugs, while the top ten pharmaceutical companies made $69 billion in profits last year alone. Shockingly, one out of five Americans cannot afford to purchase the prescription drugs their doctors prescribe.  That is insane. As president, I will implement legislation I have introduced which would lower prescription drug prices by 50 percent so Americans no longer pay any more for their medicine than the people of other countries. During his campaign, Trump promised he would not cut Medicare, Medicaid and Social Security.  But the budget he proposed in March would cut $1.5 trillion from Medicaid, $845 billion from Medicare, and $25 billion from Social Security.  As president, at a time when so many seniors and people with disabilities are struggling, I will not cut Social Security.  In fact, legislation that I have introduced would expand Social Security benefits while extending its solvency for over 50 years. During his campaign, Trump promised that “the rich will not be gaining at all” under his tax plan. But the reality is that the plan that he helped pass provides 83 percent of the benefits to the top one percent by the end of the decade. Further, as a result of his tax plan, major profitable corporations like Amazon, General Motors, Chevron, IBM and Eli Lilly and dozens of other major corporations paid zero in federal income taxes after making billions in profits.  That is a regressive and unfair tax system that must not be allowed to continue. At a time when the very rich are getting much richer and when corporations are enjoying record-breaking profits, I believe that the wealthiest people in this country have got to start paying their fair share of taxes and that we must end the tax havens that exist in places like the Cayman Islands where corporations and the rich stash trillions of dollars to avoid paying their taxes. During his campaign, Trump promised that he would substantially reduce the trade deficit, prevent the outsourcing of American jobs and protect good-paying jobs here at home. However, since Trump has been president the trade deficit in goods has hit a record high of $891 billion and his own Labor Department says that 185,000 American jobs have been shipped overseas under his watch. He has also expanded the tax cut that rewards companies for replacing American workers with robots; created new tax incentives for his corporate allies to shift jobs overseas; and given out $50 billion in government contracts to companies that are offshoring jobs. We are living in a pivotal moment in American history.  Our goal must be to create good-paying jobs by rebuilding our crumbling infrastructure, not give huge tax breaks to people who don’t need them.  Our job must be to invest in public education and combat climate change, not spend trillions on never ending wars. CLICK HERE TO GET THE FOX NEWS APP Our job must be to bring all Americans together – black, white, Latino, Native American, Asian American, gay and straight, native born and immigrant – and not allow ourselves to be divided up. Together, we can and must create an economy and government that works for all Americans and not just the 1 percent.",
      "date": "April 14",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    }
  ]
}