{
  "articles": [
    {
      "title": "Betsy DeVos takes steps to de-weaponize campus sexual assault policy Obama got wrong",
      "url": "https://www.foxnews.com/opinion/betsy-devos-takes-steps-to-de-weaponize-campus-sexual-assault-policy-obama-got-wrong",
      "subtitle": "Betsy DeVos takes steps to de-weaponize campus sexual assault policy Obama got wrong",
      "author": "Steve Kurtz",
      "content": " Outside, protesters screamed “Stop protecting rapists!”  Not the usual scene at a speech by the Secretary of Education. But Betsy DeVos isn’t just any Education Secretary.  And her speech on Thursday at George Mason University’s Antonin Scalia Law School wasn’t just any speech. Because DeVos was saying President Obama got it wrong, and it’s time to change how sexual assault is dealt with on campus.   “Instead of working with schools” as she put it, “the prior administration weaponized the Office for Civil Rights.” Critics claim she’ll be turning her back on rape victims if she overturns the system now in place.  But in reality, what she’d be doing is setting it right. On April 4, 2011, the Department of Education’s Office for Civil Rights sent a “Dear Colleague” letter to campuses setting up new requirements for sexual assault policy.  From now on, the standard of evidence for campus tribunals would be the lowest possible—a “preponderance of the evidence.” This was a unilateral move on the part of the Obama administration, not backed by any legislation recently passed by Congress, but based on their new interpretation of decades-old Title IX, which forbids sexual discrimination in education. The Dear Colleague letter was a “significant guidance document,” and did not have the force of law. But it couldn’t be ignored—any college that defied the administration could find its funding cut. What followed, under the Department of Education guidelines, was a lack of due process norms that are the foundation of our legal system. At various campuses, the accused were not allowed legal representation, had no right to see the evidence against them, had no right to introduce certain exculpatory evidence, had no power to cross-examine witnesses, had no protection against self-incrimination. And all the while these cases were often being tried by people with little expertise in the area, though some were activists with strong political views on the matter.  Sexual crimes are tricky enough for the regular court system to handle—colleges seemed overwhelmed with the task. Many of the accused were found responsible—though they didn’t feel they got a fair chance to defend themselves—and were expelled, a black mark against them in any future endeavor.  Numerous students accused of sexual assault have sued their colleges. Schools have paid out millions in settlements, and in some cases were forced to reinstate expelled students. It’s results like these that helped convince DeVos of the need for change.  But that didn’t stop those who defend the present regime from claiming DeVos is on the side of rape deniers. However, the Secretary of Education is simply trying to establish a proper balance. In recent months, she’s met with both victims of assault, and with the wrongly accused, stating “All their stories are important.” And in her speech, she made it clear both sides must be listened to.  “Every survivor of sexual misconduct must be taken seriously.  Every student accused of sexual misconduct must know that guilt is not predetermined. These are non-negotiable principles.” There’s no simple way to deal with the complex issue of sexual assault on campus, but any solution should look at the problem honestly and impartially, without putting a thumb on the scales of justice.  Reform will be tricky, but the speech DeVos just gave is a good first step.",
      "date": "September 7, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Harvard students protest Betsy DeVos speech, hold sign calling her 'white supremacist'",
      "url": "https://www.foxnews.com/politics/harvard-students-protest-betsy-devos-speech-hold-sign-calling-her-white-supremacist",
      "subtitle": "Harvard students protest Betsy DeVos speech, hold sign calling her 'white supremacist'",
      "author": "",
      "content": "Harvard University students staged a protest as Education Secretary Betsy DeVos delivered a speech Thursday on school choice. Some held up fists. One held up a sign reading in red ink: ‘White supremacist.” Others called for protections for victims of campus sexual assault. DeVos last week revoked Obama administration guidance that instructed colleges on how to investigate sexual assault cases on college campuses. DeVos said policy was skewed against those accused of assault and had “weaponized” the Education Department to “work against schools and against students.” DeVos did not stop her speech to address the protesters but later took some questions from the audience. The Associated Press reported the protest was mostly silent, though some students snapped their fingers or cheered in support of some questions. HHS SECRETARY TOM PRICE RESIGNS OVER PRIVATE PLANE TRIPS Asked about protections for transgender students, DeVos said she is committed to making sure all students are safe. Earlier this year, she rescinded guidance that allowed transgender students to use bathrooms that matched their gender identity. \"With respect to any student that feels unsafe or discriminated against in their school, that is the last thing we want and the Office for Civil Rights at the Department of Education continues to hear and work with the schools that have any of those issues to deal with,\" DeVos said. \"And we are committed to doing that on behalf of the students.\" DeVos said she wanted new rules on campus sexual assault to be fair to both the victims and the accused. She was asked by a student how much her net worth was expected to increase due to school choice. Devos responded: \"I have written lots of checks to support giving parents and kids options to choose a school of their choice. The balance on my income has gone very much the other way and will continue to do so.\" School choice referred to efforts that give students options other than their local public schools, such as charter or private schools. Charter schools were funded by public money but usually operated by entities that were independent of school districts. DeVos was a supporter of school choice efforts in Michigan before becoming President Trump’s education chief. Before she spoke, she announced $253 million in grants to expand charter schools across the country. The awards went to nine states, two state agencies and over 20 nonprofit charter management organizations. The grants were awarded as part of the Every Student Succeeds Act. TILLERSON IN CHINA TO TALK ABOUT NORTH KOREA, TRADE Tony DelaRosa, 27, a student at Harvard's Graduate School of Education, held a sign reading \"Our Students Are Not 4 Sale.\" \"We need public schools not to lose our funding and be given to charter schools,\" DelaRosa told the AP. \"Administering more charters anywhere, it's going to take funding from somewhere.\" Samantha White, a 19-year-old neurobiology major, said she came to the speech to ask DeVos why she rescinded the guidance on campus sexual assault. \"I am very upset and angry about it,\" White said. \"Sexual assault is such a huge problem on college campus already and if you are rolling this back, it makes survivors of sexual assault more vulnerable and it's more difficult for them to seek justice when there aren't these regulations.\" The Associated Press contributed to this report.",
      "date": "September 30, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Here's why Betsy DeVos will be a great Education Secretary",
      "url": "https://www.foxnews.com/opinion/heres-why-betsy-devos-will-be-a-great-education-secretary",
      "subtitle": "Here's why Betsy DeVos will be a great Education Secretary",
      "author": "Michael J. Petrilli",
      "content": " The major charge against Betsy DeVos—and certainly the one that the writers at \"Saturday Night Live\" recently ran with—was that she doesn’t know enough about “school” to be Secretary of Education. She hasn’t been a teacher, a principal, or a superintendent. She doesn’t know how to pick a curriculum, evaluate an instructor, or write an Individual Education Plan for students with disabilities. All true. And if she were seeking employment as a teacher, a principal, or a superintendent, that experience gap would be damning. But she’s not. President Trump selected her to be the U.S. Secretary of Education. That person’s job is to do education politics and policy—to work with members of Congress and governors, to understand how a bill becomes a law, to provide moral support to reformers as they fight it out in the states and at the local level. With her decades of involvement in politics, with policy makers and in the trenches of the parental choice movement, DeVos is an inspired choice for the job that the Senate confirmed her for today. Which isn’t to say the millions of teachers and parents who flooded social media and the Congressional switchboard to urge her rejection had nothing to worry about. Especially during the Bush 43 and Obama years, the Secretary of Education has occupied a powerful role, one that has sought to influence almost every nook and cranny of education policy and practice. Particularly under Obama’s education secretaries, the feds did indeed stick their noses into curriculum, teacher evaluation, and the intricacies of serving students with disabilities, as well as who can use which restroom. Anyone assuming that the future would be a linear extension of that past might have reason to fret about DeVos. Well, the big change that’s coming isn’t the change of individuals. It’s the change in the Education Department’s role. It’s not that DeVos and her team will play the Obama-era melody in a different key. It’s that they won’t being playing those tunes at all. During her confirmation process, DeVos promised time and again to shrink Uncle Sam’s impact on the nation’s schools—to devolve decisions back to states, communities, educators and parents. That’s in keeping with the mandate from Congress, which just over a year ago updated the major K-12 law to expressly limit the federal role in education. The grassroots energy around the DeVos confirmation fight demonstrates that Americans care deeply about their schools. That’s good news. The even better news is that parents and teachers can now focus that energy on changing policies closer to home, where the action is, rather than in Washington, D.C. And the U.S. Department of Education can go back to being the sleepy agency it was always meant to be.",
      "date": "February 7, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "",
      "url": "",
      "subtitle": "",
      "author": "",
      "content": "   ",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Betsy DeVos booed during graduation address in Florida",
      "url": "https://www.foxnews.com/us/betsy-devos-booed-during-graduation-address-in-florida",
      "subtitle": "Betsy DeVos booed during graduation address in Florida",
      "author": "Phil Keating",
      "content": " DAYTONA BEACH, Fla. – Boos, catcalls and the turning of backs welcomed the commencement speaker at Wednesday’s Bethune-Cookman University graduation ceremony. For 20 minutes, Secretary of Education Betsy DeVos, President Trump’s most opposed cabinet secretary nominee during confirmation hearings, endured jeers from the graduates and interruptions from the university president to calm down the crowd. At one point, President Edison Jackson even threatened to “send your diplomas in the mail” if the noise didn’t stop. DEVOS DELIVERING COMMENCEMENT SPEED DESPITE UNREST For most of her speech, and during her receipt of an honorary degree in Human Letters, the students continued the past 10 days of contention that, of all people, she won the invite for the keynote address. In her speech, DeVos directly addressed the controversy. \"As I said, I'm grateful to be with you today,” said DeVos. \"While we will undoubtedly disagree, let us do so respectfully, and let us hear each other out.\" When the historically black university announced May 1 that DeVos would be the speaker, the local NAACP, National Federation of Teachers and Florida Education Association immediately voiced outrage, arguing she’s an enemy of public education, a champion of school choice, favors using tax dollars to pay for kids to attend religious, private schools and is ignorant about the origins of historically black colleges and universities. MONEY TO PREP POOR KIDS FOR COLLEGE? SORRY, WRONG SIZE TYPE That opinion comes from a statement DeVos released in February, referring to historically black colleges and universities: “HBCUs are real pioneers when it comes to school choice. They are living proof that when more options are provided to students, they are afforded greater access and greater quality.” Many historically black school leaders expressed shock and dismay that DeVos didn’t also mention how segregation, racism and Jim Crow forced the creation of black colleges in the first place, i.e., there was no “choice.” Students, alumni and the NAACP organized an online petition drive calling on DeVos to be disinvited and for Jackson and Board Chairman Joe Petcock to resign. On Wednesday, President Jackson defended the DeVos invitation, saying “It’s important to understand that people will disagree, but that does not mean that you roll over and play dead because you disagree.  This is a good day for us. Can you imagine how many institutions would love to have the secretary of education, the highest educational officer in the land, to be their commencement speaker and hopefully open new doors for this institution?” Jackson added that the Department of Education controls 87 percent of Title IV funding and money is needed at historically black colleges and universities to help students graduate with degrees and impact their communities. Caylin Mason, one of Bethune-Cookman’s 300-plus 2017 graduates, said she was excited about graduation: “Four years..it all paid off.” But when asked about the controversy over DeVos, Mason had two words. “No comment.”",
      "date": "May 10, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "US Education Secretary DeVos applauds SC school improvement",
      "url": "https://www.foxnews.com/us/us-education-secretary-devos-applauds-sc-school-improvement",
      "subtitle": "US Education Secretary DeVos applauds SC school improvement",
      "author": "",
      "content": "TIMMONSVILLE, S.C. – The nation's top education official says she's impressed with developments in what was once one of South Carolina's most underperforming school districts. U.S. Secretary of Education Betsy DeVos spoke Thursday after touring schools in a district that's one of several dozen along Interstate 95 bestowed with the nickname \"Corridor of Shame\" because of their substandard schools. DeVos said she was encouraged to see improvements like a more diverse curriculum that have come since last year, when state Superintendent of Education Molly Spearman declared a state of emergency in Florence School District Four and took over its management. By sharing some services with neighboring districts, state officials say they've saved more than $600,000 in the struggling district's budget. The visit comes amid ongoing debate on how to improve South Carolina's education system.",
      "date": "February 21",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "DeVos on college admissions scandal: We need equal opportunity for students",
      "url": "https://www.foxnews.com/politics/devos-on-college-cheating-scandal-we-need-equal-opportunity-for-students",
      "subtitle": "DeVos on college admissions scandal: We need equal opportunity for students",
      "author": "Victor Garcia",
      "content": " Education Secretary Betsy DeVos says higher education institutions and K-12 schools are \"not fair\" when it comes to giving opportunities to students from different financial backgrounds and that the Trump administration is pushing for “equal opportunity for all students” during comments on the college admissions scandal Wednesday. “This is a matter that all Americans want things to be fair and they’re clearly not,” DeVos said on “The Daily Briefing with Dana Perino.” “This goes to K-12 education as well, and we don’t have the same opportunities for all students in K-12 education, we don’t in higher education and that’s one of the things that this administration is really advocating for. Equal opportunity for all students.” DeVos said students need to be considered by colleges and universities on their merit and that the Education Department was investigating how it factors into the investigation. “We are still researching and looking into how the department might interface with this. Obviously this is a Department of Justice operation but we are looking very closely at it and we’ll see if any of the regulations we’re responsible for have been broken,” DeVos told Perino when asked if there was anything her department could do to assure the system wasn’t rigged in favor of the wealthy. The scam was allegedly masterminded by William Rick Singer of California, who helped parents get their children admitted to top colleges and universities through bribes, according to court documents. CELEBRITIES MOCK LORI LOUGHLIN AND FELICITY HUFFMAN OVER COLLEGE CHEATING SCANDAL Fifty people have been charged, including more than 30 parents, and nine coaches.  Actresses Lori Loughlin and Felicity Huffman are among those parents charged. DeVos also talked to Perino about the Department of Education proposing teacher vouchers for professional development. “We believe that teachers need to have the freedom to decide how they can better develop their own talents and become better teachers themselves,” DeVos said. WHO IS WILLIAM RICK SINGER, THE COLLEGE ADMISSIONS CHEATING SCANDAL'S ALLEGED RINGLEADER A proposed $200 million would go to these vouchers. DeVos also said part of the proposal included a tax credit that would become scholarships for students across the country, with states deciding whether or not to participate.",
      "date": "March 13",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Betsy DeVos says visit to Florida high school after shooting was 'sobering, inspiring'",
      "url": "https://www.foxnews.com/politics/betsy-devos-says-visit-to-florida-high-school-after-shooting-was-sobering-inspiring",
      "subtitle": "Betsy DeVos says visit to Florida high school after shooting was 'sobering, inspiring'",
      "author": "Phil Keating",
      "content": " Parkland, Florida high school students walked into Marjorie Stoneman Douglas High School Wednesday morning for their first, full, normal school day—three weeks to the day since the deadliest high school shooting in U.S. history. Principal Ty Thompson and his teachers, welcomed the boys and girls and a special guest, Department of Education Secretary Betsy DeVos. Secretary DeVos came to Stoneman Douglas, where Building 12 remains locked up and a crime scene, to “connect with students and teachers” in the wake of the tragic shooting on Feb. 14. Her visit inside the school was closed to the press, but afterward, she spoke to the media at a Parkland hotel. “It was a very, as I said, sobering and inspiring moment and visit,” DeVos said. “I come committed on behalf of this administration to continuing to work to find solutions so that no student and no parent ever has to go through what this community has had to endure.” She said she heard a variety of things from the students with whom she spoke with. “Some of them are doing quite well, but they all acknowledge that it’s a day-to-day situation,” she said. “For students who were actually in the building involved, it’s very tough.” School safety—and what to do about it—has dominated the political landscape since former student Nikolas Cruz allegedly took an Uber to the school, unpacked his AR-15 assault rifle with multiple magazines and unloaded 150 rounds inside the classrooms and hallways. Fourteen students died, along with one teacher, the athletic director and a coach. Sixteen others were shot and wounded. In Tallahassee, the state capital, the Senate passed its Marjory Stoneman Douglas Public Safety Act afterhours Monday night. It calls for raising the age to buy a rifle from 18 to 21, mandates a three-day waiting period for all gun purchases, boosts funding for mental health care and aims to post armed officers at ever school. One controversial proposal, to arm teachers with guns in the classrooms if their school districts approve, was removed by the Senators. The proposal was opposed by Gov. Rick Scott. The bill is now in the Florida House and a House vote on the massive, $400 million package could come Wednesday. Broward county prosecutors are presenting evidence in front of a secret, grand jury this week. A formal indictment with 17 counts of first-degree murder is expected. Suspected mass killer Nikolas Cruz remains locked up in solitary confinement. Fox News has obtained jailhouse observations by corrections staff. They include: \"Inmate avoids eye contact, looks downward with blank stare,\" \"appears to be coherent while speaking to his attorneys,\" \"had a family visit per command staff,\" and \"inmate requested to read i.e. (Bible)\"",
      "date": "March 7, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Betsy DeVos’ vacation home sparks uproar on Twitter",
      "url": "https://www.foxnews.com/real-estate/betsy-devos-vacation-home-sparks-uproar-on-twitter",
      "subtitle": "Betsy DeVos’ vacation home sparks uproar on Twitter",
      "author": "Janine Puhak",
      "content": " Twitter members went wild on Sept. 7 when photos surfaced of Secretary of Education Betsy DeVos’ sprawling lakefront summer home in Holland, Michigan. User @Davidcrespo ignited chaos with a post of the \"cottage\" that has that has since been retweeted nearly 5,300 times and liked over 19,000 times. However, it’s not the first time DeVos’ 22,000 square foot property has made headlines. According to Grand Rapids News, the South Shore Drive has been something of a local attraction for years. DeVos and her husband, former Amway CEO Dick DeVos, purchased the estate from her father-in-law Richard in 2007 for $4.5 million. HURRICANE IRMA SLAMS INTO PRESIDENT TRUMP'S $17-MILLION CARIBBEAN VACATION HOME Citing city records, Grand Rapid News noted the couple then renovated what had already been a grand home into a massive stone-and-shingle mansion. It now has eight bedrooms, five full bathrooms, three garages and a large infinity pool. “For months, cars have slowed along South Shore Drive as gawkers have followed the construction of the DeVos home, the biggest house in Holland, if not Ottawa County,” the paper reported. “Their three-story vacation home sets a new standard for size and grandeur among the other million-dollar-plus mansions that line Lake Macatawa, a popular spot with access to Lake Michigan.” THE OBAMAS MAY INVEST IN PROPERTY ON MARTHA'S VINEYARD “We are very excited with it,” DeVos told the paper of her new summer residence. With renovation on the desirably located property, real estate broker Andrea Crossman said the high-end lakefront home looks to be easily worth $10 million. BILL AND HILLARY CLINTON'S OLD SUMMER GETAWAY SELLS FOR $29 MILLION To the delight of gawkers both local and virtual, the Secretary of Education’s real estate dream didn’t come true exactly as planned. Grand Rapids News reported that Holland vetoed zoning requests to build a 10-foot-high stone fence around the perimeter of the property. All the better for ogling, indeed! FOLLOW US ON FACEBOOK FOR MORE FOX LIFESTYLE NEWS",
      "date": "September 9, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Warren promises to pick public school teacher as education secretary in response to 'terrible' DeVos",
      "url": "https://www.foxnews.com/politics/warren-promises-to-pick-public-school-teacher-as-education-secretary-in-response-to-terrible-devos",
      "subtitle": "Warren promises to pick public school teacher as education secretary in response to 'terrible' DeVos",
      "author": "Ronn Blitzer",
      "content": " Presidential hopeful Sen. Elizabeth Warren, D-Mass., made a surprise promise regarding her potential cabinet on Monday, in the midst of a tirade against Secretary of Education Betsy DeVos. Warren blasted DeVos for her history of being in favor of for-profit colleges and lack of teaching experience. In contrast, Warren guaranteed that, if she wins in 2020, she will only consider hiring someone with public school teaching experience. ELIZABETH WARREN DESCRIBED AS 'DIEHARD CONSERVATIVE' IN SCHOOL \"She doesn't really believe in public education,\" Warren said about DeVos in a video message posted in a Twitter thread targeting DeVos. \"So here's what I promise: in a Warren administration, we'll have a Secretary of Education who is committed to public education. In fact, I'll double down on that. I will only appoint for Secretary of Education someone who has been a public school teacher.\" Warren's remarks included a number of angry statements about DeVos, calling her \"a terrible Secretary of Education\" and \"a symptom of a badly broken system.\" Under the current system, she said, \"America's teachers are being crushed\" by low budgets and salaries, as well as their own student debt. She said hiring someone with public school experience would be part of a necessary \"big structural change.\" JOHN STOSSEL: WHAT HATERS DON'T GET ABOUT BETSY DEVOS The Democratic senator added, \"we need to make it easier to join a union,\" saying that would give them negotiating power that would be \"good for making sure we put the resources we need directly into our schools.\"",
      "date": "May 13",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Betsy DeVos' family boat untied from dock, causing up to $10G in damage, police say",
      "url": "https://www.foxnews.com/politics/betsy-devos-family-boat-untied-from-dock-causing-up-to-10g-in-damage-police-say",
      "subtitle": "Betsy DeVos' family boat untied from dock, causing up to $10G in damage, police say",
      "author": "Kaitlyn Schallhorn",
      "content": " A $40 million yacht owned by Education Secretary Betsy DeVos' family was untied from its dock this weekend, causing thousands of dollars in damage, police said. The 163-foot Seaquest yacht had been moored at the Huron Boat Basin when the captain alerted authorities early Sunday morning it had been untied and set adrift, according to a police report provided to Fox News. According to the Toledo Blade, which first reported on the incident, the yacht had \"several large scratches and scrapes\" from hitting a dock – resulting in what the captain estimated to be between $5,000 to $10,000 in damage. The investigation is ongoing, Huron Police Chief Bob Lippert told Fox News on Thursday morning. DeVos was in Ohio earlier this month to tour a career center and a correctional treatment program. One of the more controversial figures in the Trump administration, she assumed office as secretary of the Education Department in February 2017. PROTESTERS BLOCK DEVOS FROM ENTERING DC SCHOOL She’s a proponent of school choice and charter schools – which has resulted in large protests when she addresses college students. Her decision to rescind an Obama-era guidance instructing how college campuses investigate allegations of campus sexual assault was also met with indignation. DeVos and her husband are known for their philanthropic work – especially when it comes to education – in their home state of Michigan. SEN. MARK WARNER’S OFFICE VANDALIZED; SUSPECT ARRESTED A spokeswoman previously announced that DeVos plans to donate her nearly $200,000 salary to charities that focus on special needs and education. She also travels on her own private plane, but foots the bill, The Associated Press reported. The Seaquest is one of 10 vessels owned by the DeVos family. According to MarineTraffic.com, the yacht was back in Harbor Springs, Michigan, Thursday morning. The Associated Press contributed to this report.",
      "date": "July 26, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "John Stossel: What haters don't get about Betsy DeVos",
      "url": "https://www.foxnews.com/opinion/john-stossel-what-haters-dont-get-about-betsy-devos",
      "subtitle": "John Stossel: What haters don't get about Betsy DeVos",
      "author": "John Stossel",
      "content": " People hate Secretary of Education Betsy DeVos. When she spoke at the Kennedy School of Government, students held up signs calling her a \"white supremacist.\" When she tried to visit a school, activists physically blocked her way. The haters claim DeVos knows little about education, only got her job because she gave money to Republican politicians and hates free public education. Of course, education isn't really \"free.\" Taxpayers spend $634 billion a year on it. It's laughable that activists claim conservatives \"cut\" education spending. Funds per student tripled over the past several decades, while test scores stayed flat. Some of that failure is because of what DeVos really opposes: government's education bureaucracy. The department she inherited is a good example of that. K-12 schools are controlled and funded locally, but taxpayers are forced to ship education money to Washington, D.C., where bureaucrats there grab some, and then ship the rest back -- with strings attached. President Reagan tried to get rid of the Department of Education. He failed. Since then, it's only grown. It now spends $193.1 billion a year. DeVos proposed a mere $9 billion in cuts. But nothing goes away in Washington, no matter how wasteful. The Republican Congress ignored her proposed cuts and increased her budget by $2 billion. DeVos, like some other agency heads appointed by President Trump, resists expanding the federal bureaucracy. People hate her for that, too. When activists blocked her school visit, she told me for my latest online video, \"We drove away, and (the security guard) said, 'Ma'am, I don't think we should go back' and I said ... 'They are not going to win. I am determined to meet those kids and those teachers.'\" She did. The protesters seemed less interested in her views on education than on the fact that she's rich. One yelled: \"Keep giving money to senators.\" DeVos is rich. Her father built a company that became worth more than a billion dollars. Then she married into to the Amway marketing fortune. Walter Shaub, former head of the Office of Government Ethics, told CNN, \"DeVos's primary expertise seems to be in being a rich person.\" I asked DeVos about the charge that she \"bought her position.\" \"Yes, I have been a contributor,\" she said. \"I've also been an activist. I think it's important for people to engage in things that they believe in. But that's not the point. The point is for 30 years I have been working on behalf of families that have not had opportunity.\" She benefited from the free market. Now she wants to bring those benefits to students who've been badly treated by government-run schools. She donated to charter and private schools and served on the boards of groups that promote education choice. None of that counts as expertise, says the education establishment. \"What she has done is actually made schooling worse in Michigan,\" ranted teachers union boss Randi Weingarten on MSNBC. \"Eighty percent of the charter schools in Detroit are failing.\" Some Detroit schools are doing badly, acknowledges DeVos, but charter students do \"demonstrably better than the students in traditional public schools.\" She's right. A Stanford study found that kids at Detroit charter schools get months of additional learning every year compared to their public school peers. Choice did help. Charter and private schools are often better because they are freer to innovate. They can do things like set different hours, be open during summer and pay good teachers more. Parents in the rest of the country deserve that opportunity, too. \"If there were real choice, good teachers would make much more money,\" I suggested to DeVos. \"Absolutely,\" she replied. \"By the same token, teachers who aren't good and really shouldn't be in the classroom probably wouldn't be... (N)obody would choose their classroom! People are not stupid. They know where their kid is going to do best.\" Unions and education bureaucrats don't want parents making those decisions. They say, \"Teachers should be retrained, not fired\" and \"Competition is not for kids!\" \"We need to do something different,\" says DeVos. \"This country is on a trajectory to failure, ultimately, if we do not turn around how we educate kids.\"",
      "date": "May 9, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Betsy DeVos cancels $150 million of student loan debt after losing court battle",
      "url": "https://www.foxnews.com/politics/betsy-devos-cancels-150-million-of-student-loan-debt-after-losing-court-battle",
      "subtitle": "Betsy DeVos cancels $150 million of student loan debt after losing court battle",
      "author": "Kaitlyn Schallhorn",
      "content": " The Department of Education said it will cancel $150 million of student loan debt, impacting about 15,000 people whose schools closed. The Obama-era borrower defense relief program – which essentially ground to a halt under Education Secretary Betsy Devos – provided a path for people to seek forgiveness for federal student loans if a shuttered school violated specific laws or misled students. DeVos was highly critical of the program, reportedly calling it a “free money” giveaway, and sought to change and delay the program. However, she was sued, and a federal judge ruled in September the program needed to “go into effect.” Those eligible for loan forgiveness must have been enrolled at the school when it closed and not enrolled at another Title-IV school within three years of the previous school’s closing, according to the Education Department. PLUS loans – which parents took out on behalf of children – could also be eligible for discharge. EDUCATION DEPARTMENT UNVEILS NEW TITLE IX GUIDANCE FOR CAMPUS SEXUAL ASSAULT: HERE’S WHAT WILL CHANGE So far, about 15,000 people have been flagged by the Education Department as eligible. About $80 million of the $150 million debt is attributed to the now-defunct Corinthian schools. Borrowers will begin to be notified of student loan discharges by email on Friday, the department said. BETSY DEVOS CONSIDERING ALLOWING STATES TO USE FEDERAL FUNDS TO BUY GUNS: REPORT “This is a good first step, but it’s not good enough,” said Sen. Patty Murray, the top Democrat on the Education Committee. She called on DeVos to “abandon her attempts to rewrite the borrower defense rule to let for-profit colleges off the hook and instead fully implement the current rule and provide relief to more than 100,000 borrowers who were cheated out of their education and savings.” Republican Sen. Lamar Alexander, the Education Committee chair, previously argued the “Obama administration went too far in rewriting this provision by setting overly broad and vague standards and as a result, put taxpayers on the hook for too many loans.”",
      "date": "December 14",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Spoiler alert? Hillary Clinton claims Russia uses candidates as assets",
      "url": "https://www.foxnews.com/transcript/spoiler-alert-hillary-clinton-claims-russia-uses-candidates-as-assets",
      "subtitle": "Spoiler alert? Hillary Clinton claims Russia uses candidates as assets",
      "author": "",
      "content": "This is a rush transcript from \"Special Report,\" October 18, 2019. This copy may not be in its final form and may be updated. BRET BAIER, HOST: Podcast with David Plouffe. Former secretary of state, former candidate for the Democrats saying that Tulsi Gabbard, a current candidate, is a Russian asset. Tulsi Gabbard firing back on Twitter. She may fire back live here on our show. \"Great! Thank you, Hillary Clinton. You, the queen of warmongers, embodiment of corruption, a personification of the rot that has sickened the Democratic Party for so long, have finally come out from behind the curtain. From the day I announced my candidacy there has been a concerted campaign to destroy my reputation. We wondered who was behind it and why. Now we know. It was always you through your proxies and powerful allies in the corporate media and war machine, afraid of the threat I pose. It's now clear that this primary is between you and me. Don't cowardly hide behind your proxies. Join the race directly.\" We will start directly there with this late-breaking news. Let's bring in our panel, \"Washington Post\" columnist Marc Thiessen, Johanna Maska, former aide to President Barack Obama, and Mollie Hemingway, senior editor at \"The Federalist.\" Marc, this was a shock. We were planning to lead with something else, and then suddenly it just came. MARC THIESSEN, AMERICAN ENTERPRISE INSTITUTE: My question is, how does she know? Did she find out from Fusion GPS? Did Christopher Steele give her a secret dossier on Tulsi Gabbard? Look, Tulsi Gabbard now understands how Donald Trump feels. He was called a Russian asset. He was called a Russian agent. And it wasn't true. So welcome to the party, Tulsi. (LAUGHTER) BAIER: If Democrats were trying to somehow squelch Tulsi Gabbard's effort in the primary, this wouldn't seem to be the way to do it? JOHANNA MASKA, FORMER PRESIDENT OBAMA AIDE: No, and I don't think it's responsible to call a member of our military, a veteran, a Russian asset. So I don't think that's a helpful comment. And I think you're going to see a lot of Democrats come out and say same. I'm kind of surprised that she made the comment and that it made the podcast. But there it is. BAIER: You would have edited that out if you were David Plouffe? MASKA: I don't think he needs the attention. So, yes. BAIER: It was quite something. MOLLIE HEMINGWAY, SENIOR EDITOR, \"THE FEDERALIST\": She is currently enlisted in our military, and she enlisted after 9/11. This is a woman who is being called a Russian asset by Hillary Clinton because she has foreign policy views that differ from hers. And it is very reminiscent of what happened with President Trump. But it's also what happens when you don't hold people accountable for perpetrating the Russia hoax. That was something that was invented by the Hillary Clinton campaign with the Democratic National Committee. They secretly funneled money to create that operation. It got disseminated through the media. It was weaponized by the government. No one has been held accountable for it. And in fact, she is still out there repeating these same conspiracy theories with different targets. BAIER: The theory is that Jill Stein, the Green candidate, was also paid by the Russians to get in there and take votes from Hillary Clinton. She is now saying I would like to have a debate with Hillary Clinton. I didn't get that the first time in 2016. THIESSEN: She still is coming up with reasons why she didn't win. BAIER: Hillary is. CONTINETTI: Hillary is. It's never like I should have gone to Wisconsin. I should have gone to Michigan. I should have cared about people in the middle of the country who we were ignoring. So Hillary has all sorts of things. But it also shows how unserious they are about the Russia threat. It's all a political game for them. After the Mueller report came out, if they really cared about the threat from Russia, they would have said OK, Donald Trump didn't collude with the Russians, but this is a real threat. Let's do something together, Republicans and Democrats, to protect our democracy. And instead they dropped it because, well, if it's not going to help impeach Donald Trump they are not interested. But on what Mollie said is, John Durham is doing his investigation. We still may get some responsibility, people held to account for what happened. BAIER: We should point out that Congresswoman Gabbard said originally, or her team said 6:30. So she is running a little bit late. If it does come on, we'll show it to you here on FOX. Meantime, Johanna, there is still fallout from the White House chief of staff and how it is being interpreted what he said yesterday. Take a listen. (BEGIN VIDEO CLIP) REP. DAN KILDEE, D-MICH.: Mick had a moment of truth, and then realized that that was not going to be good for the president and had to walk it back. REP. JOHN RATCLIFFE, R-TX: Mick Mulvaney was right. Look, we withhold foreign aid to influence foreign policy decisions all the time. REP. FRANCIS ROONEY, R-FLA.: Whatever might have been gray and unclear before is certainly quite clear right now that the actions were related to getting Ukraine to do some of these things. TRUMP: I think he clarified it. (END VIDEO CLIP) BAIER: Kind of clarifying what he said, and then he put out a statement yesterday afternoon trying to do the same thing. MASKA: Yes, there is a lot of clarification. If I was under an impeachment inquiry, I would have message control. But President Trump has proven with his proactive communications that he is always keeping himself in the offensive position. Yesterday, he made Mick Mulvaney go out and do that. I don't think that was a coincidence. He said you need to go out here and deliver this really bad news that everyone is going to take poorly. BAIER: Not only that but also say that G7 is going to be at my place in Doral. MASKA: And that's the whole thing. And even the fact that he was using there, I was at the Camp David G8. I helped to plan it. And I remember the positive feedback we got from world leaders who got that intimate feeling at Camp David, which is an extraordinary site. So to throw that under the bus and say that it wasn't a good summit, when literally the U.K. duplicated that summit with Lough Erne the next year, it was just factually inaccurate. I knew he was thrown out there without much information, but it seems like he was put up for a very long time and said things he probably regrets. BAIER: We are going to do winners and losers, but your thoughts on this day, the fallout from that, but also we learned that George Kent who testified on the Hill said that they warned about Hunter Biden and this Ukraine company in 2015. HEMINGWAY: Yes, so you are seeing a lot of this with the testimony that's being provided. It's not matching up with what Democrats are hoping for. Each finding out that people care about when we give $400 million in taxpayer aide, we want it to go to a country that doesn't have corruption problems is not a high crime and misdemeanor. Learning that there was a whistleblower about Hunter Biden and that a member of the Biden staff pushed back on that is not what the Democrats are hoping for when they are trying to go after Trump. BAIER: I don't have a lot of time, so we're going to stay positive. Very quickly, we are only going to do winners. Let's go, winners down the row. THIESSEN: My loser is you, and me, and all of us who had to watch the Democratic debate instead of watching the Nationals win the pennant. MASKA: No, no. (LAUGHTER) THIESSEN: My winner is Charles, because Charles Krauthammer would have loved this moment. BAIER: There you go. MASKA: I am so happy. I only wanted to do a winner. So that's so lovely. It's the Carters. The Carters have now been married for 26,766 days, making the longest marriage of a presidential couple, just overtaking George H.W. Bush and Barbara Bush. And I have to say, so many congratulations because I love a happy marriage. HEMINGWAY: My winner is you for your new book that is coming out, \"Three Days at the Brink.\" BAIER: She is going to be back on the panel so often. (LAUGHTER) HEMINGWAY: Congratulations. THIESSEN: I shouldn't have made you my loser. (LAUGHTER) BAIER: Thank you very much. I appreciate that. Two week tour coming up, 12 cities. So check it out. Panel, thank you very much. When we come back, \"Notable Quotables.\" (COMMERCIAL BREAK) BAIER: I just never know what's happening in the break. Finally tonight, \"Notable Quotables.\" (BEGIN VIDEO CLIP) MIKE PENCE, VICE PRESIDENT: Today, the United States and Turkey have agreed to a ceasefire in Syria. TRUMP: I want to bring our soldiers back home. REP. NANCY PELOSI, D-CALIF.: Is Saudi Arabia home? UNIDENTIFIED MALE: Elijah was just a wonderful man, a smart, gifted, and I don't think we will see his likeness again. REP. TULSI GABBARD, D-HI: \"The New York Times\" and CNN have also smeared veterans like myself for calling for an end to this regime change war. TRUMP: Almost as deceptive as you showing all of the bombings taking place in Syria and it turned out that the bombing that you showed on television took place in Kentucky. UNIDENTIFIED MALE: He has a right to protect, and that's what the whistleblower statute says it. It doesn't say anonymity. MICK MULVANEY, INCOMING ACTING WHITE HOUSE CHIEF OF STAFF: Doral was by far and away, far and away the best physical facility for this meeting. UNIDENTIFIED MALE: If they looked at four Chuck E. Cheeses in Cincinnati and the top of Mount McKinley and my basement, and Doral, Doral was the perfect choice. MULVANEY: Get over it. HUNTER BIDEN, JOE BIDEN'S SON: Some kind of Alice in Wonderland where you're up on the real world and then you fall down the rabbit hole, and the president is the Cheshire Cat. UNIDENTIFIED MALE: He also called Meryl Streep an overrated actress. (LAUGHTER) UNIDENTIFIED MALE: So I guess I'm the Meryl Streep of generals. (LAUGHTER) TRUMP: Do you think I could take him in a fight? I don't know. How do mine look? (LAUGHTER) TRUMP: No hockey. (END VIDEO CLIP) BAIER: One week in D.C. Thanks for inviting us into your home tonight. That is it for this “Special Report.” This weekend you want to watch \"FOX News Sunday\" for an interview with Acting White House Chief of Staff Mick Mulvaney. Chris Wallace will have some pointed questions, I'm sure. Check your local listings for that air time. That's it for this show, fair, balanced, and unafraid. Still waiting for word of that Tulsi Gabbard press conference from Iowa. Expect it to happen tonight. We'll see if it does. Might happen with Martha. Her show is next. Content and Programming Copyright 2019 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2019 ASC Services II Media, LLC. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of ASC Services II Media, LLC. You may not alter or remove any trademark, copyright or other notice from copies of the content.",
      "date": "1 day ago",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Education Secretary Betsy DeVos recovering in wheelchair from bicycle accident injuries",
      "url": "https://www.foxnews.com/politics/education-secretary-betsy-devos-recovering-in-wheelchair-from-bicycle-accident-injuries",
      "subtitle": "Education Secretary Betsy DeVos recovering in wheelchair from bicycle accident injuries",
      "author": "",
      "content": "Education Secretary Betsy DeVos is wheelchair-bound after breaking her pelvis and hip socket in a bicycling accident over the holidays. “Secretary DeVos is back in the office full time. The accident happened over the holiday. She’s doing well,” Education Department Press Secretary Liz Hill told Fox News. DeVos made her first public appearance while recovering from the incident at an entrepreneurship event Thursday in Washington, D.C. DEVOS REWRITE OF TITLE IX SEX ASSAULT RULES WILL ALLOW CROSS-EXAMINATION OF ACCUSERS, REPORT SAYS “Very painful,” she said at The Lemonade Day event, according to Politico. “But it will heal. I just have to stay off of it for quite a few weeks, so I’m getting around with other means.” The Education Department reported last week that DeVos simply had broken a bone and underwent surgery to repair it. DeVos needed a few days of bed rest but was expected to make a full recovery, Hill said. CLICK HERE TO GET THE FOX NEWS APP The Lemonade Day, was hosted by Gallup and focused on overcoming entrepreneurial challenges faced by business-related startups. DeVos reportedly hammered home her belief that the American education experience should be individualized, which, in turn, will foster more American entrepreneurship. She also expressed her excitement about schools that provide career programs to students early on in life.",
      "date": "January 17",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Here's why progressives hate Betsy DeVos",
      "url": "https://www.foxnews.com/opinion/heres-why-progressives-hate-betsy-devos",
      "subtitle": "Here's why progressives hate Betsy DeVos",
      "author": "Bruce Riley Ashford",
      "content": " After Education Secretary Betsy DeVos’s appearance on CBS’s “60 Minutes” on Sunday night, progressive media outlets and personalities mocked her performance as “trainwreck” saying that she “stumbled,” “struggled,” and “stunk up” the interview. Although Secretary DeVos did struggle to answer some questions on the spot, the substance and tone of the criticisms are inaccurate and unfair. None of this should be surprising. Secretary DeVos, a Christian grandmother and philanthropist who has spent her career trying to improve the quality of education for poor children, has been criticized and mocked relentlessly. And she is the only Cabinet secretary who travels with a cadre of U. S. Marshals because of death threats she’s received. So why, as “60 Minutes”’ Lesley Stahl put it, has Secretary DeVos become the “most hated Cabinet secretary?” One reason—as opinion pieces in the New York Times and Wall Street Journal have argued—is that some of the Democratic party’s most deep-pocketed and powerful interest groups are teachers’ unions who realize that they will no longer have a near-monopoly on education. Another reason, as the New York Times’ Ross Douthat argued, is that the Democratic party’s upper-middle-class suburbanite constituency  - who are big supporters, in theory, of public education – bristle at the idea of DeVos’ charters and vouchers being attractive to poor and minority families (who in their view belong in public schools) or families with ideological or religious convictions that differ from their own. Perhaps the most significant reason, however, is the one Secretary DeVos gave in response to Stahl’s question: more than anything else, she is misunderstood. To clear up any misunderstanding caused by the left’s holy war against her, here are four things Americans should understand about Secretary DeVos’ educational vision: First, as she noted in the “60 Minutes” interview, Secretary DeVos wants to liberate American education from encroachment by federal bureaucracy. Under the Obama administration, the federal government functioned as a giant octopus, bypassing families, communities, and states in order to reach its tentacles into school curriculum, teacher evaluation, values conformity, and even restroom policies. Betsy DeVos signals a departure from that era. Her stated educational philosophy suggests that she will not turn Democratic encroachment into Republican encroachment; instead, she will reduce federal encroachment in order to empower families, local communities, and states. Second, Secretary DeVos emphasizes freedom of thought. During her confirmation hearings, the media made much ado about her “Dutch Calvinist” religious views. But Dutch Calvinism is a rich religious tradition that emphasizes the rights and freedoms of families, communities, and religions. For that reason, it finds adherents on the right and on the left. Additionally, it places an especially high value on education, but emphasizes that a plural society should be tolerant enough to allow diverse families and communities to build their own educational institutions and choose which institution(s) their children can attend. Unfortunately, many liberal educators are quite illiberal, unwilling to tolerate any type of educational diversity that undermines the federal government’s impulse toward command-and-control. Third, she wants to empower financially-disadvantaged families to send their children to whichever school they deem best. Under the current system, the government taxes citizens in order to provide education, but then dictates and determines how the tax money can be used. The message is clear: the federal government—rather than the family or local community—is responsible for shaping the way a child understands and interprets the world. Under Secretary DeVos’ system of vouchers and charters, however, citizens will be able to exercise more influence over their own child’s education. They will also be able to send their children to a wider variety of schools, including those that would have been financially prohibitive without the vouchers. This sort of system is supported by prominent intellectuals and educators such as Anthony Bradley and has been supported in the past by Democratic politicians such as Cory Booker. Fourth, Secretary Devos does not come to her job as a career politician or an educational ideologue. She comes as a lifelong education advocate and philanthropist who has given tens of millions of dollars to public and private educational institutions. As her “60 Minutes” interview made clear, Secretary DeVos is an imperfect Secretary of Education, as all secretaries of education have been. She is neither a career politician nor a pundit. What she is is a skilled educational advocate and a lifelong educational philanthropist whose vision for education could reduce bureaucracy, increase free thinking, and empower the financially disadvantaged, thus helping children to get the education they deserve. On second thought, I guess it’s not so hard to understand why the left’s hard-core education bureaucracy is so opposed to her. She is a serious threat to the status quo that has served them – if not students – so well. Good-thinking Americans on the left and right should reject the mainstream media narrative and pull for Secretary DeVos as she tries to reform and shake up these aspects of our nations’ educational system.",
      "date": "March 12, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "ESPN personalities defend Special Olympics after Betsy DeVos' proposal to cut its funding",
      "url": "https://www.foxnews.com/entertainment/espn-personalities-take-to-social-media-to-defend-special-olympics-after-betsy-devos-proposal-would-cuts-its-funding",
      "subtitle": "ESPN personalities defend Special Olympics after Betsy DeVos' proposal to cut its funding",
      "author": "Kathleen Joyce",
      "content": " ESPN personalities were among those who took to social media to support the Special Olympics after Education Secretary Betsy DeVos went to Congress Tuesday to defend a budget proposal that would cut funding for it and other education programs. DeVos appeared before the House Appropriations subcommittee, where she was grilled by Rep. Mark Pocan, D-Wis., over the cuts that would eliminate nearly $18 million in federal funding to the Special Olympics, NBC News reported. Pocan asked DeVos if she knew “how many kids are going to affected by that cut?” She responded that she didn’t. \"I’ll answer it for you, that's OK, no problem,\" he said. \"It’s 272,000 kids that are affected.\" ESPN APPEARED TO BE MOVING AWAY FROM POLITICS UNTIL MAX KELLERMAN SLAMMED TIGER WOODS The budget proposal calls for an overall $7 billion cut from the Department of Education's spending. Despite the slash, her budget would pour millions into funding charter schools. The Special Olympics received $17.6 million from the Education Department this year, but DeVos said it should be supported through philanthropy, The Associated Press reported. ESPN personality Julie Foudy tweeted, “Please read this @BetsyDeVos. God, you need to only spend .01 minute watching these @SpecialOlympics athletes perform to understand the power of this program.” Tony Reali, host of “Around the Horn,” tweeted, “The power of sports lies in the ability to instill & inspire positive change-& that’s at the core of what @SpecialOlympics does.” ESPN’s Kevin Negandhi tweeted the stories of those who participated in the Special Olympics. EX-ESPN STAR BILL SIMMONS CALLS OUT NETWORK FOR EDITING HIM FROM ADAM SILVER INTERVIEW Jen Lada of ESPN tweeted, “Special Olympics CHANGES LIVES. That’s not hyperbole. Some of the most joyful, strong, courageous, inspiring, determined, positive people on the planet are @SpecialOlympics athletes. They are the best of us.” Aside from ESPN personalities, a number of celebrities also tweeted at DeVos regarding the proposed cuts to the Special Olympics. Academy Award-winning actress Marlee Matlin tweeted, “Please RT [retweet]. The benefits of Special Olympics, which I have seen first hand as volunteer, are immeasurable. DeVos proposal to cut their funding will adversely affect thousands with developmental disabilities. Don’t let this happen! I support @SpecialOlympics.” “Who does this? WHO DOES THIS?” Actress Alyssa Milano tweeted. The Associated Press contributed to this report.",
      "date": "March 27",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Betsy DeVos to visit struggling South Carolina schools",
      "url": "https://www.foxnews.com/us/betsy-devos-to-visit-struggling-south-carolina-schools",
      "subtitle": "Betsy DeVos to visit struggling South Carolina schools",
      "author": "",
      "content": "COLUMBIA, S.C. – U.S. Secretary of Education Betsy DeVos is visiting a South Carolina area known as the \"Corridor of Shame\" due to its underperforming schools, making a trip to an area that's been held out as an example of the need to make reforms to the state's schools. DeVos plans to travel on Thursday to Florence County, one of several dozen districts along Interstate 95 once bestowed the nickname \"Corridor of Shame\" because of their substandard schools. Along with U.S. Deputy Secretary of Education Mitchell Zais — who headed up South Carolina's schools from 2011 to 2015 — Lt. Gov. Pamela Evette and state Superintendent of Education Molly Spearman, DeVos will visit Timmonsville Educational Center, as well as the Southeastern Institute of Manufacturing & Technology, which focuses on matching up workforce training programs with local industry needs. They'll also be joined by U.S. Rep. Tom Rice, whose office told The Associated Press on Wednesday he's discussed the importance of technical schools with DeVos in the past and has been working to get her to the district to get a firsthand look at improvements. The visit comes amid ongoing debate on how to improve South Carolina's education system, with legislative leaders and the governor saying they're placing a priority on the issue this session. Gov. Henry McMaster, who has asked officials for a study of the decades-old formula that determines how districts are funded, pledged in his State of the State address last month that \"the words 'Corridor of Shame' will be a distant memory.\" The area was part of a decades-old lawsuit over education funding. In 2014, the state Supreme Court ruled that rural schools had violated the state Constitution by failing to provide each student with quality education. Last year, the high court dismissed the suit, voting 3-2 to close a legal case that examined whether the Legislature provides enough money and support for poor and rural schools, ruling that officials had resolved the overarching dispute. In a 1999 ruling, justices coined the phrase \"minimally adequate education,\" immediately bothering many people who thought South Carolina should aspire to being more than adequate at something as important as public education. The legal case led to the 2005 \"Corridor of Shame\" documentary, which depicted decrepit conditions. Politicians and public officials have made pilgrimages to the area, including then-Sen. Barack Obama, who in 2007 toured a school, a portion of which was still in use and dated to the late 19th century. Upon taking office in 2017, McMaster launched a tour of some of the schools seen in the film to push for his ideas on education reform. ___ Meg Kinnard can be reached at http://twitter.com/MegKinnardAP",
      "date": "February 20",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Michelle Wolf takes shots at Joe Biden and Betsy DeVos",
      "url": "https://www.foxnews.com/entertainment/michelle-wolf-takes-shots-at-joe-biden-and-betsy-devos",
      "subtitle": "Michelle Wolf takes shots at Joe Biden and Betsy DeVos",
      "author": "",
      "content": "Comic Michelle Wolf took aim at Joe Biden at Variety’s Power of Women luncheon. “We have more women running for president than any other time in history. Let’s show them as much support as possible before eventually . . . rallying behind Joe Biden. When we’re behind him, he can’t touch us.” Acting as emcee for a crowd including Bette Midler, Gigi Hadid, Kacey Musgraves and Taraji P. Henson, who were all honored, Wolf also jabbed Education Secretary Betsy DeVos, who was appointed with barely any background in public education, and has made devastating cuts to special-ed. “It’s been said women have to be twice as smart and work twice as hard to get ahead,” Wolf quipped, “but thanks to Betsy DeVos we know that’s not true.” CLICK HERE TO GET THE FOX NEWS APP This article originally appeared on Page Six.",
      "date": "April 7",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    }
  ]
}