{
  "articles": [
    {
      "title": "Dan Gainor: Elizabeth Warren embraced by debate moderators",
      "url": "https://www.foxnews.com/opinion/dan-gainor-elizabeth-warren-embraced-by-debate-moderators",
      "subtitle": "Dan Gainor: Elizabeth Warren embraced by debate moderators",
      "author": "Dan Gainor",
      "content": " NBC and MSNBC embraced Sen. Elizabeth Warren of Massachusetts in the first debate of Democratic presidential candidates Wednesday night, treating her like the star of the show. The debate led off with Warren, who had a huge popularity advantage from the start. Warren – who Trump dubbed “Pocahontas” because of her phony claim of Native American heritage – was the only Democrat on stage who had mustered double digits in recent polling. Moderators let her dominate the early part of the debate, when most people were likely watching. NBC anchor Savannah Guthrie started it off sounding more like Warren’s press secretary. “You have many plans – free college, free child care, government health care, cancelation of student debt, new taxes, new regulations, the breakup of major corporations,” Guthrie said, before teeing up an economy question. Guthrie even used Warren’s plan to break up tech companies as the foundation for a question for Sen. Cory Booker of New Jersey. ELIZABETH WARREN GRABS THE SPOTLIGHT, MSNBC BARELY CHALLENGES THE DEM CANDIDATES The networks did it again halfway through. At 10 p.m. EDT, after some embarrassing tech issues that let Warren mull a question for several minutes, the debate went full-on pro-Democrat. NBC brought in bigtime liberal MSNBC anchor Rachel Maddow and “Meet the Press” host Chuck Todd. Once more they turned to Warren to set the agenda by asking her a gun control question; “We are less than 50 miles from Parkland, Florida, where 17 people were killed in a school shooting last year and where there has been significant activism on gun violence ever since,” began Todd. And, in case that wasn’t clear enough, the round-robin final comments also ended with Warren, as Maddow asked her for the “final, final statement.” That let NBC bookend the entire debate with Warren and Warren. The Twitter account of Rep. Tulsi Gabbard of Hawaii made the same point. With a signature as “-V (Tulsi's sister),” it slammed the network. “It's clear who MSNBC wants to be president: Elizabeth Warren. They're giving her more time than all the other candidates combined. They aren't giving any time to Tulsi at all.” The time element evened out a bit. Warren ended up third, according to The New York Times. Reporter Nick Corasaniti? tweeted that, prior to the “45 second closing statements,” Booker came in first with former Texas Rep. Beto O'Rourke second. Warren came in a solid third for time. CNN political commentator Van Jones was much like NBC. He started and ended the night in the Warren camp. Going in, he described Warren as “the massive star of the night.” Jones was positive about all the candidates but continued to back the senator from Massachusetts. “Elizabeth Warren looked like a college professor with a bunch of graduate students around her half the time. She is able to go back and forth between policy and the human thing better than anybody,” he concluded. While Warren certainly did well with the network assist, MSNBC host Chris Matthews made a good point afterward, crediting former Vice President Joe Biden – who debates Thursday night – with the victory. “I think the winner tonight, though, was probably Joe Biden because, to quote Sherlock Holmes, the dog wasn't barking tonight,” Matthews said. “No one took on the Democratic frontrunner the whole two hours.” Where Was Trump? We all live in President Trump’s America – whether you like it or not. But Warren and New York City Mayor Bill de Blasio never even mentioned Trump. Just as Biden was left unscathed, Trump didn’t muster a lot of attention either. According to NBC News, Sen. Amy Klobuchar of Minnesota led the pack with nine mentions of the president. But the elephant in the room still dominated. MSNBC anchor Brian Williams even made a Harry Potter-Lord Voldemort allusion by referring to Trump as “he who will not be mentioned,” in a post-debate recap. Perhaps it was Trump’s threat to tweet during the debate that had Dems running scared. Even though he never went on a tweet storm, he still tossed in a few comments. These included a damning comment 35 minutes in, calling the debate “BORING!” and criticizing the tech failures. He followed that by tweeting a humorous animation of Trump campaign signs all the way up to “Trump 2048.” The official Trump response to the debate annoyed New York Times reporter Maggie Haberman?, who complained on Twitter: “Trump campaign issues six-paragraph statement in response to debate potus called boring. It’s so long I can’t screenshot it all.” Former CBS anchor Dan Rather noted some candidates spoke a bit of Spanish and used it to attack Trump. “I think there are more candidates on stage who speak Spanish more fluently than our president speaks English,” he wrote. Author and New America fellow Jill Filipovic summarized liberal frustrations with the president. “The fact that any one of these people may actually lose to Donald Trump is such an indictment of our country,” she tweeted. Federalist Senior Editor Mollie Hemingway mocked when former Housing and Urban Development Secretary Julian Castro went extreme on abortion, calling for “reproductive justice.” “Julian Castro says he supports abortion for women who identify as men as well,” Hemingway commented. “Audience cheers. This bloody abortion fest is off the rails. Expect media reaction to be muted, however, since they are radical partisans on the issue.” CLICK HERE TO GET THE FOX NEWS APP Most of the candidates wanted a breakout moment. Vanity Fair tweeted somewhat fairly that, “Of all the men and women seeking the White House, perhaps 5 or 6 have a fighting chance. Everyone else is effectively fighting for scraps.” At least six of those on stage Wednesday night could walk down the streets of most American cities and go unrecognized. They are all trying desperately to use media exposure to change that. CLICK HERE TO READ MORE BY DAN GAINOR",
      "date": "June 27",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Trump backers torment Elizabeth Warren in Nevada: 'Don't impeach!' 'Go home!'",
      "url": "https://www.foxnews.com/politics/elizabeth-warren-dogged-by-trump-supporters-in-nevada",
      "subtitle": "Trump backers torment Elizabeth Warren in Nevada: 'Don't impeach!' 'Go home!'",
      "author": "Brie Stimson",
      "content": " Sen. Elizabeth Warren was met by a small but persistent group of Trump supporters who followed the Massachusetts Democrat through Reno-Tahoe International Airport on Wednesday, with shouts of “Don’t impeach!” and \"Go home!\" A Twitter video shared by the Nevada Republican Party shows the group following Warren through the terminal where she was hurried into a waiting van. WARREN CONTINUES ATTACK ON FACEBOOK AFTER ZUCKERBERG REVEALS IT WOULD SUE GOVERNMENT IF SHE BECOMES PRESIDENT Warren ignored the protesters as they held up signs and continued to shout at her. “Welcome to Reno ⁦@ewarren! This is @teamtrump country!!” Nevada Republican Party state Chairman Michael J. McDonald wrote in a separate tweet. Warren spoke to a much larger and friendlier crowd in Carson City on Wednesday evening – but a Trump supporter holding a “Keep America Great” sign interrupted her speech, prompting the crowd of Warren backers to chant \"Lock him up!” \"There's a lot we need to do,” Warren said to the crowd, according to New York Times reporter Thomas Kaplan, who tweeted the video. “And I understand, I understand that Donald Trump and his supporters are getting really nervous, and they have a good reason to be.\" Support for Warren has surged among Democrats in recent weeks, with the candidate passing former Vice President Joe Biden by four points in a new national poll released this week. Warren spoke earlier Wednesday at a gun safety forum in Las Vegas. Biden was also in Nevada on Wednesday, making a campaign stop in Reno, where he attacked Trump for his alleged “abuse of power.” CLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM “He did it because -- like every bully in history — he’s afraid. He’s afraid of just how badly I would beat him next November,” Biden said of Trump asking Ukrainian President Volodymyr Zelensky to investigate him.",
      "date": "October 3",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Elizabeth Warren hauls in $24.6M, topping Joe Biden in latest fundraising quarter",
      "url": "https://www.foxnews.com/politics/warrens-24-6-million-biden-fundraising",
      "subtitle": "Elizabeth Warren hauls in $24.6M, topping Joe Biden in latest fundraising quarter",
      "author": "",
      "content": "Democratic presidential candidate Sen. Elizabeth Warren raked in $24.6 million during the July-September fundraising quarter, blowing past former Vice President Joe Biden and coming close to Sen. Bernie Sanders' field-leading haul. The figure affirms the momentum Warren has appeared to be gaining in recent weeks and months, as polls show her now battling Biden – once the unrivaled front-runner – for the primary lead. While Sanders remains in third position in many polls, his fundraising is unmatched, totaling $25.3 million in the third quarter. BIDEN RAISES $15.2 MILLION IN THIRD QUARTER, DOWN $6 MILLION FROM APRIL-JUNE HAUL But Warren's campaign cash number comes close — and is far ahead of the $15.2 million raised by Biden in the last quarter. Warren and Biden are essentially tied for the lead position in most recent national and early-voting-state Democratic nomination polls. The Massachusetts senator, who’s produced one progressive policy proposal after another, announced her fundraising figures on Twitter, saying, “I’m grateful down to my toes for every grassroots supporter who chipped in.” “Together, we’re building a movement that’s going to put power back in the hands of the people,” she pledged. THE LATEST FROM FOX NEWS ON THE 2020 PRESIDENTIAL CAMPAIGN Warren’s third-quarter haul is up nearly $6 million from what she raised during the April-June quarter. Her campaign announced that they received 943,000 contributions from more than a half-million individual donors, with 300,000 of those donors giving for the first time. And they reported that the average contribution to Warren was $26. South Bend, Indiana Mayor Pete Buttigieg reported raising $19.1 million this quarter. Sen. Kamala Harris of California reported bringing in $11.6 million in the third quarter, with tech entrepreneur Andrew Yang hauling in $10 million, triple what he raised in the second quarter. Sen. Cory Booker of New Jersey announced he raised over $6 million. Best-selling spiritual author Marianne Williamson said she raised over $3 million and Sen. Michael Bennet of Colorado reported raising $2.1 million. President Trump’s reelection team, meanwhile, blew past all of them. The campaign announced that it and the Republican National Committee combined had brought in a massive $125 million in the third quarter. Asked Thursday during a campaign stop in California how she could compete with Trump's massive war chest if she reaches the general election, Warren touted her \"grassroots movement\" and highlighted \"that's going to be our comparative advantage to win in November 2020.\" Tuesday was the first day campaigns could announce their third-quarter numbers, but they have until Oct. 15 to file their fundraising reports with the Federal Election Commission. Campaign cash is a crucial barometer of a candidate’s appeal and popularity and of his or her campaign’s strength. Fundraising dollars can be used by the candidates to pay for campaign staff and grassroots outreach efforts, travel and ads. Fox News' Tara Prindiville contributed to this report.",
      "date": "October 4",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Dwayne 'The Rock' Johnson says Elizabeth Warren is 'a baller' after she praises 'Ballers'",
      "url": "https://www.foxnews.com/entertainment/dwayne-the-rock-johnson-says-elizabeth-warren-is-a-baller",
      "subtitle": "Dwayne 'The Rock' Johnson says Elizabeth Warren is 'a baller' after she praises 'Ballers'",
      "author": "Melissa Leon",
      "content": " Dwayne \"The Rock\" Johnson thinks 2020 Democratic presidential hopeful Sen. Elizabeth Warren, D-Mass., is \"a baller.\" The star of HBO's \"Ballers\" tweeted Saturday night and acknowledged that his bond with Warren is \"such a wild and pleasant one.\" \"No surprise however, as my character & show transcends politics. Drive, ambition, getting knocked down, getting back up and moving on,\" Johnson said, adding: \"She’s a baller 😉\" Warren is not shy about her love of the show and its main character, retired NFL player-turned financial adviser-turned team owner Spencer Strasmore, played by Johnson. The senator from Massachusetts gushed about the program in an interview with Entertainment Weekly published Friday. \"Why would people be surprised that I like Ballers? It’s got The Rock! What’s not to love?\" Warren told EW. DWAYNE 'THE ROCK' JOHNSON MAKING WWE RETURN: 'THERE'S NO PLACE LIKE HOME' In an early scene from season five, which is to be the series' last, Johnson's character is seen on the beach reading Warren's book, \"This Fight Is Our Fight.\" \"I loved it! I laughed out loud,\" Warren said. \"I thought it was fabulous and I hope he got to finish the book.\" She added that the scene was \"very meta.\" DWAYNE 'THE ROCK' JOHNSON GETS HONEST ABOUT A POSSIBLE POLITICAL RUN She also called Johnson's wardrobe choices \"eye candy\" and said she would welcome his character, Strasmore, to the presidential race. \"I would welcome him to the race. I know he would fight for the principles that he believes in -- he’s my kind of guy!\" Warren said. The final episode of \"Ballers\" airs Sunday night at 11 p.m. ET on HBO. CLICK HERE TO GET THE FOX NEWS APP",
      "date": "October 12",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Dan Gainor: Elizabeth Warren draws most attention from media and candidates in Democratic debate",
      "url": "https://www.foxnews.com/opinion/dan-gainor-elizabeth-warren-draws-most-attention-from-media-and-candidates-in-democratic-debate",
      "subtitle": "Dan Gainor: Elizabeth Warren draws most attention from media and candidates in Democratic debate",
      "author": "Dan Gainor",
      "content": " While there was no clear winner in the debate featuring 12 Democratic presidential candidates Tuesday night, it was clear that Sen. Elizabeth Warren of Massachusetts was seen by the moderators and her fellow candidates as the one to beat. That point was evident with time allotted to each candidate. Warren had the most with nearly 23 minutes to answer questions – or about equal to what the bottom three candidates mustered, according to The New York Times. There were some advantages to that. John Harwood of CNBC proclaimed “this debate crowning Warren the new 2020 front-runner.” CNN, NYT SLAMMED FOR AVOIDING CHINA DURING PRESIDENTIAL DEBATE: 'THIS IS LITERALLY A JOKE,' 'SHAMEFUL' But former CBS News anchor Dan Rather said that “the stage is more crowded than a Times Square subway stop.” And almost everyone on that stage was targeting Warren. It didn’t go well for the senator from Massachusetts. The regular attacks often turned her into a whiny scold. As CNN anchor John King later explained: “The candidates on the stage clearly thought it was in their best interest to go after Warren.” Former CNN commentator Roland Martin said it even better, noting: “How do we know @ewarren is leading? She has a bullseye on her tonight.” The Washington Post sold the debate with a headline sounding like it watched a far-more entertaining contest: “Warren faces first sustained attack in raucous debate.” At least it was right about the attacking. The New York Times was more accurate in tone about the tedious three-hour marathon: “Warren Draws Fire From All Sides, Reflecting a Shift in Fortunes in Race.” CNN host Van Jones reflected on the attacks, calling Warren: “Mortal. Mortal. Somebody grabbed the cape and pulled on it.” Jones explained that the “moderates” struck back, “tired of the woke-enomics.” PBS White House Correspondent Yamiche Alcindor said it was a “BIG MOMENT” when the “Elizabeth Warren attacks begin.” As she described it: “Warren gives a tough stare” after “Mayor Pete Buttigieg says to Warren: Your signature is to have a plan for everything except health care.” Even far-left Hollywood director Michael Moore wasn’t entirely happy with Warren’s prescriptions for change. He said: “Senator Warren (whom I love) just said she believes in ‘accountable capitalism’. There is no such thing. The only thing capitalism is accountable to is weath [sic] and more wealth for the wealthy. It’s only mission is to economically enslave the citizenry so the rich can get richer.” But there was more to the debate than just attacks on Warren. There were also attacks on President Trump. Of course. CNN, which has done as much as any outlet in America to promote impeachment, began the entire debate with 12 questions on the subject – one easy one for each candidate. The result was laughably predictable – all the candidates showed that they hate Trump. The Post’s phrasing was a “unified condemnation of Trump.” Like no one saw that coming. NBC News Correspondent Mike Memoli called the beginning of the debate “a moment of history,” adding that “1 participant may vote on articles of impeachment. 5 participants would sit as jurors in an impeachment trial.” This is sure to please the major media that not only hate Trump but have financial interests in the impeachment. Axios reported that news outlets are “building pop-up newsletters, podcasts, and sections solely to cover the day-to-day developments of the impeachment process.” Those include Vox Media, CNN and The New York Times. Sen. Kamala Harris of California scored one of the night’s few applause lines and news outlets went with her extreme narrative backing abortion, after she said: “And it is not an exaggeration to say women will die, poor women, women of color will die, because these Republican legislatures in these various states who are out of touch with America are telling women what to do with our bodies.” The debate was also predictably left-wing. Van Jones asked Sen. Amy Klobuchar of Minnesota a scary post-debate question for Democrats: “And I wonder, are you afraid that the party is going in a direction that is just going to get us killed here in the middle of the country?” Klobuchar responded about the party can “come together,” but it’s the kind of comment that will set the left and media worrying. Add it to the amazingly quiet crowd. The Root’s Politics Editor Jason Johnson called it “the quietest audience I've ever seen in a debate.” Trump would have called that “low energy.” He’d have been right. CLICK HERE TO SIGN UP FOR OUR OPINION NEWSLETTER Even liberals weren’t always happy with all the candidates, especially the newest entrant into the race. Vox Senior Correspondent Zack Beauchamp made fun of the billionaire who just joined the campaign, but who always seems to wear the same tie. “While Tom Steyer wasted an unconscionable amount of money getting on stage and did absolutely nothing to justify his presence here, his tie is pretty good.” Bustle Deputy News Editor Catherine Thompson took her own shot at his debating style: “Tom Steyer is gesticulating and speaking like he’s a ventriloquist’s dummy carved out of wood.” But CNN had Steyer’s back. It initially listed him as a “former hedge fund manager.” That wasn’t nice enough to a guy who buys so much TV advertising. So it somehow got changed to “Businessman.” Because CNN is neutral. And not in it for the money. CLICK HERE TO GET THE FOX NEWS APP And Washington Post Opinion Writer Elizabeth Bruenig was equally critical of former Texas Rep. Beto O'Rourke after a few candidates were asked about their age. “i mean look. yes, as you get older, your brain gets worse. but that's just a general trend. look at beto. he's very young and his brain is very bad.” There was one especially unusual highlight of the debate. Rep. Tulsi Gabbard of Hawaii bashed the “mainstream media” like she was running in the Republican primary. She explained that The “New York Times and CNN have also smeared veterans like myself for calling for an end to this regime change war.” Those news organizations were the two hosts of the debate. CLICK HERE TO READ MORE BY DAN GAINOR",
      "date": "3 days ago",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Tucker Carlson: Elizabeth Warren has 'woke journalist' allies who don't want you to ask questions",
      "url": "https://www.foxnews.com/opinion/tucker-carlson-elizabeth-warren-frontrunner-journalists-taxes-healthcare",
      "subtitle": "Tucker Carlson: Elizabeth Warren has 'woke journalist' allies who don't want you to ask questions",
      "author": "Tucker Carlson",
      "content": " It is, fair to say, a brand new Democratic field. For the better part of the year, former Vice President Joe Biden dominated the polls and the other candidates in the race attacked him from the left, which is weird to see. Biden still believed in law enforcement and international borders, and he opposed forced bussing, along with virtually every other American. So he was obviously one of those right-wing extremists from the Obama administration. That's what they were telling you on the debate stage. It was bizarre. BIDEN RAMPS UP ATTACKS ON WARREN, DISMISSES HER AS A FELLOW FRONT-RUNNER Thankfully, that line of attack is over because Joe Biden's presidential campaign itself is in effect over. Nobody thinks Biden is going to be the Democratic nominee. Elizabeth Warren is the front-runner now. That's not contested. The race is now hers to lose. So during Tuesday night's debate, her rivals on the stage decide to help her do just that -- lose. Pete Buttigieg, South Bend, Ind. mayor: Your signature, senator, is to have a plan for everything ... except this. Sen. Amy Klobuchar, D-Minn.: At least Bernie is being honest here in saying how he is going to pay for this and that taxes are going to go up. And I'm sorry, Elizabeth, but you have not said that. CLICK HERE TO GET THE OPINION NEWSLETTER Joe Biden: I'm going to say something that is probably going to offend some people here, but I'm the only one in this stage that has gotten anything really big done. Klobuchar: And I appreciate Elizabeth's work. But again, the difference between a plan and a pipe dream is something that you can actually get done. Biden: I went on the floor and got you votes. I got votes for that bill. I convinced people to vote for it. Klobuchar: I want to give a reality check here to Elizabeth because no one on this stage wants to protect billionaires. Not even the billionaire wants to protect billionaires. Beto O'Rourke: Sometimes, I think that Senator Warren is more focused on being punitive or pitting some part of the country against the other. She is punitive? When Beto O'Rourke, Mr. Armed Federal Agents Coming to Your House, calls you out for divisive attacks, it's time to pay attention. And in fact, he does make a fair point. The main reason Warren has surpassed Bernie Sanders in the hearts of primary voters despite pretty close economic programs is that she is the one far more willing to descend into the filth of identity politics. Bernie is an ideologue. There are some things that he just won't say. Elizabeth Warren will say anything. Recently, she tweeted this: \"Every person deserves to be treated with dignity and respect. And that starts with using correct pronouns. I'm Elizabeth. My pronouns are she/her/hers.\" In case you were wondering -- in case there was any question at all -- that kind of posturing is central to Elizabeth Warren's campaign. She is happy to tell you, and often does, that you're worth less, or you're worth more, based on how you were born. Unfortunately, that works right now in the Democratic Party. One thing Elizabeth Warren is not willing to say, however, is how much her single-payer government health care plan will cost -- trillions of dollars, obviously. Nobody disputes that. Nobody disputes that. And in fact, as a mathematical matter, there's no way to raise that kind of money without hiking taxes on the middle class. It's simple arithmetic. And yet for some reason, Warren refuses to admit that. Marc Lacey, national editor for the New York Times: You have not specified how you're going to pay for the most expensive plan \"Medicare-for-All.\" Will you raise taxes on the middle class to pay for it? Yes or no? Sen. Elizabeth Warren, D-Mass.: So I have made clear but my principles are here and that is costs will go up for the wealthy and for big corporations, and for hard-working middle-class families, costs will go down. Lacey: Mayor Buttigieg, you say Senator Warren has been \"evasive\" about how she is going to pay for \"Medicare-for-All.\" What's your response? Buttigieg: Well, we heard it tonight. A yes or no question that didn't get a yes or no answer. Save that tape. There are a lot of moments in debates that seem like a huge deal at the time. Everyone is yapping about them. But in the end, it turned out to be completely meaningless. This is not one of those moments. Health care is always at the top of voters' concerns and so are taxes for that matter. If Elizabeth Warren can't even explain her own signature plan to rearrange the entire American health care system, she can't win. Even a post-debate MSNBC panel acknowledged as much. Claire McCaskill, former U.S. senator: I thought she seemed a little petulant at times when she was being challenged. Eugene Robinson, Washington Post columnist: You think, a little? McCaskill: A little. Robinson: As Bernie Sanders says she just won't go there, and she was pummeled for it. Karine Jean-Pierre, senior adviser and national spokeswoman for MoveOn.org: They attacked her and she was uncomfortable. She did not handle it very well. So was it really that bad for Elizabeth Warren on Tuesday night? We'll see. She definitely got better treatment than Joe Biden got. Journalists don't like Joe Biden. Biden has zero allies in America's \"woke\" newsrooms. Warren, by contrast, has plenty of allies pretending to be journalists. For example, on Wednesday morning, NYU \"journalism\" professor Jay Rosen -- the guy whose name often pops up, despite no talent whatsoever -- demanded that reporters stop asking specific questions about Warren's policies. Again, a journalism professor telling you not to ask questions. Rosen tweeted: \"The 'make Elizabeth warren say she would raise taxes on the middle class' question should be a credibility killer. For the journalists who keep asking it.\" Now amazingly, Margaret Sullivan of the Washington Post agreed with that. She wrote this: \"Journalists are kindly doing President Trump's work for him when they insist on trying to pin down Senator Elizabeth Warren to declare she would raise taxes to fund Medicare-for-All. Of course, it's legitimate to dig into the costs, but not in a way that creates a nice GOP campaign ad.\" CLICK HERE TO GET THE FOX NEWS APP Did you listen to that? Two journalists telling you, if the answer hurts Democrats, don't ask the question. Don't tell your readers or viewers what the truth is if it increases the chances that Donald Trump could get reelected. Is that journalism? No, it's pure propaganda. It is the definition of propaganda. Jay Rosen, journalism professor, telling journalists not to ask questions. Unbelievable. Adapted from Tucker Carlson's monologue from \"Tucker Carlson Tonight\" on Oct. 16, 2019. CLICK HERE TO READ MORE FROM TUCKER CARLSON",
      "date": "2 days ago",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Marc Thiessen: Elizabeth Warren tells voters economy not working for them – Most voters disagree",
      "url": "https://www.foxnews.com/opinion/marc-thiessen-elizabeth-warren-favors-huge-federal-spending-requiring-massive-middle-class-tax-hikes",
      "subtitle": "Marc Thiessen: Elizabeth Warren tells voters economy not working for them – Most voters disagree",
      "author": "Marc Thiessen",
      "content": " With three polls showing her in the lead, Sen. Elizabeth Warren, D-Mass., may soon eclipse former Vice President Joe Biden as the front-runner for the Democratic presidential nomination. That's great news for Republicans, because Warren has a problem: The central message of her campaign is that the economy is working for the very wealthy but it is not working for ordinary Americans. Unfortunately for her, ordinary Americans disagree. A Marist poll asked voters whether \"the economy is working well for you personally.\" Nearly two-thirds of Americans said yes. This includes large majorities in almost every demographic group. Sixty-seven percent of college graduates and 64 percent of those without a college education say the economy is working for them. So do 68 percent of whites and 61 percent of nonwhite people. WARREN APPARENTLY GETS THE FACTS WRONG IN ANECDOTE DURING CNN INTERVIEW So do Americans of every generation: 63 percent of Generation Z and millennials; 69 percent of Generation X; 63 percent of baby boomers; and 69 percent of Greatest Generation and Silent Generation voters. So do supermajorities in every region in the country: 60 percent in the West, 65 percent in the Northeast, 67 percent in the Midwest, and 68 percent in the South. So do most voters in every type of American community: 63 percent of both big and small city voters; 64 percent of small-town voters; 66 percent of rural voters and 72 percent of suburban voters. Most everyone, it seems, says the economy is working for them. The only groups who disagree, Marist found, are progressives (59 percent), Democratic women (55 percent) and those who are liberal or very liberal (55 percent. So, when Warren declares that President Trump is \"part of a corrupt, rigged system that has helped the wealthy and the well-connected and kicked dirt in the faces of everyone else,\" it resonates with almost no one except those on the political left. There is a good reason for that. Unemployment is near a record low, and the United States has about 1.6 million more job openings than unemployed people to fill them. Not only are jobs plentiful, but wages are rising. And The New York Times reported in May that \"over the past year, low-wage workers have experienced the fastest pay increases.\" Americans don't just think they are doing better in the Trump economy, they are doing better. Little wonder Democrats barely mentioned the economy in Tuesday's debate. This progress is bad news for Warren. Why would Americans rally to her call for \"big structural change\" to the economy when they say the economy is working for them? Especially when they learn the structural changes Warren is proposing would cost tens of trillions of dollars and – whether she admits it or not – would require them to pay more in taxes? CLICK HERE TO SIGN UP FOR OUR OPINION NEWSLETTER Manhattan Institute budget expert Brian Riedl recently added up the price tag for Warren's proposals, and the numbers are staggering: $30 trillion to $40 trillion over 10 years for Medicare-for-all; $2 trillion for Social Security expansion; $3 trillion for climate change and environmental policies; $2 trillion free college and student loan forgiveness; and another $1 trillion for initiatives that include free child care and housing. \"Total cost: $38 trillion to $48 trillion,\" Riedl says. And that's before calculating the cost of offering free government health care to illegal immigrants, which Warren supports. There's no way to pay for that miasma of spending with Warren's wealth tax; it will require massive middle-class tax increases. No wonder the so-called moderates were going after Warren so hard at Tuesday's debate; they know it would be a disaster if she were to capture the Democratic nomination. To win in 2020, Democrats need to win over voters who like Trump's policies but don't like Trump. They can't do that by telling these voters they are wrong about the economy working for them, and that they need to make peace with socialism. Instead, they need to convince voters that they can dump Trump and still keep their prosperity. CLICK HERE TO GET THE FOX NEWS APP If Democrats nominate Warren, they will give voters suffering from Trump exhaustion no safe harbor. Her nomination would turn the election into an existential threat to the American economy. And since Warren said Tuesday that, if she is elected, and Democrats take back the Senate, they will \"repeal the filibuster,\" she will be able to pass her radical agenda by simple majority vote. That means Trump's message – \"whether you love me or hate me, you have got to vote for me\" – will ring true for millions of Americans whose votes might otherwise be up for grabs. CLICK HERE TO READ MORE BY MARC THIESSEN",
      "date": "1 day ago",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Tucker Carlson: What Elizabeth Warren doesn't want you to know about her 'Medicare-for-all' plan",
      "url": "https://www.foxnews.com/opinion/tucker-carlson-elizabeth-warren-medicare-for-all",
      "subtitle": "Tucker Carlson: What Elizabeth Warren doesn't want you to know about her 'Medicare-for-all' plan",
      "author": "Tucker Carlson",
      "content": " From the beginning, the 2020 Democratic race has been a different kind of contest. The candidates don't seem to be competing to see who can run the country most efficiently. That's the old style of politics. Instead, these candidates are pledging to remake America entirely. Rip out the old, which is. they're telling us, irredeemably tainted by racism, sexism and free enterprise, and replace it with something completely new and different. At the heart of this effort is the promise of \"Medicare-for-all.\" Now, you may have heard the phrase. Two of the most popular Democratic candidates, Bernie Sanders and Elizabeth Warren, both have endorsed it. But what exactly does it mean? What exactly is \"Medicare-for-all\"? SANDERS ACCUSES BIDEN OF PUSHING INSURANCE INDUSTRY 'TALKING POINTS' BY SLAMMING 'MEDICARE-FOR-ALL' It's worth finding out. It's not a tweak to some regulation. It's not even ObamaCare, which once upon a time Democrats defended and Republicans denounced as socialism. \"Medicare-for-all\" is actual socialism, for-real socialism. Health care spending amounts to about a fifth of the entire American economy. Elizabeth Warren demands total control of all of it -- immediately. That's \"Medicare-for-all.\" If it becomes law, it would amount to the largest expansion of the federal government since the second World War -- by far. So it's worth asking how exactly all of this would work and critically, who would pay for it. Elizabeth Warren has been asked that question many times, and every time, she has refused to answer. CLICK HERE TO GET THE OPINION NEWSLETTER Marc Lacey, national editor for The New York Times: Will you raise taxes on the middle class to pay for it? Yes or no? Sen. Elizabeth Warren, D-Mass.: The costs will go up for the wealthy and for big corporations and for hard-working middle-class families, costs will go down. Hard-working, middle-class families are going to see their costs go down. Stephen Colbert, host of \"The Late Show\": But will their taxes go up? Warren: Well -- but here's the thing ... Colbert: But here's the thing, I've listened to these answers a few times before -- George Stephanopoulos, ABC News host: Will middle-class taxes go up? Will private insurance be eliminated? Warren: Look, what families have to deal with is cost -- total cost. That's what they have to deal with. Warren: It's how much are your costs going to go down ... Chris Matthews, host of \"Hardball\": No, no. Different question. How much of your taxes go up? Warren: No, it's how much your cost -- Matthews: How is it a different question? Warren: It is how much families end up spending. Matthews: I know that argument, but will you pay more in taxes? Why don't you want to answer that question because as Jake said tonight, that's a Republican talking point. It's not a Republican talking point. It's a question. Warren: It's a question about where people are going to come out economically. Matthews: That's not my question. Warren: I spent -- She will not answer. She won't explain, no matter how hard she has been pressed. And as you just saw, even some fairly strident Democratic partisans have pressed her. Warren refuses. She will not explain what it would cost or who would pay for it. Well, now we have a credible estimate. According to a study by the Urban Institute, in just the first 10 years, Elizabeth Warren's \"Medicare-for-all\" plan would cost an additional $34 trillion. That sounds like a lot. How much is it? Here's some perspective. The Congressional Budget Office anticipates that the United States -- the whole United States -- will collect just $46 trillion in taxes over the same period. In other words, Elizabeth Warren's health care plan alone will consume the overwhelming majority of all tax dollars in the United States. That's before we spend a single dollar on -- I don't know -- Social Security, education, national defense and everything else. It's demented. Now, you should know that the Urban Institute has no motive to attack Elizabeth Warren. It's not a right-wing think tank. It's a left-wing think tank. They likely didn't even account for the cost of one's pledge to give free health care to every illegal alien who sneaks into the country. So who is going to pay for all of this? Well, think of it this way: $3.4 trillion a year -- that's the estimated cost. Divide that by 320 million Americans, and you get more than $10,000 per person -- not per taxpayer, per person.  That means every child, every retiree, every prison inmate, everybody. That would be the largest tax assessed in American history by far. Nothing even comes close. That would change everything. An awful lot of people would just leave the country and not come back. So how do you pay for \"Medicare-for-all\"? It's not a minor detail we can settle later. It's the single most important question about the program. Why do you think we don't have it already? Because we can't afford it. Elizabeth Warren pretends that's irrelevant -- and to her, maybe it is irrelevant. At some point in the last couple of years, Warren stopped functioning as a conventional senator and became a kind of Messianic figure. Details, like what things cost or whether something is constitutional or even if the majority of Americans want it, none of that seems to interest Elizabeth Warren any more. CLICK HERE TO GET THE FOX NEWS APP Warren has seen the future, and in that future, she has complete and unquestioned control of America. She is the most powerful person in the world. You can almost hear her repeating the phrase to herself... \"The most powerful person in the world.\" It's intoxicating, clearly. Adapted from Tucker Carlson's monologue from \"Tucker Carlson Tonight\" on Oct. 17, 2019. CLICK HERE TO READ MORE FROM TUCKER CARLSON",
      "date": "1 day ago",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Elizabeth Warren calls for $85 billion public broadband investment",
      "url": "https://www.foxnews.com/tech/elizabeth-warren-85-billion-public-broadband",
      "subtitle": "Elizabeth Warren calls for $85 billion public broadband investment",
      "author": "Christopher Carbone",
      "content": " Democratic presidential candidate Elizabeth Warren Wednesday unveiled a plan to invest $85 billion in publicly owned and operated broadband networks to expand internet access in the U.S., with a particular focus on underserved rural areas. The senator from Massachusetts, who has rolled out a series of policy proposals on everything from Wall Street to climate change, immigration and the economy, announced the plan just before a road trip to Iowa, which will vote in the Democratic nominating contest on February 3. The plan envisions an $85 billion federal grant to create \"fiber infrastructure necessary to bring high-speed broadband to unserved areas, underserved areas, or areas with minimal competition,\" according to a Medium post detailing the proposal. In many areas of rural America, entire communities don't have the broadband access that is taken for granted in most big U.S. cities and metropolitan areas. DEMOCRATS BLAST GOOGLE AS 'ANTI-WORKER,' DEMAND ITS CONTRACTORS BECOME PERMANENT WORKERS FACEBOOK FAILS TO STOP FLOOD OF FAKE REVIEWS, INVESTIGATIVE BODY SAYS The intiative would also restore the Obama administration's rules on net neutrality, which refers to regulations that make certain internet-service providers treat all online traffic equally. Activists have slammed the Trump administration for essentially overturning the regulations. Warren would also set aside $5 billion specifically for federal grants to expand broadband access on Native American lands. These grants, like most of Warren's major proposals, would be funded by an \"ultra-millionaire tax,\" a 2 percent levy on wealth greater than $50 million and an additional 1 percent tax on wealth above $1 billion. CLICK HERE FOR THE FOX NEWS APP",
      "date": "August 7",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Elizabeth Warren, zombie candidate",
      "url": "https://www.foxnews.com/politics/elizabeth-warren-zombie-candidate",
      "subtitle": "Elizabeth Warren, zombie candidate",
      "author": "Chris Stirewalt",
      "content": " **Want FOX News Halftime Report in your inbox every day? Sign up here.**\n\nOn the roster: Elizabeth Warren, zombie candidate - Ducey holds all the cards on McCain seat - Cohen calls out Trump - House schedule is ‘subject to change’ - Finally, an interception even the Jets can make\n\n\nELIZABETH WARREN, ZOMBIE CANDIDATE \n\nAt this point, it feels a bit like piling on, but can we just say: Puh-leeze, Elizabeth Warren. \n\n\nThe Massachusetts senator, who is whiter than a Starbucks kiosk at a Dave Matthews Band concert, delivered the fall-semester commencement address at the historically black Morgan State University in Baltimore. \n\n\n“I’m not a person of color,” she helpfully observed. “And I haven’t lived your life or experienced anything like the subtle prejudice, or more overt harm, that you may have experienced just because of the color of your skin.”\n\n\nThe joke here is that Warren did once present herself as a person of color back when it was advantageous for her to do so in the nerd-eat-nerd world of big-time academia. \n\n\nWhen she was called out for this “Pow-Wow Chow” stuff, she initially blew it off. Then when Donald Trump weaponized the taunt in a deadly effective way, Warren sought to double down, releasing a DNA report that said she was, in fact, part Native American. \n\n\nThis is where it gets really funny. Having failed to do its homework, her campaign ended up bragging about a portion of native blood in which only the most committed bigot could be interested. She had less Indian ancestry than the average white American.\n\n\n*sad trombone*\n\n\nTribal leaders were furious, Republicans were splitting their sides with laughter and Democrats concerned for their 2020 chances were watching through latticed fingers at the implosion. \n\n\nNow, with all of the subtlety and nuance of Clark Griswold’s Christmas display, Warren is sucking up to minority voters knowing as she does that like Bernie Sanders in 2016 and several white progressives in 2018 primaries that the readership of The Nation is not a sufficient base in a party that is substantially and increasingly not white. \n\n\nIn a party enamored with Alexandria Ocasio-Cortez, Ayanna Pressley and Stacey Abrams, Warren looks hopelessly out of step. Democrats may very well choose a person of color as their 2020 nominee, but it’s hard to imagine that they would pick a white person with racial baggage. (Sorry, Mike Bloomberg.)\n\n\nNow, Warren has seen her stock tumble so far that she may one day be in good shape for a “comeback kid” narrative, but not yet. And that really is the problem for Democrats: Their field will be full of zombies. \n\n\nWarren, former Housing and Urban Development Secretary Julian Castro, Colorado Gov. John Hickenlooper, former Attorney General Eric Holder, Sanders and others have enough resources and can garner enough media attention to run for a long, long time. \n\n\nEven now a phalanx of Democratic staffers fresh from the 2018 field of battle are surging into early states for these candidates. There’s plenty of money and a field so large no one can really be discredited so early. If Beto O’Rourke is a thing – and he is – who is to tell a sitting senator, governor or billionaire former mayor of New York they don’t have a chance? \n\n\nBut as the groan-inducing efforts to prop up Warren’s floundering campaign illustrates, this all comes at a cost.\n\n\nIn 2012 Republicans were quite indulgent with themselves when it came to choosing a nominee, pausing over several odd lots, sometimes more than once, before grudgingly, half-heartedly accepting Mitt Romney as their man. This happened for a lot of reasons, most of all a misunderstanding among GOP voters about how hard it would be to defeat and incumbent president.\n\n\nBut it was also made worse by billionaire Republican donors and the consultants that milked them propping up doomed candidates and generally avoiding the hard arithmetic of primary politics. \n\n\nRepublicans should not kid themselves. Few incumbent presidents have faced the challenges that Trump does. George W. Bush had a pretty hard pull in 2004, but you’d probably have to go back to his dad to find an incumbent with a to-do box as full as Trump’s. \n\n\nBut he is nowhere near as vulnerable as Democrats would like to think. He will be a tough out and if the Blue Team has a bunch of zombies roaming around snacking on the brains of an engaged but uncertain electorate, it will cost them.\n\nTHE RULEBOOK: ACTION HERO \n\n“Those politicians and statesmen who have been the most celebrated for the soundness of their principles and for the justice of their views, have declared in favor of a single Executive and a numerous legislature. They have with great propriety, considered energy as the most necessary qualification of the former, and have regarded this as most applicable to power in a single hand…” – Alexander Hamilton, Federalist No. 70\n\nTIME OUT: ‘PIOUS, JUST, HUMANE, TEMPERATE AND SINCERE’ \n\nOn this day in 1799, the father of our country, George Washington, died at age 67 from a throat infection and the misinformed medical treatment of his time. Mount Vernon: “At five in the afternoon [he] sat up from bed, dressed, and walked over to his chair. He returned to bed within thirty minutes. [Longtime friend and family physician James Craik] went to him and Washington said, ‘Doctor, I die hard; but I am not afraid to go; I believed from my first attack that I should not survive it; my breath can not last long.’ … At ten at night [he] spoke, requesting to be ‘decently buried’ and to ‘not let my body be put into the Vault in less than three days after I am dead.’ … He was surrounded by people who were close to him including his wife who sat at the foot of the bed, his friends Dr. Craik and Tobias Lear, housemaids Caroline, Molly, and Charlotte, and his valet Christopher Sheels who stood in the room throughout the day. … On December 18, 1799 a solemn funeral was held at Mount Vernon.”\n\nFlag on the play? - Email us at HALFTIMEREPORT@FOXNEWS.COM with your tips, comments or questions.\n\nSCOREBOARD\n\nTrump job performance \n\nAverage approval: 41.6 percent\nAverage disapproval: 53 percent\nNet Score: -11.4 points\nChange from one week ago: down 0.6 points \n\n[Average includes: Fox News: 46% approve - 52% disapprove; CNN: 40% approve - 53% disapprove; Gallup: 40% approve - 56% disapprove; NPR/PBS/Marist: 43% approve - 49% disapprove; IBD: 39% approve - 55% disapprove.]\n\nDUCEY HOLDS ALL THE CARDS ON MCCAIN SEAT \nPolitico: “Sen. Jon Kyl (R-Ariz.) will resign at the end of this year, forcing Republican Gov. Doug Ducey to appoint a new replacement to the late Sen. John McCain's seat ahead of a 2020 special election to fill the last two years of McCain's term. Kyl sent Ducey a letter Wednesday announcing his resignation effective at the end of this month. ‘When I accepted your appointment, I agreed to complete the work of the 115th Congress and then reevaluate continuing to serve,’ Kyl wrote. ‘I have concluded that it would be best if I resign so that your new appointee can begin the new term with all other Senators in January 2018 and can serve a full two (potentially four) years.’ Ducey's office said in a statement that the governor will appoint another replacement in the near future. Two prospects are GOP Rep. Martha McSally, who lost a campaign for Arizona's other Senate seat earlier this year, and Kirk Adams, Ducey's former chief of staff and a former speaker of the Arizona House.” \n\nAnd he isn’t sold on McSally - WaPo: “Arizona Gov. Doug Ducey has lost enthusiasm for appointing Rep. Martha McSally, a fellow Republican, to the Senate in recent weeks even as Republican leaders in Washington have championed her. … But her stock has fallen in the eyes of the governor, according to two people familiar with his thinking, as Ducey approaches one of the most significant decisions of his political career. Ducey’s choice would affect not only the future of the Senate but the 2020 elections in an increasingly competitive battleground state. It could also impact his relationship with Senate Majority Leader Mitch McConnell (R-Ky.), a McSally advocate, as well as other party leaders who want to see more Republican women in Congress. There are several reasons McSally’s chances have faded, according to the people who spoke on the condition of anonymity to freely discuss private conversations. One is a post-election memo her campaign strategists provided to The Washington Post last month, which attributed her defeat in November to external factors. Among them… There are also concerns about McSally’s standing among Republican donors.”\n\nCOHEN CALLS OUT TRUMP \nNPR: “Michael Cohen, President Trump's onetime lawyer and fixer, says his former boss knew it was wrong to order hush-money payments made during the 2016 presidential campaign to two women who allege they had affairs with Trump — but he directed Cohen to do it anyway to help his election chances. Cohen also said in an interview with ABC News aired Friday that the president's repeated assertions that Cohen is lying about the payments and other aspects of his work for Trump were false. ‘He knows the truth. I know the truth. Others know the truth,’ Cohen said. ‘The man doesn't tell the truth. And it is sad that I should take responsibility for his dirty deeds.’ Cohen pleaded guilty to financial crimes, campaign finance violations and lying to Congress about efforts to build a Trump Tower in Moscow. His ABC interview appeared less than 48 hours after a federal judge in Manhattan sentenced him to three years in prison and imposed around $2 million in financial penalties. It appears to be part of an effort by Cohen to rehabilitate his reputation, which is in tatters and disparaged by people on both sides of the political spectrum.”\n\nGiuliani not concerned about Cohen’s allegations - Market Watch: “Rudy Giuliani bashed President Donald Trump’s former lawyer, Michael Cohen, on Friday, after Cohen said in a televised interview that Trump had directed him to make hush-money payments during the 2016 presidential campaign. In an interview with the Wall Street Journal, the former New York mayor, now a lawyer for Trump, called Cohen’s allegations ‘much ado about nothing’ and sought to minimize Cohen’s admitted violation of campaign-finance law. ‘Whether they talked about it or not, their talking about it can’t make it a crime,’ Giuliani said about the hush-money payments. … In discussing Cohen’s admission, Giuliani told the Journal: ‘It’s campaign finance, my God.’ ‘Everybody pays a fine to the [Federal Election Commission] that is in politics. You can’t follow all the rules.’ The payments were found to be in violation of campaign-finance laws, since they were made in an attempt to influence the election. Giuliani also made comments to the Daily Beast about the violations, saying ‘nobody got killed, nobody got robbed.’”\n\nHOUSE SCHEDULE IS ‘SUBJECT TO CHANGE’\nRoll Call: “House Majority Leader Kevin McCarthy stated the obvious on Thursday when he noted that the chamber’s schedule for next week remains ‘fluid and subject to change.’ Outside of the big remaining item of business — a deal to extend government funding for nine departments and assorted agencies amid the congressional standoff with President Donald Trump over funding for a border wall — there is a dwindling list of legislative business for the chamber to attend to before the adjourning of the 115th Congress. The House conducted its final vote of the week early Thursday and as McCarthy and Minority Whip Steny H. Hoyer, D-Md., assembled on the floor to discuss the week ahead, the schedule McCarthy laid out reflected the uncertainty of when a spending deal might be considered, as well as the lack of a definitive plan on considering anything else.”\n\nPelosi vs. Hoyer is another fight to watch - NYT: “In her quest to become speaker, Representative Nancy Pelosi of California appears ready once again to sacrifice the higher ambitions of her No. 2, Representative Steny H. Hoyer, and Mr. Hoyer is not shy about expressing his objections. ‘She’s not negotiating for me,’ he snapped the other day, referring to Ms. Pelosi’s deal with a group of House Democratic rebels to impose term limits on the leadership — and not just herself — of four years. As Democrats prepare to assume control of the House, the Pelosi-Hoyer frenemies dynamic, long a subject of intrigue in the Capitol, is growing ever more complex. The friction goes back decades. The last time Democrats took power from Republicans, in 2006, Ms. Pelosi backed then-Representative John P. Murtha in his effort to oust Mr. Hoyer from the majority leader’s slot. The putsch failed spectacularly, but she’s ready to handcuff him again with a deal on term limits that, if approved, would most likely usher both lawmakers from their leadership suites by early 2023, along with the No. 3 Democrat, Representative James E. Clyburn of South Carolina.”\n\nWALKER SIGNS LEGACY BILL STICKING IT TO DEMS\nAP: “Wisconsin Gov. Scott Walker signed a sweeping package of Republican-written legislation Friday that restricts early voting and weakens the incoming Democratic governor and attorney general, brushing aside complaints that he is enabling a brazen power grab and ignoring the will of voters. Walker signed the bills just 24 days before he leaves office during an event at a state office building in Green Bay, about 130 miles (209 kilometers) from his Capitol office that has frequently been a target for protesters. The Republican governor and one-time GOP presidential candidate downplayed bipartisan criticism that they amount to a power grab that will stain his legacy. Speaking for 20 minutes and using charts to make his points, Walker detailed all of the governor’s powers, including a strong veto authority, that will not change while defending the measures he signed as improving transparency, stability and accountability.”\n\nPLAY-BY-PLAY\nDes Moines Register 2020 Iowa poll out this weekend - Des Moines Register\n\nTrump inauguration spending under investigation - WSJ\n\nChris Christie withdraws from running for chief of staff - Fox News\n\nJoe Lieberman tapped to do damage control for China’s ZTE - Politico\n\nInspector general report shows complexity of recovering Strzok, Page texts - WaPo \n\nJudge rules to uphold Maine’s ranked-choice voting - [Portland] Press Herald \n\nAUDIBLE: UN CAFÉ POR FAVOR\n\n“Esta cafetera seguirá sirviendo café cubano para constituyentes en #DC.” – Tweet from Rep. Ileana Ros-Lehtinen, R-Fla., posted with a picture of her giving her successor, Democratic Rep.-elect Donna Shalala, a “cafetera” machine to make Cuban-style coffee for constituents who visit the South Florida lawmaker’s Washington office.\n\nBEST OF JOURNALISM 2018 \n\nIt’s time again for our annual year-end edition saluting the year’s best journalism, and we need your input. What stories stood out? Which journalists helped you understand the world in a better way? Who did it with integrity and an unflinching commitment to the truth? What about the ones who made you think or laugh? You can read last year’s winners here to get an idea of what we’re looking for. Share your suggestions with us by email at HALFTIMEREPORT@FOXNEWS.COM \n\nANY GIVEN SUNDAY\n\nThis weekend Mr. Sunday will sit down with President Trump’s attorney, Rudy Giuliani and businessman Bill Gates. Watch “Fox News Sunday with Chris Wallace.” Check local listings for broadcast times in your area.\n\n#mediabuzz - Host Howard Kurtz has the latest take on the week’s media coverage. Watch #mediabuzz Sundays at 11 a.m. ET.\n\nShare your color commentary: Email us at HALFTIMEREPORT@FOXNEWS.COM and please make sure to include your name and hometown.\n\nFINALLY, AN INTERCEPTION EVEN THE JETS CAN MAKE\nWPVI: “An armored truck spilled cash on a New Jersey highway Thursday, leading to two crashes as drivers ‘went a little bit crazy,’ stopping their cars and scrambling to grab the swirling money. The frenzy happened during morning rush hour in East Rutherford, near MetLife Stadium, where the New York Giants and New York Jets play. In online videos, a man in uniform is seen running through traffic trying to collect money, while others exited their cars to do the same. … A Brink's truck idled in the right shoulder with its lights flashing as the bills blew around the highway. One video showed the bashed-in front end of a sedan as traffic crawled through the blizzard of bills. Police said the chaos led to two crashes, though it's unclear whether anyone was injured. … Police said they don't know how much money spilled.”\n\nAND NOW, A WORD FROM CHARLES…\n\n“If you get in a car to go to a certain place in the middle of the night to pick up stolen goods, and it turns out the stolen goods don't show up but the cops show up, I think you're going to have a very weak story saying ‘I got swindled here.’” – Charles Krauthammer (1950-2018) on “The Story with Martha MacCallum” on July 11, 2017.  \n\nChris Stirewalt is the politics editor for Fox News. Brianna McClelland contributed to this report. Want FOX News Halftime Report in your inbox every day? Sign up here.",
      "date": "December 14",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Arnon Mishkin: Don’t count Elizabeth Warren out",
      "url": "https://www.foxnews.com/opinion/arnon-mishkin-dont-count-elizabeth-warren-out",
      "subtitle": "Arnon Mishkin: Don’t count Elizabeth Warren out",
      "author": "Arnon Mishkin",
      "content": " With 24 announced candidates and the first vote in the Democratic nomination contest over seven months away, folks are nevertheless trying to draw conclusions and speculate on the outcome. This, even though the only certainty about the future remains uncertainty. Keep this in mind as folks (yes, even myself) laugh about the also-rans flailing around with minimal support in public polls. For example, Elizabeth Warren. MEDIA NOW QUESTIONING BIDEN'S AGE Poor Elizabeth Warren. With a national following based on her solid progressive positions, she seriously considered running in 2016, and was widely considered a front-runner this time around – but no one has had more challenges getting their campaign off the ground than the junior Senator from Massachusetts. Just before her announcement – possibly in a bid to show she could stand up to President Donald Trump’s taunts and insults about her family mythology of Native American heritage – she took, and released, a DNA test that proved two things: that she does not have significant Native American heritage; and that her ability to compete at a presidential campaign level might be in question. How many stories did we read asking “who [what imbecile strategist] told her to take that stupid test?” Then she entered the race. And soon after, the inside-baseball, smart-money stories started to appear suggesting she was having trouble raising sufficient funds to mount a national campaign. At the same time, other candidates showed dramatic “Day 1” fundraising hauls, even as the media started to speculate skeptically on their chances. Former Texas Congressman Beto O’Rourke, for instance, received over $6 million, while Vermont Senator Bernie Sanders raised close to $20 million in his first 40 days. Warren, meanwhile, had to transfer money from her Senate Campaign Account, and endured stories about her finance director resigning in a dispute over financial strategy. Not a solid start. But rather than wilt in the face of the negative publicity, Warren doubled down on her core “brand” – a long time law professor (read: Wonk) with a clear progressive streak (good fit for Democratic activists), and an earnestness that both comes across in her appearances and proves spoof-worthy for none other than Saturday Night Live star Kate McKinnon. Warren continued to issue policy papers on everything from allowing employees to vote for corporate directors, to taxes on wealth, to opposition to Trump’s USMCA replacement for NAFTA, to student loans, to criminal justice reform. Her expression “I’ve got a plan for that, too” both summarizes her core brand appeal, and underscores a set of core efforts that translates into the kinds of policies that appeal to progressives in the Democratic party. It has apparently yielded dividends. Thought to be flailing just a few weeks ago, she is now running third in the polling, behind former Vice President Joe Biden and Sanders, with some polls suggesting she’s either tied or slightly ahead of Sanders. And, as happens when folks stick with a campaign, she’s even got an apparently lucky break. In the complicated DNC drawing for debate post positions, she got placed in the debate where she is the clear polling leader. While Biden, Sanders, South Bend Mayor Pete Buttigieg, and California Senator Kamala Harris, will face off against each other on the second debate night, Warren will likely be the center of attention on Debate Night One, as she is the only truly top-tier candidate on that night. The line-up gives her another chance to highlight her progressive positions in a debate where the nearest (in the polling) competitors will be New Jersey Senator Corey Booker, Minnesota Senator Amy Klobucher, and O’Rourke. CLICK HERE TO GET THE FOX NEWS APP The Debate set-up is ideal for Warren. Her strategic need – right now – is merely to get people to decide that 'She's solid\" and put her on their list of 'acceptable.' She has no strategic interest this early in getting folks to “compare” her to Biden, Harris, or others. In fact, it might hurt her at this stage, given questions some people have about Warren’s “electability.” Forcing a choice can come later in the Democratic marathon, after she gets people comfortable with her. Looks like “Poor Elizabeth Warran” is turning into “Lucky Liz. It’s a given that political fortunes change. And it’s a lesson that we in the media should not underestimate – the chance that one of the candidates currently polling around 1 percent may still figure out a way to break through in the clutter that is the Democratic campaign. CLICK HERE FOR MORE FROM ARNON MISHKIN",
      "date": "June 16",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Elizabeth Warren calls to decriminalize border crossings",
      "url": "https://www.foxnews.com/politics/elizabeth-warren-calls-to-decriminalize-border-crossings",
      "subtitle": "Elizabeth Warren calls to decriminalize border crossings",
      "author": "Joseph A. Wulfsohn",
      "content": " Sen. Elizabeth Warren, D-Mass., is the latest 2020 Democrat to be in favor of decriminalizing border crossing as the field of candidates continue to move left on immigration. Following in the footsteps of former HUD Secretary Julián Castro, who was the first to call for the decriminalization of migrants who enter the United States at the border without proper documentation, Warren told the Huffington Post that she \"agreed\" with him. \"We should not be criminalizing mamas and babies trying to flee violence at home or trying to build a better future,\" Warren said in a statement published on Tuesday. \"We must pass comprehensive immigration reform that is in line with our values, creates a pathway to citizenship for undocumented immigrants including our DREAMers, and protects our borders.” MIGRANT CHILDREN REPORTEDLY MOVED FROM BORDER PATROL FACILITY FOLLOWING NEGLECT CLAIMS Warren has been surging in the polls in recent weeks, surpassing her progressive rival Sen. Bernie Sanders, I-Vt., in several key battleground states. The Massachusetts senator will be the only frontrunner participating in the first primary debate Wednesday night, sharing the stage with Castro, Senators Cory Booker and Amy Klobuchar, Representatives Tulsi Gabbard and Tim Ryan, former Representative Beto O'Rourke, New York City Mayor Bill de Blasio, and Washington Governor Jay Inslee. CLICK HERE TO GET THE FOX NEWS APP Meanwhile, illegal border crossings have reached record levels as the conditions of the detention centers have sparked outrage and lawmakers struggle to agree on funding to manage the crisis.",
      "date": "June 25",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "",
      "url": "",
      "subtitle": "",
      "author": "",
      "content": "  ",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Democratic rivals pile on Elizabeth Warren at presidential debate",
      "url": "https://www.foxnews.com/transcript/democratic-rivals-pile-on-elizabeth-warren-at-presidential-debate",
      "subtitle": "Democratic rivals pile on Elizabeth Warren at presidential debate",
      "author": "",
      "content": "This is a rush transcript from \"The Five,\" October 16, 2019. This copy may not be in its final form and may be updated. JESSE WATTERS, CO-HOST: Hello everybody. I'm Jesse Watters along with Emily Compagno, Juan Williams, Dana Perino, and Greg. It's 5 o'clock in New York City, and this is \"The Five.\" It was a night of far-left policies at the Democratic debate. And if you didn't catch it, no worries, we've got you covered on all the low lights, including the absurd calls for gun confiscation, taking away your health care, and raising your taxes. The moderates of the group struggled to keep up with all the radical positions. Take a look. (BEGIN VIDEO CLIP) JOE BIDEN, DEMOCRATIC PRESIDENTIAL CANDIDATE: I'm the only one on the stage that has gotten anything really big done. BERNIE SANDERS, DEMOCRATIC PRESIDENTIAL CANDIDATE: you've also got (INAUDIBLE) this is a good friend. You've got the disastrous war in Iraq done. ELIZABETH WARREN, DEMOCRATIC PRESIDENTIAL CANDIDATE: I have made clear what my principles are here, and that is cost will go up for the wealthy and for big corporations. BIDEN: The plan is going to cost at least $30 trillion over ten years. SANDERS: I'm a little bit tired, I must say. Our people defending a system which is dysfunctional, which is cruel. WARREN: Why is it -- does everyone else on this stage think it's more important to protect billionaires than it is to invest in an entire generation of America? AMY KLOBUCHAR, DEMOCRATIC PRESIDENTIAL CANDIDATE: I want to give a reality check here to Elizabeth, because no one on this stage wants to protect billionaires. Not even the billionaire wants to protect billionaires. (END VIDEO CLIP) WATTERS: Liz Warren became a major target as her rivals went on the attack. (BEGIN VIDEO CLIP) BETO O'ROURKE, DEMOCRATIC PRESIDENTIAL CANDIDATE: I think that Senator Warren is more focused on being punitive or pitting some parts of the country against the other. BIDEN: Well, the senator said she's being vague on the issue of -- actually, both of being vague on the issue of Medicare for all. PETE BUTTIGIEG: A yes or no question that didn't get a yes or no answer. Your signature, senator, is to have a plan for everything except this. No plan has been laid out to explain how a multitrillion dollar hole is supposed to get filled in. KLOBUCHAR: At least, Bernie is being honest here and saying how he's going to pay for this, and that taxes are going to go up. And I'm sorry, Elizabeth, but you have not said that. The difference between a plan and a pipe dream is something that you can actually get done. (END VIDEO CLIP) WATTERS: Wow. And another big blow to Warren's campaign, three members of the far-left squad are now going to be endorsing Bernie Sanders. All right, Greg, what struck you last night? GREG GUTFELD, CO-HOST: Well, jeez. Where to start? I think the winners in my mind were Mayor Pete, Amy Klobuchar, kind of goofy but really sharp, and I disagree with almost everything he says, but Bernie showed that he's had the energy. I mean, that dude just had a heart attack and he had more energy than everybody there. But while I was watching it, I just felt like I was in line at the budget rent-a-car counter, and everybody -- all their cars are late or they didn't get the caprice with the convertible, and they're just -- DANA PERINO, CO-HOST: Complaining? GUTFELD: And they're complaining and they're -- I'll take anything, but they're in front of you. Beto was correct for once in his life about Liz being punitive. She -- every time she sees a successful person, she doesn't see the hard work that they do. She sees them as somebody that we can take from. She's basically -- her mentality fueled the worst governments of 20th century. It's bureaucrat looking at people trying to achieve and taking everything they have. Buttigieg did a great job on Beto. He was like the -- your uncle who's a veteran at Thanksgiving dinner telling that college freshman who's saying Americans are imperialist and he says, shut up and eat your mashed potatoes. WATTERS: I actually think we have that, so let's watch. (BEGIN VIDEO CLIP) UNIDENTIFIED MALE: You just made it clear that you don't know how this is actually going to take weapons off the streets. UNIDENTIFIED MALE: Let's follow their inspiration and lead, and not be limited by the polls and the consultants and the focus group -- (CROSSTALK) UNIDENTIFIED MALE: -- to do what's right. UNIDENTIFIED MALE: Mayor Buttigieg? UNIDENTIFIED MALE: The promise in the polls -- the problem is the policy. And I don't need lessons from you on courage, political or personal. (END VIDEO CLIP) WATTERS: All right, yes. So Mayor Pete had a nice scrappy night. Last night, Juan, he's definitely now -- I think catapulted himself into a top tier position. He raised a million dollars in 24 hours. He had a pretty good night. Who do you think went up and who do you think went down after last night? JUAN WILLIAMS, CO-HOST: The big take away is Elizabeth Warren takes the lead. Everybody is going after her. Everybody respects her. They have arguments on her grounds in terms of attacking her on health care. And I don't think she ever answered the question -- WATTERS: No. WILLIAMS: OK. But it was her territory, and also, on the billionaire business, the idea of taxing the rich. So, again, it's all taken place on her terms. I think Biden was OK to flat for me, but I don't think he lost any ground. The question is whether or not people like Amy Klobuchar, Pete Buttigieg were able to gain sufficiently that if Biden were to collapse or go away for some reason, they would then occupy this middle lane, which is the moderate lane. But, again, I don't agree that they did anything at the moment to either regain some of the loss -- support to that we've seen Elizabeth Warren gain in terms of her rise, or to knock out Joe Biden. I just don't see it. I think that for Buttigieg, especially, but also for Amy Klobuchar, the question would be can you attract anybody who is a black voter? I don't know. (CROSSTALK) WILLIAMS: I don't know. I think Warren, though, is -- and, you know, I think this is why I think that she comes out of this debate the winner. She is a populist. You know how Trump is a populist on the right? She's a populist on the left. And populism -- we live in an age when populism sells, and I think she's doing a great job. GUTFELD: But then, why did AOC endorse the true first populist, Bernie Sanders, and not Liz? WILLIAMS: Because, you know what? He just had a heart attack, as you pointed out, Greg. And I think there's a lot of people who are saying, you know, you may not make it all the way, but this is the point where if you need a boost, you know, we're going to throw you a life support at this point. PERINO: I don't think the squad endorsed Bernie because he had a heart attack. I think it's because, ideologically, they believe that Bernie is the revolutionary. GUTFELD: Right. PERINO: They're the ones -- he is actually the pure socialist. He's been working at this. AOC had endorsed him before. She worked on his campaign, right? And I think that -- I think that they know that -- like, in their minds, Elizabeth Warren is less likable than Bernie. But they also think that she actually won't be the change, right? Remember Obama was like, I'll be the change? I don't think that they really believe that Elizabeth Warren -- GUTFELD: She'll leave you with change. (LAUGHTER) GUTFELD: Tax and -- (CROSSTALK) WATTERS: Liz Warren, as Juan mentioned, did struggle to account for how she was going to pay for a $30 trillion Medicare for all without raising middle-class taxes. Do you think she was unsteady on her feet? Because it looks to me like she couldn't answer the question once again. EMILY COMPAGNO, GUEST CO-HOST: Yeah, I don't know if unsteady is the word I'll use. I think she was evasive and just failed, right? And she failed on the opportunity to actually answer clearly. I think that when she was attacked by the majority of the other candidates on stage, it really illustrated more in those moments about them than her, with the exception of her failure to account for who is paying for Medicare, or who would pay for Medicare for all. And also, her foreign policy incompetence, which he talked about pulling all of the troops away from the Middle East, she ignored the eight bases we have there. And I think the situation right now in Syria is really illustrating to voters that we need a commander-in-chief that has that type of foreign policy competence. And that's why, in my opinion, Biden and Mayor Pete shown in that specific regard which brings me to who I think the winner was last night, which was totally Mayor Pete by a landslide. I think he came out swinging, but it didn't seem inauthentic. It was the same amazing orator, but more in sync. And he pivoted a lot of the topics to I think a better perspective for the force, for the trees, 538 has him the highest increase now of Democratic voters that are switching over. And he shot past Kamala. And I also think that he's attracting the never- Trumpers. My loser, Tulsi, a hundred percent. WATTERS: Oh, Greg, do you agree with that? Because I think Tulsi had a few very powerful lines -- GUTFELD: Yeah, I thought the regime change thing was good. I would disagree. I would say that the loser was Castro who completely disappeared. I think that -- WATTERS: Beto, also. GUTFELD: Beto was a loser. But you point about Mayor Pete, which I agree, before he was always kind of expressing his articulation as something impress. But now he took his skills and he used it to persuade people, which I thought was like a shift. And that he made -- it made him seem like he was the only -- or one of the three adults there. WATTERS: I like that style that you pointed out. He dump it down a little bit because all these people on the stage, half of them are senators, and they speak like senators and they're not connecting. And I think Mayor Pete did a good job of connecting by speaking in a little more of a blunt fashion. PERINO: Well, there's two people that we haven't even mentioned in all of this in the A-block, and that is Cory Booker, the senator from New Jersey. WATTERS: Mr. Nice Guy. PERINO: He's the peacemaker. WATTERS: The peacemaker, right. PERINO: Blessed are the peacemakers. And Tom Steyer who was the billionaire that was on stage. He was looking directly into the camera. He had that tie that is just like, what? And I didn't know that he wears the same tie every day, but he has five of them. WATTERS: He does? PERINO: Yes. GUTFELD: It's actually a tattoo. PERINO: So, I think, the fact that he had made the debate stage totally irrelevant. GUTFELD: He makes Adam Schiff, you know, look conscious. WILLIAMS: You know, I think Amy Klobucher had a real good night. GUTFELD: Me, too. WILLIAMS: I don't want us to run by her, because I think it's so interesting. She was directly taking on Elizabeth Warren in a way that suggested to me that she sees Warren as someone that she can beat in a straight on debate. But the whole business about how are you going to pay, let me just say, I think she's been very clear about how she wants to pay for health care in the country, which is she wants to impose a tax on the super rich. I don't think there's any question about that. It's just that she won't admit that it may mean that you also increase some taxes on the middle class. Her argument, of course, is overall cost, deductible, premiums, will go down. GUTFELD: I think the best ticket from that group is Klobuchar, Mayor Pete. WILLIAMS: Yeah, but remember -- (CROSSTALK) WATTERS: No, no, no. Greg, on a bumper sticker, you can't have Buttigieg and Klobuchar. GUTFELD: Klobuchar and Buttigieg. WATTERS: Either one. (CROSSTALK) WATTERS: Coming up, Joe Biden tries to explain away the Ukraine controversy. Plus, tempers flying in the Capital as we're learning of an explosive meeting between the president, Pelosi and Chuck Schumer, breaking news out of Washington, D.C., up next. (COMMERCIAL BREAK) COMPAGNO: Former Vice President Joe Biden walked through his son's Ukraine controversy practically unscaled last night as debate moderators lobe multiple softballs questions. Watch this. (BEGIN VIDEO CLIP) UNIDENTIFIED MALE: President Trump has falsely accused your son of doing something wrong while serving on a company board in Ukraine. I want to point out, there's no evidence of wrongdoing by either one of you. JOE BIDEN, FORMER U.S. VICE PRESIDENT: My son did nothing wrong. I did nothing wrong. I carried out the policy of the United States government in rooting out corruption in Ukraine. But I wanted to make a point about -- my son's statement speaks for itself. What we have to do now is focus on Donald Trump. He's going after me, because he knows if I get the nomination, I will beat him like a drum. (END VIDEO CLIP) COMPAGNO: And from bad to worse, Joe Biden has reportedly spent more than he raised in the third quarter of 2019. Juan, I would like to start with you. So notwithstanding the intro and the lack of follow-up that Anderson Cooper displayed, he did ask Joe Biden, pointblank, if it's not OK for the president to have his children be in foreign business dealings, why is it OK for the vice president? I put that question to you. WILLIAMS: Well, I think he answered it pretty clearly. He said he didn't have the discussions. Now, we've seen reporting that in any case there was some discussion, but he said no, and he said the son said no, and he says he stands by what the son had to say, which was awkward on the day of the debate for the son to come out. But, anyway, that's what happened. And he says he stands by what the son had to say, and he did nothing wrong. Anderson Cooper, by the way, I don't know why you're picking on him. It was a false accusation that was made against Biden, and now you have a situation where people are saying, oh, Joe Biden respond to this, respond to this. Well, he just said, flat out, hey, I'm not playing that game and I appreciated it. I think that he was strong not to play somebody else's game. The real debate today, it seems to me is up on the Hill where you have -- I think it was 130 Republicans voting against Trump on the pull-out from -- I mean, that's the real argument. That and the -- GUTFELD: How about the debate, Juan? WILLIAMS: No, I'm saying, that's what -- it's not about -- this stuff about Biden is just a false -- (CROSSTALK) GUTFELD: You know what's really bad for Joe Biden right now? President -- the former President Obama just endorsed Justin Trudeau before he endorsed Joe Biden who is, right now, he's been seen running to Walmart buying shoe polish. (LAUGHTER) COMPAGNO: All right, Jesse, if Biden makes it to the general is this going to be the clip that haunts him that President Trump pulled is that you can't even answer the question. WATTERS: I don't know if he's going to make it to the general. But I do remember in 2016 when CNN moderators would argue with the Republicans running for president. And now, they just team up and let them say whatever they want. You know what reminds me of? When someone was falsely accused of something without any evidence? Donald Trump was falsely accused of being a Russian colluder without any evidence. CNN never has actually said that Donald Trump was falsely accused without any evidence after two and a half years. So, that is funny and that's a perfect example of media bias. Also interesting, let's just switch the names because I'm going to start doing this just for fun. Imagine the minute Trump selected, Don Jr. gets a sweetheart deal on the board of a Ukrainian gas company, and then the president demands the guy investigating the corrupt Ukrainian gas company is fired and withhold aids, and then the guy gets fired. And then when they ask about him about it, you guys talked about it, they say no. We never brought it up. And by the way, I was just doing my job. Look elsewhere. Do you think the media would accept Donald Trump's and Don Jr. explanation for that? Absolutely not, and that's why it's so crooked. And the fact that Biden comes out and tells CNN that his job in Ukraine was to root out corruption, OK? Well, then your son goes and joins the board of the most corrupt gas company in Ukraine? They fire the prosecutor looking into the corrupt gas company. And, as a matter of fact, corruption in Ukraine increased under Joe Biden's watch. That's why Zelensky was elected. He ran on an anti-corruption platform. WILLIAMS: Wow, Alice in Wonderland, you've got nothing on Jesse Watters. Way down the rabbit hole. You make stuff up -- WATTERS: What did I say that was wrong? WILLIAMS: Oh, what did you say that was wrong? PERINO: Can you just do it later? (CROSSTALK) PERINO: The fundraising thing, right. So he has spent more money than he has raise. And other candidates -- I think four other candidates have more cash on hand than he does. So he's got to figure out a way to step on the gas or reduce his burn rate. I do think that last night in the debate that one of the things that Democrats have learned is that attacking each other on stage doesn't work, or at least it doesn't work for long. Kamala Harris went after Joe Biden in that first debate, and she was popular for about 26 hours. Julian Castro went after Biden, and that last for 26 hours. So they're very happy to allow Donald Trump to be the one that beats up on Joe Biden, because then they don't have to. I do think for Biden, he could pull a Newt Gingrich and just go after the moderators, Juan. I think you'll remember that. And then that becomes the story, like, I've had it with you. I can't take it anymore. The other thing is Biden doesn't do any one-on-one interviews, so there's not a lot of ways to be able to dig in a little bit deeper. I mean, his son did an interview before he did. COMPAGNO: Interesting. Greg, you feel so strongly about media bias. GUTFELD: I do. Thank you for bringing that up, Emily. PERINO: Thanks for noticing. GUTFELD: Yes. I think that Anderson -- that was a pretty soft question for him. I would say it was up there with, maybe, you know, giving questions to a candidate. But the thing is, Biden, I just -- it's not if he drops out, it's when. To me, this grumpy smile that he has, and that orchestrated attempt at arousing climax at the end, you could see it coming and you felt that the sympathy clap was like a nurse -- you know, clapping for gramps because he finished the peas. I think that -- I think that he's misunderstanding the moment. He's seeing this as politics as usual and -- this moment has passed him. PERINO: It's not 2012. GUTFELD: It's not 2012. COMPAGNO: I felt like in that moment he was a dad, and we saw him as that -- in the other side of trauma, and so it made sense that he's basically, like, I will never disparage my son on the stage. But then it was a failed opportunity for him to act presidential and taking it a step further and pivoting and saying and here, let me tell you about my ethics plan that I have which he's talked about. PERINO: But by doing that admits that it was wrong. WILLIAMS: I just want to remind everybody, Joe Biden remains either in the lead or tied, basically, with Elizabeth Warren. GUTFELD: Hillary Clinton was once was. COMPAGNO: All right, up next, tempers flying in the nation's capital and the meeting between President Trump, Nancy Pelosi, and Chuck Schumer. This all just went down, we have the breaking details next. (COMMERCIAL BREAK) PERINO: Breaking news out of Washington. An explosive meeting in Washington as Nancy Pelosi and Chuck Schumer reportedly walked out of a meeting with President Trump, the topic at hand, Syria. According to top Democrats, Trump called Pelosi a third-rate politician. Here to break it all down, Kevin Corke. Kevin, earlier today, I said, well, we'll get back to you if anything big happens at the White House, and here you are. Tell us what happened. KEVIN CORKE, FOX NEWS CORRESPONDENT: And there you have it, right? Well done, and that's a Colorado connection, get it done for you there on THE FIVE. Let me just say this, the White House says the president was measured, decisive, and factual. They called the walkout by Nancy Pelosi baffling, but not surprising. As for Pelosi, herself, well, her colleagues say the president was downright insulting. He was having a meltdown. Here's what Chuck Schumer said about it not long ago. (BEGIN VIDEO CLIP) SEN. CHUCK SCHUMER (D-NY): It was insulting, particularly to the Speaker. She kept her cool completely. But he called her a third-rate politician. He said that there are communists involved and you guys might like that. I mean, this was not a dialogue. It was sort of a diatribe, a nasty diatribe not focused on the facts. (END VIDEO CLIP) CORKE: Fair and balance, that's the Democrats' side of things. On the GOP side, they say the Speaker didn't really have an intention of listening or contributing to this issue. She just wanted to have her way. Here's Mr. McCarthy. (BEGIN VIDEO CLIP) UNIDENTIFIED MALE: You see a pattern of behavior with Speaker Nancy Pelosi. She storms out of another meeting, trying to make it unproductive. The other Democrats, they actually had a very productive meeting. (END VIDEO CLIP) CORKE: And you probably know this, Dana, there was actually another meeting scheduled for tomorrow about Syria. That meeting has been canceled, we are told. And given what happened today, probably not the worst idea. Dana? PERINO: All right. Thanks, Kevin Corke at the White House. You have a third-rate politician as a compliment? GUTFELD: Yeah, somebody called me a third-rate -- it's better to be a first-rate politician. A first-rate politician, you're just a phony jack ass. But like -- Trump is a 12th rate politician. He doesn't even register, so it's actually a compliment. Look, this is obviously the worst thing that has ever happened since yesterday when the worst thing that ever happened had happened, and then before that. The fact is, every day with these people, it's the worst thing. Their hair is on fire all the time. You can see it from space. They're smoky heads are flaming. I don't care about it anymore. You can disagree with them about this. A lot of people do, you know. But the fact is this is who Trump is. He's America's cabdriver. He believes that -- like, if you ask him, if you go - - driving a cab and the cab driver go, this Middle East business it's a bunch of crap. What are we doing there? We're there for 20, 40 years. No one gets anything done. It's terrible. That's our president. What's wrong with that? WILLIAMS: Well, I tell you that's scary. GUTFELD: No, it's actually -- (CROSSTALK) WILLIAMS: No, because he want -- you want somebody as your leader. Someone who protects the flock, someone who's wise, and someone -- GUTFELD: He wants American troops out of harms way. WILLIAMS: In fact, he's creating more risk. Why do you think -- wait a second. Normally, on this show, we have sort of debate about things that are Republican, Democrat, conservative, liberal, libertarian, whatever. But, Greg, this is like 129 Republicans today voting with Democrats, including all of the House Republican leadership, to say the president is wrong, putting us Americans right here at home at risk, ISIS people being released to the world without any control. PERINO: I think they have his best interest in mind in the criticism and the pushback. WATTERS: For me, I think it's like one of those things in the swamp when there's bipartisan consensus to stay in Syria, and then outside and the rest of the country there's consensus to get the hell out of Syria. That's the disconnect. And the president is looking at both parties who've made a mess in the Middle East. You've got the Arab spring. You've had genocides. You've had wars. You've got everything going on, a migration crisis, weapons of mass destruction, and he's gonna say, you know what, enough. Let's let the Turks fight the Kurds fight the Syrians fight the Iranians, and let's get the hell out of here. PERINO: Except for now he is trying to figure out that diplomacy piece, which I think that you could agree. Let's get out. But maybe just trying to figure out a way to do it that is a little bit less bloodshed. WILLIAMS: Thank you, Ms. Perino. COMPAGNO: People are dying in Syria and Turkey and everywhere, including our-- GUTFELD: And New York City, by the way. COMPAGNO: And my tax dollars are paying the salary for those people who are sitting there and storming out of meetings and calling themselves insulting in front of the cameras like it's two little kids or three kids. No, he didn't. No, he did it, mom. I don't care. I want them to figure it out, because these are high stakes, in my opinion. And as a taxpayer, these are lives. So, I'm so sick of this civil war happening and the insulting from the coequal branch of government. We pay them and we put our faith in them to hold these offices to come to a consensus. This is getting out of control, in my opinion. WILLIAMS: But how do you argue with the cab driver, Emily? If that cab driver is saying, no, just get out. GUTFELD: You're missing the point. COMPAGNO: That cab driver has been driving-- GUTFELD: You're deliberately missing the point. All right. So, here's the debate that's going on that we saw today. You have a group of people that see the potential to hurt Trump in this thing. And so, they're building it up. Right. This is another thing. Remember, last week it was impeachment. Now, it's this. They'll find something else. So, I view a lot of this with this fight with suspicion. And there is actually a legitimate point that Trump is making and has been making for almost 20 years. WILLIAMS: But what I'm saying to you is that the Republicans have largely stayed with President Trump in opposition to the impeachment. But we see something different here, Greg and I think it suggests, this is far more serious. PERINO: Can I make a historical comparison. You don't have to go back too far to when President Obama decided not to enforce the red line. And I don't know what the number was, but I bet it was at least 130 Democrats who said President Obama that is a terrible idea. You had three Cabinet secretaries, Clinton, Podesta and Gates all write books saying, and Carrie. WILLIAMS: Right. PERINO: All saying that was not a good decision. That was a terrible decision, because it led to ISIS. So, it's not like this is unprecedented. WILLIAMS: Right. But I think the difference here, Dana, is the President apparently is telling reporters, those Kurds who were our allies and who died in our fight, there are no angels. There's a lot of sand over there. GUTFELD: There is a complicated issue with Kurds. That's all with everybody. WILLIAMS: But you've got to stand by people who fight with you. GUTFELD: At some point, you've got to go home. WATTERS: What happened to the South Vietnamese. Remember what happened there? We've got the hell out of there. We left that whole country. WILLIAMS: That's not a good-- WATTERS: What did Barack Obama do in Iraq. They left Iraq. PERINO: That's a really bad example. WILLIAMS: That's a terrible example. WATTERS: My point is, is that he doesn't want Americans to die. If other people want to fight and kill each other, which they've been doing thousands of years-- PERINO: But now, he says he doesn't want them to. He just sent a letter to Erdogan saying, don't be a fool. WATTERS: Yes. But he's going to use sanctions. He's not going to put American troops on the ground. PERINO: But people have already died. They already had the atrocities. I think President Trump could have had this all the result that he looks for now, he could have had before last week. GUTFELD: Dana's point is well taken. Everything always could be done better. Right. And Trump is known for just going out and making - he shoots first and then names later. Whatever you want to use metaphor. The point is, his simple logic. And I don't mean simple as stupid, I mean that it's plain as day. Our men aren't going to get killed. That's exactly what he said. And you can get mad at him and disagree with him, but he will accept the death of the Kurds before he accepts the death of American troops. PERINO: But he had the power to - but if you had - I guess the question is, you have the power to prevent it. And also, I do think that when these Republicans are saying, we are afraid of what could happen, because if something happens in a year or so-- GUTFELD: No, it's a fair point. PERINO: And I think that-- WILLIAMS: It would happen to Americans. (CROSSTALK) PERINO: Obama way back when. All right. Don't go anywhere. Greg takes on the Democrats impeachment obsession, because we have more on that, next. (COMMERCIAL BREAK) GUTFELD: They're still arguing here. Well, there's anxiety, there's obsession, then there's compulsion. (BEGIN VIDEO CLIP) UNIDENTIFIED FEMALE: Donald Trump. UNIDENTIFIED FEMALE: Donald Trump. UNIDENTIFIED MALE: Trump. UNIDENTIFIED MALE: Donald Trump. UNIDENTIFIED MALE: Donald Trump. UNIDENTIFIED FEMALE: I think about Donald Trump. UNIDENTIFIED MALE: Donald Trump. UNIDENTIFIED MALE: Donald Trump. UNIDENTIFIED MALE: Donald Trump. UNIDENTIFIED MALE: We've got to boot Donald Trump out of the Oval Office. UNIDENTIFIED FEMALE: Donald Trump. UNIDENTIFIED MALE: Trump. UNIDENTIFIED FEMALE: Donald Trump. UNIDENTIFIED MALE: Donald Trump, when we're talking about him, we are losing. UNIDENTIFIED FEMALE: Donald Trump. UNIDENTIFIED MALE: Donald Trump. UNIDENTIFIED MALE: Mr. Trump. UNIDENTIFIED MALE: Trump. UNIDENTIFIED MALE: Donald Trump. UNIDENTIFIED FEMALE: This is about Donald Trump. (END VIDEO CLIP) GUTFELD: Now it's good to focus on your opponent, but damn, this is beyond creepy. It's like a cult formed around the exorcism of a giant demon shaped like a tweet. They spent so much time fretting about the other guy. It was like a rehearsal dinner where everyone there talks about the bride's old boyfriend. He loomed large. They felt tiny. But if you took Trump's personality out of the mix, they'd have absolutely nothing to say, nothing about his achievements on jobs, economy, peace, because those are pretty good, which is why they had to stick to a game of who hates Trump more. (BEGIN VIDEO CLIP) SEN. ELIZABETH WARREN (D-MA) PRESIDENTIAL CANDIDATE: The impeachment must go forward. SEN. BERNIE SANDERS (D-VT) PRESIDENTIAL CANDIDATE: I hope that he is impeached. JULIAN CASTRO (D) PRESIDENTIAL CANDIDATE: We have to impeach this President. JOE BIDEN (D) PRESIDENTIAL CANDIDATE: Begin an impeachment proceeding. ANDREW YANG (D) PRESIDENTIAL CANDIDATE: I support impeachment. SEN. AMY KLOBUCHAR (D-MN) PRESIDENTIAL CANDIDATE: Pursue this impeachment. UNIDENTIFIED MALE: I started the need to impeach movement. BETO O'ROURKE (D) PRESIDENTIAL CANDIDATE: This President's criminality and his lawlessness. SEN. KAMALA HARRIS (D-CA) PRESIDENTIAL CANDIDATE: He has committed crimes in plain sight. UNIDENTIFIED MALE: The criminal in the White House. (END VIDEO CLIP) GUTFELD: Of course, CNN set the whole thing up with its first question about impeachment. No surprise since that's Jeff Zucker's meal ticket. Some reasonableness did show through briefly. (BEGIN VIDEO CLIP) REP. TULSI GABBARD (D-HI) PRESIDENTIAL CANDIDATE: If impeachment is driven by these hyper partisan interests, it will only further divide an already terribly divided country. Unfortunately, this is what we've already seen play out as calls for impeachment really began shortly after Trump won his election. And as unhappy as that may make us as Democrats, he won that election in 2016. (END VIDEO CLIP) GUTFELD: That was nice. But, when you have 11 people all fixated on one adversary, suddenly they become a fraction of him. Brave but small. The Magnificent Seven Dwarfs, almost times two, their obedient answers to CNN's direction reduce them to bumper stickers and T-shirts. Not people. There were good boys and girls reciting today's lesson, which only made the enemy more interesting. Everyone talking about how one thing is like the worst thing ever. Well, there must be something to that big bad thing. Trump is now right up there with punk rock, rap music and Elvis's hips. They say it's bad for you only because they wish they had a little bit of that mojo for themselves. Elvis's hips, remember, Dana? That was a big deal. PERINO: I don't remember. I heard about it though. GUTFELD: We weren't allowed to look at Elvis's hips at my house. PERINO: I'm going to YouTube that tonight. GUTFELD: Yes. Oh, they actually blacked out Elvis's hips. I think they did. Maybe I dreamt that. Anyway, they focus on Trump's personality because they can't talk about jobs or the economy. PERINO: I did notice, there was almost zero talk of jobs last night. I don't even know if it came up. WATTERS: Guaranteed jobs, remember? PERINO: Oh, yes. WATTERS: Bernie wants to guarantee. PERINO: Yang, Yang. I don't know. I still think it was commercial break. I didn't even know it. WATTERS: We're still in Syria. PERINO: I had a conversation, but it really went into a circle. What are you asking me? GUTFELD: I don't remember now. PERINO: I don't either. GUTFELD: Who are you? You're my favorite weather person. PERINO: They're targeting Trump because they're running against Trump. GUTFELD: Yes. PERINO: That's why. GUTFELD: There you go. PERINO: They're talking about Trump. GUTFELD: Emily, say something incredibly fast. COMPAGNO: OK. So, I felt that the attacks A, identify where they all were on the spectrum of the obsessiveness. Right. So, we had Kamala in the outset and Biden warranting impeach him now and then we had that measured approach, like you said, you know, Tulsi and Klobuchar. I also think, though, that it showed in those that pivoted to actionable, achievable policy. That's why they stood out. So that would be Klobuchar with opioids. Mayor Pete with Medicare for All. Who is going to pay for it? Biden to an extent. When he brought up Obamacare. That's what made them stand out and that they use those moments to say, OK, but enough of that for a second. Here's what really matters, including, Yang, in that moment that talked about the loss of jobs in Ohio in 2016. WILLIAMS: So, what I thought was that actually they were more focused on Trump in earlier debates than this one. GUTFELD: Really. WILLIAMS: It's kind of died down a little bit. But I understand because I saw the montage, it's pretty effective. I would say that I think the polls also it's not just them. I think they're reacting to voters, especially Democratic voters, who are clear that they want Trump impeached and the poll show not only now, it's like 50 percent even in a Rasmussen poll, want Trump impeached and removed. So that's a pretty steep thing for any politician to ignore, especially if you're in a Democratic Party debate. The other big news has been that Pelosi says, she is not going to have a vote on whether or not to begin impeachment proceedings. And you have to stop and say, well, why would that be? Because the President and the Republicans are saying this is a process thing. It's not fair to the poor President. And clearly, Nancy Pelosi saying, she's an equal branch of government. She doesn't need his permission. WATTERS: Well, the reason she is giving, either one, she doesn't have the votes, or she doesn't want it to be voted on because she wants to protect her own people from voting on it. WILLIAMS: How about moderate Republicans. WATTERS: OK. The point is this, Juan, the point is this. The Democrats are looking at a nightmare scenario. And here's what the scenario is, so cover your ears. All right. WILLIAMS: OK. WATTERS: They impeach in the house and dies in the Senate and the whole thing overshadows the Democrats running for President. Trump either beats a socialist or he beats a boring broke candidate and they retake the House. So, they have the House and the Senate. Ruth Bader Ginsburg retires. He appoints another justice and they pass another round of middle-class tax cut. That is what they're looking at. And that is a very strong possibility. WILLIAMS: I see. That's why the polls are all going in this direction on impeachment. PERINO: 2020 poll is going to be epic. GUTFELD: It is. It is. That's when I run, Dana. PERINO: Oh, are you? GUTFELD: Yes, I don't know. PERINO: Can we start that? GUTFELD: Maybe I'll run up 5k. I'll start out small. All right. Kamala Harris won't let go of her crusade to shut down Trump's Twitter. That's next. (COMMERCIAL BREAK) WILLIAMS: For weeks, Kamala Harris has been on a major crusade to kick Trump off of Twitter. Last night, she continued her calls for the suspension, challenging Elizabeth Warren to join her. Watch this. (BEGIN VIDEO CLIP) HARRIS: Senator Warren, I just want to say that I was surprised to hear that you did not agree with me then on this subject of what should be the rules around corporate responsibility for these big tech companies when I called on Twitter to suspend Donald Trump's account. WARREN: I don't just want to push Donald Trump off Twitter. I want to push him out of the White House. That's our job. But the way-- HARRIS: Join me in saying that his Twitter account should be shut down. WARREN: Let's figure out why it is. (END VIDEO CLIP) WILLIAMS: No. So, Emily, is Twitter facing some pressure? Because they're a private company. They can set any rules they want, but apparently, they have changed their rules. Now to say they're not going to retweet or like world leaders. You can't do that anymore. COMPAGNO: Right. World leaders who break their rules they said, which I think is a smart move by them. I thought in that Elizabeth Warren totally won. Kamala was back to daunting her prosecutorial cap. She kept-- PERINO: Was she prosecutor? Just kidding. COMPAGNO: But she was back to - she talked about it the whole time. And she was clearly trying to court the African American vote, which I think she failed in. And also, they're not budging from supporting Biden. I found her a little annoying last night. And E Warren won because she pivoted and was basically like, this is kind of ridiculous waste of time. Also, Elizabeth Warren's fight against big tech - big tech is not about censoring. And these my new issues, it's about data privacy and the monopolies and the control over the little guy, she says. WILLIAMS: Yes, so let's pick up on that, Jesse, because I think most people have no idea the power of Facebook, Twitter and the like. It's a little bit like Upton Sinclair at a moment, you know, like, wow, these companies are big, and they control us. Do you think that we should break them up or who do you side with there? WATTERS: Well, listen, I'd investigate them if they're monopolistic, but I'm not ready to break them up yet. We'll see what the evidence is. But I mean, the fact that Democrats complain about this stuff, they have all the networks, all the newspapers, all the Internet sites, the wires, they have every single media outlet out there except a few. And they whine because Trump is mean on Twitter. I mean, it's just so pathetic. And her attack was so meek, and Warren handled it perfectly. If I was Kamala, I just get on Twitter, find a witty reply. Have my staffer hit send and try to play the game. You know, you can't play the game. Don't whine about it. PERINO: Right. Because you only have like one chance to punch through in these debates. And that was the one that she decided on, which is basically like you didn't sign my chain letter and pass it on. WILLIAMS: Yes, what do you think, Greg? GUTFELD: I have two points to make. Number one, you know what Kamala Harris is like? She's like the movie that's at Rotten Tomatoes that has 89 percent of the critics. 7 percent of the audience. She's a hyped-up movie based on critical raves. And then you go see the movie and you're like what the hell? I heard this was supposed to be awesome, but it's not. It's really, really weak. WATTERS: I like the reverse of that. GUTFELD: I was the critic that thought she was great. But that was not the dumbest move. Her thing about the drug war. She said, I'm going to end the drug war and take on drug companies. If you take on the drug companies, you increase the drug war because we have phase out legal paths for medications. You fuel the illegal path, I mean, are you sure she was a cop? Well, yes, she was a cop. But that's like that isn't smart. That's creepy. WILLIAMS: Wait, so kick him off or not. GUTFELD: No. Of course not. WILLIAMS: All right. One More Thing is up next. (COMMERCIAL BREAK) WATTERS: It's time now for One More Thing. Greg. GUTFELD: All right, you go to Fox Nation. I've got a great interview with comedian and parody musician Remy Munasifi. Go there and then - let's do this real quick. OK. Animals Are Great. I hate Halloween, but I do like Halloween when they dress up animals like these fellows here, they've got the assets. That's two golden retrievers dressed as the lion and Dorothy from Wizard of Oz. Zoom in on that. It's kind of weird, strange. But also, I find it a little arousing. PERINO: Oh, my gosh. GUTFELD: Dogs in dresses are adorable. PERINO: Oh, man. WATTERS: All right. I can't believe I have to go next. With no context I present you. Kim Jong un riding a horse in North Korea. Yes, that is Little Rocket Man on the Korean Peninsula here. He is riding a horse because it represents his family's dynastic rule. And he said that he vowed to overcome U.S. led sanctions that have both pained and infuriated his people. PERINO: You think that's real or Photoshop? WATTERS: I am going to think it's real. I mean, I think it's real. And I feel so bad for that horse. I'm also in Martha MacCallum tonight. Great transition. How about that? Juan. WILLIAMS: All right. So, my guys, the Washington Nationals swept the St. Louis Cardinals last night to win the National League pennant. They're now headed to the World Series. So, I wanted to share with you some national fans fun. Take a look at this video. (VIDEO PLAYING) WILLIAMS: Yes. So, this all started. It's called Baby Shark. The popular kid song and the entire stadium makes the shark chomping motion at one time. This all started when Gerrardo Parra, Big Parra, a backup outfielder, began to use Baby Shark as his walkup song. He's been in a slump and he decided to use his two-year-old daughter's favorite song. Then he got hot and the rest is history. Look at Juan Soto, the outfielder last night after he got a double. Yes. The Nat's players make that shark chomping motion each other to celebrate. And right now, they even have a baby shark in the dugout. GUTFELD: Oh, my God. WILLIAMS: Yes. So, go Nats. Win the World Series. WATTERS: End this. COMPAGNO: Baby shark. OK. Halloween is obviously the spookiest time of year and most kids run screaming at obvious frights. Not this little three-year- old. Check out what he did. (VIDEO PLAYING) WATTERS: Yes, he counterpunches. I like him. COMPAGNO: This is three-year-old Charlie. He obviously didn't take kindly to being spooked by an animatronic spider at the store. WATTERS: What kind of spider was that? COMPAGNO: Animatronic. WATTERS: OK. COMPAGNO: You're welcome. So, one thing's for sure, he has a bright future if he ever decides to be a boxer. This is Larry. And by the way, this racked up 20 million Facebook views and 9.5 million. PERINO: I don't like being scared. I would have punched him, too. GUTFELD: Yes. WATTERS: All right. GUTFELD: I don't know what I would have done. PERINO: OK. So, we have little time. All right. I have something to promote. GUTFELD: You have a big decision to make. PERINO: On Friday at 2 PM, I'm going to have a special interview that's going to air on the daily briefing. I'm interviewing somebody tomorrow in D.C., (inaudible) D.C. tomorrow, so I won't be here. But Martha MacCallum will be-- GUTFELD: Should we guess? PERINO: So, who do you think I'm interviewing in D.C. that will air on Friday? GUTFELD: President Trump? PERINO: No. GUTFELD: President Obama? PERINO: No. WATTERS: Mike Pompeo. GUTFELD: President Carter. PERINO: No. Juan. WILLIAMS: Mitch McConnell. PERINO: No. COMPAGNO: I can't guess because I know. PERINO: Oh, you know. COMPAGNO: You and I talked. GUTFELD: Why does she know? And we don't. She like your special friend? (CROSSTALK) PERINO: At my office. WATTERS: Man or woman? PERINO: Man. GUTFELD: Why do you have to look at the genders? WATTERS: I'm just trying to narrow it down. PERINO: OK, here it is. It's not somebody who lives in D.C., but he is somebody who has to be in D.C. GUTFELD: Kim Jong un? PERINO: Now, because Capitol Hill wants to see him. It's Mark Zuckerberg. Mark Zuckerberg of Facebook. WILLIAMS: He's been having dinners with conservative. PERINO: Well, we had dinners with members of the media. I actually did one of those and it was a very informative - we're going to have an interview tomorrow, on Friday. GUTFELD: What's he does? PERINO: He founded Facebook, it's a little company. You can share-- GUTFELD: I saw a movie about that. I have a real Facebook. PERINO: And I'm on Tucker tonight. That's more immediate. WILLIAMS: Yes, but he's going to testify, he is quite controversial. COMPAGNO: Where is the interview? At Fox D.C.-- PERINO: It will be in D.C. COMPAGNO: Neutral location. PERINO: More to come. GUTFELD: Are you going to try to make it exciting? WATTERS: That is not nice. Ask him about Animals Are Great? That's a good idea. GUTFELD: I just got yelled at for that. WATTERS: Don't ask him about breaking up the monopolies. Not cool, Dana. All right. Set your DVRs. Never miss an episode of \"The Five.\" \"Special Report\" is up next. Content and Programming Copyright 2019 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2019 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.",
      "date": "3 days ago",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Elizabeth Warren calls Trump a white supremacist",
      "url": "https://www.foxnews.com/politics/elizabeth-warren-calls-trump-a-white-supremacist",
      "subtitle": "Elizabeth Warren calls Trump a white supremacist",
      "author": "Edmund DeMarche",
      "content": " Sen. Elizabeth Warren, a top Democrat in the 2020 presidential elections, said President Trump is a white supremacist and has done “everything in his power to stir up racial conflict and hatred in this country. Warren made the comments in an interview with The New York Times, which was published early Thursday. The remarks came after two mass shootings last weekend that resulted in 31 deaths. Democrats have placed the blame on Trump’s rhetoric for the shooting. Beto O’Rourke also labeled the president a white supremacist. Trump has said several times in the past that he is “the least racist person” in the world. He called for unity after the shootings and visited El Paso and Dayton on Wednesday to comfort El Paso, Texas, and Dayton, Ohio. Hogan Gidley, a White House spokesman, told The Hill it is irresponsible for these Democrats to assign blame after the shootings. Trump told reporters on Wednesday that “any group of hate” concerns him. \"Whether it's white supremacy, whether it's any other kind of supremacy. Whether it's Antifa,\" he said, according to Axios. \"Whether it's any group of hate.\"",
      "date": "August 8",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Bernie Sanders slams Elizabeth Warren as ‘capitalist’",
      "url": "https://www.foxnews.com/politics/dividing-lines-bernie-sanders-slams-elizabeth-warren-as-capitalist",
      "subtitle": "Bernie Sanders slams Elizabeth Warren as ‘capitalist’",
      "author": "Alex Pappas",
      "content": " Vermont Sen. Bernie Sanders – the self-proclaimed Democratic socialist whose standing in the 2020 primary has become threatened by Massachusetts Sen. Elizabeth Warren’s surge in the Democratic primary with progressive voters – is seeking to cut into the support of his rival by dismissing her as a “capitalist.” “There are differences between Elizabeth and myself,” Sanders said during an interview Sunday on ABC’s “This Week.” “Elizabeth I think, as you know, has said that she is a capitalist through her bones. I’m not.” BILLIONAIRES COULD FACE UP TO 97.5 PERCENT TAX RATES UNDER SANDERS’ PLAN: ECONOMISTS The comments come amid a rise in socialism in the Democratic Party, as candidates become more willing to openly embrace socialism over capitalism. It also follows polling showing that Democrats now view socialism more positively than they do capitalism. Last year, when asked if she was a capitalist, Warren reportedly said, \"I am a capitalist to my bones.\" Sanders explained he is not a capitalist because he \"will not tolerate for one second the kind of greed and corruption and income and wealth inequality and so much suffering that is going on in this country today, which is unnecessary.” A Gallup poll this year found that 43 percent of Americans think socialism would be a good thing for the United States, while 51 percent say it would be a bad thing. Gallup noted that in 1942, a Roper/Fortune survey that found 40 percent of Americans described socialism as a bad thing while only 25 percent called it a good thing. The polling is fresh evidence that attitudes toward socialism are changing, amid the popularity in the Democratic Party of Democratic socialists like Sanders and New York Rep. Alexandria Ocasio-Cortez, who pushes policies like “Medicare-for-all” and the Green New Deal. Meanwhile, two economists at the University of California, Berkeley, claim that billionaires could face a 97.5 percent average effective tax rate under Sanders' plan, which would easily thump other Democrats running for president in 2020. Emmanuel Saez, one of the professors, told Bloomberg that “with the wealth tax, you get directly at the stock instead of hitting the flow of income, making it a much more powerful de-concentration tool than income taxes.\" The report pointed out that Sanders has said that the number of billionaires in the U.S. would be cut in half within 15 years under the plan. The plan unveiled by Sanders seeks a 1 percent levy on households worth more than $32 million and proposes tax rates that would increase for wealthier people, up to 8 percent for fortunes in excess of $10 billion. Sanders vowed to go further than Warren and generate more than $4 trillion over the next decade, substantially reducing billionaires’ fortunes. Billionaires would face a 62 percent average effective tax rate under Warren. Sanders’ plan goes further because it starts on fortunes worth less, kicking in at $32 million. Warren also proposes increasing the wealth tax up to 3 percent on any net worth of more than $1 billion, while Sanders’ tax rates don’t top out until 8 percent for the richest households. CLICK HERE TO GET THE FOX NEWS APP The Massachusetts senator has topped Sanders in recent polls of Democrats in Iowa and New Hampshire that show her running about even with the longtime front-runner, former Vice President Joe Biden, in those states. Fox News' Edmund DeMarche and the Associated Press contributed to this report.",
      "date": "5 days ago",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Welcome to the Thunderdome, Elizabeth Warren",
      "url": "https://www.foxnews.com/politics/welcome-to-the-thunderdome-elizabeth-warren",
      "subtitle": "Welcome to the Thunderdome, Elizabeth Warren",
      "author": "Chris Stirewalt",
      "content": " **Want FOX News Halftime Report in your inbox every day? Sign up here.**\n\nOn the roster: Welcome to the Thunderdome, Elizabeth Warren - Pelosi still not biting on impeachment vote - Gallup: Majority now supports removing Trump from office - Bevin recovers in Kentucky poll - Sláinte, Mr. Bradley\n\n\nWELCOME TO THE THUNDERDOME, ELIZABETH WARREN\nWaPo: “Sen. Elizabeth Warren, whose steady stream of plans have propelled her to the top of the Democratic presidential field, came under sustained attack for the first time during a raucous primary debate here Tuesday that revealed Democrats’ ongoing public struggle to define their beliefs and choose a standard-bearer to take on President Trump. Warren (Mass.) faced direct challenges from several of the 11 other candidates onstage, who took her on over her policies, her fitness to serve as commander in chief and her willingness to question the motives of Democrats who support less transformational ideas. … The focus on Warren deflected attention from others facing scrutiny entering Tuesday’s debate, which was hosted by CNN and the New York Times. Former vice president Joe Biden went for long stretches without surfacing… Sen. Bernie Sanders (I-Vt.), meanwhile, showed no signs of lingering health trouble.”\n\nKlobuchar, Buttigieg shone through - National Review: “The October Democratic presidential-primary debate finally brought a genuine surprise, in that a pair of second-tier candidates who were in danger of being forgotten woke up, smelled the coffee, and brought their A-games: Amy Klobuchar and Pete Buttigieg. Considering how other second-tier candidates have turned in good performances in past months and seen little movement in the polls, this may not be a turning point in the race for either candidate. But in a way-too-long, often-boring debate that was stuck in the middle of an otherwise jam-packed news environment, Klobuchar and Buttigieg managed to stand out.”\n\nSanders and Warren have deep pockets as Biden burns cash - AP: “Bernie Sanders and Elizabeth Warren don’t just lead the Democratic presidential primary in fundraising. They’ve stockpiled millions more than their rivals, including former Vice President Joe Biden, who burned through money at a fast clip over the past three months while posting an anemic fundraising haul. Sanders held $33.7 million cash on hand on his third-quarter fundraising report. Warren had $25.7 million during the same period, while South Bend, Indiana, Mayor Pete Buttigieg came next $23.3 million. Biden, meanwhile, held just $8.9 million, a small fraction of what his leading rivals have at their disposal. With the first votes of the Democratic contest just months away, the candidates are entering a critical and expensive period when having an ample supply of cash can make or break a campaign. Biden’s total raises questions about his durability as a front-runner.”\n\nSquad to endorse Sanders - Fox News: “Three members of the so-called ‘Squad’ of far-left freshman members of Congress are lining up behind Sen. Bernie Sanders for president. Fox News has learned that Rep. Alexandria Ocasio-Cortez, D-N.Y., will appear with Sanders on Saturday in Queens, N.Y., at a ‘Bernie’s Back’ rally designed to generate excitement for the senator’s campaign following his recent heart procedure. Rep. Ihan Omar, D-Minn., will also endorse the candidate, Fox News confirmed. In addition, CNN reported that Rep. Rashida Tlaib, D-Mich., will endorse Sanders as well. It was not immediately clear if Omar and Tlaib will appear at Saturday's event. … The endorsements would be a significant blow to the campaign of Sen. Elizabeth Warren…”\n\nSteyer spending stupendous - WSJ: “Billionaire Tom Steyer appeared on the Democratic presidential debate stage for the first time Tuesday night, but voters in early states have already seen him on TV thousands of times. Mr. Steyer, who new federal filings show has poured nearly $48 million of his own money into his long-shot bid, is dominating television screens in the first four states that will hold nominating contests early next year. Since entering the race in July, Mr. Steyer has spent more than $26 million on TV ads, airing more than 53,000 spots in markets that reach Iowa, New Hampshire, South Carolina and Nevada voters, data from ad-tracking firm Kantar/CMAG shows. All told, that is more than six times as many as the rest of the Democratic field combined.”\n\nTHE RULEBOOK: DEMOCRACY AND CHILL \n\n“Where the whole power of the government is in the hands of the people, there is the less pretense for the use of violent remedies in partial or occasional distempers of the State.” – Alexander Hamilton, Federalist No. 21\n\nTIME OUT: AN INVENTOR’S SLAP SHOT\nSmithsonian: “Invented by Frank Zamboni, the eponymous ice-clearing machine celebrates its 70th anniversary this year. He applied for his first U.S. patent in 1949, for this innovative idea that totally transformed winter sports by giving chopped-up ice surfaces a fresh-frozen smoothness in a matter of minutes. ‘At the time, he was just trying to address a need of his,’ says Frank Zamboni, the inventor’s grandson and now president of the Zamboni Company. ‘He saw a need for the ice rink he owned with his brother and cousins… Instead of taking 1 1/2 hours to clean the ice, that was time somebody could be paying to skate on it.’ Contrary to popular belief, the Zamboni machine was not invented in Canada—the place of snow and ice—but in Southern California—the land of sun and fun. … As time went on, he saw a need to quickly clean the ice, so he started improvising with war-surplus equipment.”\n\nFlag on the play? - Email us at HALFTIMEREPORT@FOXNEWS.COM with your tips, comments or questions.\n\nSCOREBOARD\n\nDEMOCRATIC 2020 POWER RANKING\nBiden: 28.2 points (↑ 0.8 point from last wk.)\nWarren: 26.4 points (↑ 1.4 points from last wk.)\nSanders: 13.4 points (↓ 1.2 points from last wk.)\nButtigieg: 6.2 points (↑ 0.6 points from last wk.)\nHarris: 4.4 points (↓ 0.2 points from last wk.)\n\n[Averages include: Quinnipiac University, Fox News, IBD, Monmouth University and NBC News/WSJ.]\n\n\nTRUMP JOB PERFORMANCE \nAverage approval: 42.2 percent\nAverage disapproval: 54 percent\nNet Score: -11.8 percent\nChange from one week ago: ↑ 0.4 points\n\n[Average includes: Gallup: 39% approve - 57% disapprove; Quinnipiac University: 41% approve - 54% disapprove; Fox News: 43% approve - 55% disapprove; NPR/PBS/Marist: 45% approve - 51% disapprove; NBC/WSJ: 43% approve - 53% disapprove.]  \n\nWANT MORE HALFTIME REPORT? \n\nYou can join Chris and Brianna every day on Fox Nation. Go behind-the-scenes of your favorite political note as they go through the must-read headlines of the day right from their office – with plenty of personality. Click here to sign up and watch!\n\nPELOSI STILL NOT BITING ON IMPEACHMENT VOTE\nPolitico: “Speaker Nancy Pelosi and Democratic leaders will hold off on a full House vote authorizing an impeachment inquiry into President Donald Trump, according to multiple lawmakers and aides. Democratic leadership sources caution, however, that the decision could be ‘reassessed at some point.’ The move came amid opposition from key chairmen and members of leadership, as well as a number of centrist Democrats facing tough reelection bids. Trump, White House officials and Republicans on Capitol Hill have seized on the absence of such a vote as an unacceptable break with House precedent and have vowed to resist what they describe as an illegitimate probe. But Democrats defended their current impeachment process, which has multiple House committees interviewing witnesses in private and gathering evidence related to allegations that Trump and his personal lawyer, Rudy Giuliani, pressured Ukrainian officials to begin an investigation into former Vice President Joe Biden and his son — potentially at the risk of losing U.S. military aid.”\n\nGallup: Majority now supports removing Trump from office - Gallup: “Public opinion on whether Trump should be impeached remains mixed, but Americans now lean slightly more in favor of impeachment and removal from office compared with where they stood in June. Currently, 52% say Trump should be impeached and removed from office, while 46% say he should not be. This is roughly the opposite of what Gallup found in June when asked in the context of special counselor Robert Mueller's investigation.”\n\nStaffers fear White House seeking scapegoat on Ukraine call - NYT: “President Trump has for weeks sought to unmask the whistle-blower who shed light on his Ukraine dealings. But instead aides have fixated on one another: Advisers began a fact-finding review that some fear is a hunt for a scapegoat, according to White House aides and other people familiar with it. Even as the impeachment inquiry intensifies in Congress, White House lawyers are leading their own review, the people said. They are seeking to understand White House officials’ actions around Mr. Trump’s July 25 call with President Volodymyr Zelensky of Ukraine, which is central to the whistle-blower’s allegation that Mr. Trump abused his power. The lawyers’ inquiry centers on why one of their colleagues, the deputy White House counsel John A. Eisenberg, placed a rough transcript of the call in a computer system typically reserved for the country’s most closely guarded secrets. Mr. Trump later directed that a reconstructed transcript be released amid intensifying scrutiny from House Democrats.”\n\nMulvaney emerges as key figure in impeachment probe - WaPo: “In late May, acting White House chief of staff Mick Mulvaney organized a meeting that stripped control of the country’s relationship with Ukraine from those who had the most expertise at the National Security Council and the State Department. Instead, Mulvaney put an unlikely trio in charge of managing the U.S.-Ukraine account amid worrisome signs of a new priority, congressional officials said Tuesday: pressuring the fledgling government in Kiev to deliver material that would be politically valuable to President Trump. The work of those ‘three amigos,’ as they came to call themselves — diplomats Gordon Sondland and Kurt Volker, plus Energy Secretary Rick Perry — has come to light in recent days through newly disclosed text messages and the testimony of government witnesses appearing before an impeachment inquiry in Congress.”\n\nBEVIN RECOVERS IN KENTUCKY POLL\nWYMT: “The Mason-Dixon Kentucky Poll was released early Wednesday morning, and the results are interesting. The poll shows that statewide, 46 percent of likely voters support Republican Governor Matt Bevin, while 46 percent back Democratic Attorney General Andy Beshear. At the beginning of the year, Beshear held a 48 percent-40 percent lead over Bevin, but the incumbent has pulled into a tie with his challenger. One percent of respondents voted for Libertarian nominee John Hicks, while seven percent were undecided. The poll also shows Bevin's GOP support grew from 67 percent in December to 77 percent. He is pulling in 22 percent of Democrat respondents for the cross-over vote, while Beshear is drawing 15 percent from Republicans. Among the Mason-Dixon poll participants, Bevin led among men, older voters and rural voters. … The poll credits some of Bevin's resurgence to President Donald Trump's popularity in Kentucky and resistance to his impeachment.”\n\nSecond debate was heavy with personal attacks - Louisville Courier Journal: “Republican incumbent Matt Bevin and Democratic challenger Andy Beshear had their ugliest public exchange Tuesday at the second gubernatorial debate of the fall campaign. Throughout the discussion, hosted before a raucous crowd of supporters on the University of Kentucky campus, the two rivals called each other liars and regularly interrupted one another as they were peppered with policy questions. When moderators asked about ways they would encourage students to pursue a career in public education, including the state's colleges and universities, the conversation took a turn into the gutter. … The high stakes debate touched on health care, pension reform, medical marijuana and supporting out-of-work coal miners. But it underscored how Kentucky's race for governor this year is defined by Bevin and Beshear's enmity as much as their deep differences on tackling the state's woes.”\n\nPLAY-BY-PLAY\nPoll shows high confidence in Supreme Court - Annenberg Public Policy Center\n\nAUDIBLE: THANKS?\n\n“[Amy Klobuchar] had some smart answers. I’m starting not to care that she is brutal to her staff.” – Larry Sabato, director of the University of Virginia’s Center for Politics, writing in Politico about the Democrats’ debate.  \n\nFROM THE BLEACHERS\n\n“If Trump is impeached and the Senate is mad at him, votes him out, then the GOP could have a primary too. That would take up a lot of news from the Democrats. I think we need a law for 6 months of elections, period.” – Karen Morrow, Tampa, Fla.\n\n\n[Ed. note: It would be a comfort to have such constraints, it’s true. But our Constitution just wouldn’t allow for it. The government can’t tell people when they can talk about issues, therefore there’s no way to keep candidates from campaigning and reporters from reporting. I’m increasingly in favor, though, of doing away with primary elections. Our 40-year experiment with them has been a miserable bust and has unnecessarily prolonged our election calendars. Bring back conventions and spare the American people!]\n\n\n“I have pretty much come to the opinion that two things will happen…one, the 2020 election is not going to be over on election night (owing to huge court battles to follow many very close races) and…two, at some point our Agitator-in-Chief is going to leave office of his own volition…having become tired of the battle and wanting to go back to his business dealings and such. What say youse (that’s a Michigan (born & raised there) UP term)?” – Rick Randell, Bradenton, Fla.\n\n\n[Ed. note: I say that I know better not to say, Mr. Randell! I think there are lots of potential scenarios for 2020 that could still be in the offing. We may yet see a landslide or even, dare I say, a political realignment. As for Trump leaving early, it’s pretty hard for me to fathom. I doubt he’d give his enemies the pleasure.]\n\n\n“I miss Chris’ input during events like the debates on Twitter. I understand why he left, and it is best for his happiness. But there were so many Whhhooo Doogie moments last night, I would have loved watching it with him. But since I have found Fox Nation I can see his more candid takes on the events of the day. I just cannot interact with my clever comments! I would love to have him join The Dispatch so he could participate in the discussion groups. I will send them a note to suggest his inclusion! Thank you for being so glorious. (Sorry about the Cardinals, but Charles is happy!)” – Polly Barrett, Waco, Texas\n\n\n[Ed. note: Who needs an agent when he has Polly Barrett?!]\n\nShare your color commentary: Email us at HALFTIMEREPORT@FOXNEWS.COM and please make sure to include your name and hometown.\n\nSLÁINTE, MR. BRADLEY\nHuffPo: “A man in Dublin, Ireland, decided to inject a little humor into his funeral Saturday by playing a prank on his loved ones. Shay Bradley, a Defense Forces veteran who died Oct. 8 ‘after a long illness bravely borne’ according to his obituary, shocked then delighted funeralgoers when they suddenly heard his voice shouting from his coffin as it was being lowered into the ground. ‘Hello? Hello. Hello? Let me out!’ stunned attendees heard in a prerecorded message that also included ‘knocking’ against the coffin’s lid. … Those at the funeral can be seen giggling and wiping away tears as Bradley’s voice begins to sing: ‘Hello again, hello. Hello, I just called to say goodbye.’ His daughter Andrea Bradley told HuffPost that her father recorded the audio about a year ago — and that no one really knew about it other than her brother Jonathan and her nephew, Ben. Two days before Shay Bradley’s funeral, Jonathan Bradley decided to tell his mom and the rest of his siblings about the prank. He told them that playing the audio at the funeral was his dad’s dying wish.”\n\nAND NOW, A WORD FROM CHARLES…\n\n“My non-baseball friends are forever puzzled by my devotion to the game. I agree entirely with them about the irrationality of fandom. … It’s ridiculous. Yet when the hometown Washington Nationals win, my mood brightens. Can’t help it.” – Charles Krauthammer (1950-2018) writing in the Washington Post on April 21, 2016.\n\nChris Stirewalt is the politics editor for Fox News. Brianna McClelland contributed to this report. Want FOX News Halftime Report in your inbox every day? Sign up here.",
      "date": "3 days ago",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    }
  ]
}