{
  "articles": [
    {
      "title": "Hillary Clinton rages against President Trump in commencement speech",
      "url": "https://www.foxnews.com/transcript/hillary-clinton-rages-against-president-trump-in-commencement-speech",
      "subtitle": "Hillary Clinton rages against President Trump in commencement speech",
      "author": "",
      "content": "This is a rush transcript from \"The Five,\" May 30, 2019. This copy may not be in its final form and may be updated. JESSE WATTERS, HOST: Hello, everybody. I'm Jesse Watters, along with Katie, Juan, Dana, and Greg. It's 5 o'clock in New York City, and this is “The Five.” President Trump fired up and tearing into Robert Mueller, the president ripping the former special counsel to shreds after his first public comments on the Russia probe. (BEGIN VIDEO CLIP) DONALD TRUMP, PRESIDENT: It was to me the same as the report. There's no obstruction. There's no collusion. There's no nothing. It's nothing but a witch hunt. This is a witch hunt by the media and the Democrats, they're partners. I think he's totally conflicted. I think Mueller is a true never-Trump-eer. He's somebody that dislike Donald Trump. He's somebody that didn't get a job that he requested that he wanted very badly and he was appointed. And despite that, and despite $40 million, 18 Trump haters including people that work for Hillary Clinton and some of the worst human beings on earth, they got nothing. It's pretty amazing. (END VIDEO CLIP) WATTERS: Trump's blistering condemnation of Mueller comes as Democrats and the media are ramping up their impeachment push. (BEGIN VIDEO CLIP) UNIDENTIFIED MALE: To impeach or not to impeach? That is the question now confronts House Democrats. UNIDENTIFIED MALE: Prepare for impeachment that's what I told my colleagues. UNIDENTIFIED FEMALE: The Democratic control Congress will have no choice but to open an impeachment inquiry into President Trump. UNIDENTIFIED MALE: I believe that the president obstructed justice and I would vote to impeach. UNIDENTIFIED MALE: Act now or lose our democracy forever, and the only method that we can do that is for our representatives in Congress to begin impeachment proceedings. UNIDENTIFIED MALE: It sounds like the special counsel is calling for Congress to pick up where he left off. That process has a name, it begins with the letter I, Impeachment. (END VIDEO CLIP) WATTERS: Trump shooting down all the impeachment talk, though. (BEGIN VIDEO CLIP) TRUMP: I don't see how they can, because they're possibly allowed. Although, I can't imagine the courts allowing it. To me, it's a dirty word, the word impeach. It's a dirty, filthy, disgusting word, and it had nothing to do with me. So I don't think so, because there was no crime. You know, it's a high crime and, not with or, or, it's high crimes and misdemeanors. There was no high crime and there was no misdemeanor. How do you impeach based on that. The whole thing is a scam. It's a giant presidential harassment. (END VIDEO CLIP) WATTERS: Greg, tell everybody why you're laughing so hard. GREG GUTFELD, HOST: Don Lemon, he's so funny. It begins with the letter I, and you figure it ends there, and he goes impeachment. Oh, Jesus. I thought it was something else. DANA PERINO, HOST: Investment. GUTFELD: Oh, my God, the drama. This is so much fun. It is so much fun. You know, here's a long analogy, let's say you and your spouse have plans to go see her in-laws, right? But she gets a cold and can't go, that's the opportunity when you can fake how badly you wanted to go even though you didn't want to go. You go, but I wanted to see your parents. That's what impeachment is for the Democrats. This is an opportunity for them to say how badly they want it knowing it's not going to happen, because it's not going to happen. So all the small Democrats, the Swalwell's and the Beto's of the world, they can play the theater of really, really wanting it and getting attention, but it's really not going to happen. By the way, so this really isn't Trump's problem, it's a Democratic Party problem. PERINO: Yes, definitely. GUTFELD: Right now -- you guys see Poseidon Adventure? WATTERS: What? GUTFELD: There's a point in Poseidon Adventure where the survivors are deciding which direction to go in the capsized boat, and so they're arguing and then one group leaves and they all die. If they listen to the media, if the Democrats listen to the media they're gonna go the wrong way on the boat. WATTERS: OK. GUTFELD: Impeachment, and they're all gonna perish underwater. WATTERS: Not one of your best analogies -- GUTFELD: I thought it was beautiful, Jesse. WATTERS: No one has ever seen that movie. PERINO: The in-laws one -- WATTERS: The in-laws one was great. (CROSSTALK) WATTERS: And, Dana, I was reading Axios this morning. And to Greg's point, they only did a whip count and found 20 to 30 House Democrats that are supporting impeachment right now. That's not a lot. PERINO: And I think that -- that's why I think that the media coverage of impeachment is way overblown compared to what people really want. And also remember, House Speaker Nick Pelosi is speaker now because moderate Democrats won in swing district, 31 of them, and she's holding the line. Like, she will not be speaker if those people don't win again. WATTERS: Hold the line, Nancy. PERINO: The other thing is -- I think that the question that I would want to ask Mueller, if when did you know that you -- when did you make the decision that you could not indict? And if you had that early on, wouldn't some sort of a smoke signal have been helpful? Because now, unfortunately, I think that it's all muddled. WATTERS: I think he's using that as an excuse because he came to that conclusion after the fact. PERINO: I don't think so -- (CROSSTALK) WATTERS: I also ask him, when did you know there was no collusion? Did you know it before the midterms? But that's why he doesn't want to face Congress or the media because he doesn't want to answer those questions. PERINO: He just wants people to read his report. KATIE PAVLICH, HOST: To pick up on Dana's question about when he knew about not being able to indict, the Justice Department in partnership with the special counsel last night released a joint statement after all of this confusion about the discrepancy between indicting, not indicting, what's allowed under the OLC rules, and it seems like based on the statement they released that there was an agreement almost from the beginning about the fact that you can't indict the president, but that does not preclude you from going and looking and investigating and finding may be co-conspirators or other people that you can indict on other crimes. But based on that statement it seems like there was an agreement very early on that they were on the same page when it came to what the Justice Department regulations said you could do in terms of indicting a sitting president. But on that note, going back to the media, it's like have they not learned their lesson about how they handled these kinds of stories? I mean, they're going to get President Trump reelected. There's a huge risk for Democrats here, not only in losing the House for Nancy Pelosi, but also the political blow back. If they're going to push this so hard in the primary and just drop it off in the general election, it shows that they're not willing to do what they actually said they were going to do, which is the politician speak that everybody is trying to get away from. WATTERS: All right, Juan, you weren't here yesterday, so I will let you take the floor. JUAN WILLIAMS, HOST: You know. I'm just reacting to what I saw today, and what I saw today is the president going after Robert Mueller. So I'm thinking to myself, wait, he can't have it both ways. In one juncture he says no collusion, right, no obstruction of justice, according to the Mueller report. Now he comes out and he says, that Mueller, so prejudice, so much a witch hunt, he hates me, he had a bad business deal with me. You can't trust that guy. He's got all the Hillary Clinton --. You say, wait a second, you a minute ago were citing this man's work, now you're condemning this man. I think you've got a problem, Mr. President. I think you are being contradictory, hypocritical, and it's just like you go off and you attack everybody. And you know, you said something a moment ago, you said, oh, no evidence of any kind of conspiracy. That's not what Mueller said. Mueller said insufficient. And I think this comes back to the fact that so many people were misled by Bob Barr. But even more than that, I noticed today, the reaction from conservative suggests to me that they never read the Mueller report because if they had, they would have known everything that Mueller said yesterday. It's in the report. WATTERS: Juan, if the media is saying the president is a criminal, and he's colluding, and there's a grand conspiracy between himself and the president of Russia, and the special counsel comes back and says there's insufficient evidence to charge anybody with a crime related to conspiracy, isn't that just legally is for no collusion? WILLIAMS: No. WATTERS: OK. WILLIAMS: You know what? I mean, literally, there are -- I think it's a thousand former prosecutors who says, with regards to obstruction of justice, if this guy wasn't president, he would have been charged -- (CROSSTALK) PERINO: We could go out right now and find a thousand other lawyers who say the other thing. I think one of the problems is that the law is vague. The law is -- I mean, the Congress, if you want to have a more clear law, then past one. GUTFELD: Insufficient evidence that I kidnap the Lindbergh baby. It doesn't matter. Insufficient evidence, if that's the end -- by the way, can I use another literary analogy? WATTERS: Please. GUTFELD: OK. The media are like the sirens in the odyssey, right? They're luring sailors to their death. In this case, the media is luring the media -- I mean, luring the Democrats to their death by telling them to impeach. And if the Democrats listen to the media, they're going to end up on the rock, 2020 Trump. WILLIAMS: Let me use an analogy. GUTFELD: All right. WILLIAMS: I think a lot of conservatives are like Donald Trump in Japan hiding the USS McCain, keeping it out of pictures because I don't want a picture -- GUTFELD: Fake news. WILLIAMS: You know what? He's trying to hide from the reality of what he did. (CROSSTALK) WATTERS: Maybe shut that fake news story down. You know what? We've got to go, bad analogy. Next, Hillary Clinton delivers what may be the worst commencement address of all time, the low lights will show you next. And later, it's the big day for us on The Five, our good friend John Rich is here and he's going to be performing our song, shut up about politics. (COMMERCIAL BREAK) PAVLICH: Well, the class of 2019 may have gotten an unexpected torture session from Hillary Clinton, the failed twice Democratic nominee, using her commencement speech at New York's Hunter College to get political, attacking President Trump, the Russia probe, and more, watch. (BEGIN VIDEO CLIP) HILLARY CLINTON, FORMER PRESIDENTIAL CANDIDATE: Our democracy feels far from secure. They banned Muslims from entering the country. And our government is tearing children from the arms of their parents at the border and locking them in cages. Make no mistake. We are witnessing an assault on the rule of law and the foundation of our democracy. What do we do when people in positions of authority are not held accountable? When they defy request from the Congress? When Facebook refused to take down a fake video of Nancy Pelosi, it wasn't even a close call, the video is sexist trash. (END VIDEO CLIP) PAVLICH: So, Greg, Hillary was so brave that she wanted to go after President Trump for 30 minutes but didn't say his name. GUTFELD: Every time she speaks you're reminded how different and irrelevant the typical kind of political oratory has become. It's like when you're listening to her, you just go like -- I think the media is lying that they would have preferred that over Trump, because Trump has made politics interesting for once, she's just old and tired and I mean that, listening to her not as a person. Trump is a gift. He's actually made -- brought peace and prosperity, while delivering volatility in his own personality. So you get the volatility but you get the success and the achievement so you can still enjoy his personality and not feel bad. By the way, she's speaking -- she was asked to speak at a cybersecurity symposium. PAVLICH: Yes. GUTFELD: That's like asking -- I don't know, Michael Moore to speak at weight watchers. It makes no sense at all and I can't wait to hear that speech. PAVLICH: I want to know how much they're paying her. She's speaking at -- she's keynoting the fire-ice cyber defense summit with the world's leading cyber experts. Maybe they can teach her something about that. But, Dana - - GUTFELD: And they're paying her. PAVLICH: Yeah, lots of money, like a half million dollars, right? I mean, come on. But, Dana, you've given advice to graduates before, isn't it really unfair that Hillary Clinton would take away this moment from them, their achievements, to talk about herself? PERINO: Right. Like, so if I was in the audience like I'd might say, oh, gosh, I don't feel very inspired right now. However, a little research, like the graduates that were there they liked it. So I think that -- GUTFELD: They're brainwashed. WILLIAMS: Oh, my God. GUTFELD: They are. WILLIAMS: How about this, they're interested in -- (CROSSTALK) GUTFELD: Their professors tell them what to think. That's how they get their grades. Come on, we know. We know. WILLIAMS: You know what? You're just unhappy. (LAUGHTER) GUTFELD: I'm having a great time. I'm having a great time. WILLIAMS: Mr. Cranky would prefer if those are the clowns is in the White House -- GUTFELD: Wait, you're running? (LAUGHTER) WILLIAMS: I think we have the real one. But I mean seriously, the graduates prefer someone, I think, who would have taken away all of their student debt, right? GUTFELD: Santa Claus. PERINO: Robert Smith. WILLIAMS: Yeah, they would have preferred that. But I don't think there's any question that they're interested in current affairs, they're smart people, they're graduating with a degree, and they want to know what's going on. And you talk about somebody who knows what's going on, it's Hillary Clinton. And to talk about cybersecurity, she may be the greatest victim of cyber security. PAVLICH: Oh, come on, Juan. (CROSSTALK) WILLIAMS: You think there's any doubt the Russians put their finger on the scale to help -- PAVLICH: Hillary Clinton should give a speech at the cybersecurity summit about how to start an illegal server from your basement or your bathroom and how to delete hard drives. I mean, there's a lot she could teach people. WILLIAMS: I wish Trump would give a speech about how we are protecting America against more Russian interference. GUTFELD: I think he's been harder on Russia than any president. WATTERS: Juan, here's how you do it. You don't have some guy hand over the password -- it's password to the hacker, like John Podesta did to Hillary Clinton. Juan, this speech was so bad I don't even think the graduates threw their hats up in the air. They were all falling asleep. And, Dana, I would have to disagree, on Watters' World this weekend, we had a family that was so disgusted with the speech, she went off the rail, he was upset because he paid all of these money to have the daughter go to Hunter College, and she gets up there and totally humiliates herself. He's angry, tune it at 8 o'clock Eastern. And then you know what? She can't read a room either. This is supposed to be inspiring and uplifting, and no one wants to hear -- GUTFELD: It was about her. It was about her. WATTERS: It was about her. And I want to know how much she got paid, because Hunter College, I'd do it for half that price. (LAUGHTER) GUTFELD: I like how you make the phone sign, you know, because they still use the phone. PAVLICH: But, Greg, isn't this the point that, you know, you pay to go to college and then you pay these massive amounts of speaker fees while these students have all these loans, and they're trying to get into the real world, and yet it's hijacked by someone who wants to talk about herself and issues that really are unrelated to -- GUTFELD: I don't see it as hijacking. I think this is completely -- it's exactly what -- it's what they want. PAVLICH: A parent who's paid like thousands -- hundreds of thousands of dollars for your kid to get a degree, and you listen to that -- (CROSSTALK) GUTFELD: What I'm saying is, this has been going on for decades, they have liberal commencement speakers. They have liberal administration. It's just one big liberal love fest. When I see this, it's like -- it's kind of like -- again, you know, it's like being surprised when you find garbage at the dump. PERINO: Well, also, a lot of commencement speakers, and you didn't see it as much this year, but in 2016 in particular, you saw a lot of commencement speakers use it as a chance to make news. It's not like the purpose -- was like, oh, OK. What can you do to get on cable news? And she gives a speech. WATTERS: Here's my theory on why she's still staying in the game like this, she thought the insurance policy against Trump would kick in, he would get impeached, and then she would run in 2020 as the rightful heir to the throne, because she was robbed and then she would restore the Clinton dynasty. That's what -- (CROSSTALK) GUTFELD: She kept her server on a throne. WILLIAMS: I must say, I'm amazed you guys don't say lock her up, because I think that you're still hating on Hillary. (CROSSTALK) WILLIAMS: But I must tell you, those graduates and their parents, they're going to always remember who spoke at that graduation and they're terrifically honored as we heard -- (CROSSTALK) GUTFELD: I also remember my appendicitis. WILLIAMS: You just love hating on Hillary. It's an indication there's something wrong here. PAVLICH: OK. Up next, a foul ball scare at a baseball game raising new concerns about safety protocols. And later, country star John Rich joins us for a very special live performance you don't want to miss. (COMMERCIAL BREAK) WILLIAMS: Oh, boy, it was a terrifying night at the ballpark, Cubs outfielder Albert Almora Jr. breaking down in tears after his line drive hit a young fan in the stands during yesterday's game. The little girl was rushed to the hospital, she's reportedly doing OK. Almora, though, reacting to the scare afterwards. (BEGIN VIDEO CLIP) ALBERT ALMORA JR., BASEBALL PLAYER: As soon as I hit it, the first person I locked eyes on was her. I'm speechless. I'm at a loss of words. Being a father, two boys. (END VIDEO CLIP) WILLIAMS: The incident renewing calls from fans and players for more safety precautions at major league baseball games. (BEGIN VIDEO CLIP) UNIDENTIFIED MALE: Let's just put fences up around the whole field. I mean, it's so sad when you see stuff like that happen. There's a lot of kids come to the games, young kids want to watch us play. I think any safety measure we can take to, you know, make sure that fans are safe, we should do it. (END VIDEO CLIP) WILLIAMS: Katie, you were at the ball game in Washington over the weekend with your pup. PAVLICH: Yep. WILLIAMS: It just strikes me that they put up extra netting over the last few years that cover behind the dugouts to try to protect, but you can't protect everyone all the time. PAVLICH: Yeah. And I mean, you know, the solution to this might be having kids wearing more protective gear when they're going to the game, helmets for example would be may be an option. You don't want to take away from the atmosphere of the game either. So if they fence everything in, it kind of takes away from being at the game and feeling like you can be and in it rather than just watching it on television. And the netting, you know, is a good idea, but it's also prevents you from really engaging with the players. So it is balanced, but obviously when something like that happens it's horrible and awful and people have been killed as a result of these things before. So you kind of have to balance out the risk. But I think when you're talking to parents whose kids get hit with a foul ball, there's not really a lot of room in the middle for negotiation. WILLIAMS: Really. So, Jesse, you know, I think there's a very low probability that anybody is going to get hit by a foul ball at the game, and kids are actually excited to catch a foul ball. PAVLICH: Right. WATTERS: Right. Maybe they should bring their gloves and their helmets like Katie said, but I couldn't even watch this, it makes you feel sick to your stomach. So they should just give this family free tickets for life. That's the only way to solve it. I don't know what you can do about these things, freak accidents happen in life. I'm a freak accident, people have to accept me. There's nothing you can do about it. Other sports there's risk too, golf, someone slices one half of the tee you get hit in the shoulder, I've seen that thousands of times. Or about boxing, sometimes stuff spill out of the ring and there's a melee and someone gets a chair through the mouth. It happens a lot, and that's part of what happens when you go to a live sporting event. Baseball it does happen more than other sports, though. But they've already extended the netting, almost every single team has done that. Perhaps you can extend it more, and I'm willing to have that debate. But you can't have some sort of missile defense system where they can knock out a fly ball or a foul ball the minute it hits the bat. You just have to live with these things. And it's sad, but that's life. WILLIAMS: Man, it's a tough one. You know, Dana, one of the things that struck me was that Albert Almora Jr. had such an emotional reaction as a player. PERINO: Well, I think -- as he said, because he's a father as well. And he also -- he said that he locked eyes with her, so he knew it was going to happen. I do think that in hockey, they extended the protection for people -- WILLIAMS: NBA playoffs. PERINO: Yeah, but it happened a long time ago, but it was because people kept getting hit in the head -- WATTERS: I mean, NASCAR, too. You have like car parts flying all over the infield or the outfield. PERINO: And the thing about MLB, as it's called, Major League Baseball, is that they're trying to figure out a way how do we keep people coming to the game and watching on TV? And so, if extending the netting is something that will keep people coming, because I think that was a good point. People want to bring their families there. You want to take your kids because it's a great American past time. WILLIAMS: It is. Greg, I will tell you a funny story. GUTFELD: Sure. WILLIAMS: Several years back when I was at the Orioles with my wife, and she's a character. So we're sitting there and a foul ball comes screaming in and it bounces into this kid. GUTFELD: Right. WILLIAMS: And the father sitting next to the kid protects himself, not the kid. Now this is -- remember they have a camera on us, right? Elise jump up and start berating the father as a chicken and a jerk for not protecting the kid. I was like, man, what about the kid. GUTFELD: But from an evolutionary standpoint, the father was protecting himself knowing that he would be important later in life for the child. (CROSSTALK) GUTFELD: You know what? I'll let you get hit by the ball, because later I've got to pay for your college education and the speech by Hillary Clinton, which is why Trump needs to be impeached? Guess I'm not worked up about this, am I an awful person? PAVLICH: No. GUTFELD: I'm not an awful person for saying that. The odds of this happening are so low. It's why you take the risk. You assume the risk when you enter the stadium. You have a greater chance of a fatal car accident on the way to the game than getting fatally beamed by a ball. And like you said, every time this happens in a lot of sports, there's a lot of other interesting stories about sports that we should be covering. WATTERS: Like, I was researching this topic for the show, 2014 Statistical Analysis by Bloomberg, said that approximately 1,700 fans per year are injured at major league baseball. GUTFELD: Wow, by what though, did they say? WATTERS: It didn't say. It didn't go that deep into the survey. But, I mean, baseball - you get hit by a foul ball, I mean, does happen. GUTFELD: Yes, it does. PERINO: But I don't go. (CROSSTALK) PERINO: I actually am afraid, because I am always talking, I am not paying attention. I'm afraid. WILLIAMS: No, no. GUTFELD: But you are a tiny target. PERINO: So was the kid. GUTFELD: Well, you're smaller. WILLIAMS: No, no. And besides you would be, as you told me, in a box. GUTFELD: Yes, you would be in a box. Yes, exactly, surrounded by -- PERINO: --the box. GUTFELD: --your entourage would take the hits. They would dive in front, the ball would hit him in the face, then you just hire another intern-- WILLIAMS: Yes. PERINO: --for your dirty, dirty world. WATTERS: Stop now. WILLIAMS: You know what, Greg, more people are hurt by the Poseidon Adventure. GUTFELD: That is true. WILLIAMS: A data is in, Twitter is making you dumber. The new details ahead right here on THE FIVE. Stay with us. (COMMERCIAL BREAK) PERINO: Whoever thought going on Twitter does you more harm than good, now there's scientific proof. A new study shows Twitter is eroding your intelligence. Researchers say indulging in hashtags likes and retweets on the popular social media platform actually has a detrimental effect on learning. This comes as no surprise to you, Greg? GUTFELD: You know, now I know I want to be Pro Twitter when this study has come out, because I know this study probably wasn't well done. However, I don't think it makes you dumber. And I'd say - I'm a broken record. It just accentuates the lesser parts of you. So if you're vain, you're more vain on Twitter, if you're insecure and you're needy and you're looking for attention then that's accentuated. Every weakness that you have is accentuated. I don't have any weaknesses, therefore on Twitter I'm pretty good. I say before, everybody that I like, I like less on Twitter. PERINO: Fair. Is that why you told Jesse to get off Twitter? GUTFELD: Yes, I could. I was like I really need this. WATTERS: He couldn't afford to like me any less. PERINO: I find that I like being pointed to articles that I might not have otherwise found-- GUTFELD: Exactly. PERINO: --my own. GUTFELD: You're good schemer. PERINO: I think that helps, then it's a good way to look for breaking news. But I do - I can kind of understand, it's like the first thing you're always scrolling for the new thing, Jesse. WATTERS: Yes, it's like speed dating like you got to go deeper, OK. You can't just scroll headlines. You're not absorbing anything. You got it like take someone out to dinner, meet them, spend a little more time. PAVLICH: Stop, stop. Stop there, please. That's enough. WILLIAMS: I thought that was better than Presidion analogy. Also, I'm going to delete my Twitter, because I can't afford to dumb myself down. I have to keep up with Juan half the time and we need to stay alert. But you're already hurting your eyes by looking at the screen. You're hurting your posture, it's already making you angry and it also can get you fired. GUTFELD: Yes. WATTERS: So there's a lot of inherent risk. It's like going to a baseball game. WILLIAMS: Yes, you can hit me. PERINO: Do you think, Katie, that Twitter helps at all for like enhancing a reputation? PAVLICH: Well, a reputation? I think it can help depending on the way that you use it for brands to increase their reputation or to use it in a certain way. It's a tool, right. So if you use it bad way, it's a tool, it is bad. If you use it in a good way, it can be beneficial. I think the reason why they're saying that it substantially undermines your intelligence is because it requires a knee-jerk reaction to information, so you're not really diving in and thinking about the consequences of what you're responding to, it's emotional. People are saying things that they wouldn't say to you in person, they'll say it online. So, I think, just like anything else, it's a tool, can be used for good or bad. PERINO: So this study, Juan, basically it said that it - Twitter reduced performance on the test by about 25 to 40 percent of standard deviation from the average result. WILLIAMS: Yes, and I think, again, I think we're all in agreement here. I think that you have less likelihood to really think about what's in front of you. You're skimming. You're having quick emotional reactions, as Jesse said. And to me, a lot of this has to do with people who are distracted or lonely. And so you're just looking at Twitter, it's just something like to eat up your time to make you feel connected. And this is the primary illusion of social media in our age. I think that it makes you feel like you're really connected to what's going on, what's happening. In fact, you are more disconnected from what's going on. You're not engaged with real people. You're not engaged with real ideas, the challenge the way you think and what you're saying. You get locked into your bubble - maybe even more than a bubble, it's like a jail cell, because you're - on Twitter you're following people who oftentimes are of like mine. And I don't think that helps you to grow or to think differently or to come to an insight. PERINO: They said that, Greg, that the decline was sharpest among higher achieving students, including women. Do you believe that? GUTFELD: So it's sexist. Twitter is sexist. PERINO: There you go, now we can delete it. GUTFELD: But - yes. But to Juan's point, it's an illusion of social interaction that replaces real interaction. So it's actually - what do you call that when it's like a double - it's a double cost? It's like you're wasting time, but you're also losing something. There's a word for that. PAVLICH: The opportunity cost. GUTFELD: Opportunity cost. PAVLICH: It looks like you are gaining something with opportunity. GUTFELD: That's very good. PAVLICH: So, I think it's a different word. GUTFELD: No, I think opportunity cost is what I was looking for. PAVLICH: OK. WILLIAMS: But I think the hard part for me is that you are - you think the illusion is, I know what's the latest. I know what's going on. PAVLICH: I know people and I have all these friends. WILLIAMS: But you don't. PERINO: There is this total disconnect about - just go back to politics for a second, that you see these polls showing, Biden in is way up in the polls and I was, like, but actually that's not what it says on Twitter, because Twitter is now reality. GUTFELD: Yes, Twitter will shout impeach. PERINO: Yes. And - right, that's a great callback to the A Block. GUTFELD: Right. Well, thank you. Well, you know, it's a lot like the Poseidon Adventure. PAVLICH: But you also see that the study is on social media that people who spend a lot of time there interacting with other - people can't interact in person anymore. So like Millennials and younger generations have a very hard time making a phone call or-- GUTFELD: Especially the people that keep tweeting about their dog, because what happens is they lose sight. PAVLICH: Those are the ones that get the most likes. GUTFELD: Yes, yes. This is repetitive nature of seeing this dog, just makes you - you just hate dogs. PERINO: That's fake news. WATTERS: Yes, every topic, he's going after you. PERINO: Oh, really. Was that about me? WILLIAMS: No. WATTERS: Oh, no, not about you at all. PERINO: I thought that was about Jenna Goldberg (ph). All right. Let's shut about politics. A good friend, John Rich, he's here to perform the song you've been waiting to hear. It's next on “The Five.” (COMMERCIAL BREAK) GUTFELD: All right. Politics can ruin anything - a dinner party, a holiday meal, California. Politics sucks, especially when it sneaks into places where it shouldn't be. Now politics can be helpful for it's a method to debate ideas, rather than pickup clubs and beat each other to death. All the energy once reserved for violence gets detoured into arguments, it's ugly but necessary. But decades ago our reliance on politics got out of hand, when the Left announced that the political was now personal and vice versa. Now politics rears its ugly face at football games and superhero movies and award shows and we're sick of it, which is why “The Five” teamed up with country music star John Rich to write a song with one piece of advice \"Shut Up About Politics\", because politics is only great if you keep it in its box, separate from all the other fun stuff in life. Politics is great in “The Five,” but not at the baseball game, so \"Shut Up About Politics\". It may be the greatest political song ever made, because we're hoping it will be the last political song ever made. So John you're here. JOHN RICH, COUNTRY SINGER: Here, here. GUTFELD: Thank you. Thank you very much. How important was my input in this song? RICH: Wow, it was it was critical, I would tell you. We had the chat about, it would be fun to come up with a song when you guys came to Nashville, and you said I'll send you some ideas. And so I get your e-mail and it was about I think 37 or 38 paragraphs of a classic Greg rant, and I went through it and I remember I called you, because I didn't want to offend you. I'm like you know songs are generally only about this long. Yes, I know most of it ain't any good, just pick the stuff you like and let's go. And you had some really good lines and \"Shut Up About Politics\" was in there. GUTFELD: Yes. RICH: And so I pulled that one out and then built this song. WATTERS: So does he really deserve a writing credit if you just use one line from five pages? Given this guy the biggest ego, he is walking around with the guitar done the halls. He thinks he is Hollywood. I mean, what have you done? RICH: Probably created a monster. WATTERS: You've created a monster. RICH: But there in, maybe we should do an entire record because honestly a lot of times opposites attract like that - you never know, you might just don't with some other-- PERINO: So we came to Nashville, we recorded the song and it was so fun, and you're going to sing it for us in a moment. But did - was there any buzz around Nashville about how great this song was? RICH: Yes, there was a buzz in Nashville that you guys were in Nashville. I mean, that was-- GUTFELD: No, Greg was just buzzed and that's-- RICH: Greg was buzzed in Nashville. It was cool to have you guys there. I mean, you saw there downtown, how many thousands of people showed up to watch THE FIVE. PERINO: Yes. RICH: --downtown. It was pretty incredible. A lot of a lot of energy. PAVLICH: This song is for a good cause though, it's not just for Greg. Right? RICH: Right. GUTFELD: Well, I am a good cause. RICH: Well, we thought if we're going to go through this whole process of recording it, why not go ahead and put it up online where people could download. It's 99 cents and 100 percent of that 99 cents goes to these guys, the Folds of Honor. And what they do is they put kids and spouses through college who either lost that person or they're 100% disabled. And it goes to fund their college scholarships - thousands of their scholarships, so does Redneck Riviera Whiskey. It's something that I've become very involved in, and I think to me one of the most powerful charity organizations out there. WATTERS: Are you personally offended that, Juan, skipped the trip to Nashville, because he didn't want to travel with all of us and partake in the song? PAVLICH: He was on vacation. RICH: Listen, I was looking forward to having you in Nashville. Somebody walked by in the green room, they said hey what happened to the whiskey and that part, I said, \"Oh, Juan, he was-- WATTERS: Juan makes so much sense to this show. (CROSSTALK) PERINO: --there and that was fun. RICH: Yes, Dana, good-- WILLIAMS: Because I have to worry like shut up about politics, I'm wondering if I'm getting a message out. In other words, if you're coming from anywhere, but the far-Right, shut up about politics. PERINO: No, in general, everybody shut up. GUTFELD: No, it's in general. RICH: I actually think what you guys said earlier, talking about politics if you want to watch the news or whatever. But in regular life people have other things that they're thinking about and worrying about - their jobs and their families and wanting to do well for themselves and their families. And politics meant why fight about stuff like that when you go to a baseball game or hang out and do something constructive. And that's kind of what the song means. WILLIAMS: Yesterday, I was talking to some people and they said, \"Hey, hey, why are we - why don't we have to talk about politics? And the other people in the room said, no we want to talk. It's like-- PERINO: I want to hear the song. GUTFELD: Me too. RICH: You want to hear the song? PERINO: Yes. GUTFELD: Yes. WATTERS: Yes. RICH: OK. Let's do it. PERINO: This is “The Five” first, we've never had anybody perform. GUTFELD: Well, I perform every day. PERINO: No, you and Jesse. That's right. Here we go, here we go. RICH: Right. You guys are going to help me with the backs, right? PERINO: Yes, yes, we got it. RICH: Because there is an answer part. Here we go. PERINO: The band is here. RICH: \"Shut Up About Politics\" live on \"The Five.\" Shut up about politics ain't nothing but a big pile of dirty tricks I'm tired of all the fighting and the [EXPLETIVE] fits so shut up about politics You punch left, I punch right we're caught up in the middle of a deep swamp fight some people lie, some people steal But everybody's talking 'bout the great new deal Shut up about politics ain't nothing but a big pile of dirty tricks I'm tired of all the fighting and the [EXPLETIVE] fits so shut up about politics All this fussing and carrying on it's been going on a little too long but I got something to fix us all up take a shot of my whiskey from a big red cup Shut up, Shut up about politics ain't nothing but a big pile of dirty tricks I'm tired of all the fighting and the [EXPLETIVE] fits So shut up, Shut up about politics So Shut up - Shut up about politics So Shut up - Shut up about politics. Live on \"The Five.\" Baby live on \"The Five.\" WATTERS: I always wanted to tell, Juan to shut up. WILLIAMS: There you go. PERINO: Shut up. WILLIAMS: There you go. GUTFELD: All right. Don't forget these song is available to download on music platforms with all proceeds going to Folds of Honor. \"One More Thing\" is up next with John. (COMMERCIAL BREAK) WATTERS: Welcome back to “The Five” the song, \"Shut Up About Politics\" written by John Rich and THE FIVE, not just Greg Gutfeld, is blowing up the charts. Apparently what is it? PAVLICH: It's #21. GUTFELD: Already? PAVLICH: Yes. WATTERS: Its #21 on iTunes, so everybody go right now-- GUTFELD: You know what the means? 21, that means you can drink. RICH: Here you go. WATTERS: Download the song, and again all the proceeds go to-- RICH: Let's take it to #1. WATTERS: Folds of Honor. Let's go to #1. RICH: #1 for Folds of Honor. PERINO: We can do it. We're ahead of Knockin Boots -- WATTERS: That was the highlight of your career, wasn't that? RICH: #1 for Folds of Honor. We're right behind Lady Gaga. Come on guys we can do it. American help us. GUTFELD: Suddenly I regret this whole thing about charity, because we could make some serious money. WATTERS: What was your famous line about charity? It's the best thing you'll ever do, but you don't get any money. GUTFELD: Yes. You don't get credit. WATTERS: That's right. All right. Time now for \"One More Thing\". I will go first. Work to Ride, I'm a Philly guy, is a nonprofit organization in my hometown, helps improve the lives of disadvantaged inner-city kids through horsemanship and things like polo. OK. And this is one of the participants talking about the program. (BEGIN VIDEO CLIP) UNIDENTIFIED MALE: Work to Ride is a place we go to learn, work hard and feel safe. We work as a team, play as a team and win as a team - on the field and in life. (END VIDEO CLIP) WATTERS: And now Ralph Lauren is sponsoring the Work to Ride situation and they're giving grants directly to fund college scholarships for all of the program's high school athletes. So donateworktoride.net or check out ralphlauren.com. Greg. GUTFELD: Let's do one of these, it's been a while. (BEGIN VIDEO CLIP) GUTFELD: \"Animals are Great!\" (END VIDEO CLIP) GUTFELD: Well, if you think Bret Baier is a great golfer. (BEGIN VIDEO CLIP) GUTFELD: Check out these bears on a green here, helping each other out on a putts. Look at that. I hear their handicap is salmon. Oh, it scared the crap out of him. Speaking of this bear-- WATTERS: Don't go there. GUTFELD: All right, and that I why. (END VIDEO CLIP) (BEGIN VIDEO CLIP) GUTFELD: \"Animals are Great!\" (END VIDEO CLIP) PERINO: John, could help him with a little bit of jingle there? RICH: With Animals are Great? PERINO: Yes. RICH: Yes, we could probably come up with something. RICH: But, honestly, I like Animals are Great! GUTFELD: Yes. RICH: I did write a song for my son's third-grade class the other day in their creative writing called Unicorn Kitty Rainbow Time and so you've got the cup. GUTFELD: Yes. RICH: When you wake up in the morning and you're feeling fine, it's unicorn kitty rainbow time. See, it can be done. PERINO: It can be done. All right, John, get ready for next one. This comes from my dad in Denver, OK? RICH: OK. PERINO: It was all hands on duck from the Denver Fire Department on Tuesday. Truck 28 was on the scene for a morning rescue mission to save five ducklings. They got stuck in a storm drain there. The ducklings got separated from their mom and they fell into the drain, but she was waiting for them on the sidelines, and they all helped him out. And my dad said that to me, because he thought animals are great, and Greg said animals are-- GUTFELD: One question, who foot the bill? PERINO: Well, the momma got all her ducks in a row and they all-- WATTERS: Juan. WILLIAMS: All right. So Casey missed me yesterday. I was in my adopted hometown DC giving the speech for the Rotary Club. (BEGIN VIDEO CLIP) And by the way if you don't know, Rotary is the second largest service club in the world. They help in DC to feed the homeless, host events for wounded veterans at Walter Reed, dictionaries to schools and support the Boys and Girls Clubs. That's me with the President Lisa McCurdy and Donnie Shaw, a Rotary remember who's also leader of the Metropolitan Washington YMCA. And here I am with two of the honorees from yesterday's event. Elias Bahanda Past President of Rotary in Uganda and Marilyn Mamua from rotary Tanzania. Here I am with Marilyn Cruz who heads a program to assist immigrants in DC. Lynn Holec who's the incoming President is also in that picture. Rotary inspiring example of local civic activism. Go Rotary! (END VIDEO CLIP) PERINO: Go Rotary! WATTERS: Go Rotary! GUTFELD: What's the Rotary? PAVLICH: Good job. WILLIAMS: I'll explain it to you later. PAVLICH: Well, we might not be making money of the songs that these two have written, but you can make some money at the airport. (BEGIN VIDEO CLIP) PAVLICH: Did you know that travelers left behind a million dollars in loose change at airport security checkpoints last year that includes $72,000 alone at New York's JFK, LAX had $71,000 in coins and Miami more than $50,000. So you're probably asking, well - right where is this money going? It typically goes to critical aviation security programs which pays for checkpoint maintenance, translation of checkpoint fine. (END VIDEO CLIP) PERINO: But the Trump administration is thinking about diverting it to the wall. WATTERS: The wall. WILLIAMS: Oh, my god. Oh, no. (CROSSTALK) GUTFELD: Open change. WATTERS: John, thank you very much. Excellent performance. RICH: Thank you guys. WATTERS: Set your DVRs never miss an episode of “The Five.” Content and Programming Copyright 2019 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2019 ASC Services II Media, LLC. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of ASC Services II Media, LLC. You may not alter or remove any trademark, copyright or other notice from copies of the content.",
      "date": "May 30",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Hillary Clinton announces the death of youngest brother Anthony Rodham",
      "url": "https://www.foxnews.com/politics/hillary-clinton-announces-the-death-of-youngest-brother-anthony-rodham",
      "subtitle": "Hillary Clinton announces the death of youngest brother Anthony Rodham",
      "author": "Paulina Dedaj",
      "content": " Former Secretary of State Hillary Clinton took to social media Saturday to announce the death of her brother Anthony Rodham. He was 65. Clinton wrote in a post on Twitter that her brother passed away sometime Friday night, although she did not comment on the cause of death. “It is hard to find words, my mind is flooded with memories of him today,” her tweet read. Clinton described her brother a “kind” and “generous” person who is survived by his wife, Megan, and their three children, Zach, Simon and Fiona. “We’ll miss him very much.” Anthony was Clinton’s youngest brother. CLICK HERE TO GET THE FOX NEWS APP",
      "date": "June 8",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "UK gambling site has more bets for Hillary Clinton winning Dem nomination than anyone actually running",
      "url": "https://www.foxnews.com/politics/gambling-site-has-more-bets-for-hillary-clinton-winning-dem-nomination-than-anyone-actually-running",
      "subtitle": "UK gambling site has more bets for Hillary Clinton winning Dem nomination than anyone actually running",
      "author": "Ronn Blitzer",
      "content": " Hillary Clinton may say she is not seeking the 2020 Democratic presidential nomination, but British bettors are apparently not convinced, with one site getting more wagers on her than for any of the declared candidates. U.K. bookmaker Ladbrokes allows people to put money on the race, and according to Matthew Shaddick, head of their political betting division, the former first lady and secretary of state is currently leading the pack when it comes to the number of bets people have made. MARIAH CAREY CALLS HILLARY CLINTON 'PRESIDENT' IN PHOTO OP “We’re baffled, to be honest,” Shaddick told Newsweek. “We’ve taken more bets on her to be the Democratic candidate than any of the other runners.” The site currently has Clinton’s betting odds at 20 to 1, placing her alone in seventh place as far as best odds. That is ahead of most of the people actually running, including Sens. Cory Booker, D-N.J., and Amy Klobuchar, D-Minn., Rep. Tulsi Gabbard, D-Hawaii, and former Texas Rep. Beto O’Rourke. Another former first lady who is not running for president is also getting better odds than some of the people in the race. Michelle Obama currently has odds of 100 to 1, ahead of candidates including New York City Mayor Bill de Blasio, author Marianne Williamson, and billionaire Tom Steyer, who are each at 200 to 1. EX-CLINTON AIDE SAYS SHE WOULD 'ANKLE DIVE' TO STOP HILLARY FROM RUNNING AGAIN Ladbrokes currently has Sen. Elizabeth Warren, D-Mass., as the front-runner with 6 to 4 odds, with former Vice President Joe Biden at 5 to 2, Sen. Bernie Sanders, I-Vt., at 5 to 1, and entrepreneur Andrew Yang, Sen. Kamala Harris, D-Calif., and South Bend, Ind. Mayor Pete Buttigieg at 16 to 1. Of all of them, it’s the 2016 nominee Clinton that Shaddick says would hurt his site the most. “She would be by far the worst result for us—i.e., the one we would lose most money on,\" Shaddick said. \"Hence, her odds have come in from 50/1 to 20/1.” CLICK HERE TO GET THE FOX NEWS APP Nevertheless, he does not understand why people are betting on her. “I've seen some speculation about what might happen if Biden had to drop out for some reason—perhaps that would leave a space for her to occupy in the field?\" Shaddick said. \"Doesn't really convince me as a good reason, though.\"",
      "date": "September 19",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "State Department stepped up Hillary Clinton email probe beginning in August: report",
      "url": "https://www.foxnews.com/politics/state-dept-revived-clinton-email-investigation-beginning-in-august-report",
      "subtitle": "State Department stepped up Hillary Clinton email probe beginning in August: report",
      "author": "Morgan Phillips",
      "content": " The State Department reportedly has ramped up its investigation into Hillary Clinton’s private server, potentially reviving an issue that dominated the 2016 presidential election campaign. The Washington Post, citing current and former U.S. officials, reported late Saturday that as many as 130 current and former officials whose emails found their way into Clinton's inbox have been contacted by investigators. According to The Post, those officials have received letters notifying them that their emails from years ago have been retroactively classified and their transmission could constitute security violations. HILLARY CLINTON CALLS TRUMP 'ILLEGITIMATE PRESIDENT' AND 'CORRUPT HUMAN TORNADO' State Department investigators began contacting the officials around a year and a half ago, then the investigation seemed to fall by the wayside before picking up steam again last month, officials said. Senior State Department officials denied they were acting at the specific direction of President Trump, who is facing an impeachment inquiry led by House Democrats. “The process is set up in a manner to completely avoid any appearance of political bias,” a senior State Department official told The Post. “This has nothing to do with who is in the White House,” said a second senior State Department official.“This is about the time it took to go through millions of emails ...” STATE DEPARTMENT IDENTIFIES 23 VIOLATIONS, 'MULTIPLE SECURITY INCIDENTS' CONCERNING CLINTON EMAILS Several of those questioned, however, told the Post that investigators seemed to be pursuing the matter \"reluctantly, and under external pressure.\" Jeffrey Feltman, a former assistant secretary for Near East Affairs, told the paper he found the recent retroactive classification of more than 50 of his emails to be out of the ordinary. “I’d like to think that this is just routine, but something strange is going on.” CLICK HERE FOR THE FOX NEWS APP Those being investigated will not face criminal prosecution since the FBI investigation of the Clinton email case closed before the 2016 election. The FBI began investigating Clinton's use of a private email server in July 2015 based on a referral from the intelligence community inspector general. In July 2016, then-FBI director James Comey announced he was recommending the case be closed with no charges, saying Clinton and her aides' handling of classified information was \"extremely careless\" but not criminal. Click for more from The Washington Post.",
      "date": "September 28",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Guiliani: I was investigating Hillary Clinton and the Democrats cooperating with Ukrainians",
      "url": "https://www.foxnews.com/transcript/guiliani-i-was-investigating-hillary-clinton-and-the-democrats-cooperating-with-ukrainians",
      "subtitle": "Guiliani: I was investigating Hillary Clinton and the Democrats cooperating with Ukrainians",
      "author": "",
      "content": "This is a rush transcript from \"Hannity,\" September 30, 2019. This copy may not be in its final form and may be updated. SEAN HANNITY, HOST: Welcome to \"Hannity.\" We have so much information it will take the full hour that we will give you tonight. But I promise you, the media mob, the single most repugnant, corrupt, lying group of people in this country with a political agenda for one party, we're going to lay out the truth each and every detail. But the president did absolutely nothing wrong. Nothing. The Democrats, the media, they are just outright lying to you again. Three years of lies, cover-ups, conspiracy theories, and a hoax, they're doing it all over again. And this is from the country, I will tell you this, if you love our country, and I know you do, and this is an all hands on deck moment. This is about our way of life. This is about our system of governance that has been the single greatest system ever created by mankind that has raised the standard of living in the entire world -- life, liberty, pursuit of happiness. You believe in that, the role of law, freedom, our Constitution, our rights, you really need to engage now like you never have been, because they, on the other side, along with their cohorts' unholy alliance, the media mob, the Democratic Party, they're one in the same, because what they're doing is so dangerous, wanting to undo an election at any circumstances, that if they succeed, the American that we inherited will be unrecognizable. As we speak, what is happening, they are attempting to remove a duly elected president from office based on nothing but a manufactured crisis. Now, a second witch hunt, after three years of the first witch hunt. Four investigations, no collusion. Well, they now started another one but this when they are not going to make this a mistake, which is, oh, we're not going to wait three years and then get disappointed in the end, when it doesn't come out the way we thought it was going to come out. This is devoid of actual crimes, misdemeanors, even minor impropriety doesn't exist here and the great irony is that once again, it is the Democrats that are guilty of nearly every single accusation they are throwing at the president you elected that they want to remove from office. It's now a running theme on the left and the media. Everything they accuse the president of, they themselves are guilty of doing. You want clear evidence of a quid pro quo? OK. Look no further than sleepy, creepy, crazy Uncle Joe. He is bragging about it. Now what about Russia collusion? OK. We have Hillary Clinton. You had the dirty Russian dossier with funneled money, hiring an op research group and MI-6, Christopher Steele there. As \"The New York Times\" called it, Russian disinformation from the get-go. And then it was used, of course, to spy on the Trump campaign transition and even the president of the United States, one of numerous ways, this president has had deal with things that no other president has deal with before. Now, it's Ukrainian collusion. In 2016, a DNC -- now, pay attention to this -- a DNC contractor was paid hundreds of thousands of dollars. Why? To pressure Ukraine and Ukrainian officials to dig up dirt on Donald Trump and trash his campaign. And as an added bonus, oh, we do have four U.S. senators, that's right, let's see, Menendez, Murphy, Leahy, oh, and Dick Durbin. They are all on records threatening the government of Ukraine with untold consequences, if they don't comply with their anti-Trump demands and their investigation witch hunt from the Russia issue. Where's all the hysteria over those quid quo pros? Only matters if they can bludgeon Trump. You know, for example, Hillary -- she, yes, paid for Russian lies to influence the campaign. Nobody said a thing after she stole a primary, rig it, after she had rigged investigation that kept her in the race, and she gets the insurance policy. Wow. What about the hysteria over all of those examples of collusion? Only if it's Trump. Only -- you know, where are the I-believers surrounding a Democratic lieutenant governor in Virginia? You know what? What we're watching here is a pattern unfolding, and it's sort of quickening now, and that is they're not going to wait three years. We will just impeach him, A, B -- let's pick it out of a hat. And the mob, of course, supports it with no logic, no facts, no reason. You have to suspend every bit of God-given intelligence and common sense you have to believe there's anything to this. And we'll have all the details about the hypocrisy coming up tonight. Now, we do have Joe Biden's campaign. Well, they want to actually stop Rudy Giuliani from talking, demanding TV executives block him from appearing on shows like ours. By the way, they don't want him exposing the truth about, yes, what Joe did with the prosecutor. Why would a vice president of the United States of America want a Ukrainian prosecutor fired or he's going to withhold $6 billion and, by the way, you only have six hours to do it? That would be a shakedown by Biden, oh, for the reason of -- oh, that's right. He wants to protect his son who had no experience in Ukraine, oil, gas, or energy, and was getting paid a fortune, millions of dollars. And Giuliani, by the way, was also just subpoenaed by House Democrats. This is going to be one of the greatest shows on earth. Can't wait to see that. Rudy Giuliani will join us in a moment. And if Biden would like to defend his actions as vice president, we've invited him on the show. I'll give him a whole week's worth of shows, high showing cable. You can join us right here five nights in a row, Joe 30330. We'll even give him three hours of my radio show. We'll have more on that. But first, we do have major breaking news that is devastating to our national security. Once again, the contents of yet another private phone call between our president and a world leader was leaked this time to \"The New York Times.\" This is now the fourth time, the fourth example, leaking the president's confidential communications with world leaders. Let's see, Australia and then Mexico, and Ukraine, and now, Australia again. Geraldo put it well. This president is being forced to deal with, quote, snitches and rats and backstabbers for three years -- people within our government trying to sabotage, undermine and undo an election. What other president has ever had to deal with this? Think about it. Each day, President Trump now has to work against powerful, unelected deep state bureaucrats that hate him. How does he get to do his job? At what point does this become dangerous, for the entire world if he can't negotiate in good faith with world leaders? What world leader will ever talk to the president and confidence on a phone call? And some of these bad actors now spy on the president's communications and leaking them to the media. It is a massive national security crisis. Who is spying and leaking this information? Calls between world leaders must be some of the most guarded conversations in the White House. World leaders must be able to communicate freely and clearly with our president. That would be good for world peace, negotiation, our economy. But that's never going to happen again. The trust is now forever been broken. The world is less safe because of what these people are doing, abusing the powerful tools of intelligence that we entrust to them keep us safe, not to use as political weaponry against American citizens or an American president. And so far, we have seen links, as I said, Mexico, Australia, Ukraine and yes, now we have another leak with the Australian prime minister. Now, if this is how business is going to be conducted, it's probably time we get the contents of some other people's calls, other presidents. For example, how about Obama's conversations -- I'll have more flexibility after the election? I'd love to hear the after the election calls and the promise he made to Vladimir Putin. Or how about the full transcript of Obama's calls with the mullahs in Iran or President Rouhani that led up to this horrible nuclear deal and him getting $150 billion to, yes, the number one state sponsor of terror that wants to wipe Israel and the U.S. off the map? And while you're at it, why don't we get Biden's communications and phone calls and transcripts of the leaders of Ukraine that he talked to when he was put in charge of Ukraine? And that's when his son got that lucrative deal. Is that what they want? And, by the way, what was the big so-called bombshell development from the most recent leak. All right. Look at \"The New York Times\", President Trump requested the Australian government that they cooperate with the attorney general's investigation into what is the origins of the Russia probe. In other words, a DOJ official is now telling FOX News, the attorney general did as the president to make standard introductions to officials in multiple countries who may have pertinent information in the ongoing Barr- Durham probe. Now, according to the Department of Justice, these requests are not out of the ordinary at all, and so far, the countries have been very helpful without any need for pressure from the White House. And you won't likely hear this from the media mob. You see, this is the part of the story and the Russia witch hunt that they didn't want to pay attention to. Yes, we're going to get the story on FISA abuse and the inspector general's report. We're also going to get the Barr-Durham report at some point, too, and the investigations into the origins of this Russia witch hunt -- incredibly important, nonpartisan investigation. A big piece of the probe surrounds whether or not, let's see, Obama administration, intel people at the highest levels, whether they tried to circumvent United States law, spy on American citizens by simply circumventing the law and outsourcing and subcontracting the illegal surveillance to intel agencies in foreign countries like Great Britain, can you do me a favor? I need information on, oh, President Trump. Italy, do you mind spying on our president? Australia -- yes. All of those countries are being looked into as having done that for, yes, our own intelligence people because legally they can't, so they thought they were being cute trying to get around that law. So, it's pretty clear why the Department of Justice would need to be working with Australian, Italian, and authorities in Great Britain to probe into the origins of a Russia witch hunt as a very real investigation into real serious government abuse of power and corruption. Democrats, the media, they have never told you that story. They don't care about actual crimes. If they did, they would've clearly seen what we did a slam-dunk case, Hillary Clinton committed multiple felonies in the Espionage Act. They would've seen she obstructed justice when she deleted the subpoenaed emails and all the other garbage. They would say that when it says that the top of a FISA application \"verified\", and you don't verify it and you use Russian lies to spy -- to spy on a campaign and then a transition team and then a presidency and then deny another American their constitutional rights, yes, they would've told you that story too. But they, well, conveniently left it out. Instead, the left is totally consumed with hatred for all things Donald Trump. In fact, they have spent only the last three years trying to find some way, anyway, to impeach him. Look at \"NewsBusters\". The mob began calling for impeachment only two days, two days after he got elected. The next 35 consecutive months, guess what, more and more calls for impeachment. Never-ending impeachment, impeachment, impeachment. What it does to the country, they don't care. They care about peace and protecting our country -- they don't care about that either. They care about economic opportunities and jobs and the -- and the economy -- they don't seem to. Take a look. (BEGIN VIDEO CLIP) REP. MAXINE WATERS (D-CA): I will fight every day until he is impeached. Impeach 45. Impeach 45. CROWD: Impeach 45! UNIDENTIFIED MALE: Donald Trump now sits at the threshold of impeachment. REP. STEVE COHEN (D-TN): We're introducing articles of impeachment to remove President Trump from office. UNIDENTIFIED MALE: Given the events of today, the likelihood of impeachment, I'm not saying it's high necessarily, but it certainly went out. REP. TED DEUTCH (D-FL): The Constitution could not be any clearer. Impeachment is the appropriate remedy. REP. RASHIDA TLAIB (D-MI): We're going to go in there and we are going to impeach the mother (EXPLETIVE DELETED). SEN. ELIZABETH WARREN (D-MA), PRESIDENTIAL CANDIDATE: I have called on the House to initiate impeachment proceedings. SEN. KAMALA HARRIS (D-CA), PRESIDENTIAL CANDIDATE: He told us enough to interpret what he said as a referral for impeachment proceedings. REP. ILHAN OMAR (D-MN): It's time for us to impeach this president. REP. JERRY NADLER (D-NY): We are considering what to do about it, including possible voting of the articles of impeachment. HILLARY CLINTON, FORMER SECRETARY OF STATE: There should be an impeachment inquiry opened. (END VIDEO CLIP) HANNITY: We're going to get lectures from her. Any -- anything missing from all this hysteria? No crimes, no misdemeanors, no conspiracy, no collusion, no obstruction. Anger, conspiracy theories, outright lying repeatedly, propaganda, misinformation, slanders, smearing, besmirching, that's what you get from your modern day Democratic, extreme, socialist party, and God forbid, they ever give you your Green New Deal and Medicare for all. This is what they wanted since 2016. Now, Democrats and the mob, they value vengeance above all else. They are so disappointed that there lies didn't become their reality, and their current impeachment hysteria surrounds nothing but what is a nonstory about a perfectly normal telephone call between the president and his Ukrainian counterpart. We now have the transcript. There was no quid pro quo. There was no collusion. There was no misconduct. The United States and Ukraine even have a treaty that allows the two countries mandates that we cooperate in the investigation. Yes, the president was saying, we have all this trouble with our election and you guys were at the center of it. The president, by the way, had this to say about the hysteria. Take a look. (BEGIN VIDEO CLIP) DONALD TRUMP, PRESIDENT OF THE UNITED STATES: This whole thing is a disgrace. There's been tremendous corruption and we're seeking it. It's called drain the swamp. There's been corruption on the other side. It is been corruption like you've never seen. Now, the new president of Ukraine ran on the basis of no corruption. That's how he got elected, and I believe that he really means it. But there was a lot of corruption having to do with the 2016 election against us, and we want to get to the bottom of it and it's very important that we do. Thank you. (END VIDEO CLIP) HANNITY: You've got to read the transcripts. This was a perfectly normal legal phone call, so normal in fact that no leaker or liar, you know, the cowardly Schiff -- he had to make up his own fabricated version of the transcript and perform a dramatic reading during an official hearing. Meanwhile, there are so many unanswered questions surrounding the whistleblower that's not a whistleblower, and the report, and all of this leaking, and the dangers that it imposes to this country and our constitutional governance. Why? So they can push this president out, because as one congressman said back in May, yes, we can't beat him. We probably can only get rid of him by impeach him and that is, you know, all of these questions. Jay Sekulow joins us. He is the president's attorney and he is also the chief counsel of the American Center for Law and Justice. So, I read the transcript -- JAY SEKULOW, PRESIDENT TRUMP'S ATTORNEY: Yes. HANNITY: -- and they are having a pleasant conversation. Ukraine is at the heart of all of this. The president says we need you to get to the bottom of election interference on the 2016 election. SEKULOW: Right. Yes, let me give you a little -- I think it's important for everybody to understand. Let's remember how this starts. Days before President Trump is sworn into office, days before he's sworn into office, there is a change in intelligence information sharing. For eight years, the Obama administration was quite satisfied with it going to just three agencies. With about ten days left, before the transition to a new president, they switched that and allowed it to go to 18 agencies. James Comey also has planted over at the White House and agent from the FBI dual assigned, going back and forth between the FBI and the White House. What was that person's job? Then we have the leaks. Let's talk about these leaks for a moment. You've got conversations starting in the early part of the administration that were leaked by intelligence officials, public conversation -- private conversations released to the public. That's called crime. Then, you have it continuing. Continuing even this afternoon. We're getting more information. So, now, the president of the United States, on phone calls with other heads of states, now has to understand that his phone calls are likely to be leaked to the press. Why are they doing this? Could it be they are doing this because there's an investigation of the investigators going on by Mr. Durham, the U.S. attorney in Connecticut? Could that be the reason that this is all happening? Could it also be the reason, Sean -- and this is how I look at this. You look at what is the rule, regulation, statute that was violated in the conversation that the president had with the president of Ukraine? None. Nothing. Where was the collusion with Russia? Did not exist. Where was the obstruction? Did not happen. Now, it's Ukraine. Well, then, it was, first, it was quid pro quo, but then there was no quid pro quo. Then it was a cover-up except the transcript had already been released. So, you know this is? This is an attempt, a lame one, I have to say, from the Democratic Party right now to placate their leading left-wing people that are actually running this party it appears. But you know who is suffering from this? The president's governing, he's doing his job -- the American people. We do. That the president would be put into a situation where he now has to worry about conversations that he is having with world leaders being leaked to the press. That is not good for our constitutional republic. So, what's at stake here is the very constitutional balance. So, what does Adam Schiff do? He doesn't read the transcript. Why didn't he read it? Because there's nothing to it. There's no problem. What does he do instead? He comes up with a dramatic presentation, a reenactment not based on the actual script. When he had the actual script, because the White House released it. So, what is this? This is a fraud being perpetrated on the American people. And now, we have a pattern and a practice of intelligence officers, people assigned to intelligence agencies, leaking conversations of the president of the United States with heads of state. You know what it puts at (ph)? It puts the entire constitutional framework at risk, and shame on them for what they're doing but here's what's going to happen, Sean. We will find out exactly who's doing what, how it was being handled. Did it start with that initial executive order by President Obama at the end of his administration? What is happening now, we're going to get to the bottom of it. And so, what did they try to do today? They try to subpoena the lawyer. Rudy Giuliani, the president's counsel, my colleague. Nonsense. The information contained in the subpoena is protected by attorney-client privilege. It's outrageous what they're trying to do. I think it's also interesting that they didn't subpoena him to testify. They just want documents. They don't want him to testify because you know what the truth is? He has more information than they do, and you don't put up a witness that has more information than you do. So, I think this is the whole -- this entire matter as a put up on the people and I think that the American people I know are smarter than that, they know exactly what's going on here. And I will tell you this. I've dealt with this with the press all weekend. This -- how is the White House going to react? How's the president's private counsel going to react? You know what? We went through a war with Bob Mueller and we won. This is a skirmish. We don't need a war room. We just we need to respond as appropriate, we will. This will be handled. That's it. HANNITY: Jay Sekulow, thank you for joining us. Let me explain how -- if we go to the \"Politico\" article, please -- the problems for Joe Biden are serious here and especially -- look at \"Politico\", 2017. I have the copy right here. This is -- if you look at it. I've got it right here somewhere. It is July I'm sorry, January 11th and it is in 2017. Let me go back and read from this particular article because this gets to the heart of everything the Democrats are doing and what they have done wrong and what they're going to continue. Look at that. Ukrainian government officials tried to help Hillary Clinton and undermine Trump and by publicly questioning his fitness for office. They also disseminated documents implicating a top Trump aid in corruption and suggested that they were investigating the matter only to back away after the election. They helped Clinton's allies research damaging information on Trump and his advisors. Well, it continues to mount for sleepy, creepy Uncle Joe. Rudy Giuliani is with us, former New York City mayor. I actually would like to see you go and take on Congress because I believe Jay Sekulow, your partner, is correct. RUDY GIULIANI, PRESIDENT TRUMP'S PERSONAL ATTORNEY: I don't have any experience in a courtroom. HANNITY: No. (CROSSTALK) GIULIANI: And I get nervous public speaking and these people are of such intellectual heavyweights, I don't know if I can handle -- handle Schiff. He's such a good actor. (CROSSTALK) HANNITY: But look at this July 11th -- January 11th, while he was still a president-elect, Ukraine admitted they were doing election interference in this country. The president in this call asked them to help get to the bottom of what the media and Democrats said they wanted. They're not doing it. GIULIANI: Sean, you just laid out the reason why I was investigating and the reason why the president of the United States had obligations to ask the president of the Ukraine to follow up on these allegations because there is substantial -- I don't want to exaggerate it but pretty close to overwhelming evidence, including a finding by a Ukrainian court that Hillary Clinton and the Democrats cooperated with Ukrainians with the order coming directly from the White House in January of 2017 to dig up dirt on her political opponent and they did. Vogel and whoever the other person's story was in \"Politico\" -- I bet \"Politico\" regrets printing that actually because now, they're doing everything they can to cover it up. But, in fact, they laid out the reasons why if I didn't investigate it, I'd be guilty of malpractice. You know, they seem to forget that I'm a lawyer. If I were defending a terrorist, they would be going crazy that I was called before a Senate committee. All those civil liberties groups would be saying, right to counsel, how can they intimidate a lawyer, and its fearless pursuit of trying to find justice. I was not involved at any election, anything. This started two years before the election. It started and ended pretty much before the Mueller probe was over. I was still gathering evidence to prove his innocence and, all of a sudden, I realized that there was a frame up, a deliberate one, at the highest levels of our government, and then a colossal pay-for-play scheme at the highest levels of the Obama administration, eerily similar to the Clinton Foundation completely corrupt behavior in which the Clintons sold her office of secretary of state for millions. In this case, Biden sold his office for millions. Is there anybody that believes that Ukraine or China were paying for Hunter Biden's expertise? Or do you have the common sense to realize they were buying Joe Biden's office? And that is very damaging to the United States. Joe Biden was sent to Ukraine to in part deal with corruption and he helped to corrupt the Ukraine. He is a laughingstock. We are because we talk about corruption and this guy puts his incompetent son to work for the most crooked oligarch in Russia? I mean, it is outrageous. The only really sad part of this, Sean, is how much in the tank and how corrupt this media has become. They have corruption staring them in the face and they closed their eyes to it and then they make up charges against President Trump that aren't true. They don't look at this whistle-blower. He is giving them hearsay evidence. The thing is filled with I don't know, I heard it, I overheard. There's not a single time he says, I know. Yesterday, I produced a witness who is under oath. He is willing to give his name. He is willing to testify. Maybe one of our Republicans in the Senate could call him. He is the guy that Biden fired. He is the guy that will testify under oath. He will face Biden and say, you corrupted my country. You got me fired on false pretext and then you had the case against a corrupt company dismissed. And I'm going to tell you one other thing -- Biden's corruption helped to cover up all of the allegations of collusion because there was a company involved run by George Soros which was involved in the investigation, and that was closed down to cut off all of the proof, the additional proof, of just how far the Democrats went in corrupting the 2016 election and in corrupting the Ukraine. HANNITY: Mr. Mayor, the vice president was put in charge of Ukraine. Let's go to the timeline. 2014, it was only months afterward. GIULIANI: Yes, put in charge, corrupt it (ph). HANNITY: His son -- we can find no experience in Ukraine, none. No experience in the energy sector, none. (CROSSTALK) GIULIANI: But he had just been thrown out of the Navy. HANNITY: OK, now -- GIULIANI: Who would pay him millions of dollars to go on a company that had to be reformed, and the kid got thrown out of the Navy after his father pulled strings to get him in? You got thrown out tragically, I guess. HANNITY: So -- GIULIANI: Failing a drug test. But China doesn't pay a guy who fails a drug test millions of dollars, billions, in a private equity fund, and sure as heck, a crooked oligarch doesn't hire a guy who's drug-challenged to be on his board. They bought Joe Biden's office. Wake up, Democrats. You are covering up corruption and by the time this is over, you're going to be the party of corruption. HANNITY: Mr. Mayor, the guy's name is Shokin. He has signed an affidavit under the threat of perjury. GIULIANI: He wants to testify. He wants to stand up -- (CROSSTALK) HANNITY: Hang on, he already has. He's -- we know. He talked to John Solomon. He talked to ABC. GIULIANI: I know. HANNITY: Talked to \"The Washington Post.\" Here's what we do know. GIULIANI: I'm the first one who interviewed him, Sean. HANNITY: OK. So, this is what we know, the vice president -- GIULIANI: I found him. I found him hiding in a cottage because the man is afraid. And if this guy is crooked, he's not good at it. He's got a little cottage. He doesn't have a big Bentley like the phony prosecutor they put on yesterday. He's got a little car and he's scared out of his mind because these people there are dangerous. HANNITY: Why would a vice president of the United States of America use that power, he literally is shaking down demanding in six hours the firing of a Ukrainian prosecutor or he's going to withhold taxpayer dollars whose using our money to shake this guy down in six hours, either fire him -- and it turns out that this is guy that is investigating the company that is paying his son who seemingly has no experience whatsoever -- GIULIANI: Right. HANNITY: -- all of these billions of dollars? And I guess the bigger question here is he got away with it. (CROSSTALK) GIULIANI: And you have to be -- and you have to be -- HANNITY: And how does the media say that is not a pay-for-play scheme? GIULIANI: From the moment you read \"The New York Times\" article in 2015 and you saw that Biden got away with having his son pulling down millions from the crookedest oligarch in Russia, you knew this was going to happen. I prosecuted corruption, Democrats and Republicans. I can smell this. Obama let this happen. When that article appeared in \"The Times\", any honest president would have called his vice president in and said, Joe, what are you doing? I sent you there to straighten out corruption and you have your son who has no capabilities getting millions from a crook in the Ukraine, or they may have said, because \"The Washington Post\" and all of the swamp the media allow us to commit crimes and go after them for nonsense, we can get away with it. And I believe that's true. These people are enabled. That's why yesterday, they actually put out a document demanding that their co- conspirators, the press, silence me, right? Why do you think they're silencing me? Because I'm not making any points? They are silencing me because I showed up with an affidavit yesterday, an accuser who is willing to stand up and point the finger at Joe Biden and say, you're a crook. And I have the proof and I have the documents. And I've got -- the witness will say the corroboration because there are more witnesses where he came from. The American people are fair people and they don't like what they see which is a family, the Biden family, that has been using as an asset for themselves, his public office, going back to his brother who was selling his Senate office when he was a lobbyist in health care. HANNITY: And health care-- GIULIANI: It's scandal after scandal covered up by a compliant crooked press. HANNITY: We will get into the billion five in the China deal-- GIULIANI: The double standard have to add-- HANNITY: --would you testify because I Jay Sekulow is absolutely right. You don't have to do anything. GIULIANI: I don't know I'm weighing the alternatives. All go through it. I'll get all my evidence together I'll get my charts. I don't know if they would let me use video tapes and tape recordings that I have. If they will let me get some of the evidence that I gathered. And I have to tell you Sean, all of this nonsense about I've interfered with the election. I gathered all this evidence before the Mueller probe ended so it was clearly under my responsibility as the lawyer for the President of the United States. The final meeting that the Ukrainians asked for I did in the investigation was over. HANNITY: Look I go to political questions I'll bring it up one more time. POLITICO, January 11th 2017 Ukrainian efforts to sabotage Trump backfired. Key officials are scrambling to make amends with the President-elect after quietly working to boost Clinton. \"The article\" Politico\" they are not concerned Ukrainian government officials trying to help Hillary and undermined Trump to publicly question his fitness for office. They disseminated documents implicating a top Trump aide in corruption suggested that they were investigating the matter. A Ukrainian American operative was consulting for the DNC. He met with these officials in the Ukrainian Embassy in D.C. in an effort to expose ties and et cetera to the Trump campaign. Paul Manafort, Russia, and in the end, the Ukrainian efforts had an impact in the race helping to force Manafort's resignation advancing the narrative. Mr. Mayor, thank you for being with us. Joining us now Senate Judiciary Chairman, Lindsey Graham. Senator, good to see you your reaction to all of this. Why would a Vice President of United State of America hold out a billion dollars and you got six hours fire that prosecutor a Ukrainian prosecutor or you should not get the billion? Why would he ever do that? SENATOR LINDSEY GRAHAM (R-SC): I can imagine if Mike Pence did that you might be hearing all about it but the whistleblower investigation has been sent to the Intelligence Community. We will look at all things Biden. I hope somebody outside of politics would do to the Biden team what they did to Trump. Look at it really hard and see if a crime was committed. But here's what bothers me tonight. This \"New York Times\" article about Barr talking to Australia is the beginning of an effort to shut down Barr's investigation to find out how this whole thing started and let me tell you why. I want to say on national television, Barr should be talking to Australia. He should be talking to Italy. He should be talking to the U.K. to find out if there intelligence services with our intelligence services properly to open up a counterintelligence investigation of Trump's campaign. If he's not doing that, he's not doing his job. So I'm going to write a letter to all three countries and asking them to cooperate with Barr. This is a letter sent by my Democratic colleagues in May of 2018 to the Ukrainians saying that if you don't cooperate with the Mueller investigation, we are going to stop our aid. So here's what I want American people to know. It's okay to cooperate with Mueller to get Trump but it's not okay to cooperate with Barr to find out that Trump was a victim of an out of control intelligence operation. We're not going to have the country like that. HANNITY: Senator, do you believe as I believe of eventually the evidence will show what will probably emerge into a Durham or Barr report at some point that high ranking intelligence officials not the ranking file people that keep us safe every day. In part two issues here, turning the powerful tools of intelligence of the American people that you believe those three specific countries Australia, Italy and Great Britain that there was a specific outsourcing of illegal spying in other words, they sub contracted spying that in order to circumvent American laws. They said we use spy on this person for me. Do you believe that likely happen? GRAHAM: I don't know but I know we are going to find out about that in two weeks and I think Barr should be looking that. But I want to make this point really clear. This \"New York Times\" article is an effort to stop the Barr from looking at how this whole thing began in 2016 regarding the Trump campaign. What are they afraid of? This really bothers me a lot that the left is going to try to say there's something wrong with Barr talking to Australia, Italy, and the United Kingdom. If you're worried about foreign people being involved in our election, you are to be worried about Christopher Steele being hired by the Democratic Party and here's my question. Is this whistleblower, whoever he or she may be, do they have any connection to the intelligence community, the old intelligence community that was corrupt and failed? They are CIA agents out there risking their lives are American patriots. But Brandon and Clapper, I am hoping and praying that somebody will look at the way the counterintelligence investigation against the Trump campaign began was it based on evidence said Papadopoulos was working with the Russians or was it based on stuff coming from countries friendly to us? HANNITY: You know the President, when we were speaking with President Zelensky which were never should be leak, as no foreign leader is ever going to want to talk on the phone again with our President, and we need that to happen for the safety and security. But when the President says I need a favor. We've had these election problems and you guys seem to be in the center of it all and we even have \"POLITICO\" outlining here that they were admitting that they helped Hillary Clinton and they were trying to make amends for the work that they did to sabotage our elections. I thought everybody in the media cared about that but it's only if it's Donald Trump, that's right? It doesn't matter if it's Hillary's dossier and it doesn't matter that its Ukraine is telling us they did it. They influenced our election that there were Democratic operatives that went to them and colluded with them for the purpose of getting damaging information. Isn't that pretty clear in that \"POLITICO\" article to you sir? GRAHAM: Well, it's very clear - a couple things are clear. Democrats wanted the Ukraine to work with Mueller and if they didn't they would cut off their aid. It's clear to me that liberals are starting an attack against Barr to shut him down from going to Italy, Australia, and the U.K.to find out if there was something wrong regarding opening up the investigation into the Trump campaign to begin with. If that's not a double standard, I don't know what would be. So to Attorney General Barr, you are doing the country a great service by trying to find out what happened in 2016 regarding a counterintelligence investigation of the Trump campaign? These countries should be cooperating with Barr. There's nothing wrong with him looking into it. And as a matter of fact, there would be something wrong if you didn't. So I'm a Republican Senator is going to right to these three countries urging them to cooperate with Barr. HANNITY: When are we going to finally get the IG report Senator on FISA abuse because it's funny but it's not because we know that that was an unverifiable dossier and it's a dirty Russian dossier. You know, you think about this. You think okay well they care about election interference. The POLITICO, right here, they talk about what Ukraine did to interfere in the 2016 election? They didn't care about Russian interference with Hillary's dirty dossiers the mob or the Democrats. They didn't care that she screwed Bernie out of a primary. They didn't care that they rigged an investigation she clearly obstructed justice. I think if I'd deleted subpoenaed emails I'd be in deep, deep you know what. So what about the double standard in all of this? GRAHAM: Well, what about whether or not the whistleblower people are around the whistleblower were tied to the folks that opened up the investigation against Trump to begin with? We will see. HANNITY: All right, Senator, thank you for being with us. When we come back, Karl Rove, Reince Priebus, how this \"Inquiry\" is back firing on the Democrats? What impact it will have on 2020? And by the way, New York City is going to find residents if they use the term illegal aliens. I do the show in New York City, at all. They may arrest me while I'm on the show saying illegal aliens. Apparently it's illegal, straight ahead. (COMMERCIAL BREAK) HANNITY: I'm joined by Karl Rove and Reince Priebus. PC culture is running rampant. New York City Comrade De Blasio, New Yorkers can now face staggering fines up to $250,000 for saying illegal alien. If they sense any anger in the way you say it. Trace Gallagher, did I just risked getting fined $250,000 for saying illegal alien which happens to be the actual statutory language all over the country? TRACE GALLAGHER, FOX NEWS CORRESPONDENT: Yes you're exactly right Sean. For context, we should note under U.S. code, illegal alien is the legal and appropriate term for those who are in the country illegally but now New York City's commission on human rights says if you use the term illegal alien to demean or harass a person you face a $250,000 fine. The very saying 250,000 is in place if you call it emigrations and customs and enforcement on someone with a \"Discriminatory motive\" though the new policy doesn't explain how to make a nondiscriminatory call to ICE. The human rights commission has also outlawed criticizing people for their proficiency in English. With the Deputy Mayor of New York saying \"This new legal enforcement and guidance will help ensure that no New Yorker is discriminated against based on their immigration status or national origin\". This, by the way, is the same commission that banned employers and landlords from using gender pronouns other than those preferred by employees and tenants. By the way, if you use the wrong gender pronouns it's a $250,000 fine. Sean. HANNITY: Wow. We are losing the country at all hands on deck as I said at the start of the hour. Trace, thank you. On Saturday, Speaker of the House and name only Nancy Pelosi signaled her willingness to throw caution to the wind and consequences be damned and pursued the President's impeachment. Even if that means Democrats lose the House in 2020. By the way, that is following in the footsteps of the real leader, Ocasio- Cortez. And you know things are bad for Democrats when committing in Bill Maher seems to be the only one making any sense when it comes to Joe Biden's significant serious situation with his son Hunter and the millions of dollars that he got in Ukraine from the guy that's looking into it was the one that was fired with our tax money after he shook him down and then of course we have the whole China issue which we've been covering. Anyway take a look. (BEGIN VIDEO CLIP) BILL MAHER, AMERICAN ACTOR: It's just so - why can't politicians tell their kids could get a job? Get a job. I mean, this kid was paid $600,000 because his name is Biden buy a gas company in Ukraine. The super corrupt country and just add a revolution to get rid of corruption. It just looks bad. It does sound like something Don Jr. would do and if Don Jr. did it, it would be all which were not I was talking about. (END VIDEO CLIP) HANNITY: We all everybody in the media was talking about. Here with reaction, Former RNC Chairman, Michael Buss Law President Reince Priebus. Former Deputy Chief of Staff to George W. Bush, the brain himself, Karl Rove Fox News Contributor and also Former White House Press Secretary now also Fox News Contributor, Sarah Sanders. Karl Rove, let's get your take on this. It's like your white board take. I don't see this working out well especially with the liability of Biden and I see another boomerang coming really quickly and I don't think the media is going to be able to spin out of the Biden aspect of this and blame Trump for what was an innocent phone call. KARL ROVE, FOX NEWS CONTRIBUTOR: Look, Democrats are bent upon impeachment. They're going to make several mistakes along the way they already have. They aren't doing it formally so they are not granting as they have done in all previous impeachments against Presidents and members of Congress and judges, the right of the minority to undertake certain actions, subpoenas, witnesses, so forth. They're going to do it quickly. They left town for two weeks but they are bowing when they come back they're going to do it quickly. And third, they are doing it without - they are going to impeach without creating a bipartisan agreement that this is worthy of being taken to the United States Senate. So look, on the short run, they are going to be on a sugar high and they're going to feel good themselves but I don't think it's an accident that of the 19 Democrats who won seats in 2018, and districts that Donald Trump carried by four points are more than a ten of them have not yet even endorsed the inquiry. Democrats have 19 of the seats that were won by Trump that they flipped that were carried by four points or more. They have 31 seats that were carried by Trump that they flipped in 2018. They have 43 seats that they carried that were previously occupied by a Republican member of Congress that they flipped in 2018. They lose 15 or 16 seats and - should lose 17 or 18 seats and they could lose control of the House by time of the 2020 election. HANNITY: Reince, you look at your State of Wisconsin and the good people of Wisconsin. I don't see the Democrats they've done much of anything except try to impede any progress. They are not going to work on any issues except lies, conspiracy theories, Russia and Russia for nearly three years and now they come up with another witch hunt. How is that going to play in Wisconsin? REINCE PRIEBUS, FORMER WHITE HOUSE CHIEF OF STAFF FOR PRESIDENT TRUMP: It's not and that's a weighed in practice that's a perfect lead-in into what I would like to points are going to be. Number one, similar to what Karl said, the President has a huge simple advantage in this fight. PRIEBUS: The advantage is - is that this is completely partisan? 90 percent of the Democrats support impeachment, the House Committees of jurisdiction are all partisan and the Trump team needs to keep it that way because as all of these details are really important, your show so far going through every one of the details with your guess. But someone also has to be talking about the big picture and in a state like Wisconsin, most people out there, they aren't following all the details, and what is the big picture? The big picture is that the President can't be removed because there are going to be 20 Senators agreeing to removal so what do we have? We have this huge waste of time and this huge waste of money. Nothing's getting done for the American people and going into the election, that's going to be the message of President Trump. So as long as this is what it is, which is just a huge partisan exercise were nothing is actually going to happen, the American people are likely going to see it for what it's worth which is just a big partisan fight that's the disadvantage of the American people and someone, I think it's happening but certainly part of this messaging operation out of the White House and obviously the RNC is doing a great job, has to be on the simple big picture of what this is? HANNITY: Sarah, you dealt with the media, I don't know how you did that job? It's not one I can handle. I don't think I have the temperament for such a job let's put it that way. But look at the medium mob always just a conspiracy? A theory about Joe Biden, let's see. He is on tape bragging about demanding the firing as Vice President of a prosecutor. Six hours or you don't get the billion dollars. He's leveraging our tax dollars. His son, we know, didn't have any experience with Ukraine or energy. He is making an awful lot of money. He is making a lot more in China too that's a separate issue that we've covered. I'm thinking that how does the media just deny reality like this? SARAH SANDERS, FORMER WHITE HOUSE PRESS SECRETARY: It's because they don't like the President. It's real simple. It's sad because it's absurd that the real scandal here is all of the use of the Vice President's Office that Joe Biden took part in helping enrich his family. That's the scandal. President Trump shouldn't be getting impeached he should be getting celebrated for actually draining the swamp and delivering on another one of his campaign promises. If he was a Democrat, the liberal media would be absolutely cheering him on for going after corruption. They would be cheering him on and worshiping him the way that they did Obama because they have a reason to celebrate as President. He's actually getting something done. Something Obama didn't. HANNITY: Exit question one word answer. Does this help or hurt the President in the end? We'll start with Reince, help or hurt? PRIEBUS: I think neither. I think it's a big - I don't think it's an advantage or disadvantage. HANNITY: Help or hurt? ROVE: Hurts the Democrats. It depends on how the President and his team react to it whether or not it helps them but it certainly hurts the Democrats. HANNITY: Last words help or hurt Sarah? SANDERS: I think it helps but hurts the country. It helps the President. HANNITY: All right, thank you both. Thank you all. We will continue. (COMMERCIAL BREAK) HANNITY: All right, the villain of the day, the unhinged Hollywood Actor, kind of has been, Robert De Niro, who again went on a profanity lace rent this time against Fox News and President Trump during his appearance. Jeff Sacher's stenographer, humpty dumpty Ryan Stelter star that he is. The ratings were so big, it's huge. Take a look. (BEGIN VIDEO CLIP) ROBERT DE NIRO, HOLLYWOOD ACTOR: This guy should not be President. UNIDENTIFIED MALE: And when you say that folks on Fox come after you. I member that Tony got up there and cursed. What you know, it's not in FCC violation but it is still a Sunday morning. (END VIDEO CLIP) HANNITY: He does have a history of these violent, crazy and saying anti- Trump remarks you may remember-- (BEGIN VIDEO CLIP) NIRO: How dare you use say the things he does. Of course I want to punch him in the face. NIRO: Today the world is suffering from the real Donald Trump. Come on. Let's gulp it what are we talking about? Let's clap for that, this idiot is the President. (END VIDEO CLIP) HANNITY: Yes, deranged. Let's see, Hollywood, elitists, pampered, hypocrite, spoiled, brat and massive ego with no common sense intellectual honesty at all. We will never be the media mob or anybody in Hollywood. Let not your heart be troubled. Content and Programming Copyright 2019 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2019 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.",
      "date": "September 30",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Hillary Clinton blasts Pompeo, Giuliani over Ukraine fallout on 'The Late Show'",
      "url": "https://www.foxnews.com/entertainment/hillary-clinton-the-late-show-colbert",
      "subtitle": "Hillary Clinton blasts Pompeo, Giuliani over Ukraine fallout on 'The Late Show'",
      "author": "Gerren Keith Gaynor",
      "content": " Hillary Clinton blasted Secretary of State Mike Pompeo and President Trump’s personal lawyer, Rudy Giuliani, Monday night during an appearance on “The Late Show” over their reported involvement in Trump’s controversial call with the leader of Ukraine. While promoting her new book alongside her daughter Chelsea Clinton, the former secretary of state was asked what she thought about the recent Wall Street Journal report that claimed Pompeo was listening in on the call that prompted a whistleblower complaint and a subsequent formal impeachment inquiry. “How many times when you were secretary of state did you have to say to Obama, ‘You can’t extort foreign countries to get dirt on your political enemies?’” host Stephen Colbert asked Clinton, who responded with a loud chuckle. “Yeah, that never happened,” she said. “The secretary of state’s job is to make sure he knows, number one, what the president is going to say on those calls.” GIULIANI SAYS POMPEO WAS AWARE OF HIS UKRAINE OUTREACH “Because you’ve got a president who doesn’t listen to anybody and doesn’t follow instructions whatsoever, I’m not sure they haven’t just given up on trying to give him any sort of preparation,” she added. “I think if the secretary of state was on the call as is now being reported, he should have been one of the very first people to say, ‘Wait a minute, we’ve got to clean this up. You can’t let that stand.’ But we don’t know what he did.” Clinton also slammed “Republican defenders” of Trump who argue the accusations made against him are “hearsay.” GIULIANI WAS NOT WORKING ALONE IN BIDEN UKRAINE PROBE “It was an admission from the White House! I mean, the transcript of the phone call was put out by the White House. And the whistleblower has a depth of understanding that needs to be taken seriously about what happened,” she said. Colbert also asked the former Democratic presidential nominee on her thoughts about Trump “sending Rudy Giuliani out to handle foreign policy,” referring to reports that Giuliani sought damaging information on Joe Biden and his son Hunter Biden from Ukraine officials. Clinton said “That would be a big problem” if it had happened under President Obama. CLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM “Presidents often use—as do secretaries of state—they might use an envoy or a special adviser to deliver a message,” she said. “But again, it is supposed to be carefully thought through. And from what we’ve seen on television, carefully thinking through is not one of Rudy’s strong points.”",
      "date": "October 1",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Hillary Clinton mocks Rudy Giuliani accusation: 'Yes, I am famously under-scrutinized'",
      "url": "https://www.foxnews.com/politics/hillary-clinton-mocks-rudy-giuliani-yes-i-am-famously-under-scrutinized",
      "subtitle": "Hillary Clinton mocks Rudy Giuliani accusation: 'Yes, I am famously under-scrutinized'",
      "author": "Brie Stimson",
      "content": " Former Democratic presidential nominee Hillary Clinton shot back at Rudy Giuliani, President Trump’s personal attorney, on Twitter on Tuesday after he accused her of being “protected and immune” to media scrutiny. “(The Washington Post), NBC, and CNN are going after me because I’m the messenger, and covering up the message, Dem corruption,” Giuliani tweeted about questions over his involvement in trying to get Ukraine to investigate Joe Biden and his son Hunter Biden. “Meanwhile, they have yet to ask Biden difficult questions because he is protected and immune like the Clintons and crooked Clinton Foundation!” STATE DEPARTMENT STEPPED UP HILLARY CLINTON EMAIL PROBE BEGINNING IN AUGUST: REPORT “Yes, I am famously under-scrutinized,” Clinton sarcastically tweeted in response, alluding to the investigation into her use of a private email server as secretary of state that dominated the 2016 presidential campaign, the Benghazi investigation while she was secretary of state as well as others going back to her time as first lady. The State Department expanded its investigation into Clinton’s private server in August. The House of Representatives is launching an impeachment inquiry into Trump’s July phone call with Ukrainian President Volodymyr Zelensky in which he asked Zelensky to investigate alleged wrongdoing by Joe Biden and his son Hunter Biden in the country. CLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM Clinton is scheduled to appear on both “The View” and “The Rachel Maddow Show” on Wednesday as she promotes “The Book of Gutsy Women,” which she co-wrote with her daughter Chelsea Clinton.",
      "date": "October 2",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Hillary Clinton says impeachment inquiry became 'unavoidable' in light of Ukraine call: Trump tried to 'extort'",
      "url": "https://www.foxnews.com/entertainment/hillary-clinton-impeachment-unavoidable",
      "subtitle": "Hillary Clinton says impeachment inquiry became 'unavoidable' in light of Ukraine call: Trump tried to 'extort'",
      "author": "Sam Dorman",
      "content": " Former Secretary of State Hillary Clinton argued on Wednesday that Congress would have engaged in a \"dereliction of duty\" if it didn't pursue impeachment after details surfaced surrounding President Trump's July 25 phone call with the president of Ukraine. \"I think it became absolutely unavoidable when the summary of the phone call came out, plus the whistleblower compliant,\" Clinton said during an appearance in \"The View.\" She indicated that while Trump's other actions were debatable as impeachable, the Ukraine call was more clearly a problem. \"This was in the pursuit of his official duties as president of the United States and that phone call very clearly indicates an effort to not only pressure but in effect extort the president of Ukraine over much-necessary military assistance that had already been passed by the Congress,\" Clinton said. HILLARY CLINTON SAYS HER 'GUTSIEST' PERSONAL DECISION WAS TO STAY IN HER MARRIAGE Her comments follow the release of a rough transcript of the call that Democrats say shows troubling statements by Trump as the United States considered foreign aid for Ukraine. CLICK HERE TO GET THE FOX NEWS APP The transcript showed no explicit quid pro quo for an investigation in former Vice President Joe Biden, although Trump did speak to the Ukrainian president about probing the 2020 front-runner. Clinton appeared on \"The View\" with her daughter, Chelsea, to promote their new book, \"The Book of Gutsy Women.\"",
      "date": "October 2",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Giuliani: Ukrainians brought me substantial evidence of Collusion with Hillary Clinton, other top Democrats",
      "url": "https://www.foxnews.com/transcript/giuliani-ukrainians-brought-me-substantial-evidence-of-collusion-with-hillary-clinton-other-top-democrats",
      "subtitle": "Giuliani: Ukrainians brought me substantial evidence of Collusion with Hillary Clinton, other top Democrats",
      "author": "",
      "content": "This is a rush transcript from \"Hannity,\" October 2, 2019. This copy may not be in its final form and may be updated. SEAN HANNITY, HOST: All right, that's one guess. All right, Tucker, Great show. Thank you for joining us. Welcome to “Hannity.” We begin tonight with a FOX News alert. It's an incredibly busy breaking news night. Now breaking moments ago, we have just obtained, I have it in my hand, a brand-new document from Trump attorney Rudy Giuliani detailing his interview with the Ukrainian prosecutor who was fired at the request of former Vice President Joe Biden. Remember the shakedown with your taxpayer money? Oh, he was corrupt. No, because he was warned, Joe Biden, by \"The New York Times\" and others that his son was being investigated. Now, the State Department's inspector general just delivered these documents to Congress, which revealed that this Ukrainian prosecutor were warned not to investigate the oil and gas giant that was shelling out millions of dollars to the vice president's son. Now, Rudy Giuliani interviewed man. And the prosecutor claiming now for a fifth time that we know of, that his investigation was hampered because of pressure from the Biden-Obama administration, but he was fired because of Obama, a major development and I'm sure the media mob will have nonstop coverage -- oh, that won't happen. It doesn't fit their destructive anti- Trump narrative. But right here on this program, we have so much more on this and other big breaking story. Now, tonight on this show, we will go through and expose the media's biggest lies. They are lying through the entire country. John Solomon will go through it. Don Jr. will weigh on the left's double standard. I wonder how he would have been treated if he were Hunter Biden and Biden's shoes, and his father was the one that use taxpayer money to shakedown a government and fire a Ukrainian prosecutor. We'll also play the president's total beat-down today of the corrupt media. We have extensive coverage of that. We begin also with another development from the swamp. This too breaking only moments ago. All right. The House Intel Committee Chairman Adam the Cowardly Shifty Schiff, he has been caught in yet another insane lie. Now, it's no secret the Cowardly Schiff is dishonest, deceptive, he is a proven liar, nothing but a political hack and operative. He has been proven to lie over and over and over again. We have offered him time on this program, a full hour, I will give him a full week and five days on my radio show. That's 20 hours of broadcasting. But Schiff's most recent lie uncovered in a brand-new report, believe it or not, although they tried to couch it a lot, still couldn't hide the fact \"The New York Times\" -- maybe one of his worst yet -- \"The Times\" now reporting that the Shifty Cowardly Schiff, he got an early account of those so-called whistleblower's accusations. In other words, Representative Adam B. Schiff of California learned about the so-called whistleblower, he's not a whistleblower, and that whistleblower's so-called concerns before he or she filed a complaint. In fact, Schiff's office spoke directly to the future non-whistleblower whistleblower and even recommended that the future he or she hire an attorney, meet with the inspector general to file a complaint, his fingerprints all over it. This is not of real whistleblower, hearsay, oh, I heard it from so-and-so, heard from so-and-so, heard from so-and-so. Yes, that would not be admissible in a court of law, but apparently and not a court of corrupt Democrats who spread lies and conspiracy theories of one hoax after another, they barely miss a beat, hoax to hoax to hoax. And the sleazebags that Cowardly Schiff himself was behind this, quote, nonpartisan, totally legitimate whistle-blower complaint from the very beginning. This can't be the same Cowardly Schiff who from California who actually went on conspiracy television, Area 51, Roswell Rachel's network MSDNC on September 17 and claimed, quote, we have not spoken to the whistleblower. A lie. Take a look. (BEGIN VIDEO CLIP) REP. ADAM SCHIFF, D-CALIF.: We have not spoken directly with the whistleblower. We would like to. But I'm sure the whistleblower has concerns that he has not been advised as the law requires by the inspector general or the director of national intelligence just as to how he has to communicate with Congress. (END VIDEO CLIP) HANNITY: Lying through his teeth, caught yet again. And the Cowardly Schiff, the Shifty Schiff, well, was practically holding the whistle on the non-whistleblower. Keep in mind, that guy -- the same con artist who is now leading the Democrats' idiotic impeachment inquiry, which is totally based on the whistleblower complaint that the Shifty Schiff himself had a hand in creating, clearly, and offering advice to. This is why Americans hate the swamp known as Washington, D.C. -- the leaking, lying, the scheming, the character assassination. All of it from Schiff, a disgusting abuse of power. By the way, he now needs to be investigated. He must be held accountable. We are calling tonight for an independent ethics investigation into the office of the Cowardly Adam Schiff. He must immediately now recuse himself from any impeachment inquiry and it is time that this liar go under oath about his involvement in the phony whistleblower report. Every American who voted, you've got to understand what this is about. You voted for Donald Trump, you are a smelly Walmart shopper like me. I think it's smart to shop at Walmart. I like Walmart, you save money. And you are an irredeemable deplorable and you are a bitter American who clings to their God, bible, religion, Second Amendment rights. You need to understand tonight that corrupt congressman is willing to do almost anything to remove a duly elected president, the president you voted for. His deranged lying, his conspiracy theories, spreading his hoax are now catching up to him. He's not fit to serve in Congress at all, let alone the chairman of this committee, and sadly, what we are seeing is nothing new. It's the same Schiff, different day, play on words. As Congressman Jordan pointed out, this fits his pattern. Schiff seems to have a hand on every a conspiratorial anti-Trump smear brought before Congress. For example, summer of 2018, there was the Shifty Schiff, the Cowardly Schiff, a secret meeting with Fusion GPS founder Glenn Simpson, you know, the guy that Robert Mueller never heard of. At the same time, Simpson, whose firm was behind Hillary's dirty dossier was, of course, an important witness in his committee's investigation into alleged Russia collusion that's been debunked now four times. And Schiff's team, remember? They prepped Michael Cohen for ten hours just before his testimony before his committee on Capitol Hill. Wow. And now, it appears that the Cowardly Shifty Schiff played a vital role in coordinating a second whistleblower complaint. Now, whether it involves Russia, Ukraine, or, I don't know, maybe it'll be the Bahamas impeachment inquiry next, it seems that cowardly Schiff has been plotting the c president's destruction, undermining your vote, lying in the process from the second the president was elected by you, we, the American people. The only problem with his strategy was it was always built on a pack of lies. This is the guy who fabricated a transcript. Remember, he's the guy, you didn't know, he was being, well, pranked, and he thought he was talking to a Russian about Donald Trump that he could use during an election. By the way, it was read out loud in the official committee hearing. You don't remember, what's the dirt on Donald Trump? The naked pictures of Trump, naked pictures. Does Vladimir know? Oh my gosh. Anyway, take a look. (BEGIN VIDEO CLIP) SCHIFF: There is already in my view ample evidence in the public domain on the issue of collusion if you're willing to see it. If you want to blind yourself, then you can look the other way. I can certainly say with confidence that there is significant evidence of collusion between the campaign and Russia. I've been clear the last year and year and a half that there is ample evidence of collusion in plain sight. (END VIDEO CLIP) HANNITY: Four separate investigations, there was no evidence of anything. Lie after lie after lie after lie. Is this good for the country? Now, keep in mind, it was actually the Cowardly Schiff caught on tape colluding with Russia. Yes, does Vladimir see it? But, of course, Vladimir seen naked pictures of Trump. Remember, he was trying to get the naked pictures of Trump. He was being pranked. In other words, doing what he's accused Trump of. But I thought Democrats were really worried about foreign election interference. I guess that only involves fictional claims against President Trump, not the dirty dossier, because if they really cared about collusion or interference, where is, well, the Cowardly Schiff's hysteria over Hillary Clinton's dirty Russian dossier, as \"The New York Times\" finally concluded likely Russian misinformation, disinformation from the start. Where is the this hysteria over the DNC's collusion with Ukraine? After all, quoting the 2017 \"Politico\", look at this, DNC operative pressed the Ukrainian embassy to dig up dirt on Donald Trump for Hillary during the 2016 election. And there is more, look at the same \"Politico\" report. Ukrainian government officials try to help Hillary Clinton and undermine Trump by publicly questioning his fitness for office. They also disseminated documents implicating a top Trump aide in corruption and suggested they were investigating the matter only to back away after the election. They picked the wrong horse. And they helped Hillary Clinton's allies research damaging information on Trump and his advisors. It's that simple. That would be foreign election interference. But, according to a report from \"The Wall Street Journal,\" well, we do have to go Republican senators, not Democrats, who are demanding answers into, quote, the brazen efforts by the Democratic National Committee and Hillary Clinton and her campaign to use the government of Ukraine for the expressed purpose of finding negative information on then candidate Trump in order to undermine his campaign. That would be the exact thing that they quote that Trump has done twice. The hypocrisy is sick. It is frankly destructive and psychotic at this point. You've got the speaker in name only Pelosi, you've got the Cowardly Shifty Schiff, their pals in the media mob ignoring all the real evidence of real collusion. They are putting their agenda ahead of what's truthful, honest, and what the American people should know. Real interference, real government abuse of power, the real weaponization of the America's intelligence system, oh, yes, and then FISA fraud, and spying on a campaign and a transition team and a president, three long years hyperventilating telling us they have the truth one hoax after another, one lie after another, one conspiracy after another, Russia, Russia, Russia. Now, it's Ukraine, Ukraine, Ukraine. Let's take a look. (BEGIN VIDEO CLIP) SCHIFF: The president called on the Russians to help in this campaign by hacking Hillary Clinton's emails. He was using that office as leverage to obtain dirt. Another country manufactured dirt on his opponent. REP. NANCY PELOSI, D-CALIF.: We believe that the president of United States engaged in a cover-up. I think right now, there is a cover-up of a cover-up. SCHIFF: The Russians offered help, the campaign accepted help. The Russians gave help and the president made full use of that help. I do not think we can rely on a country beholden on the good graces of Donald Trump to be able to level with us on this. No one is above the law, especially the president of the United States. The president believes that he is above the law, the law being the Constitution of the United States. SCHIFF: There is already in my view ample evidence in the public domain on the issue of collusion if you are willing to see it. It is very powerful evidence of that kind of potential impeachable offense. (END VIDEO CLIP) HANNITY: See a pattern? It would almost be funny if they weren't trying to circumvent the will of you, the American people, and literally remove a duly elected president from office who is doing an amazing job under the worst circumstances. And smearing the president has been their number one goal from the very beginning. And, by the way, they don't care about improving the lives of Americans, in spite of their lofty, you know, cliched language from earlier today. As the president tweeted: The do-nothing Democrats should be focused on building up our country, not wasting everyone's time and energy on B.S., which is what they've been doing ever since I got overwhelmingly elected in 2016, 223-306, get a better candidate this time. You'll need it. By the way, guys, we have an election in a year. Do you think your ideas are superior, do you think your record is better? OK, let's have it out in the ring called an election. Let the American people decide for once and maybe you guys can put your best candidate forward who wants to spend $94 trillion and eliminate gas, oil, energy, the combustion engine, planes, and cows. Run on that $94 trillion idiocy and the eliminating private insurance, good luck with that. The president continued to fight back against those who want to take him down. Watch this. (BEGIN VIDEO CLIP) DONALD TRUMP, PRESIDENT: We don't call him Shifty Schiff for nothing. He's a shifty, dishonest guy, who, by the way, was critical of one of the great secretary of state, graduated number one in his stage at West Point, graduated top -- one of the top of his class at Harvard Law School, the most honorable person, Mike Pompeo. And this guy was negative on Mike Pompeo. He can't -- there is an expression. He couldn't carry his blank strap. I won't say it, it's so terrible to say. But that guy couldn't carry his blank strap. Do you understand that? So, you deal with bad people. And, you know? I watched China over the last few days and watch these other countries build up, build up, build up, and we build up more than any of them because of me, but no help from the Democrats. They are a disaster. They are the do-nothing Democrats. They don't do any work, all they want to do is try to would make the election in 2020, so they come up with this impeachment nonsense and everyone knows, the conversation all based on one phone call that I had where I'm talking to the president of the Ukraine, you'll hear from our ambassadors, you'll hear from some of the folks that know all about the call, why the call was set up, and everything else is perfect. The call was perfect. Nancy Pelosi and Shifty Schiff, who should resign in disgrace, by the way, and Jerry Nadler and all of them, it's a disgrace what's going on. And we should be focused on making America great again and keeping America great because what they did was nonsense. Think of it. You have a perfect -- I mean, perfect conversation with a president of another country, Ukraine in this case. And they try and say, let's impeach him. They've been trying to impeach me from the day I got elected. I have been going through this for three years. They've been trying to impeach me from the day I got elected. And, you know what? They failed. And this is the easiest one of them all because this one is based on one conversation. What about Obama's conversation with the president of Russia where he says, hey, hey, tell Vlad I'll talk to him after the election is over? I'll talk to him -- nobody reports that, right? That stuff you should report. But you people should be ashamed of yourselves. We have the most dishonest media that you can imagine and you should be ashamed of yourself. But here's what happened: the whistleblower was wrong. The only thing that matters is the transcript of the actual conversation that I had with the president of Ukraine. It was perfect! We are looking at congratulations, we are looking at doing things together, and what we are looking at? We're looking at corruption. And, I believe in 1999, there was a corruption act or corruption bill passed between both countries, where I have a duty to report corruption. And let me tell you something. Biden's son is corrupt, and Biden is corrupt. And I'd rather run against Biden than almost any of those candidates and I think they are all weak. But I think Biden has never been a smart guy and he's less smart now than he ever was. Thank you very much. (END VIDEO CLIP) HANNITY: And the president is supposed to faithfully execute the laws of the land. And that would be election interference that those people use to care about. The president also had pointed words for his lying, corrupt media mob and I call them a mob for a reason, because they are. Take a look. (BEGIN VIDEO CLIP) TRUMP: Look, Biden and his son are stone cold crooked. You know it. His son walks out with millions of dollars. The kid knows nothing. You know it and so did we. Go ahead, ask your question now. REPORTER: The question, sir, was, what did you want President Zelensky to do about Vice President Biden and his son Hunter? TRUMP: Are you talking to me? REPORTER: Yes, it's a follow-up of what I just ask you -- TRUMP: Listen, listen, are you ready? We have the president of Finland, ask him a question. REPORTER: I have one for him, I just wanted to follow up on the one that I ask you -- TRUMP: Did you hear me? Did you hear me? REPORTER: Yes, sir. TRUMP: Ask him a question. REPORTER: I will, but -- TRUMP: I gave you a long answer. As this gentleman a question. Don't be rude. REPORTER: No, sir, I don't want to be rude, I just wanted to have a chance to answer the question that I've asked you. TRUMP: I've answered everything. It's a whole hoax. And you know who's playing into the hoax, people like you and the fake news media that we have in this country, and I say in many cases, the corrupt media because you're corrupt. Much of the media is not just a sick, it's corrupt. (END VIDEO CLIP) HANNITY: Corrupt, lies, smearing, besmirching, false allegations, wasting taxpayer money and time, conspiracy theories, lies, hoaxes -- by the way, the media mob, you may want to pay attention. The president is going to win on this and you're going to help him. The president just raised a whopping $125 million in the third quarter. A new poll has the president's approval rating, yes, climbing to a year-long high. And, by the way, the mob might not like it, but under Article II Section 3 of the United States Constitution, the president has a sworn duty to, quote, well, take care that the laws be faithfully executed. That would mean investigating election interference like the Hillary campaign did by paying for a dirty Russian dossier and like what's been going on in Ukraine. That's right, the weaponizationn of the intelligence community. Oh, and using an unverified pony dossier to get a FISA application warrant four times. And, of course, we'll have the Barr-Durham investigation. Joining us now, he is the son of the president of the United States, Donald Trump Jr. Sir, how are you? Now, let's just for a second -- let's play a game. Let's say that Donald Trump is the vice president, you'd probably not like the demotion. Say, Donald Trump is the vice president and let's say he takes over Ukraine. And let's say Donald Trump Jr. who has no experience in Ukraine, no experience in oil, gas, or energy, you get paid millions of dollars. And in China, it's even better. You fly in with the Air Force Two with dad, and then you get the $1.5 billion in private equity with Whitey Bulger's nephew and John Kerry's stepson -- not Goldman Sachs or Deutsche Bank, not anybody that has real experience. What do you think the mob will be doing? (CROSSTALK) DONALD TRUMP, JR., SON OF PRESIDENT TRUMP: They would totally let me do that, right? If I went to China and did that, Sean, and came back with $1.05 -- not $1.5 billion, $1.05, we would solve the media problem, because their heads would explode, they would be no fake news media left. That's how bad it would be. The whole thing is ridiculous, Sean. Whether it's the Biden scandal and this has gone on. Beyond that, look at the stuff going on in the personal lives. Do you think they would let Donald Trump Jr. get away with that? Do you think that would be off-limits for Donald Trump Jr.? I don't even need to talk about it, it's so ridiculous. Then you have Adam Schiff. You did a great job sort of of mentioning all the lies. If I lied even a little bit in front of those guys like Adam Schiff has lied to the American people and in front of Congress the other day, they'd throw me in jail for perjury. He's done it over and over. You forgot to mention, he's probably the person that magically leaked my emails and edited them which is the big CNN bombshell to make it seem like I got the WikiLeaks stuff a week before, as opposed to a week after. (CROSSTALK) HANNITY: Didn't you actually in the middle of the hearing, I heard a rumor, you can confirm this, that he kept leaving the room and all of a sudden seconds later, it happened moments ago in the room being reported on fake news CNN? Did that happen? TRUMP: Sean, I was in there for about nine hours and magically when I got done 7:30 at night, I go and look at my Twitter feed to catch up on news of the day and starting at about the first bathroom breaks, CNN is live- tweeting essentially the contents of the hearing. Now, I don't know, but Adam Schiff has never been afraid of a microphone. He's never met any camera he didn't love. And, frankly, he's never loved a camera he didn't lie to you. Adam Schiff is basically the Jussie Smollett of Congress on steroids. I've never seen anything so ridiculous. And if a member of Republican Congress tried to get away with this, the media would be all over them. They wouldn't just accept it. You had people, what was it? \"BuzzFeed\" today, well, it doesn't matter that Adam Schiff lied to us because he's pushing our agenda. He's pushing our narrative. More importantly, Sean, the American people see it, they get it. They see Nancy Pelosi, oh, we'd like to maybe talk about health care, and maybe USMCA. They haven't done anything in three years, Sean. They haven't done one single piece of legislation. The reality is this. They hate Trump more than they love America. And more importantly, they want to resist Trump more than he ever wanted to do for their constituency. It's disgusting. This president has accomplished unprecedented things. Imagine what he could do with a little bit of cooperation from the Democrats. Just a little bit. And he's gotten none of it. That he can do what he has done despite unprecedented incoming, unlike any president has seen before is truly a miracle. HANNITY: Donald Trump Jr., amazing times we live in. Sad times, but I have a funny feeling like everything else, this ends up boomerang back. Good to see you. TRUMP: I agree, Sean. Good to see you. HANNITY: God bless. Thank you. Good to see you. Go ahead. TRUMP: Well, listen, I think our guys have to fight like they do for a change. It'll be great to see -- we aren't going to get anything done in the House because it's controlled by the resistance. I think we need our guys in the Senate to start pushing back, start subpoenaing this. Do you doubt for one second that this team has met with the whistleblower, Schiff's team, that they had dictated every aspect of this, subpoena them. Ask them. HANNITY: All right. Don, Jr., thank you. When we come back, see these documents right here in front of me, Rudy Giuliani actually interviewed the prosecutor that was fired by Biden. By the way, he says he may sue Democrats like Adam Schiff. He will join us. And then, John Solomon, an investigative report on all the lies the mob and media are telling you as we continue this breaking news edition of \"Hannity.\" (COMMERCIAL BREAK) HANNITY: All right. As we have mentioned in our monologue, we obtain new Ukrainian documents from Rudy Giuliani. Now, the Democrats earlier today, they actually went into a briefing room. They thought they were going to get impeachable evidence on the president. What they got his information that hurt their cause and showed about, oh, the Democrats and, yes, the DNC and Hillary Clinton campaign, they were colluding with Ukraine in 2016 and, yes, they are admitting they try to help Hillary Clinton and they're also admitting the information they provided had an impact on the race because they took down Paul Manafort with that information. We also have Rudy Giuliani is threatening to sue, along with the president and the president we now learn the former New York City Mayor Rudy Giuliani interviewed the fire prosecutor by Biden, that will be the prosecutor Shokin. He's here to explain all that. Mr. Mayor, the Democrats had a bad dream because they all thought it was going to come to fruition tonight. It did not. You interviewed Shokin and you may sue. It's a lot to digest. RUDY GIULIANI, PRESIDENT TRUMP'S ATTORNEY: Well, I mean, what happened today is the big announcement yesterday was the I.G., the State Department was going to go over and give all the secret documents to the committee. And the committee, I guess, they were sitting there figuring out how they can do impeachment based on nothing and what they -- got shoved down their throats, it's a complete, total, absolutely terrific prosecutorial outline of why Joe Biden is so guilty. It's a joke for me to describe it to you. What I did - first of all, it demonstrates that I - I prosecuted well. That wouldn't be a Freudian slip. I investigated all of this starting in November of 2018 and I finished it by March 2019. And why is that significant? That's significant because all of this was done while the Mueller investigation was still spending, while I was seeking in the best tradition of being a lawyer, a defense lawyer, to vindicate my client. This is information that was given to me. I didn't go looking for Joe Biden. The Ukrainians brought me substantial evidence of Ukrainian collusion with Hillary Clinton, the DNC, George Soros, George Soros's company. They put it in my lap. They came and gave me a testimony. I wrote it out. I had a professional investigator make FBI 302s of it. Eventually, it was John Solomon, who should get a Pulitzer Prize, by the way, put them all on tape. So it's all memorialized on videotapes. So this is as solid as we can get. And I interviewed them. In one case, I interviewed Lutsenko so badly he thought he was being cross-examined. I don't - I don't accept the - I didn't do what this phony whistleblower did. This phony whistleblower is giving hearsay evidence. He says I'm not a direct witness. OK. Useless, pal. You're not a direct witness. Goodbye. I have what's called an affidavit here. This is not what the whistleblower did. This is under oath. It's signed under penalties of perjury by Viktor Shokin. Viktor Shokin has told me he's more than willing to come to America and testify before Congress and point the finger at Joe Biden and his son, and basically support what the President said today. They are corrupt as sin. This is so obvious it's like the nose on your face, Sean. They - the Ukrainian oligarch, Zlochevskyi, didn't pay millions for Hunter Biden's non-existent skill. He paid millions to buy the Vice President's office, and it was a good deal for Zlochevskyi. He got Hunter Biden off the hook. He got Soros's company out of jeopardy, and he got to come back to the Ukraine and keep his $5 billion just for merely giving up maybe $100 million. He has actually gone around Ukraine saying it was well worth it to spend the money to do it. If anybody would care to investigate, they could find everything I just said, except the FBI didn't investigate for a year-and-a-half. The Justice Department didn't investigate a year-and-a-half. My witnesses were afraid to go to the FBI and the Justice Department, which actually, to me, was like living in an alternate universe because I - you know, I prosecuted people far more dangerous and far more difficult to catch these idiots. And I did it with a great FBI. I couldn't have done it without the FBI. And I'm so disappointed at how Comey has corrupted the FBI. And at least on the surface, it hasn't been reformed the way it should. And I hate to say that. But I could not have given this to the FBI in early 2018. And Bill Barr wasn't there yet, so they wouldn't go to the Justice Department. So I gave it to the State Department. I turned it over to them. I gave them eyewitness notes. HANNITY: Oh, my God. GIULIANI: I was hoping they'd come back and interview me. I was so happy when the Secretary told me they were going to investigate. For six months, I saw no sign of an investigation. They never interviewed me. Without my knowledge, maybe they interviewed Shokin and Lutsenko. And I assume they did, but there's no evidence they did. And if they didn't, something is wrong, and it's been turned over now to the FBI. And if you don't interview an eyewitness, who wants to go under oath and wants to be a confrontational accuser, which is what the Constitution requires, you've got to be faced with your accusers, he's willing to face Joe Biden and say you're guilty, you participated in bribing my president, you've got me thrown out so that the case against Soros-- HANNITY: Mr. Mayor, let me-- GIULIANI: --the case against a billionaire and the case against your son, and everybody knows you're corrupt, Joe. And by the way, this is eerily similar to what happened in China. Like, it's a pattern. And let's go take a look at James Biden and how he was selling the Office of Senator when this guy was back in the Senate. This reminds me of a pattern of criminal conduct that spanned over about three decades, that the somnolent Washington press corps just let happen and didn't look at. And if they had picked it up at any stage of the way, they could have protected us and this country against this kind of horrible corruption that makes a mockery of us in Ukraine and China. HANNITY: Mr. Mayor, so you interviewed - I'm listening to all of this. If Donald Trump Jr. did any of this, if Donald Trump did this, they might actually have their first real charge against the President. We have \"Politico\" - we have all the evidence that the DNC and Hillary's campaign colluded with Ukraine. The media is deaf, dumb and stupid, as they always are, and corrupt. We had - you interviewed Shokin. We know why he was fired. He was told why he was fired. He's now said it five separate times that he was fired because he was interviewing, investigating Biden's corrupt son. You're right. GIULIANI: If he was fired for being corrupt, excuse me, I don't mean this as an insult, but almost everybody in the Ukrainian government would be fired. I mean, if he is corrupt, he's not very quite good at it, he's quite poor. I know all these guys. Lutsenko has got a lot of dough. Big cars, lots of money. Shokin is living in a village. He's living in a cottage. He's actually hiding and scared out of his mind that they're going to kill him because - I mean, I can't - this is not up to us to investigate. But if you think the President of the Ukraine let out one of the richest people, let him get away with $5 billion without - what do they say in \"The Godfather?\" - picking his beak or filling his beak or - I can't remember that expression. Well, taking his portion of it. If you don't think poor Shanko (ph) got big millions for this, then you shouldn't be in the investigatory business. (CROSSTALK) HANNITY: Last question, Mr. Mayor. We're running out of time. You say you may sue. Who? GIULIANI: Well, we're looking at a very serious lawsuit. Adam Schiff kind of advanced that lawsuit today with the possibility that he had advanced knowledge and orchestrated this newest non-knowledge, no-firsthand- knowledge, therefore-should-be-ignored whistleblower. In fact, he would have been ignored until they changed the rules. None of his testimony is admissible in court. It's all hearsay. Every bit of Shokin's testimony is admissible in court, but they don't interview Shokin. Actually, Shokin testifies to real corruption. This guy testifies to half - everything he says about me here is false. My meeting with Yermak was not set up because of the conversation. You know why, idiot? Because it took - it was set up before the conversation. The two people he said I called - I never called - one of them I wouldn't have called because he was put on the list of corrupt people that I shouldn't talk to there. And I happened to have independent knowledge of that. So he doesn't know what he's talking about with regard to me. There are apparent indications I could point out seven or eight where he's lying. Or at least so, he may not be lying, he's relying on other people. Maybe they lied to him. That's why hearsay evidence is inadmissible. Shokin has direct evidence. Kalluke (ph) has direct evidence. Kalunak (ph) has direct evidence. Lutsenko has direct evidence. Terashenko (ph) has direct evidence. I have six witnesses who can give direct admissible evidence of Russian - Ukrainian collusion, not Russian collusion, participation in the Steele dossier with phony information, the creation of false evidence, and a very clear corruption scheme by the Vice President of our United States, and that has to be vindicated. And all of it was exposed before he was a candidate for President, and it's not because he's a candidate for President, because he was a corrupt, disgraceful vice president who disgraced our country in the Ukraine and in China, and they are still talking about how corrupt he is and how stupid we are for not catching it. He has to be vindicated for the honor of the United States of America. He disgraced us. HANNITY: Mr. Mayor-- GIULIANI: And if you don't react to that, you have no sense of honor or dignity. HANNITY: We will stay on it. Mr. Mayor, thank you. When we come back, more. A Hannity investigation. John Solomon will expose the biggest media lies and conspiracy theories as it relates to Ukraine. That is next, as we continue this busy breaking news night. (COMMERCIAL BREAK) HANNITY: All right. Tonight, an exclusive Hannity investigation from investigative reporter John Solomon exposing your fake, fraudulent media's Ukraine failures, outright falsehoods. Now, for example, we start with fake news. Oh, yes. Area 51, Roswell Rachel Maddow's channel, MSDNC. This time, it's Katy Tur, whoever she is, claiming that the story that the Democratic Party trying to enlist the Ukraine Embassy to dig up dirt on Trump is Russia propaganda. That's NBC for you. Take a look. (BEGIN VIDEO CLIP) MARC LOTTER, DIRECTOR OF STRATEGIC COMMUNICATIONS, TRUMP 2020 CAMPAIGN: He talked about investigating Ukrainian meddling in the 2016 election, which has been documented that they meddled in the 2016 election. A DNC operative met in Ukrainian Embassy-- KATY TUR, ANCHOR, MSNBC: That's Russian propaganda, Marc. You're - that's what's in propaganda. LOTTER: It's actually - it's actually in \"Politico,\" as reported by Ken Vogel-- TUR: Marc Lotter-- LOTTER: --who works for \"The New York Times\" now. TUR: Marc Lotter-- (END VIDEO CLIP) HANNITY: Russian propaganda. John Solomon joins us now. John, you have a whole list of outright lies they're telling the American people. Let's go through them. JOHN SOLOMON, EXECUTIVE VICE PRESIDENT, THE HILL: Yes. So the first one is that one. There is on-the-record evidence from the Ukraine Embassy. In April of this year, the Ukraine Ambassador said on the record to me, yes, the Democratic National Committee contractor, Alexandra Chalupa, did ask my embassy to get dirt on Paul Manafort and Donald Trump in hopes of creating a investigation in Congress in the fall of 2016 to embarrass Donald Trump, and she asked the embassy to try to arrange so that an investigative reporter working on dirt on Donald Trump could interview the President about Paul Manafort. That is a request of a foreign government to try to interfere in our election. So, that story, the Katy Tur's comments, not true. Not true at all. HANNITY: What about the evidence Ukraine meddled in our election? They say, no, no, that didn't happen. Did that happen? SOLOMON: Yes, it did. A Ukrainian court has ruled in December of last year that a senior law enforcement official and a parliamentary member intentionally leaked documents about Paul Manafort and Donald Trump in an effort to intervene in the U.S. election. That is an official ruling of a Ukrainian court. HANNITY: OK. What about the claim that Joe Biden forced the firing of Ukraine's chief prosecutor, Viktor Shokin? You (ph) want to fight people, now Rudy Giuliani, the fifth one tonight, having interviewed Viktor Shokin, and that Shokin's office was no longer investigating Burisma Holding Gas Company that was paying Biden with no experience that that was no longer happening. That's a lie too, isn't it? SOLOMON: It is. The lie is that at the time Biden forced Shokin's firing, there was no Ukrainian investigation of Hunter Biden's company, Burisma. Not true. I have the prosecutorial file. It was active. I have the emails of the Burisma team negotiating with the prosecutor's office the very day that Shokin was fired. I have Burisma's timeline acknowledging they didn't get the case settled until September 2016 and January 2017, six to nine months after Biden did the firing. This one is a whopper. It is irrefutably wrong and yet it keeps getting repeated by the media. HANNITY: What about the lie that the mob in the media saying there's no evidence that Joe Biden's firing of Shokin had anything to do with Burisma Holdings that's paying his son a fortune? Little dumb on the surface, but they're claiming, no, no, that's a conspiracy theory, John. SOLOMON: That's right. Yes. Well, look at Mr. Shokin's affidavit. He states flatly, I was in the process of preparing to interview Hunter Biden when I was fired, and I was told I was fired because Joe Biden was unhappy I had not dropped the Burisma investigation. That's from a man who has firsthand knowledge. But there's more than just that. We know at the very moment Joe Biden was effectuating this firing of this prosecutor, Hunter Biden's legal team, the American lawyers working with Burisma, were at the doorstep of the new prosecutor, the prosecutor coming in as a replacement, saying we need to meet with you. We - there was a dirty trick carried out. We've got the other guy fired, but we want to make this case go away and solve this whole issue. If there was no connection between the two, why were they there making a contact the day that Joe Biden effectuated the firing? That story doesn't hold up to the facts. HANNITY: Well, they say Joe Biden didn't do anything illegal or unethical. Why do I think they'd have a different view if it was Don Jr. and Donald Trump vice president, although he wouldn't like the demotion? SOLOMON: Let's get what the federal ethics code says. It says all U.S. government employees must avoid not only a conflict of interest but the appearance of a conflict of interest. And we now know from the reporting of the \"Washington Post\" that there were advisers inside Joe Biden's team that were warning the President that his conduct involving Ukraine and his son's involvement in this case created the appearance of a conflict of interest. HANNITY: All right. John Solomon, we'll continue to bring you back. We have a lot more to break in this story. Coming up, when we come - by the way, Peter Schweizer will explain the China issue and the Ukraine issue tomorrow. Gregg Jarrett, Joe Concha on the media mob's incessant lying and the damage they're doing to the country, straight ahead. (COMMERCIAL BREAK) HANNITY: All right. Here with reaction to all of the news - next week, the release, \"Witch Hunt: The Story of the Greatest Mass Delusion in American Political History\" - Fox News Legal Analyst Gregg Jarrett, and he writes for the media on \"The Hill.\" Joe Concha is with us. So these are 10 real big lies the mob and the media is telling, Joe, about the Ukraine story and about Biden. And they won't cover Ukrainian election interference and they won't cover that Joe was protecting his son and this prosecutor is telling his story. Why? JOE CONCHA, MEDIA REPORTER FOR THE HILL: Journalists are supposed to speak truth to power. Right, Sean? And they're supposed to be curious in these situations. They're very uncurious about all those aspects that you just mentioned. And look, with Adam Schiff, this is very telling. The fact that - today it was revealed that his office spoke with the whistleblower, but then on September 17th, Schiff told MSNBC we hadn't spoken to the whistleblower, but we would like to. That's a lie right there. And you have to call it as it is. But the ABC News and CBS News evening news cast did not even cover that fact. And NBC only mentioned it for a moment. So if you want a preview of how this is going to continue to go as we go down this road, even when Adam Schiff is caught in a blatant lie, it is not being covered by the major networks nor is the Ukraine story being pursued with even a little bit of curiosity by those traditional media outlets, Sean. HANNITY: They won't look into real collusion. By the way, the idiot Schiff is the one on tape, Gregg Jarrett. What's the nature of the comprise? Naked pictures of Trump. And they - this guy can't run an investigation to impeach anybody He needs to be thrown out of Congress. He needs to be investigated. He needs an ethics investigation. Then we've got real collusion that happened with Ukraine, and we've got real corruption. A real pay to play scam. They ignore it. I mean, what laws do you see that were possibly broken here? Because I see a lot. GREGG JARRETT, LEGAL ANALYST & AUTHOR, WITCH HUNT: Well, with Joe Biden, it would be the Foreign Corrupt Practices Act. It could be extortion, bribery, honest services fraud. But back to Adam Schiff, look, if Democrats are serious about impeachment, the first thing they have to do is get rid of Adam Schiff. The truth always has a nemesis, and in this case, it's that man you see on the screen, Adam Schiff. In my book, Witch Hunt, I go through page-after-page of lie-after-lie peddled by Adam Schiff. He lied about Carter Page. He lied about Bruce Ohr. He lied about the dossier. He lied about evidence he claimed to have that he did not have. And now, he is lying about the whistleblower, claiming they had no contact with him. They did. Claiming, if it weren't for the IG, they wouldn't know about him. They directed the whistleblower to the IG. They claimed they had no advance notice. They certainly did. Adam Schiff is a professor of deception and canard and false claims and lies. HANNITY: Biggest liar in Congress. He is the biggest liar. JARRETT: Oh, yes. HANNITY: He spreads conspiracy theories and lies and is best friends with the media mob. All right. Closing thoughts, when we get back. (COMMERCIAL BREAK) HANNITY: All right. Adam Schiff just can't be the head of any investigation. He actually needs to be investigated. Yes, we have evidence that the DNC and Hillary Clinton's campaign benefited with collusion with Ukraine. Where is all the media mob caring about collusion? Apparently, they don't. Imagine if Donald Trump and Junior did what Hunter and Joe Biden did. We'll never be the media mob. Thank you for being with us. Let not your heart be troubled. Laura Ingraham is back in New York. Laura? Content and Programming Copyright 2019 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2019 ASC Services II Media, LLC. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of ASC Services II Media, LLC. You may not alter or remove any trademark, copyright or other notice from copies of the content.",
      "date": "October 2",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Michael Goodwin: Hillary Clinton needs to run for president again — or get over it already",
      "url": "https://www.foxnews.com/opinion/michael-goodwin-hillary-clinton-needs-to-run-for-president-again-or-get-over-it-already",
      "subtitle": "Michael Goodwin: Hillary Clinton needs to run for president again — or get over it already",
      "author": "Michael Goodwin",
      "content": " It has been said that there are only two cures for those bitten by the presidential bug: election or death. Poor Hillary Clinton. The most famous loser of a presidential campaign is peddling another book, so each day interviewers ask her vapid questions about how she feels. Naturally, she responds with vapid variations on a theme: Donald Trump is no good, he stole the election, the world is ending, I’m fine, thank you. Only she’s not fine, or she wouldn’t continue to embarrass herself by trying to rewrite history. She lost the election fair and square and even the “resistance” movement no longer pretends otherwise. Yet nearly three years after the votes were counted and the states were called, and months after Robert Mueller found no collusion with Russia, she still has the nerve to insist that Trump is an “illegitimate president.” CLICK HERE TO GET THE OPINION NEWSLETTER A brief detour down memory lane reveals the hypocrisy. When Trump said in the third presidential debate of 2016 that he might not accept the election results, Clinton pounced on what she believed was a disqualifying mistake. “That’s horrifying,” she replied. “Let’s be clear about what he is saying and what that means. He is denigrating — he is talking down our democracy. And I am appalled that someone who is the nominee of one of our two major parties would take that position.” CLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM Here we are, and she’s the one still contesting the results and “talking down our democracy.” Now that’s horrifying. Her refusal to accept Trump’s election can mean only one thing: In her own mind, she won the election and she’s the real president. Oh dear. In that case, we have another problem with only two options. She can see a shrink, or prove she’s right. Run, Hillary, run. CLICK HERE TO CONTINUE READING MICHAEL GOODWIN'S COLUMN IN THE NEW YORK POST CLICK HERE TO READ MORE BY MICHAEL GOODWIN",
      "date": "October 6",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "",
      "url": "",
      "subtitle": "",
      "author": "",
      "content": "   ",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Hillary Clinton attacks Trump over tweet aimed at progressive congresswomen",
      "url": "https://www.foxnews.com/politics/hillary-clinton-attacks-trump-over-tweet-aimed-at-progressive-congresswomen",
      "subtitle": "Hillary Clinton attacks Trump over tweet aimed at progressive congresswomen",
      "author": "Edmund DeMarche",
      "content": " Hillary Clinton on Sunday took President Trump to task over a criticized tweet where he called on progressive congresswomen to go back to the \"crime infested\" countries they came from, fix the problems there and \"show us how it is done.\" Trump’s swipe did not mention anyone by name, but he was apparently referring to Rep. Alexandria Ocasio-Cortez, D-N.Y.; Rep. Ilhan Omar, D-Minn; Rep. Rashida Tlaib, D- Mich.; and Rep. Ayanna Pressley, D-Mass. All four are minorities. Trump's tweet was condemned by Democratic lawmakers as racist. Trump wrote that these congresswomen are from places with a barely functioning government and yet “viciously” tell Americans “how our government is to be run.\" Omar, who is from Somalia, is the only member of \"The Squad\" who was born outside the U.S. Clinton, who lost to Trump in 2016, tweeted, “They’re from America, and you’re right about one thing: Currently their government is a complete and total catastrophe.” House Speaker Nancy Pelosi tweeted that Trump’s comments “reaffirms his plan to “Make America Great Again” has always been about making America white again.” Republicans remained largely tight-lipped about Trump’s tweet. Trump’s tweet appeared to be an opportunity for Democrats to put recent tensions aside and come together to call out the president. Pelosi and Ocasio-Cortez have recently been mired in a public dispute after a column last week in The New York Times. AOC UNLOADS ON TRUMP AFTER COMMENTS Pelosi, in the piece, downplayed the influence that the four freshmen actually have in Congress. The comment drew criticism that eventually led to Ocasio-Cortez saying she felt Pelosi was singling out “newly elected women of color.” Doug Heye, a Republican strategist, told The Wall Street Journal that the president is popular in his own party, hence the muted response by fellow Republicans. “If you were a Republican member of Congress for 10 years and didn’t speak out on ‘birtherism,’ are you going to speak out now?” Heye said. GET THE FOX NEWS APP Hours after the tweet, and the subsequent uproar, Trump tweeted again, \"If the Democrat Party wants to continue to condone such disgraceful behavior, then we look even more forward to seeing you at the ballot box in 2020!\"",
      "date": "July 15",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Hillary Clinton floats conspiracy that Tulsi Gabbard is being 'groomed' by Russians",
      "url": "https://www.foxnews.com/politics/hillary-clinton-tulsi-gabbard-groomed-russia",
      "subtitle": "Hillary Clinton floats conspiracy that Tulsi Gabbard is being 'groomed' by Russians",
      "author": "Alex Pappas",
      "content": " Hillary Clinton in a new interview appeared to float a conspiracy theory that the Russians are “grooming” Hawaii congresswoman and Democratic presidential candidate Tulsi Gabbard to be a third-party candidate in 2020, while claiming 2016 Green Party nominee Jill Stein is \"also\" a Russian asset. Appearing on former President Obama aide David Plouffe’s “Campaign HQ” podcast, Clinton did not mention Gabbard specifically by name, though Plouffe ended the podcast by noting Clinton’s “belief that Tulsi Gabbard is going to be a third-party candidate propped up by Trump and the Russians.” TULSI GABBARD SLAMS CRITICS DURING DEBATE OVER 'DESPICABLE' 'SMEARS' OVER SYRIA, RUSSIA “I'm not making any predictions but I think they've got their eye on somebody who is currently in the Democratic primary and are grooming her to be the third-party candidate,” Clinton said, in apparent reference to Gabbard. “She's the favorite of the Russians. They have a bunch of sites and bots and other ways of supporting her so far.” She then accused Stein, who ran against her and Donald Trump in 2016, of also being an asset of Russia: \"That’s assuming Jill Stein will give it up, which she might not because she’s also a Russian asset.\" Other Democrats have made similar claims about Gabbard, a Hawaii Democratic congresswoman and Hawaii Army National Guard major who served in Iraq. For her part, during this week’s presidential debate in Ohio, Gabbard fired back at those accusing her of this. \"Just two days ago, The New York Times put out an article saying that I'm a Russian asset and an Assad apologist and all these different smears,” Gabbard said. “This morning, a CNN commentator said on national television that I'm an asset of Russia — completely despicable.\" Gabbard has repeatedly been accused by Democrats of being a \"puppet for the Russian government.\" Gabbard – an anti-war activist who has accused the United States of waging a \"regime change war” in Syria – has had to defend her 2017 meeting with Syrian President Bashar al-Assad, the brutal dictator, throughout the campaign. CLICK HERE TO GET THE FOX NEWS APP Others on Friday expressed fear that Gabbard would run as a third-party candidate, helping Trump in his reelection. \"If @TulsiGabbard runs, it wd be a huge windfall for Trump, Assad, Putin, Xi,” former U.N. ambassador Samantha Power tweeted in response to Clinton’s comments. Fox News' Sam Dorman and Kelly Phares contributed to this report.",
      "date": "1 day ago",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Jill Stein assails Hillary Clinton for calling her a 'Russian asset,' challenges her to a debate",
      "url": "https://www.foxnews.com/politics/jill-stein-hillary-clinton-russian-asset",
      "subtitle": "Jill Stein assails Hillary Clinton for calling her a 'Russian asset,' challenges her to a debate",
      "author": "Joseph A. Wulfsohn",
      "content": " Former Green Party candidate Jill Stein pushed back against Hillary Clinton after the failed 2016 presidential candidate called her a \"Russian asset\" this week. In a new interview, Clinton appeared to float a conspiracy theory that the Russians are “grooming” Hawaii congresswoman and Democratic presidential candidate Tulsi Gabbard to be a third-party candidate in 2020. “I'm not making any predictions, but I think they've got their eye on somebody who is currently in the Democratic primary and are grooming her to be the third-party candidate,” Clinton said, an apparent reference to Gabbard. “She's the favorite of the Russians. They have a bunch of sites and bots and other ways of supporting her so far.” She then accused Stein, who ran against her and Donald Trump in 2016, of also being an asset of Russia: \"That’s assuming Jill Stein will give it up, which she might not because she’s also a Russian asset. I mean -- totally.\" GABBARD DARES CLINTON TO RUN FOR PRESIDENT IN 2020, FIGHTS BACK AGAINST ASSERTIONS THAT SHE'S A RUSSIAN ASSET Stein shot back on Friday, challenging Clinton to a one-on-one debate. \"In light of the latest slanderous allegations from @HillaryClinton, I challenge her to a debate. It's past time to give the American people the real debate they deserved in 2016, but were denied by the phony DNC/RNC-controlled Commission on Presidential Debates,\" Stein wrote in a series of tweets. \"It's a shame HRC is peddling conspiracy theories to justify her failure instead of reflecting on real reasons Dems lost in 2016. You can slander progressives as 'Russian assets,' but you can't hide the fact that the DNC sabotaged Sanders & elevated Trump to set the stage for HRC.\" She continued: \"HRC's rant is Exhibit A for how the establishment is using the new Cold War to crack down on dissent & feed the war machine. Instead of addressing the crises working people face, they're painting progressives as the enemy. It's as if they're trying to lose to Trump again.\" Gabbard also had a fiery response to Clinton and dared the former Secretary of State to enter the 2020 race. \"Great! Thank you @HillaryClinton. You, the queen of warmongers, embodiment of corruption, and personification of the rot that has sickened the Democratic Party for so long, have finally come out from behind the curtain,\" Gabbard wrote in a three-part tweet on Friday. \"From the day I announced my candidacy, there has been a concerted campaign to destroy my reputation.\" \"We wondered who was behind it and why,\" Gabbard continued in her tweeted answer to Clinton. \"Now we know — it was always you, through your proxies and powerful allies in the corporate media and war machine, afraid of the threat I pose. It’s now clear that this primary is between you and me. \"Don’t cowardly hide behind your proxies. Join the race directly\" she said in a taunt squarely aimed at Dems' 2016 standard-bearer. CLICK HERE FOR THE FOX NEWS APP . Fox News' Alex Pappas and Vadana Rambaran contributed to this report.",
      "date": "1 day ago",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Hillary Clinton backs out of DC event also set to include Tulsi Gabbard, Kirstjen Nielsen: report",
      "url": "https://www.foxnews.com/politics/hillary-clinton-tulsi-gabbard-dc-fortune-women-summit",
      "subtitle": "Hillary Clinton backs out of DC event also set to include Tulsi Gabbard, Kirstjen Nielsen: report",
      "author": "Danielle Wallace",
      "content": " Hillary Clinton has backed out of a Friday appearance at an event also scheduled to include Democratic presidential candidate Tulsi Gabbard, among other guests, according to a report.\n\n\nWord of Clinton's removal from the bill of Fortune magazine’s Most Powerful Women Summit came Thursday, the same day the former secretary of state sparked a clash by accusing Gabbard of being groomed by Russia to run as a third-party candidate for president in 2020. The Hawaii congresswoman and combat veteran fired back in a scathing series of tweets later Thursday, challenging Clinton not to “hide behind your proxies” and join the presidential race \"directly.\" GABBARD DARES CLINTON TO RUN FOR PRESIDENT IN 2020, FIGHTS BACK AGAINST ASSERTIONS THAT SHE IS A RUSSIAN ASSET\n\n\nSlate.com reported that Clinton removed herself from the three-day summit due to a scheduling conflict. An unnamed source told the publication that Clinton decided not to participate in an act of protest against former Homeland Security Secretary Kirstjen Nielsen, who was also scheduled to speak. Nielsen, who resigned in April, oversaw the Trump administration’s controversial “zero tolerance” immigration policy, which resulted in the separation of thousands of migrant children from their families at the border. The policy was later rescinded. More than 51,000 people signed a petition asking Fortune to pull Nielsen from the summit’s roster, Slate also reported. About 100 speakers were still scheduled to attend the summit as of Friday evening. Gabbard and lawyer Anita Hill are among the more high-profile scheduled speakers, on a list that also includes business executives, journalists, scholars and some elected officials. (Hill became a household name in 1991 when she accused Supreme Court nominee Clarence Thomas, who had been her supervisor at the U.S. Department of Education and the Equal Employment Opportunity Commission, of sexual harassment.) In her remarks Thursday on “Campaign HQ,” a podcast hosted by former President Obama aide David Plouffe, Clinton did not mention Gabbard by name, though Plouffe ended the podcast by noting Clinton’s “belief that Tulsi Gabbard is going to be a third-party candidate propped up by Trump and the Russians.” Clinton also singled out 2016 Democratic candidate Jill Stein, accusing her of being a Russian asset. The former first lady, whom Donald Trump defeated for the presidency in 2016, has recently been promoting a book co-authored with her daughter, Chelsea Clinton. CLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM Gabbard has faced criticism from several other fellow Democrats, who have accused her of being a \"puppet for the Russian government.\" The Army National Guard major, who served in Iraq, has repeatedly defended her antiwar, anti-interventionist beliefs, which have led to some comparisons between her and President Trump. At Tuesday's fourth Democratic debate in Ohio, Gabbard relentlessly slammed CNN, which was broadcasting the event live, and The New York Times, calling them \"completely despicable\" for news coverage that has raised questions about whether she is a \"Russian asset and an Assad apologist,\" a reference to the leader of Syria. Fox News’ Vandana Rambaran and Alex Pappas contributed to this report.",
      "date": "20 hours ago",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Mariah Carey calls Hillary Clinton 'president' in photo op",
      "url": "https://www.foxnews.com/entertainment/mariah-carey-hillary-clinton-president",
      "subtitle": "Mariah Carey calls Hillary Clinton 'president' in photo op",
      "author": "Gerren Keith Gaynor",
      "content": " Mariah Carey appeared to snub President Trump after she posted a picture online with Hillary Clinton and referred to the former secretary of state as “president.” Carey, 49, shared the photo after meeting the former Democratic presidential nominee, and former President Bill Clinton, backstage at a Barbara Streisand concert Saturday night in New York City. “An honor to meet President Clinton and her husband, former President Bill Clinton! Thank you for everything you have done and continue to do for our country,” the Grammy-winning singer tweeted Monday. Carey’s tweet caused chatter as many online picked up on the apparent intentional usage of the title. On Tuesday, Hillary Clinton responded to the pop star’s post tweeting, “The honor is ours; it’s not every day you meet a queen.” MARIAH CAREY OPENS UP ABOUT HER FIRST MARRIAGE: 'IT WAS ALMOST LIKE BEING A PRISONER' Carey’s seemingly overt political statement ran in contrast to comments she’s made in the past. When asked during a 2016 interview whether she supported Clinton or Trump, Carey explained that she did not want to be “vocal” about her political views. She did, however, acknowledge her use of a Hillary Clinton picture as her avatar online. “It’s so hard because I’m just an entertainer,” Carey told TV host Andy Cohen at the time. “I’m not a political analyst. So I don’t want to be vocal about my true feelings about all of this, but I have them.”",
      "date": "August 7",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Rose McGowan rips Hillary Clinton over ties to 'predators' Bill Clinton, Harvey Weinstein",
      "url": "https://www.foxnews.com/entertainment/rose-mcgowan-calls-out-hillary-clinton-over-harvey-weinstein-guess-predators-are-her-style",
      "subtitle": "Rose McGowan rips Hillary Clinton over ties to 'predators' Bill Clinton, Harvey Weinstein",
      "author": "Brie Stimson",
      "content": " Rose McGowan called out Hillary Clinton last week over a report that Clinton's publicist told journalist Ronan Farrow that his investigation into Harvey Weinstein's alleged history of sexual misconduct was \"a concern\" for the Clinton camp. “I knew that Hillary Clinton’s people, were protecting the Monster,” McGowan wrote, referring to Weinstein. “I can’t believe I used to support her. I guess predators are her style.” The last remark in McGowan's tweet appeared to also apply to former President Bill Clinton, to whom McGowan referred mor clearly in separate Twitter message. 6 TAKEAWAYS FROM RONAN FARROW'S BOMBSHELL INTERVIEW FOR 'CATCH AND KILL' “Hillary Clinton, did you have any concern for your husband’s victims? And what about HW victims? No? Didn’t think so,” McGowan wrote. According to the Hollywood Reporter, Farrow writes in his new book, “Catch and Kill,” that Clinton publicist Nick Merrill had contacted Farrow, who was seeking an interview with Clinton as part of work on a foreign policy book. At the time, Farrow was also working on his award-winning New Yorker magazine story about Weinstein. Merrill told Farrow the “big story” he was working on was a “concern for us,” according to The Reporter. Farrow writes that Weinstein had leveraged his relationship with Clinton as a means of applying pressure on Farrow, the outlet reported. McGowan was one of Weinstein's first accusers and has been an outspoken leader of the #MeToo movement. She added that she is “against abuse of power, whether it be Trump, Clinton, HW, @NBC ... the list is long. I’m not raging, I just really, really dislike liars and those who protect them.” CLICK HERE TO GET THE FOX NEWS APP Merrill responded to the article on Twitter. \"I genuinely respect Ronan’s work, but have no idea what Weinstein was saying to people to save himself. What I do know is simple: I’d already rejected a Weinstein Co proposed doc about the election before talking to Ronan. If HW misrepresented facts, it wouldn’t be the 1st time.” Weinstein also reportedly contacted NBC and even Farrow’s father, Woody Allen, to try to keep the story from going to print. Weinstein's trial on rape charges is scheduled for January.",
      "date": "6 days ago",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Hillary Clinton calls Trump a 'corrupt human tornado'",
      "url": "https://www.foxnews.com/transcript/hillary-clinton-calls-trump-a-corrupt-human-tornado",
      "subtitle": "Hillary Clinton calls Trump a 'corrupt human tornado'",
      "author": "",
      "content": "This is a rush transcript from \"Tucker Carlson Tonight,\" September 27, 2019. This copy may not be in its final form and may be updated. TUCKER CARLSON, HOST: Good evening and welcome to “Tucker Carlson Tonight.” Happy Friday. It's been one of those weeks that really nobody could have predicted. On Monday, we checked the records, we opened this show the segment about climate change hysteria. At the time, it seemed like the most pressing issue in the country if you can believe it. And then just 24 hours after that, we were assessing the impeachment of the President of the United States. That's the kind of week it's been and that's where we remain tonight. As of right now, it looks like impeachment is likely to happen. The fascinating thing is that nobody can seem to explain exactly why it's going to happen. Can you explain? Quick, in a paragraph or less describe the specific crime that Donald Trump has been accused of committing. Stumped? It's okay. Don't feel bad. So is Nancy Pelosi and she is running the whole thing. The best she could do today was to suggest that Russia somehow has a role in all of this. Watch. (BEGIN VIDEO CLIP) REP. NANCY PELOSI, D-CALIF.: It is wrong for any foreign government to interfere in our elections. And here you have the President of the United States asking for that. And they know how -- how long it is. So it's wrong for -- as we saw it with Russian interference, and by the way, I think Russia has a hand in this, by the way. (END VIDEO CLIP) CARLSON: Huh. Now, as she put it, to be clear, Nancy Pelosi can point to no evidence that, quote, \"Russia has a hand in this.\" She is just saying that, just throwing it out there. So she is simply saying that Donald Trump cut a secret deal with the President of Ukraine. She can't say a single fact to show that is true. She is making it up. But nobody in Washington cares. Facts are not the point of this exercise. Power is the point of this exercise, seizing it, wielding it. Well, it turns out that when power is your only aim, you will say anything including maybe especially things that are the precise 180 degree opposite of what is actually true. Case in point, the latest claim they're making, it definitely fits in that category. They're telling you that the push for impeachment has nothing to do with politics, nothing at all. Political considerations couldn't be more irrelevant here. Watch them lie. (BEGIN VIDEO CLIP) SEN. CORY BOOKER, D-N.J., PRESIDENTIAL CANDIDATE: The politics be damned. It's time to do what is right. And in this moment, we must continue these impeachment proceedings. HILLARY CLINTON, FORMER FIRST LADY: This is not a political statement. It's a harsh reality, which is why the Speaker has acted. PELOSI: And I don't think the action of an inquiry is a political move. It is not about politics, it is not about partisanship. It's about patriotism. It's about protecting -- (END VIDEO CLIP) CARLSON: Yes, it's about patriotism, kids. Aunt Nancy swears it is. If you love this country, you will shut up and obey her. So what's the point of even repeating a talking point that stupid? Is there a single person in this country who really thinks it's about patriotism? The fact is, is there anyone who thinks it's about protecting the country? How many more self-righteous lectures are we going to need to hear about national security delivered by the very people who gave us open borders and endless string of pointless wars? In fact, if there's one thing that group doesn't care about at all, emphatically doesn't care about, it's the security of our nation. National security. There's no moral component to any of this. They saw an opening to grab power, and they're taking it. The question -- the interesting question is why now? Why impeach now? There's a presidential election a year from now. The President actually is beatable. Theoretically, anyway. Look at the numbers, you can beat him. You could try anyway. Elizabeth Warren is not a weak candidate. So why not try? Why not just let democracy do its thing as it has every four years for 240 years? Because -- and this is the deepest truth -- they can't. They can't win that way. The Democratic Party has become too radical to win a conventional election. And if you're wondering if that's true, ask yourself this. When was the last time a Democratic candidate seemed to care about improving your life? By the way, improving your life is the most basic of all political promises. Vote for me and I will make your life a little better. When was the last time someone on the left said that to you? Unless you're a convicted felon, or an illegal alien, you probably can't remember the last time. In just the last three years, the Democratic Party's agenda has become openly hostile to Middle America. Hostile -- by the way, including too many of its own voters. They're not even pretending anymore. If they get power, they're taking away your rights, starting with the most basic right of all, your right to defend yourself and your family. (BEGIN VIDEO CLIP) ANDERSON COOPER, CNN HOST: So to gun owners out there who say, well, a Biden administration means they're going to come from my guns. JOE BIDEN, D-PRESIDENTIAL CANDIDATE: Bingo. You're right, if you have an assault weapon. The fact of the matter is they should be illegal. Period. UNIDENTIFIED MALE: Do you believe in the mandatory buyback of quote unquote \"assault weapons\"? SEN. KAMALA HARRIS, D-CALIF., PRESIDENTIAL CANDIDATE: I do believe that we need to do buybacks and I'll tell you why. They are weapons of war with no place on the streets of a civil society. BETO O'ROURKE, D-PRESIDENTIAL CANDIDATE: Hell, yes, we're going to take your AR-15, your AK-47. We're not going to allow it to be used against our fellow Americans anymore. (END VIDEO CLIP) CARLSON: Yes. Meanwhile, the assault on our core and most basic institutions continues apace, ever more aggressive with every passing week. Law enforcement itself, they are now telling us has no moral standing to enforce the law. (BEGIN VIDEO CLIP) PETE BUTTIGIEG, D-IND., MAYOR, PRESIDENTIAL CANDIDATE: I have challenged our police department to recognize all of the ways in which the uniform has been burdened by racism. HARRIS: Training for police officers on implicit racial bias and procedural justice, because to deny it exists is to deny folks liberty and in many cases, life. O'ROURKE: How do we continue to lose the lives of unarmed black men in the United States of America at the hands of white police officers? That is not justice. JULIAN CASTRO, D-PRESIDENTIAL CANDIDATE: If you are young and black, you're treated differently because of the color of your skin. I don't believe that it's just a case of a few bad apples. I believe that the system is broken. (END VIDEO CLIP) CARLSON: It is just crazy talk. I mean, none of it is accompanied by numbers because they can't prove it because it's not true. And outside of faculty lounges, everybody in America recognizes that, and it's not just their position on law enforcement, it's all of their new positions. Free healthcare for illegal aliens, reparations for slavery, forcing everybody in the country to pretend that there are somehow more than two genders. That's the new Democratic agenda, and it's so bonkers, that there's no precedent for it. If Barack Obama came back to run on his 2008 platform, the one that made him President, Antifa would show up outside his house to protest. So the bottom line is, you can't win an election with this stuff. Normal people don't support these ideas. This isn't agenda fit not for an election, but for a revolution. That means that ordinary democracy must be suspended. That's why the left wants votes for violent felons and children and illegal aliens. It's why they want the Electoral College to be dismantled and discarded. And ultimately, it's the reason behind this fake Ukraine crisis. If the vote next year is simply about Trump's priorities versus those of the New Democratic Party, it is not close. They'll lose. People don't support these ideas. They may not like Trump, a lot of people don't like Trump. They think he is weird or off putting and brags about himself or whatever. But if the election is about what you're going to do when you're elected, if it's about ideas, if it's about a platform, an agenda, the Democratic Party will lose. They can't win because people don't support this crap. Period. So what do they do? They have to delegitimize Trump completely. They have to cancel the 2016 election and prevent a fair race from being run in 2020. So in a way, actually Democrats aren't wrong. They're telling you that democracy is in the balance. They are right, it is. But the President isn't the one trying to get rid of democracy; they are. A new report, meanwhile, indicates that Ukraine couldn't have had a quid pro quo with Trump because they didn't even know that military aid was being delayed. Chief Breaking News Correspondent, Trace Gallagher has more on this developing story. Hey, Trace. TRACE GALLAGHER, CHIEF BREAKING NEWS CORRESPONDENT: Hi, Tucker. The whistleblower's account and Democratic lawmakers both argue that during his call with Ukrainian President Zelensky, President Trump laid out a quid pro quo. You know, this for that, meaning the President was dangling $391 million in foreign aid to Ukraine in exchange for an investigation into Joe and Hunter Biden. Democrats also argue that even if the President didn't explicitly make the demand, the innuendo was certainly there. That's where the so-called mob boss secret code comes in. But if a quid pro quo is in place, it stands to reason that both parties would know about it. Except \"The New York Times\" is now reporting that a Ukrainian official says Kiev was not made aware that the U.S. had suspended security funds until a month after the Trump-Zelensky phone call. Even the whistleblower acknowledges not knowing quote, \"how or when they learned of it,\" they being the Zelensky administration. Separately the whistleblower complaint says that U.S. diplomat Kurt Volker, who by the way, resigned today was upset about Rudy Giuliani's role in pushing Kiev to open an investigation into the Biden's and that Volker sought to, quote, \"contain the damage from Giuliani's outreach to Ukraine.\" But Fox News now has text messages between Volker and Giuliani from July 19 showing that Volker actually encouraged Rudy Giuliani to reach out to Ukraine and even connected Giuliani to a source very close to President Zelensky -- Tucker. CARLSON: Thank you, Trace. For two years, Democrats told us that proof of Russian collusion was imminent. Any day now, they said. We're still waiting. Now Democrats like Ted Lieu want the public to trust them that the evidence on Ukraine is just around the corner. President Trump they tell us was definitely making a corrupt deal with Ukraine's President. But Joe Biden's son and his $50,000.00 a month no-show job, nothing to see here. Move along. (BEGIN VIDEO CLIP) SAAGAR ENJETI, HOST, THE HILL TV: Hunter Biden receiving $50,000.00 a month from a Ukrainian energy company. Do you think that that is evidence of corrupt behavior? REP. TED LIEU, D-CALIF.: No, people sit on boards and they get monetary payments and what evidence actually shows is that Ukrainians looked into this, terminated the investigation, found nothing there. (END VIDEO CLIP) CARLSON: Yes, it's not -- that's not corrupt at all. But asking about it is an impeachable offense. Is that really a story they can sell the public for next year? John Daniel Davidson is Political Editor at \"The Federalist,\" which if you don't read, you ought to, and he joins us tonight. So John, simple question, is that distill down to its essence, a message that they can ride to victory in impeachment or in the election? JOHN DANIEL DAVIDSON, POLITICAL EDITOR, \"THE FEDERALIST\": Absolutely not. This is a half-baked story that the American people are not going to buy, especially not from this Congress. Look, the Democrats decided that Trump needed to be impeached the day after the election in 2016, and ever since then, they've been grasping at straws. First, it was, oh he fired Comey. And then it was this Russia collusion hoax. And now we get this story about the Ukrainian phone call. The American people aren't going to buy it. They have every reason to be suspicious of this Democratic Congress. CARLSON: Yes, I mean, it seems like in real life, you can't do impeachment, except as a bipartisan matter. I mean, you could -- you know, Obamacare, maybe is their model, you can kind of squeak it through on one vote, but impeachment is bigger than any piece of legislation. It's undoing an election. Do they really think they can do this party line in the House? DAVIDSON: Yes, absolutely. The last two impeachment we had, Bill Clinton and Richard Nixon were both bipartisan affairs. In fact, the vote to just authorize Impeachment Inquiries got support from the opposing party. Nancy Pelosi won't even call for that vote, because she knows that it'll be an entirely partisan vote, and it will undermine the credibility of an impeachment investigation that's already tainted. You know, you're talking about a Congress, by the way that has something like 14 percent approval rating. CARLSON: Yes. DAVIDSON: You know, the American people don't have confidence in this Congress, and you need to have the American public to have confidence in Congress in order to do something like this. CARLSON: So what's the message? And by the way, this is not a defense of this President or any President, but it's a defense maybe of democracy itself, so what's the message to voters who voted in 2016 hoping they were going to drain the swamp or shake up the system or, you know, put something new, a new kind of person in there? What's the message to them? Like, no, you're not allowed to have what you want? DAVIDSON: That's exactly the message. The message is you are wrong and you don't -- you can't be trusted with this and we're going to have a do over. In fact, today, Senator Kamala Harris called for the formal Impeachment Inquiry against Supreme Court Justice Brett Kavanaugh. They want to undo 2016 and everything that happened since and have a whole do over, except this time, they'll be in charge because they know what's best for the American people. CARLSON: Yes. DAVIDSON: That's essentially the message. CARLSON: She is an appalling lightweight. I mean, do you see any parallels between the way that permanent Washington treats the 2016 election and the way the European bureaucracy treats the Brexit vote, also of 2016? DAVIDSON: Absolutely. The European Union has a long track record of calling for new referendums and new elections every time one of their initiatives fails. They've done it multiple times over the past 15 years. And now you see, you know, politicians in the United Kingdom calling for the same thing for Brexit. You were just wrong voters the first time and then so this time we're going to we're going to get it right. It's appalling and it's completely -- talk about trampling on democratic norms and institutions. I mean, this is much worse than anything Trump has done. CARLSON: Or that Russia did. They don't believe in democracy. They're not hiding it anymore. DAVIDSON: That's right. CARLSON: That's fine. Then, let's get rid of it then. But this weird kind of half fake democracy is not satisfying. And it just causes volatility, I think. John, thanks so much for coming on tonight. DAVIDSON: Thanks. CARLSON: Ian Samuel is a former Supreme Court clerk and he joins tonight. Ian, thanks a lot for coming on. I'm not a conspiracy nut, but it does occur to me occasionally that debates like the one we're watching over impeachment because of Ukraine, where a lot of our racial debates, all seem like sideshows designed to prevent us from ever debating economic issues. Like what is the role of private -- is private equity good for America, exactly? And why are they paying half the taxes I am paying? Things like -- like real questions that actually matter. Have you noticed this? Or have I gone crazy? IAN SAMUEL, FORMER SUPREME COURT CLERK: Well, I don't know if you're crazy. Although I think that actually this impeachment investigation couldn't really be better timed if you want to have that debate, because that debate would never happen if Joe Biden were the Democratic nominee for President. And I think the most likely effect of this impeachment investigation, in addition, obviously, to whatever it turns up about what Trump did is to remind everybody that Joe Biden, whether or not what his son was doing was formally illegal or not, is like the preeminent swamp creature in the Democratic Party. And it's coming at a time where there's still an opportunity to nominate somebody else who actually did want to have that debate. And so I have sort of mixed feelings about this impeachment process. I don't really want to spend the next year talking about Hunter Biden and what he was up to and Joe Biden's views on, you know, Ukrainian gas law. But on the other hand, this might be the only opportunity to talk about something else by getting Joe Biden out of the picture. So, I have mixed feelings. CARLSON: So, let's ask the question. I mean, I agree with you completely. I wonder how Joe Biden got to be the front runner in the first place. I don't really understand that. How could a party that claims to believe all the things Democrats claim to believe have put him in the top spot? SAMUEL: Well, I mean, remember, this is really early in the process. Why is Joe Biden the front runner? I'll tell you why. Because he is Obama's friend. He is the guy from Obama. He is the guy from the onion. And as people are getting reintroduced to the actual Joe Biden, they are remembering why the first two presidential campaigns of his crashed and burned. He doesn't really fit the modern economic populism that is emerging in the Democratic Party, or at least that is trying to emerge. And I think that this sort of an impeachment investigation, in addition to what it'll say about the administration, which is great, whatever is true is true, will also be revealing about what sort of Democrat Joe Biden really is, and that's good because they're still trying to do something about it. CARLSON: Right? This guy who carried water for the credit card companies for decades. He is the senator from -- SAMUEL: Absolutely, he is the senator from MBNA, right? I mean, Joe Biden was Mr. Bankruptcy Reform. CARLSON: It's unbelievable. SAMUEL: He has no place in any party that is going to put the interest of working people first. It is implausible and the extreme. And he is not a person who can credibly say to people, look, if you're a working person who voted for Trump, because you thought he was going to make your life better, he lied to you, but you weren't stupid for doing that. But I really want to do something about it. Joe Biden can't sell that message, because it ain't true with Joe Biden. CARLSON: No, it's not. Defending the interest that they charge. They should be ashamed. Ian, thank you. Great to see you tonight. SAMUEL: Indeed. CARLSON: Well, Ilhan Omar, Alexandra Ocasio-Cortez and the rest of the squad are now firmly in charge of the Democratic Party. They are leading the charge for impeachment and raising money off of it. What does that mean for the Democratic Party and for America? We will tell you, next. (COMMERCIAL BREAK) CARLSON: Alexandria Ocasio-Cortez is not a genius, she doesn't know a lot, but what she lacks in impressive quality, she makes up for with pure aggression and moxie, and as a result, she and her friends now dominate and to some extent, control the Democratic Party. They're the ones pushing impeachment. (BEGIN VIDEO CLIP) REP. ILHAN OMAR, D-MINN.: A corrupt President who violates his oath in office must and will be impeached. REP. AYANNA PRESSLEY, D-MASS.: It is absolutely time to start formal impeachment proceedings. REP. ALEXANDRIA OCASIO-CORTEZ, D-N.Y.: What he has admitted to is already impeachable, regardless of future developments. REP. RASHIDA TLAIB, D-MICH.: I know it's time, it's been time. We must impeach this lawless President. (END VIDEO CLIP) CARLSON: Well, Congresswoman Rashida Tlaib, she is a charmer. The last one you saw there is selling impeach the mother-effer t-shirts online. Now, that of course echoes a promise she made well before the Ukraine controversy even existed. Ned Ryun is the Founder of American Majority and he joins us tonight. So, Ned, you know, for the first I would say, a couple months that the squad became prominent, it was a Republican talking point to say for obvious reasons that they're really in charge of the Democratic Party. But it's starting to kind of seem true. RYUN: Oh, absolutely. I think with every passing day, Nancy Pelosi is really Speaker in name only. The inmates have taken over the asylum, which isn't really that surprising, Tucker. The parasitic far left has been eating the Democratic Party from within for years, and now it's coming to the surface. And you're right, they are an amazing blend of ignorance and petulance and stupidity and hatred. I mean, the fact that they're selling shirts for $19.99, to which I say knock yourselves out, since Nancy Pelosi announced impeachment, Trump has raised $13 million for his reelect. But then you have Adam Schiff out there deciding that the chairmanship of the House Intel Committee is now platform for parity. It's pretty amazing to watch. The thing that's crazy to me is Dems are willing to destroy all of these norms because orange man bad. If you think about what's taken place over the last two and a half years, Russia-gate, collusion, Ukraine-gate -- all of this stuff. It's about one thing, Tucker. It's about policy differences. They cannot stand the fact that they are not in power and that Trump has a different approach to governing not only domestically, but on foreign policy as well. And so now their new approach in all of this, we shall impeach all things. We will impeach Kavanaugh. We will impeach Trump. Based off what? Nothing. Policy differences. CARLSON: So you've got to kind of wonder once these people take full control, formal control of the party and that's only a cycle or two away -- RYUN: That's right. CARLSON: Do people like Adam Schiff really believe they're going to continue to run committees? I mean, what does it mean, at least for Adam Schiff? RYUN: No, no, no, the amazing part is, if you study history, these revolutions have a way of eating themselves, just look at the French Revolution and Robespierre. CARLSON: Sure. RYUN: So I think they're going to start to realize this will eat -- they'll start eating each other. But as you go down this path, I think they are -- it shows how deranged they are. Look at the impeachment polls this week in the midst of all of this hysteria about Ukraine-gate, POLITICO/Morning Consult only showed 36 percent of the American people supporting impeachment of Trump. And if you get into the heartland, where I grew up, Tucker, impeachment dropped to the low 20s, and you start to think about how stupid they are when you get to the swing districts of Oklahoma 5 and Illinois 14, which are real pickup opportunities for the GOP in 2020. They're going to make those members watch walk the impeachment plank and lose the majority, I really do think so in 2020 if they continue to push this because I think impeaching Trump is a fool's errand being pushed by fools. CARLSON: We will see. Ned Ryun, great to see you tonight. Thanks so much for that. RYUN: Thanks, Tucker. CARLSON: Well, the White House -- this White House -- for the past three years has really been in some ways defined by the leaking. Now C.I.A. bureaucrats feel empowered to use anonymous hearsay to shut down the political process. That's not just a worry for the current President. It's a deep concern for all future Presidents who might try to defy the consensus here in Washington. Danny Coulson has been around the process for a long time. He is former Deputy Assistant Director of the F.B.I., and he joins us tonight. Danny, thanks so much for coming on. So -- DANNY COULSON, FORMER DEPUTY ASSISTANT DIRECTOR OF THE F.B.I.: Thank you, sir. CARLSON: This -- and I'm not saying this in a funny way, this is sincere. If you care about our system and you believe in the peaceful transfer of power and you believe that the people should rule in democracy, in other words, you don't want faceless, unelected bureaucrats wielding the real power, do you? COULSON: Oh, absolutely not. I think we're talking about leaks here. And that's where we get in big time trouble. They're very harmful. I've done several leaks at the White House, several investigations that were somewhat successful, but they need to close the faucet here, so that there has to be some things done in confidence. The American people do not need to know, don't need to know about everything that goes on in the White House, especially over conversations with another leader. So they need to close down the circle of access and get control of this thing. If not, this President and Presidents in the future can be plagued with this kind of stuff and they're going to be having the run around chasing their tails trying to stop it. CARLSON: You'll notice that the leaks are particularly common and virulent around foreign policy questions because the President's views on foreign policy contradict those of the of the foreign policy establishment here in Washington, particularly in Russia. They hated the fact that he said on the campaign trail that we should be closer to Russia. They hated that and found that unacceptable. So really, what you're seeing is permanent Washington deciding what you're allowed to say as a politician. That's scary. COULSON: It's very, very scary. And a lot of this has to do with ego at the White House, not just this White House, but every White House. Everybody wants to know what's going on, and the bigger the circle of knowledge is, the bigger the likelihood of leaks because you can hide among the crowd. If 30 people know about a conversation, then you leak it, the chances of finding you are very, very difficult. If there's four people who know about the conversation, then people are less likely to go out and leak information because they know they are going to get caught doing it. So it's a matter of securing your own people, securing your own -- the secrecy of what you do, which is good. Secrecy is important when you're dealing with foreign affairs because there's a lot of issues dealing with other leaders and whatever. So we don't need that people need to know every aspect of what's going on. And you have to take steps to secure that. That's why we have compartment information systems in the Intelligence service to keep the number of people knowledge close. CARLSON: This used to be obvious points. No longer. Thank you for reminding us of them. Danny Coulson, good to see you. COULSON: Thank you. CARLSON: Well, for the crime of doing a good deed, a young man in Iowa found his life basically derailed by \"The Des Moines Register.\" She used to be a newspaper and now it's an activist group. Cancel culture. That's what they're calling it. By the way, one of their own reporters fell to it. So the question is, why is the editor in charge of the newspaper facing no consequences? We will investigate that question, next. (COMMERCIAL BREAK) CARLSON: California has already become tragically famous as a ruined paradise. It's once beautiful cities are now covered in waste, needles and tent cities. Now, it has a new self-inflicted problem: organized shoplifting rings. Instead of siding with law-abiding citizens though, California State priority appears to be protecting criminals. Chief Breaking News Correspondent, Trace Gallagher has more on this story -- Trace. GALLAGHER: Tucker, these are called grab-and-dash crimes where groups of people rush a store, grab armfuls of merchandise and then flee and while the crimes are on the rise, arrests are on the decline. Police in Vacaville which is about halfway between Sacramento and San Francisco say that over the past year, there have been 746 retail thefts, and despite video all over social media and local news, more than half the suspects got away. And both law enforcement and the retail industry blame California's Proposition 47, passed back in 2014, the law more than doubles the amount a suspect can steal before facing felony charges. Before Prop 47, stealing $450.00 or more was a felony, now, it's $950.00. Police a criminals have done the math and realized the benefits heavily outweigh the consequences. First off, the odds are, you won't get caught. And even if you do, the fine won't be as much as what you stole, so it's win-win. And to increase the odds even further, groups of people are harder to track down than individuals, hence the major uptick in these organized retail thefts. Experts say criminals are also taking advantage of other police department policies by targeting malls and shopping centers close to freeways, because they know police won't risk a high speed chase for a misdemeanor. Finally, for safety reasons, many large retail stores are now telling their employees not to engage these grab-and-dash groups, so a lot of these crimes are not even being reported -- Tucker. CARLSON: It has fallen apart. Trace, good to see you tonight. Thank you for that. Well, we recently told you that pretty remarkable story of a young man called Carson King from Iowa. King raised a million dollars for charity for Children's Hospital and \"The Des Moines Register,\" the local newspaper rewarded him by digging into his personal history all the way back to high school, denouncing him for tweets he made seven years ago. For this, he was pilloried. Anheuser Busch, which had agreed to a partnership with him, dropped him. Now, in a fascinating coda to the story, Aaron Calvin, that's reporter who wrote the original story, has been fired himself after he was found to have offensive tweets on his Twitter timeline as well. Amazing. You know who is still though, at \"The Des Moines Register\"? Carol Hunter. She is the editor who made the call to publish the piece and to crush Carson King. She appears to be completely fine. And to be clear, we're not calling for her firing. We just think it's a little bit weird that the kid gets fired, and the person who makes the decision gets to stay. Is that fair? Joe Concha writes about media for \"The Hill\" and joins us tonight. Joe, is that fair? JOE CONCHA, MEDIA REPORTER, THE HILL: No, it is not fair. This isn't some rogue reporter, Tucker, that just writes a story and there it goes, out, published. There is a vetting system, and the vetting system starts with the senior editor that you just mentioned. She has a job tonight. And by the way, she only put out a statement, an op-ed basically explaining what happened, and we hear about news organizations publications demanding transparency from people in power that they cover. I agree with that completely. But in this case, she should be answering questions right now in terms of why she okayed it and why this reporter was thrown under the bus because he very easily, Tucker could have been on orders saying, why don't you to look into his social media history. And look, as a writer, as a reporter myself, if an editor tells you to do something, you do it. And when you submit a story, the editor can either pull that out or keep it in. But either way, ultimately, it shouldn't be completely your responsibility while the editors get away with zero responsibility. CARLSON: Well, that does seem right. I mean, her justification was -- and by the way, she's basically illiterate. I mean, for a newspaper reporter or editor, she can barely write in English, maybe it's not her first language. CONCHA: Right. CARLSON: But in her explanation, she said, we wanted to perform a background check on this subject. I'm just some kid who is giving money to a charity. There's no need for a background check, but we're going to do a background check. They didn't do a background check on their own hire? How does that work? CONCHA: Exactly. When do you need a background check by the way? It's completely irrelevant to the story. He raised more than $1. 7 million and yes, I mean, I think we have to start doing that now. And as a matter of fact, Tucker, I think the educational system starting at the high school level, and even Junior High should start and I am completely a hundred percent serious about this in their curriculum, a course that says, you know what social media behavior and consequences. Because guess what employers are doing now? They used to hire companies to do background checks. They don't do that anymore. They check your social media feeds -- your Twitter, your Instagram, your Facebook. One inappropriate tweet or Facebook post or picture and that can alter your career path. And I don't think enough kids, 16 years old in the place of Carson King when he put up those tweets, or even this writer, Aaron Calvin, I don't think anybody understands at that age that anything you put up into the public record is going to have consequences. No question about it. By the way, the reporter is speaking out tonight from \"The Des Moines Register\" who was fired and you're not going to believe what he said. You're not going to feel quite as sorry for him. He tells BuzzFeed, Tucker and I quote, \"This whole campaign was taken up by right wing ideologues and largely driven by that force,\" adding, \" ... it was just a taste of what I assume that women and journalists of color suffer all the time.\" I mean, are you kidding me? He is making himself a victim. He is the victim that the editor threw under the bus. But to say that, I mean, it's hard to feel sorry for him at this point, Tucker. CARLSON: It's said. I mean, who goes into the newspaper business now? You know, we're not sending our best into the newspaper business, as Trump would say. Unfortunately, I used to work in a newspaper, but it's true, unfortunately. Joe, great to see you tonight. Thank you. CONCHA: It's a dying breed. Unfortunately. CARLSON: It is. CONCHA: Thank you, Tucker. Have a great weekend. CARLSON: In the Democratic presidential race, moderates are no longer welcome. So where does that leave an old-fashioned Democrat like John Delaney who joins us to talk about his campaign, next. (COMMERCIAL BREAK) CARLSON: America currently receives more than a million legal immigrants every year. Also, we get hundreds of thousands, some unknown number, but certainly hundreds and hundreds of thousands of illegal immigrants moving here. A lot of polling on this, and it shows pretty consistently that Americans like immigrants. They work hard, mostly nice people. But they're not begging for much more immigration, and they're definitely against uncontrolled migration. They want their country to have a secure border. Why wouldn't they? Every population of every country in the world wants that. And they know that mass immigration puts a lot of stress on services. Public schools, for example. Now, that definitely depresses wages, especially for vulnerable workers. It drives up in equality. Dallas Federal Reserve President Robert Kaplan, meanwhile, has a message for Americans, the majority who think that way. And the message is, tough. Kaplan told us recently that America, in fact, must have more immigration. Period. And we're quoting now, \"If you think you're actually going to cut the number of immigrants,\" Kaplan said, \" ... and grow GDP, those two things do not go together. You need to grow the workforce,\" end quote. Hear that. He is telling you, you don't live in a country where happiness is influenced by things like social harmony, or equality, definitely by equality, or other factors. You live instead, and this is how our ruling class feels, in an economy. You live in a place where the only thing that matters is GDP and it must go up, always and forever, or else growth is what matters. And the only way to drive up GDP forever is to import more workers who will work for less. Investing in Americans who have fallen out of the workforce or helping American parents have more children way too hard and expensive. That's their position. Actual voters have a very different view. In fact, nobody in history has ever voted to turn their country into a GDP calculation. They at least don't care, they are not for elections anyway. So whatever. Well imagine being former Maryland Congressman John Delaney. He has been running for President longer than any other Democrat in the field. Delaney is a traditional Democrat. He wants his party to be a big tent. He wants it focused on bipartisanship and the core economic issues that face Americans. But over the past year, he has watched as a revolution has consumed the Democratic Party. A revolution obsessed with far out policies like seizing guns and decriminalizing illegal immigration. (BEGIN VIDEO CLIP) ANDREW YANG, D-PRESIDENTIAL CANDIDATE: Well, I mentioned before that we might not own our own cars. Our current car ownership and usage model is really inefficient and bad for the environment. O'ROURKE: Hell, yes, we're going to take your AR-15, your AK-47. CASTRO: When somebody comes across the border, not to criminalize desperation and to treat that as a civil violation. SEN. BERNIE SANDERS, I-VT, D-PRESIDENTIAL CANDIDATE: If somebody commits a serious crime -- sexual assault, murder -- they're going to be punished. They may be in jail for 10 years, 20 years, 50 years, their whole lives. That's what happens when you commit a serious crime. But I think the right to vote is inherent to our democracy, yes, even for terrible people. (END VIDEO CLIP) CARLSON: So that's not going to happen in the real world, but more to the point, normal people are not going to vote for you when you talk that way, and John Delaney knows that. He urged his fellow candidates to focus on making promises that maybe they can actually keep and when he said that, he got a scolding from Elizabeth Warren. Watch this. (BEGIN VIDEO CLIP) JOHN DELANEY, D-PRESIDENTIAL CANDIDATE: So I think Democrats when we run on real solutions, not impossible promises. When we run on things that are workable, not fairy tale economics. SEN. ELIZABETH WARREN, D-MASS., PRESIDENTIAL CANDIDATE: You know, I don't understand why anybody goes to all the trouble of running for President of the United States just to talk about what we were can't do and shouldn't fight for. (END VIDEO CLIP) CARLSON: That party is getting more radical by the day. So what does that leave someone like John Delaney? Well, we recently talked to him about that. And here's what he said. (BEGIN VIDEOTAPE) CARLSON: So the question is, has the Democratic Party changed irreversibly? Are we going through a moment, you know, a frenzy that will subside? And the party will get back to making economic arguments? I mean, put some perspective on this, if you would. DELANEY: I think we're going through a moment and I do think the party will get back to the party of my dad's kind of Democratic Party. My dad was a union construction worker. And he used to say, if you care about workers, you vote for the Democrats. And that's the Democratic Party that I grew up in. And I think we'll get back there. That's where I get the sense most Democrats are, but the loudest voices in the room are getting a lot of coverage right now and the activists have had a very strong kind of voice in the party and in many the D.N.C. has been enabling it -- this Democratic primary. CARLSON: So, the last point you're making and I'm not a Democrat, so I'm from the outside looking in, but it seems to be right, just from everything I'm reading and hearing, why would they do that? Because clearly, most voters are closer to where you are than to where some of these other candidates are. So what will be the point? DELANEY: You know, you never know who is really making the decisions behind the scenes. I mean, they're requiring a certain number of small dollar donations to qualify for the debates. Yet, we all know that the people who tend to make small dollar donations online tend to live in New York and California and tend to represent the more extreme parts of the party. I mean, half the American people can't afford their basic necessities. I'm running to help those people. They're not making a lot of donations to Democratic candidates online. CARLSON: Well, exactly. DELANEY: So I just think we've got our priorities all wrong in terms of how we're choosing who gets to debate issues on the debate stage in front of the American people. CARLSON: So in 1972, Democrats really hated Richard Nixon and they thought, you know, that attacking him personally would work. And they nominated the most radical person they could find, and then lost. And that lesson enabled Bill Clinton to win two terms, because he looks at that and said, you know, that doesn't work. Why have Democrats forgotten that lesson? DELANEY: You know, I've made that point. I mean, if you look at Mondale and Dukakis, they ran very far to the left. They turned off independent voters. They didn't run on core economic issues, kitchen table issues, pocketbook issues, building infrastructure, creating jobs, improving people's wages. But Bill Clinton, and actually Barack Obama, people forget about Barack Obama, he was the more moderate candidate in the 2008 primary, compared to John Edwards and Hillary Clinton. So that's the lesson we've got to remind ourselves. I mean, obviously, there's a lot of rage for the current President. But if we want to beat him, we have to capture independents and the way to capture independents is by running on things that a majority of the American people support, it's actually pretty simple. And what most people care about is, you know, their kid's education, their job, their healthcare, their pay, you know, opportunities for their kids, those basic issues that affect every American. We have to get back to that as a party. CARLSON: Yes, I mean, what you're saying is, I mean, and you can substitute Republican for Democrat. I mean, it's it -- you know, that's the substance. That's the core of politics right there. DELANEY: Think about your average American, right? They care about their job and their pay. They care about their kid's public education. They care about their healthcare and they want to know that the next generation, their kids and grandkids are going to have opportunities and they want to be safe. That's what most Americans care about. CARLSON: I know. It's not hard. It's so weird. It's so weird that you're one of the only guys saying that, but anyway, I'm glad you are. Thanks so much for joining us tonight, John Delaney. DELANEY: Thanks for having me, Tucker. (COMMERCIAL BREAK) CARLSON: Well, it's Friday. You know what that means? It's time for a \"Dan Bongino News Explosion.\" Bam. Our favorite former Secret Service agent on the big stories of a remarkable week, next. (COMMERCIAL BREAK) CARLSON: If there was ever a week for a \"Dan Bongino Friday News Explosion,\" it's this week. Our favorite New York City cop here to break down everything huge that happened. He also by the way has a brand new book, \"Exonerated: The Failed Takedown of President Donald Trump by the Swamp.\" Outstanding. Dan Bongino joins us. Congrats on the book, Dan, by the way. DAN BONGINO, CONTRIBUTOR: Oh, yes, thanks, Tucker. We lay out the blueprint, you know, they tried this scam before this Russian collusion thing. So I deeply appreciate you mentioning the book. But let's get to the news. Explosion because it's my favorite segment of the week. We have two stories this week, but really three because there's a tie for number one and stay tuned. We'll be giving out a special award at the end. So story number two, Hillary Clinton: Corruption fighter, Tucker. Warrior against corruption. Hillary Clinton. Get your bearings here. Listen, I have some props here for you. Here's the penalty flag. Hillary Clinton illegal procedure 15 yards. Corruption fighter? Now, what's the genesis of this? She claims Donald Trump and I quote, I had to write this down, Hillary Clinton, who is back on the scene again, is a corrupt human tornado. So Tucker, I don't like writing notes for the segment. But when it comes to Hillary Clinton's corruption, you need some notes. \"I had Uranium One pay to play in the Clinton Foundation,\" her Ukraine Pinchuk scandals, the Rose law firm spy game. Hillary, just to note, you may just want to sit this one out. I'm just saying. Pro tip on that. CARLSON: I think that's probably pretty good advice. BONGINO: Yes, you think so. Hillary Clinton, corruption fighter? Who knew, right? Okay, story number one. Now, we have a little competition. We're going to be giving out a special award today, and the winner for the Best Dramatic retelling of a Democrat fake news hoax. We have two contestants. We have Adam Schiff, who reinvented the entire transcript in the congressional hearing yesterday in the Ukraine call and told a totally different story, a hyperbolic story of what Trump said to the Ukrainian President. He was very gifted though, Tucker, in his retelling. I want to compliment him on his skills there. And then \"The New York Times\" decided they were going to get creative. Their opinion section and they put out a tweet with the \"Star Wars\" scroll telling what they believe to be the Trump story of corruption. Of course, of their fake news story. So Tucker, I have the envelope. We have a winner here. CARLSON: Who wins? BONGINO: Is attention building? The winner is Adam Schiff. Actually, this is an invite to my seven-year-old daughter's dinner party. Tucker, we have a trophy. Here it is. This is actually my daughter's lacrosse trophy from the Sticklettes Lacrosse, but you get it Adam Schiff, come claim your trophy. It's here in Palm City, Florida. CARLSON: You don't want him there. Dan Bongino, great to see you. Have the best weekend. We will be back Monday, 8pm. Have the bset weekend with the ones you love. Content and Programming Copyright 2019 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2019 ASC Services II Media, LLC. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of ASC Services II Media, LLC. You may not alter or remove any trademark, copyright or other notice from copies of the content.",
      "date": "September 27",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Tulsi Gabbard delivers stunning rebuke of Hillary Clinton",
      "url": "https://www.foxnews.com/transcript/tulsi-gabbard-delivers-stunning-rebuke-of-hillary-clinton",
      "subtitle": "Tulsi Gabbard delivers stunning rebuke of Hillary Clinton",
      "author": "",
      "content": "This is a rush transcript from \"The Five,\" October 18, 2019. This copy may not be in its final form and may be updated. JESSE WATTERS, HOST: Hello, everybody. I'm Jesse Watters along with Emily Compagno, Juan Williams, Dana Perino, and Greg Gutfeld. It's 5 o'clock in New York City, and this is The Five. Hillary Clinton is taking Russia hysteria to a new extreme as she continues the blame game for her 2016 loss against Trump. She's now speculating that the Kremlin is grooming one of the 2020 Democratic women as a spoiler third party candidate. Listen to this. (BEGIN VIDEO CLIP) HILLARY CLINTON, FORMER PRESIDENTIAL CANDIDATE: I think they've got their eye on somebody who's currently in the Democratic primary. And they're grooming her to be the third party candidate. She's a favorite of the Russians. They have a bunch of sites and bots and other ways of supporting her so far. And that's assuming Jill Stein will give it up, which she might not, because she's also a Russian asset. Yeah, she's a Russian asset. I mean, totally. And so, they know they can't win without a third party candidate. (END VIDEO CLIP) WATTERS: Hillary is obviously referring to Tulsi Gabbard who's already vowed to not run as a third party candidate. She's responded forcefully with this tweet. Ready? Thank you, Hillary Clinton, you, the queen of warmongers, embodiment of corruption and personification of the rot that has sickened the Democratic Party for so long have finally come out from behind the curtain. From the day I announced my candidacy, there has been a concerted campaign to destroy my reputation. We wondered who was behind it and why? Now we know. It was always you. Through your proxies and powerful allies in the corporate media and war machine, afraid of the threat I pose, it's now clear that this primary is between you and me. Don't cowardly hide behind your proxies. Join the race directly. Greg, this is exactly what you wanted to have happen on a Friday. GREG GUTFELD, HOST: Yes. Tulsi is a grade-A bad ass right now. She's like -- you know, she -- the reason why Hillary is going after her is because she is different. She's different than everybody up there. She sounds like, in many ways, a traditional liberal. She's not a hard leftist. She's not into identity politics. She thinks her own way and that bothers her. But, when you read this, you said they were obviously talking about Tulsi Gabbard. The reason why -- this is the other thing I didn't like about it that Hillary didn't mention her. But it was obvious it was Tulsi because CNN, they had a talking bot on CNN, saying she was a Russian asset and also the New York Times. So you could see that she was merely saying and echoing what you hear in the media. So, again, they're working from the same script. But maybe, Hillary is right. I mean, if you think about it, you know, here you have Putin is grooming a Russian spy, first to join the American military, right? And then after that Russian spy is in the military, then you run for Congress, OK, in Hawaii. And then you decide to run for president as a Democrat only to leave and then go independent in order to ensure that Donald Trump is president. The Russians must have been genius to predict that Trump would be president in 2020 to pull this off. She is so delusional, it's comical. WATTERS: What do you think the strategy is, Dana, behind this? DANA PERINO, HOST: I don't think there is a strategy. And I don't think she's going -- Hillary said this just because Tulsi Gabbard is different. I think Hillary said this because she truly believes it. WATTERS: Wow. PERINO: And that she has many people telling her this. Now, remember, Jill Stein was the third party candidate, and Hillary Clinton and her team truly believed that the Russians and Facebook cost them the election because Jill Stein got X amount of votes in Michigan, Wisconsin, Pennsylvania. They truly believe that. So now, Jill Stein is not on the scene anymore. Tulsi Gabbard has been having these accusations about her for a long time. And, like, to us it sounds like crazy town conspiratorial. Believe me, there are a lot of people who actually believe this. Tulsi Gabbard will have a press conference at 6:30 tonight where she will be able to be like, OK, great, thank you, Hillary Clinton, for now making me the actual star of the week. I don't think the primary is not between her and Hillary by any means. And now, let me say I could take it all back if I found out that Hillary Clinton said it to keep the controversy going, and her in the news for her book tour. WATTERS: Oh. GUTFELD: She won the week, though, you're right, because the debate was so boring. Now we remember Tulsi. WATTERS: That's right. Do you think this is for book promotion? JUAN WILLIAMS, HOST: No. I think it's very real. And I think, you know, you just look at the numbers. The reason this has been going around, by the way, is because Tulsi Gabbard has been supportive of people like Assad, and, you know, very open to Putin. I mean, it's just -- you can just look at the record -- GUTFELD: She's a spy. WILLIAMS: -- for yourself. I don't know if she's a spy. (CROSSTALK) WILLIAMS: Certainly, she's someone that the Russians would be interested in. And here's the key -- WATTERS: Can I ask you a quick -- WILLIAMS: No, let me finish this key political point which is, I had a friend in North Carolina in 2016, very far left activist, right? So, she calls after the election and she says hello, you know, I say, oh, yeah, you know, can you believe Trump won? She said well. I said, didn't you guys get out there for Hillary Clinton? She says, well, no. I assumed Hillary was going to win. You know what? I voted for Jill Stein. I said are you crazy? In North Carolina? North Carolina was won by Trump by I think 3 percentage points. You voted for Jill Stein? She said, yeah, because I wanted to have a protest vote. I'm sick of the establishment. That's the far left, Jesse. WATTERS: OK. WILLIAMS: You guys got to remember, it was 79,000 votes in three states, Wisconsin, Pennsylvania, Michigan, 0.8 percent difference in Wisconsin, 0.7 in Pennsylvania, 0.2 percent in Michigan. How did this happen? This happened because of Jill Stein and Gary Johnson. WATTERS: I don't want to dwell on it, but what do you mean when you say that Tulsi likes Assad and Putin? WILLIAMS: Oh, she's been very supportive of Assad. Remember when we were going -- remember when Obama was the red line. Remember -- everybody is complaining about the use of chemical weapons against his own people. She was very supportive. She said Assad is the legitimate leader of Syria. WATTERS: Oh, OK. COMPAGNO: OK. For starters, add Jill Stein to the still growing list of reasons why Clinton claims that she lost the election, right? Literally every day there's a new one, right? Misogyny, and Jim Comey, and the FBI, the bankruptcy, et cetera. And for all of her complaints about what she calls those things to be an intervening event, why is she then doing that now to Tulsi? And I think it's because, fundamentally, that, yes, she has a disdain for her because she's different. And we heard it on the Project Veritas' tapes from CNN who said they don't like her because she's unconventional. That's the point. There's an absolute intolerance from the left and, especially, from Hillary for anyone that thinks differently from her and, obviously, that's the reason why fundamentally she didn't connect with anyone and lost the election. Final point, for the former secretary of state to be throwing around the term asset, knowing full well what it means, is so reprehensible, to me. And I hope that CNN airs Tulsi's response at 6:30. WATTERS: So, I think it's also to promote the book. But I also think it is to set up which is the David Plouffe interview. I think it's to set up another excuse. If the Democrats lose again, they're going to say that there was, again, Russian interference. And it also validates the so- called interference from the last time. PERINO: So -- to do an interview with David Plouffe, he was the campaign advisor for President Obama. WATTERS: I hate how he spells his name also, Plouffe? P-L -- GUTFELD: Stick to the topic, Jesse. PERINO: So, Hillary Clinton might think, oh, I have a very receptive audience right now, right? And, basically, you feel very safe like you're only talking to your pals, but these podcasts actually go out to the whole world. WATTERS: Greg, did you hear that? Everyone is listening to your podcast. GUTFELD: I think she is dying to enter the race, because she's looking at the field and it sickens her, but there's one thing holding her back and that if she enters she won't be the frontrunner. That's like Jack Nicholson getting back into movies as an extra. She's not going to be able to handle that, and I think she's so invested in this delusion that it's affecting the entire environment. She needs to get a hobby, take her grandkids to Euro Disney. I don't know. Learn a musical instrument -- (CROSSTALK) WILLIAMS: Hold on, hold on. Greg, didn't you -- I think you were one of these people saying just earlier this week, Hillary Clinton may get back in the race. Remember -- GUTFELD: Yes. WILLIAMS: OK. And then you were saying Michelle Obama, she may get in the race. Oh this -- the debates, these Democrats are so stinky and boring. We need somebody with some energy. Then you have someone stand up and say, hey, wait a second, we have a good field. We have people, in fact, Elizabeth Warren is rising. Joe Biden -- WATTERS: Who said you have a good field? WILLIAMS: I say you have a good field. Not only that -- GUTFELD: He cornered himself. WILLIAMS: Not only that, when it comes to Tulsi Gabbard, Tulsi Gabbard, I don't think is going to qualify for the next round of debates. GUTFELD: That might change. PERINO: She might now. WILLIAMS: Those are Democrats. That's the Democrats making a judgment even before Hillary Clinton spoke. GUTFELD: The other point too, she isn't like Jill Stein. She's not a hard leftist. She's a centrist. That is why Hillary can't stand her because she's not like the modern left. WATTERS: And she has gone after the Democrats and she did it the other day. She said we shouldn't be speaking so much about impeachment all the time. And I think that makes a lot of hardcore leftist Democrats angry because that's all they want to talk about. GUTFELD: I think Bill is going to want to fly to Hawaii and investigate her. WATTERS: Yeah, that's right. All right, just don't borrow that guy's plane. Coming up, major enthusiasm for President Trump as he rocks the Dallas, Texas rally, highlights ahead. (COMMERCIAL BREAK) WILLIAMS: Trump supporters out in full force in Dallas last night to hear the president's 2020 message. He railed against potential Democratic rivals and he railed against the impeachment inquiry. Watch this (BEGIN VIDEO CLIP) DONALD TRUMP, PRESIDENT: The more America achieves, the more hateful and enraged these crazy Democrats become. Crazy. That crazy Nancy. She's crazy. And shifty Schiff, how about this guy? Sleepy Joe, I don't think he's got it. No, I thought Pocahontas was gone, left in embers. You've got to give her credit, those embers they kept going, going, going, and now it looks like she's doing better. (END VIDEO CLIP) WILLIAMS: The president also unleashing barbs on texts. And Beto O'Rourke, he was staging a counter rally nearby. (BEGIN VIDEO CLIP) TRUMP: Last week a very dumb Democrat candidate for president, that's the end of him in this state, pledged to revoke the tax exempt status of many churches and religious charities. That was after a few weeks ago he said, excuse me, we're going to take your guns away. That doesn't work well. And I told him, right. Remember the flailing arms. Nobody noticed it. I noticed it. (END VIDEO CLIP) WILLIAMS: Emily, do you think the president has any worry that Texas might be going blue? He seems to be showing up there a lot? COMPAGNO: He seems pretty confident, right? This is the 12th time he's visited Texas since taking office. That was more times than Obama went in both of his terms. So, I think that Beto arguing he can take Texas back and take those 38 electoral votes, 30,000 people outside of that arena beg to differ. I want to point out that those massive crowds, too, are the result, obviously, of this impeachment play by Democrats. And for those that argue, well, the numbers are growing for impeachment or for the inquiry, that still the top priority for very few of them. All that is doing is galvanizing all of those people there that are cheering for him. WILLIAMS: That's an interesting point, Jesse. In fact, there was a poll today, I think it said in Iowa, only like 6 percent of Iowaians think that impeachment should be -- or is their top concern. You can see the poll there on the screen. But, in fact, I mean, it is the case, as Emily was saying, that the numbers in terms of the people who not only want the president impeached but want him removed from office is also growing nationally. WATTERS: I like that poll that -- (CROSSTALK) WATTERS: -- all the other polls you site, I don't like them. WILLIAMS: OK. All right. WATTERS: Yeah, it was a huge crowd. It was at 20,000 inside, another 10,000 outside. No Democrat could get anywhere close to those kind of numbers. They couldn't do it in California, I bet. We'll see what Bernie can do here. I think this weekend he's got the squad here, and Michael Moore is going to be joining them. But speaking of crazy people, Tom Arnold tweeted an assassination joke about the president of the United States, you know, don't get cocky. The last time JFK was in Dallas you know what happened. Horrific. He actually deleted it how bad it actually was. And could you imagine if a famous celebrity said that about Barack Obama? It's horrible. And, you know, we've heard so many stories all week about how dangerous these videos are coming out of the Republican Party. Some small video on some small TV screen, like, you know, some Trump thing. This guy has millions of followers, major Hollywood celebrity assassination jokes about the president and no one is talking about it on CNN. GUTFELD: I disagree. He's not a major celebrity. WATTERS: Not a world class celebrity like you. WILLIAMS: Wait a minute, the president is not a major celebrity and they've got a video of him shooting his opponent? WATTERS: Did he make that video, Juan? It was Tom Arnold -- (CROSSTALK) WILLIAMS: All right, let's move on. Dana, you know, one of the arguments here is the Democrats are focused on impeachment, and so the rest of their agenda gets obscured. But this week what we've seen is, you know, Nancy Pelosi and her House crew unveiled the plan this week on education. They want to have a vote to lower drug prices. They passed the healthcare plan back in May that's stuck in the Senate. So, is it the cases that they are able to do two things at one time? PERINO: No, because -- think about -- Paul Ryan made this argument as well, right? That the House, when you have the majority, you can pass a lot of things. You can pass 232 bills and they would say we passed 232 bills, and now they're sitting over in the Senate, not getting any attention. And that's why the Democrats have decided Mitch McConnell is public enemy number one because he's not able to get their agenda done. They had a choice. They didn't have to do impeachment. And Nancy Pelosi held off for a long time so that she would be able to protect her members that became unsustainable. So, no, I don't think -- you can pass a ton of bills in the House. It doesn't matter if you can't get it done in the Senate. You can't show -- WILLIAMS: So, Mitch McConnell is the guy that should get the blame. PERINO: No. Why? Because Mitch McConnell doesn't want to pass bills that he thinks are not good. WILLIAMS: No, I think he doesn't want to pass anything. I think -- what is that phrase he uses for himself now? Grave -- something that he just -- everything -- WATTERS: The grim reaper? WILLIAMS: The grim reaper, there you go. Thanks, Jesse. WATTERS: You're welcome. PERINO: The other thing if I could just comment on the rally. I think going to Texas at this point it's not because you're worried about Texas. Texas, you have a huge base of support. You can do a lot of fundraising. And the other important thing is they have this amazing digital operation on the Trump campaign. And they go there, they get all the information. That way they can go back to them over and over again. Get out the vote. Make sure that those people's neighbors are getting out to vote. The energy is incredible. I think the Democrats are still -- they're having a debate about impeachment and they're also exceedingly worried about electability. If you're still talking on electability they don't have anybody that is like ginning up any enthusiasm. If I could use the word from previous days, in the week, ginning up does not mean anything to do with alcohol, it has to do with horses. WILLIAMS: Thank you horses. So, Greg, the president, boy, he was fired up last night. So he's saying that Warren is a bum. Schiff is shifty. O'Rourke is dumb. GUTFELD: Shocking. WILLIAMS: Pelosi is crazy. GUTFELD: Disgusting. WILLIAMS: And he says about that situation in Syria, there's a lot of sand. Let them fight like two kids, you know, before you pull them apart. GUTFELD: There's a great comparison to be made here. While thousands of everyday Americans were at a Trump rally, the establishment media covers the Al Smith dinner -- in the morning. And what they do is they cover an event where both face names, you know, tell speeches written by other people. That was the news. The news was Mattis roasting Trump at an event where people roast each other. That, to them, was more preferable than seeing what's happening on the ground in Dallas where America's cab driver, Donald Trump, is speaking their language and saying what everybody, the majority of Americans have felt about the Middle East forever. That there are different groups of people killing each other, and maybe it's time we move away and let them settle it themselves. By the way, Trump isn't a politician. He's a drug, and he gives people different experiences. So his supporters get a dopamine rush when they're there because they know what he's doing. He speaks to them directly. Meanwhile, the never-Trumpers, they also get a dopamine rush from what he says and what he does. Oh, my word, he says this. Oh, I can't believe it. They're getting high on the hate of him. But the bottom line is, he's closer to the ground than any of the Democratic politicians. That drives Joe Scarborough and the people like him nuts who now have to resort to calling everybody stupid, which is what Scarborough does when he talks about the rallies. He said these people are just stupid. And it's like, no, you just can't understand what's going on in America. You're stupid. WILLIAMS: But I think that -- you know, President Trump is so entertaining to your point. I'm not -- I think people love to turn out. Now, Dana makes a great point. She gets -- they get data out of this. But, I mean, the fact is Trump puts on a show. I don't know if that means people are going to vote for him. WATTERS: Well, they did last time. WILLIAMS: Well, remember who won the election in terms of popular vote. WATTERS: The popular vote. (LAUGHTER) (CROSSTALK) WILLIAMS: Most Americans who wants to hear from them. Hear what Mark Zuckerberg has to say about anti-conservative bias on Facebook. Ms. Dana shares more of her exclusive interview with Zuckerberg, next on The Five. (COMMERCIAL BREAK) PERINO: Facebook CEO, Mark Zuckerberg, is one of the most powerful people on the planet. As the social media platform he runs dominates our digital and political lives. We sat down for an exclusive no holds barred interview where I asked him about a lot of issues including perceived bias against conservatives and free speech. Take a look. (BEGIN VIDEO CLIP) PERINO: Do you believe that there is a bias against conservatives in Silicon Valley? MARK ZUCKERBERG, FACEBOOK CEO: Well, it depends on how you say it. I don't think that the services themselves, I haven't seen a lot of data that suggests that there's a negative impact. In fact, a lot of conservative media does quite well on social media. Not just Facebook, but with the others as well. But, look, I mean, California is an overwhelmingly left leaning place. I understand why people would ask the question of -- are my ideas getting a fair shake? And all that I can say on this is this is something I care deeply about. I want to make sure that we can be a platform for all ideas. (END VIDEO CLIP) PERINO: So there -- this has been going on for a while that there's a perception that there's a bias against conservatives by -- maybe not him in particular, but employees at Facebook, or across Silicon Valley, and it's something they're trying to deal with. How do you think they've done so far? COMPAGNO: I think they've done a poor job of managing it, frankly, especially the messaging, right? So he -- what was interesting about his answer is that he talked about the services. He said the services are -- you know, there's no data supporting the conservative bias. But that's parsing language, right? We knew that in a Lincoln Tower survey, 90 percent of his employees said that if they were conservative they were unsafe at work or felt unsafe at work to talk about it. That's why Facebook conducted that internal audit, right? We had 100 Facebook employees report that they would be attacked by their colleagues. And I just, you know, just conceptually talking about this, I can't help but think that it gets baked into the software, because the whole point is that the data is difficult to qualify, obviously. PERINO: They have tried to deal with that in different ways. But he also said that he admitted later in the interview that -- I think over 95 percent of donations from people that work in Silicon Valley goes to Democrats. WATTERS: Yeah, not only they've done it to Hillary the last time. A lot of the executives in Silicon Valley were joined at the hip with the Hillary Clinton campaign. They were joined at the hip with the Obama campaign. The Google people, a lot of those people were almost working with those campaigns. And I agree that a lot of conservative people do have success online. But when it comes to banning or shadow banning a Dave Rubin, Ben Shapiro, Dennis Prager, the list goes on and on. Diamond and silk our favorite ladies. You know, you wind up, you turn your computer on, and the next thing you know you get one view on a video when you had 55,000 the last couple of weeks. It doesn't make a lot of sense what people accuse him of political bias by the people that write the algorithms. Why is it that conservatives continue to get banned when liberals don't? PERINO: He gave a speech yesterday, Greg, about free speech on the same day that twitter said that they were going to start de-platforming some of President Trump's tweets. GUTFELD: That is quite a comparison. PERINO: I mean, what is going on? GUTFELD: What is going on? By the way, that's a no holds barred. What is a holds barred interview? What's a hold barred? PERINO: I don't know. GUTFELD: I don't either. PERINO: Oh, maybe you can find one on Saturday night. GUTFELD: So, anyway -- that was mean. So he admits -- WATTERS: She's getting you back. GUTFELD: I was joking about the word. WATTERS: She was joking. GUTFELD: All right. He admits that the platform or the social media industry is overwhelmingly liberal, right? But he says it doesn't have an effect on access for conservatives. I would argue that's because the customers are doing a lot of the policing. The customers are throwing a racket. If the Right wasn't throwing a racket, it would get pretty bad. So, they're the ones doing it. He's up against something when you're talking about the employees. Where are these employees coming from? They're coming from colleges with garbage majors. Where do they go? They go into HR. They go into PR and they make - they infect the work world with their identity politics, their intersectionality politics, and makes it hard for other people, conservatives to work there. PERINO: Do you think the engineers too? GUTFELD: Well, the engineers just be quiet. PERINO: But they're the ones-- GUTFELD: Engineers don't care about politics. They just love to engineer. PERINO: They want to code. GUTFELD: I've got an engineer in my family and they don't - they just want to do their job. PERINO: They're like shut up and code. GUTFELD: Yes, Exactly. WILLIAMS: All right. Let me just say, earth to this Right-wing spaceship. Have you noticed that this very week you have Donald Trump dumping on Joe Biden without any basis, lies, propaganda? It's right there on Facebook. Nobody stops it. They allow it. You have things like that video of Nancy Pelosi appearing drunk, doctored video-- GUTFELD: By who? WILLIAMS: Nancy Pelosi says, please take this down. It's obviously wrong. What does Facebook do? No, we can't do that. PERINO: But that was the-- WILLIAMS: Hang on. So, what does he do? He goes to Dana and he says, oh, yes, this is a First Amendment issue. We protect free speech. You know what? He's protecting his profits. That's all he cares. PERINO: They don't even make - they make about pocket-- WILLIAMS: That's why. PERINO: On political win. WILLIAMS: That's what I said to you yesterday. PERINO: OK. But I don't think that's - why - the only thing that that would help is people who are already established. WILLIAMS: No, I think - that's his argument. His argument is that small time politicians. But what we see is what we know from the 2016 campaign. These guys are going on about is the Russians, the Russians were so aggressive in using Facebook to divide America. WATTERS: The Nationals are in the World Series. WILLIAMS: Forget about it. WATTERS: Relax. They're in the World Series. WILLIAMS: Zuckerberg gave an interview, shut up about it. PERINO: I'm going to make you a promise in the next block, we are not bringing Russia up, not once. OK, Lady Gaga gives fans a scare of a lifetime. That shocking video is next in the Fastest 7. (COMMERCIAL BREAK) COMPAGNO: Welcome back. Time for the Fastest seven. First up, Lady Gaga shocked fans in Las Vegas after tumbling off the stage. (VIDEO PLAYING) COMPAGNO: We legitimately thought she was dead, said one fan. But don't worry. The singer is OK. Getting right back on stage and posting these photos of her ice bath later after the concert. This is what happens when you bring amateurs on stage. So, she fell off because literally she brought a fan. WATTERS: How do you think I feel. Sorry. COMPAGNO: She brought a fan onto the stage and they were dancing, and they fell off. Yes, that was a fan. WATTERS: I know. COMPAGNO: But I can't talk as I have fallen once. WATTERS: Well, I honestly think this is good for her career. This is good buzz. GUTFELD: She needed help. WATTERS: This is viral. She needed help. Honestly, you haven't heard a thing about Lady Gaga for years. PERINO: I mean, Hillary Clinton is not doing that. WATTERS: Maybe she should, besides the Oscar nomination. I do like that-- COMPAGNO: Who is the amateur. GUTFELD: All right. You know, this is why I've eliminated any kind of like contact with my fans, on my show. But I have - do we have a picture from - this is me with Tom Shillue. Do you know what I'm doing there on live shows, do you know what I'm doing there? I'm imitating Jasper? When you're sitting in a chair, and Jasper decides that he's going to sit on the chair. Yes-- PERINO: Is that true? GUTFELD: I do that in my show. COMPAGNO: Did he know you were going to-- WATTERS: That's disgusting. PERINO: Someone send me a video of that, I want to play. COMPAGNO: Juan. WILLIAMS: Well, I think a new meaning to that old phrase. Break a leg. I'm just so impressed with her, because I think that if someone whose weight is on top of you when you fall, it could be crushing. And she got back up. Not only did she perform, she then showed that she was taking pictures with people after. I mean - she's a great performer. COMPAGNO: She is. GUTFELD: She is. PERINO: One of the best things for your career, if you can fall off stage, just kidding. I have nothing left. I'm offended by the ice bath. I mean, I think those are bad. WATTERS: Really? PERINO: Yes, they're bad for you. WATTERS: Why? PERINO: Oh, no, just wait. There is a study coming out. COMPAGNO: I remember the opening scene of White Nights with Baryshnikov. OK, next. GUTFELD: Yes, I do remember. COMPAGNO: Yes. Never mess with someone's morning commute, climate activists in London had to learn that the hard way after climbing on top of a train during rush hour. Watch what happens next. (VIDEO PLAYING) COMPAGNO: I love this, did you hear what that one guy shouted? He said, I need to get to work to feed my kids. Protesting during 9 to 5 is a luxury, especially when all you're doing is preventing people from working and feeding their kids. I loved it. GUTFELD: Yes. I mean, activists must have it easy. There are people that are probably half sick kids, they need to go to the doctor, and they don't have the luxury of being able not to worry about those things and to disrupt people's lives. The thing that got me mad was there was a group of British musicians, well-off musicians like Thom Yorke and Brian Eno supporting with the extinction organization, because they don't have to use this transport. If they want to go, they could just fly first class, or they can fly private. So, they advocate the hindering of their own fans. I mean, what if these guys tried to shut down a Radiohead concert? I wonder how Thom Yorke would feel. WATTERS: It's called the Tube. Did you guys know that? GUTFELD: Yes, I lived there. WATTERS: For those of you guys that don't know or have never been to London, they call the subway there a tube. And by the way, isn't that how you're supposed to commute through the tube if you believe in global warming, right? PERINO: Yes. WATTERS: They should be out there on streets protesting those little cars on the other side. Did you guys know that they drive the car on the other side of the road in London?\n\n \n\nGUTFELD: You are a thought of well-being. PERINO: Well, one thing you might not have known, Jesse, is that those protesters, they were a bunch of merchant bankers. WATTERS: Merchant bankers. GUTFELD: Nicely done. WATTERS: You mean merchant wankers. WILLIAMS: That was good. WATTERS: Thank you, Juan. WILLIAMS: That was good. COMPAGNO: OK, the third topic. WILLIAMS: Allow me to say, they were rolling. That was terrific. COMPAGNO: OK. Finally, we use a lot of brainpower on The Five, obviously. So, we were alarmed when we saw this study that says you might die earlier in life if you think too hard. Scientists coming to this conclusion after comparing the brains of 100-year old to those who died in their 60s and 70s, this terrified me, obviously-- WATTERS: Why, you're going to live forever. (LAUGHTER) WILLIAMS: You are doing it today. WATTERS: Go ahead. GUTFELD: Jesse, this is - either your greatest or worst segment. WILLIAMS: Yes. COMPAGNO: OK, fine. PERINO: When I first saw this headline, I thought it said, thinking too hard might make you short. I didn't say - because it's cut off, it didn't say shorten your life. And I thought well that's what happened to me and Greg. I just think too hard. COMPAGNO: Yes. WILLIAMS: That would be - but I tell you what, I initially took this seriously. Then I kept reading and it really wasn't about thinking too hard. It was about having too much neural stimulation constantly. And, you know what came to mind is, they tell you if you want to go to sleep at night, don't read the iPad or don't look at that. And that's just constant stimulation. It's not that you're thinking hard. It's just that your brain is zooming. WATTERS: Read a book. GUTFELD: Or it could be really dumb people who need to think extra hard to do basic things, which is why I worry about Morning Joe. WATTERS: Oh, man. That's twice Joe got hit today. GUTFELD: Yes, he deserves it. COMPAGNO: All right. She's mad at you. WATTERS: Still. COMPAGNO: Not at everybody. All right. Fan Mail Friday is next. (COMMERCIAL BREAK) GUTFELD: Yes. Fan Mail Friday, it's more than a feeling. First question. Boy, I sound loud, Emily. Matthew asks, whose mind would you read if given the choice? Juan. WILLIAMS: I guess, great mathematician. I would really like to know how you think. In other words, because I'm interested in how you think about the world. Someone once told me that great musicians and great mathematicians think alike because music is a mathematical form. So, I'm very interested because - both of those, I'm not a bad mathematician when I was in school. But now obviously you ask me two and two, it's going to be a problem. GUTFELD: Jesse. WATTERS: Well, I wouldn't read yours because we all know what you're thinking. You say everything. GUTFELD: That is true. WATTERS: I mean, you should see him in the green room. It's like a constant stream of consciousness. We don't want to know all that stuff you're thinking, but you share it anyway. GUTFELD: I've got to get it out of my brain. I've got to get out on the floor. I've got to spray it on you, Jesse. WATTERS: That's disgusting. No, I don't know. I don't know. Maybe, Vladimir Putin. GUTFELD: Yes. I'm not supposed to mention-- PERINO: No, you can't say that. WATTERS: I'm sorry, Juan, sorry to bring that up. GUTFELD: Dana. PERINO: Well, I was going to say Jasper before Juan's answer. GUTFELD: An animal. PERINO: Yes, I think I would love to know what he's thinking. I mean, I would love - that would be. GUTFELD: What if he didn't like you? WATTERS: He likes Peter so much more. Here she comes again. GUTFELD: You'll be like heartbroken. WATTERS: Stop putting me on Instagram. GUTFELD: I'm a dog, not a model. Emily. COMPAGNO: Like every boss, you know, like realistically. PERINO: I don't want to know. COMPAGNO: Every producer in this building. I would like. PERINO: No, I would not want to know. GUTFELD: I figured everybody was going to say the wife. You would avoid-- PERINO: You want to know? GUTFELD: Well, yes. That would avoid so many issues. WATTERS: You can just ask her what she's thinking, Greg. She is your wife. GUTFELD: All right, Ernie. Well, I can't even say this name. What is the thing you cringe at when you see and slash or hear yourself on TV? Emily? COMPAGNO: God, just like - I think when - like this moment, right now, yes. GUTFELD: This moment, you're cringing. COMPAGNO: Yes. I think whenever I like to do things like that, and then you make fun of me later and I'm like, oh, God, WILLIAMS: You've got to stop letting people bully you. You're doing great, kid. COMPAGNO: Thanks. WATTERS: He doesn't mean that. GUTFELD: That's not going to help her, Juan. WILLIAMS: Don't help her. GUTFELD: You've got to keep her down. WILLIAMS: OK. GUTFELD: Hey, Juan, so what thing do you cringe at when you're like you're watching yourself on TV, if you do? WILLIAMS: Well, that's pretty rare. But I often think dang, what happened to the young guy, where the young guy goes. I mean, obviously, I get uptight sometimes about my hair, I think - why is that? What happened to all that hair? WATTERS: Yes, me too. I don't really listen to what I say. I look at how I look. GUTFELD: Yes. WATTERS: I'm like, oh, my tie is crooked. My hair looks great. You know, I look stupid. My tie is crooked? OK. There you go. PERINO: I can't stand the sound of my own voice. And I would rather die than watch myself on television. GUTFELD: But your noise sound person, right? Every. It's always something about noise. It's people's phones. People's voices. PERINO: I think most people don't like the sound of their own voice, right? GUTFELD: I love the sound of my voice. WILLIAMS: But I'm interested in Dana saying that because I - sometimes Dana says that female politicians, you can't stand their voice. GUTFELD: Yes, everyone. PERINO: It's not just me. WATTERS: Tulsi, right. GUTFELD: Tulsi has got a great voice. But I'm with-- PERINO: Women as politicians have a harder time-- GUTFELD: Because of other women. PERINO: Because of their voice. WILLIAMS: Because of other women? GUTFELD: All right. I'm with Juan though. When I see myself on TV, I just go, what happened? What happened? Because before you know, you become this other person. But it's so gradual until you turn on the TV, you, holy crap. I'm like, I'm almost 30. What is the last thing you do before going to bed? And you have to keep that one clean. Jesse, what is the last thing you do before going to bed? WATTERS: I brush my - I say my prayers. GUTFELD: Oh, there you go. PERINO: Do you read the Hobbit. WATTERS: I should though. I should pray more. GUTFELD: That's nice. Dana, you should pray more. It's not going to help him, but-- WATTERS: Great for me. PERINO: What do you think? GUTFELD: I don't know. PERINO: I set my alarm. GUTFELD: There you go. PERINO: I don't even use it a lot. GUTFELD: This is like a Family Feud question. PERINO: Yes. I don't want to answer it. WILLIAMS: I read books at night. GUTFELD: Yes, especially as it gets later, you're just like I'm tired, I'm done. I'm going to sleep. COMPAGNO: Literally, last step is putting in my earplugs. GUTFELD: You put in earplugs. PERINO: Every night? COMPAGNO: Yes. GUTFELD: Where do you live, above a train? PERINO: I should just put in earplugs for like my whole like all day. GUTFELD: Yes. That's what you should do. COMPAGNO: I travel with earplugs in like start to finish. PERINO: Really. COMPAGNO: 100 percent. WILLIAMS: But do you have blinders. Do you have eye covers too? COMPAGNO: But like if I'm in an airport, I have earplugs in. WILLIAMS: Wait a minute. So, your husband is sleeping next to a woman whose ears are plugged and eyes are covered. COMPAGNO: Yes. Not all the time with the eye mask. But all the time with the earplugs. Like 1000 percent, WATTERS: You have no idea what he's saying to you. GUTFELD: Last thing I do before going to bed, I walk home. Do we have time? Oh, no, One More Thing is up next. (COMMERCIAL BREAK) WATTERS: Time now for One More Thing. Dana. PERINO: It's been a little bit of a long week. GUTFELD: Has it? PERINO: So, we need some of this. Okay, first one, why did the man stop selling computer parts? Emily. COMPAGNO: I love this segment. GUTFELD: He ran out of drive. PERINO: Yes, he lost his drive. WATTERS: No way. PERINO: OK. How does a computer get drunk? GUTFELD: Hardware. PERINO: It takes screenshots. OK. Why did the PowerPoint cross the road? WATTERS: To get to the other slide? PERINO: Yes. Very good. Why was the cell phone wearing glasses? It lost its contacts. OK, last one, how do trees use a computer? They log in. WATTERS: That was a tough one. PERINO: Very good though. Pretty good for a Friday. Pretty good. WATTERS: All right. New segment, Jesse's Fake News Alert. You're going to be seeing a lot of these. All right. So, I wake up this morning and everyone's on Twitter saying, I'm a bad tipper. It turns out some clown clipped me saying, you know, when - I'll show you what I said. (BEGIN VIDEO CLIP) MARTHA MACCALLUM, HOST: The thing that really tips me off is the iPad thing that they hold up in your face after they give you coffee and say like, do you want to tip me 10, 15 or 20 percent and just like putting- - WATTERS: Yes, right in front of them. MACCALLUM: I hate it. WATTERS: I'm not afraid to go zero. MACCALLUM: You're not. GUTFELD: Of course, Jesse. WATTERS: Well, I mean, all you're doing is handing me coffee. You get a tip for that? (END VIDEO CLIP) WATTERS: All right. So, I'm talking about a coffee shop people. I'm not talking about a $500 meal in a restaurant. Of course, I tip 20, sometimes 30, sometimes 40 percent. GUTFELD: Those $500 meal restaurants you go to, you are man of the people. You are digging this hole so fast. WATTERS: What I'm trying to say is that I tip very well. All right. I only stiff sometimes a Barista if they're just giving me the coffee. PERINO: No, don't stiff the Barista. WATTERS: And or if I pay cash, which I do mostly. I'll just stick a dollar in the cup. But I want to make sure they see me stick the dollar. PERINO: Always give a dollar. WILLIAMS: Such a selfless guy. GUTFELD: I think you just gave the guy who clipped you something else to clip. WATTERS: Yes, also Watters World. We have Mike Rowe. We have Senator Rand Paul. And we also have Democrats with Trump Derangement Syndrome letting out some rage in a rage room. GUTFELD: All right. So, I'm going to plug The Greg Gutfeld Show tomorrow, October 19, 10 PM. Joe DeVito, Emily Compagno, you know her, Kat Timpf, Tyrus, that's 10 PM, watch it or I will haunt you to your grave. Now let's go to this. Greg's porcupine eating a pumpkin news. This happens a lot, by the way. Let's go to the tape. This is Rico. Here's Rico. He's at the Cincinnati Zoo. We were actually there, weren't we? There he is enjoying some pumpkin. Yes, it is cute. Emily. COMPAGNO: What is that? GUTFELD: It's a porcupine if you're listening. PERINO: It's not a hedgehog? WILLIAMS: Did we go to the Columbus Zoo? GUTFELD: Yes, we went to the Columbus Zoo. It begins with a C, Juan. PERINO: Isn't that a hedgehog. (CROSSTALK) GUTFELD: I don't like anybody here. WATTERS: All right. Juan. WILLIAMS: All right. So, you know what, girls just want to have fun. GUTFELD: Do they? WILLIAMS: Take a look at these American astronauts, both women, on a five hour spacewalk outside the International Space Station. That was a moment of history, folks. It was the first all-female spacewalk. It's been 54 years since humans first walked in space. This comes a few months after NASA canceled an all-female spacewalk because they didn't have enough suits that fit women. Now, women have been out on spacewalks before. Keep that in mind. But only with male colleagues. So, this was a first. The two Americans, Christina Koch, Jessica Meir are the 14th and 15th women ever to walk in space. All but one of the others are retired. And as you can see from these pictures, they're at there, having a ball. Americans just want to have fun. WATTERS: Donald Trump really breaking new ground for women in space. WILLIAMS: Yes. That's him. WATTERS: Unbelievable. Go ahead. COMPAGNO: OK, you guys, do you remember this? (VIDEO PLAYING) COMPAGNO: Yes. OK, Booking.com is doing a Halloween pop up where you can literally rent the house. The Addams Family House and stay in it. It's just around $100 for four people at night and they are doing it like to the end degree, decorated in true fashion bases of just rose stem, you rang Bell. How awesome is that, by the way? I thought it was real. Just a pop up. But it's the next best thing. And also, I couldn't find my Halloween picture of me and like, age 10 or 11 when I was (inaudible). Drop the mic. WATTERS: I didn't know Addams had two D's in it. Get back in Monday everybody. Have a great week. Content and Programming Copyright 2019 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2019 ASC Services II Media, LLC. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of ASC Services II Media, LLC. You may not alter or remove any trademark, copyright or other notice from copies of the content.",
      "date": "1 day ago",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Spoiler alert? Hillary Clinton claims Russia uses candidates as assets",
      "url": "https://www.foxnews.com/transcript/spoiler-alert-hillary-clinton-claims-russia-uses-candidates-as-assets",
      "subtitle": "Spoiler alert? Hillary Clinton claims Russia uses candidates as assets",
      "author": "",
      "content": "This is a rush transcript from \"Special Report,\" October 18, 2019. This copy may not be in its final form and may be updated. BRET BAIER, HOST: Podcast with David Plouffe. Former secretary of state, former candidate for the Democrats saying that Tulsi Gabbard, a current candidate, is a Russian asset. Tulsi Gabbard firing back on Twitter. She may fire back live here on our show. \"Great! Thank you, Hillary Clinton. You, the queen of warmongers, embodiment of corruption, a personification of the rot that has sickened the Democratic Party for so long, have finally come out from behind the curtain. From the day I announced my candidacy there has been a concerted campaign to destroy my reputation. We wondered who was behind it and why. Now we know. It was always you through your proxies and powerful allies in the corporate media and war machine, afraid of the threat I pose. It's now clear that this primary is between you and me. Don't cowardly hide behind your proxies. Join the race directly.\" We will start directly there with this late-breaking news. Let's bring in our panel, \"Washington Post\" columnist Marc Thiessen, Johanna Maska, former aide to President Barack Obama, and Mollie Hemingway, senior editor at \"The Federalist.\" Marc, this was a shock. We were planning to lead with something else, and then suddenly it just came. MARC THIESSEN, AMERICAN ENTERPRISE INSTITUTE: My question is, how does she know? Did she find out from Fusion GPS? Did Christopher Steele give her a secret dossier on Tulsi Gabbard? Look, Tulsi Gabbard now understands how Donald Trump feels. He was called a Russian asset. He was called a Russian agent. And it wasn't true. So welcome to the party, Tulsi. (LAUGHTER) BAIER: If Democrats were trying to somehow squelch Tulsi Gabbard's effort in the primary, this wouldn't seem to be the way to do it? JOHANNA MASKA, FORMER PRESIDENT OBAMA AIDE: No, and I don't think it's responsible to call a member of our military, a veteran, a Russian asset. So I don't think that's a helpful comment. And I think you're going to see a lot of Democrats come out and say same. I'm kind of surprised that she made the comment and that it made the podcast. But there it is. BAIER: You would have edited that out if you were David Plouffe? MASKA: I don't think he needs the attention. So, yes. BAIER: It was quite something. MOLLIE HEMINGWAY, SENIOR EDITOR, \"THE FEDERALIST\": She is currently enlisted in our military, and she enlisted after 9/11. This is a woman who is being called a Russian asset by Hillary Clinton because she has foreign policy views that differ from hers. And it is very reminiscent of what happened with President Trump. But it's also what happens when you don't hold people accountable for perpetrating the Russia hoax. That was something that was invented by the Hillary Clinton campaign with the Democratic National Committee. They secretly funneled money to create that operation. It got disseminated through the media. It was weaponized by the government. No one has been held accountable for it. And in fact, she is still out there repeating these same conspiracy theories with different targets. BAIER: The theory is that Jill Stein, the Green candidate, was also paid by the Russians to get in there and take votes from Hillary Clinton. She is now saying I would like to have a debate with Hillary Clinton. I didn't get that the first time in 2016. THIESSEN: She still is coming up with reasons why she didn't win. BAIER: Hillary is. CONTINETTI: Hillary is. It's never like I should have gone to Wisconsin. I should have gone to Michigan. I should have cared about people in the middle of the country who we were ignoring. So Hillary has all sorts of things. But it also shows how unserious they are about the Russia threat. It's all a political game for them. After the Mueller report came out, if they really cared about the threat from Russia, they would have said OK, Donald Trump didn't collude with the Russians, but this is a real threat. Let's do something together, Republicans and Democrats, to protect our democracy. And instead they dropped it because, well, if it's not going to help impeach Donald Trump they are not interested. But on what Mollie said is, John Durham is doing his investigation. We still may get some responsibility, people held to account for what happened. BAIER: We should point out that Congresswoman Gabbard said originally, or her team said 6:30. So she is running a little bit late. If it does come on, we'll show it to you here on FOX. Meantime, Johanna, there is still fallout from the White House chief of staff and how it is being interpreted what he said yesterday. Take a listen. (BEGIN VIDEO CLIP) REP. DAN KILDEE, D-MICH.: Mick had a moment of truth, and then realized that that was not going to be good for the president and had to walk it back. REP. JOHN RATCLIFFE, R-TX: Mick Mulvaney was right. Look, we withhold foreign aid to influence foreign policy decisions all the time. REP. FRANCIS ROONEY, R-FLA.: Whatever might have been gray and unclear before is certainly quite clear right now that the actions were related to getting Ukraine to do some of these things. TRUMP: I think he clarified it. (END VIDEO CLIP) BAIER: Kind of clarifying what he said, and then he put out a statement yesterday afternoon trying to do the same thing. MASKA: Yes, there is a lot of clarification. If I was under an impeachment inquiry, I would have message control. But President Trump has proven with his proactive communications that he is always keeping himself in the offensive position. Yesterday, he made Mick Mulvaney go out and do that. I don't think that was a coincidence. He said you need to go out here and deliver this really bad news that everyone is going to take poorly. BAIER: Not only that but also say that G7 is going to be at my place in Doral. MASKA: And that's the whole thing. And even the fact that he was using there, I was at the Camp David G8. I helped to plan it. And I remember the positive feedback we got from world leaders who got that intimate feeling at Camp David, which is an extraordinary site. So to throw that under the bus and say that it wasn't a good summit, when literally the U.K. duplicated that summit with Lough Erne the next year, it was just factually inaccurate. I knew he was thrown out there without much information, but it seems like he was put up for a very long time and said things he probably regrets. BAIER: We are going to do winners and losers, but your thoughts on this day, the fallout from that, but also we learned that George Kent who testified on the Hill said that they warned about Hunter Biden and this Ukraine company in 2015. HEMINGWAY: Yes, so you are seeing a lot of this with the testimony that's being provided. It's not matching up with what Democrats are hoping for. Each finding out that people care about when we give $400 million in taxpayer aide, we want it to go to a country that doesn't have corruption problems is not a high crime and misdemeanor. Learning that there was a whistleblower about Hunter Biden and that a member of the Biden staff pushed back on that is not what the Democrats are hoping for when they are trying to go after Trump. BAIER: I don't have a lot of time, so we're going to stay positive. Very quickly, we are only going to do winners. Let's go, winners down the row. THIESSEN: My loser is you, and me, and all of us who had to watch the Democratic debate instead of watching the Nationals win the pennant. MASKA: No, no. (LAUGHTER) THIESSEN: My winner is Charles, because Charles Krauthammer would have loved this moment. BAIER: There you go. MASKA: I am so happy. I only wanted to do a winner. So that's so lovely. It's the Carters. The Carters have now been married for 26,766 days, making the longest marriage of a presidential couple, just overtaking George H.W. Bush and Barbara Bush. And I have to say, so many congratulations because I love a happy marriage. HEMINGWAY: My winner is you for your new book that is coming out, \"Three Days at the Brink.\" BAIER: She is going to be back on the panel so often. (LAUGHTER) HEMINGWAY: Congratulations. THIESSEN: I shouldn't have made you my loser. (LAUGHTER) BAIER: Thank you very much. I appreciate that. Two week tour coming up, 12 cities. So check it out. Panel, thank you very much. When we come back, \"Notable Quotables.\" (COMMERCIAL BREAK) BAIER: I just never know what's happening in the break. Finally tonight, \"Notable Quotables.\" (BEGIN VIDEO CLIP) MIKE PENCE, VICE PRESIDENT: Today, the United States and Turkey have agreed to a ceasefire in Syria. TRUMP: I want to bring our soldiers back home. REP. NANCY PELOSI, D-CALIF.: Is Saudi Arabia home? UNIDENTIFIED MALE: Elijah was just a wonderful man, a smart, gifted, and I don't think we will see his likeness again. REP. TULSI GABBARD, D-HI: \"The New York Times\" and CNN have also smeared veterans like myself for calling for an end to this regime change war. TRUMP: Almost as deceptive as you showing all of the bombings taking place in Syria and it turned out that the bombing that you showed on television took place in Kentucky. UNIDENTIFIED MALE: He has a right to protect, and that's what the whistleblower statute says it. It doesn't say anonymity. MICK MULVANEY, INCOMING ACTING WHITE HOUSE CHIEF OF STAFF: Doral was by far and away, far and away the best physical facility for this meeting. UNIDENTIFIED MALE: If they looked at four Chuck E. Cheeses in Cincinnati and the top of Mount McKinley and my basement, and Doral, Doral was the perfect choice. MULVANEY: Get over it. HUNTER BIDEN, JOE BIDEN'S SON: Some kind of Alice in Wonderland where you're up on the real world and then you fall down the rabbit hole, and the president is the Cheshire Cat. UNIDENTIFIED MALE: He also called Meryl Streep an overrated actress. (LAUGHTER) UNIDENTIFIED MALE: So I guess I'm the Meryl Streep of generals. (LAUGHTER) TRUMP: Do you think I could take him in a fight? I don't know. How do mine look? (LAUGHTER) TRUMP: No hockey. (END VIDEO CLIP) BAIER: One week in D.C. Thanks for inviting us into your home tonight. That is it for this “Special Report.” This weekend you want to watch \"FOX News Sunday\" for an interview with Acting White House Chief of Staff Mick Mulvaney. Chris Wallace will have some pointed questions, I'm sure. Check your local listings for that air time. That's it for this show, fair, balanced, and unafraid. Still waiting for word of that Tulsi Gabbard press conference from Iowa. Expect it to happen tonight. We'll see if it does. Might happen with Martha. Her show is next. Content and Programming Copyright 2019 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2019 ASC Services II Media, LLC. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of ASC Services II Media, LLC. You may not alter or remove any trademark, copyright or other notice from copies of the content.",
      "date": "1 day ago",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    }
  ]
}