{
  "articles": [
    {
      "title": "",
      "url": "",
      "subtitle": "",
      "author": "",
      "content": "   ",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Michael Knowles: Can Joe Biden actually win?",
      "url": "https://www.foxnews.com/opinion/michael-knowles-can-joe-biden-actually-win",
      "subtitle": "Michael Knowles: Can Joe Biden actually win?",
      "author": "Michael Knowles",
      "content": " Fourteen presidential aspirants spoke at last Saturday’s California Democratic Party convention, including plausible candidates such as Sen. Bernie Sanders, I-Vt., Sen. Kamala Harris, D-Calif., Sen. Elizabeth Warren, D-Mass., and Sen. Cory Booker, D-N.J., as well as a bevy of inevitable also-rans. Joe Biden, who holds a commanding lead over his rivals, skipped the event entirely. The former vice president snubbed the California Dems just one week after another conspicuous absence: he failed to attend a single Memorial Day ceremony. While South Bend Mayor Pete Buttigieg and Sanders ran from one photo opp to another in New Hampshire and Warren saluted the Stars and Stripes in Iowa, Biden was nowhere to be found. In recent days, Biden has resurfaced at some smaller campaign stops in New Hampshire. During one event, Biden improvised a 45-minute speech in which he reminisced about the car he drove to prom and declared homosexuality a “decision.” NEW 2020 POLLS: BIDEN TOPS TRUMP IN MICHIGAN, EDGES AHEAD IN TEXAS The former vice president said “lastly” three times before managing to conclude his remarks. At another event, he mocked the Creole accent of a Caribbean electrician. While Joe was on the road, just hours after he had released his environmental plan, critics revealed that at least five sections of it had been plagiarized from groups including the Blue Green Alliance and the Carbon Capture Coalition. It might be better for Biden to remain absent and be thought a fool than to campaign and remove all doubt. So far, relative timidity hasn’t impinged on his frontrunner status. According to a recent CNN/SSRS poll, he leads the pack with 32 percent support. Sanders trails him at 18 percent, followed by Harris at 8 percent, Warren at 7 percent, and Buttigieg and Beto at 5 percent. But Biden can’t hide forever. Support for the former vice president has already fallen seven points since he announced his campaign in April. By playing it safe, Biden risks squandering his early lead before the first debate later this month. Likewise, Biden can’t risk taking any risks. As the most gaffe-prone politician in the country, he has avoided major public appearances at which he might embarrass himself. Three years in relative obscurity have buoyed Biden’s public approval, much as they did for Hillary Clinton after she left the State Department and before she declared her own bid for president. Now that the former vice president has re-entered politics, nostalgia will soon give way to the buffoonish reality of Joe Biden. No single column could recount the myriad stumbles of the Democratic frontrunner. He dropped out of the 1988 election after reporters caught him plagiarizing speeches, cribbing lines from former president John F. Kennedy, his brother Robert F. Kennedy, former Democratic presidential nominee Hubert Humphrey, and British Labour political Neil Kinnock. Not long after that, Biden admitted to plagiarizing a paper he wrote in law school. Two decades later, during his next bid for president, Biden described then-opponent Barack Obama as “the first sort of mainstream African American who is articulate and bright and clean and [a] nice-looking guy.” That supposedly rare combination of traits made for “a storybook, man,” as Biden put it on a conference call with reporters. That same year, at a campaign stop in Missouri, Biden told a paraplegic state senator to “stand up” and “let [the people] see you.” Two years later, during a St. Patrick’s Day celebration at the White House, Biden prayed that “God rest” the soul of the Irish prime minister’s still-living mother. Over all those years, Biden developed the habit of approaching random women and smelling their hair. CLICK HERE TO GET THE FOX NEWS APP After five decades in politics, Biden’s chief if not sole legislative accomplishment is the Violent Crime Control and Law Enforcement Act of 1994, a laudable law nevertheless despised by today’s radical Democrat base. So the frontrunner hopes to secure the nomination by avoiding major early battles and praying the Democrat base forgets about him. How’d that strategy work in 2008 for the early Republican frontrunner Rudy Giuliani? The best defense is a good offense. Sooner or later, Biden will have to reassert himself, which will open him up to a whole new slew of gaffes. Joe’s latest plagiarism faux pas proves the more things change, the more they stay the same – bad news for a guy who’s already failed to win the White House twice. CLICK HERE TO READ MORE FROM MICHAEL KNOWLES",
      "date": "June 6",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Joe Biden apologizes for segregationist remarks",
      "url": "https://www.foxnews.com/transcript/joe-biden-apologizes-for-segregationist-remarks",
      "subtitle": "Joe Biden apologizes for segregationist remarks",
      "author": "",
      "content": "This is a rush transcript from \"The Five,\" July 8, 2019. This copy may not be in its final form and may be updated. GREG GUTFELD, CO-HOST: Hi, I'm Greg Gutfeld with Katie Pavlich, Juan Williams, Jesse Watters, and she surfs on a stick of gum, Dana Perino -- \"The Five.\" (BEGIN VIDEO CLIP) JOE BIDEN, FORMER U.S. VICE PRESIDENT: Now, was I wrong a few weeks ago to somehow give the impression to people that I was praising those men who I successfully opposed time and again? Yes, I was. I regret it. And I'm sorry for the pain or misconception that it may have caused anybody. (END VIDEO CLIP) GUTFELD: Finally, Joe Biden apologized, not for being a sleepy veep, but for admitting that he can work with people he disagreed with including awful Democrats from his very own party. To make his point he used segregationists who were the backbone of the Democratic Party. But unfortunately, we live in a world where deliberate misinterpretation is weaponized. Kamala Harris, new Biden wasn't being racist and that he wasn't complementing segregationist. On the contrary, it was their heinousness that served the example well. Everybody knows that. But as long as there's room enough to slide in, I've got you. There's room enough to gain an edge. Among Democrats saying got you is speaking truth to power. So Joe's example of being able to work with racists became Joe's throwing slumber party with cross burners, while they braided each other's hair and wrote each other love poems in their yearbooks. So now Biden limps along like an injured gazelle on the Serengeti, unaware that his apologies is but the first in a long line of ones he'll be giving because one is never enough, and two is just the appetizer. He'll be apologizing until the desert is served and the check comes. And Joe has been around a long time. For today's left, just being alive in the past is proof of collaboration and worthy of a witch burning. And remember, Joe was born less than 100 years after the end of slavery. So I want to feel bad for Joe, but then I remember this. (BEGIN VIDEO CLIP) BIDEN: You probably just don't want working class people voting. They don't want black folks voting. Unchain Wall Street. They're going to put you all back in chains. (END VIDEO CLIP) GUTFELD: Biden can smear with the best. So what goes around comes around. And today, everything comes around until Joe goes away. Speaking of going away, I would offer a moment of silence for Mr. Eric Swalwell, but no one wants to lose a moment of silence from this show. But let's just -- do you want to just show his exit, whatever? (BEGIN VIDEO CLIP) UNIDENTIFIED MALE: But we have to be honest about our own candidacies (INAUDIBLE). You know, American author, Louise L'Amour wrote, in the lonely mountain, there will be a time when you believe everything is over. That will be the beginning. Today ends our presidential campaign, but it is the beginning of an opportunity in Congress with a new perspective. (END VIDEO CLIP) GUTFELD: Jesse are you as crushed as I am? JESSE WATTERS, CO-HOST: You called it, too. I'm a little upset because I had Gillibrand the first to drop, but you had Swalwell. GUTFELD: Yes. WATTERS: So, again, Greg wins and I lose. I'm getting used to it. On the Biden situation, big difference between Trump and Biden is this, Biden runs away from controversy and Trump runs towards it. And if you look at Trump over the last couple of years, even a controversial things in his own party, he's tough on tariffs, on the border, on the travel ban, even his personal so-called scandals he's really dug in hard. Whereas Joe Biden over the course of four months, basically, has changed positions or apologized on the Hyde amendment, segregationist, Anita Hill, inappropriate touching, the Chinese threat. And this is the worst form of apology because it's insincere, it was force, he didn't want to give it, but he had to give it. And it looks like the base is leading him instead of him leaving the base. It doesn't look like he has the presidential timber. Whereas, President Trump, highest approval rating he's gotten so far in the latest poll by ABC, Washington Post, and I think that's because the Mueller report has kind of slowed things down. You had two very successful overseas trips in Europe and in Asia. And the American public is kind of beginning to contrast the president with some of these other Democrats, and they're looking at him more favorably, plus the great economic news coming out in June. GUTFELD: Also, America's female soccer team won the World Cup thanks to Donald Trump, Juan. JUAN WILLIAMS, CO-HOST: I don't think there's any question. GUTFELD: Yes. Yes. He led them to victory. WILLIAMS: Yeah. Katie and I were talking about the golden boot. I think there's a lot of Americans would like to give him the golden boot. WATTERS: Not enough. WILLIAMS: Oh, yeah? How about those numbers, those poll numbers, what's the disapproval, Jesse? (CROSSTALK) WATTERS: I think it was the same numbers that Obama had -- (CROSSTALK) WILLIAMS: No, Jesse -- (CROSSTALK) DANA PERINO, CO-HOST: He heard that on The Daily Briefing. (LAUGHTER) WATTERS: I watch that religiously. PERINO: Yes. WILLIAMS: Well, I will say this. I think Joe Biden is still getting back into fighting shape and into campaign mode, if you will. So he's on the way back. And you hear those criticism inside the Democratic party that he slow down -- I mean, slow to announce, and he's still getting back to his A-game. KATIE PAVLICH, CO-HOST: Slow Joe. WILLIAMS: Slow Joe, there you go. (CROSSTALK) PAVLICH: No, he's a sleepy Joe. . WILLIAMS: Sleepy Joe, slow Joe, who knows. But I will say that -- what you do get is Donald Trump, Katie, immediately tweeting about Joe Biden. He's not tweeting about Harris. GUTFELD: Right. WILLIAMS: He's not tweeting about Pocahontas. He's tweeting about the guy that he worry is going to beat him. Give him the golden boot and that's Joe Biden. GUTFELD: So, is slow Joe has his mojo or is it a no-go? PAVLICH: What -- I mean, how long is it going to take Joe Biden to get into the race? I mean, this is crucial timing. He's at the top of the pack and he knows because of that the chances to going down are inevitable, and he has to hold onto that front spot. He keeps leaning on the Obama legacy, and not only is Obama not endorsing him but people in the Obama camp are running away from him as fast as possible, and also openly criticizing him. I mean, David Axelrod, again, over the weekend saying, I don't know if this guy can make it to the end based on all of his flip-flopping. And in the end, what's the point of having a moderate lane in the Democratic primary if Joe Biden is just going to continually change his position? And when he gets to a general if he becomes the nominee, which is not inevitable, by the way, what is he going to actually run on considering he's changing all of his position? He says, I apologize for what I said a couple of weeks ago. Well, this is a position that you took over the course of 40 years of your career in the Senate, so are you apologizing for that, too? I mean, what is his platform? I'm not sure. GUTFELD: It's a good point. He's turning the moderate lane into Lombard Street. PERINO: Very curvy. GUTFELD: Yes. PERINO: Bumpy. GUTFELD: Yes, and bumpy. PERINO: Running out of road. GUTFELD: Yes. PERINO: OK. This new political climate does not seem to suit him well. So he's been running for office for 40 years. When you are running as a vice president on a ticket where President Obama is super popular, you're running on a ticket -- and he was a good vice president for him. I'm not saying that he wasn't. GUTFELD: Yeah. PERINO: That doesn't necessarily mean that you were then the best candidate for this political moment that we are in. Think of the progression. He said what he said. He then -- he told Cory Booker that Cory Booker should apologize. Like, I'm not going to apologize. And he was like, oh, he's got some fight in him. And then, he does an interview in which he said, I didn't expect for them to come after me. Then he says, oh, actually, I'm sorry. So you think about this debate in the next three weeks. It is likely just the way things work out that Elizabeth Warren will be on the stage with him. So, if I'm her, I'm thinking, what else can I get him on? How can we get him on that progression? And you can go back 45 years, whatever, and find something that he's done to help support Wall Street. GUTFELD: Right. PERINO: Or Bernie Sanders will go after him on health care. And you can see the same type of progression happening to the point where you -- I think you were saying the base is leading him to positions that he doesn't necessarily hold. GUTFELD: Your point about the new train -- it was like when I took my driver's test I had to use a car that was 20 years old because I couldn't ride the car that my wife had because I didn't understand any of the gadgets. It had like the rearview mirror movie thing. Yeah, I know, nothing made -- so I had in order to pass the test I have to use like a Taurus from, like, 1999. PERINO: It will also get you to your destination. GUTFELD: Yes, yeah. WILLIAMS: Let me just say, Biden, you know, for all that we're talking about -- PERINO: Yeah, and people still like him, I get it. WILLIAMS: Yeah, people do like him. And he -- I think, you know, going back to what Jesse saying about that Washington Post, ABC poll, I think he's plus-10 over Trump in that pole. PERINO: And nobody else is above Trump in that poll, except for like maybe one or two -- (CROSSTALK) WILLIAMS: Within margin of error to your point. But I think that the key to -- you know, as we're looking at Biden today and those apology is to understand that his base of support in the moderate lane that Greg's talking about, the Democratic Party, remains very strong. GUTFELD: I hope it does. WATTERS: That same poll had Hillary beating Trump by 13 points, Juan. Just to let you know. WILLIAMS: When is that -- at the end there? And 16. WATTERS: Yeah. WILLIAMS: Not now, I hope not. WATTERS: Not now. She running -- (CROSSTALK) GUTFELD: I feel bad for Sean O'Rourke, our producer, did a montage of Eric Swalwell's best line. Should we exit with it? (CROSSTALK) GUTFELD: Goodbye. (BEGIN VIDEO CLIP) REP. ERIC SWALWELL (D-CA): I'm a congressman, but also a father of a 2-year-old infant. When I'm not changing diapers, I'm changing Washington. Most of the time, the diapers smell better. I think it's so appropriate that you gave us all the same T-shirt because I believe our candidates are a part of the Avengers. We're here to save America. The Republicans, that's the Hunger Games. I will be bold without the bold. (END VIDEO CLIP) (COMMERCIAL BREAK) WATTERS: Tensions flaring between Nancy Pelosi and progressive lawmakers, such as Alexandria Ocasio-Cortez. She voted against last month border aid bill. The speaker dismissing the influence of the freshman Democrat and other freshman Democrats telling the New York Times, quote, all these people have their public whatever and their twitter world. But they don't have any followings. There're four people and that's how many votes they got. If the left doesn't think I'm left enough, so be it. We have to have a solution, not just a twitter fight, end quote. AOC, she's firing back tweeting, quote, I find it strange when members act as though social media is not important. They set millions of dollars on fire to run TV ads so people can see their message. I haven't dialed for dollars once this year, and have more time to do my actual job. Yet, we'd rather campaign like it's 2008. What do you say, Dana? PERINO: Look, I admire her fight, right? And the spice that she brings to it -- WILLIAMS: You're talking about AOC. PERINO: Yeah. But I also admired Nancy Pelosi because she can count votes. And if you are in a deep blue district and any Democrat is going to get elected in your district then, yes, it is easier to be a firebrand and -- it's easier to do all of those things. And Speaker Pelosi has a different responsibility and a different role, like her job is to try to keep the majority and to try to figure out a way to do as many of the things the Democrats want to do with the reality that they live in. And if they continue to go the way that they are, those 31 districts in the House that helped Nancy Pelosi become speaker again could very easily flip back to being Republican when President Trump is at the top of the ticket. Bringing Republicans back in because not as many people vote in the midterm. The other thing is, she did this interview -- Speaker Pelosi did an interview with Maureen Dowd in the New York Times. Got a lot of attention, that's where these quotes come from where she's saying that these guys don't only have their twitter game. But it came in an interesting time because she had just lost a fight with in her caucus, but it wasn't from the left. It was from the middle. But they've said we have to vote for this funding for the border. So, I think that she's trying to be wise, and I think that -- I understand why a push up against her, but if I had to put Pelosi's political skills up against AOC at this moment from what they need, if I were the Democrats I'll say, can't you guys just work together because together they can be quite powerful, but I don't know if it's possible. WILLIAMS: Well, I just don't think there's any way that Congresswoman Alexandria Ocasio-Cortez is on the same power game level as Nancy Pelosi, and the votes just clearly show that. But, Greg -- GUTFELD: Yes. WILLIAMS: -- what was interesting to me is that there was a note of content in the way that Pelosi spoke about social media and twitter. GUTFELD: Right. WILLIAMS: And then you see this punch back from AOC saying, oh, you're living in 2009? GUTFELD: Right. WILLIAMS: What do you say? GUTFELD: I enjoyed this fight. This is so much fun. The Dems are going through a similar convulsion the Republicans experienced, you know, four or three, four years ago. Trump rattled the party, and he rattled the party using the similar tools which was social media. And we all thought -- not we, we didn't all think it was crazy, but we're laughing and enjoying it, and then he beat everybody with it, you know? And I think AOC is a chip off the old Trump. I think she is, you know, has -- she knows how to work it. And I think that they could probably learn from that. It does bother me that she didn't vote for the bill. I mean, that's kind of strange when you accuse others of hurting migrant children and then you deny their aid. That seems to suggest that maybe this is a political, cynical act of theater on her part when you -- you know, maybe let people suffer and die before cooperating with the president? Kind of sad. WILLIAMS: All right. So, Jesse, what I'm reminded of is that John Boehner, Paul Ryan -- I think Paul Ryan just left because he couldn't handle the freedom caucus, the whole tea party thing anymore. Here's Pelosi now dealing with much the same dynamics, instead it's not the far right but it's the far left. WATTERS: Well, I think Boehner has got to have a glass -- laughing at Nancy because -- you know, you think you have it bad? GUTFELD: I don't think it's wine anymore. (LAUGHTER) WATTERS: Maybe it's something else. She has four bomb throwers. He had dozens of tea party members starting in 2010. He had them for many, many years that made his life hell over spending, and the debt ceiling, and he did his best to keep the beef behind closed doors. Nancy seems to keep having these public spats. And she's only got four little bomb throwers and it's only been four months, and she's already had fights about anti-Semitism, impeachment, progressivism, and now the border funding thing. PERINO: Green New Deal. WATTERS: Yeah, the Green New Deal. And she would just be much better served if she would let her whip team handle the drama and ignore them. And now, she's nicknamed them the squad, she's elevating them in the media, and I think this is wrong. But I do agree with AOC. You shouldn't diminish the power of social media. She doesn't dial for dollars. She can leverage that platform, very powerful. And Nancy doesn't understand that, and I think she should soon. WILLIAMS: All right. So, Katie, what's interesting to me is I think the people on the right are hoping that there's a big rift and a big fight coming, right? But I don't know that Alexandria Ocasio-Cortez is at the level that she really can take on Nancy Pelosi. PAVLICH: I mean, they're not hoping for it. It's already here and we're watching it play out. And that's the reason why Nancy Pelosi is having to answer questions in every interview about this new caucus of people who everyone is saying isn't very powerful. But if she's being asked about it and having to comment on it and having every presidential candidate has to say if they believe in the Green New Deal and Medicare for all, guess who's driving that narrative, these four people. I bet they wish they could go back to the days of being on the cover of Rolling Stone when Nancy Pelosi was on the cover with Ilhan Omar. Be a little bit more, you know, cooperation then, but this is too past, right? So, Nancy Pelosi is doing what Dana talked about. She's looking to govern. Looking for policies. Looking for results to go back to these districts and say, we're not just talking about things, we're actually passing legislation that is not getting pass in the Senate because the mean Republicans won't take it up. AOC and Ilhan Omar and Rashida Tlaib are interested in the cultural battle overall. They're activist. They don't have to worry about getting reelected in their district necessarily. They want to change the narrative as a whole with the whole country, and they're doing that. I mean, people are talking about them. The media oxygen is being -- taken up by them. Last week, AOC accused the border patrol of forcing illegal immigrants to drink out of toilets and that was something that everyone has to respond to. So, they're two past here and I think they're just different at this point, whether Nancy Pelosi would be victorious, right now she is. GUTFELD: And the media did a great job following up on that accusation. PAVLICH: Right. GUTFELD: We really got to the bottom of that toilet drinking. WILLIAMS: But by the way, I just think that she got four votes, Katie. I mean -- PAVLICH: Sure. WILLIAMS: I mean, really, clearly the strength of the caucus, the overwhelming majority went with Pelosi -- PAVLICH: In Washington. WILLIAMS: Yeah, that's what I'm saying. PAVLICH: Overall with the country -- (CROSSTALK) WILLIAMS: We're talking about actual vote in Congress. PAVLICH: Right. But you can do both at the same time. You can deal with the overall narrative and direction of the country, and then you can deal with the impact of governing -- WILLIAMS: Well, I think in the Trump era, I think they're a lot of Democrats who want Pelosi to be more aggressive but, you know what, you still -- have to know how to count the votes. PAVLICH: Yes. WILLIAMS: All right, the U.S. women's big World Cup win igniting calls for equal pay for female athletes. That's next, big discussion right here on The Five. (COMMERCIAL BREAK) PAVLICH: Well, the U.S. women's soccer team arriving back in America just moments ago after its big World Cup win, the team making history claiming its fourth World Cup after beating the Netherlands 2 to nothing. The players having fun celebrating their dominating performance, but it's now starting to be overshadowed by politics. The big win immediately setting off call for equal pay from the stadium crowd. (BEGIN VIDEO CLIP) PEOPLE CHANTING: Equal pay, equal pay, equal pay, equal pay. (END VIDEO CLIP) PAVLICH: Equal pay chant -- women's team is suing the U.S. Soccer Federation for gender discrimination, focusing on the pay gap between the men and women's team. President Trump also weighing in on the issue. (BEGIN VIDEO CLIP) DONALD TRUMP, PRESIDENT OF THE UNITED STATES OF AMERICA: You also have to look at numbers. If you look at World Cup soccer, that's one thing, and you also have to look at soccer, professional soccer. You have to see who's taking in what. So I don't know what those numbers are. I would like to see that, but again, you have to look at the great stars of the men's soccer, the great stars of the women's soccer, and you have to see year-round how they all broaden. What is the attendance for women soccer outside of World Cup? But I would like to see. PAVLICH: Jesse, it appears you have some thoughts. WATTERS: No, just the chant for equal pay at a sporting event, I never thought I'd hear that ever -- PAVLICH: There you go. WATTERS: -- no matter what the sport. But the president does have a point there. If you look at the World Cup men's revenue it's in the billions and they split up the pot. It's a much bigger pot. Women's World Cup revenue much, much smaller, and they have a smaller pot to divide up with. But the distinction is, is that the U.S. Soccer Federation, the women do actually make more revenue and they get paid less, so that's their lawyer's fault. They negotiate a horrible deal and they need to renegotiate that immediately. The point is, though, is the women are not helping their case by their behavior. If you go out and you disparage the president, you act in unpatriotic ways, and then complain about not getting paid equally, well, what do you think is gonna happen? People are going to watch. GUTFELD: No, but they get on talk shows. WATTERS: Many, many people this weekend who said, I love soccer. I'm not watching the U.S. women's because I didn't like what they said. That means the ad revenue comes down. That means their overall revenue comes down and they can't divvy up the same amount of money. PAVLICH: So, Dana -- WILLIAMS: I've never heard this before -- (CROSSTALK) WILLIAMS: The truth -- if it is the truth. I can't handle your truth because -- WATTERS: What is it? WILLIAMS: I mean, to me, Trump always likes winners, right? And he loves winners -- (CROSSTALK) WILLIAMS: -- red, white and blue. But all of a sudden, he's heading it on about this. (CROSSTALK) WILLIAMS: The money thing, for example, if he's the President of the United States, why isn't he talking about the fact they have the number one uniform for men or women, according to Nike, right, they make more money as you said here in the United States. They contribute more to U.S. soccer -- WATTERS: Not World Cup, to U.S. soccer. WILLIAMS: FIFA is corrupt. I didn't know what's going on there. WATTERS: That's where the revenue comes from. WILLIAMS: But, no. I'm talking about the revenue for United States Soccer Federation -- WATTERS: I agree. WILLIAMS: So we agree on that. WATTERS: We agree. WILLIAMS: They should be paid equally. PAVLICH: Well, according to Forbes, Dana, there is a discrepancy in terms of the amount of revenues. So the total revenue for women, $73 million, the players receive 13 percent, whereas with the men, it's $4 to $6 billion and they only received 9 percent. So when you're dealing with someone -- PERINO: You didn't tell me they'll be math. (LAUGHTER) PAVLICH: The paychecks -- (CROSSTALK) PAVLICH: Before this they're asking for equality, but there's a difference between -- PERINO: Here's the thing. We can be excited -- the United States won, we're winners, that's great. But they can complain about their behavior -- but you know what, they're being whoever they want to be, whatever. Colin Kaepernick could be who he wants to be. And he gets like all this press from last week, whatever. Here's the thing. In the United States, should they be paid the same as the men on a salary basis? I would say yes, OK? And I think that their lawyers are actually going to the remediation right now and that's something that they can deal with, because they've showed it in their performance and they show it in the fact that they get the revenue that the people are coming to watch it. But when it comes to the World Cup, literally half the world watches the men's World Cup. It's like 3.5 billion people. WATTERS: Right. PAVLICH: Right. PERINO: That is not the same for the Women's World Cup yet. Maybe they'll get there one day at some point, so I do think there is a distinction there. PAVLICH: Right. Greg. GUTFELD: I should be paid to watch soccer. All right. And I'm not distinguishing, don't call me sexist. I don't like male soccer. I don't like female soccer. I don't like animal soccer. I don't like any soccer. You should pay me to watch it. Is it sexism that they're being paid - they're not being paid? I don't think so. I think that generally the male sports are bringing in a higher proportion of money. Having said that though, they would be nuts not to exploit this, because this is the highest point of their negotiating power. They just won the World Cup. They should be - you'd be nuts not to be demanding more money. And if you want to use sexism as part of your tools, go for it because when you're negotiating, you will use anything. But that's - they should be chanting at their agents. WATTERS: Right. GUTFELD: And their lawyers, don't chant at me. I don't care how much money you make. I don't even care who wins. I don't care about your politics. WATTERS: Wait. You want the Americans to win that. GUTFELD: No, I'm not into this tribal sports stuff. I thought we're behind that. You know if we're playing some aliens from outer space, I'll be for Earth. PAVLICH: You are a globalist now. GUTFELD: I am a globalist. WILLIAMS: But I just think that they you know before they played this game. GUTFELD: Yes. WILLIAMS: They wanted equal pay and they put pressure on themselves and then they perform. So, I admire that. GUTFELD: Yes. WILLIAMS: Right. And the second thing to say on the politics of it is given President Trump's trouble with women, American women, even Republican women these days, you would think that he'd stand up and be very clear that he thinks-- GUTFELD: He congratulated them. WILLIAMS: Yes, and say great things about them. PERINO: He did. GUTFELD: He did. WILLIAMS: He's handing an arm-- PAVLICH: Invited to the White House. WILLIAMS: Having them at the White House. PAVLICH: They don't want to go. WATTERS: Juan, they say, they're not going to go. WILLIAMS: No. They don't want to go but guess what-- PERINO: He said, congratulations, good job. WILLIAMS: He was backing off inviting them. WATTERS: Well, because he doesn't want to look bad. It's like inviting someone to a party and then after they say, they don't want to come. WILLIAMS: You are exactly right. WATTERS: But he should invite them anyway and make them look nice. GUTFELD: The nice thing is Bill Clinton offered Epstein's jet. You want to play games. PAVLICH: All right. Well, up next, the video of the teen licking ice cream and putting it back starting a sick new social media trend. We'll show you that next. (COMMERCIAL BREAK) WATTERS: It's hard to forget the disgusting video we showed you last week of a Texas teen who landed in hot water after licking ice cream before returning it to the grocery stores freezer. That's sick social media son is apparently inspiring some copycats. A Louisiana man was busted over the weekend for posting a video doing the same thing, licking ice cream and poking it with his finger before putting it back. And social media flipped out over a Wal-Mart shopper opening a bottle of Listerine gargling then spitting the used mouthwash back into the bottle before putting it back on the shelf. Wal-Mart's investigating the incident, but it appears it may have been staged. Greg, what do you think psychologically is going on with these people? GUTFELD: Well you know, an old Simpsons' episode, I think it was Homer Simpson, I can't remember who said, alcohol is both the solution and the cause of all your problems. Social media is now the cause and solution. So, social media incites people to do these attention seeking things because it goes viral. But then social media comes and crushes you like a bug for doing it. So, I had an idea, why don't you viralize the opposite. So, what is the opposite of contaminating a product. People should be filming themselves taping like a $20 bill under a product in a supermarket and saying where it is. WATTERS: You go first, tell me where you're going. GUTFELD: I'm going to be doing the Wah Wah in North Bergen, New Jersey at 2 AM. WATTERS: OK. GUTFELD: But then everybody posted and then people go out, they find $20 under a can whatever. PERINO: And maybe they buy some ice cream along the way. GUTFELD: Exactly. There you go. So that's reverse contamination. PERINO: Right. That's what I was thinking like bring back the ice bucket challenge. GUTFELD: Yes. PERINO: Remember those things that first happened, and it was like oh, it was for good. GUTFELD: It killed 10 people, Dana. Massive heart attack. It did. WATTERS: Do you think that the media shouldn't play any of these silly stunts, are we advocating it? PERINO: No, I am not for restricting people from doing things or saying things like they can do that if you want to. I am for law enforcement of the stores pressing charges and having a huge fine. Something that is punitive, maybe a night in jail. They'll never do it again. PAVLICH: Yes. WATTERS: Yes. PERINO: The night in jail live streamed. GUTFELD: Yes. PERINO: So that everyone sees how miserable you are in jail. PAVLICH: They want a reality show from jail. That's the problem. It will snowball into them wanting some kind of show following around doing this. But Greg, they are vile rising. These ice creams by licking them and sticking gross. And at least with the Listerine, it's a sanitary product, so that's probably a better bet than the ice cream, it turns out-- PERINO: Now they're going to have to put that plastic around, although ice cream can be hard to take off. PAVLICH: They really should be arrested. WATTERS: Do you have trouble removing that plastic? PERINO: Sometimes, you've got to get the scissors out. WATTERS: It's very firm the way it is placed on there. Juan, is it just strictly about attention? Is that what this is all about, they're just desperate for attention and they don't care how they get it? WILLIAMS: I guess so. So, I'm very curious. I mean I - everything has been said here is on target to me, except this. The last thing with the Listerine was a stunt because my impression was the other ones were not stunts that they were leaving it there for some unsuspecting person to purchase the item and then they would get a kick out of having made a fool out of me and my family. But in this one, I just think it's just for social media. She does it. And apparently, you're saying Jesse, she then took it away? PAVLICH: She should pay for it. WATTERS: Well, yes, some people actually said when they got busted. Oh! I have a receipt, I actually bought this. WILLIAMS: Oh! OK. WATTERS: Which makes me think they're just doing it for the social media aspect. PERINO: But here's the other thing, Listerine, it's a product they have. They don't need this sort of a headache. What did they do to her? Right now, you've got to have a crisis communication. WILLIAMS: But was its Listerine, because I am a consumer of this product. GUTFELD: And we appreciate that Juan. WILLIAMS: Thank you, brother. But anyway, there is a wrapper on it. You would have to take. PERINO: That's why they're saying it's a stunt. But regardless she should be busted for that because that is their brand. They do not - they are going to have a harm to them as a brand because of this, even if it is a stunt. GUTFELD: I think they should execute all of them with an angry letter. WILLIAMS: Well, I just think there is a reason for a health code. There is a reason that you have protections for us all, because let's just be crazy about this. There could be disease. GUTFELD: And also, I mean all that tamper proof stuff came because people were killing people. Remember the Tylenol cases. WATTERS: Greg, you strike me as the kind of guy when they go shopping and they bring the item back to the house. GUTFELD: Yes. WATTERS: Or to the luxurious apartment. If you notice that the item has been tampered with in anyway. If you suspected it's been opened, you will throw it out. GUTFELD: Pretty much. PAVLICH: Absolutely. GUTFELD: Yes. WATTERS: I'd just go for it. I say, it's fine. GUTFELD: No, not in New York City. PAVLICH: Very risky, Jesse. WATTERS: Yes, I live on the edge. PERINO: Living on the edge. WILLIAMS: Jesse is the embodiment of the five second rule. GUTFELD: Yes. It's more like a five-minute rule. WATTERS: That's right. I live by it. That's right. Up next, technology is causing extra work stress and ruining our weekends. (COMMERCIAL BREAK) PERINO: We'd hope you had a nice Fourth of July weekend, but for many of us it may have been cut short. A Wall Street Journal article highlighting how Sunday night is the new Monday morning and workers are miserable. Thanks to smartphones. More employees are spending the final hours of their weekend planning for the week ahead. There is even a new term for it. The Sunday Scary. I mean, come on, please. Some offices are trying to crack down on burnout triggered by the pre-Monday morning. I have no sympathy for this baloney. I don't. But I'm going to-- GUTFELD: Do you know why? PERINO: I'm going to do this very fair and balanced. Why? GUTFELD: I'll tell you why you don't have sympathy because you live your work all the time. So, we do a show called \"The Five.\" People go, that's so easy. One hour of work. No, we sit there and think about it 23 hours a day. It drives us crazy; you wake up in the middle of the night, what's Juan going to say to me. What am I going to say to Juan? Am I going to get in trouble? So, it's like you actually live in your head all the stuff you're doing. Did you ever have SMAD growing up, that's \"60 Minutes\" affective disorder. Do you remember when you-- PERINO: I had the opposite. GUTFELD: When I would hear the tick, tick, tick of \"60 Minutes\" I got so depressed because it told me that Monday was a school day. I hear \"60 Minutes\" theme. PERINO: So, I had the opposite thing. I was so afraid to miss \"60 Minutes\" that I didn't want to go outside and play. So, my dad, we had the avocado green stove. GUTFELD: Yes. PERINO: He would set the timer and so, I would have five minutes to end my play to get inside, so I could watch 60 minutes on time. That was-- PAVLICH: My parents took me to Disneyland once and all I could think about was my homework and I was crying at Disneyland-- PERINO: You had to homework. PAVLICH: My homework wouldn't get finished. PERINO: So, do you get the Sunday scary? Do you worry on Sunday night? PAVLICH: No, I mean I don't - I mean I get stressed out about missing work. PERINO: Yes, me too. PAVLICH: So, I guess detaching is stressful. PERINO: I do know people get this and I have a friend whose husband he just gets miserable on a Sunday. He is unhappy. They say that there is some advice that you say they should exercise. GUTFELD: That's always the same advice. PERINO: Drink more water. GUTFELD: Yes, water, exercise. Get some rest. WATTERS: I think these people are pathetic. Think of the most successful person that you know. GUTFELD: Me. WATTERS: And think to yourself, did they get that way by being stressed out over a Sunday inbox alert. No, they got successful by being workaholics. You know you want to aspire to be the person on the beach sending the email to your underlings, making them stressed out on a Sunday and you only get there by responding to the inbox emails and thinking it's normal, because you want to get a step ahead on a Sunday night. You want to hit the ground running. PERINO: Absolutely. WATTERS: On a Monday, you win. GUTFELD: I get a step on my Sunday night, on Saturday night by getting my work prepared Saturday for free Sunday to Monday. WILLIAMS: That's brilliant. Just don't stop, right. Just keep going. PERINO: How do you think about Sunday night? WILLIAMS: In fact, I saw on these numbers, it said 62 percent of American workers say, they have to be available around the clock. PAVLICH: OK. WILLIAMS: They never stop. So, on Friday, I came in to do The Five, where were my friends. I was lonely, but I did get John Rich. GUTFELD: Yes. WILLIAMS: Anna Kooiman was here. GUTFELD: Yes. WILLIAMS: John Rich, right. GUTFELD: Anna Kooiman. WILLIAMS: Lawrence Jones. GUTFELD: Lawrence Jones. Tammy. WILLIAMS: Tammy. PERINO: What's your point. That's not about Sunday nights. WILLIAMS: It was because-- PAVLICH: He was working but none of us are. WILLIAMS: Thank you. I should hire you-- PERINO: Did you work Saturday and Sunday, I did. GUTFELD: It was evil twin five. WILLIAMS: You work Sunday. PERINO: Look, here's the thing. We should be glad. If you have a job, be grateful. If Sunday nights drive you crazy, plan something fun for Sunday night. WILLIAMS: But then the boss will get mad at you, Dana. PERINO: No. bosses are not getting mad on Sunday nights. People are anticipating people getting mad about Sunday. WILLIAMS: But if you don't respond to their email and they sent you an email on a Sunday night. PAVLICH: Look, the good news if you work really hard all the time, then you have a reason to say, I'm going to away for a week or I'm going to detach. So, because you've put in your dues and your time then you can take a little break. WILLIAMS: By the way, Jesse. PERINO: Did you have a good weekend, Jesse? WATTERS: Yes, I had a really nice weekend. Watch the Women's World Cup. They did very well, and I was at the beach for a little while. I did a beach body workout every single day, four days in a row. WILLIAMS: A beach body workout. WATTERS: It's a-- PAVLICH: You have a beach body now. WATTERS: Almost, we're getting there. GUTFELD: In the trunk of his car. WATTERS: Yes, it's resistance training on the beach. PAVLICH: Did you wear deodorant before you went to the beach. WATTERS: No, I did not. I just jumped on the ocean. PAVLICH: Do you steal stuff from the store. WATTERS: No. But I did-- GUTFELD: Did you open up an Andy Pressman (ph) at the local Walgreens. WATTERS: I have a confession to make. In the commercial break on the last segment, I kind of admitted that maybe once if I needed some suntan lotion, I squirted-- PAVLICH: Or deodorant. WATTERS: Perhaps, maybe in high school, I went with a little woo-hoo and then left the 7-Eleven. GUTFELD: Lip balm. PERINO: This is why everything is behind these-- WATTERS: Lip balm, I don't use lip balm. PAVLICH: Anyway. GUTFELD: No wonder. PERINO: I've never done that. WATTERS: You've never done that? PERINO: No. But if you need lotion and you just go - you go to the tester. WATTERS: A sample. PERINO: Yes. WATTERS: OK. Thank you. I'm going to do that next time. PERINO: What about your weekend? Is it a good weekend? GUTFELD: Yes, had a good weekend. PERINO: Did you drive? GUTFELD: I killed a lot of insects. PERINO: You didn't drive anywhere? GUTFELD: I did a little bit of driving. I bought a game called Corn Hole. You ever heard of that? PAVLICH: Welcome to Middle America. GUTFELD: Bean bags into a hole, it's terrible name though. It's how people like I can feel like I'm dunking a basketball, throwing a beanbag into a hole. It's the closest I'll get to a slam dunk. PAVLICH: It's so fun. WILLIAMS: So, I went out to dinner Saturday night. My son's in-laws were in town. We took them to dinner, and man, it was such a deluge. By the time I got in the restaurant, it was soaked. GUTFELD: Yes. WILLIAMS: And then this morning in D.C. Katie. PAVLICH: We almost drowned. But I made it. WILLIAMS: It's been long awaiting. PERINO: We are glad you're here. We're glad everyone is back. It's going to be a great week because Mondays are wonderful. One More Thing is up next. (COMMERCIAL BREAK) GUTFELD: One More Thing, Jesse. WATTERS: So, our friend Ed Henry announced the other day that he's going to be donating 30 percent of his liver to his younger sister Colleen. Colleen has been bravely batter battling a degenerative liver disease and was way down on the waiting list and Ed decided to act. So, actually I think only four to six weeks after the livers have been replaced, they regenerate to full size and Ed actually had to lose 10 to 15 pounds before doing this. And he can't drink for six months afterwards and it's just an amazingly selfless thing he's going to be doing and we wish Ed and Colleen the best of luck. Also, good luck to me because I'll be on Hannity tonight. PERINO: Good luck with that. GUTFELD: Even more selfless Ed is if he has any extra painkillers. Don't flush them down the toilet. WATTERS: Way to go, Greg. GUTFELD: Thank you. All right. Who's next, Dana. PERINO: Me. OK, great. Thank you so much. You know what this weekend really was great because of Jasper and I have been missing a lot, Jasper, so I have some pictures here and especially Greg is going to love, Jasper in the sidecar, he loves that. We went to The Coal House Bistro a couple of time, that's in Point Pleasant Beach, fantastic food. We're at the beach. We had lots of fun. Also, I wore my big sunglasses and he took a nap and then Peter took him in the Harley to get some ice cream while I did Fox News Sunday. And you know you're going to love this. Look at that. But the best part is that this is how he started his Monday. Watch this. Watch this, he is going to be the first-round draft pick. That was a Frisbee catch. We should have highlighted that maybe. Anyway, he kind of Frisbee. GUTFELD: He should have highlighted that. At least, you're not obsessed. PERINO: OK. Anyway, this this is how sad he was to come back to the city. Watch this. (BEGIN VIDEO CLIP) UNIDENTIFIED MALE: Come on let's go. Jasper. Let's go now. (END VIDEO CLIP) PERINO: He get in big trouble. He didn't want to come back to the city, but I didn't blame him. GUTFELD: That was nice. PERINO: Did you enjoy that? GUTFELD: I did. I enjoyed it. What if my sister would give me part of her liver even though I'm healthy, I just want an extra part of liver? PERINO: Just in case. GUTFELD: Yes. WATTERS: You need all the liver you can get. GUTFELD: Exactly. All right let's do this. This is great. Animals Are Great. This is so amazing. They don't make me so happy. PERINO: It's going to make me have bad dream. GUTFELD: Yes. Even a reptile needs a little cashmere like this corn snake named Spaghetti who has his very own knitted sweater. You don't see sweaters much on snakes, but this snake is living in it. Look at that. I mean it's like this is such an amazing idea. I want a snake sweater and I'm not even a snake. Anyway, he got it for Christmas. One Christmas sweater, I love. It was a reptile. Nobody's talking, Juan. WILLIAMS: That was really strange. All right. PAVLICH: I'm going to get my snake sweater. GUTFELD: Yes. WILLIAMS: I don't know about that. All right, so, it was a quiet Saturday afternoon in Boston when this happened. Powerful lightning bolt struck a boat in the Columbia Yacht Club in South Boston. No one on board, but it was an electrifying moment as you saw caught on cell phone video by Henry Minucci. He saw lightning in the distance trying to record it when the lightning came a little bit too close. National Weather Service saw the video and tweeted a reminder, \"when thunder roars, go indoors.\" Not bad advice. You should know America. Lightning can strike even when there are clear skies and thunder clouds as far as 25 miles away. PAVLICH: Be careful. GUTFELD: My wife always says, Greg, when thunder roars, could you go outdoors. Katie. PAVLICH: Very nice, it rhymed. All right. So, we like people who play guitars, take a look at what this guy did. That is Andrew Suggs of Atlanta and he was on a camping trip in Northern Arizona where I am from, when he was inspired to perform the Star-Spangled Banner while overlooking the Grand Canyon. Of course, he says he's a Braves fan. Atlanta Braves. He has his jersey on. So pretty cool rendition of The Star-Spangled Banner in one of my favorite places on Earth. PERINO: Beautiful. PAVLICH: So very cool. WILLIAMS: You ever heard Jimmy Hendrix do that. It's pretty good. PAVLICH: It's pretty good. WILLIAMS: He's pretty good. GUTFELD: He's all right. WILLIAMS: He's all right. GUTFELD: Never miss your DVR - set your DVRs. Never miss an episode of \"The Five.\" \"Special Report\" is up next. Content and Programming Copyright 2019 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2019 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.",
      "date": "July 8",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Marc Thiessen: Joe Biden is a hypocrite on Ukraine",
      "url": "https://www.foxnews.com/opinion/marc-thiessen-joe-biden-hypocrite-ukraine",
      "subtitle": "Marc Thiessen: Joe Biden is a hypocrite on Ukraine",
      "author": "Marc Thiessen",
      "content": " Former Vice President Joe Biden has said that in holding up vital military assistance to Ukraine, President Trump “used the power and resources of the United States to pressure a sovereign nation, a partner that is still under direct assault from Russia … to subvert the rule of law in the express hope of extracting a political favor.” That’s rich. The aid in question is lethal military assistance that the Obama-Biden administration refused to give Ukraine. In 2014, after Russia annexed Crimea and began arming separatists in eastern Ukraine with tanks, armored vehicles and rocket launchers, Ukrainian President Petro Poroshenko came to Washington to plead for weapons to defend his country. In an impassioned address to a joint session of Congress — with Biden sitting directly behind him — Poroshenko said his country appreciated the nonlethal assistance he was getting, but declared “one cannot win a war with blankets.” PETER SCHWEIZER: BIDEN UKRAINE DEALINGS — 7 ESSENTIAL FACTS The Obama-Biden administration was unmoved. The Wall Street Journal reported at the time that “President Barack Obama stuck to his refusal to provide weapons or other lethal military gear to Ukraine, despite a passionate appeal Thursday for help in fighting pro-Russian rebels by Ukraine’s president.” Why? The administration feared that lethal aid would provoke Moscow. So what did the administration give him? Instead of RPGs (rocket-propelled grenades), we provided MREs (meals ready to eat) — food rations. As one frustrated former Pentagon official put it at the time, “What kind of message does that send anyway? We are sending MREs while they are being invaded by an aggressor.” CLICK HERE TO SIGN UP FOR OUR OPINION NEWSLETTER Answer: a message of weakness. When Trump took office, he delivered a message of strength. In December 2017, the new administration announced that the United States would send the lethal aid to Ukraine that Poroshenko requested and Obama and Biden refused — the sale of $47 million worth of Javelin antitank missiles. In May 2018, after Ukraine tested its new Javelin missiles, Poroshenko exulted on Twitter, “Finally this day has come!” and personally thanked Trump “for supporting Ukraine and adopting a decision to provide Javelin antitank missile systems.” For Biden to now attack Trump for a temporary delay in a new round of lethal military aid reeks of hypocrisy. It was on Biden’s watch that the United States refused to deliver military aid at all. Yet the same vice president who sat there impassively while Ukraine’s president begged for weapons now dares to cite the Russian threat to Ukraine in castigating Trump? Talk about chutzpah. And since Biden raised the Russian threat, let’s recall that the Obama-Biden administration bears much responsibility for the annexation of Crimea that necessitated the delivery of lethal aid to Ukraine in the first place. Russia’s military intervention in Ukraine came in the aftermath of the Obama-Biden administration’s failure to enforce its red line against Bashar Assad’s use of chemical weapons by Syria. In March 2013, Biden declared, “Because we recognize the great danger Assad’s chemical and biological arsenals pose to Israel and the United States, to the whole world, we’ve set a clear red line against the use or the transfer of those weapons.” Assad responded by using chemical weapons on innocent civilians not once, but 16 times. And yet Obama and Biden did nothing, failing to carry out even “unbelievably small” military strikes — a decision Biden publicly defended. “We can easily say we should have bombed and gone in and taken out their air defense system,” Biden said, “Well, you know, big nations can’t bluff.” CLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM Bluff is what Obama and Biden did — and Assad called their bluff. Not only that, they turned to Russia for a face-saving way out, letting Russian President Vladimir Putin broker a phony deal to have Syria disarm. It was one of the most embarrassing foreign policy debacles of the post-Cold War era. So it should come as no surprise that, when Obama threatened to impose costs on Putin if he invaded Ukraine, the Kremlin called his bluff, too. Putin knew Obama and Biden did not have the will to stand up to him in Ukraine. And he was proved right when they refused to give Ukraine lethal aid for fear of further provoking him. None of this excuses Trump’s delaying a new round of lethal military aid to Ukraine. But if this military assistance was as vital to countering the Russian threat as Biden says, then it’s fair to ask: Why didn’t the United States provide it when Biden was the Obama administration’s point man on Ukraine? CLICK HERE TO READ MORE BY MARC THIESSEN",
      "date": "October 9",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "President Trump and Joe Biden battle amid impeachment push",
      "url": "https://www.foxnews.com/transcript/president-trump-and-joe-biden-battle-amid-impeachment-push",
      "subtitle": "President Trump and Joe Biden battle amid impeachment push",
      "author": "",
      "content": "This is a rush transcript from \"The Five,\" October 10, 2019. This copy may not be in its final form and may be updated. DANA PERINO, CO-HOST: You're just watching President Trump. He's heading to Minnesota, as he just said. He's going to board Marine One, head to Andrew Air Force Base, and then hightail it to Minneapolis because he has a big rally there tonight. Took questions on a range of issues. We're going to take it on the table. Jesse, let's start with Minnesota. The president's team has put a lot of resources on the ground. In fact, I read today, one of the state of Democratic chairs said they've never seen a Republican who has put this much resources on the ground at this point in the election. I understand that the Trump campaign is 20 full-time hires already, they're looking to do about a hundred. And the president wants to flip Minnesota to be a Republican state in the 2020 election. What do you think? JESSE WATTERS, CO-HOST: I think he'll flip it. It's 10 electoral vote deal, and he only lost by 45,000 votes last time. He barely touched down there or spent any money there. PERINO: Right. WATTERS: He would have won if the never-Trumper and Gary Johnson hadn't been in the race, so it's a very slim margin. He's spending a lot of money up there. They love him, but (INAUDIBLE). And Omar, I do believe, is hurting them in Minnesota. If you look at the numbers too, the Democrats really have to play defense in Minnesota. They're not used to playing defense in Minnesota. He's going to make them play there. He's going to make them play -- and again in Pennsylvania, and also in New Mexico. Places where they're not used to having to spend money and time. And they don't have a lot of time, and they definitely don't have a lot of money to spend defending these places. So, I think it will be a big rally tonight. PERINO: It is -- huge rally. They actually have a sold out crowd. They have people line up around the block. And the campaign is very good about showing little grips and grabs all day long just so they can see people building with excitement. And as Jesse mentioned, Katie, president didn't spend a lot of time there on the campaign because it's sort of like why would we, but to only lose it by 45,000 votes and to have the results he has so far, he thinks he can win it this time. KATIE PAVLICH, CO-HOST: Only lost it by 1.5 percent. And Donald Trump isn't afraid to go into states where Republicans haven't typically been winning in recent election cycles. And as Jesse said, this comes down to a resource problem, right? So Democrats in state have to not only be on defense but they're fighting incumbency, and they're having a really hard time with the feel that they have whether it's Joe Biden or Elizabeth Warren taking back Democrats who voters for Trumps in those blue states like Michigan and Wisconsin. And so they're looking at the math and saying where can we pick up some electoral seats if we were to lose a place like Michigan, for example, back to the Democrats, but that's something he's not afraid to do before, and they're looking at the map and they have a hundred million plus dollars -- (CROSSTALK) PERINO: Juan, is this a state you think that the Democrats could lose in 2020? JUAN WILLIAMS, CO-HOST: I doubt it. It's possible. Anything's possible. As Katie and Jesse pointed out, it was 1.5 percent that he lost by last time. It's not a big margin. So you can see something changing. I think what you don't account for here is there is no single Democrat in the field that can be identified both in terms of being attacked by Trump, but also in terms of voters getting behind and, of course, the Democratic machine we're promoting. So what you have to look at then is polls. And right now in the polls, Trump loses to everybody. He loses to Biden. He loses to Sanders. He loses to Warren. And we also have polls that came out yesterday right here at Fox that indicate now you have a majority of Americans who think this guy should be impeached and removed. PERINO: Interesting, though, that Senator Klobuchar who is a 2020 candidate and is from Minnesota, Minnesota, Nice, not even mentioned in all of this coverage, they hardly even visible. Greg, I want to play for you, if you don't mind, the back and forth because President Trump just talked about impeachment and Biden and all the rest. We have a little back and forth to show you -- GREG GUTFELD, CO-HOST: Back and forth? PERINO: -- take on that. Can you play it for me -- GUTFELD: Yeah, sure, why not? (BEGIN VIDEO CLIP) DONALD TRUMP, PRESIDENT OF THE UNITED STATES OF AMERICA: He's falling like a rock. JOE BIDEN, FORMER U.S. VICE PRESIDENT: He's afraid about just how badly I will beat him next November. TRUMP: I don't think he's going to make it. BIDEN: He believes he can and will get away with anything he does. TRUMP: I guess he's no longer the front runner. BIDEN: President Trump has indicted himself. TRUMP: He's been hit and he's been caught red-handed. BIDEN: He's basically a coward. TRUMP: His son, who is, at best, incompetent. He got thrown out of the navy. BIDEN: Donald Trump has violated his oath of office. TRUMP: We have him on tape with corruption. (END VIDEO CLIP) PERINO: Here they go head-to-head already. GUTFELD: I don't think that's the conflict. I think the conflict right now is Biden and his side. When you have the New York Times publishing a piece by Peter Schweizer who wrote Clinton Cash, that's basically saying would you please go now Joe? You're kind of a liability for us. I mean that's like publishing Peter Schweizer in the New York Times, it's like Trump putting Rosie O'Donnell in his cabinet. You know, this is -- it's basically saying, you know, we're done here, get out. I do have to comment -- Juan brought up this poll and I've been seeing this poll everywhere, and I know it's a Fox News poll, but we've got to point out that it's weighted toward Democrats. From what I've seen, it's 48 percent Democrats, 40 percent Republicans, 12 percent others, so it's weighted for that. Also, it is being taken at the fever pitch of media coverage about a single topic, so what do you expect? You've got all the Democrats plus or minus 3 percent saying they want him out, OK? That's not a big finding. That's not a surprise. In a month from now when all this stuff fades, let's see where it is now. But we have to remind ourselves how many Democrats, how many Republicans in that poll, and these polls have been known to be wrong. Sorry for bringing it up. But if you're going to put it on the table of THE FIVE, we get to respond. WILLIAMS: But I'll respond to you. GUTFELD: Yeah. WILLIAMS: Which is to say that, you know, there're more people who self identifies Democrats than Republicans, and that's why the poll -- PAVLICH: But they don't live in the necessary states -- (CROSSTALK) GUTFELD: Can I also talk about how -- (CROSSTALK) GUTFELD: What really upsets me is I'm not going to see the rally tonight because I'm going to see the Melvin's in Brooklyn, and I asked Jesse to go with me because I have an extra ticket and he said no. WATTERS: Because I know what kind of music you like and I hate it. GUTFELD: Give it a chance. It's the greatest metal band ever. WATTERS: Exactly, I hate metal. I like you, not metal. PAVLICH: Can I say something else about Joe Biden? So Donald Trump keeps going after him in the back and forth. But really it's not just President Trump who has some thoughts about him making it to the finish line. David Axelrod since the first debate has brought up a lot of questions about whether Joe Biden can make it, and this last quarter with his anemic fund- raising numbers, a lot of donors are saying, look, man, like, you can't just come in below all of your other opponents and think you're going to win. And on top of this, his campaign keep saying doesn't have to win Iowa or the earlier states to get over the finish line, and he absolutely does. So it's not just the president -- (CROSSTALK) PERINO: -- we need to see other states. PAVLICH: Right, indeed. PERINO: All right. Greg tackles the media's reaction over Ukraine and Syria next on THE FIVE. (COMMERCIAL BREAK) GUTFELD: The media loves repetition. Repeat the same story again and again, and like Beetlejuice the story appears. Right now, there's the Ukraine refrain where opinions about a phone call actually drown out its actual words. (BEGIN VIDEO CLIP) UNIDENTIFIED MALE: Another day, another smoking gun. UNIDENTIFIED FEMALE: It is definitely a smoking gun. UNIDENTIFIED FEMALE: Ukraine was a smoking gun. UNIDENTIFIED MALE: The bombshell text messages. UNIDENTIFIED MALE: What they reveal. UNIDENTIFIED FEMALE: Came out to defend the initial bombshell. UNIDENTIFIED MALE: This is shaping, obviously, of yet another political bombshell. UNIDENTIFIED MALE: An impeachable offense. UNIDENTIFIED MALE: What is the standard of an impeachable offense? UNIDENTIFIED MALE: That is an impeachable offense. (END VIDEO CLIP) GUTFELD: It's like they have the same script. It's sad. The same media that made Benghazi a punchline shake with rage over a phone call that came with a transcript, and then there's Syria. (BEGIN VIDEO CLIP) UNIDENTIFIED FEMALE: The president is abandoning the Kurds. UNIDENTIFIED MALE: And selling out the Kurds. UNIDENTIFIED MALE: We are now abandoning the Kurds. UNIDENTIFIED FEMALE: Abandoning the Kurds. UNIDENTIFIED MALE: Abandoning our allies. UNIDENTIFIED MALE: And this president just abandons them. UNIDENTIFIED MALE: It's abandonment of Kurdish allies. UNIDENTIFIED MALE: If we're backing away from our commitment to the Kurds, where do they turn? (END VIDEO CLIP) GUTFELD: Well, that was alarmingly identical. So those who fear this president would lead us into war are now upset he's moving 5,200 troops. Just like the people who hated hawkish John Bolton, but then were outraged when he bolted because Trump wasn't hawkish enough. Of course, we know Trump's a dove. He favors trade wars over real ones, and delighted in removing North Korea's reasons for paranoia. It's almost like Trump has a consistent if not always artful point of view. (BEGIN VIDEO CLIP) DONALD TRUMP, PRESIDENT OF THE UNITED STATES OF AMERICA: We're getting out of the endless wars. It's like quagmire. We're up to close to $8 trillion and we're bringing our folks back home. We're now acting as police. We're policing areas. We're doing jobs that other countries should be doing. The hardest thing I have to do, by far, much harder than the witch hunt, is signing letters to parents of soldiers that have been killed. They went Walter Reed and I gave out five purple hearts to incredible young men. For me, it's very hard when I see that. It's very hard. (END VIDEO CLIP) GUTFELD: Strong words which is why the media didn't touch it. Whether you hate it or not, Trump's decision wasn't impulsive, but actually a campaign promise, and reflects opinions going back decades. He's a miser with blood and treasure. You can call it misguided, but at least admit it exists, but the media won't. It's repetition 24/7 to avoid real truth about a new era. When, in which, we've seen the highest household median income in history, punishment of China for oppressing Muslims, continued prison reform, record employment for women and minorities, and now attempts to draw down foreign wars, that the media find such things trivial says it all about the media. It's not hawks versus doves, it's them versus you. They can't stand you, and I bet the feeling is mutual. I'm not going to admit to being an expert on Syria, but I'm just very suspicious of how the line was drawn so immediately, Dana, that everybody had the exact same thing before the dust settled. PERINO: I think, partly, that's because they were hearing that directly from people who are there on the ground, who are in our intelligence and military forces. GUTFELD: But why -- but nobody mentions the number of troops. You have to like pull that out of people. PERINO: You just mentioned it, and -- GUTFELD: Three days later. PERINO: I'm pretty clear -- I was pretty clear that we had 100 to 150 people there, and they were there to help deter the situation. Commanders- in-chief had to make really tough decisions, and nothing is black-and- white. These are always shades of gray and it's very complex. And the Kurds should have known that we were there, it was transactional, it was tactical, and it was temporary. However, any president knows that -- not all decisions are going to be agreed by with everybody else, but the decision-making process should be one that can be respected. In this case, it was very hard to understand how it happened all of a sudden, and now he's talking about mediation. He just said in a press conference as I'm walking out, now we're maybe going to mediate, but they lost -- the Kurds lost 100 people last night in the fighting. So, I think that the critic of the president on the right, they have his best interest in mind. They don't want him to have -- to be criticized. They want him to be able to do what he needs to do to fulfill campaign promises, and to do what he -- like, we defeated ISIS. But the, we, is very interesting. We had very few people there. We've had the Kurds were actually on the ground doing the work for us and they lost 11,000 people. And the Kurdish leaders, they also had to send letters to their people. GUTFELD: So when do you pull out? Do you ever pull out Jesse? I mean, the fact is, this is a marriage of convenience between America and the Kurds. The Kurds have a long-standing feud with the Turks. Do we just stay there and do we end up, perhaps, fighting the Turks? WATTERS: Listen, I think when Barack Obama pulled out of Iraq, he'd abandon our allies in Iraq, but the media has said, oh, that was a strategic redeployment and then they cheered him. And then Trump had to come in and clean it up and bombed everybody and promised the American people he wasn't going to stay. He's trying to keep a campaign promise. I agree with Dana, alliances don't last forever. I mean, we're allied with Saddam Hussein, or shaking his hand, and next thing you know we're invading his country and hanging him. I mean, come on -- and then we pulled out and left his people to die, and went back in and save the people again. So this happens all the time. Right now to say that we abandon the Kurds, I think it's not really saying what actually happened. We let the Kurds have a third of Syria. They had the entire northeast of Syria where 90 percent of the oil reserves are, and all of the great agricultural land. We're talking about a very small section right now and it's right in between the pipeline that runs north of Turkey to sell oil to the Europeans. Turkish people, they just want to make sure they have that pipeline lock down. All I care about is we have the ISIS fighters guarded in the prisons, and that's all I care about. And if I was the president, I'd just ship them all to Antarctica, but that's why I'm not president. PAVLICH: You know who's guarding the prisons right now? The Kurds who are being bombed by Turkey. So the question is, how are they going to get in and make sure that the thousands -- the tens of thousands of ISIS fighters aren't just going to walk right out, and as the president said go to Europe. I mean, that is a concern. And ISIS fighters going to Europe is a direct threat to the American people. P We just indicted the nicest guy a month ago who went to Syria, trained as a sniper, and came back and was living in Brooklyn planning additional attacks in the United States. So you say alliances don't last forever. That is true. The alliance with Turkey as a member of NATO has to be looked at because Turkey told the president that they wouldn't be bombing civilians, and as they went into this they've already killed civilians in the last day. They said they wouldn't go after the Kurds, they're doing that. They're bombing hospitals. And they're not holding up their end of the deal. So I'm just a little bit confused about the president's statement that he wants to take troops out, which is fine, that something he said he would do, consistent -- GUTFELD: Right. PAVLICH: -- but it's inconsistent with what he just tweeted which is, well, if the Kurds are getting slaughtered by the Turks, then we can use military option and send thousands of troops in. And if you're of the idea that you do not want American forces to be deployed on the ground, you have to have alliances on the ground. And if the Turks did something but the Kurds did more when it came to fighting ISIS. And I think 11,000 dead Kurdish fighters in terms of how small their population is -- and giving them the land that they were occupying is a pretty good deal considering what they did for us and limiting the attacks that happened on American soil -- (CROSSTALK) WILLIAMS: Let me jump in real quick and say that I just disagree with the premise because I don't think this is the media versus Trump on this issue. I think we're hearing right here at this table people who are not members of the mainstream media -- no, mainstream media, saying things that are very smart and in opposition to the president's policy. And I also think, therefore, it's much more the case that you see people -- even Pat Robertson, and I only use the member of the mainstream -- GUTFELD: Now you believe Pat Robertson. WILLIAMS: No, I'm just citing Pat Robertson for saying that Trump is in danger of losing his mandate of heaven if he permits the slaughter of the Kurds. And so what you see is that Republicans, including Lindsey Graham, right, on Capitol Hill, a friend to the president, saying this is wrong, this is not good -- GUTFELD: Is that surprising? WILLIAMS: -- and using the word that you say is so bad, abandonment. They're using the same word. To my mind, what you're seeing is not a matter, again, of some kind of partisanship, this is about a policy decision that people find objectionable. You said, oh, well, it's only a few people being moved. But, Greg, the reason that it's a big deal is if they -- if Turkey had attacked an American or killed an American, we'd go to war. So we move our people -- GUTFELD: So that's why they're there? WILLIAMS: Allow me to finish. We move our forces out of the way, which essentially, gives the Turkish the opportunity to go after the Kurds. That's the problem. PAVLICH: I just think the question about Turkey is whether they belong in NATO, there should be serious consideration about kicking them out when they're detaining Americans and slaughtering the allies of Americans. There's a big question about whether they should be in that alliance. GUTFELD: All right. Up next, NBC reportedly terrified over a new book, and allegations against ex-host Matt Lauer. (COMMERCIAL BREAK) WILLIAMS: Major new fallout over the stunning rape allegations against Matt Lauer. NBC executives now reportedly, quote, quivering in their suits. It's because the book that broke the Lauer's story also reportedly contains more damaging information on NBC execs like how network executives knew about the former NBC host behavior before he was fired but didn't stop it. The book also claiming that NBC caved to pressure from Harvey Weinstein. He reportedly had the network spike a story about alleged sexual assault. Katie, what you hear from this Ronan Farrow book is that NBC, you know, is on the way now to saying that they're -- that Farrow didn't have the facts, he didn't have the sources, he didn't have people on the record when he left NBA. And he's now making it out that somehow they didn't back him up, but, in fact, they're saying he didn't have the story. Should they just come clean? How are we to make sense of this? PAVLICH: Well, I haven't read the book, so I don't know exactly what all the allegations are. There've been stories about what's in the book. This has not has played out in the court of law yet with the new allegations that we've heard about, so sometimes the details get a little muddled. But in terms of the accountability at NBC is well documented now that they did spiked that story that Ronan Farrow was writing about what was going on with Weinstein, and now he's had people following him around, intimidating him, and trying to squash what was in the book, so he deserves credit for moving forward with it despite those threats. But I think being skeptical of this kind of reporting is good. Until you've actually read what's in the book. WILLIAMS: Jesse, Noah Oppenheim who's the NBC News president has been visiting news organizations to say that Farrow's reporting wasn't ready, although, as Katie points out, in seven weeks it was in the New Yorker. But part of what Farrow is arguing is that there was an exchange going on between NBC and the parent company of the National Enquirer that they were saying, we have stuff on Matt Lauer and NBC is saying, well, we'll keep that quiet and we won't do Weinstein. Do you think that's possible? WATTERS: Catch and Kill, that's the name of the book and that's the way they play it. A lot of people do it. It's an old tactic. And I don't know if this is true or not. I mean the narrative is, is that NBC covered up for Lauer, covered up for Weinstein, then leaked the Access Hollywood tape against Trump and then pushed Billy Bush out, because he was a threat to Lauer. The whole thing is really sloppy and ugly coming from the supposed, you know this peacock network that's supposed to be pristine and perfect. But if you look at it the last couple of years, you know Lester Holt's in a dogfight with David Muir, he's losing to him now. Megan Kelly, they lost a ton of money on her. And it's not like Seinfeld and F.R.I.E.N.D.S. are running the world anymore. I mean they're in second place. CBS is number one now. So, they have to take a look at the leadership. I think Andy Lack, if he can't control this and Comcast might say, you know hit the road. I mean there's some bright spots, they've got the Olympics coming up. They have football and it's an election year, so they're going to make a lot of money next year and that's what it's all about, it's all about profit. WILLIAMS: Dana, what do you think about the idea that NBC is on the offensive here going to other news organizations to say ignore this book. PERINO: Well, I was just going to - the only thing I was going to say is just haven't been involved in a lot of book rollouts and helping others and doing my own like, Ronan Farrow and Little Brown as his publisher, they've done an incredible job of getting an amazing amount of buzz about this book before anyone has had a chance to read it. It has been litigated all week long. The book doesn't even come out until next Tuesday. So, I'm assuming that it will probably debut pretty high on the New York Times bestseller list. WILLIAMS: Greg. GUTFELD: I think we should talk about those two men that were arrested that are affiliated with Rudy Giuliani. WILLIAMS: Why is that? GUTFELD: Because I don't know. The flaw of the MeToo movement is due process is now in the court of public opinion. So, we don't know right now what is real and what's not. You know, as a guy I feel that like I can't comment on what I think or the confusing elements of the story. But I'm always interested in what women have to say about these elements of the story, because there are people that will say things about this story to you to your face and say that there's problems with it, but then they won't say it in front of other people. And I think that in this kind of story it would be really good to hear from the women about what they think about this story provided actually they read the book. WILLIAMS: You know what I was thinking was that the rich and powerful may get some preferential treatment, the question is - and then you come into hashtag MeToo. Lot of people become aware of that kind of preferential-- GUTFELD: And how far did this go back by the way. WILLIAMS: I don't know. GUTFELD: Because there are people that aren't working at NBC now that are working at other places that worked with Matt. WILLIAMS: All right, Hollywood attacks Ellen DeGeneres for defending her friendship with President George W. Bush. That's next on THE FIVE. Stay Tuned. (COMMERCIAL BREAK) PAVLICH: Ellen DeGeneres guilty of a cardinal sin in Hollywood saying something nice about a Republican. Liberal stars now shaming her for sitting next to President Bush at a football game and calling him a friend. Worse. Mark Ruffalo and Susan Sarandon have been leading the charge while Reese Witherspoon is being accused of privilege for defending Ellen. And of course, Joy Behar jumping on the bandwagon to go after the daytime TV star. (BEGIN VIDEO CLIP) JOY BEHAR, TV HOST: I always said I didn't want to get to know George W. Bush because I knew I would like him. And then I knew he would. Because that you know he seems like a likable kind of guy, but then if you lost a child in Iraq, then you don't like him so much. And I don't see myself hanging out with Donald Trump any time in this lifetime. So, it's not about - it's not only about disagreeing with somebody. (END VIDEO CLIP) PAVLICH: All right, Dana. So, your former boss-- PERINO: I apologize from sneezing in during your read. GUTFELD: We need to clean up this table. PAVLICH: It's OK. No worries. PERINO: I've never sneezed on air before. That was the first. PAVLICH: First time for everything. WILLIAMS: Well, we give the opportunity to say, bless you. PAVLICH: What do you think about your former boss being accused of all these-- PERINO: Well, he's like he's in the news. He doesn't even try to be in the news. PAVLICH: Right. PERINO: All he did was go to the Dallas Cowboys football game, which he loves to do and he's there with his wife and he gets to sit next to Ellen. He's been on her show. His daughter has been on her show and they're friendly and then Ellen is very nice and she responds, I think a very small group of progressive leftist and she says you know what, I have a platform, I'm going to talk about this on my show and she does. And then these guys come up and they're like until he is convicted as a war criminal no one can talk to him. It's preposterous. Actually, I think about Hollywood the way Greg thinks about the media. PAVLICH: All right. Well-- GUTFELD: Not bad. PAVLICH: Juan. So, Ellen has come under a lot of fire, not just President George W. Bush. I mean she has been accused of hanging out with a war criminal. Some people are coming to her defense, but she's saying look, I told people to be kind. And that means to everybody. WILLIAMS: Well, I think that's good advice. I mean I just don't have any problem with it. I just don't - I mean I understand-- PAVLICH: You think the Lefts could be more tolerant? WILLIAMS: I think everybody. Look, I don't know whether it's Left or Right. I think everybody can be more tolerant. But I do think that people here are arguing about war crimes and all the rest and I think you know if you met the guy, I think the idea is you would love the guy. I think he's a very nice guy and he's a big baseball guy. So, we have that in common. GUTFELD: So, you're saying if Stalin liked baseball that would be OK. Now, this is a remind. WILLIAMS: That's Joy Behar. GUTFELD: I'm kidding, but this is a reminder. I don't think it's Lefts. I think the Left really made it an art form to use words like war criminal. I mean they chip in these words by using it on people and like obviously he's not a war criminal, but it's a reminder that if Trump wasn't President, they would have demonized the Mitt, they would have demonized the McCain or any congenial middle of the road Republican because look what they're doing. Look, it reminds you what they were saying about Bush. And we forget that it's not just Trump that they hated. They hated everybody. I think Ellen though should apologize to Hollywood for sitting with GW Bush because they deserve an apology, because their morality is unimpeachable after all they've given standing ovations to child rapists and they've been defending the casting couch for like a century. So, they deserve. PAVLICH: Yes, they have. All right, Jesse. Final thought from you. WATTERS: Final thought. Normal people think of things like this, life and politics are down here. Liberals think its politics and life and I think I would say if I saw a Cowboys fan, they're down here for me, they're worse than the liberal. WILLIAMS: Holly smokes. PAVLICH: You should invite Ellen on your show to talk about this. All right. Don't go anywhere, NFL legend Terry Bradshaw is here. Up next. (COMMERCIAL BREAK) WATTERS: The NFL on Fox is taking over our studio once again. Thursday night football host and NFL legend Terry Bradshaw joining us at the table. Terry in a few minutes. We're going to put your knowledge to the test for the football edition of the supermarket showdown. But first, what's it like sharing the Green Room on Thursdays with all these knuckleheads like Greg. TERRY BRADSHAW, NFL PLAYER: This is awesome. I mean especially when I watch you on television of course Juan here. He's kind of - poor Juan. Dana, yes, it's great because people say, you really know those people, so yes. They're not friends, but you could say-- PERINO: I think we can say friends. BRADSHAW: Yes, friends. PERINO: It's been three years now. BRADSHAW: We all get along with it. We all go to dinner or anything yet. GUTFELD: I take your boots off for you, remember. BRADSHAW: You did. I do appreciate that. GUTFELD: Yes, and you do medical diagnosis. BRADSHAW: I do medical diagnosis. GUTFELD: He says, I have a deformed-- BRADSHAW: He says, America. GUTFELD: Shoulder blade or whatever. Collar bone. BRADSHAW: That's not a good sign. You need to go to see your doctor. (CROSSTALK) GUTFELD: How much time do I have left. PERINO: He's a little of a hypochondriac. BRADSHAW: He is? PERINO: Yes. GUTFELD: Anyway, to get drugs. I'm going. WATTERS: You used to get some of those when you used to get knocked around a little bit right. They used to pump you full of pills. BRADSHAW: Yes, they did, Jesse I didn't know you were that tall man. WATTERS: When I sit up straight-- (CROSSTALK) BRADSHAW: Wait a minute, I did my seats a little short. WATTERS: It's mostly the hair. BRADSHAW: Is this an Eagle thing. WATTERS: Just an Eagle thing. (CROSSTALK) BRADSHAW: And this is my new look. I like this. WATTERS: That looks good. BRADSHAW: And I found that New York, they have a store. So, I'm going there next week. GUTFELD: They have a hat store in New York. You're killing me. BRADSHAW: With a goatee now, which my wife loves. GUTFELD: You're not a hipster. WILLIAMS: By the way, when you play, did you have the goatee? BRADSHAW: No. I had never a goatee, but like most athletes, you watch baseball, you watch NFL, everybody's got a beard. GUTFELD: 70s every athlete had a giant bushy beard. BRADSHAW: Yes, I had a beard and it's all about superstition. First year, we went to the Super Bowl was my first beard. So, I started growing it and what we start winning. So, you put your stock on left foot first, you've got to always put it on the left foot and then you have to talk yourself out of and say to yourself, I'm not superstitious This is stupid. And then you go out and you do it the other way and have a bad game-- (CROSSTALK) WATTERS: You wear the same stinking undershirt for three weeks. BRADSHAW: I never did that. WILLIAMS: The guy who is now the quarterback in Jacksonville. BRADSHAW: Right. WILLIAMS: Has this amazing mustache that people-- BRADSHAW: (Inaudible) his name. From Washington State. WILLIAMS: What do you think about that mustache? BRADSHAW: I like it. It's a good look. GUTFELD: It tickles. BRADSHAW: Have you ever seen him dress. He dresses Italian. He's got a silk shirt. Done button here with chain. OK. Mustache in that little-- GUTFELD: 70s athletes, athletes in the 70s cared about what they dress - they were so fashion conscious. Remember he wore the tight slacks with the bell bottoms and the satchel shirts. BRADSHAW: Hey. WATTERS: Terry, don't show up with tight slacks. (CROSSTALK) BRADSHAW: I'm. 71. I can't wear a tight slack. I've got a little bit of a stomach, if you haven't noticed. But I perform at the Luxor in Vegas. I saw pictures of me and one of my costumes the other day. And I went, this is unacceptable. (CROSSTALK) BRADSHAW: It was not good. WATTERS: Speaking of Vegas, we're going to do our famous supermarket showdown. You're ready for this. BRADSHAW: I just looked at the market. You're like eight inches taller than me. WATTERS: Three inches of hair. All right. Don't worry. PERINO: Next time, you can ask for a pillow. WATTERS: Don't worry about. All right, here we go. Now this is easy. Giants jersey, we have it right here. An official NFL Giants jersey. How much do we think that costs? BRADSHAW: Whose Jersey is it? WATTERS: Barkley (ph), I don't know. (CROSSTALK) WATTERS: Giants jersey. BRADSHAW: Has he worn the jersey. WATTERS: No. BRADSHAW: He has not. WATTERS: No. BRADSHAW: All right. WATTERS: If he had, I'm going to take it. So, how much do we think this is. PERINO: Write it kind of big. WATTERS: Everybody write it and show it up. GUTFELD: Me and Jesse same thing. WATTERS: OK. And the answer is a $100. (CROSSTALK) WILLIAMS: Way to go Katie. Now. WATTERS: All right. BRADSHAW: I'm glad that wasn't my jersey, I had my feelings hurt. I mean no being a legend and all. WILLIAMS: Wait a second, how much-- WATTERS: I heard that about you. BRADSHAW: My jersey sells at - I actually called the Steelers years ago because I wanted one to frame for my kids. WILLIAMS: Yes. BRADSHAW: And they charged me $500-- (CROSSTALK) BRADSHAW: I had to buy my own jersey, $500. WATTERS: We have to pay for our own Fox News swag. You should see what that left us. All right. Next up, we have a Patriots hat. OK. And they're playing tonight. BRADSHAW: Got it. WATTERS: All right. Against the Giants. NFL Saturday-- BRADSHAW: NFL. WATTERS: It is 47. It's like that little off brand. So, Patriots hat. Write it and show it. Everybody up with the score. Here we go. Prices up. 60. Wow, 80. 89 cents, Greg. This isn't like the lowest one guessing. How much is it. $28. I had 25. Juan and I get that one. BRADSHAW: You go anywhere in America and go to one of their shops and I promise your butt right now, you're not getting no 25 bucks. PERINO: Are you competitive. (CROSSTALK) WATTERS: Next up, we have the buffalo wings. Times Square buffalo. Wild wings. It looks like there is 14 of them, it's going to be a little bit less after the commercial breaks. Here we go. Let's go. PERINO: OK. WATTERS: Everybody up with the wings. Terry, we're waiting on you. BRADSHAW: 9.25. WATTERS: That's a good guess. OK. And the price is what, 23.79. BRADSHAW: Stop it. It cost more than the half. (CROSSTALK) GUTFELD: That's not American prices, that's commie liberal prices. PAVLICH: We changed the rules on that. GUTFELD: All right. And we've got the autographed football here. Who autographed it? Did you autograph it? BRADSHAW: No. GUTFELD: Oh! That's going to send it way down. WILLIAMS: It's not autographed. PERINO: It's not autographed. (CROSSTALK) WATTERS: You'll autograph it. BRADSHAW: America, TB here. I'm going to sign this autograph for whoever can guess the right price. And I've been telling you right now, I have not been feeling well. And if this thing goes to you, it's worth at least five grands. WATTERS: OK. For autograph, price up. BRADSHAW: Not signed. WATTERS: Not signed. BRADSHAW: OK. All right. GUTFELD: I have no idea. WATTERS: If you don't get this one, that's embarrassing. PERINO: Really? That's that much. BRADSHAW: $60. WATTERS: I have 60 too. GUTFELD: I had 200. PERINO: I have 17. WATTERS: Wait, it's not autographed, Greg. 39.99. BRADSHAW: Who got it? PAVLICH: Katie wins. WATTERS: Katie. Last one, it's chips and salsa. This is kind of a ridiculous item to bid on. Chips and salsa, everybody. GUTFELD: I just bought some chips and salsa. WATTERS: And the salsa. OK. BRADSHAW: How big a bag. Big bag. GUTFELD: Are you combining the price? BRADSHAW: Oh man. WATTERS: Combining. (CROSSTALK) WATTERS: Chips and salsa, and this is Tostitos chips and salsa furnished by Tostitos. BRADSHAW: All right. WATTERS: All right again, here we go. BRADSHAW: $10. WATTERS: All right. And the price, 7.78. That's me baby. BRADSHAW: What you get. WATTERS: I had 7. BRADSHAW: No. That's under. PAVLICH: We tied. WATTERS: We tied. Did Katie and I tie. (CROSSTALK) WATTERS: Yes, now sign that for us. PERINO: You want a sharpie. BRADSHAW: Hold it, let's have a vote. PAVLICH: You need a real marker, not that marker. BRADSHAW: OK. We'll have America - we'll give this ball-- WATTERS: Who are we going to give it to? BRADSHAW: Whoever bids highest. (CROSSTALK) WATTERS: What are we going to do? BRADSHAW: We'll have open it up for bid then tomorrow, take the high bid and ship it to him. WATTERS: All right, you heard it America. Bid on Twitter. (CROSSTALK) GUTFELD: Who gets the money? WATTERS: I don't know. Terry is running this. He's in poor health. All right. One More Thing is up next. (COMMERCIAL BREAK) GUTFELD: OMTDP. PERINO: Math's teacher in Fort Worth and his school before he joined it. They were getting a failing grade in all thing's math. His name is Thomas Mayfield, he incorporated music, video production and rap and now they - all the kids are getting the math and they're doing so much better, now they are a B grade from the state. Take a look at math rap. (VIDEO PLAYING) PERINO: Love creative teachers. Congratulations to Mr. Mayfield. GUTFELD: All right, let's do this. Animals Are Great. All right. You ever see a bird at a strip club. No, I guess not. (VIDEO PLAYING) GUTFELD: Yes. It was Dr. Drew. He was an eagle and the masked singer and was eliminated from the show after his first performance. He can do everything. Amazing. All right. Who is next, Jesse? WATTERS: All right, remember the Ice Bucket Challenge to raise money for ALS. Well, this guy has got a new challenge. He's diagnosed two years ago with ALS. He walks down Chicago's Magnificent Mile in a kilt. Brian Wallach raised 20 grands for ALS research, he just celebrated his 39th birthday. He's going to find that cure and this is him right here. (BEGIN VIDEO CLIP) UNIDENTIFIED MALE: Right down the street, every smile, I'm the man you realize that we are one step closer to cure. Every day. That is an amazing thing to be able to say. (END VIDEO CLIP) WATTERS: So, go to iamals.org for more. GUTFELD: All right. Go, Juan. WILLIAMS: I was up late last night. I was having a dream come true. Take a look at this video. The dream starts in the eighth inning with my Nats trailing the Dodgers 3 to 1. There are home runs then back-to-back by Anthony Rendon and Juan Soto tied the game at three. Then I got worried about holding down the Dodgers so the game could go to extra innings, but in the top of the 10th, Howie Kendrick came to the plate and this happened. It was no dream. The Nationals won. They beat the Dodgers now on their way to the National League Championship for the first time since moving to DC. Katie and I say, Go Nats. PAVLICH: It was an amazing, amazing game. WILLIAMS: Yes, it was. PAVLICH: All right. So quickly this fish. His name is Bubbles and he had a tumor on his back and his owner took a man to get a tumor removed. The fish cost $30 and the lifesaving surgery was $300. So, they took him out put him in an anesthetic bath and then put him on a sponge. Did the surgery. And now he's happily swimming back. So, his owner in Australia is happy that he had the surgery. PERINO: That's so amazing that people will do for their pets. GUTFELD: Yes, and for a pet fish, no less. PAVLICH: Hey, don't judge. GUTFELD: Never miss an episode of \"The Five.\" \"Special Report\" is up next. Hello, Bret. Content and Programming Copyright 2019 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2019 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.",
      "date": "October 10",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Deroy Murdock: Joe Biden: Centrist?",
      "url": "https://www.foxnews.com/opinion/deroy-murdock-joe-biden-centrist",
      "subtitle": "Deroy Murdock: Joe Biden: Centrist?",
      "author": "Deroy Murdock",
      "content": " Poor Joe Biden. The Delaware Democrat has served the liberal cause since he reached the U.S. Senate in 1973 as a barely legal 30-year-old, just 46 days after he fulfilled the Constitution’s senatorial-age requirement. He voted reliably with the left and was a loyal vice president to Barack Obama, the most big-government POTUS since LBJ, if not FDR. Biden’s fellow statists now slam him for not being leftist enough. Biden must feel as would Senator Ted Cruz, R-Texas, if he ran for president in 2024 and other Republicans called him a RINO. CLICK HERE TO GET THE FOX NEWS APP • “I think if you look at Joe’s record, and you look at my record, I don’t think there’s much question about who’s more progressive,” Senator Bernie Sanders (Socialist, Vt.) told ABC News correspondent Jonathan Karl. • Biden “does not particularly animate [me] right now,” said U.S. Representative Alexandria Ocasio-Cortez, D-N.Y., “I don’t want to go back. I want to go forward.” The architect of the Green New Deal is believed to have targeted Biden’s less-ambitious approach to so-called “global warming” when she said Monday, “I will be damned if the same politicians who refused to act then are going to try to come back today and say we need to find a middle-of-the-road approach to save our lives.” CLICK HERE TO READ THE REST OF THIS COLUMN IN THE NATIONAL REVIEW CLICK HERE TO READ MORE FROM DEROY MURDOCK",
      "date": "May 19",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    }
  ]
}