{
  "articles": [
    {
      "title": "Sen. John McCain: You were fed ObamaCare lies, America. Here's what must happen now",
      "url": "https://www.foxnews.com/opinion/sen-john-mccain-you-were-fed-obamacare-lies-america-heres-what-must-happen-now",
      "subtitle": "Sen. John McCain: You were fed ObamaCare lies, America. Here's what must happen now",
      "author": "Sen. John McCain",
      "content": " As the old adage goes, “If you don’t change your direction, you’re likely to end up where you’re headed.” When it comes to health care in America, Democrats’ refusal to change course on ObamaCare – even as it crumbles across the country – will lead us to more skyrocketing costs and decreased quality of care. This week, the Obama administration confirmed that monthly premiums for benchmark plans are set to rise by an average of 25 percent in the 39 states participating in ObamaCare’s federal marketplace. About one-in-five consumers will have just one provider to choose from. As bad as these numbers are, they don’t paint the full picture of the burdens many across the country will face come open enrollment next week. In my home state of Arizona, a 27-year-old shopping for benchmark plans will see their premiums rise by an average 116 percent. For Arizonans selecting other plans, the situation is just as bad, with premiums set to increase by 51 to 74.5 percent. In Maricopa County – Arizona’s most populous county, which includes the city of Phoenix – the 126,000 citizens who have enrolled in ObamaCare will only have one health provider option. According to state regulators, that would mean more than $1,400 per month for a family of four and nearly $500 per month for a middle age man for a benchmark silver plan. Those who can’t afford these expensive plans will be forced to pay a penalty. This is a far cry from the promise of more “choice, more competition, [and] real health care security,” that President Obama once declared. When the president and Congressional Democrats traveled the country touting their so-called “Affordable Care Act” back in 2009, my Republican colleagues and I were quick to highlight that their proposals, however well-intentioned, would only make health care worse for American families. It doesn’t take a Ph.D. to recognize that injecting unprecedented levels of government control into what amounts to nearly one-fifth of the nation’s economy would have devastating consequences. But Democrats dismissed these warnings – demonizing opponents of the law as partisan fear-mongers. The President assured us, “If you like your doctor, you will be able to keep your doctor, period. If you like your health care plan, you'll be able to keep your health care plan, period.” He said, “No one will take it away, no matter what.” We now know those promises turned out to be lies. As is his pledge that with a few small tweaks and a new so-called public option, ObamaCare will be on a smooth path forward. American families are demanding greater affordability and accessibility when it comes to their health care. They are calling for more choice and competition in the health insurance marketplace. And they are urging their leaders to challenge the status quo – not act as rubber stamps for unworkable policies, as my Democratic opponent in the campaign for Arizona Senate promises to do by defending ObamaCare, her “proudest vote.” Contrary to the president’s misleading claim in Miami last week, Republicans in Congress are already working to reform this broken system and have introduced numerous pieces of legislation to replace ObamaCare. Just in this current Congress, Senator David Perdue (R-Ga.) and Congressman Tom Price (R-Ga.) and I introduced the Empowering Patients First Act, which would replace ObamaCare with patient-centered policies that would actually lower costs and increase competition for consumers. We’d do this by establishing age-adjusted tax credits, providing economic incentives to purchase coverage, and allow people to purchase insurance across state lines. All of this and more can be accomplished while ensuring no one is priced-out of the market if they have a pre-existing condition. If we don’t change direction soon, we are likely to end up where we are headed – to even higher health care costs, less choices and decreased quality of care. The surest way to alter the dangerous course we are on would be at the ballot box by sending Republican majorities back to Congress who are committed to repealing and replacing this failed law. We need leaders who will fight for health care reform that works by putting patients first.",
      "date": "October 28, 2016",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "John McCain's dog drowned after head got stuck in pipe, Cindy McCain says",
      "url": "https://www.foxnews.com/us/john-mccain-dog-drowned",
      "subtitle": "John McCain's dog drowned after head got stuck in pipe, Cindy McCain says",
      "author": "Nicole Darrah",
      "content": " John McCain's dog, who died last month in Arizona, drowned after getting his head stuck in a pipe, the late senator's wife recently revealed. Burma, McCain's beloved sidekick, died on the family's property near Sedona, Cindy McCain said. When news of the dog's death was publicized last month, she described it as a \"freak\" incident. FLASHBACK: MCCAIN FAMILY SAYS JOHN'S BELOVED DOG PASSED AWAY IN 'TRAGIC ACCIDENT' \"It's weird — she had never done this before — she ran into a pipe,\" Cindy McCain told The Arizona Republic. \"You know, we have a series of ponds on our property ... and she ran into the pipe and she got stuck.\" She added that Burma \"drowned, and eventually, her body came out the other end of the pipe.\" \"It's devastating. She was John's dog, period, and so what makes me feel better is I know she's with him now,\" she said of Burma. Meghan McCain, daughter of the 2008 GOP presidential nominee and current co-host of ABC's \"The View,\" wrote on Instagram that the dog \"was absolutely and truly devoted to him.\" CLICK HERE TO GET THE FOX NEWS APP “She would never leave his side, followed him around every single step when he would walk around our ranch, slept by his side every night and we always said Chesapeake bay retrievers were the most affectionate breed of dogs,” she continued. McCain spent the last year of his life with the beloved Chesapeake Bay retriever. He died in August after a battle with brain cancer. Fox News' Kathleen Joyce and The Associated Press contributed to this report.",
      "date": "May 6",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "'Fox News Sunday' remembers Senator John McCain",
      "url": "https://www.foxnews.com/transcript/fox-news-sunday-remembers-senator-john-mccain",
      "subtitle": "'Fox News Sunday' remembers Senator John McCain",
      "author": "",
      "content": "This is a rush transcript from \"Fox News Sunday,\" August 26, 2018. This copy may not be in its final form and may be updated. SANDRA SMITH, FOX NEWS HOST: I'm Sandra Smith, in for Chris Wallace. Presidents and lawmakers from both parties honor a political giant, Senator John McCain, for his decades of public service. (BEGIN VIDEOTAPE) SEN. CHUCK SCHUMER, D-NEW YORK: The Senate, country, the world are lesser places tonight with the loss of John McCain. SMITH: The war hero, presidential candidate and six-term senator dead at 81 after a battle with brain cancer. This hour, we'll talk to someone who served alongside him in Congress -- former Senators Kelly Ayotte and Jon Kyl. Plus -- SEN. JOHN MCCAIN, R-ARIZONA: Thanks for having me on again. I love our spirited discussions. CHRIS WALLACE, FOX NEWS HOST, \"FOX NEWS SUNDAY\": Me too, always. SMITH: We share some of his most memorable moments on \"Fox News Sunday.\" And -- SCHUMER: You can't replace a man like that. Everyone looked up to him, everyone respected him. SMITH: We'll ask the panel about the political maverick's legacy in the era of extreme partisanship. Then, President Trump seemingly rattled by the legal downfall of two former close associates reignite his war with the attorney general and the Justice Department. DONALD TRUMP, PRESIDENT OF THE UNITED STATES: Even my enemies say that Jeff Sessions should have told you that he was going to recuse himself and then you wouldn't have put him in. SMITH: Today, we will discuss with it nation's top law-enforcement official. TRUMP: He took the job and then he said, I'm going to recuse myself. I said, what kind of a man is this? SMITH: Plus, the legal and political ramifications from the fed's convictions of Trump's former campaign chairman and the guilty plea from his former fixer. TRUMP: It's called flipping and it almost ought to be illegal. SMITH: With former Attorney General Alberto Gonzales. Then, we'll get reaction from the key defenders of the president, his former campaign manager Corey Lewandowski. All, right now, on \"Fox News Sunday.\" (END VIDEOTAPE) SMITH: And hello again from Fox News in Washington. He is being remembered as an American hero, patriot and lifelong public servant with unwavering commitment to his country. Senator John McCain, one of the most storied politicians of our time died Saturday following a year-long battle with brain cancer. Tributes are planned in his home state of Arizona and here in Washington for the statesman who made a name for himself by often rising above party politics, earning the moniker \"Maverick of the Senate\". Now to Phoenix and Fox News correspondent Alicia Acuna with the very latest on all this. Alicia, good morning to you. ALICIA ACUNA, FOX NEWS CORRESPONDENT: Hi. Good morning, Sandra. The man who had been an American political institution for decades loved his adopted state of Arizona. (BEGIN VIDEOTAPE) ACUNA: And it was here in the rural home outside Sedona he so adored that John McCain died. He battled brain cancer for more than a year. On Friday, the family announced the end was near and within minutes of his passing Saturday, tributes poured in from across the political world. President Trump, who has so often criticized McCain, took to Twitter to express his deepest sympathies to the McCain family, saying: Our hearts and prayers are with you. As the flags outside the statehouse in Phoenix were lowered to half-staff, former presidents, colleagues on Capitol Hill and others praised the 81-year-old war hero, Senate veteran and 2008 Republican presidential nominee. In a bipartisan sign of respect and appreciation, Senate Democratic Leader Chuck Schumer says he wants Congress to rename its Russell Senate Office Building for McCain. SCHUMER: He was always willing to speak truth to power at a time when there are so few people who do that. He will be so missed. ACUNA: McCain's death came nine years to the day of another Senate legend, Ted Kennedy. McCain delivered a eulogy at the Kennedy funeral and while the friends were sometimes legislative combatants, they also partnered together in attempts to change the nation's immigration system. They each died of the same form of brain cancer, glioblastoma. Perhaps the most moving tributes were offered not by politicians, rather by McCain's wife and daughter. Cindy McCain writing on Twitter: My heart is broken. I am so lucky to have lived the adventure of loving this incredible man for 38 years. He passed the way he lived, on his own terms, surrounded by the people he loved in the place he loved best. Daughter Meghan said: He loved me and I loved him. He taught me how to live. His love and his care ever present, always unfailing, took me from a girl to a woman and showed me what it is to be a man. Earlier this year, McCain published what would turn out to be his last book. In it, he voiced satisfaction for always living his life in the moment, perhaps imperfectly at times but always with passion. MCCAIN: Some things didn't work out the way I hoped they would. I had difficult moments and a few disappointments. But by God, I enjoyed it. (END VIDEOTAPE) ACUNA: And we soon expect to hear official details on memorial services in the days ahead both here in Phoenix as well as Washington, D.C. We do know that the senator will be buried at the Naval Academy Cemetery in Annapolis, Maryland. Also to come, a decision on replacing the legend, that responsibility belongs to Governor Doug Ducey, a Republican -- Sandra. SMITH: Alicia Acuna reporting live from Phoenix. Alicia, thank you. Joining me now from Manchester, former U.S. Senator Kelly Ayotte who was dubbed one of the three amigos on Capitol Hill, along with Senators McCain and Graham for their joint pushes on foreign policy. Senator Ayotte, welcome back to \"Fox News Sunday.\" Good to have you on the program this morning. KELLY AYOTTE, R-FORMER NEW HAMPSHIRE SENATOR: Thank you, Sandra. SMITH: You wrote a beautiful tribute, Senator, calling Senator McCain a dear friend and a mentor. How will you remember him? AYOTTE: I remember him -- first of all, what a tremendous loss for his family, but for the entire nation. I remember John for his courage, his tenacity and his wonderful sense of humor. I mean, he was tough as nails, incredibly bright and also just always cracking a joke, always a smile, believed so strongly in America and really a patriot, but always never took himself too seriously. What an amazing man and I feel so grateful to have known him. SMITH: And he loved New Hampshire. He won the first of the nation primary there twice. He loved to campaign there. Why did he -- why did he enjoy-- why did he enjoy New Hampshire so much? As you mentioned in your tribute, he loved his time spent there. AYOTTE: John had a very special connection with New Hampshire. I think we consider him an honorary Granite Stater. He came back twice here to win a New Hampshire primary and he did it from voter to voter, he did town halls here. I mean, hundreds of town halls here in New Hampshire. And so, he forged a special connection with the people of New Hampshire. He has so many friends here. He is thought of so fondly here and really has straight talk in the way he would just answer anyone's questions, speak his mind and be so direct. And I think also a very special connection with our military families and our veterans here who he cared so deeply about. SMITH: Senator, you just mentioned how he used that straight talk. He spoke his mind and he is credited for rising above party politics. How was he able to do that? AYOTTE: He just had the courage of his convictions and he really was a true bipartisan champion, someone who was focused on getting things done for the American people and he had the political courage. Even when his own party disagreed with him, he was willing to get out there because he knew that we need to solve problems. He wanted to make our nation better. You know, that takes a lot of courage and he just had so much moral fortitude. You know, I had the privilege of seeing him at the ranch this spring and what he said to me was, do the right thing, Kelly. That's how he lived his life and I'll never forget it. SMITH: What is the political landscape look like in McCain's absence? AYOTTE: Well, I think that, you know, as we look at someone like John McCain and his passing -- I mean, his legacy is really one of civility and dignity and honor and integrity in something that we really need very much in politics and bipartisanship. SMITH: You were a big part of the confirmation process for Neil Gorsuch and now, we got Brett Kavanaugh's confirmation coming up next week. If I could, Senator, ask you what your expectations are for that and timing of the replacement for McCain seat is going to be crucial as well. AYOTTE: It is. And, you know, I think that this is an excellent nomination by the president. And I would expect that he will be confirmed before the elections. You know, tremendously qualified both in his education and experience and just like Justice Gorsuch, I think he'll have a strong vote and I think it will be a bipartisan vote. SMITH: Senator Ayotte, so sorry for your loss, he was a friend, a mentor to you. AYOTTE: He was. SMITH: And to hear your stories this morning, and thank you. Thank you for coming on and telling them. AYOTTE: Thank you for having me on, Sandra. My heart goes out to Cindy and John's family. What a wonderful group of people. SMITH: Thank you, Senator. Joining us now, former GOP Minority Whip Jon Kyl, who was McCain's colleague from Arizona in the U.S. Senate from 1995 to 2013. He has also been discussed as a possible replacement for McCain. Senator Kyl, thank you for coming on program this morning. JON KYL, R-FORMER ARIZONA SENATOR (via telephone): Good morning, Sandra. SMITH: You join us by phone, Senator. If you could, just share with us your thoughts this morning. Senator McCain was a man you worked closely with for many, many years. KYL: That's right. The lead in to your comments or to your interview with Senator Ayotte included the comment living life in the moment. Jon's entire approach to life was we want to get the most out of the time that we have here, so let's dig in and get going. And in his case, it pointed him towards public service, service of his country end of the state of Arizona. And he certainly did get the most out of the time he had here. SMITH: he was a busy guy and got a lot done in his life. What was it like being in the political arena with John McCain? KYL: Well, there was never a dull moment, I will put it that way. John was involved in so many different things. It was a great experience. We worked together on some things and then on we divided responsibilities to make sure that our state was well-served, but just all of the experiences of working with John. There was never a dull moment. And I want to just take on one thing that Kelly Ayotte talked about because your viewers should know what a mentor that John was to a lot of the newer members of Congress. He led probably more congressional delegation trips abroad than anyone else in the Congress and he always included the newer members to help them meet the same people that he knew abroad, to visit the same places and these were not garden spots. We are talking Yemen and Afghanistan and Iraq and places like that. But he did that not only to teach the newer members, but also to represent the United States in a very effective way abroad. SMITH: How, specifically, Senator, did he want to inspire the next generation? KYL: Well, I think he wanted to do two things. First by his example, the way that he conducted himself to show that that was the most effective way and the proper way to represent the United States, and then secondly of course to dig into the issues in all of these different places. I firmly believe that he -- that his legacy will be his commitment to and his contributions to the national security of the United States. That's where I think he made the most difference and I'm sure there are people all over the world today that are joining in the mourning of John McCain's death. SMITH: In an era of extreme partisanship, Senator, what will or what does the political environment look like without him? KYL: Well, it's not as good because John was always there as kind of conscience of the Senate. I remember one day going onto the floor and he was just incensed that whoever the Republican leader was at the time -- and this was a long time ago. It probably was his great friend Bob Dole, but somehow they weren't giving the Democrats to vote on an amendment that they wanted. And he was incensed. He said we have to give them about, it's the right thing to do. So, he was always there trying to make sure that both sides got their say and were treated fairly, and has already been noted, he didn't have any trouble working across the aisle. SMITH: Senator Kyl, your name has been whispered as a possible replacement for now that vacant seat. The Arizona Republican governor is tasked with naming that replacement. He has now said he will not do so until Senator McCain is laid to rest. What do you want to see happen with McCain's seat? KYL: Governor Ducey has an awesome responsibility there. And I think the key thing is to try to continue the representation of the state of Arizona but more than that as I alluded to earlier, to continue representation for all the people of the United States on the most critical international issues. John had the experience to do that and he had the instincts, in my view, to make the right kinds of decisions, and I hope whoever the governor appoints can work in that vein. SMITH: And, Senator Kyl, I know you'll be heading to Washington soon for the confirmation of Brett Kavanaugh. You will be the Sherpa rallying support around those confirmation -- his confirmation. And, Senator Kyl, we really appreciate your time and thank you for coming on the program this morning looking back at a man you worked very closely with for a long period of time there in the Senate. Thank you. KYL: Thank you very much. SMITH: All right. When we come back, our Sunday panel joins us to discuss the legacy of John McCain and we will take a look at some of his key appearances right here on \"Fox News Sunday\" next. (COMMERCIAL BREAK) SMITH: As far as Sunday shows go, Senator John McCain was a perennial guest whether as his party's presidential nominee, an authority on foreign policy, or at provocateur of the White House. You can count on him to make news, including right here with Chris Wallace on \"FOX News Sunday.\" (BEGIN VIDEOTAPE) WALLACE: Senator, you probably didn't make a lot of friends in the White House this week when you contradicted one of their main attack points against Senator Kerry, which is to say that he is weak on defense. MCCAIN: John Kerry is a friend of mine. I don't choose to attack or disparage him and I will not. I know that having a friend in Washington from another party is not acceptable to some in Washington. I have two words for them, too bad. I have found in my life that when I do what I think is right, for example, on the Marriage Amendment, it always turns out in the end okay. When I do things for political expediency, which I have from time to time, it has always turned out poorly. WALLACE: Give me an example sent to bring it up. What have you done? What would you admit you did for political expediency? MCCAIN: I went down to South Carolina and said that the flag that was flying over the state capitol, which was a confederate flag was, that I shouldn't be involved in it, it was a state issue. It was an act of cowardice. WALLACE: Act of cowardice on your part? MCCAIN: Yes. WALLACE: And you did it because you thought this would help in the South Carolina primary in 2000? MCCAIN: Yes, sure, this won't alienate certain voting bloc. And I lost anyway. (LAUGHTER) WALLACE: One thing that I was surprised to learn about both of you is that you are -- maybe I'm wrong about this too, superstitious. I'm told that you have lucky suits. I'm told, Senator, you have a lucky (INAUDIBLE) But after everything you've been through, you've also been quoted as saying you feel you are one of the luckiest people on earth and you feel certain, not to get highfalutin about it, a sense of destiny. Do you feel that you have one final mission to serve this country? MCCAIN: I have been blessed to be able to serve for many years, both in the military and in public office. It's one of the great honors of my life. But it doesn't mean that I was meant to be president. It just means that whatever time I have left, I would be of service to the country. And I am grateful, incredibly grateful that I've had the opportunity and if it stops tomorrow, I will look back at an imperfect person, but one who always tried to serve. WALLACE: Republican insider, Senator, say that your big job going forward is to reach out to conservatives. Here is what one McCain insiders that the other day. REPORTER: Can he then go on and become the nominee of this party? UNIDENTIFIED FEMALE: Yes, I think holding their nose. They don't know how to take him. WALLACE: Oh boy, Senator. One, is your mother right? And two, how do you persuade conservatives to stop holding their nose? MCCAIN: I love my mother dearly, more than anything in the world. But really my mom is not -- is not a complete expert on this issue. And I love her and I love her candor and she's been a great, great asset, particularly whenever the age issue comes up. WALLACE: On McCain's desk is a picture of his granddad during World War II. In the corner, you can see a photo of the senator as a little boy. McCain says treasure your children. MCCAIN: If I had a message, because I'm not as young as I used to be, it's enjoy every moment with them. Enjoy every second, because they all grow so fast and you will have some of your best memories of the time you spent with them. I fought against my own people -- administration when I wanted to, when I thought it was necessary to do so, and I will fight against this administration when I think it's necessary to do so. WALLACE: If I may press and, it is what other people are saying, that's what you are saying about yourself. You said I never considered myself a maverick. MCCAIN: Well, I -- what I was saying was that I had considered myself a person who is a fighter. I wouldn't be around today if I wasn't a fighter. I fight for things that I believe in and sometimes that's called a maverick, sometimes that's called a partisan. People can draw their own conclusions. I prefer great American myself. WALLACE: As the son and the grandson of military men and as a war hero yourself -- MCCAIN: And a son in the Navy. WALLACE: And a son in the Navy. MCCAIN: One who was in the marines, too. WALLACE: Your thoughts on Memorial Day? MCCAIN: The great honor of my life, it was to have had the opportunity long ago and far away to have served in a company of heroes. I'm the luckiest guy you have ever interviewed and will ever interview. I'm the most fortunate man on earth and I thank God for it every single day. Thanks for having me on again, Chris. I love our spirited discussions. WALLACE: Me too, always. (END VIDEOTAPE) SANDRA SMITH, FOX NEWS HOST: It is time now for our Sunday group. A former press secretary for Vice President Pence, Marc Lotter, columnist for \n The Hill, Juan Williams, the co-host of \"Benson and Harf\" on Fox News Radio, Marie Harf, and Fox News correspondent, Gillian Turner. At least he left us laughing there, and in such a sad few hours that we have seen since the family announced his death yesterday, Marc. He did make us laugh. MARC LOTTER, FORMER PENCE PRESS SECRETARY: He absolutely did. And the only thing I can say is if you would have decided to retire and enjoy a quiet peaceful life after his military service, no one could have faulted him for what he went through -- SMITH: But that he did not do. LOTTER: But he felt called to serve and do more, and he did. SMITH: And he did, even in those final 18 months or so of his life, he kept fighting the brain cancer for sure, but he still stayed politically involved as well, Marie. MARIE HARF, CO-HOST, \"BENSON & HARF\": Absolutely. He was not going to just walk away and not have a voice in so many important issues we continue debate -- whether it's health care, whether it's the state of our politics. And, Sandra, I thought a lot over the last few weeks about, you know, John McCain was a hawk for sure. But for me, one of the most significant things he did was when he worked to make peace with Vietnam, a country where he was tortured, where he fought a war. He banded together with John Kerry, who he disagreed with him on many things, including the Vietnam War, and said that our past does not have to dictate our future when it comes to our relationships around the world, normalized relations with the country who tortured him. That is an extraordinary statement. SMITH: You know, all of us sitting at this table at some point in our careers, we had the opportunity and the honor of knowing Senator John McCain and getting to know him in some instances. Juan, we get a picture of you and your son with Senator McCain. JUAN WILLIAM, FOX NEWS POLITICAL ANALYST: Yes. SMITH: He's someone you knew. WILLIAMS: So, that's the last time I saw Senator McCain. We ran into him at the Nationals baseball game this summer. So, that's the last time I think that he was here. And again, you know, Senator McCain and I had had disagreements. My job is to sometimes be critical of politicians. I remember when he was yawning, groaning I think it was in '07, he was down at the bottom in terms of candidates seeking the Republican nomination. I said, it looks like John McCain is out of gas here. And, boy, he didn't like it. He let me know he did not -- he didn't think that was the right thing for me to say and then when he came back, he let me know, hey, I'm back, I won and you should tell people that I came back, you know? So that's John McCain. But to me, just picking up on what Marie said, what stuns me is not only that he would go back and work to normalize relations with Vietnam, but here in America at a time of political polarization, part of the reason I think we honor McCain so much today, it comes out of our living need to say that we can go beyond party politics, we can go beyond polarization. We can go beyond race. You heard what he said to Chris about acknowledging a mistake on the Confederate flag issue. But if you think about his working with Russ Feingold on campaign finance reform, with Ted Kennedy on health care, you think about him standing up to his own party on the Affordable Care Act recently and saying I don't think we can just strip it, we have to have something to put in its place. This is the maverick. He said he didn't like to be called a maverick. He would rather be called a great American. I think on this Sunday morning, Sandra, we can say -- John McCain, you are -- you were not only patriot, a great American and an American hero. SMITH: You know, he referenced back, Gillian, to his mother, Roberta McCain, she is still with us. She's 106 years old. He was certainly obviously a war hero, a politician with a long career, a successful career in politics, but he talked about his family being the most important thing in the world to him. GILLIAN TURNER, FOX NEWS CORRESPONDENT: Oh, of course, and those of us who know it had the chance to work with Meghan when she was here at the channel know just how tight his bond was not with her but with all of his children. Marie pointed out that a really important part of his legacy is that he was a national security hawk. A defense hawk. But I think it's important to point out that he was not a warmonger. Far from it. You know, he spent a lot of time advocating for better support and services for service members, veterans and their families, but he had a very healthy appreciation, especially later on during his tenure in the Senate for the limits to the use of military force. I always think about Afghanistan, he lobbied President Obama really hard for increased troop presence in Afghanistan and then was the first guy on the Senate floor after that was secured to stand up and say America is never going to secure all of its interests in this country with the use of military force alone. He is very unique in that. He's worked on both sides of the issue as a service member and then his policy, there is no one else like that. SMITH: Yes. And now, a lot of questions about what will happen with that vacant seat, who will fill it and what kind of -- the timing is going to be so important, obviously, with the Brett Kavanaugh hearings coming up. A fighter he called himself and I think we all agree we saw in the same way. We have to take a break with our panel but when we come back, two of the president's former close associates are facing jail time. What does this turn of events mean for the president? We will speak with two insiders, former Attorney General Alberto Gonzales and former Trump campaign manager, Corey Lewandowski, next. (COMMERCIAL BREAK) SMITH: Coming up, Democrats issue a warning to President Trump over the use of his pardoning powers. (BEGIN VIDEO CLIP) SCHUMER: The president should not even consider pardoning Mr. Manafort or Mr. Cohen at any point in the future. (END VIDEO CLIP) SMITH: We'll ask our Sunday panel about the true extent of the president's authority, coming up on \"Fox News Sunday\". (COMMERCIAL BREAK) SANDRA SMITH, FOX ANCHOR: Tensions between President Trump, his attorney general and the Justice Department reaching epic levels after a week of legal bombshells involving once loyal members of his inner circle. Let's review. This week, Mr. Trump's former campaign chairman, Paul Manafort, convicted in federal court on financial crimes. His former personal attorney, Michael Cohen, implicated the president in a harsh money scheme. And the two men closest to those payments granted immunity. The White House says none of this has anything to do with the president. That he did nothing wrong and there are no charges against him. Joining us now, Alberto Gonzales, former U.S. attorney general who served under President George W. Bush. Welcome back to \"Fox News Sunday,\" sir. Thank you for coming on the program. ALBERTO GONZALES, FORMER U.S. ATTORNEY GENERAL: Good morning. If I can, let me -- let me just as an Air Force veteran, I honor John McCain's service and sacrifice on behalf of our country, our military, our veterans and their families. SMITH: We appreciate your words this morning as we're all sharing sentiments in the wake of John McCain's death. We're following the developments of what was -- it was a hectic week for this White House and for the president. And questions about what sort of legal peril the president is in, or is he in any legal peril at all, depends on who you ask. I want to start first with the president's argument that his attorney general never took control of the department. (BEGIN VIDEO CLIP) DONALD TRUMP, PRESIDENT OF THE UNITED STATES: I put in an attorney general that never took control of the Justice Department, Jeff Sessions. Never took control of the Justice Department. And it's a -- sort of an incredible thing. (END VIDEO CLIP) SMITH: So, first, just let's establish where you stand on this, judge. Is that criticism of the president, of his AG, is that fair? GONZALES: That is a very serious allegation that the Department of Justice is out of control. You know, Jeff Sessions has been mainly quiet until now in the face of a lot of criticism from the White House. And he finally responded. And I think it was appropriate that he did respond because to say that the department is out of control is a very serious charge. From my perspective, from my vantage point, you know, there appears to be investigations ongoing, appear to be successful prosecutions. And so I think that it's important for the attorney general to reassure the American people, and speaking to the president, that he is in control of the Department of Justice and that it's operating the way that it should be operating. Now, that's not to say that the president, as president of the United States, he has a right to be critical, to say what he wants to say about his Cabinet officials. As a general matter, I think it's more effective to do it privately than publicly because it undermines the department -- the attorney general and also I think hurts the moral of the Department of Justice. So I think it's preferable for the president to speak his concerns and criticism to the attorney general directly as opposed to publically. But he certainly has a right to speak out. SMITH: Well, Sessions hit back at the president, and sort of rare for him. He doesn't normally publicly hit back at the president. But here he was, the action of the Department of Justice will not be improperly influenced by political considerations. And, like I said, this marks one of the few times that we've seen him publicly respond to the president, although he did not call him out my name there. But what is, judge, the danger in this feud between the president and his AG? What is the danger in this continuing? GONZALES: Well, as I said, I think -- I fear that because the president is head of the executive branch and can remove the attorney general anytime that he wants, that the continued criticism without taking any action I fear makes the president look a little weak. But I also worry about the fact, as I said, it undercuts the attorney general's authority and agency battles with other cabinet secretaries, with his counterparts around the world, and I do think it has a long-term effect upon the morale of the Department of Justice and undermines the integrity, how people view the Department of Justice, how the American people view the institution. And I think that's -- that's very, very dangerous. And so, as I said, the president has a right to speak out, no question about that. He was unhappy with the performance of the attorney general. But as a general matter, I'm not sure that it's doing the president much good. It may be preferable and more effective to do it privately. SMITH: Meanwhile, a lot of developments as far as the Robert Mueller investigation goes. This week a conviction in the case of Paul Manafort and the White House making it very clear where it stands on that case. (BEGIN VIDEO CLIP) SARAH SANDERS, WHITE HOUSE PRESS SECRETARY: The Manafort case doesn't have anything to do with the president. It doesn't have anything to do with his campaign. It doesn't have anything to do with the White House. (END VIDEO CLIP) SMITH: What are the ramifications of Paul Manafort's conviction, judge? GONZALES: I think it's still too early to tell. It is interesting, the White House is correct that no charges have been brought against the president, but we need to be mindful of the fact that it is current DOJ policy, as I understand it, that the president cannot be indicted and the president cannot be prosecuted. So you're not going to see any charges, I don't believe, brought against the president. Irrespective of whether or not there is a conclusion by the Department of Justice that the president engaged in criminal wrongdoing. But, nonetheless, I think with respect to the conviction of Paul Manafort and the guilty plea of Michael Cohen, you know, it's not good. It creates a lot of debate and swirl around the president as an individual and that's never good. I think it averts a president's attention from the business of the American people. There are very serious issues, both domestically and across the world that deserve the president's full attention, and that's what I worry about. SMITH: But the president did seem to sort of praise Paul Manafort in the wake of his conviction, leaving questions about whether or not he may pardon him. Look how he responded to that question. (BEGIN VIDEO CLIP) DONALD TRUMP, PRESIDENT OF THE UNITED STATES: Paul Manafort's a good man. He was with Ronald Reagan. He was with a lot of different people over the years. And I feel very sad about that. (END VIDEO CLIP) SMITH: So that was him on the ground in West Virginia seemingly praising Paul Manafort when asked specifically in a Fox News interview whether or not he would pardon him. He did not say no and he did not say yes. Do you -- is he laying the groundwork for a pardon? GONZALES: Well, you'll have to -- we'll have to ask the president. I don't -- I can't -- I can't get into his mind. It is a bit unusual for the president of the United States, the head of the executive branch, and the Department of Justice works for the president of the United States, and they've had a very -- they had a very successful conviction of Paul Manafort. And to have the president then, you know, speak so well of Paul Manafort was -- was somewhat unusual. In terms of a pardon, as we know, the president's pardon power is virtually unlimited and so the president may decide that this is a particular case where a pardon is warranted. If he believe that Paul Manafort was unfairly treated. But, again, that would send a message that he believes his Department of Justice acted in a way that was unprofessional and unfair. And I -- you know, I worry about that kind of message as well. SMITH: So many wondering how far this Mueller investigation will go, how long it will go on. The president talking about a sit-down interview with Mueller a perjury trap. You heard that from Rudy Giuliani. Ultimately, do you think the president should sit down with Robert Mueller? GONZALES: I think it might be helpful politically for the president to at least respond to written questions. I don't know about sitting down with -- and giving oral testimony to Robert Mueller. But I -- I think perhaps it may -- it may ease, in the minds of certain members of the American public, the president's involvement, the president's knowledge about Russia, Russian involvement in the presidential election 2016. So -- but we'll have to wait and see. SMITH: That's a big wait and see. We'll see where it all goes. Judge Alberto Gonzales, great to get your take on things this morning. Thank you for -- thank you for joining us on \"Fox News Sunday.\" GONZALES: Thank you for having me. SMITH: Now to Corey Lewandowski, President Trump's former campaign manager, who joins us now live from New Hampshire. Corey, welcome back to \"Fox News Sunday.\" Good to have you on the program. What a week this was. How would you describe this week for the president? COREY LEWANDOWSKI, FORMER TRUMP CAMPAIGN MANAGER: Well, Sandra, let me first echo what Judge Gonzales said and -- and let all of the viewers know how our thoughts and prayers are with the McCain family. And as a New Hampshire almost native son, the years he spent up here campaigning, the success he had, I just want to echo those statements to remember a man who served our country with great admiration and honorable. And so I want to thank and thank the McCain family and have our thoughts and prayers with him as we start. But as it relates to the president and this week, what we have seen here, once again, is the Mueller investigation, which was designed to look at potential collusion between the Trump campaign and the Russian outside influence, has no bearing, has not produced any evidence, not one scintilla of evidence that there was any type of collusion, cooperation or coordination between the Trump campaign and anybody from an outside source to impact the outcome of the election. So what I think is important now is that the Mueller investigative team finishes their investigation, reports that to the Department of Justice and we put an end to the investigation, which clearly has demonstrated has nothing to do with the presidential campaign of 2016. SMITH: You've got to think about how that looks, though, the conviction of Paul Manafort, the guilty plea from Michael Cohen, immunities granted to two others close to all of this. And you've got to wonder, Corey, and you've got to -- you -- the optics of it, does it spell trouble for the president as this investigation continues? LEWANDOWSKI: Well, Sandra, if you look at what Paul Manafort was originally charged with and has now been found guilty of, those are crimes that he was accused of and found guilty of that took place 10 to 12 years prior to him coming to the Trump campaign for the five month window. Those were tax evasion charges. Those were charges that have absolutely nothing to do with his tenure with us. And what Bob Mueller's team was supposed to be investigating was the potential collusion between Russia and the Trump campaign. So the conviction of Paul Manafort has nothing to do with the Trump campaign, the Trump Organization or any work that transpired during the 2016 campaign. And as it relates to Michael Cohen, who has now pled guilty and was looking at 60 plus years in jail, once again, his crimes were basically crimes of not following the rules as it relates to your taxes. Following false -- filing false bank statements. Those have nothing to do with the campaign. Look, I was the campaign manager. I spent as little time with Michael Cohen as humanly possible. He was never part of the campaign when I was there. And what he has now pled guilty to, by and large, has nothing to do with the campaign or the Trump Organization. This is Michael Cohen not filing taxes. SMITH: But, Corey -- Corey, I hear -- I hear what you're saying about your relationship with him, and there have been reports that you privately tried to get the president -- tried to get the president to back away from him. You were warning him that he was a loose cannon. But the president said, at that time, at one point in time, that he was a good lawyer and he trusted him for a long time. Now he's calling him a flipper. So why did the president trust Michael Cohen as long as he did, especially with warnings coming from the likes of you? LEWANDOWSKI: You know, Michael was very good at certain things. And one of the things that he was very good at, and we've now seen it, is intimidating people and pushing himself to fix -- he was the self-described fixer, which I don't know what that means, but I know from the corporate side -- and I didn't work at the corporation, to be clear, but when there was a problem from the corporation side, you know, if there's a problem with an airplane engine, Michael was tasked with the negotiation to make sure that that engine was fixed under the warranty procedures when companies didn't want to do that. I know that was one specific project. But I can tell you this, I didn't like to work with Michael. I didn't like to interact with Michael. And that's why he had no role in the campaign, even though he wanted one. I was very clear, when I was in charge of the campaign, Michael was not somebody who we wanted at the campaign. He would go out and make statements that we had to walk back afterwards because he would say things which were factually untrue. And I warned everybody at the organization that Michael was going to become a problem. SMITH: Here we are, final week -- weekend in August, I should say. It's hard to believe we'll be moving into September, ever more closer to November. What are your expectations for Republicans in the midterm elections, Corey? LEWANDOWSKI: My expectations are that when it comes to the U.S. Senate, the Republicans will gain three to four seats, expanding their majority there. And when it comes to the House of Representatives, I think the Republicans are ultimately going to have a smaller majority, but they're going to continue with their majority because the American people are going to have a chance this November to either go in the direction of economic security, homeland security and national security or they can go back to the days of potentially Speaker Pelosi whereby open borders and no tax cuts, that's what the American people are faced with. SMITH: You mention Nancy Pelosi. She called Tuesday Trump's day of reckoning. If Democrats were to win control of the House, what do you think the chances are of -- of them going for impeachment of the president? LEWANDOWSKI: Well, I think it's clearly on their agenda because they have no other agenda. When you look at Maxine Waters, who was slated to become the chairman of the House Financial Services Committee, Jerry Nadler from New York, the chairman of the House Judiciary Committee if they take over, they have no plan for the American people. So there only plan is to be obstinate and obstacles to the Trump economic agenda. And that means starting an impeachment proceeding where there is none to be found, but that will completely stymie a Washington, D.C., which is candidly already broken. SMITH: I've got to ask you finally about the -- New York state subpoenaed Michael Cohen. This involves you as part of this probe into the Trump Foundation. It alleges persistently illegal conduct. They're accusing the non-profit, the Trump Organization, of engaging in extensive unlawful political coordination with the Trump campaign. The president has vowed in response publicly that he won't settle this case. The lawsuit does point to you, Corey, which is why we wanted to ask you about it before you go. First of all, have you been contacted about that? LEWANDOWSKI: So I've never spoken to anyone from the state of New York about this issue. And -- and what's really at stake here and what the crux of the argument is, is that the Trump Foundation, which has no overhead and actually gives out more money than it ever raises, is a recognized 501(c)3 charitable organization. And they're calling into question raising money for that 501(c)3 and then distributing it to other 501(c)3s. That's what this is all about. I've never seen it before. I've never heard of it before. And this -- the Trump Foundation gave away more money than it actually raised because the president, then candidate Trump, was putting his own money into it. SMITH: Well, they've subpoenaed -- they've subpoenaed Michael Cohen. What will they learn from him? LEWANDOWSKI: Well, that's a great question. I don't know what Michael has to do with the -- the Trump Foundation at all and I don't know what he has to do with the disbursement of the money from the foundation. So that will be news to all of us when we find that out. SMITH: Corey Lewandowski, thank you very much for joining us today. LEWANDOWSKI: Thank you. SMITH: Thank you. Up next, our Sunday group returns to discuss the fallout from the swirling investigations battering the White House. (COMMERCIAL BREAK) (BEGIN VIDEO CLIP) BEN SASSE, R-NEBRASKA SENATOR: The idea that Jeff Sessions might be fired because he's not a political hack is a very, very bad idea. LINDSEY GRAHAM, R-SOUTH CAROLINA SENATOR: Replacing him before the election to me would be a nonstarter. But the idea of having a new attorney general in the first term of President Trump's administration I think is very likely. (END VIDEO CLIP) SMITH: Differing opinions even inside the GOP about the future of Attorney General Jeff Sessions after the president reignited their feud over his recusal from the Russian investigation. And we are back with our panel. Marc, you heard -- you heard Senator Sasse there suggesting firing Sessions would be -- I think he said a very, very bad idea. Would it? MARC LOTTER, FORMER PENCE PRESS SECRETARY: And I don't think anyone is seriously taking that as something happening before the midterms. I think Senator Graham, obviously, talked about that as well. I think any -- while the president can make changes, you know, when he decides it's time to make a change, I would personally be surprised if it happened before midterms. SMITH: Doesn't Lindsey Graham, one, have a point when he says that the -- the president is entitled to have an attorney general that he has confidence in? JUAN WILLIAMS, FOX NEWS POLITICAL ANALYST: Without a doubt. The problem is that given the political context, Sandra, can he get a new attorney general? The Republicans have a 51-49 advantage in the Senate. But already you hear from people, and you just heard one there, but also Susan Collins and others say, this would be a mistake. And, don't forget, Jeff Sessions was a U.S. senator. He has lots of friends there. So there would be strong opposition. And the question then would be, oh, if you want to fire Sessions, are you going to replace him with someone then who's going to fire Mueller or fire Rod Rosenstein, the deputy attorney general? SMITH: Right. And -- WILLIAMS: And when people start thinking like that, they are definitely going to have much resistance. SMITH: And Susan Collins, a pivotal Republican, she wanted of the same thing, if you fire him, we may not be able to replace him, right? MARIE HARF, FORMER STATE DEPARTMENT SPOKESPERSON: That's right. And it shouldn't matter whether it's before or after the midterms. If it's wrong to fire him because he's not serving us President Trump's personal attorney general, which is, I think, what Donald Trump had in mind when he appointed Jeff Sessions to that role, it should be a problem either before or after. But the politics will be an issue here. I do not think the Senate, particularly as closely divided as it is, can replace him. Jeff Sessions, as Juan mentioned, he was a senator. He has a lot of friends up there. And I think what you see is the president had probably his toughest week and the press this week as president. He's lashing out increasingly at everyone, including Jeff Sessions, because the situation is very dire. There are three ongoing investigations. People get immunity every day. People are working with prosecutors -- SMITH: Hold on, not every day. HARF: But that's -- well, every day this week we had a new report of someone close to Donald Trump getting immunity and I think you see the president not knowing how to respond. SMITH: But the question is, what does all of that mean and imply for the president? HARF: Right. SMITH: And the White House is saying it has nothing to do with the president and the president -- there's no implication that he did anything wrong in all of that. HARF: Well, we'll see. SMITH: But Sessions is firing back, which was really interesting because we haven't seen him fire back in such a public way. And he said, he will not let the department be improperly influenced by political considerations. Is that a sign perhaps, Gillian, that he's taking this feud more public? GILLIAN TURNER, FOX NEWS CORRESPONDENT: Oh, absolutely. And a lot of folks were shocked to see that tweet when it came out yesterday -- SMITH: Statement, yes. TURNER: Or Thursday, whenever it was. I do disagree with Marie slightly in terms of the timing here. I think that if Sessions leaves, whether he's fired, whether he departs after the midterm, he does get -- the president gets a little bit of a get out of jail free card on that in the sense, there's nothing scandalous, there's nothing unusual about an attorney general leaving -- anyone in the cabinet leaving after the midterms in any administration. I think waiting until then would really turn the heat down on this entire situation. And I think that's what Collins and that's what Cornyn and other Republicans weighing in on this and warning the president are trying to tell him. SMITH: Meanwhile, the president and his team are making it very clear they want this Mueller probe, this investigation, to come to an end. Rudy Giuliani, the president's attorney, tweeted yesterday, just days before 60 day run-up to 2018 elections. If Mueller wants to show he's not partisan, then issue a report on collusion and obstruction. They will show President Trump did nothing wrong. Then we will have to admit you were fair. And we will. Is Giuliani publicly trying to rush the special counsel to wrap up this investigation? LOTTER: Well, I think he is acknowledging what we -- what we see out there every day. I mean anyone who was close to President Trump or worked for President Trump is getting a legal colonoscopy by every investigator out there. Meanwhile, Democrats -- SMITH: That was a visual I didn't need. LOTTER: And, meanwhile, Democrats are getting a Band-Aid and sent on their merry way. And I think he wants to bring this to a close. We have seen -- we've still see no evidence of collusion. And nothing is still -- SMITH: Do Republicans have a point, Marie? This investigation's been going on 16 months and counting. HARF: Well, also, Republicans investigated the Clintons over Whitewater for six years. So let's all just have some perspective here. I think that Mueller cannot wrap this up before the midterms because they haven't settled issues of whether the president will sit down with him. There are a number of people who haven't been interviewed yet. I think that Mueller will avoid actually saying anything until after the midterms because there are a lot of outstanding questions that still need to be answered. And through the investigation we have learned much more. The Trump campaign started out by saying, no one ever talked to any Russians. Well, now we know that over a dozen Trump campaign people did. That may not be collusion, Sandra, but we have learned much more throughout this investigation that warrants further questions. Those are serious and cannot be wrapped up, I think, in the next few months. SMITH: I think it left a few people wondering why, when the president this week said he could go in and do whatever. He could run it if he wants. But he decided to stay out when it comes to this investigation. What does that tell you? WILLIAMS: Well, I think he's really, at this point, sort of flustered and flailing. If he thinks that he can take control of the investigation, that's like, you know, Al Capone taking charge of Eliot Ness. It's just not the way it's done in this country. No man is above the law is the standard. So he instead now is attacking not only Sessions, as we just discussed, but he's also saying, go after the Democrats, my political opponents. Why'd they get an easy pass? I don't know if they got an easy pass. I think they were thoroughly investigated. But then the other part of it is that he goes after a witch hunt. He says this has been a witch hunt and appeals to his base. At some point -- SMITH: (INAUDIBLE). WILLIAMS: You've got to ask people, when do you stop justifying bad behavior by this president? SMITH: All right, with the time we have left, I want to go around the table, predictions for the midterms, starting with you, Marc. LOTTER: Keep the -- expand the majority in the Senate, keeps the majority in the House. SMITH: Marie? HARF: Democrats take the House. It's going to be a bit of a blue wave. The Senate's a toss-up. SMITH: Oh, you guys are making this easy. All right. Gillian? TURNER: Agreed. Dems take the House and the Senate is -- SMITH: Juan? WILLIAMS: Oh, I think that right now the president said this week a red wave. I do not see a red wave. Instead, what I see is likelihood that I would say a third a chance of a strong blue wave in which the Democrats not only take the House but control in big numbers or, secondly, get just enough, a third chance, that they don't make it. And in the Senate, I think the odds, given the playing field, is still with the Republicans to hold. SMITH: Final question, Marie, if Democrats win control of the House, will they move to impeach the president? HARF: I think, after the last week, it is a conversation with having that wasn't worth having a week ago. And we're going to have it. SMITH: You guys are good. I mean right on your time cues. OK, it was really fun to have you guys as our panel this morning. Thank you very much, all of you. HARF: Thank you, Sandra. WILLIAMS: It was fun to have you. SMITH: Thank you. And we'll see you next Sunday. Up next, a final word. (COMMERCIAL BREAK) SMITH: And that is it for today. For more on the life and legacy of John McCain, please stay tuned to this station and Fox News Channel. I'll see you again tomorrow morning at 9:00 a.m. Eastern for \"America's Newsroom\" on Fox News Channel. Come join us. Have a great week, everyone. And Chris will see you next \"Fox News Sunday.\" END Content and Programming Copyright 2018 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2018 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.",
      "date": "August 26, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Gutfeld on the life of John McCain",
      "url": "https://www.foxnews.com/transcript/gutfeld-on-the-life-of-john-mccain",
      "subtitle": "Gutfeld on the life of John McCain",
      "author": "Greg Gutfeld",
      "content": " Life is all about holes. You spend your life trying to fit into one, but that's the last thing you should want because when you die, trust me, you'll fit. No matter how round a peg you are, eventually you go nicely into a rectangular hole. It's your job to do what John McCain did: Never willingly fit, never lie down and quit, make a fuss, make everyone work harder. In fact, you can measure a life by the size of the hole needed to accommodate it. Make sure yours is McCain's size. There are people whose exit leaves a Grand Canyon-sized space that can never truly be filled. Senator McCain left that space. And while condolences may often feel trite, they can help fill that space, especially when there are millions of them. Senator McCain was foremost an independent thinker, a round peg in a world capital of square holes. He owned his thoughts, critics be damned. His experiences taught him to shrug stuff off stuff that would have left us in tears. Five and a half years in a prison camp will do that to you, and that's real diversity. He was feisty, funny and real. We need a good John McCain and not just every generation but every day. Somebody who reminds us that we don't all have to act the same and who knows that there is a difference between a good idea and the latest idea. The Earth is covered in cemeteries, endless green acres of rectangular holes. There's one near you and in your future. But if there's an army of round pegs filling square holes won't be easy. And life, be a John McCain, be a little less predictable tomorrow than you were today. Realize that politics is only a small part of life, not life itself. Be the round peg that refuses to fit in.",
      "date": "August 27, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Judge Andrew Napolitano: John McCain and me",
      "url": "https://www.foxnews.com/opinion/judge-andrew-napolitano-john-mccain-and-me",
      "subtitle": "Judge Andrew Napolitano: John McCain and me",
      "author": "Judge Andrew P. Napolitano",
      "content": " About four years ago, I was browsing through one of Manhattan’s last remaining independent bookstores, when my cellphone rang. I didn’t recognize the incoming telephone number, with its 202 area code, but I assumed it was a Fox News colleague from our Washington bureau. When I answered the phone, a somewhat familiar but somber voice said: \"Judge Napolitano, your reward for what you did today will not come from your colleagues or viewers or even on earth but in heaven.\" What had I done to deserve this? Earlier that day, Dianne Feinstein, a Democrat from California who was then the chair of the Senate Intelligence Committee, had defied her own committee members, congressional leadership from both houses of Congress and from both political parties, officials of the CIA, and even the Obama White House when she released on the floor of the Senate a 6,000-plus-page report detailing the use of torture by CIA officials in the George W. Bush administration -- all of it unlawful. She actually made the report public while physically standing on the floor of the Senate, where her speech is absolutely protected from government retaliation by the Speech and Debate Clause of the Constitution. That clause recognizes and protects for members of Congress their complete freedom of speech while on the floor of the House or Senate, while doing congressional work and while traveling to Capitol Hill. Thus, even though she revealed top-secret materials in the report -- which, if you or I had revealed them or if she had revealed them in Los Angeles rather than in Washington, would have constituted the crime of espionage -- she was immune from all prosecution. In response to the Feinstein revelations, my Fox News colleague and friend Shepard Smith and I spent about 30 minutes on-air that afternoon on his Fox News Channel show discussing the criminal behavior Feinstein had revealed, the constitutional protections she, as a member of the Senate, enjoyed, and the political firestorm she had courageously ignited. As a believer in the rule of law and the bodily integrity of all people, I was full of praise for what Feinstein had just done. When the government breaks the laws it has sworn to uphold, Shep Smith and I argued, the people have a right to know about it. But many of Sen. Feinstein’s colleagues did not see it that way. Many of those who never endured torture and those believing that the end justifies the means accepted the myth that torture works -- that the victim tells the truth; and in their view, obtaining the truth is worth the cost in lawbreaking and body-breaking. Only one Republican senator publicly supported what Feinstein had just done. He was my caller that afternoon in the bookstore, John McCain. I thought of his call and our many ensuing conversations when I learned of his death this past weekend, a few days shy of his 82nd birthday. McCain and I had hundreds of conversations. He knew that I knew that he was a bellicose warmonger and an uncritical supporter of unlimited military spending; and he was often indifferent to the consequences of those views. But he was also the victim of prolonged and horrific torture during the Vietnam War, which he could have avoided. He told me many times that torture so distorts the mind that the victim’s consequent speech is utterly unworthy of belief. He had become the leading congressional critic of torture, the prime congressional mover of making it all unlawful -- the Bush Department of Justice notwithstanding, it already was unlawful at the time Bush ordered it -- and one of the few Americans anywhere who could speak on this detestable subject from the personal experiences of a victim. Platitudes aside, the essence of the telephone conversation we had that day was that Bush had committed war crimes; that torture is absolutely prohibited by the Constitution, several treaties to which the United States is a party and numerous federal statutes; and that Sen. Feinstein had performed a positive public good by revealing it. It was Sen. McCain’s view that even if he was powerless to prevent government lawbreaking, it is better for the American people to know painful truths than to remain in the dark. Shortly after our phone conversation, McCain went to the floor of the Senate and delivered one of his classic tirades against torture. In it, he attacked President Bush, who ordered and authorized it, and President Barack Obama, who covered it up. This week, those two former presidents. firmly in McCain’s crosshairs four years ago, are each delivering a eulogy at McCain’s funeral -- willingly, dutifully and at his request. The John McCain I knew discussed only torture, the right to life, and immigration with me -- perhaps because he knew we disagreed on nearly all other matters. But this tough old Arizona bird, this lifelong warrior, this unorthodox maverick who really was neither a Republican nor a Democrat, knew how to keep friends and monitor enemies. He was a multidimensional man in a secular era, and he was not happy about America at the end of his days. Yet in this age of few heroes, and on topics that intimately touch the human heart and soul, he was the genuine article.",
      "date": "August 30, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "John McCain-1936-2018",
      "url": "https://www.foxnews.com/us/john-mccain-1936-2018",
      "subtitle": "John McCain-1936-2018",
      "author": "",
      "content": "",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "John Oliver rips Meghan McCain: ‘I bet her husband is gonna get so mad at me’",
      "url": "https://www.foxnews.com/entertainment/john-oliver-meghan-mccain-seth-meyers",
      "subtitle": "John Oliver rips Meghan McCain: ‘I bet her husband is gonna get so mad at me’",
      "author": "Brian Flood",
      "content": " HBO’s “Last Week Tonight” host John Oliver slammed Meghan McCain on Sunday over her recent spat with Seth Meyers that resulted in “The View” co-host’s husband coming to her defense. Oliver played a clip from Icelandic rock band Hatari, noting that a member of the bizarre group is the son of the country’s ambassador to the United Kingdom. “You may be thinking that’s the most embarrassing child of a prominent political figure you’ve ever seen, but let me remind you the continued existence of Meghan McCain,” Oliver said. “I bet her husband is going to get so mad at me now.” MEGHAN MCCAIN’S HUSBAND BLASTS LATE-NIGHT HOST SETH MEYERS AFTER CONTENTIOUS INTERVIEW Earlier this month, McCain’s husband Ben Domenech, publisher of the Federalist, unloaded a series of insults on Meyers after the late night host had a testy exchange with his wife. It all started when Meyers, who hosted Domenech's wife on his show, challenged McCain on her repeated criticism of Rep. Ilhan Omar, D-Minn. At one point, McCain asked Meyers if he was Omar's \"publicist.\" Oliver mocked the situation, saying he can’t wait to see what Domenech has to say about the segment. “What on earth is he gonna tweet and then delete? I can’t wait to find out,” Oliver said. MEGHAN MCCAIN SAYS SHE’S ‘GRATEFUL THAT TRUMP IS PRESIDENT’ BECAUSE IT HELPS HER SUCCEED ON ‘THE VIEW’ McCain has been a target of liberal comedians on a regular basis recently and was also mocked on the latest episode of “Saturday Night Live.” Domenech’s now-deleted attack on Meyers included a reference to “SNL creator Lorne Michaels. \"I see that @sethmeyers, that untalented piece of s--- who only has his job because he regularly gargled Lorne Michaels' b--s, went after my wife tonight with his idiotic anti-Semitic bulls---,\" Domenech tweeted, according to The Daily Beast. MEGHAN MCCAIN, SETH MEYERS HAVE TESTY EXCHANGE OVER ILHAN OMAR: 'ARE YOU HER PUBLICIST?' Michaels created \"Saturday Night Live,\" where Meyers performed for many years. In another tweet, Domenech called Meyers an \"awful person who is known in the industry for how terrible he is.\" \"He is a monumental a--hole who is utterly unfunny. He deserves the mockery he receives from all the people who laugh at him,\" he added. He also said the host served as proof that \"white men get ahead despite their obvious lack of talent.\" \"It's @sethmeyers, who would beg for a third of the viewers at @TheView,\" he said, referring to his wife's show. CLICK HERE TO GET THE FOX NEWS APP \"But the best thing is how much all the people around @sethmeyers talk about what a s----y person he is. Because oh, it is sad. So terrible, But he deserves all of it,\" Domenech added in a different tweet. Domenech eventually apologized and deleted his tweets -- which Oliver seems to find hysterical. Fox News’ Sam Dorman contributed to this report.",
      "date": "May 20",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Trump takes shot at John McCain over Affordable Care Act repeal attempt at rally",
      "url": "https://www.foxnews.com/politics/trump-john-mccain-criticism-obamacare",
      "subtitle": "Trump takes shot at John McCain over Affordable Care Act repeal attempt at rally",
      "author": "Victor Garcia",
      "content": " President Trump once again took a shot at John McCain during a rally in Pennsylvania on Monday night. During a discussion on healthcare, Trump brought up his failed attempt to repeal and replace the Affordable Care Act, also referred to Obamacare, before renewing his ongoing criticism of the late former Senator. \"The fake news doesn't want to say it. We will always protect pre-existing conditions, very important. By the way, we got rid of the individual mandate, the worst part of Obamacare and we almost had it repealed and replaced but we had one man that after campaigning for eight years, he decided to go thumbs down at two o'clock in the morning,\" Trump said. DONALD TRUMP'S FEUD WITH MCCAIN FAMILY ESCALATES: 'I WAS NEVER A FAN' \"That's all right, but we'll end up, we'll end up with even better because we have plans that are even better than that.\" The comment was seemingly in reference to former Sen. McCain, R-Ariz., who famously voted against the repeal in 2017 giving it a thumbs down. This isn't the first time Trump has been critical of McCain after his death. During a speech in Ohio this past March Trump tore into McCain’s legacy and in an unusual remark, took credit for the late senator’s state funeral in Washington last year. “I endorsed him at his request, gave him the kind of funeral he wanted, which as president of the United States I had to approve,” Trump said. “I don’t care, but I didn’t get a thank you.” “I never liked him much,” Trump said. “I really probably never will.” TRUMP INVITES SUPPORTER WEARING WALL SUIT TO PENNSYLVANIA RALLY STAGE Trump’s feud with McCain dates back to well before he was elected president. In 2015, after McCain had said Trump's platform had \"fired up the crazies,\" Trump mocked McCain's imprisonment in the Vietnam War, saying: \"I like people that weren't captured.\" The two continued to be at odds until McCain’s death from brain cancer last August. Fox News' Andrew O'Reilly contributed to this report.",
      "date": "May 20",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Trump, Defense boss Shanahan both deny link to USS John S. McCain ‘out of sight’ directive",
      "url": "https://www.foxnews.com/politics/trump-defense-boss-shanahan-both-deny-link-to-uss-john-s-mccain-out-of-sight-directive",
      "subtitle": "Trump, Defense boss Shanahan both deny link to USS John S. McCain ‘out of sight’ directive",
      "author": "Dom Calicchio",
      "content": " A mystery continues to surround a reported U.S. military email that called for the USS John S. McCain to be “out of sight” during President Trump’s recent visit to U.S. troops stationed in Japan, where the ship was docked. On Wednesday, both President Trump and acting Defense Secretary Patrick Shanahan denied any knowledge of the order, which led to the ship’s name first being covered with a tarp and then being obscured by a paint barge prior to Trump’s visit over Memorial Day weekend. “I was not informed about anything having to do with the Navy Ship USS John S. McCain during my recent visit to Japan,” President Trump wrote on Twitter late Wednesday. “Nevertheless, @FLOTUS and I loved being with our great Military Men and Women - what a spectacular job they do!” USS JOHN S MCCAIN LEAVES DRY DOCK MORE THAN YEAR AFTER FATAL COLLISION A spokesman for Secretary Shanahan later issued the following statement: “Secretary Shanahan was not aware of the directive to move the USS John S McCain nor was he aware of the concern precipitating the directive.” That statement appeared to contradict a Wall Street Journal story, which cited an unnamed U.S. official as saying that Shanahan was “aware of the concern about the presence of the USS John McCain in Japan and approved measures to ensure it didn’t interfere with the president’s visit.” The existence of the email – sent by an unnamed U.S. Indo-Pacific Command official to U.S. Navy and Air Force officials – was first reported by the Journal. The newspaper’s story claimed that orders referring to the USS John S. McCain originated from “the White House,” but named no specific official. The ship is named for the father and grandfather of the late U.S. Sen. John S. McCain III, with whom President Trump had feuded prior to the Arizona Republican’s death from cancer last year at age 81. The emergence of the Journal story apparently infuriated Meghan McCain, daughter of the late senator and a co-host of ABC’s “The View” – who, like her late father, is a frequent Trump critic. MEGHAN MCCAIN DISMISSES 'VIEW' CONVERSATION: 'I'M NOT CHANGING YOUR MINDS THIS MORNING' In a tweet Wednesday that preceded the president’s message, Meghan McCain appeared to insinuate that the order to obscure the ship's name had come from the president. Meghan McCain retweeted the Journal story, adding the following comment: “Trump is a child who will always be deeply threatened by the greatness of my dads [sic] incredible life. There is a lot of criticism of how much I speak about my dad, but nine months since he passed, Trump won't let him RIP. So I have to stand up for him. It makes my grief unbearable.\" Since McCain’s death, the late senator’s 34-year-old daughter has been quick to defend his legacy. Just two days earlier, Meghan McCain aimed her ire at Sen. Amy Klobuchar, D-Minn., a candidate for the 2020 Democratic Party presidential nomination. Klobuchar recently claimed that the late senator “kept reciting to me names of dictators” during President Trump’s inaugural address in 2017, suggesting that the elder McCain dreaded the thought of a Trump presidency. But Meghan McCain said she and her family would prefer if the late senator’s name not be invoked at all during the 2020 election season. CLICK HERE TO GET THE FOX NEWS APP \"On behalf of the entire McCain family, [Amy Klobuchar], please be respectful to all of us and leave my father's legacy and memory out of presidential politics,” the late senator’s daughter wrote. Ultimately, the Journal reported, the tarp that covered the name of the USS John S. McCain was removed Saturday and the paint barge that obscured the name was removed as well – both ahead of Trump’s visit, Cmdr. Clayton Doss, a spokesman for the Navy’s Seventh Fleet, told the newspaper. President Trump spoke to the Japan-based U.S. troops Tuesday while aboard the USS Wasp, which was docked at the same naval base as the USS John S. McCain.",
      "date": "May 30",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Sen. John McCain: Why I support school choice and charter schools (and you should, too)",
      "url": "https://www.foxnews.com/opinion/sen-john-mccain-why-i-support-school-choice-and-charter-schools-and-you-should-too",
      "subtitle": "Sen. John McCain: Why I support school choice and charter schools (and you should, too)",
      "author": "Sen. John McCain",
      "content": " A quarter-century has passed since the nation’s first charter-school law was enacted in Minnesota, leading to arguably the most fundamental shift in public education in my lifetime. Across the 42 states that now have charter-school laws, access to a quality education is no longer determined by the neighborhood in which a student lives. Families in these states have grown accustomed to competition and choice in the K-12 education marketplace. For nearly three million charter school students and their families, there is no going back. Just as critical, the 6,700 individual charter schools that have opened nationwide are serving as incubators of the most forward-thinking leaders in public education. In my home state of Arizona, families may choose from 556 public charter schools – including those that specialize in STEM instruction, the arts, college-prep, online instruction and more. That is what happens when school leaders are freed from traditional education bureaucracy. It’s the essence of local control. That’s why the Every Student Succeeds Act, which was enacted at the end of last year, is so monumental. Not only does this bipartisan measure return power over public education to where it rightfully belongs – the states – it also includes a provision I offered that prioritizes federal education tax dollars to expand student access to the highest-performing public charter, magnet and district schools. Currently, the lack of additional capacity keeps an estimated one million students nationwide locked out of the charter school of their choice. I’m confident the Every Student Succeeds Act will begin to address this enrollment bottleneck. Of course, educational performance is the best indicator of success, and research shows that students are best served when teachers, parents and schools have control over education – not Washington bureaucrats. The latest round of data from the National Assessment of Educational Progress shows nationally that scores were flat or declining in reading and math. But Arizona charter schools bucked the trend, with charter students achieving a marked improvement. In fact, if Arizona’s 170,000 public charter school students were measured as an individual state, that state would have ranked 2nd nationally for both eighth-grade math and reading, according to the non-partisan Center for Student Achievement. Arizona’s fourth grade charter school students did nearly as well, ranking 5th nationally in math and 7th in reading. The emphasis in Arizona is now on replicating and expanding those schools that have discovered a winning formula, and more aggressive monitoring of overall school performance. Failing charter schools should be closed. No excuses. The result of these combined actions is undeniable. Nearly one-third of all Arizona public schools are now charters, and charter students – as a whole – are performing on-par or better than their peers in upper-crust, northeastern states, including Massachusetts, New Hampshire, New Jersey and Vermont. This is what is possible when decisions about our children’s education are kept local, innovation is rewarded and school leaders are empowered. Twenty-five years later, these principles remain at the heart of a charter and school choice movement that is remaking K-12 education in Arizona and nationwide. Our children are the beneficiaries.",
      "date": "January 27, 2016",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Navy confirms request to ‘minimize’ USS John McCain during Trump visit to Japan",
      "url": "https://www.foxnews.com/politics/navy-confirms-request-to-minimize-uss-john-mccain-during-trump-visit-to-japan",
      "subtitle": "Navy confirms request to ‘minimize’ USS John McCain during Trump visit to Japan",
      "author": "Adam Shaw",
      "content": " The Navy on Saturday confirmed that a request was made to “minimize the visibility” of the U.S.S. John McCain during President Trump’s recent visit to Japan -- but that it remained in a “normal configuration” during the visit. \"A request was made to the U.S. Navy to minimize the visibility of USS John S. McCain, however, all ships remained in their normal configuration during the President's visit,\" Rear Adm. Charlie Brown, chief of Navy information, said in a statement to Politico. TRUMP, DEFENSE BOSS SHANAHAN BOTH DENY LINK TO USS JOHN S MCCAIN 'OUT OF SIGHT' DIRECTIVE The statement said that there were “no intentional efforts to explicitly exclude Sailors assigned to USS John S. McCain.” The Wall Street Journal reported Wednesday that the White House had requested the Navy move the warship “out of sight” ahead of Trump’s state visit. The outlet cited a May 15 email from a U.S. Indo-Pacific Command official to U.S. Navy and Air Force officials that said: “USS John McCain needs to be out of sight.” After the officials expressed surprise, the official said he would talk to the White House Military Office to get more information about the order. The Journal also reported that a tarp was hung over the ship’s name ahead of the visit and sailors were directed to remove any coverings from the ship with its name on it. McCain, a former Arizona senator and military veteran, had a years-long feud with Trump before his death from brain cancer last year. But Trump has kept that feud going even since McCain’s death, particularly his anger at McCain casting the decisive vote against Republican efforts to repeal and replace ObamaCare in 2017. In March Trump complained at a rally that he \"endorsed him at his request, gave him the kind of funeral he wanted...but I didn’t get a thank you.” “I never liked him much,” Trump said. “I really probably never will.” The warship was commissioned in 1994 and originally named for the senator's father and grandfather, both Navy admirals named John Sidney McCain. Last year, the Navy rededicated the ship to honor Sen. McCain. According to the Journal, sailors on the ship were given the day off and a barge was moved closer to the ship, obscuring its name. But a spokesman told the Journal that the tarp was taken down and the barge removed before the presidential visit. TRUMP SAYS NOT INVOLVED WITH KEEPING MCCAIN SHIP OUT OF VIEW Both Trump and Acting Defense Secretary Patrick Shanahan have denied knowing anything about any such orders. Trump told reporters Thursday that while he was not “a big fan” of McCain, “I would never do a thing like that.” \"Now, somebody did it because they thought I didn't like him, OK? And they were well-meaning, I will say,\" he said. CLICK HERE TO GET THE FOX NEWS APP “Secretary Shanahan was not aware of the directive to move the USS John S McCain nor was he aware of the concern precipitating the directive,” a spokesman for Shanahan said in a statement. In his statement Saturday, Brown said the Navy is “fully cooperating” with a review fo the matter tasked by the Pentagon. Fox News' Dom Callichio and The Associated Press contributed to this report.",
      "date": "June 1",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "President Trump takes heat for attacks on John McCain",
      "url": "https://www.foxnews.com/transcript/president-trump-takes-heat-for-attacks-on-john-mccain",
      "subtitle": "President Trump takes heat for attacks on John McCain",
      "author": "",
      "content": "This is a rush transcript from \"Special Report,\" March 20, 2019. This copy may not be in its final form and may be updated. (BEGIN VIDEO CLIP) SEN. JOHNNY ISAKSON, R-GA: It's deplorable what he said. That's what I called it from the floor of the Senate seven months ago. It will be deplorable seven months from now if he says it again, and I will continue to speak out. DONALD TRUMP, PRESIDENT: John McCain received a fake and phony dossier. Did you hear about the dossier? It was paid for by crooked Hillary Clinton, right? (BOOS) TRUMP: And John McCain got it, he got it. And what he do? He didn't call me. He turned it over to the FBI hoping to put me in jeopardy. I gave him the kind of funeral that he wanted, which as president I had to approve. I don't care about this, I didn't get a thank you, that's OK. Not my kind of guy. (END VIDEO CLIP) BRET BAIER, HOST: President Trump today, we were going to start with U.S. manufacturing jobs in the Midwest, and we will get to that, but the president in prepared remarks in a speech today brought up and doubled down on comments he made over the weekend about the late Senator John McCain seven months after his passing, prompting a response, as you heard there, and more of one, from Republican Senator John Isakson from Georgia, who is a Trump policy supporter, also a friend of the late Senator John McCain. Having just returned from Hanoi, Vietnam, I spent some time in the Hanoi Hilton where John McCain spent five years as a prisoner of war. I went into those cells. I saw the places where he was held. Senator McCain, will stipulate on this show right now, spent his life serving the U.S. and was an American hero, period, the end. We'll start there with this panel. Let's bring in our panel, Donna Brazile, former chairwoman of the Democratic National Committee, \"Washington Post\" columnist Marc Thiessen, and Susan Ferrechio, chief congressional correspondent for \"The Washington Examiner.\" OK, Susan, the president, it has gotten under his skin, and he is going back to it. He explained it a little bit more in the prepared remarks today. What about this? SUSAN FERRECHIO, CHIEF CONGRESSIONAL CORRESPONDENT, \"WASHINGTON EXAMINER\": It's a big backstory there. He and McCain have not liked each other for a long time. McCain was an early critic of Trump when he was running for president, and Trump always would swing back at McCain, and the whole thing escalated. And of course, there's the Steele dossier that Trump believes is behind the Mueller reports that he thinks is hobbling his presidency. Now, McCain did go retrieve through David Kramer, his aide, the dossier, brought it back to America, gave it to James Comey. And David Kramer, his aide, shopped it around to the press. And that's how it got leaked out to the press. It's not verified, it's salacious. The president is very angry at McCain over this. The reason he started tweeting about this over the weekend, which is where all this started, and then the press asked about it today during the pool spray, it came up over the weekend because of a deposition that was unveiled where we learned more details about how McCain was involved in the dossier, and that clearly got under Trump's skin. And he is not over it yet, clearly. BAIER: Clearly. They built that into that speech, Donna. Somebody is advising that, right? What is the thought process? DONNA BRAZILE, DEMOCRATIC STRATEGIST: I don't know. Since 2015, the president has just been on this tirade against John McCain. When I was little girl growing up in Louisiana, I don't know about you, Bret, but my parents said you don't talk ill of the dead, because the Bible says the living will die at some point. John McCain leaves a legacy, a legacy of service. He leaves a legacy of sacrifice. More importantly, Donald Trump used this location at a military construction site, a union site, but he goes there and criticized the one guy in the United States Senate who fought for these types of tanks. So it's an odd thing to do. And as I said last night on Twitter, because I get to Twitter myself, I said to Cindy McCain and Meghan and the family, I said, you know what, ignore this. You're better than this, we are better than this. John McCain should be honored for his service, but the criticism, that's beneath the office of the president. BAIER: Meghan McCain address that today on \"The View.\" (BEGIN VIDEO CLIP) MEGHAN MCCAIN, DAUGHTER OF JOHN MCCAIN: I think if I had told my dad seven months after you're dead you're going to be dominating the news and all over Twitter, he would think it was hilarious that our president was so jealous of him that he was dominating the news cycle in death as well. (END VIDEO CLIP) BAIER: Our colleague Brit Hume tweeted out, speaking of Twitter, \"Why the president of the United States gets involved in petty disputes with someone most Americans have never heard of it is beyond me.\" This is talking about Conway, Kellyanne Conway's husband, George. \"The same goes for his continuing feud with the late John McCain. Why bother?\" Marc? MARC THIESSEN, AMERICAN ENTERPRISE INSTITUTE: So I get why Donald Trump doesn't like John McCain, and he has some legitimate grievances against John McCain, but he isn't hurting John McCain. John McCain is dead. He's hurting himself. He presumably went to Ohio today because he had a message to deliver about the manufacturing boom in this country that he has unleashed. BAIER: Which is a good message. THIESSEN: And it's a great story. You said at the outset of this segment we were going to talk about that. BAIER: And we are. THIESSEN: And we are. But he changed the subject. And he did it by showing a total lack of decency. And so what he's doing is, one, he's stepping on his own story. And two, there are millions of people in this country who are benefiting from the Trump economy, who have jobs and opportunity and better lives because of this. And they like Trump's policies but they don't like him because of things like this. So the reason he's in the low 40s in his approval instead of above 50 is because persuadable voters look at this and they say I don't want to support a guy who goes after a dead war hero. BAIER: Minus this, or minus some of these tweets, minus some of this counterpunching, would his approval be above 50? FERRECHIO: I think you make a really great point. It's the rhetoric that turns off the people who are either on the edge, they like what he does policy-wise but they hate him personally, and that makes him look at other candidates, and they go, I'll just vote for a Democrat, or I won't show up and vote. And that is his problem, really. They don't understand why he doesn't like McCain, because the backstory is complicated. He tried to explain it a little bit today. BAIER: You explained it well there. FERRECHIO: It's hard to explain, and it goes back years. And McCain started it. And he is a hero obviously, everyone loved him. BAIER: I stipulated that at the beginning. FERRECHIO: So the two of them escalated it. And that's what in the backstory is so complicated. The public doesn't get it. They just see him attacking a war hero and they are like, here he goes again. And it's not good. BAIER: To Twitter, just before we started the show. \"Great News form Ford. They are investing $1 billion in Flat Rock, Michigan for auto production on top of $1 billion investment last month in a facility outside of Chicago. Companies are pouring back into the United States -- they want to be where the action is.\" U.S. manufacturing jobs during the Trump administration, Donna, are up significantly. Manufacturing jobs are up, and there is an optimism that he talked about that, again, largely got squelched by the John McCain comments newsworthy-wise, but this is a story to tell from the Trump administration. BRAZILE: Look, I still believe he's building on the success of Barack Obama, OK? BAIER: All right, but those numbers start 117. BRAZILE: But remember where we started back in 2009 after the great recession of 2008. He's building. But this president has now just stepped on his message. He has to worry about his tax policies. What's driving some of these jobs overseas? What's creating the conditions in places like Lordstown where G.M. is thinking about closing its plant. The union leader has been reaching out to the president, not the president of the union, the union leader, the local leader has been saying Mr. President, help us, help us. He campaigned on a promise to save American jobs. They now need him to save American jobs in Lordstown, Ohio. BAIER: There is a positive economic feeling, though. If you look at the numbers and you hear some of these states. And frankly, that hope was why he won some of these states like Michigan, Wisconsin, Pennsylvania. Marc, last word on this. THIESSEN: He's delivering for the forgotten Americans who put him in office. Look, manufacturing jobs have been rising for 18 straight months, 490,000 manufacturing jobs created under Donald Trump since he came to office. Obama said those jobs were never coming back. They are growing at the fastest pace in 24 years. And the unemployment rate for people without a high school education reached the lowest point in history, and their salaries are going up by six percent, which is outpacing the rest of the economy. That is a great story. I wish that he would talk about that and not step on his story so more Americans would know about it. BAIER: We got to see it here. We just had to cover it all. (LAUGHTER) THIESSEN: Next up, the 2020 roundup, as one campaign unionize is, others try to catch at least some of the Beto press coverage. (COMMERCIAL BREAK) (BEGIN VIDEO CLIP) SEN. BERNIE SANDERS, I-VT, D-PRESIDENTIAL CANDIDATE: By the way, we are going to make it easier for workers to join in unions, not harder. (APPLAUSE) FAIZ SHAKIR, SANDERS 2020 CAMPAIGN MANAGER: I don't believe we took any of these actions out of belief that it would win votes. We did it because we thought it was important to live our values. SEN. ELIZABETH WARREN, D-MASS., PRESIDENTIAL CANDIDATE: We need for employees to have more power. BETO O'ROURKE, D-PRESIDENTIAL CANDIDATE: If those who work on this campaign and who comprise what I hope will be the largest grassroots effort this nation has ever seen want to unionize, I support that. JULIAN CASTRO, D-PRESIDENTIAL CANDIDATE: If the time comes, when the time comes that our staff says they're going to do that, I support that. We have a strong policy against sexual harassment. (END VIDEO CLIP) BAIER: Unionizing campaign staff, Bernie Sanders has done it, other campaigns are saying they may do it. Meantime, Beto O'Rourke is going to every county in New Hampshire. We're back with the panel. Donna, you were on campaigns. What happens if they go on strike? BRAZILE: That would be a bad thing. I am supportive of unionized workers. I am a member of two unions, SEIU and SAG-AFTRA. I believe in the right to organize and collective bargaining. As you well know, some of us who have been on campaign, you work long hours and you get no benefits. You work long hours, and at the end of the day, if your candidate loses, you lose. So this is a great idea and I hope the campaigns adopt it. BAIER: Marc, Bernie Sanders is getting a lot of attention. He's getting a lot of support. He is raising almost as much money as Beto O'Rourke. Do you think Donna and her friends are worried sick that Bernie Sanders is going to run away with this? THIESSEN: I think Bernie Sanders is going to be the Democratic nominee. He's got an army of people from the last campaign, most of whom think if it hadn't been for the superdelegates, no offense, he would've been the nominee and that he would've won, because it was Bernie voters in those key swing states in Middle America that tipped to Donald Trump. BRAZILE: You forget that Hillary got 4 million more voters, and there are less than 800 superdelegates. THIESSEN: OK, I'm not attacking superdelegates, I'm just making the point -- BRAZILE: No. I know you love us. THIESSEN: Absolutely. But he's the guy. He's the guy who they think should have been the nominee, and he's got an army of supporters. He's raised $6 million in the first day. The interesting thing is that Beto is challenging him for the soul of the far left of the Democratic Party. BAIER: On this day when the president made a lot of other news on other things, talking about things, he did tweet out this. \"The Democrats are getting very strange. They now want to change the voting age to 16, abolish the Electoral College, and increase significantly the number of Supreme Court justices. Actually, you've got to win at the ballot box!\" In addition to his pitch about fighting socialism, he's right about this. This is being talked about on the trail. FERRECHIO: Absolutely. The Green New Deal, Medicare for all, free college, reparations, stacking the Supreme Court with more justices, all these things that were unheard of in the past election to be talked about are now all being endorsed by the candidates. And I think, while that may translate well in the primary season, because they are basically all getting on board now because if you don't you may not be approved by the primary voting system -- it doesn't translate as well into the general election. The risk for Democrats in being too extreme in the primary season. That's the case in any general election. You have to worry about how you act and what you say during the primaries. But this stuff is so far to the left I don't know how they pivot back for the general election without just alienating so many people in the general election. BAIER: Can you explain, Donna, the Beto phenomenon? BRAZILE: No. BAIER: Can you explain the press coverage? Can you explain? BRAZILE: I couldn't explain the press coverage of Barack Obama or the press coverage of Donald Trump. The media likes these characters, these personalities. But I can tell you what Beto is bringing to the table, and you see it with Kamala and Cory and all of the other candidates. They are bringing fresh ideas. Fourteen states and the District of Columbia allow young people, 16-years-olds, to pre-register, California allows 17-year- olds, 200,000 people. These are not out of the mainstream. These are issues that the American people are talking about. So I cannot explain Beto, but I have to tell you something, Bret. With a name like yours, we have Bernie, Beto, Biden. Bret, come on in. Come on. The water is warm. (LAUGHTER) BAIER: I'll just cover it. I'll just cover it, how about it. Marc, there's not a lot of substance in that policy that they're talking about. THIESSEN: I was shocked when you said that Beto is bringing ideas. This is the \"Seinfeld\" of candidacies. If \"Seinfeld\" was a show about nothing, he's a campaign about nothing. \"The Washington Post\" literally reported that he is going around and asking voters to shape him into the presidential candidate they want him to be and help them come up with a vision. Most people run for president because they have a vision for the country. Bernie Sanders and Elizabeth Warren, I don't think their ideas are very good, I think they are dangerous, but give them credit. They have been thinking for years about what they want to do if they get their hands on the levers of power in the Oval Office. Beto is asking us to shape them into a candidate because it's all about cult of personality. BAIER: I've got to run. FERRECHIO: What could be more populist, though, than letting the voters decide what your platform is? (LAUGHTER) BAIER: That'll be something. Panel, thank you. Donna, good to have you. When we come back, a good boy and a sweet shot. (COMMERCIAL BREAK) BAIER: Finally tonight, sometimes we just play some cool video. A sweet welcome home for man's best friend. Nick is the owner of a golden retriever in Richmond, Virginia, and we just like this shot. He shared a video of his dog Riley jumping into his arms before he could even walk in the door, and that's just cool. Nice vertical leap. On a separate note, congrats to former President George W. Bush who had his first hole in one today, playing Trinity Forest Golf Club in Dallas. He says he hopes to live to be 100 so he can shoot his age. He plays fast, so that was a fast hole in one, I guarantee you. Thanks for inviting us into your home tonight. That's it for the “Special Report.” Fair, balanced and still unafraid. \"The Story\" guest-hosted by my friend, Ed Henry starts right now. Content and Programming Copyright 2019 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2019 ASC Services II Media, LLC. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of ASC Services II Media, LLC. You may not alter or remove any trademark, copyright or other notice from copies of the content.",
      "date": "March 20",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "John McCain dead at 81",
      "url": "https://www.foxnews.com/politics/john-mccain-dead-at-81",
      "subtitle": "John McCain dead at 81",
      "author": "Alex Pappas",
      "content": " U.S. Sen. John McCain, a war hero who survived five years as a prisoner of war in Vietnam, served three decades in Congress and went on to become the Republican Party’s nominee for president in 2008, died Saturday. He was 81 years old. In his last hours, the Arizona Republican turned down further medical treatment, his family announced in a statement. McCain was diagnosed with brain cancer in July 2017. Doctors discovered the tumor during a medical procedure to remove a blood clot from above his left eye. He remained upbeat after the diagnosis, flying back to Washington days after surgery with a large scar visible above his eye to partake in the Senate’s health care debate. “I greatly appreciate the outpouring of support - unfortunately for my sparring partners in Congress, I'll be back soon, so stand-by!” McCain tweeted on July 20 after his diagnosis. On Friday, his family issued a statement saying,“Last summer, Senator John McCain shared with Americans the news our family already knew: he had been diagnosed with an aggressive glioblastoma, and the prognosis was serious. In the year since, John has surpassed expectations for his survival. But the progress of disease and the inexorable advance of age render their verdict.\" They added, \"With his usual strength of will, he has now chosen to discontinue medical treatment.\" McCain's wife, Cindy, tweeted that her \"heart is broken\" following her husband's death. \"I am so lucky to have lived the adventure of loving this incredible man for 38 years,\" she said. \"He passed the way he lived, on his own terms, surrounded by the people he loved, in the the place he loved best.\" The senator's daughter, Meghan, posted a heartfelt note online, in which she said the \"task of [her] lifetime is to live up to [McCain's] example, his expectations, and his love.\" \"My father is gone, and I miss him as only an adoring daughter can,\" she wrote. \"He was a great fire who burned bright, and we lives in his light and warmth for so very long. We know that his flame lives on, in each of us. The days and years to come will not be the same without my dad — but they will be good days, filled with life and love, because of the example he lived for us.\" McCain was born in 1936 in the Panama Canal Zone, where his father was stationed in the Navy. After graduating from the Naval Academy in 1958, McCain went to Vietnam. In 1967, his A4 Skyhawk was hit by a surface-to-air missile over Hanoi. McCain was captured by the North Vietnamese, who tortured and beat him for more than five years. He was in solitary confinement for several of those years. “My room was fairly decent-sized - I’d say about 10 by 10,” McCain would later write. “The door was solid. There were no windows. The only ventilation came from two small holes at the top in the ceiling, about 6 inches by 4 inches. The roof was tin, and it got hot as hell in there.” His captors offered him early release after learning his father was a notable naval officer. But McCain refused to leave before the other prisoners. He was released in 1973. McCain’s injuries from his imprisonment were visible the rest of his life, most noticeably the restricted movement of his arms. McCain got a taste of politics in 1976, when he served as the Navy’s liaison to the Senate. In 1982, McCain was elected to the House of Representatives. Only a few years later, in 1986, he won the race to replace Arizona’s conservative Sen. Barry Goldwater. He was implicated in what became known as the Keating Five Scandal in 1989, accused with several other lawmakers of helping the owner of the Lincoln Savings and Loan, who had donated to his campaign. McCain ran twice for president. In 2000, he ran for the Republican nomination for president, winning New Hampshire’s primary but losing the nomination to George W. Bush. In 2008, he defeated a host of Republican candidates to win the GOP nomination for president. He was responsible for introducing then-Alaska Gov. Sarah Palin to a national audience by tapping her as his running mate. The McCain-Palin ticket went on to lose the general election to Barack Obama, who became the country’s first black president. For years, McCain declined to call his choice of Palin a mistake. But in his upcoming book, “The Restless Wave,” McCain reportedly writes that he regrets not choosing his friend, then-U.S. Sen. Joseph Lieberman, D-Conn., as his running mate, calling it “another mistake that I made.” Lieberman, the 2000 Democratic nominee for vice president, was an independent who caucused with Democrats. After the 2008 loss, McCain returned to the Senate, embracing his role as chairman of the Senate Armed Services Committee. During his last years in politics, he had a complicated relationship with President Trump, who infamously attacked McCain during the GOP primary. In May, the McCain family was offended when it was reported that Trump aide Kelly Sadler dismissed McCain's opposition to the president’s choice for CIA director by quipping during a private meeting, \"It doesn't matter, he's dying anyway.\" According to the New York Times, McCain has made clear to the White House he doesn’t want Trump to attend his funeral, and would instead prefer Vice President Mike Pence at a service. McCain is survived by his wife Cindy, seven children and five grandchildren.",
      "date": "August 25, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Farewell statement from John McCain",
      "url": "https://www.foxnews.com/politics/farewell-statement-from-john-mccain",
      "subtitle": "Farewell statement from John McCain",
      "author": "",
      "content": "The following farewell statement from the late Sen. John McCain was read aloud Monday at a press conference in Phoenix, by his former campaign manager Rick Davis: “My fellow Americans, whom I have gratefully served for sixty years, and especially my fellow Arizonans, “Thank you for the privilege of serving you and for the rewarding life that service in uniform and in public office has allowed me to lead. I have tried to serve our country honorably. I have made mistakes, but I hope my love for America will be weighed favorably against them. “I have often observed that I am the luckiest person on earth. I feel that way even now as I prepare for the end of my life. I have loved my life, all of it. I have had experiences, adventures and friendships enough for ten satisfying lives, and I am so thankful. Like most people, I have regrets. But I would not trade a day of my life, in good or bad times, for the best day of anyone else’s. “I owe that satisfaction to the love of my family. No man ever had a more loving wife or children he was prouder of than I am of mine. And I owe it to America. To be connected to America’s causes – liberty, equal justice, respect for the dignity of all people – brings happiness more sublime than life’s fleeting pleasures. Our identities and sense of worth are not circumscribed but enlarged by serving good causes bigger than ourselves. “‘Fellow Americans’ – that association has meant more to me than any other. I lived and died a proud American. We are citizens of the world’s greatest republic, a nation of ideals, not blood and soil. We are blessed and are a blessing to humanity when we uphold and advance those ideals at home and in the world. We have helped liberate more people from tyranny and poverty than ever before in history. We have acquired great wealth and power in the process. “We weaken our greatness when we confuse our patriotism with tribal rivalries that have sown resentment and hatred and violence in all the corners of the globe. We weaken it when we hide behind walls, rather than tear them down, when we doubt the power of our ideals, rather than trust them to be the great force for change they have always been. “We are three-hundred-and-twenty-five million opinionated, vociferous individuals. We argue and compete and sometimes even vilify each other in our raucous public debates. But we have always had so much more in common with each other than in disagreement. If only we remember that and give each other the benefit of the presumption that we all love our country we will get through these challenging times. We will come through them stronger than before. We always do. “Ten years ago, I had the privilege to concede defeat in the election for president. I want to end my farewell to you with the heartfelt faith in Americans that I felt so powerfully that evening. I feel it powerfully still. “Do not despair of our present difficulties but believe always in the promise and greatness of America, because nothing is inevitable here. Americans never quit. We never surrender. We never hide from history. We make history. “Farewell, fellow Americans. God bless you, and God bless America.”",
      "date": "August 27, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Meghan McCain defends Christmas message to late father John McCain",
      "url": "https://www.foxnews.com/entertainment/meghan-mccain-defends-christmas-message-to-late-father-john-mccain",
      "subtitle": "Meghan McCain defends Christmas message to late father John McCain",
      "author": "Jessica Sager",
      "content": " Meghan McCain didn't take critics of her Christmas tribute to her late father, Sen. John McCain, lying down. On Christmas Eve night, Meghan, 34, tweeted a sweet photo of John, who passed away at 81 in August. \"I love you,\" she wrote. \"Merry Christmas, Dad, @SenJohnMcCain — wherever you are.\" CLICK HERE TO GET THE FOX NEWS APP She then retweeted a troll who wrote \"do this in private.\" \"If there’s one thing I’m doing in 2019 it’s to continue to destigmatize talking about grief, death and cancer,\" Meghan snapped back. \"My father shared his life in public, I share it in death. To all of you out there missing a loved one tonight - you are not alone. I’m along side you, sending strength.\" Meghan has regularly honored her father since his death. In November, \"The View\" co-host posted a sweet tribute to the Vietnam War vet on Veterans Day, writing, \"Today on #VeteransDay we remember and honor those who have selflessly served and sacrificed. Those who have and continue to fight to protect our freedoms -I am forever grateful. I miss you so much Dad, thank you for showing me what fighting for something greater than yourself is.\" She also honored him in October, as well as speaking at his funeral in August.",
      "date": "December 26",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Meghan McCain marks one-year anniversary of father John McCain's death",
      "url": "https://www.foxnews.com/entertainment/meghan-mccain-john-mccain-death-anniversary",
      "subtitle": "Meghan McCain marks one-year anniversary of father John McCain's death",
      "author": "Jessica Sager",
      "content": " Meghan McCain marked one year since the death of her beloved father, Sen. John McCain (R-Ariz.) in August 2018. ‪\"Last year tomorrow, August 25th was the worst day of my life. I lost my hero,\" \"The View\" co-host tweeted with a photo of her and her father's hands. \"I miss my father every single day, I will for the rest of my life. Grief is omnipresent and relentless. For every single person who has sent prayers, love & support to my family, we are truly grateful.\" Meghan, 34, then announced she would be off social media for the next several days. MEGHAN MCCAIN SAYS DONALD TRUMP WILL NEVER BE A 'GREAT MAN' LIKE HER FATHER \"On this anniversary until his birthday after the 29th I am going to take a break from social media for reflection,\" she wrote. \"The memory of my father's life continues to guide me today, as it always will. Remember to cherish your loved ones and be grateful for every moment you have with them. I still can’t believe my heart didn’t stop when yours did Dad...\" MEGHAN MCCAIN SLAMS DONALD TRUMP IN EMOTIONAL MONOLOGUE ON 'THE VIEW' MEGHAN MCCAIN SAYS HER LATE FATHER WOULD LAUGH AT DONALD TRUMP'S JEALOUSY OF HIM In April, Meghan revealed she hadn't been home to Arizona since her father's death, captioning an Instagram video, “241 days. I made you teach Ben how to grill your dry ribs because I knew at some point you wouldn’t be able to. I miss you every. single. day. I still can’t go back home to Arizona.” Sen. John McCain died in August 2018 after stopping treatment for brain cancer. CLICK HERE TO GET THE FOX NEWS APP The 2008 Republican presidential nominee was 81.",
      "date": "August 25",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Meghan McCain praises UK protesters' attempt to troll Trump with giant 'USS John McCain' stunt",
      "url": "https://www.foxnews.com/entertainment/meghan-mccain-trump-trolled-london-view",
      "subtitle": "Meghan McCain praises UK protesters' attempt to troll Trump with giant 'USS John McCain' stunt",
      "author": "Sam Dorman",
      "content": " \"The View\" host Meghan McCain and her mother Cindy both appreciated British protesters' attempts to bother President Trump by projecting an image of a massive red hat that bore the name of the U.S.S. John S. McCain -- a subject of tension between McCain and the president. \"I found it very entertaining the way that British people troll and they do it so much better than we do,\" she said before introducing the sign. When \"The View\" showed the image, McCain said she \"love[d] this so much.\" Noting that she and her mother both laughed at the prank, she thanked the group behind the act. \"I just thought it was such a brilliant troll,\" she also said. The group put up the projection while Trump visited officials in the United Kingdom. It was an apparent reference to a request to \"minimize\" the U.S.S. McCain from view during a recent diplomatic visit to Japan. TRUMP, DEFENSE BOSS SHANAHAN BOTH DENY LINK TO USS JOHN S. MCCAIN 'OUT OF SIGHT' DIRECTIVE GROUP TROLLS TRUMP DURING UK VISIT BY PROJECTING OBAMA APPROVAL RATINGS, U.S.S. JOHN McCAIN HAT ON LANDMARKS McCain condemned Trump when news of the request broke, calling him a \"child\" and claiming that he would never be as great of a man as her father. Trump has repeatedly denied any knowledge of the request. The group also attempted to troll the president with billboards showing critical tweets from Sen. Ted Cruz, R-Texas, as well as photos comparing Trump's inauguration crowd size to former President Barack Obama's. CLICK HERE TO GET THE FOX NEWS APP \"Hey @realDonaldTrump. Having a nice time in London? Seeing the sites?\" the group tweeted. \"Hope you managed to swing by Trafalgar Square to see your very LOW ENERGY inauguration turnout projected onto the National Gallery.\"",
      "date": "June 5",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "McCain has sharp response to Trump's John McCain dossier tweet",
      "url": "https://www.foxnews.com/politics/mccain-has-sharp-response-to-trumps-john-mccain-dossier-tweet",
      "subtitle": "McCain has sharp response to Trump's John McCain dossier tweet",
      "author": "Paulina Dedaj",
      "content": " Meghan McCain had a sharp response for President Trump on Saturday after he posted an unflattering tweet about her late father, saying that late Sen. John McCain had “far worse ‘stains’” against him than reports that he'd helped share the infamous Russia dossier. Quoting former Independent Counsel Ken Starr, the president got the ball rolling when he tweeted about new reports involving Senator McCain. Those reports said that the senator and an associate had shared with the FBI and various media outlets the unverified dossier alleging that Moscow held compromising information on Trump. COURT FILES REVEAL ROLE OF MCCAIN, ASSOCIATE IN SPREADING ANTI-TRUMP DOSSIER “Spreading the fake and totally discredited Dossier ‘is unfortunately a very dark stain against John McCain.’ Ken Starr, Former Independent Counsel,” Trump wrote. “He had far worse ‘stains’ than this, including thumbs down on repeal and replace [of the Obama-era Affordable Care Act] after years of campaigning to repeal and replace!” Meghan McCain, bristling at the remark, fired back with her own Twitter post, in which she said that “no one will ever love you the way they loved my father.” MEGHAN MCCAIN DECRIES TRUMP’S INFLUENCE ON REPUBLICAN PARTY, PREFERS TO CALL HERSELF A CONSERVATIVE She continued: “I wish I had been given more Saturday’s with him. Maybe spend yours with your family instead of on twitter obsessing over mine?” In a newly unsealed declaration from September, former senior counterintelligence FBI agent Bill Priestap confirmed that the FBI received a copy of the first 33 pages of the dossier in December 2016 from Senator McCain. McCain had denied being the source for BuzzFeed after it published the dossier, but acknowledged giving it to the FBI. CLICK HERE TO GET THE FOX NEWS APP The filings were unsealed as part of an ongoing libel case against BuzzFeed by a Russian businessman.",
      "date": "March 16",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Meghan McCain posts emotional birthday tribute to late father John McCain",
      "url": "https://www.foxnews.com/entertainment/meghan-mccain-birthday-father-john-mccain",
      "subtitle": "Meghan McCain posts emotional birthday tribute to late father John McCain",
      "author": "",
      "content": "Meghan McCain shared a birthday wish to her late father, Sen. John McCain, on what would have been his 83rd birthday. Meghan McCain and her father John in 2013.FilmMagic “Happy birthday Dad. I love you,” the 34-year-old captioned a photo Thursday of her in front of her father’s grave at the United States Naval Academy Cemetery. Just a few days ago, the “View” co-host commemorated the first anniversary of his August 25, 2018 death. Calling the day he died “the worst day of my life,” Meghan wrote: “I lost my hero. I miss my father every single day, I will for the rest of my life. Grief is omnipresent and relentless … Remember to cherish your loved ones and be grateful for every moment you have with them. I still can’t believe my heart didn’t stop when yours did Dad…” MEGHAN MCCAIN SAYS DONALD TRUMP WILL NEVER BE A 'GREAT MAN' LIKE HER FATHER Along with Meghan, John was also father to John Sidney McCain IV, Bridget McCain, James McCain, and Sidney McCain. Meghan married Ben Domenech before her father’s health took a tragic turn. John’s wife, Cindy McCain, also took to Instagram on the anniversary of his passing with a heartfelt message. MEGHAN MCCAIN SAYS HER LATE FATHER WOULD LAUGH AT DONALD TRUMP'S JEALOUSY OF HIM “I simply can’t believe it has been a year. I miss his voice of reason, his indomitable spirit and his humor,” she wrote. “Most of all I miss my husband and partner of 38 years. He is forever in my heart.” Cindy also penned an emotional essay published in People magazine. This story originally appeared in the New York Post.",
      "date": "August 29",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    }
  ]
}