{
  "articles": [
    {
      "title": "Sarah Palin blasts Sacha Baron Cohen, says she was fooled into doing interview",
      "url": "https://www.foxnews.com/entertainment/sarah-palin-blasts-sacha-baron-cohen-says-she-was-fooled-into-doing-interview",
      "subtitle": "Sarah Palin blasts Sacha Baron Cohen, says she was fooled into doing interview",
      "author": "Elizabeth Zwirz",
      "content": " Sarah Palin slammed Sacha Baron Cohen on Tuesday, claiming she had been “duped” into doing a sit-down interview and was among others in the public eye who had “fallen victim” to his “evil, exploitive, sick ‘humor.’” “Yup - we were duped,” Palin wrote on her Facebook page. “Ya’ got me, Sacha. Feel better now?” Cohen, CBS and Showtime drew the ire of the former Alaska governor a day after Showtime issued a press release announcing the \"Borat\" actor’s new satirical series titled, “Who is America?” In her Facebook post, Palin wrote that she had been approached to participate in a “’legit opportunity’ to honor American Vets.” NEW SACHA BARON COHEN SERIES A HOLLYWOOD HIT JOB ON GOP, SOURCE SAYS “For my interview, my daughter and I were asked to travel across the country where Cohen (I presume) had heavily disguised himself as a disabled US Veteran, fake wheelchair and all,” Palin wrote. She said she stayed for the interview “out of respect for what I was led to believe would be a thoughtful discussion with someone who had served in uniform.” She ultimately left, however, after claiming to have experienced “a long ‘interview’ full of Hollywoodism’s disrespect and sarcasm.” Dubbing Cohen “shallow Sacha boy,” she dared him to “go ahead” and “air the footage,” before issuing a “challenge” that he and the networks donate the series’ earnings to a veterans charity. SACHA BARON COHEN TAKES AIM AT DONALD TRUMP IN NEW 4TH OF JULY PROJECT TEASER “Mock politicians and innocent public personalities all you want, if that lets you sleep at night, but HOW DARE YOU mock those who have fought and served our country,” she said. “Truly sick.” A representative for Cohen, as well as CBS, did not immediately respond to Fox News’ request for comment. Showtime told Fox News that they had no comment. In her Facebook post, the 2008 GOP vice presidential nominee alleged that the team behind the “fake interview” intentionally derailed her and her daughter’s efforts to return to Alaska by bringing them to “the wrong Washington, DC airport.” “By the way, my daughter thinks you’re a piece of ****, Sacha,” Palin wrote in closing. \"Every honorable American Vet should feel the same.”",
      "date": "July 11, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Appeals court gives new life to Sarah Palin's defamation lawsuit against New York Times",
      "url": "https://www.foxnews.com/politics/appeals-court-gives-new-life-to-sarah-palins-defamation-lawsuit-against-ny-times",
      "subtitle": "Appeals court gives new life to Sarah Palin's defamation lawsuit against New York Times",
      "author": "Ronn Blitzer",
      "content": " Sarah Palin’s defamation lawsuit against The New York Times over an editorial that linked her political action committee to the shooting of former Rep. Gabrielle Giffords, D-Ariz., has been revived, after a lower court judge previously had dismissed it. The Second Circuit Court of Appeals ruled on Tuesday that Judge Jed Rakoff of the Southern District of New York strayed from procedural norms before tossing out Palin’s libel complaint in August 2017. Rakoff held a hearing to learn more facts about the case before ruling on the Times’ motion to dismiss, when such decisions typically rely solely on what is alleged in court documents. PALIN SUIT AGAINST NY TIMES SPOTLIGHTS A FLOOD OF MEDIA MISTAKES “We find that the district court erred in relying on facts outside the pleadings to dismiss the complaint,” Second Circuit Judge John M. Walker Jr. wrote. The former vice presidential candidate sued the Times for libel after a June 2017 editorial about the shooting of GOP Rep. Steve Scalise and others mentioned a map put out years earlier by SarahPAC that had crosshairs over different Democratic congressional districts. While the map had been used in reference to ObamaCare, the editorial connected it to Jared Loughner’s 2011 shooting of Giffords, whose district was among the ones identified in the map. The editorial said that the SarahPAC map had Giffords and other Democrats under crosshairs (though the targets were over their districts). In discussing the Scalise shooting, the Times said, “Though there’s no sign of incitement as direct as in the Giffords attack, liberals should of course hold themselves to the same standard of decency that they ask of the right.” “No evidence ever emerged to establish that link; in fact, the criminal investigation of Loughner indicated that his animosity toward Representative Giffords had arisen before SarahPAC published the map,” Walker noted Tuesday. The Times published a correction after receiving backlash for the editorial, noting that there was no link between the map and the shooting. Rakoff had originally held the hearing in question in order to learn whether there was enough support for Palin’s claim that the editorial was published with “actual malice” – knowledge that a statement is false or reckless disregard for whether it is true – which is the standard for public figures to bring defamation claims. GREGG JARRETT: SARAH PALIN VS. THE NEW YORK TIMES -- FIVE REASONS WHY EX-GOVERNOR MIGHT JUST WIN HER CASE Rakoff brought in the author of the editorial, James Bennet, who answered questions about his knowledge that the Times had previously published articles that said there was no link between the map and the shooting. Bennet said he was unaware at the time he wrote the editorial. The information Rakoff learned from the hearing was enough for him to dismiss Palin’s claim with prejudice, meaning she was not permitted to file an amended complaint. The Second Circuit ruled that this was improper as it ran “headlong” into the Federal Rules of Civil Procedure. CLICK HERE TO GET THE FOX NEWS APP A Times spokesperson told The Associated Press that the newspaper is disappointed and will vigorously fight the lawsuit. The Second Circuit sent the case back down to the Southern District of New York, ordering it to move forward with discovery. The Associated Press contributed to this report.",
      "date": "August 6",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Bristol and Sarah Palin get candid in first 'Teen Mom OG' teaser",
      "url": "https://www.foxnews.com/entertainment/bristol-and-sarah-palin-get-candid-in-first-teen-mom-og-teaser",
      "subtitle": "Bristol and Sarah Palin get candid in first 'Teen Mom OG' teaser",
      "author": "Tyler McCarthy",
      "content": " Bristol Palin is getting candid with her mom, Sarah Palin, in the first teaser for Season 8 of MTV’s “Teen Mom OG.” The network tweeted the first promo for the upcoming show during the 2018 Video Music Awards. In it, Bristol tells the former Alaska Governor that her life isn’t quite what she hoped it would be. “I was a teen mom,” she says in the brief teaser below. “My life is not perfect at all.” “Amen,” he mom responded. In another moment from the teaser, Bristol says, “I want to do what’s best for my kids.” As previously reported, Bristol confirmed that she would be taking part in the reality series in late July 2018 on social media. \"I am excited to join MTV's 'Teen Mom OG,'\" the 27-year-old captioned a picture of herself along with her three kids—daughters, Sailor Grace, 2, Atlee Bay, 14 months and 9-year-old son, Tripp—standing in front of a camera crew. \"I look forward to sharing my experiences and hope that I can help others on their journey,\" she continued. The series, which is a spinoff of the show “16 & Pregnant” follows moms who have previously been on the show as they live their daily lives and try to raise their children. Palin first starred on her mother's TLC series \"Sarah Palin's Alaska\" in 2010, followed by her 2012 Lifetime show \"Bristol Palin: Life's a Tripp.\" She was also on Seasons 11 and 15 of \"Dancing with the Stars.\" It sounds like the new season won’t be without its drama as Palin recently confirmed that she’s divorcing her ex, Dakota Meyer.",
      "date": "August 21, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin: Billy Graham understood God is the only answer",
      "url": "https://www.foxnews.com/transcript/sarah-palin-billy-graham-understood-god-is-the-only-answer",
      "subtitle": "Sarah Palin: Billy Graham understood God is the only answer",
      "author": "",
      "content": "This is a rush transcript from \"The Story with Martha MacCallum,\" February 21, 2018. This copy may not be in its final form and may be updated. (BEGIN VIDEO CLIP) BILLY GRAHAM, REVEREND: There are problems of sin and habit that cannot be solved outside the person of our Lord, Jesus Christ. (END VIDEO CLIP) MARTHA MACCALLUM, FOX NEWS CHANNEL HOST: Good evening, everybody, I'm Martha MacCallum, and this is THE STORY. In a moment, when the nation is struggling with violence and divisiveness, two important things happened today that make us stop and think about where we are headed as a nation. But first, listening at the White House. (BEGIN VIDEO CLIP) UNIDENTIFIED MALE: Should've been one school shooting, and we should've fixed it. And I'm pissed because my daughter, I'm not going to see again. She's not here. Never, ever will I see my kid. That's how I want it to sink in for eternity. My beautiful daughter, I'm never going to see again. UNIDENTIFIED MALE: I was on the floor in that building texting my mom, texting my dad, texting three of my brothers that I was never going to see them again. And then it occurred to me that my 14-year-old brother was directly above me in that classroom where Scott Beagle was murdered, and now I don't know how I'm never going to set foot in that place again or go to a public park after school or walk in anywhere. Me and my friends, we get scared when a car drives by. I turned 18 the day after I woke up to the news that my best friend was gone, and I don't understand why I can still go in a store and buy a weapon of war. How is it that easy to buy this type of weapon? How did we not stop this after Columbine, after Sandy Hooks, sitting with her mother that lost her son? It's still happening. UNIDENTIFIED MALE: This is my son, Daniel, he was 7-years-old when he was shot to death in his first-grade classroom in Sandy Hook Elementary School, just a little over five years ago. UNIDENTIFIED MALE: I'm only 15 years old, I'm a sophomore. 19 years ago, the first school shooting, Columbine, at Columbine High School happened. And I was born into a world where I never got to experience safety and peace. UNIDENTIFIED MALE: Now, Justine was texting me hiding in closet saying, if something happens, I love you. If something happens, I love you. And you can't imagine what that's like. As a parent, if he's not old enough to by a drink, to go and buy a beer, he should not be able to buy a gun at 18- years-old. I mean, that's just a common sense. We have to do common sense. Please, Mr. Trump. UNIDENTIFIED MALE: I'm not to debate. I lost my sister, and like Mr. President said, if you could find 20 percent of maybe retired law enforcement officers, or teachers you could through to screech training to carry a firearm on this waist, it could have been a very different situation. UNIDENTIFIED FEMALE: Rather than arm with a firearm, I would rather arm them with the knowledge of how to prevent these acts from happening in the first place. And I urge you, please, stay focused on that as well. It is the gun -- it's the person behind the gun, and it's about helping people before they ever reach that point. (END VIDEO CLIP) MACCALLUM: And on the same day when we heard all of that, the death of the -- at the age of 99, of the Reverend, Billy Graham. Four years ago, at 59, Graham expressed his deep concern about what was happening in our country. (BEGIN VIDEO CLIP) GRAHAM: There have been times that I've gone from city to city and seeing how far people have wandered from God. All my heart, I want to be new with the church. (END VIDEO CLIP) MACCALLUM: In an interview that year, he said this: 'We've been going down the wrong road for a long time. Seemingly, man has learned to live without God. He lives in a world dangerously torn by hate, and violence, and conflict, and yet he feels powerless to do anything about them.' Billy Graham preached about love and hope during some of our nation's darkest hours, including the days after September 11th. (BEGIN VIDEO CLIP) GRAHAM: A tragedy like this could have torn our country apart, but instead it has united us. There's hope for the present, because I believe the stage has already been set for a new spirit in our nation. (END VIDEO CLIP) MACCALLUM: And so tonight, as a nation, we take stock with a deeply moving conversation at the White House and a call to action, and we will talk to two people who knew and worked with Reverend Graham and asked: what was he trying to tell us at the end? In moments, Pat Boone, who considers Graham a brother. But first, Former Alaska Governor Sarah Palin, joins us by phone. Governor Palin, good to have you here tonight. Obviously, there's a lot going on in our country, and you hear the debate at the White House and you think about those words about concern for our country from Reverend Graham. SARAH PALIN, FORMER ALASKA GOVERNOR: Well, Reverend Graham always kept his message so simple based on such truths. He consistently reminded us. His emphasis was the need for all of our --transformed in order the peace. He kept that message very simple, knowing that God is the only answer to all the struggles, to all the problems that we, as individual and a nation, faces. And I think that that is why Reverend Graham has been so revered all of these years, because people know deep down that that is true, and he was bold enough to speak it. MACCALLUM: Governor, you know, you listen to the debate in the White House, and you hear both sides of this, and you hear what people think needs to be focused on. These killers, you know, have an impact, they divide us on this topic over and over. You know, what about what these folks are saying about their concerns about how easy it is for some people who shouldn't have guns to get them in this country? PALIN: I absolutely understand their concerns. These parents who have lost their children, I think that there is nothing more horrible or devastating in that than what they're going through. But going back to Billy Graham and the significance even of his passing on a day like this, mean is that reminder, that nothing is going to change, nothing is going to get better regardless of more laws being passed, more politicians' rhetoric viewed across our nation or not, nothing is going to get better until we all realize that we are created for a purpose by God. All life is valuable from the beginning until the end of life. All life is valuable. And unless we give our lives back to God, individually and collectively as a nation, nothing is going to get better. MACCALLUM: You know, I was also struck in reading about Reverend Graham, some of the details that I've forgotten, some that I didn't know about his work. Back in 1973, he got 3.2 million to join his largest-ever crusade, and it was in South Korea. 1.1 million of those who were there that day, walk there on foot. And you juxtapose that, governor, with what's going on now that the power of Graham's message, you know, there were hundred thousand people plus who signed up to be Christians that day. He obviously felt that that mission was going to help to solve some of the conflict that existed in the country. What do you think about that now in terms of what's going on North Korea? PALIN: I think that, yes, Reverend Graham's message did resonate throughout the entire globe, and helped in so many respects. I think that Reverend Graham was very unique in that he had all over him unlike other spiritual leaders. He transcended politics and cultural denominational divides and cultural criticisms. He was able to speak truth and not worry about being politically incorrect. And it seems like he was even kind of buffeted from a lot of the criticism that many Christians face today, and that is due to God's favor, and it allowed him to speak to the masses and have the masses receive his message. You mentioned that it was in the '70s that he saw the unsurpassed members come forth to hear him speak. A lot of people refer to that as the Jesus movement, because it was a revival across the world and in our own nation, and it was much to do with Reverend Graham's message that resonated with so many people who were hurting, they were lost, just like we all are today, needing hope, needing that promise of salvation. He spoke it clearly, and plainly, and truthfully, and people have to received that. MACCALLUM: Governor Palin, thank you very much. Good to have you with us tonight. PALIN: Thank you. MACCALLUM: So, the message that many fears absent in our culture that we're talking about is one that Reverend Graham had been preaching since his earliest days. (BEGIN VIDEO CLIP) GRAHAM: I do not believe that any man, that any man can solve the problems of life without Jesus Christ. I don't know what your religious background, or racial background, or cultural background, it makes no difference. You come and stand quietly here and say, as it were, I give my life to Christ tonight. Jesus did not have white skin like mine, nor did he have black skin like some of you. Jesus belongs to all the people. God, is a god of love. He loves you. And there's one thing I want you to take from this great park when you leave here today, it's this: God loves you. (END VIDEO CLIP) MACCALLUM: Joining me now, Pat Boone, the legendary singer and actor and a friend of reverend Graham since the 1950s. Pat, welcome. Very good to have you here tonight. As you listen to those words from Reverend Graham, you think about your friendship and the time you spent with him over the years, what goes through your mind tonight? PAT BOONE, ACTOR AND FRIEND OF REVEREND GRAHAM: Yes, I sure do, so many thoughts, hard to put them all into expression. Billy and Ruth were friends of my wife, Sheryl and me, for many years -- 40 years at least. And we spent some time together in Hawaii with various functions. We supported the same things. We attended the same things. They day that Saddam Hussein came up out of that spider hole in Iraq, I spent that afternoon, a cold afternoon in the winter at Montreat with Billy, and Ruth, and Franklin, and we -- over lunch, talked about the way the world was going, and Billy had said, and then Ronald Reagan repeated it: the problems this world faces now are beyond human solution. Only divine solutions exist for us now. What they were saying is, a nation founded on the principles of the Bible, and on God himself -- and that was purely the intent of the founders when they created the Constitution, the declaration of independence. Even Thomas Jefferson, the very First Amendment, Congress should make no law respecting an establishment or religion nor restricting the free exercise thereof. All of it based on Bible principle. Now, a nation built that way and growing that way was the most blessed nation in the world, and we seemed to have the answers to all the world's problems. Then, we began to try to be like the rest of the world, and more and more it became unfashionable. Somebody's afraid they were going to be offended, and now the school kids - - imagine this paradox: school kids, where these tragedies took place, have been denied the right to have prayer in the beginning of the school day, and no mention of God, no mention of Jesus, and even in their writings, or their essays, because somebody might be offended. Now, instead of prayer, and drugs -- there's drugs, there's guns, there's violence, there is a connection, and there is a connection between what happened and the listening that people are doing now. And Billy's departure to heaven today, because Billy was trying to tell the world there are answers but they reside with God who created us, and who gave us this country called America. So, I was afraid, as Billy, the last several years, was getting older that the younger generation just might never know who Billy Graham was. And I wrote a song, I called it 'Thank You, Billy Graham' and I did a video of it, and it is very, very moving. It's 'Thank You, Billy Graham.' Many stars, including Bono, and Kenny Rogers, and David Pack of Ambrosia, and Lean Rhymes, on and on, and on joined me -- even Larry King, paying tribute to this man who was speaking the truth, unafraid, never worried about offending anybody else, because it was too important to worry about that. If it's life and death, then you don't worry about offending somebody. And to Billy, it was always about life and death. Now, he has left the building, as they say about Elvis, and this video, and this song, I'm hoping people will take into their homes and get it at Amazon -- it's not a commercial, but it is a tribute to Billy for the kids and the grandkids of the near future. In times of tragedy, we are driven to our knees. I'm going to Israel in May, at the celebration of the 70th anniversary of the modern state. I would love for Billy to go on with me and love everybody else to go, because that's where Billy preached all of his sermons that was on the bible. MACCALLUM: Thank you so much, Pat. Great words of wisdom. We really appreciate you being here. BOONE: I'm sorry I couldn't think of anything to say. (LAUGHTER) BOONE: Thank you, Martha. MACCALLUM: Always good to see you. Thank you so much for here tonight. Pat Boone, pleasure. So, when we come back, we will be joined by this man, Darrell Scott. (BEGIN VIDEO CLIP) DARRELL SCOTT, DAUGHTER KILLED IN COLUMBINE: I went through what some of the folks here are going through now because my beautiful daughter, Rachel, was killed. (COMMERCIAL BREAK) (BEGIN VIDEO CLIP) DONALD TRUMP, PRESIDENT OF THE UNITED STATES: We want to learn everything we can learn, and we're going to go, starting about two minutes after this meeting, we're going to work. This is a long-term situation that we have to solve; we'll solve it together. And you've gone through extraordinary pain, and we don't want others to go through the kind of pain that you've gone through. (END VIDEO CLIP) MACCALLUM: Something important happened at the White House today at that listening session between President Trump and Americans impacted by school shootings. Anybody who is not moved by these people and their anger and their grief does not have a pulse. My next guest was there. He spoke of his daughter, Rachel Scott, the first victim of the Columbine shooting, 19 years ago, and Mr. Scott joins me now. Thank you so much for being here tonight. So, I know it's been a long day and probably a draining day. But I'm curious what it was like for you in that room, and whether or not you left there feeling like this White House is going to take action. SCOTT: Well, thank you, Martha. I want to just say that Dr. Graham was an inspiration in my life, and 19 years ago, I did an interview with him on Larry King on forgiveness. Shortly, after that, I was able to speak to his entire staff, and it was such a privilege to sit in the chair at his desk that he had sat in for so many years. So, the world lost a great man -- MACCALLUM: Very true. Thank you for sharing. SCOTT: Today, in the meeting that we had today -- I really believe that this shooting -- but I think there's something different in the air right now. And the answers are not simple, but the problems aren't simple either; they're very complex. What we do, with Rachel's challenge, our program in honor of my daughter is we go into -- we've been into over 20,000 schools across America over the last 19 years, and we reached between a million and two million students every single year. We've seen seven school shootings prevented and we see an average about of about three suicides prevented every week because of Rachel's story and the trainings, and the service clubs we've created. MACCALLUM: You know, that's remarkable, and I commend you for being able to turn your grief into action the way that you have and your family has. You know, in terms of what you heard in there today, there was a lot of talk of arming people, you know, perhaps retired police officers, members of the military who could serve at schools around the nation to keep us safer, to keep our children safer. There was, you know, talk about work that involves restricting gun ownership. What do you think is the most likely? What did you see on the president's face in there in terms of how you thought he was moving on some of these? SCOTT: I really believe the president wants to do the right thing, and his heart is really in this. I had the privilege of meeting with him before he became president and heard his heart at that time. A lot of people don't get to know the real man behind the face, and I believe that he is going to make some changes and make some positive changes. The changes need to go a lot deeper, in my opinion, than just the gun control issue or metal detector issue, or the physical features around the school. But you know, our whole focus is on the hearts of kids, and we have seen results, we have answers, and we work with some great partners. We work with Chuck Norris and his wife, Gina, have a program called kick-start for kids. We do all their character training, programming -- that program is awesome. We work with Dr. Jim Faye, his son Charles Faye with Love and Logic, with Dr. Robert Morzano, Morzano Research -- a number of organizations. And together, we note some answers if we can just get the right people to listen. MACCALLUM: Thank you, Mr. Scott. It's great to have you with us tonight. And we appreciate your story that we heard today, and all that you're doing to help. Thank you, sir. SCOTT: You're welcome. MACCALLUM: So, joining me now: Chris Stirewalt, Fox News Politics Editor; Katie Pavlich, Townhall.com News Editor; and Syndicated Radio Host, Richard Fowler, both are Fox News Contributors. Welcome to all of you. It's pretty amazing, I thought, this afternoon. I mean, I don't know anybody who was watching that who didn't stop and take all of that in, and there was a wide-range of opinions, Chris, in terms of what the solutions were, and I do give the White House credit for allowing people to come in, who had a lot of different opinions, and to have their piece. CHRIS STIREWALT, FOX NEWS POLITICS EDITOR: The president is obviously going to take some flack for what he talked about, that arming teachers et cetera. But the big victory for the White House -- MACCALLUM: Not from everybody. STIREWALT: He's going to take some, but not everybody. The big victory for the White House in this they took a chance. This could've gone really poorly. This could've gone really poorly. They took a chance, and after a week of trying to play catch-up, they finally got control of the conversation that demonstrated engagement -- which was the thing they needed to do most of all. MACCALLUM: I mean, as you say, they did take a risk. And I thought, you know, maybe this is going to be a very sort of canned conversation. Because obviously, you want to put your arms around it when you're bringing like this to the White House. But, Katie, I felt like there were some very raw, very real moments in there, and people who disagreed with each other, and the president was taking it in. KATIE PAVLICH, FOX NEWS CONTRIBUTOR AND NEWS EDITOR FOR TOWNHALL.COM: Yes. Martha, we have been hearing for a long time that we all need to sit down have a 'real' conversation about these issues, and I think that's exactly what happened today. And whether you agree or disagree with some of the things that were said, I certainly agree with some of the things that were said, I agree with the president when he's arming teachers -- and there's a number of school districts around the country that already doing. I disagree with some of the things that were said, but the stability of the conversation and being able to listen to someone thoroughly make their point without their motives being impugned, without the noise of Twitter, and 140 characters or 240, whatever it is now, without the media aspect of it filtering through some of these opinions. I think it really got us to that point of listening to the ideas, and they won't all be implemented, they won't all pan out in terms of facts and what can actually be done to change things in the future. But hearing from everybody in a calm, respectful, and civil manner, from people who really are the closest to this issue, who are hurting in a way that you can't even imagine. I thought it was really important for the country to see. MACCALLUM: You know, specifically, Richard, on the issue of having an armed guard, there was one armed guard in this school in Florida that had 3200 kids in it. It obviously wasn't enough. But having retired police officers, retired military, spending time on these campuses, people who are -- the same people who are protecting it at airports, and all kinds of other venues, even movie theaters, you know, shopping malls, why can't our kids have the same kind of protection that we have when we go in these other places? RICHARD FOWLER, FOX NEWS CONTRIBUTOR AND NATIONALLY SYNDICATED RADIO HOST: Well, I think that's a good question. I mean, I disagree with the president on arming teachers. And the Parkland Community is an interesting one -- I grew up about 20 miles. I actually debated at Stoneman Douglas High School when I was a sophomore, and so this is very real for me. But I think the ideal of arming teachers is just not for -- MACCALLUM: But what about -- forget the teachers for a moment. What about having somebody on campus who is an armed guard or several armed guards. FOWLER: I think we should. I mean, when I went to high school, we had an armed police officer there. I think increasing those numbers are good. But I think it's a tight rope here, because what you want to do, you're going to make sure our kids are safe, at the same time, you don't want to expose the children to over -- like to over armament, like machine gun standing in front of buildings. MACCALLUM: But they see them every time they go to the airport. If it makes them feel safe, I'm not sure it's such a bad idea. FOWLER: I think you've got to find the balance, because I think when the interview started out this morning, that show with Billy Graham talking about that there's so much hate, and there's so much violence. And having these guns there, represents that type of violence. I think if you listen to some of the people who've lived through this, they talk about -- MACCALLUM: OK. I don't know too many that are afraid to go to the airport, because there's, you know, some guys there who have guns. But Chris -- let me get to Chris -- in terms of the president and what he is going to go. Lot of talks about AR-15s in there. That's a politically perilous topic for him Chris. STIREWALT: Sure. Look, I don't think that we're going to see a federal ban on any particular kind of firearm come out of this right. But it is heavily, heavily weighing down on Republicans at this moment that their success in not -- in succeeding in blocking anything in the wake of New Town, in wake of Las Vegas, in action in the past which was pretty astonishing political victory, that they were able to stop the gun control measures and stop other things in the past, what they didn't do was act when they could have. And now, you see this catch up game where the administration is urging Congress to take action on these bump stocks where you have the Cornyn legislation about clarifying the background check process. They should've acted before when they had the chance, now they are in a hurry-scurry to try to catch up and do it, and they better or they will pay serious price this fall. MACCALLUM: Yes. There's also a measure that was put down that had to do with people who collect disability and are on the list of those who are mentally unfit -- and whatever words you want to use. That is something that the president overturned early on in his presidency. And do you think, Katie, quickly, and Richard, that that's something that needs to be revisited quickly? PAVLICH: No, absolutely not. The president simply gave back millions of Social Security recipients their rights, and he should do it for veterans too. People who need help navigating bureaucracy and handling their financial affairs aren't deemed mentally unfit. They're not incapable of owning firearms and exercising their second amendment rights. So, President Trump did the right thing there. MACCALLUM: There has to be a way to divide people who are a -- who have violence in their background or have exhibited on social media. I mean, there has to be a way to say to someone: you, actually, are not allowed to have a gun. PAVLICH: Sure. But to blanket in generalization of everyone who needs someone -- MACCALLUM: I'm going to give the last word to Richard. FOWLER: I think the one point we're missing this segment is that the good book says, the children shall lead us, and what we saw the day, Martha, all across the state of Florida, and all across this country was children leading this country in the right direction to make their school safer. They walked out in campus after campus, after campus, and it was powerful to watch. And they have my solidarity -- I'm really proud of them. MACCALLUM: And no one should write off these kids as being, you know, anything other than what they appear to be, I don't think so. Thanks, you guys. Great to see you all tonight. Thank you for being here. STIREWALT: You bet. PAVLICH: Thanks. MACCALLUM: So, here's a question for you. Who answered the phones when concerned citizens called the FBI to warn them about the Florida shooter? Tonight, new scrutiny on the FBI call center; where did these tips actually go? It is a small town in West Virginia. Why are we doing things this way? Ron Hosko served in the FBI for 30 years, and he joins us next. (BEGIN VIDEO CLIP) TRUMP: He is a sick guy, and he should have been nabbed a number of times, frankly. (END VIDEO CLIP) (COMMERCIAL BREAK) MACCALLUM: So when you pick up the phone and call for help with your computer, who answers the phone? Often that call gets rooted halfway around the world, and oftentimes you don't really get an answer. So is something similar but domestically happening like that when you pick up the call to give a tip to the FBI? Those calls get routed to a small town called Clarksburg, West Virginia, to a building there that is staffed by 150 employees. Trace Gallagher here with how this all plays out. Trace. TRACE GALLAGHER, FOX NEWS CORRESPONDENT: Martha, before 2012, FBI agents in each of the bureau's 56 field offices around the world, or the country, would answer calls and emails about various tips. The information was vetted and then assessed on whether warranted further investigation. The FBI admits handling those tips on the local level took more time, more workers, and invariably led to chasing down useless leads, but at least they got most of the information. So when the bureau moved to a centralized tip line in 2012, former and current FBI agents made their concerns very clear, saying that having one primary call center added a layer of bureaucracy, and that tip line operators in West Virginia might not understand unique problems facing the various local communities. Experts say in hindsight that concern appears valid because on January 5th the person close to allege school shooter, Nikolas Cruz, called the FBI tip line and provided specific information on his gun ownership, desire to kill people, disturbing social media posts and erratic behavior. The FBI says the call should have been flagged as a potential threat to life and prompted an urgent investigation. Instead, the call was assessed at such a low priority it was never even passed along to the Miami field office. The FBI is still trying to figure out why. It's even more baffling when you recall that in September of last year, the FBI got another tip from a man who saw a message on his YouTube channel from someone calling themselves Nikolas Cruz saying, quote, I'm going to be a professional school shooter. The tipster emailed a screenshot to the FBI but the agency could never positively I.D. the person who made the comment, and those two tips were apparently never put together. And remember, back before the Boston bombing, the FBI got a tip from Russian authorities saying Tamerlan Tsarnaev was a terror threat. The FBI assessed that he was not and didn't fully share the information with the joint terrorism task force in Boston. At the time, then-FBI director, Robert Mueller, acknowledged the information could have been handled better. Martha? MACCALLUM: Trace, thank you very much. Here now with more, Ron Hosko, former FBI assistant director of the criminal investigative division, and he served in the FBI for 30 years. Ron, good to have you with us. Let me start with this. Why did the FBI make this change? Was it a question of saving money or resources? Why did they move all the tip center to West Virginia? RON HOSKO, FORMER FBI ASSISTANT DIRECTOR: You know, Martha, I think in the post-9/11 world that we had, the bureau is changing dramatically on a number of different fronts, shifting from criminal cases to counterterrorism, building up intelligence, building up a weapons of mass destruction directorate, and we were always looking for efficiencies. How to do something a little-bit more economically. Clearly, some folks at the top of the organization making this decision thought that that was a better investment of money and time, as your Trace said. Before this, there were complaint agents sitting duty in 56 field offices-- MACCALLUM: Do you agree that it was a good move or a mistake? HOSKO: You know, I don't know. What I think is that the inspection division, a division I used to be a part of, of the FBI is out there looking at this situation. But I think they would benefit from a holistic look, not only just this case, but to see, is there other critical information that has fallen in the cracks somewhere, and see are we losing as much as we're gaining? These are -- it's a shift from agents taking these-- (CROSSTALK) MACCALLUM: Sorry to jump in. Are the people who man these phones, are they real agents? Are they FBI agents, or are they call takers? Do they make the same money as FBI agents in the field or are they paid less? HOSKO: Yeah. I think what's going on in West Virginia is you have professional support personnel who are trained on how to do this, but they are not FBI agents. That's part of the economic look at this process. They took it out of agents' hands. I did it many times myself. They shifted it to a professional support staff in West Virginia. Certainly, they are paid less. It's an area of the country that's, by and large, economically depressed compared to a Washington, D.C. or New York, so there're probably economic reasons. But again, every time you lengthen a chain, every link, you know, has its own weaknesses, and the weakest link sometimes breaks. They may see that here. MACCALLUM: We're going to stay on this with your help. We need to find out exactly what happened here. And there're needs to be accountability and we need to fix whatever the issues are that can be fixed. HOSKO: I agree. MACCALLUM: So Ron, thank you. Great to see you, as always. HOSKO: Welcome, sure. MACCALLUM: So, Jared Kushner security clearance is under intense scrutiny, but when you hear about President Obama's top advisor, Ben Rhodes, it may raise some questions about that. We'll tell you why after this. (COMMERCIAL BREAK) MACCALLUM: Jared Kushner, President Trump's son-in-law and senior advisor, now butting heads a bit with the White House chiefs of staff, according to some reporting on this. Under a new policy, laid out by John Kelly last week, that the White House will no longer let employees with interim security clearances have access to top-secret information, and that means that the status could be up in the air. But it turns out, you know, just of interest, when you look into these situations in different White Houses, Ben Rhodes, a top Obama advisor, was denied interim clearance in 2008. It is unclear if that was ever resolved. Joining me now, Charles Hurt, political columnists at the Washington Times, and Jessica Tarlov, author of American in the age of Trump, both are Fox News contributor. Good to see you both tonight. This is interesting. It's actually pulled from a John Podesta email. Let's put it up on the screen. This is from October 29, '08, so early on in the Obama administration. It said, we agreed that it would not be worth pushing for Benjamin Rhodes to receive interim status. For your information, out of the approximately 187 people who have moved through the process, Benjamin was the only person who has declined interim status. They were then asked about it later on, and they said that he currently holds all relevant security clearances related to his leading role in the White House. So that could mean a number of things, Charlie, right? CHARLIE HURT, FOX NEWS CONTRIBUTOR: Yeah, sure it could. And, of course, I welcome this newfound concern about keeping our secrets secret from Democrats, but where was this canned outrage back when Hillary Clinton and her home based server and when the previous administration was unmasking political pundits in the middle of an election. That said, this is an important issue. We need to -- the proper handling of classified material inside the White House is vitally important, and I want Trump to do it, just the way I would like to have seen Obama do it. But, quite frankly, when you look at the portfolio that Jared Kushner has, he's working on Middle East peace, and you look at what Ben Rhodes did under the exact same clearance in terms of aiding and abetting a country -- a known state-sponsored terrorism like Iran, sending them $400 million in a pallet of American cash, all of which, at the end of this nuclear deal would put them a glide path of becoming a nuclear power. I'm really not all that upset about Jared Kushner operating with or without a full security clearance. MACCALLUM: Jessica? JESSICA TARLOV, FOX NEWS CONTRUBUTOR: Well, another segment to debate the Iran deal. I wouldn't call it aiding and abetting terrorists, but that's for another night here. I agree with Charlie, wholeheartedly, though, that I would love to know what happened. This isn't something we've talked about before. Even though, I thought we had exhausted everything about that road and President Obama. But every day there's something new. So the point about the current clearances, though, there's two things going on here. One, if we hadn't had the Rob Porter issue, if there hadn't been someone who is under FBI investigation for domestic abuse, and what the FBI had actually said, this seems credible to us and then he was kept on, Jared Kushner will not be in trouble at all right now. Things would be business as usual. The second point is that it's been rumored for a very long time that chief of staff John Kelly is not a fan of Jared Kushner and Ivanka Trump's roles here, and that they are really at odds. So I think that Kelly may be using this moment, even though he's out there saying, I don't think this will affect his portfolio as a way, maybe, to really kind of harness control again in the White House after the debacle of the Porter's. MACCALLUM: To that point, John Kelly, the chief of staff, said, I will not comment on anybody specific security clearance situation, or go beyond the memo released last week. As I told Jared days ago, I have full confidence in his ability to continue performing his duties in his foreign policy portfolio, suggesting that he has the clearance that he needs to do what he's doing, Charlie. HURT: Sure. Obviously, this is Washington, everybody likes to sort of try to read the tea leaves, they're trying to get behind the scenes and get all the drama that's going on behind the scenes at the White House. But at the end of the day, if you read it at face value, that statement that he made of a new policy in the wake of the Rob Porter debacle is a very smart statement. It's a smart policy. And I don't think -- I don't find much criticism in there for John Kelly. TARLOV: No, I certainly wouldn't either. It's something that, frankly, he should have said when he started it. It was brought in to kind of rank the ship. MACCALLUM: Just quickly, do you both think that John Kelly stays? Jessica, and then, Charlie. TARLOV: I do. HURT: Yeah. I think -- probably the general has a whole lot more of the president's confidence than the wags around here in Washington would actually admit. MACCALLUM: Thanks you, guys. Good to see you. (CROSSTALK) MACCALLUM: All right, coming up tonight, CNN ambushes a Trump supporter, accusing her of colluding with Russians. Have you seen this? This is something else. Watch. (BEGIN VIDEO CLIP) UNINDENTIFIED FEMALE: They were not Russians. I don't go with the Russians. UNINDENTIFIED MALE: That group was Russians. UNINDENTIFIED FEMALE: I had nothing to do with the Russians. UNINDENTIFIED MALE: Well, apparently you did. (END VIDEO CLIP) (COMMERCIAL BREAK) (BEGIN VIDEO CLIP) DONALD TRUMP, PRESIDENT OF THE UNITED STATES OF AMERICA: She's saying Russia, Russia, Russia, but -- maybe it was. I mean, it could be Russia, but it could also be China. It could also be lots of other people. It also could be somebody sitting on their bed that weighs 400 pounds, OK? (END VIDEO CLIP) MACCALLUM: So one week after the Department of Justice announced indictments for 13 Russians for invading social media account to essentially slip into American groups and encourage them to stage rally and engage in political activities. CNN tracked down one of the women who was involved in this so-called collusion simply by attending a rally. Watch. (BEGIN VIDEO CLIP) UNINDENTIFIED FEMALE: The end. And please, please report that. I don't believe that. That's (BLEEP). I know all the people that were with me, OK? They were at my meetings. They're all Trump supporters, OK? UNINDENTIFIED MALE: But did you realize that you guys were in communication electronically with Russians? UNINDENTIFIED FEMALE: Not me. Not me. I don't know-- UNINDENTIFIED MALE: You were posting stuff on Facebook. UNINDENTIFIED FEMALE: Hillary Clinton was, and so was all her bandits. UNINDENTIFIED MALE: Some of the stuff -- you're in charge of the Facebook, right? You were posting and reposting almost word for word the information that was coming out of this internet research agency in St. Petersburg. UNINDENTIFIED FEMALE: No. UNINDENTIFIED MALE: You don't believe that? UNINDENTIFIED FEMALE: Nope. (BLEEP) UNINDENTIFIED FEMALE: Thank you. Thank you. Bye-bye. (END VIDEO CLIP) MACCALLUM: Here now, Guy Benson, political editor at townhall.com and a Fox News contributor. Guy, I mean, you can't make this up. This poor woman -- she's like, I went to a Trump rally with everybody I knew, with all my friends, and he's interrogating her as if she was, you know, some complicit spy. GUY BENSON, FOX NEWS CONTRIBUTOR: Look, that particular CNN correspondent does some good work, but in this case, you're an experienced journalist, Martha, I'm sitting here, I'm watching that clip, I watched it earlier. I went to journalism school. I'm trying to figure out, what is the news value of sending a reporter to a woman's house -- for what purpose? To say, well, you joined some group or republish some political content that came from a Russian troll farm so you and your friends who supported Trump anyway went to this event and therefore -- what? I don't understand the point is. MACCALLUM: I guess, next they'll be showing up at Michael Moore's house. And, you know, everybody else who was part of this stuff. BENSON: Right, because people on the left got duped or got sucked in to these Russian accounts who are just trying to stoke tensions and flames, did so successfully in some cases-- MACCALLUM: Yeah. BENSON: -- not terribly successfully in most cases. And as you said, Michael Moore went to some rally that apparently the Russians were behind. Are they going to be barging into his house or knocking down his door saying, did you know that you were in cahoots with the Russians? No, he hated Trump and wanted Trump to lose. Michael Moore was not some Russian plant. That woman outside her house was not a Russian plant. No one believes that. And I just don't -- for the life of me, understand why naming and shaming -- and they named her, a private citizen, for just getting involved politically, unwittingly, perhaps, involved with the Russian government serves any journalistic purpose. But it has reportedly resulted in a bunch of threats by left-wing people to this lady who simply engaged in the political process. This one is kind of baffling. MACCALLUM: Yeah. She clearly did not deserve that. And who ever handed that assignment somebody should have said, wait, does this really make sense what we're doing here? (CROSSTALK) BENSON: I'm one of these people who believe that it's important to get to the bottom of what the Russian did in our election. And taking people away and journalists away from that task, for this sort of adventure, to me is odd. MACCALLUM: Well put. Guy, thank you very much. Good to see you as always. BENSON: Thanks, Martha. MACCALLUM: So coming up next, some final thought on Reverend Billy Graham when we come back. (COMMERCIAL BREAK) MACCALLUM: Reverend Graham sat down with Fox News about seven years ago. He was asked what he would do differently in life if he had it to do over again. His answer is our quote of the night. (BEGIN VIDEO CLIP) UNINDENTIFIED MALE: I would study more, I would pray more, travel less, take less speaking engagements. I took too many of them in too many places around the world. If I had it to do over again, I would spend more time in meditation and prayer and just telling the Lord how much I love him. (END VIDEO CLIP) MACCALLUM: Life well-lived, Billy Graham. Send me a tweet at Martha MacCallum. Also check out an interesting sound bite from President George W. Bush there as well. We'll see you back here tomorrow at 7. Tucker is up next. Copy: Content and Programming Copyright 2018 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2018 ASC Services II Media, LLC. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of ASC Services II Media, LLC. You may not alter or remove any trademark, copyright or other notice from copies of the content.",
      "date": "February 21, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin slams controversial Down syndrome policy",
      "url": "https://www.foxnews.com/transcript/sarah-palin-slams-controversial-down-syndrome-policy",
      "subtitle": "Sarah Palin slams controversial Down syndrome policy",
      "author": "",
      "content": "This is a rush transcript from \"The Story,\" August 15, 2017. This copy may not be in its final form and may be updated. MARTHA MACCALLUM, \"THE STORY\" HOST: Good evening, everybody. I'm Martha MacCallum. Tonight, we will take you through the stories that are tugging at the fabric of our nation on this August evening. Today the president got up to Trump Tower to discuss rebuilding our infrastructure -- he did that for a little while. Originally, the plan was not to take any questions, but that quickly changed as he sought to make clear his assessment of the march, the fighting, and the death in Charlottesville. (BEGIN VIDEO CLIP) DONALD TRUMP, PRESIDENT OF THE UNITED STATES: You had a group on one side and you had a group on the other, and they came at each other with clubs and it was vicious, and it was horrible, and it was a horrible thing to watch. But there is another side. There was a group on this side you can call them the left. You just called them the left, that came violently attacking the other group. So, you can say what you want, but that's the way it is. I think there's blame on both sides. (END VIDEO CLIP) MACCALLUM: So, the struggle that he is talking about is still playing out across the south in ways like this. Will tearing down monuments heal or hurt in the long run? We're going to cover the fierce debate over history throughout our hour tonight. Ben Shapiro, Mollie Hemingway, and Jehmu Greene will join me in a moment to talk about the president this afternoon, and all of that that it entails. Also, the president did speak today about his strategist, Steve Bannon. (BEGIN VIDEO CLIP) TRUMP: I like Mr. Bannon. He's a friend of mine. But, Mr. Bannon came on very late, you know that. I went through 17 senators, governors, and I won all the primaries. Mr. Bannon came on very much later than that. (END VIDEO CLIP) MACCALLUM: So, what is the meaning of that statement today from the president? Will the man who helped him win the White House, in part, be the next to go? We're going to get to that ahead. But we want to start tonight with another important update on a story that was dominant in recent days. And the story was that the president may have taken us to the brink of war with North Korea. So days later, Kim Jong-un appears to have backed down. And, yet today at that news conference that you just saw, it was not one question about that. Trace Gallagher, live in our West Coast Newsroom tonight with the breaking details. Trace? TRACE GALLAGHER, FOX NEWS CHANNEL ANCHOR: Martha, for the time being, it appears Kim Jong-un has backed away from launching missiles, and is back to launching insults saying that he is now watching the foolish and stupid conduct of the Yankees and that \"the U.S. should stop at once arrogant provocations against the DPRK and unilateral demands and not provoke it any longer.\" Although Kim, the younger, does say he is reserving the right to change course and, \"wring the wind pipes of the Yankees.\" Exactly why Kim Jong-un decided to back pedal is unclear, but experts say there two reasons: one, the rhetoric -- not the fire and fury comments made by the president last week but the more tempered comments he and his national security team made this weekend, including an op-ed in the Wall Street Journal co-authored by Secretary of State Rex Tillerson and Secretary of Defense James Mattis that appeared to dial things down a notch. Experts say, the second reason Kim backed down is China, which is North Korea's only ally and main trading partner. Yesterday, China banned the import of North Korea's most lucrative products, including coal, iron, lead, and seafood. And China wasn't just threatening the North's economy. Here's former U.S. Ambassador to the U.N., John Bolton. Watch. (BEGIN VIDEO CLIP) JOHN BOLTON, FORMER U.S. AMBASSADOR TO THE UNITED NATIONS: I think the North Koreans, in particular, paid attention to what the Chinese said indirectly a few days ago, that if the United States retaliated against the North Korea attack, they would stand back. So, in other words, North Korea, if you go after Guam or something else and the U.S. comes after you, you are on your own. (END VIDEO CLIP) GALLAGHER: Analysts say, South Korea also played a part in the dial down by reiterating its belief that there will be no attack on North Korea unless Seoul gives the go ahead. Martha. MACCALLUM: Trace, thank you. Here with more tonight: Lt. Col. Michael Waltz, former Green Beret commander and a Fox News contributor; and Jamie Metzl, Senior Fellow at the Atlantic Council and Author of \"Eternal Sonata.\" Welcome, gentlemen. Good to have you all here. Michael Waltz, let me start with you. Does it appear that what the White House did here worked? LT. COL. MICHAEL WALTZ, FOX NEWS CONTRIBUTOR AND FORMER GREEN BERET COMMANDER: Well, Martha, finally someone stood up to the school yard bully and punched back. And I think what we've seen for decades here is that the North Koreans weren't used to that. I mean, look at the recent op-ed from former National Security adviser Susan Rice, who said we just need to get used to it. We just need to accept that North Korea is going to have a nuclear arsenal and be able to hold the region and the United States, hostage. So, I think that was incredibly effective. But, we cannot get complacent. We cannot rest on our laurels. We have to maintain pressure on China. The North Koreans are very good at ratcheting up tensions, and then ratcheting them down and staying just below that threshold of war. Meantime they're buying time to improve their ICBMs, to get more on mobile launchers, to go from liquid fuel to solid fuel, which means they can launch faster and even develop a submarine capability. So, we have to keep the pressure up. MACCALLUM: I mean, it's clear that this is far from over. But, Jamie, let me turn to you. Because I can't remember a time when we saw this sort of dynamic where you have China banning some of the major imports that North Korea sends to them. And that combined with the threat that China says, we don't have your back. If they come after you, we don't have your back. That's different. JAMIE METZL, SENIOR FELLOW AT THE ATLANTIC COUNCIL AND AUTHOR: It's not that different. Basically, the United States lost this exchange with North Korea over the last week. Just think about it, where were we one week ago? We already had five rounds of sanctions by the United States against -- and the U.N. against North Korea. Now, we have a sixth. It's very much a continuation of the policy. North Korea was never going to attack Guam. \n And so, we've had this whole exchange where the president of the United States comes down, for the first time ever, comes down to the rhetorical level of the leader of North Korea, and we're hurling insults back and forth. And then, at the end of the week, people are saying, oh, it's this big victory that North Korea didn't attack Guam. They were never going to do that because that would be suicidal, and they've known that for 70 years. I don't know why people are saying North Korea blinked because North Korea won this exchange and we'll see what happens next. MACCALLUM: Michael, what do you think about that? WALTZ: Well, I think -- you know, frankly, I disagree. You know, look, the North Koreans are used to this kind of passive approach. Look, the entire world over the last eight years was used to a passive approach, whether it was Russia, whether it was Putin, you know, you name it. They were used to, basically, the United States back pedaling, and I think at this point we made a stand and we took a stand. And I think it took the president of the United States to make that -- to have that kind of shock and awe rhetoric, so to speak, to change the Chinese calculus and to change the North Korean calculus. Look, until this point, the Chinese and the North Koreans believe that they have to have an arsenal in order to -- basically, for the regime to survive. Now, I think there is a growing question in that part of the world on whether if they get an arsenal, will they survive? And the Chinese, I hope, you know, it remains to be seen because they have played us before. But the Chinese may now be seeing the North Koreans as more of a problem than they're worth. But we have to maintain the pressure; they have both done this before. MACCALLUM: I think both things were true. I mean, I don't think we've seen this behavior from China in quite this way. And we also know that the game will continue and it goes on but has the chess board shifted a little bit in this dynamic? And that may be something that is due to the moves that we've seen from the Trump administration. So, in terms of Iran, a quick thought on that. Jamie, Rouhani has said he would turn the power back on to the Iranian nuclear program in a heartbeat if we follow through with these sanctions. METZL: Well, the United States is pushing forward with sanctions because North Korea -- I mean, sorry, because Iran has violated U.N. Security Council Resolutions on ballistic missiles. MACCALLUM: Shocking. METZL: If Iran chooses to withdraw from the nuclear accord, that's their decision and then the sanctions will automatically slap back. And so, that is something that, it's up to them to take that decision. If they do, there will be consequences. MACCALLUM: Michael, quick thought. WALTZ: Well, look, the Iranians can't have it both ways. On the one hand, they want their ballistic missile program, the American hostages that they've taken, the terrorism they're supporting across the region to be outside of the nuclear agreement. But on the other hand, when we start holding them accountable for all those actions, which we're doing now with additional sanctions, then it's back to what we're going to tear, you know, it's essentially an excuse to tear up the deal. So, you know, we have to maintain pressure. Again, I think it's something that the world is not used to America taking a strong stand and really hold the Iranians accountable. And particularly, as I mentioned before, for the American hostages that they're holding right now today unjustly. MACCALLUM: Very important. And clearly, what happened to Otto Warmbier had a major impact on the president, and has had some impact on his policy that we've seen as well. Thanks, you guys. Good to see you both. WALTZ: Sure. MACCALLUM: So, a firestorm erupting over a combative presidential press conference today. Reporters drilling the president over his handling of the violence in Charlottesville; here's just a taste. (BEGIN VIDEO CLIP) TRUMP: There are two sides to a story. I thought what took place was a horrible moment for our country. (END VIDEO CLIP) MACCALLUM: powerful lineup, coming up. Ben Shapiro, Mollie Hemingway, and Jehmu Greene react. Plus, the president dropping him on the phase of a controversial presidential adviser. Could Steve Bannon's days in the White House be numbered? An outrage over a news report cheering on a European country's effort to eradicate Down Syndrome births and the way that they are doing it is shocking. Sarah Palin joins us with her intensely personal story on this topic tonight. (BEGIN VIDEO CLIP) UNIDENTIFIED MALE: My understanding is that we are basically eradicated from our society. That is hardly ever a child's fault. The Down Syndrome (INAUDIBLE) anymore. (END VIDEO CLIP) (COMMERCIAL BREAK) MACCALLUM: You are looking live at new protests outside of Trump Tower tonight as the defiant President Trump takes on a fired up group of reporters in the lobby today. The president's speaking out against a growing movement to tear down Confederate statues and standing by his response to the violence over the weekend in Charlottesville, Virginia. (BEGIN VIDEO CLIP) TRUMP: I've condemned neo-Nazis. I've condemned many different groups. But not all of those people were neo-Nazis, believe me. Many of those people were there to protest the taking down of the statue of Robert E. \n Lee. So, this weekend it's Robert E. Lee, I noticed that Stonewall Jackson is coming down. I wonder is it George Washington next week? And is it Thomas Jefferson the week after? You know, you really do have to ask yourself: where does it stop? (END VIDEO CLIP) MACCALLUM: So, this was the scene in Durham, North Carolina last night. Tonight, there is talk that more monuments will come down across the south as we sort of wonder where all of this is headed. The tension in the country, in many ways, feels like the unrest of the 1960's. Yet, the statue under fire is those from the days when our country almost came apart; when 620,000 union and Confederate soldiers lost their lives. General Mattis, now the Secretary of Defense, was asked in a recent interview: which is threat facing America worries him the most? A lot of things could come to mind, but here's what he said: \"The lack of political unity in America. The lack of fundamental friendliness.\" And today, Ben Shapiro, editor in chief of TheDailyWire.com wrote this: \"There's cancer in our body politic. We must cut it out or be destroyed.\" He joins us along with Mollie Hemingway, Senior Editor for The Federalist; and Jehmu Greene, former president of the Women's Media Center, both are Fox News contributors. Welcome, to everybody. Ben, I want to start with you in terms of your reaction. After what you wrote, the president stepped out today. As I said, he wasn't going to take questions, but he clearly wanted to set the score straight on a number of points. What did you think? BEN SHAPIRO, EDITOR IN CHIEF, THEDAILYWIRE.COM: Well, I think that he said one thing that was true, and then he said a bunch of things that were not really good for him or good for the country. The one thing that he said that was true is that the radical left, which has been violent all throughout the country; Antifa has been violent in Sacramento, in Berkeley, and Charlottesville. It's a real danger, and the media have been ignoring that because they prefer to focus in on the white supremacist who were doing their damage, their evil damage, evil people in Charlottesville. The part that President Trump said that I thought was quite egregious is when he made light of the alt-right. Somebody asked him about the alt- right, he said what is the alt-right? Can you define alt-right? And then he suggested that a bunch of people who are protesting on Friday night -- those Friday night protest involved people chanting about Jews not replacing them, and about white supremacy? And he said, some of those people were very fine people, very nice people. I don't see the purpose of that. The whole point of the column that I wrote is that you have these two nefarious fringe forces that are becoming mainstream. The violence of Antifa and the nasty white identity politics of the alt-right, and both of those need to be condemned full-scale. I saw the president condemn one of those today; I didn't see the president fully condemn the other. MACCALLUM: Jehmu, what was your take away today? JEHMU GREENE, FOX NEWS CONTRIBUTOR AND FORMER PRESIDENT OF THE WOMEN'S MEDIA CENTER: I think that there can be only one response. It's appalling. What we saw from the president was disgusting, despicable. It certainly was un-American. But the reality is for 241 years we have been inching closer and closer to the egalitarian society that most Americans and the overwhelming majority of Americans believe in. And as hard as he tries -- and he's trying very hard to flush all of that down the toilet. He has abdicated his moral authority. And I think now, maybe the only solution is something that has been suggested by the biographer of former President Clinton, which is for President Obama, President Clinton, and the both President Bushes to come out and make a statement to provide the comfort and assurance that you would expect from a president. But we're clearly not going to get that from Donald Trump. His true colors are showing. MACCALLUM: Mollie, what do you think? MOLLIE HEMINGWAY, FOX NEWS CONTRIBUTOR AND SENIOR EDITOR FOR THE FEDERALIST: I just want to correct something really quickly, which is that he actually did say that neo-Nazis and white nationalists should be, and I quote, \"condemned totally.\" So, he did condemn neo-Nazis and white nationalists. And he did -- he had a kind of rambling press conference. But it's really good when things are heated to go back and read what President Trump actually said, and then engage with those actual words. And there is something about the way he talks that definitely sets people off, and at times like this when we have white nationalists, protesting in Charlottesville. We have leftist mobs tearing down statues. It's really important for people to try and keep things as calm as possible, and to preserve political debate. And there is a good case to be made for taking down Confederate statues. That is a case that should be made calmly and rationally by talking to your neighbor and convincing them and understanding that there are multiple arguments in favor and against the removal of statues. And that iconoclasm, in general, is something that you want to -- you do want to worry about, and mob violence is something that is very dangerous and can quickly get out of control. MACCALLUM: And it feels like it. And it feels like, that's what's happening in some of these situations. With regard to the statues, because there are people who do not fit into any of these extreme categories, who believe that these statues have a reason to remain. And one of them is Condoleezza Rice -- was asked about this awhile back. Let's play that. (BEGIN VIDEO CLIP) CONDOLEEZZA RICE, FORMER U.S. SECRETARY OF STATE: I am a firm believer in keeping your history before you. And so, I don't actually want to rename things that were named for slave owners. I want us to step and look at those names and recognize what they did and be able to tell our kids what they did and for them to have a sense of their own history. When you start wiping out your history, sanitizing your history to make you feel better, it's a bad thing. (END VIDEO CLIP) MACCALLUM: \"Wiping out your history to make you feel better,\" Jehmu. GREENE: Our history can live in a museum. It doesn't have to be in a park where young people of color walk by and see these statues that represent everything that they -- that goes against them, and who they are as American citizens. You don't go to Germany and see statues of Adolf Hitler. It's fine to make sure that we remember history so we don't repeat it, but having these statues on federal property, on state government property, in part does nothing but harm individuals who understand what the civil war was about. And it was an attack on them. And, again, all of the progress we have made. We are not at a place in our country where the president of the United States, regardless of what his words were, he defended people who stood at that statue and shouted death to Jews. That is what they were shouting Friday night. There is no excuse for that. And I think anyone who saw his performance on Saturday, yesterday, and today, you can understand where his authenticity is. You understand where his passion is, and it's certainly not on the right side of history. MACCALLUM: Ben, let's get some other reaction. Ben, what do you think? Is that fair? SHAPIRO: I think that, in part, that's fair. I mean, I do think that when you -- I think it's a little over the top. I think when you see the president of the United States saying that there are very fine people who are at that protest on Friday night, that torch light protest, where they are shouting that Jews replacing people. And when you see the president of the United States refusing to denounce the alt-right by name, suggesting and said he doesn't know what it is. Then, a lot of the denunciation of white supremacism did wring a little bit hollow when you refuse to acknowledge what the alt-right is. There's a reason that both Richard Spencer and David Duke seemed particularly happy today. I think that that's the fault of the president. GREENE: They are celebrating. MACCALLUM: let me have Mollie have the last spot. SHAPIRO: And I think the president is a bigot, but I think that he seems rather comfortable taking support from racists and bigots when he finds it comfortable to do so and that I find deeply troubling. You know, as far as the Confederate statue stuff, you know, I have sympathy for both sides on this particular argument. But one thing, I think, we all should agree on is that leftist mobs, ripping down statues, and violation of the law is obviously a violation of the law. (CROSSTALK) MACCALLUM: There's a process underway to make arrests with that. Thank you, Ben. I do want to let Mollie get the last word in here. Really quick, Mollie. HEMINGWAY: Again, it's important for people. It seems like many people in our media, and our president and political leaders are not doing a good job at calming things down. But we can work together neighbor to neighbor to have decent civil conversations and we should all work to do that. MACCALLUM: Well said. Thank you, to all of you for being here tonight. So, we're going to take a closer look at European country that has nearly eradicated Down syndrome births not from therapy or from cures, but from abortion. Sarah Palin is here exclusively tonight; she feels as you would imagine, very strongly about this subject from a personal perspective. She has a powerful message for mothers. Also, a question about Steve Bannon, the shark circling, perhaps, around him as there are calls for his ouster, including members of Congress who got together and wrote a letter. One of them will join us ahead of this, along with Bannon's close colleague who says the strategist's ouster, he believes, would be a very bad thing for the White House when we come back. (COMMERCIAL BREAK) (BEGIN VIDEO CLIP) TRUMP: I liked him. He's a good man. He is not a racist; I can tell you that. He's a good person. He actually gets a very unfair press in that regard. But, we'll see what happens with Mr. Bannon. (END VIDEO CLIP) MACCALLUM: The president there talking about Chief White House Strategist Steve Bannon, who seems to be facing a bit of an uncertain future tonight. A spate of the recent report says that his ouster could be imminent. Democrats have definitely gotten on board; four minority house caucus groups have joined forces to make demands of President Trump. They wrote a letter stating this: \"Americans deserve to know that white nationalists, white supremacists, and neo-Nazis are not in a position to influence U.S. policy. That is why we continue to find Steve Bannon's presence in your administration incredibly alarming and dangerous to the nation and to the world.\" I'm joined now by California Congresswoman, Karen Bass, a member of the Congressional Black Caucus calling for Mr. Bannon's removal. Congresswoman, good to have you with us tonight. REP. KAREN BASS, D-CALI., MEMBER OF THE CONGRESSIONAL BLACK CAUCUS: Thank you. Thanks for having me on. MACCALLUM: So, on what are you basing that assessment of Steve Bannon? BASS: Well, let's be clear. It's also not just about Steve Bannon. It's Steve Bannon. It's Gorka, it's Miller. The letter called for the ouster of all three. And frankly, the demand that that happened was immediate. As soon as the president took over in January, there were letters to the White House saying that we thought that having a person like Steve Bannon in the White House sends a terrible message. After such a divisive campaign, we need to have people that are more inclusive. Him coming off of Breitbart News, and the way Breitbart News, first of all, promoted the alt-right, which in our opinion, is just another term for white nationalists or white supremacists. The way he -- specifically, Bannon, has been very racially divisive, we thought that you know, after the inauguration the country needed to heal. MACCALLUM: Let me ask you this. Steve Bannon is pretty quiet. I mean, he's not somebody that you hear from very often. We're all familiar with Breitbart News. And some of the headlines that you may be using to put these very serious labels on this man. So, I'm asking you, nobody likes to be labeled things -- the kind of things that you just -- White nationalists, neo-Nazis. I mean, these are extraordinarily strong statements. So, I am asking you, because as I'm about to talk to someone who knows him quite well, and I've spoken to other people who know him quite well. I do not know him quite well. What specifically, when you are going to do that, you need to have some evidence of what's in his heart. So I'm asking, how do you know what is in his heart? BASS: Well, who knows what's in anyone's heart. MACCALLUM: Exactly. BASS: But what I can tell you is that when he was in charge of Breitbart News, Breitbart News, and the way he was in charge of it, the way they attack the African-American community. You know that Steve Bannon has lots of famous quotes, what he has to say about women. A lot of things that have been attributed to him, his perspective, the way he encouraged the president around the anti-immigrant stand. I mean, there's a long list of issues that have been very, very divisive that Steve Bannon has prided himself is his contribution to the Trump administration. MACCALLUM: Let me ask you another question. Because when I see that's dangerous what's happening in America right now, is that everyone is sort of in one silo or the other, right? There's very little room for people to have differences of opinion. And they are very quickly labeled awful things like neo-Nazi and white nationalists, OK? And names on the other side -- on the left side as well. So does that concern you because you are doing that to him, and so I'm wondering if you would like to be put in that kind of silo and that kind of labeled box based on someone who didn't know you? BASS: Well, if somebody wanted to look at me and wanted to look at my record, they could certainly never put me in a box like that, because I have not had a history of that. I think if you look at Breitbart News, if you look at Steve Bannon, if you look at what his history has been and, again, I said this is not just about Bannon. This is about Gorka. His anti-immigrant stance. The writings that he has contributed. If you look at Steven miller, it's all of them together and it sends a message about this administration that. MACCALLUM: That you don't like. BASS: . to me it was not surprising. MACCALLUM: I've got to go. I'm sorry. I hear you and I think you made your point, and I thank for being here, but I do want to save time for my own other guest as well. Your point is well made. BASS: OK. MACCALLUM: Karen Bass, thank you very much. So sitting here next to me with a bit of a different take is Raheem Kassam who is a Breitbart News London editor-in-chief, and author of the new book, The No-Go Zone, how Sharia law is coming to a neighborhood near you. Raheem, you listen to that, you heard the charges against the man that you know. What do you say? RAHEEM KASSAM, BREITBART LONDON EDITOR-IN-CHIEF: Well, you don't hear any evidence for a start. She's not pointing to anything specific. You would expect that there could be a quote, a specific quote attributed. We've been this far now. We've been here for 8 months now. They've be complaining about him nonstop, and the people around him. But they can't never actually say anything specific. And what really stood out to me about that is, you know, do they realize they lost? They don't get to dictate who is in the White House. The Democrats had their turn in the White House. They formed their cabinet. They presented their policies at the last election for the American public. And now they're trying to dictate who is employed by the White House. It seems very strange to me. It's a strange way to approach it. I wonder if the congresswoman has ever actually reached out to Steve Bannon's office to take a meeting, so that she can personally get to know him. Everybody keeps calling for unity and coming together as a nation. What steps is an elective representative taking to get to that unity? MACCALLUM: Well, in terms of his -- you know, in terms of the basics and her charge, you know him well, is he anti-Semitic? Is he a neo-Nazi? Is he a white supremacist because there are plenty of people in this country who believe that he is? KASSAM: If he was any of those things, he would be the worst white supremacist, worst neo-Nazi that you can imagine because he hasn't done anything to push forward any of those views. He would be a very unsuccessful version of those things. You know, I am of a Muslim background, your viewers can see. I'm brown. My name is Raheem Kassam. He holds me to be his London editor. The CEO of Breitbart News is a guy called Larry Solov, Jewish background. Job Hollock is our legal editor. You know, all of these things, none of it stacks up. And we all see this man for -- we all know him. We've worked with him day in, day out, and I have no reason to -- he's not my boss now. I have no reason to come on here and I gain nothing from doing this. But from day one, they started to pick on people and accuse them of certain things. And, you know, it became abundantly clear that when you drill into it, and you sat them down, and you said, what are your specific problems? What are your specific concerns? They would just repeat the same talking points over and over again. This is playing politics for politics sake. MACCALLUM: One headline from Breitbart page. KASSAM: Right, they usually take satirical headline. MACCALLUM: . he's the captain of the ship, that's what. KASSAM: and they usually post satirical headlines and satirical articles and pretend like they were actual news headlines. Think about this, most mainstream news organizations actually have to issue more corrections every week than Breitbart News has to do a year. Nobody seems to get that. MACCALLUM: Let me ask you this. You are concerned as -- you know, just watching all of this play out, as how the dynamic would change if he were to leave the White House. How would that be? KASSAM: Well, look, I think what President Trump has done is he put together a cabinet that is not a cabinet of yes men. The Obama administration had, you know, ideologues who all wanted to pull the country in a specific direction. If you look at what happened with ObamaCare. If you look at what happened with the bailouts. You know all of these sorts of things that happened under the Obama administration, they happened because they were all doing this high mind set thing, OK? President Trump has put together a diverse cabinet. A sort of big tent cabinet, and to his credit. So you have ideas thrashed around. You actually have people bringing different things and different skill sets. Different talents, different philosophies to the table. MACCALLUM: But Steve Bannon, what would be missing? What element would be missing if he wasn't there? KASSAM: Well, I think Steve is probably the person with his -- the second most person with his finger on the pulse as far as the base is concerned. \n We always talk about Trump's base. It's a diverse base, but they understand the base. The number one person is obviously President Trump. The number two person is Steve Bannon. You know, if you lose that then you actually give over to some the more liberal elements. Some of the more gun control types who have found themselves in the White House. Some of the people who are very close to Mr. Trump. Who are, you know, if you don't mind me saying, they're New Yorkers. They don't actually identify that well with the rest of the country. (CROSSTALK) KASSAM: No, I'm not trying to be offensive. It's a different perspective. MACCALLUM: It's very good talking with you. Thank you very much, Raheem Kassam, joining us tonight. Good to see you. So coming up next in the internet frenzy to identify participants in the Charlottesville protest this weekend. A number of every day Americans were incorrectly ID's. Dana Loesch, still ahead on the dangerous consequences of docking Americans. Plus, an eye opening CBS News report out of Iceland sheds light on a nation working to eradicate people like the young woman that you see there on the left. Not through cures but through abortion. Sarah Palin joins me in a moment with her personal take on this shocking report straight ahead. (BEGIN VIDEO CLIP)\n\n UNINDENTIFIED FEMALE: We don't look at abortion as murder. We look at it as a thing that we ended. (END VIDEO CLIP) (COMMERCIAL BREAK) (BEGIN VIDEO CLIP) UNINDENTIFIED FEMALE: But the results are only 85 percent accurate. For daughter, Augusta, now 7, was born with Down syndrome. (END VIDEO CLIP)\n\n MACCALLUM: Shocking report from CBS News is opening eyes about what is going on in Iceland and other countries. The country is boasting that they have now virtually eliminated Down syndrome, not with any cure but by abortion. So here is a look at some of that report. Watch. (BEGIN VIDEO CLIP)\n\n UNINDENTIFIED MALE: My understanding is that we are basically eradicated almost Down syndrome from our society, that is hardly ever a child born with Down syndrome in Iceland anymore. UNINDENTIFIED FEMALE: And what does the 100 percent termination rate though you think reflect about Icelandic society. UNINDENTIFIED MALE: I think it reflects a relatively heavy hand to the country. UNINDENTIFIED FEMALE: About 80 to 85 percent of women want to have a Down syndrome screen.\n\n UNINDENTIFIED FEMALE: So there was demand for this. UNINDENTIFIED FEMALE: Absolutely, yeah. UNINDENTIFIED FEMALE: Babies with Down syndrome are still being born in Iceland. Some of them were low risk in our screening test, so we didn't find them with the screening. UNINDENTIFIED FEMALE: We don't look at abortion as murder. We look at it as a thing that we ended. We ended a possible life that may have had acute complication. UNINDENTIFIED FEMALE: You see it as preventing suffering. UNINDENTIFIED FEMALE: Preventing suffering for the child and also for the family. And I think that is more right than seeing it as murder. It's so black and white. Life isn't black and white. Life is gray. (END VIDEO CLIP)\n\n MACCALLUM: So here now former Alaska governor and GOP vice presidential nominee, Sarah Palin, whose son Trig was born in 2008. There he is on the left as a baby. And here's a recent picture of him. I think he's 9-years- old now. Sarah, welcome. Great to have you with us tonight. SARAH PALIN, FORMER GOVERNOR OF ALASKA: Thank you. MACCALLUM: What was your reaction to the CBS story, and all of the information, and the numbers, and the way that they're effectively calling children like yours from their society? PALIN: We couldn't get through all of it, all of the report without my heart just absolutely breaking because this intolerance for people who may not look like you is just so -- it's so wrong. It's so evil. And here, Iceland is such a beautiful country. When I was governor here I met with the president of Iceland, and we talked about our beautiful regions of the world and the beautiful people who lived there. The hard-working people with such great hearts. And I think Iceland won't be so beautiful if they continue down this path of being so intolerant to the degree of trying to snuff out the life of those who maybe do not look like the subjective view of someone that would equate to perfection. You know, when you consider that a Down syndrome child, their skin is a little bit different. Their eyes are shaped differently. Their speech patterns are different. Those things that make them so unique make the world more unique and more beautiful, and to try to snuff out their life in the name of building a perfect race or a perfect country, that hearkens back to neo-Nazi, Germany, when they tried the same. And look at the horrors that were resulting from those actions. MACCALLUM: You know, you say it so well, obviously, because you have personal experience. And I remember the beautiful moments that we saw with you on the campaign trail with your son and, you know, you think about people. The idea that people, who look, you know, normal, for lack of a better word, are perfect is hilarious to me. I mean, you know, we are all born with so many imperfections so if you happen to look like other children, you know, life is going to throw all kinds of challenges at you. But I know you have spoken very poignantly about what went through your mind because you did have that moment when the doctor said to you that there was a higher chance that Trig might be born with Down syndrome. How did you feel? What was your reaction? What went through your mind? PALIN: Well, I can certainly understand why a mother, when receiving that news that their child may have Down syndrome would be so full of fear. I was full of fear. I had to really be brought down to my knees and ask God to change my heart and prepare my heart and my eyes and my understanding of the purpose in my son's life. And he certainly answered those prayers because the minute that Trig was born the fear went away. And I see how he has just really allowed for real good priorities in my life, I believe, where you know I know what matters. And life matters. And love matters. And really we are not -- who are we without love and acceptance? Who are we as a culture? Iceland or these other countries that are condoning the idea of eradicating those with Down syndrome. Who are they without love, without that respect for the sanctity of all life? MACCALLUM: I couldn't help but think, you know, this is basically eugenics. And it took me back to the Middlebury story, because the students at Middlebury were so outraged at Charles Murray because they claimed that his book, and he claims that's not true, was supportive of eugenics and they all stood up and turned their backs. And I thought where are those students turning their backs to this practice and standing against the eugenics that's being represented, that is ending the existence of these little babies? PALIN: Right. Well, we see, Martha, in other areas of the country, in our own country today. You know, we see the bigotry. We see racism, unfortunately. We see those who would think that they are supreme to others based on someone's physical characteristics, the color of their skin, or maybe the way they speak, or the shape of their eyes. And that's very, very tragic. And it really is bringing our nation, our world backwards, back to those days that we said never again would we allow such a thing to happen. So to see a report today, brought forth by, I think it was CBS who reported this, with the celebratory tone that oh, yea, we're going to eradicate those who may not look real perfect like we look, yeah, right. You know, I think it's a very disheartening trend. It's very tragic. But there are things that we can do about it. You know, we can allow -- especially young mothers who are facing less than ideal circumstances in their pregnancy finding out that maybe their child will have Down syndrome or some other challenge to come. We can help them be less fearful by speaking proudly about those that we have in our lives that bring so much joy. Who bring so much joy into this world if only we would give them of that chance. MACCALLUM: You have done a great job of alleviating that fear in a lot of people. And thank you, Sarah Palin. And best to Trig and the rest of your family. Good to see you tonight. Thank you for being here. PALIN: Thank you. Thank you. You, too. MACCALLUM: So coming up next, the dangers of the practice that is known as doxing. Celebrities like Jennifer Lawrence using their social media power to out racist in this country, she says. But it has back fired on some normal people whose lives have been offended by that. Dana Loesch sounds off on what she says is a mob tactic that could cause irreparable damage to some innocent Americans, when we come back. (COMMERCIAL BREAK) MACCALLUM: So we are learning that we have to be very careful about where all of this division leads. For example, the outing of people's personal information is known as doxing. There is now an online campaign that's being supported by Jennifer Lawrence and others that asked to identify white nationalists who appear in the photos in Charlottesville. The problem is that in that process several innocent people have been misidentified as neo-Nazis, including this professor from Arkansas, Kyle Quinn, who was confused with this man. He and his wife have been so harassed that they had to leave their home and move in with a friend. Here now Dana Loesch, host of Dana on the Blaze TV. Dana, good to see you tonight. DANA LOESCH, DANA ON BLAZE TV HOST: Thank you, Martha, for having me. MACCALLUM: A lot of people are trying to expose the people that is seen in these pictures, and some of them need to be for good reason. But this process is pretty dangerous. LOESCH: No. I completely agree. Everybody would love to know who these individuals are. Make no mistake. But we have to be really careful in how we go about that. Because, according to the standards of internet mobs and the frenzy, you know, people just get all riled up. They go after and they can really harm innocent individuals like James Quinn, the man that you just mentioned. He just happened to have a similar look and build to one of the guys pictured holding the mosquito repellant Tiki torch, and for that he and his family were driven from their home. This guy has made his life on helping individuals and because of this false identification, you know, he trains other scientists, that can actually impair him from being able to go out and do his job properly and help people. There was also a false identification of initially the guy who was behind the wheel of the car who used an ISIS tactic to drive it into a crowd of people. Originally, there was a false identification there. We just have to be really, really careful in how we go about it. I mean, there's a reason why there is an investigation. Attorney General Jeff Sessions has said the DOJ is also looking into this. I really trust the professionals to do their jobs because they, as much as anyone else, want to find out who some of these individuals are that are pictured assaulting other individuals or, of course, driving their cars into someone. But we can't get carried away in this frenzy and actually do more harm than good with the intent here. MACCALLUM: You and Kathleen Rice, new topic here, have been going at it. We just have about a minute. She said -- I'm just going to say it, NRA and Dana Loesch are quickly becoming domestic security threats under President Trump. We can't ignore that. And you went on to say an elected official just labeled me and millions of others domestic security threats. Wow. Where does this stand? LOESCH: We don't know yet. I wish that Rice would apologize for this, or at the very least step down from the Homeland Security Council on which she sits as a committee member. MACCALLUM: Why do you want her to do that? LOESCH: She maligned millions of innocent Americans, and basically labeled them, Martha, the same as she would a terrorist. And these are innocent moms and dads, grandfathers and grandmothers, millions of people who have done nothing wrong except in her eyes support their Second Amendment rights. MACCALLUM: Dana Loesch, always good to see you, Dana. Thank you for being here tonight. LOESCH: Thank you, Martha. MACCALLUM: We'll take a quick break. We'll be right back with more of \"The Story.\" (COMMERCIAL BREAK) MACCALLUM: Busy night. Thanks for being part of \"The Story\" tonight. We want to know your stories as well. Send it to me at twitter at Martha MacCallum using the #thestory. We will see you right back here tomorrow night on Wednesday at 7:00 PM. My friend Tucker Carlson is coming up next. END Content and Programming Copyright 2017 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2017 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.",
      "date": "August 15, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin opens up about running for vice president",
      "url": "https://www.foxnews.com/transcript/sarah-palin-opens-up-about-running-for-vice-president",
      "subtitle": "Sarah Palin opens up about running for vice president",
      "author": "",
      "content": "This is a rush transcript from \"Life, Liberty & Levin,\" April 8, 2018. This copy may not be in its final form and may be updated. MARK LEVIN, HOST: Hello America. I am Mark Levin, this is \"Life, Liberty & Levin.\" And I have a great guest, it's my honor, Governor Sarah Palin. How are you? GOV. SARAH PALIN, FORMER REPUBLICAN VICE PRESIDENTIAL NOMINEE: Thank you. It's my honor. Thanks. LEVIN: You flew down from Alaska, I mean that's -- I couldn't be more appreciative for that. PALIN: Thank you. LEVIN: You know, we know little bit about your background. We know a lot about your background. You grew up in Alaska most of your life. PALIN: All my life. LEVIN: All your life. PALIN: Yes. LEVIN: In Wasilla, you settled there, your parents did. You became a member of the city council. You became mayor, you knocked off the incumbent mayor. I seem to recall you ran for lieutenant governor, then you ran for governor and you won. Give me a little history on how you decided to run for governor and how you won. That's a big darn state for an outsider to win. You are like one of the first outsider candidates. PALIN: Even when I was on city council, I realized in order to really get the job done for the people, you needed to be the top dog in the organization. So, we have a strong mayor form of government which is the city manager job really, and ran for mayor knowing that that's how I could really administratively put our local government back on the side of the people. So, I ran for mayor and then was term limited out there and then served as an Oil and Gas Commissioner and then ran for Lieutenant Governor, lost and new even during that loss that our state was missing out on the people's will really being done. So, ran for governor, certainly as an outsider. I had challenged an incumbent Republican Governor, Frank Murkowski. He was a 22-year US senator. LEVIN: His daughter is now a senator. PALIN: Yes, he gave his job -- his seat to his daughter... LEVIN: Passed it along. PALIN: That's another story, and though you know, I was considered even back then going rogue because I challenged the Republican Party, but we had a lot of corruption going on in our state and people wanted it cleaned up and nobody else was going to clean it up and I said, \"I could.\" LEVIN: How did you learn that Senator McCain was choosing you as his running mate. PALIN: Well, I didn't know I was being vetted, and one day I was at the Alaska State Fair awarding the \"Farm Family of the Year\" and left the podium and put my baby, I just had a baby who was 16 weeks old, put him in my snuggly, was walking out of the fairgrounds, got a call, Senator McCain asking if I wanted to run for Vice President and I said \"Well, you know I am Governor, and things are going very well.\" You know, as Governor, we were just kicking butt on producing oil and gas and just a lot going on with our agenda and my oldest son had enlisted, he was ready to go off to war, my oldest daughter was still a teenager and informed that she was pregnant, my husband was working up in the north slope in the oil fields, it was a 1,700-mile commute from the Governor's mansion for his work. So, we had a lot going on and when Senator McCain asked if I wanted to run for Vice President, I said, \"I've got nothing else going on, sure. Happy to run.\" LEVIN: What do you think he chose you? PALIN: Probably for practical -- political practical reasons. He probably knew that they needed someone younger, needed a female and needed a true conservative to balance everything out and someone -- they were smart enough to have chosen someone with a lot of administrative his experience. That was -- my career was administration. LEVIN: Were you glad? Are you glad, looking back that you were chosen and ran for Vice President? PALIN: Oh yes, I would do it again in a heartbeat. I had to push back harder on some of those who were trying to mold me into something that I was not during the campaign. I would've pushed back and gotten more truth out there, but heck, yes. LEVIN: You know, when I think about you and your family, you're very transparent. You say what you think, they say what they think and yet the abuses that you and your husband and your children have had to face, I mean, families have to deal with things that happen. LEVIN: You know, everything is not primrose. Were you surprised at how vicious the media were? LEVIN: I was surprised because there in Alaska, as I mentioned, my ratings were very high. Things were going well in the court of public opinion even, so I was mostly shocked, Mark though that the campaign itself didn't defend against a lot of the lies that were being spewed during the campaign, and then when that narrative was created, they created a caricature of Sarah Palin and the Palin family. Once that bell is rung, it's hard to un-ring. So, that aspect was pursed perplexing and frustrating, but you know, I had learned a lot in these ten years and I don't put up with as much as I had back then and I don't let things bother me. I obviously didn't let a lot of things bother me then either, otherwise I'd be crawled up in a fetal position under that table and just want to go away. LEVIN: And you became, in many ways, the leader of this movement, this tea party movement, which still serves as the base of the Republican Party today. The tea party movement was a progeny of the Reagan revolution. I also think it's part of a big base of the current President, Donald Trump, how do you feel about that? PALIN: That tea party movement, the movement was always there. There just wasn't maybe a person or a more specific agenda to coalesce around and then turn that movement into results in the ballot box. That movement was there and certainly under Reagan, I am privileged to have come into my own, politically speaking, during the Reagan years, that's when I was in college studying Political Science under Reagan. So, I knew how to do things right. It's always been there, it's just the voice of the people had been ignored for so long. Both parties, I call it a uni-party, both parties had ignored the common man for so long and just taken us for granted. That, no, the time was right to get out there and not lead it, but just speak for a lot of the issues and a lot of heart that so many Americans were feeling. LEVIN: Given your background, given your role with the tea party, your strong principled conservative beliefs, what do you make of what's happening in Congress with the Republican Party today? What do you make of this incredibly profligate budget and spending that they have been involved in? PALIN: Yes, really frustrated with that recent Omnibus because you know, it just became really apparent that okay, we are only going to slam the big spending bloated budgets, I guess when the Democrats held the purse strings. We won't hold our own party accountable when we are part of the problem with this you know, unchallenged debt that we are incurring, that's growing and the deficits that I now, I guess are okay and specific things in the Omnibus that now are being funded like planned parenthood that we were screaming about you know when Obama was in charge and now, you know those things are not even debated in a lot of respects now. So, that's really frustrating. There are some really good conservatives in Congress, thank goodness, a lot of the participants in the freedom caucus I have great respect for. I was frustrated when President Trump and President Trump's people had declared war on the freedom caucus, I think they did that by mistake and they haven't, you know, followed up on that much because there are some good people who understand fiscal responsibility and how important it is to get our arms around this debt, but, they are, at this point outnumbered. The good guys need reinforcements in Congress. LEVIN: What you think about the way it was done? You have basically McConnell and Ryan and Pelosi and Schumer in a closed room, at least called smoke-filled, but they are in the room and it's not smoke-filled these days, but they are still there. They hammer out this massive 2,200-plus page document. And the Senate, they are not allowed to offer any amendments, and the House are not allowed to offer any amendments. They vote on it literally within hours, is that the way our democracy is supposed to work? PALIN: No, and that's why people are fed up with politicians. They are fed up with government. You had 2,232 pages, 48 hours to vote on a $1.3 trillion spending package that in six months they are going to turn around and do the same thing again. It's not that 1.3 trillion was going to get us through any number of months. So, no, the whole process was so skewed, and if they think that... PALIN: ... people are going to just let that go and that we are just going to swallow that and say, \"Well, that's just the way it is,\" well, we're not. That practice that we just saw, we just witnessed how they do things in those proverbial smoke-filled rooms, that's why people are so up in arms when it comes to the direction of our government, and that's why Trump was elected. President Trump is there. LEVIN: Should he have vetoed it? PALIN: He should have. I believe he should have, of course, I don't know all the details, obviously. LEVIN: Do you think Republicans are going to pay a price in the midterm elections? PALIN: They better start articulating answers to the people who have questions that we are answering right now, as to, \"Why the heck did you guys do that? You didn't have to do that.\" And for us to have conceded, \"Oh, we had to give up a lot in order to get this or that,\" no, you know, that's not -- we didn't get a good deal out of that. If we had to you know, vote on something, nobody read the thing. LEVIN: No. Which is a great point, they're voting on something they never read. You point out the -- not only fully fund planned parenthood, they get more money than before and yet, look at the border. They don't fund really effectively new walls, new security, and this is coming out of the Republicans. I mean, I am flabbergasted by this. They used to say, a lot of these folks, I know, I am not a social conservative, I am not a neo-con, but I am a fiscal conservative, they can't even say that anymore, can they day? PALIN: Right. No, and you're right, when it came to funding more Border Patrol, more walls, more fences, no, they didn't fund that for inside the US, but we did fund that in some foreign countries and I think what Republicans are going to have to answer to come campaign time -- election time again is where do they think we are going to get the money to pay for all of this? We are broke and people don't talk about that. You know, we are $20 trillion in debt and with unfunded liabilities coming up in our kids and our grandkids future, it's more like $120 trillion. Where does Congress think that we will get the money to pay for all these things? What are we going to do? Borrow money from -- more money from more foreign countries in order to turn around and give it to other foreign countries? Or will we just print the money out of thin air, you know, with quantitative easing? We just all had to put up with that too with money being printed and I don't know, they didn't watch it. We are going to turn into Germany, 1923 with wheelbarrows full of devalued dollars. LEVIN: Why do you think they did this? PALIN: I think... LEVIN: Scared? PALIN: I think again that they think that we are not paying attention to the degree that we are, that if they can just placate us by saying, \"No, no, that's the way we have to do it, otherwise all of government is just going to have to shut down,\" you know, and kind of put the fear of God in it. I think they just take it for granted that we are going to sit there and swallow it and say, \"Okay, you guys know best.\" But no, there are enough people paying attention and again, that was all made manifest in the last Presidential election. LEVIN: When we come back, ladies and gentlemen, I want to ask Sarah Palin about Obamacare and these other issues where she took the lead on this, fighting Obamacare and took a lot of hits for it, as a matter of fact, but it turned out to be quite right, in my view. And don't forget, every weeknight you can watch LevinTV -- LevinTV on CRTV.com, Conservative Review TV.com, give us a call, 844-LEVIN-TV and join us. That's 844-LEVIN-TV. LEVIN: Welcome back. I'm here with Governor Sarah Palin. I want to talk briefly about Obamacare. They never did repeal it. They repealed a tiny little piece of it, but I still have to live with it, you probably still have to live with it. You know, you were very, very concerned about this law. Why do you think they didn't repeal it? PALIN: Yes, that wasn't even part of the Omnibus, you know. LEVIN: They funded it, right? PALIN: Right, right, that there were still too many aspects of it that they funded. It's a shame that they did because that is one of the reasons that President Trump had been elected. So, if for no other reason, you know, Republicans especially should have remembered that just some months prior, people were screaming about Obamacare being so burdensome on the people, so unconstitutional, and yet they didn't even challenge it, this go around, and that's sad because Obamacare is an atrocity. And not only is it, as I say, unconstitutional, but you know, hijacking 20 percent of our economy, putting that back into government's hands was a huge mistake and then of course, healthcare overall, how it would be diminished kind of our system atrophy under Obamacare and yet, we are still looking at it. LEVIN: You know, the President really has tried to secure the southern border. He talks about all time. He has demanded funding for it, he is now looking at a way to use military funds, if he can find a legitimate way to do that. He is calling on the military, the National Guard which Obama did and George W. Bush did and in some respects to assist the Border Patrol because of the caravan that's coming or has been coming to the southern border which is by the way, constitutional as long as the military -- this has been well understood legally and constitutionally is not involved in specific apprehensions, arrests, detentions and so forth, so they back up the Border Patrol. So, I think he's tried to do everything a President can do and yet Congress again stands in the way. Congress passes along 2006 that says, \"We are going to secure the border.\" They don't fund it. LEVIN: We have Republicans in Congress, including one of your friends in Alaska who refused to stand behind not just the President, but the American people. This is a sovereign nation. Why do you think it's not just Democrats, but so many Republicans don't believe in securing our border? PALIN: Right, and it's obvious why the Democrats don't believe in securing the border. You know, I think that they just fear that Americans aren't going to vote Democrats, so by golly they will import people who will. And those who are part of that uni-party, the globalization of America agenda, they want cheap labor. It comes back to either supporting the rule of law, our legal immigration system, or supporting and incentivizing illegal immigration with no expectation of assimilation of the people into our culture or anything else. It's really whack. People are really sick of it. It's another reason that we saw a change in party power at the last election cycle, and yet the voice of the people, it is being ignored. Those who want -- those who are looking out for the big corporations who are pro-open borders because they do want that cheap, unskilled really labor competing for our jobs, those who are supporting that, I think they are going to feel it come their reelection time. LEVIN: And yet, we conservatives, we vote and we vote and we vote. We throw out Pelosi as the speaker in 2010. You were involved in it as you are well aware, 2014 we gave the Republicans the Senate, 2016 the presidency, governorships all over the country, state legislatures all over the country and yet, we continue on this progressive trajectory... PALIN: Right. LEVIN: Progressive ideologically, this trajectory. Do you think the progressives have won? Do you think the Republican Party which really was the home of the progressives early on in the early of the last century, do you think the progressives have won? I mean, the Democratic Party is hard left, but the Republican Party has no great shakes either? PALIN: Right. No, they haven't won, otherwise Hillary Clinton would have won the Presidential election. They haven't one, but as I -- you know, I repeat myself, but as we see made manifest, the uni-party still has not heard the voice of the people who are saying the status quo has got to go. Look where the status quo has gotten us. With these bloated budgets, unsustainable debt and deficits, with open borders essentially, with the rule of law being ignored, with the judicial system acting as judges, ignoring the balance of power, all those things that have put us on that trajectory. Those things that are going wrong, those in Congress who still haven't heard that and accepted that what we said during the Presidential election was status quo has got to go, I think a lot of them are choosing to retire. You know, they are realizing, \"Oh, maybe I am not going to have it so easy,\" I think you're going to see a lot of primary Republican candidates and it's to send that message. LEVIN: I want to jump into foreign policy a second. One of the things I know you're concerned about is Russia and China land grabbing and resource grabbing and grabbing minerals under the sea, really with no challenge. Russia's militarizing the Arctic with the help of the Chinese, claiming natural gas and oil and so forth. Are we doing enough about this? Is this even becoming a big enough issue? PALIN: I hope it becomes a big enough issue because what Russia is doing right now is they are flagging under seized resources -- oil and gas -- and things that can be responsibly exploited for mankind's use. Russia is claiming these areas and yet, these areas don't belong to Russia and we are not doing anything about it and we really need to get on board with that agenda to start protecting our resources and areas that are being disputed and you know, of course, I know all that about Russia because I keep my eye on Russia, of course... LEVIN: I am only asking, right? PALIN: And China, you know, we, not keeping up with what China is doing with their aggression and of course the international community is telling China, you know, \"You can't do that,\" and these South China Seas area, that's not your territory, you've got to stop. But nothing has ever enforced. So, these countries keep on keeping on and in the meantime, America can be seen as kind of dithering and stepping back, allowing them and their aggression to start claiming more... PALIN: Our sovereignty and our solvency is at stake here, so Congress, you know, they've got to be schooled up on this stuff and they have to start via the laws that they can make, start directing administration to really start exerting US power to claim a lot of resources that we are letting go today. LEVIN: The President has set a fleet to the South China Sea. It sounds -- it seems to me the President is trying to do these things and undo what Obama did... PALIN: Exactly. LEVIN: ... basically surrender all these areas of the world, these navigable waters, these trade lanes and so forth that he's trying to reverse course, you know? PALIN: Yes, he definitely is. He was adamant about doing things different in the campaign and that's why he has won. He was an outsider and despite the huge threats against him, he is winning in a lot of respects and there is you know, a huge threat. It's a triple threat against this President. You know, he's got the obstructionists, the Democrats. Obstructionists in his own party, which is a shame because he's got some vipers on his own staff who maybe, he doesn't realize it, but they're not serving him well, some of them. And of course, he has an obstinate press, so that triple threat against him, despite all that, he is still succeeding in a lot of areas. LEVIN: We'll be right back. KELLY WRIGHT, CORRESPONDENT, FOX NEWS: Live from America's News Headquarters, I'm Kelly Wright in New York. Here's what's happening. Breaking News right now, Syrian news agencies are reporting that the military's air defenses have confronted an air strike and shut down eight missiles heading towards Central Syria. US government officials however say that no airstrike has been launched against Syria. This is all coming a day after what appears to be a devastating chemical weapons attack on civilians in Syria, at least 40 people were killed and activists says hundred more are being treated for symptoms consistent with chlorine gas exposure. The attack happened in Douma, the last remaining rebel stronghold near Damascus, the country's capital. Nine of the 15 member nations of the UN Security Council have called for an emergency meeting to be held tomorrow. That's all the news this hour. I am Kelly Wright, we take you back to \"Life Liberty &Levin.\" LEVIN: Welcome back. Now, Governor Palin, I want to follow up on some of this with China. As you point out, China now has built these fake islands in the South China Sea and they have militarized it. They are threatening Japan, certain islands. They are threatening the Philippines. The Vietnamese government has even asked us for help, so we docked one of our warships in their ports and nobody would've ever thought that would happen. China is stealing our technology left and right. They are forcing companies that do business in China to turn over our technology. The President seems to want to confront this and address this, but again, the media, Congress, not so much. PALIN: Well, out of those entities that you mention, maybe the President is the only one who is aware that China is not even shy about their intentions, which is ultimately, it's world dominance and China has even named their plan, and it's the One Road, One Belt, you know, how they believe that they are going control, not just all of the parts and pieces of things that the rest of the world needs to function, including material for our own infrastructure, but also now, China is saying, \"Oh, we are also going to control the way that the things they manufacture are transported,\" and that's water ways, and that's via landmass that ultimately covers two thirds of the world's population. Maybe the President is the only one understanding what China's ultimate goal is even though China is telling us pretty clearly. LEVIN: And he seems to be doing things prior Presidents wouldn't do, and I a mean that in a very positive way, in other words, he is confronting China. He is confronting Russia, North Korea -- the outrageous Iran deal, and I could be wrong, I think he's going to kill it and I think he should, why do you think the Obama administration was at best, passive and at worst, contributory to this kind of really, outrageous foreign policy? PALIN: Right, well, the Obama administration was full of those people who believe in globalization that America is just like every other country. You know, we don't have anything special, we are not exceptional. Our constitution wasn't inspired by those things that time-tested truths proved will work. No, we are just like everybody else. So, they had to kind of diminish America's standings. I think that's the bottom line about that administration. But yes, in the past, too many people have been beholden to special interest that actually profit from an agenda like the Obama administration was having us on. But yes, as for the particulars there with North Korea and with that Iran deal, isn't it ironic that here, under Bill Clinton, it was nukes for North Korea and under Obama, you know nukes in Iran. Under Hillary, it was our uranium being sold to the Russians and yet, they are all claiming that it's President Trump who wants to have nuclear war. No, if anything, it was past agendas that were based on special interests that have gotten us into the pickle that we are in and that is kind of some diminished power of America that President Trump is trying to grow again for the right reasons. LEVIN: Did you like his recent appointments? Of Pompeo for State and Bolton as National Security Adviser? PALIN: I don't know either one personally, but reading a lot of Bolton's past work and what he is really a proponent of, I am thankful that he is all about, you know, US sovereignty and power. I am not the war hawk that maybe some people would think that you know, hard-core Republican would be, and that's because I see what war does to an individual, to a family. War is hell and I don't want America to go to war. And I believe in the old Reaganism that we can show strength and then have peace, and of course some criticism about Bolton is he is such a hawk, but I believe he is wise enough to know that we will exert our power only when necessary. Military power is the very last option. LEVIN: Well, the Russians seem to be very nervous about him. So are the Chinese and the Iranians. PALIN: So, that is a good sign then right, and you know, it is Trump's team. He is the leader of the team and he has every right and responsibility to have his team members around him. LEVIN: Which is the point. He will make the final decision and people will give advice. You know, I have known John Bolton for 30 years and you know, he was our UN Ambassador for a period of time. The Democrats blocked him from getting a permanent position and he worked in the Reagan administration at the Department of Justice under Ed Meese. He worked in the Bush administration at the State Department and so forth and all these attacks on him, I don't remember him being a hothead. I don't remember him wanting to go to war. You talk about make America great again and America first in terms of foreign policy, that's John Bolton. PALIN: My response to you about, well, I hope he's not a war hawk. That's an example then of even someone very informed, someone obsessed with current events and history and politics not knowing quite how to judge someone because too much of my judgment comes from what I see on TV and hear on the radio from others who want me and others to believe that he's not the right person. So, you know, it's a lesson too for all of us, for me, for everybody to do our homework, to really dive into these issues and these people and what they stand for before we do make judgments. LEVIN: Don't forget, folks, LevinTV every weeknight on CRTV.com, give us a call and sign up, 844-LEVIN-TV. 844-LEVIN-TV. We'll be right back. LEVIN: Welcome back. I am with Governor Palin. Governor Palin, this horrific killing in Florida. You see another one at the YouTube headquarters. There have been killings before and it almost immediately triggers or spurs this anti Bill of Rights, anti Second Amendment movement, and this time, it really has kicked into gear where even critics are being attacked and so forth and so on and the media seems to be behind this. I know you are a proponent of gun rights as am I. What do you make of this? PALIN: It is always to be expected after such a tragedy. Unfortunately, it becomes politicized right off the bat and the left goes after the good guys who want to protect our Second Amendment and want to protect themselves via that tool -- firearms. The left just kind of lumps us all in together as being I guess, a surrogate of or that shooter being a surrogate of us, of our thinking that our Bill of Rights and our Constitution is our perfect blueprint. And that's quite unfortunate. It's to be expected though, and that is why those who do say they are proponents of the Second Amendment can't cave. They need to expect what's coming, the rhetoric, the attacks, the criticisms and you know, just deal with it, but stand strong on the Constitution and the Bill of Rights. LEVIN: And yet, I find it interesting and troublesome that when you talk about having people in the schools that can defend the children who obviously can't defend themselves, whether they are ex-military, police officers, ex-police officers, trained personnel like teachers like they have in Israel and so forth, you are said to be introducing too many guns into the school system. Don't we have people who protect us at airports? Don't we have marshals on our planes? When you go to a sporting event, do we have people who are trained and armed to protect us? Why do they take that position, do you think? PALIN: Yes, talk about hypocritical and double standards. Yes, we have every right -- we have God-given right that's codified in our Bill of Rights to protect ourselves and to protect our property and our families and it's not just a select few that government will choose who gets to be protected -- the movie stars, the politicians in DC, those in the courthouse -- no, you know, the Bill of Rights does apply to every single citizen of the US. LEVIN: When retired Supreme Court Justice John Paul Stevens who wrote the, I mean in our opinion, the Heller decision, in which the court held that you do have a right to protect yourself with a weapon. And that was a five-four decision and you see are fundamental rights really do hang in the balance with one vote here or one vote there. It's a fundamental right if we have five votes, and it is not a fundamental right if they have five votes. LEVIN: Which seems absurd on its face, but it shows you how close we came to the undoing of the Second Amendment by the courts. Do you think the courts are too powerful? PALIN: I think the courts today ignore their role as a third branch. I think that they -- too many judicial activists try to take over other branches of government and it's our responsibility though to not allow them to do that and we do that by voting for representatives who will make sure that we have an administration that doesn't appoint judicial activists and, yes, things certainly have gotten out of control there. It tells us, as we say, how important our vote is. And you know, the midterms, coming up here in seven months, what the monumental vote will result in is our House of Representatives, one third of the Senate, 36 Governor seats across the nation plus all the Attorney General seats and legislative and local government seats. The vote is monumental because ultimately, our representatives whom we do vote for are the ones who can appoint the people or you know, block the people from these judicial appointments that make such important decisions. So, coming up, the vote being so important and people need to know that you know, it's on their shoulders. You know, they have got to be the ones out there making their voice heard. LEVIN: All right, we'll be right back. LEVIN: Governor Palin, we have a Special Counsel running around, we have congressional committees, we have the perversion of the FISA court, we have got this dossier that was funded by the Democrats with Russian input and so forth and so on. And if the Democrats take the House, everybody is concluding that they might try to impeach the President of the United States. Have you ever seen anything like this? PALIN: I think this is unprecedented. All of those elements of a perfect storm against the will of the people having elected a President to get rid of the status quo, and make America great again. Yes, there is a lot going on. There's a lot of abuse going on. There's so much corruption going on and I think a lot of that will come to the surface, hopefully soon because these investigations to nowhere and all these resources being spent on things that thus far are proving to be futile and proving to be jus attacks at individuals. So much of this is such a waste of time and such a huge distraction which is a lot of their goal is to distract the people from the issues that really matter. LEVIN: You know, when it came to Hillary Clinton and the Espionage Act and the violations of classified documents and so forth, these same elements within the FBI and the Justice Department did everything they could to brush it under the rug. I mean, this is quite serious when we have a government that functions like the. PALIN: Very scary and very scary to see what perhaps has happened the FISA court, with an unwarranted spying on American citizens that was allowed under some FISA rulings, and to consider that we have these weaponized agencies, against the people. We saw what happened with the IRS and DOJ and FBI, and you know, it's this alphabet swamp there in DC that the President is trying to drain and cleanup. So, it's been good, not only in terms of his candidacy but his Presidency, to be able to rip the veil off this system -- power and wealth corrupt system, people now can see what is going on which is good because now we can do something about it. LEVIN: And so I guess one of the things you would say is, \"You better hold onto that House of Representatives, Republicans and you people, even though you're upset with them, this is a different ballgame. We're talking about preserving the President as President.\" PALIN: Right. People need to realize that the next vote -- I mean, we are talking about whether we block nominees or not, we are talking about subpoena power. We are talking about all these ramifications of the House of Representatives vote that's coming up. Yes, so people need to paying attention and doing their homework and become educated activists. LEVIN: We'll be right back. (COMMERCIAL BREAK) LEVIN: Welcome back. Governor, the Iditarod and the iron dog. I don't even know what I am talking about. These are things you are doing in Alaska. This are things your husband do, tell me about them. PALIN: They are hard-core endurance athletic events. One involves dogs -- the dog machine, a thousand miles across Alaska and another involves snow machines, 2,000 miles across Alaska. It's kind of an example of the hard core tough things that toughened me up as an Alaskan and let you know that if you can accomplish things like those endurance events, you can put up with anything. LEVIN: Now, Todd hurt himself, actually in one of these events, didn't he? PALIN: Oh, yes. They crash a lot and Todd had one major crash, but no, he's still out racing. He is still out doing his thing. In fact, that's why he's not here today because the snow is still really good in Alaska. Good in terms of it is deep and you can still do a lot of things in the snow. LEVIN: And something took place in a recent bill, and I know you were fighting for it and that is more drilling. PALIN: Yes. LEVIN: Right, tell us about that. PALIN: Well, ANWR is open, so Alaskans are grateful. America should be grateful. You know, we are the Fort Knox of a lot of natural resources up there that need to be responsibly exploited, so we more and more independent. When we talk about natural resources and God's creation that can be responsibly used for mankind, America has got it all. We don't have to rely on any other nation. We're talking economic security and national security, militarily even. The more independent we are, the safer we are and the more prosperous we are. There's an inherent link between oil and security and natural gas and economic prosperity. That inherent link, I think that this administration, thank God, this new administration gets it and they are going to do all that they can to make sure we are responsibly using natural resources. LEVIN: And many people that don't live in Alaska may not know that when we talk about ANWR, we are talking about a speck. Really, Alaska is so big, we are talking about a speck, and so the people who don't want drilling there really are the radical extremists. Listen, I want to thank you so much for coming. It's been a great pleasure. PALIN: Thanks. LEVIN: You can join us next week right here, \"Life, Liberty & Levin\" next time. Thanks for joining us. Content and Programming Copyright 2018 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2018 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.",
      "date": "April 8, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin responds to McCain's regrets revealed in new book",
      "url": "https://www.foxnews.com/politics/sarah-palin-responds-to-mccains-regrets-revealed-in-new-book",
      "subtitle": "Sarah Palin responds to McCain's regrets revealed in new book",
      "author": "Amy Lieu",
      "content": " Sarah Palin, the former Alaska governor and John McCain’s 2008 running mate, reportedly said she feels a “perpetual gut-punch” every time she hears about McCain’s regret in picking her for his team. “That’s not what Sen. McCain has told me all these years, as he’s apologized to me repeatedly for the people who ran his campaign,” Palin told The Daily Mail. She said over the years, \"I stop him all the time and say, 'Please don't apologize.'\" McCain wrote in his book, “The Restless Wave,” that he regretted not choosing his friend, Connecticut Senator Joseph Lieberman, as his running mate, calling it “another mistake that I made,” according to The New York Times. McCain reportedly wrote that his advisers warned him against picking a vice-presidential candidate who caucused with Democrats. His advisers picked Palin, the Alaska governor and Tea Party favorite. “I attribute a lot of what we're hearing and reading regarding McCain's statements to his ghostwriter or ghostwriters,” Palin said. “I don't know unless I heard it from Sen. McCain myself.”",
      "date": "May 11, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez compares Sarah Palin to 'grandpa emails' in Twitter feud",
      "url": "https://www.foxnews.com/politics/ocasio-cortez-targets-sarah-palin-in-tweet-after-former-alaska-gov-mocked-her",
      "subtitle": "Alexandria Ocasio-Cortez compares Sarah Palin to 'grandpa emails' in Twitter feud",
      "author": "Elizabeth Zwirz",
      "content": " Newly elected Rep. Alexandria Ocasio-Cortez and former Alaska Gov. Sarah Palin are trading barbs on Twitter. “Now that’s *TWO* fallen GOP Vice Pres candidates going after a freshman Congresswoman that’s not even sworn in yet,” Ocasio-Cortez tweeted. “Isn’t it a little early to be bringing out the big guns? Especially when they look like the FWD:RE:FWD:WATCH THIS grandpa emails from the ‘08 election they lost.” The spat began after Palin, running mate to Republican presidential candidate John McCain in 2008, tweeted on Monday: “YIKES: Ocasio-Cortez Fumbles Basic Civics TWICE In 1 Statement.” Palin’s tweet came alongside an article from governorpalin.org, which included a screenshot of a Twitter post from Ryan Saavedra, a reporter at The Daily Wire. The reporter on Sunday evening shared a video of Ocasio-Cortez making a mistake when talking about the government. “If we work our butts off to make sure that we take back all three chambers of Congress — uh, rather, all three chambers of government: the presidency, the Senate, and the House in 2020, we can’t start working in 2020,”’ Ocasio-Cortez is heard saying on the video. Ocasio-Cortez fired back, turning the conversation to health care. “Maybe instead of Republicans drooling over every minute of footage of me in slow-mo, waiting to chop up word slips that I correct in real-tomd (sic), they actually step up enough to make the argument they want to make: that they don’t believe people deserve a right to healthcare,” she tweeted. OCASIO-CORTEZ SAYS PEOPLE KEEP MISTAKING HER FOR A CAPITOL HILL INTERN She later tweeted a correction of the spelling of “real-time.” In a follow-up to her retort aimed at Palin, Ocasio-Cortez revealed on Twitter Tuesday that the other vice presidential candidate she had been referring to was “Lieberman,” seemingly referring to 2000 Democratic vice-presidential candidate Joe Lieberman. She later tweeted: “For those who need their jokes explained to them: surprise! This tweet thread is humorous! The emoji in the original tweet signals that humor is indicated in the statement. :) (You know, because Lieberman killed the public option for healthcare and endorses Republicans).” Ocasio-Cortez, the 29-year-old Democratic socialist from New York, defeated her Republican challenger earlier this month in the midterm elections, becoming the youngest female elected to Congress. Fox News’ Dom Calicchio contributed to this report.",
      "date": "November 20",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin’s daughter Willow reveals pregnancy on Instagram: ‘Excited to welcome TWO little babies’",
      "url": "https://www.foxnews.com/entertainment/sarah-palins-daughter-willow-pregnant-twins",
      "subtitle": "Sarah Palin’s daughter Willow reveals pregnancy on Instagram: ‘Excited to welcome TWO little babies’",
      "author": "Ann W. Schmidt",
      "content": " Sarah Palin is expecting two more grandchildren by the end of this year. The former governor of Alaska’s second-eldest daughter, Willow Bailey, announced Monday that she is pregnant with twins. “@rickyb901 and I are so excited to welcome TWO little babies into this world!” the 24-year-old wrote on Instagram with the hashtag: “#TWINS.\" JESSA DUGGAR, BEN SEEWALD ANNOUNCE BIRTH OF THIRD CHILD WITH ADORABLE PHOTO: ‘WE’RE SO GRATEFUL TO GOD’ The announcement was accompanied by a picture of various plant branches, an ultrasound, what appears to be two folded onesies and a framed sign with the words: “And then there were four. Baby Bailey’s arriving December 2019.” Palin commented on the post with a series of emojis and the words: “ECSTATIC & BLESSEDx2” in all caps. Willow’s younger sister Piper also commented on the post, saying: “So excited!!!!!” The 55-year-old politician also posted about the pregnancy announcement with a video montage showing various stages of her daughter and son-in-law’s relationship. She captioned the video by saying: “Now ask me if Ricky-n-Willow are having a boy or girl................... Maybe ONE OF EACH‼️ Blessedx2 #TWINS.” JOHNNY GALECKI AND HIS GIRLFRIEND REVEAL THEY’RE EXPECTING A BABY BOY Willow reportedly gave a shout out to Piper on her Instagram story, saying her younger sister gave her the two onesies featured in her pregnancy announcement. \"@piper.p always coming through with the presents and the set up of this pic,\" she wrote on her story, according to DailyMail.com. \"Everyone needs a pipe in their life.\" CLICK HERE FOR THE FOX NEWS APP The twins will be Willow’s first children. She and her husband Ricky were married in October 2018.",
      "date": "May 28",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin not invited to McCain funeral: reports",
      "url": "https://www.foxnews.com/politics/sarah-palin-not-invited-to-mccain-funeral-reports",
      "subtitle": "Sarah Palin not invited to McCain funeral: reports",
      "author": "Dom Calicchio",
      "content": " In 2008, she was chosen to be his running mate – potentially just a heartbeat away from the presidency. But now former Alaska Gov. Sarah Palin, like President Trump, has been left off the list of invitees to the funeral of the late U.S. Sen. John McCain, according to multiple reports. “My guess is, it came from Cindy,” a source close to the McCain family told People magazine, referring to the late senator’s widow. “She is very protective of John’s memory and legacy. She’s also a grieving widow. I think she wants to get through this as best she can.” The message was sent through an intermediary, not directly from the McCain family, according to the report. An NBC reporter tweeted that a Palin \"family source\" said, “Out of respect to Senator McCain and his family we have nothing to add at this point. The Palin family will always cherish their friendship with the McCains and hold those memories dear.” Palin did not immediately respond to a Fox News email sent early Thursday. A decade ago, it was McCain’s selection of Palin to be his vice president that catapulted Palin to the national political spotlight from relative obscurity in Alaska. But their relationship quickly grew strained, amid accusations that Palin was often unprepared for media interviews, or had “gone rogue” by ignoring the advice of McCain campaign handlers. Some critics charged that Palin was more interested in advancing her own career – and popularity among conservative voters -- than assuring the success of the McCain-Palin ticket, led by the more moderate McCain. In May, McCain published a book titled “The Restless Wave,” in which he wrote that he regretted choosing Palin as his running mate instead of his close friend, former U.S. Sen. Joe Lieberman of Connecticut. McCain and Palin ultimately lost the White House in 2008 to Barack Obama and Joe Biden. Ironically, Biden is scheduled to speak Thursday at a McCain memorial service in the senator’s home state of Arizona, while Obama has been invited to deliver a eulogy Saturday at a McCain memorial service in Washington, D.C. Following McCain’s death from brain cancer last Saturday at age 81, Palin issued a pair of Twitter messages. “Today we lost an American original,” she wrote. “Sen. John McCain was a maverick and a fighter, never afraid to stand for his beliefs. John never took the easy path in life - and through sacrifice and suffering he inspired others to serve something greater than self.” Later, she wrote: “John McCain was my friend. I will remember the good times. My family and I send prayers for Cindy and the McCain family.”",
      "date": "August 30, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin says it was a 'gut punch' to be excluded from McCain funeral",
      "url": "https://www.foxnews.com/politics/sarah-palin-says-it-was-a-gut-punch-to-be-excluded-mccain-funeral",
      "subtitle": "Sarah Palin says it was a 'gut punch' to be excluded from McCain funeral",
      "author": "Brooke Singman",
      "content": " Sarah Palin says it was a “gut punch” not to be invited to the funeral of her 2008 running mate, the late Sen. John McCain, last year. Palin, who was tapped as McCain’s pick for vice president during the 2008 race, opened up about the funeral during an interview on “Good Morning Britain.” TRUMP RIPS INTO MCCAIN'S LEGACY, SUPPORT FOR IRAQ WAR DURING SPEECH TO OHIO PLANT WORKERS “I was kinda surprised to be publicly disinvited to the funeral. I think that was an unnecessary step,” Palin told Piers Morgan. “They didn’t have to embarrass me and embarrass others. That was all weird. I hope that doesn’t happen to other people. It’s kind of a gut punch.” McCain, who died last August from brain cancer, reportedly planned his own funeral. According to reports, Palin learned she was not invited to the services through an intermediary, not directly from the McCain family. A Palin family source, at the time, told NBC News that, “Out of respect to Senator McCain and his family we have nothing to add at this point. The Palin family will always cherish their friendship with the McCains and hold those memories dear.” But last May, McCain published a book titled “The Restless Wave,” in which he wrote that he regretted choosing Palin as his running mate instead of his close friend, former U.S. Sen. Joe Lieberman of Connecticut. DONALD TRUMP'S FEUD WITH MCCAIN FAMILY ESCALATES: 'I WAS NEVER A FAN' When he died, Palin posted a pair of tweets touting McCain and his record. “Today we lost an American original,” she wrote. “Sen. John McCain was a maverick and a fighter, never afraid to stand for his beliefs. John never took the easy path in life - and through sacrifice and suffering he inspired others to serve something greater than self.” Later, she wrote: “John McCain was my friend. I will remember the good times. My family and I send prayers for Cindy and the McCain family.” Meanwhile, McCain also reportedly requested that President Trump not attend his funeral, and instead, send Vice President Pence. Last month, Trump tore into McCain’s legacy and took credit for the late senator’s state funeral in Washington last year. “I endorsed him at his request, gave him the kind of funeral he wanted, which as president of the United States I had to approve,” Trump said. “I don’t care, but I didn’t get a thank you.” He added: “I never liked him much. I really probably never will.” Trump’s attacks on McCain drew a rebuke from Republicans, who defended the late senator and his accomplishments. Fox News’ Dom Calicchio and Andrew O’Reilly contributed to this report.",
      "date": "April 2",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "",
      "url": "",
      "subtitle": "",
      "author": "",
      "content": "",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin's Moose Chili",
      "url": "https://www.foxnews.com/food-drink/sarah-palins-moose-chili",
      "subtitle": "Sarah Palin's Moose Chili",
      "author": "",
      "content": "“The toppings make the chili. We use shredded cheese and dollops of sour cream atop each bowl. I set out chopped onions as another option. Todd and the other guys in the family tend to go for Pilot Bread to dip into their chili. It’s also called Sailor Boy. It’s a thick, round dry wafer that is one of our most versatile foods. You can spread peanut butter or Spam on it, and you’ll find this staple in every tackle box or cooler up north. I don’t believe these crackers ever expire. Others prefer tortilla chips to sprinkle on top,\" says the former Governor of Alaska. Cook Time:1 hours Prep Time:30 min Total Time:1 hours30 min Servings: 8 1 pound moose hamburger (or caribou or beef) 1 pkg of regular chili seasoning mix 1 pkg of hot chili seasoning mix 2 16-ounce cans of tomato sauce 8 16-ounce cans of kidney beans Over a medium flame brown the meat in a large stove top pan. Once it is browned, transfer the meat to a Crock-Pot if you are using one. Add the chili seasoning mixes, tomato sauce and drained kidney beans. Reserve half the liquid if a thinner chili is desired. Stir the chili, bring to a boil, and then simmer for at least one hour. Serve with your favorite toppings like cheese, sour cream, green onions or more. Enjoy.",
      "date": "January 26, 2015",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin says her house is damaged from Alaska earthquake",
      "url": "https://www.foxnews.com/politics/sarah-palin-says-her-house-is-damaged-from-alaska-earthquake",
      "subtitle": "Sarah Palin says her house is damaged from Alaska earthquake",
      "author": "Alex Pappas",
      "content": " Former Alaska Gov. Sarah Palin said Friday her house suffered damage from the earthquake that rocked Alaska and expressed relief that her family is safe. “Our family is intact - house is not... I imagine that’s the case for many, many others,” Palin wrote in a tweet asking for prayers for Alaska. “So thankful to be safe; praying for our state following the earthquake.” Palin, the 2008 Republican vice presidential nominee who is from Wasilla, did not elaborate on the extent of the damage to the family’s home. In Anchorage, back-to-back earthquakes measuring 7.0 and 5.8 rocked buildings and buckled roads Friday morning, prompting people to run from their offices or take cover under desks and triggering a warning to residents in Kodiak to flee to higher ground for fear of a tsunami. LARGE ALASKA EARTHQUAKE JOLTS RESIDENTS, SHAKES BUILDINGS The U.S. Geological Survey said the first and more powerful quake was centered about seven miles north of Anchorage, Alaska's largest city. Cracks could be seen in a two-story downtown Anchorage building. It was unclear whether there were injuries. Photographs posted to social media sites showed damage that included collapsed ceiling tiles at an Anchorage high school and buckled roads. One image showed a car stranded on an island of pavement, surrounded by cavernous cracks where the earthquake split the road. The Associated Press contributed to this report.",
      "date": "November 30",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Gov. Palin: I faced tough questions over email, so should Hillary Clinton",
      "url": "https://www.foxnews.com/opinion/gov-palin-i-faced-tough-questions-over-email-so-should-hillary-clinton",
      "subtitle": "Gov. Palin: I faced tough questions over email, so should Hillary Clinton",
      "author": "Sarah Palin",
      "content": " The latest Obama administration scandal involving Hillary Clinton’s emails has many Americans discussing private email accounts used by government officials, and clarification is in order. It’s appropriate and proper for a politician to use private email for personal and campaign business. This is what I did as governor of Alaska in order to be in compliance with the law, which requires that personal or campaign business not be conducted using public resources such as a government email account. There is a firm line separating the two. However, that’s not what we see with this Clinton email scandal. As Secretary of State under Obama, Hillary Clinton used private email accounts on a privately maintained server 100 percent of the time for 100 percent government business. That’s unethical, no doubt illegal, and flies in the face of all claims of transparency. Hillary Clinton and her staff weren’t trying to be in compliance with the law; they were skirting it altogether. Consider, for example, how Secretary Clinton’s private email server makes a mockery of transparency when it comes to Freedom of Information Act (FOIA) requests. First, some background: I know something about how annoying FOIA requests can be for public officials. After I returned home from the 2008 vice presidential campaign, the state of Alaska was flooded with innumerable FOIA requests to see literally every single email I ever wrote while governor. It was an overwhelming request for a small population state with limited resources.  But our system of government relies on transparency, and that means public officials must suck it up and let the public see whatever they want. When FOIA requests bombarded us, investigators and our attorney general’s office were given full access to all of my state and private emails. The only emails redacted were the very few that were protected by attorney/client privilege – a determination agreed upon by my lawyers and the Attorney General’s office who reviewed them. In other words, an independent third party reviewed every email. There was no chance for any “smoking gun” to escape detection because nothing was kept secret in any way. Everything was done in the most transparent way possible. Contrast that with the way Secretary Clinton has handled transparency. She created private email accounts for herself and her staff on a private email server that she controls completely. She hasn’t handed over the server to any independent party for review, and it’s already too late to do so because for all we know someone might have already deleted any trace of incriminating emails to and from Secretary Clinton and her aides. This is the opposite of open and transparent government and obviously doesn’t follow the rules. An honest politician has nothing to fear from the public seeing her emails. I know this. Eventually all but those few redacted emails of mine were released to the public and remain online to this day for anyone to read at any time. In fact, the release of my emails was a great boon for Alaska’s tourism industry because dozens of national reporters descended on Alaska to pour through tens of thousands of pages of my emails looking for some smoking gun. They even crowd-sourced the work out to the general public to help them look for dirt! They were sorely disappointed. All they found was evidence of an administration doing what the people sent us to do – work hard for them. My favorite summary of the email findings came from CNN’s Drew Griffin who reported: “I think what we’re seeing here is a hard-working governor, working hard for the state of Alaska, a lot of discussion about policy, about taxes, about cutting budgets, a lot of just mundane state government work.” So, at least the media and the public learned a lot about conservative governance, responsible resource development, fiscal budgeting, Fish & Game management, and other scintillating topics. But don’t take my word for it. Search the online databases of my emails created by the New York Times, Washington Post, Wall Street Journal, and other national media sources... and be bored. Now many of these same media outfits are pursuing access to Secretary Clinton’s emails. Will they put the same effort into her emails as they did mine? Unfortunately for America, we have no way of knowing what’s already missing from among Secretary Clinton’s emails. In fact, Rep. Trey Gowdy (R-S.C.), chair of the House select committee investigating Benghazi, explained that the emails she submitted to his committee contain huge gaps spanning months. Good luck finding those missing emails. And good luck getting a straight answer from the Obama administration as to why no one in the White House noticed that the Secretary of State wasn’t using a government email account. You’d expect more from the self-described “most transparent administration in history.” And you should demand more from anyone who wants to be president someday.",
      "date": "March 9, 2015",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sacha Baron Cohen thanks Sarah Palin, Dick Cheney for 'Who Is America' Emmy nominations",
      "url": "https://www.foxnews.com/entertainment/sacha-baron-cohen-thanks-sarah-palin-dick-cheney-for-who-is-america-emmy-nominations",
      "subtitle": "Sacha Baron Cohen thanks Sarah Palin, Dick Cheney for 'Who Is America' Emmy nominations",
      "author": "Tyler McCarthy",
      "content": " Actor and noted prankster Sacha Baron Cohen took to Twitter to lambast Sarah Palin and Dick Cheney for appearing on his Emmy-nominated show “Who Is America?” “Who Is America?” saw Baron Cohen don disguises to trick unsuspecting, prominent people into outlandish interviews that he played for comedy. The series landed three Emmy nominations for outstanding variety sketch series as well as directing and editing. The 47-year-old star took to Twitter shortly after the nominations were announced to thank the Television Academy for the accolade. “Thank you to the EMMYs for the nominations for Who Is America. It was a bare-bones production - I went out into the heartland of this country armed only with a camera crew, a makeup kit and my trusted pedophile detector,” he joked. “I want to thank my crack team of researchers told to uncover bigotry, racism and hate in the US. That took them about 30 seconds… they just started following the President.” In follow up tweets, he went on to jab at the former vice president, who he famously tricked into signing a waterboard while posing as an anti-terror expert on the show. “While I am flattered at these nods, it is a shame that my co-stars were not recognized. Particularly Dick Cheney, who I had hoped would come across on camera as someone who’d gleefully sent hundreds of thousands to their pointless death – and boy did he deliver,” he wrote. “I’ve played some lunatics in my time, but the look of vacuous evil in his eyes as he autographed a waterboard kit, would put Daniel Day Lewis to shame.” Finally, the comedian mentioned Sarah Palin, who previously complained about being “duped” by Baron Cohen who was allegedly claiming to be a disabled U.S. Veteran. “There’s one more person I need to thank even though she didn’t appear in the final project, Sarah Palin. Sarah, if you are out there, and you are WAY out there, please know the last time unseen footage generated as much interest, was when Donald Trump visited a Moscow hotel room,” he wrote.",
      "date": "July 16",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin and husband, Todd, apparently getting a divorce, court papers indicate",
      "url": "https://www.foxnews.com/politics/sarah-palin-and-husband-todd-apparently-getting-a-divorce-documents-show",
      "subtitle": "Sarah Palin and husband, Todd, apparently getting a divorce, court papers indicate",
      "author": "Andrew O'Reilly",
      "content": " After 31 years of marriage, former Alaska Gov. Sarah Palin and her husband, Todd, are apparently calling it quits. Court papers appear to show that Todd Palin filed for divorce Friday from his wife - and the 2008 Republican vice presidential nominee – Sarah Palin in the Anchorage Superior Court with the Anchorage Daily News reporting the reason being “incompatibility of temperament between the parties such that they find it impossible to live together as husband and wife.” MATT LAUER AND ANNETTE ROQUE OFFICIALLY DIVORCED The news of the divorce was first reported by Alaska blogger Craig Medred, who noticed that the court filing records only indicated a certain TMP was seeking a divorce from a certain SLP. The former governor’s full name is Sarah Louise Palin, while her husband’s name is Todd Mitchell Palin. The birthdays of the plaintiff and defendant in the court filing also align with those of Todd and Sarah Palin. The couple is reportedly seeking joint custody of their 11-year-old son,Trig, while their other four children — Bristol, Willow, Piper and Track — are all adults. The Palins, who surged to national prominence when the late Sen. John McCain, R-Ariz., selected the Alaska governor as his running mate in the 2008 presidential election against Barack Obama and Joe Biden, have faced rumors of a strained relationship. CLICK HERE TO GET THE FOX NEWS APP Rumors of a divorce once again began to swirl when Todd failed to show up alongside Sarah last month during an appearance at the famed Sturgis motorcycle rally in South Dakota. Sarah Palin said that her husband – a well-known motorsport enthusiast and Irondog snowmachine race winner – was flying around Alaska, according to reports. Since resigning as governor in 2009 amid controversies and ethics investigations, Palin has largely remained out of state politics, but has become a prominent figure in conservative politics – penning a number of books and making frequent appearance on television and during speaking engagements.",
      "date": "September 9",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    }
  ]
}