{
  "articles": [
    {
      "title": "Ocasio-Cortez accuses border officers of ‘violent culture’ after report on graphic Facebook posts",
      "url": "https://www.foxnews.com/politics/ocasio-cortez-accuses-border-officers-of-violent-culture-after-report-on-graphic-facebook-posts",
      "subtitle": "Ocasio-Cortez accuses border officers of ‘violent culture’ after report on graphic Facebook posts",
      "author": "Alex Pappas",
      "content": " New York Rep. Alexandria Ocasio-Cortez accused U.S. Customs and Border Protection of having a “violent culture” and questioned how officers treat migrants after a report surfaced Monday about a secret Facebook group where Border Patrol agents purportedly posted graphic and vulgar jokes about the Democratic lawmaker as well as illegal immigrants. CONSTRUCTION OF BORDER WALL PANELS UNDERWAY IN CALIFORNIA “This isn’t about ‘a few bad eggs,’ Ocasio-Cortez said in a series of tweets. “This is a violent culture.” The website ProPublica posted a story Monday headlined “Inside the Secret Border Patrol Facebook Group Where Agents Joke About Migrant Deaths and Post Sexist Memes.” In addition to showing indifference toward the deaths of migrants, members made vulgar jokes about Ocasio-Cortez and other members of the Congressional Hispanic Caucus ahead of their visit a Border Patrol facility in Texas on Monday, the story said. In one post reported by ProPublica, a group member referenced the visits by Democrats and encouraged an officer to throw a “burrito at these b-----s.” Other posts included a vile, fake photo illustration of Ocasio-Cortez engaged in oral sex with President Trump. “They’re threatening violence on members of Congress,” Ocasio-Cortez tweeted. “How do you think they’re treating caged children+families?” The U.S. Customs and Border Protection condemned the posts. “These posts are completely inappropriate and contrary to the honor and integrity I see—and expect—from our agents day in and day out,\" U.S. Border Patrol Chief Carla Provost said in a statement to Fox News. \"Any employees found to have violated our standards of conduct will be held accountable.” Matthew Klein, the assistant commissioner of the CBP’s Office of Professional Responsibility, said the Department of Homeland Security’s inspector general opened an investigation on Monday. \"Today, U.S. Customs and Border Protection was made aware of disturbing social media activity hosted on a private Facebook group that may include a number of CBP employees,\" Klein said. \"CBP immediately informed DHS Office of the Inspector General and initiated an investigation.\" ProPublica did not post the names of those who made the vulgar posts. But, the news outlet said the Facebook group was called “I’m 10-15” and had about 9,500 members including current and former border officers. “10-15” is code for “aliens in custody.” Despite the posts, Ocasio-Cortez still visited the Border Patrol facility Monday. \"Just left the 1st CBP facility,\" she tweeted. \"I see why CBP officers were being so physically &sexually threatening towards me. Officers were keeping women in cells w/ no water & had told them to drink out of the toilets. This was them on their GOOD behavior in front of members of Congress.\"",
      "date": "July 1",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Ocasio-Cortez allegedly screamed at border agents during recent trip to southern border: report",
      "url": "https://www.foxnews.com/politics/alexandria-ocasio-cortez-border-agents-southern-border",
      "subtitle": "Ocasio-Cortez allegedly screamed at border agents during recent trip to southern border: report",
      "author": "Nicole Darrah",
      "content": " Rep. Alexandria Ocasio-Cortez, D-N.Y., allegedly screamed at Customs and Border Protection agents \"in a threatening manner\" during a recent visit to a southern border facility in Texas, according to a report — after she made the explosive claim that women being held at at least one facility are being forced to drink \"out of toilets.\" The New York Democrat allegedly became angry with federal agents on Monday in El Paso during a trip to the area with roughly a dozen members of the Congressional Hispanic Caucus, the Washington Examiner reported, citing two witnesses at the location. HOLOCAUST SURVIVOR SAYS OCASIO-CORTEZ SHOULD BE 'REMOVED' FROM CONGRESS FOR SPREADING 'ANTI-SEMITISM, HATRED AND STUPIDITY' “She comes out screaming at our agents, right at the beginning [of the tour] ... Crying and screaming and yelling,\" one witness said. “The agents, they wanted to respond, but they held back because she’s a congressional delegate. But when you have someone yelling at you in a threatening manner … They were like, ‘Hey, you need to kinda step back.’” Ocasio-Cortez, seemingly in response to the report, tweeted: \"To these CBP officers saying they felt ‘threatened’ by me – They were literally discussing making a GoFundMe for an officer who attacked my on my tour.\" She added: \"They confiscated my phone, and they were all armed. I’m 5’4”. They’re just upset I exposed their inhumane behavior.\" The Examiner report claims Ocasio-Cortez refused to tour the facility, as well, choosing to stay with a family in a holding area instead. The freshman rep previously tweeted about her visit to border facilities, writing that people of all ages were being mistreated and were \"drinking out of toilets\" as the guards laughed at the migrants' plight right in front of her. Brian Hastings, deputy chief of Border Patrol, denied Ocasio-Cortez's allegations during an interview on \"The Story.\" He unequivocally stated fresh drinking water is provided to people in custody. Earlier Monday, the congresswoman accused CBP of having a “violent culture” after a report from ProPublica surfaced about a secret Facebook group where Border Patrol agents allegedly posted graphic and vulgar jokes about the Democratic lawmaker as well as illegal immigrants. Some of the posts were graphic, doctored images of Ocasio-Cortez, including one that shows a smiling President Trump forcing her head toward his crotch. Other comments refer to Ocasio-Cortez and Rep. Veronica Escobar, D-Texas, as \"hoes,\" and one member encouraged agents to throw a \"burrito at these b------.\" HISPANIC PASTORS TOUR BORDER FACILITY LAMBASTED BY AOC AND SAY THEY ARE ‘SHOCKED BY MISINFORMATION’ Ocasio-Cortez said she wasn't surprised by the posts, especially after the treatment of migrants she said she witnessed at the facility. \"It's just indicative of the violent culture that we saw,\" she said. The purported posts were slammed by the head of Border Patrol on Monday as \"completely inappropriate.\" CLICK HERE TO GET THE FOX NEWS APP \"These posts are completely inappropriate and contrary to the honor and integrity I see — and expect — from our agents day in and day out,\" Border Patrol Chief Carla Provost said. \"Any employees found to have violated our standards of conduct will be held accountable.\" Fox News' Nick Givas and The Associated Press contributed to this report.",
      "date": "July 2",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Rep. Ocasio-Cortez tweets claim that 'powerful people are trying to bribe' Trump into war",
      "url": "https://www.foxnews.com/politics/ocasio-cortez-trump-bribe-war-iran-twitter",
      "subtitle": "Rep. Ocasio-Cortez tweets claim that 'powerful people are trying to bribe' Trump into war",
      "author": "Anna Hopkins",
      "content": " Democratic Rep. Alexandria Ocasio-Cortez, D-N.Y., suggested in a tweet Friday that \"powerful people\" are attempting to bribe President Trump into war with Iran. Rep. Ocasio-Cortez quoted a tweet by Washington Post reporter David Fahrenthold which linked to an article that revealed documents obtained from Trump hotels. According to the Post's report, an Iraqi sheik reportedly stayed at a suite in Trump's hotel in Washington D.C. for 26 days after urging the Trump administration to take a \"hard-line\" approach towards Iran in July 2018. \"Sure looks like powerful people are trying to bribe the President into war,\" Rep. Ocasio-Cortez wrote. AOC EXPRESSES OPTIMISM ON 'SUPER-BIZARRE' LEGISLATIVE ALLIANCE WITH TED CRUZ: 'I'M ENCOURAGED' AOC TAKES AIM AT RAHM EMANUEL ON TWITTER AMID REPORTS HE'S JOINING WALL STREET INVESTMENT BANK Rep. Ocasio-Cortez's tweet garnered more than 30,000 likes and 7,000 retweets in under five hours, but responses to her statement were varied. Concerns about escalating tensions between the United States and Iran prompted Secretary of State Mike Pompeo to proclaim that the Trump administration is ready to sit down with Iran's leaders for a conversation with \"no preconditions.\" He added, however, that \"the American effort to fundamentally reverse the malign activity of this Islamic Republic, this revolutionary force, is going to continue.\" CLICK HERE TO GET THE FOX NEWS APP President Trump has consistently maintained that he does not want to resort to military intervention to respond to \"credible threats\" from Iran but will do so if it becomes necessary.",
      "date": "June 7",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez eyes powerful House committee in charge of taxation laws",
      "url": "https://www.foxnews.com/politics/alexandria-ocasio-cortez-eyes-powerful-house-commitee-in-charge-of-taxation-laws",
      "subtitle": "Alexandria Ocasio-Cortez eyes powerful House committee in charge of taxation laws",
      "author": "Lukas Mikelionis",
      "content": " Congresswoman-elect Alexandria Ocasio-Cortez has not yet been sworn into Congress, but she’s already eyeing a seat at one of the most powerful House committees in charge of taxation laws. The Democratic Socialist’s spokesperson confirmed to Vice News that she will seek a seat on the House Ways and Means committee, which is traditionally packed with seasoned legislators with experience in writing tax code. Rep. Joe Crawley, the top Democrat who was unseated by Ocasio-Cortez this year, was among the members of the committee. She is eyeing the exact same seat that is customarily reserved for New York City. The effort to get on the committee indicates the progressive Democrats’ growing ambition to bring forward actual progressive bills to the vote, as the committee is instrumental in making that happen. Ocasio-Cortez, together with other freshmen Democrats, has been pushing for grand policies, including Medicare for All and the Green New Deal. Both measures would need to go through the committee before it could be subjected to a vote. But the Democratic leadership may not be so quick to embrace the rising star of the party and instead opt out for a centrist Democrat who would utilize the membership of the committee better. Rep. Tom Suozzi, who represents New York’s 3rd district, is also eyeing for the seat, the Intercept reported. He’s deemed a more conservative Democrat, who doesn’t share the hostility of corporations with the progressive wing of the party. “I’m very progressive on a lot of different issues, in support of the Green New Deal, immigration, both those issues, as well as on issues related to poverty,” he told the outlet. “Am I fiscally conservative? Yes, I’m fiscally conservative.” OCASIO-CORTEZ CALLED OUT FOR CLAIMING PENTAGON $$ ERROR COULD FUND MEDICARE FOR ALL Ocasio-Cortez's bid for a seat at the committee may also raise some eyebrows following a number of blunders concerning policies she’s advocating. She was recently called out by various fact checkers for suggesting that a reported $21 trillion in Pentagon accounting errors could fund most of her proposed “Medicare for all” health care program. Multiple fact-checkers and even liberal publications that provide sympathetic coverage of the New York Democrat, slammed her suggestion, noting that The Pentagon’s accounting errors aren’t actual sums of money that could be spent on other programs. The Washington Post said the comment was “swing and a miss!” and awarded her claim “four Pinnochios.” For House Speaker-designate Nancy Pelosi, the struggle between Ocasio-Cortez and Souzzi will pose a challenge, as she ultimately decides the committee assignments. Members of Ways and Means typically attracts large donations from industries, according to Intercept, yet this wouldn’t be the case with Ocasio-Cortez because she doesn’t accept donations from corporations, thus putting Democrats at a disadvantage in future elections. OCASIO-CORTEZ: 'MEDICARE FOR ALL' WOULD SAVE 'VERY LARGE AMOUNT OF MONEY,' DESPITE STUDIES SHOWING $30T COST At the same time, Suozzi is a member of the Problem Solvers Caucus that threatened to derail Pelosi’s speakership bid if she doesn’t give in to their demands, while Ocasio-Cortez supported Pelosi. The group ultimately supported Pelosi but only after she agreed to legislative rule changes that will give priority to bipartisan measures, while limiting the influence of the far-right and far-left in Congress. Ocasio-Cortez also previously criticized the caucus, saying they are advocating for “GOP-friendly rules that will hamstring healthcare efforts from the get-go.”",
      "date": "December 6",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Ocasio-Cortez questions Cohen on Trump tax documents, assets",
      "url": "https://www.foxnews.com/politics/ocasio-cortez-questions-cohen-on-trump-tax-documents-assets",
      "subtitle": "Ocasio-Cortez questions Cohen on Trump tax documents, assets",
      "author": "Samuel Chamberlain",
      "content": " Rep. Alexandria Ocasio-Cortez, D-N.Y., on Wednesday asked President Trump's onetime personal attorney Michael Cohen if Trump had intentionally devalued his real estate assets to reduce his tax bills, to which Cohen responded, \"Yes.\" Ocasio-Cortez, a member of the House Oversight Committee, sought to lay the groundwork for lawmakers to potentially subpoena employees of the Trump Organization -- including its chief financial officer, Allen Weisselberg, who Cohen said was privy to Trump's various money maneuvers and who received immunity from federal prosecutors in New York to testify against Cohen prior to the attorney's guilty plea on federal campaign finance violations last August. \"What you do is, you deflate the value of the asset and then you put in a request to the tax department for a deduction,\" said Cohen when Ocasio-Cortez asked how Trump attempted to reduce his tax burden. FLASHBACK: TRUMP ORGANIZATION CFO ALLEN WEISSELBERG GRANTED IMMUNITY IN COHEN CASE \"And would it help for the committee to obtain federal and state tax returns from the president and his company to address that discrepancy?\" Ocasio-Cortez asked. \"I believe so,\" Cohen answered. The freshman congresswoman cited an August 2016 Washington Post report. That report claimed Trump had argued that his golf course in Jupiter, Florida. was worth \"no more than $5 million\" for tax purposes despite informally valuing the property at more than $50 million. When asked if the report was true, Cohen said that Trump had used an \"identical\" tactic at his golf club in suburban Westchester County, New York. TRUMP REAPED MILLIONS IN SHADY TAX SCHEMES FROM FATHER'S BUSINESSES, REPORT SAYS In response to questioning from another lawmaker, Cohen said that he had seen Trump's tax returns, but has not gone through them. Trump broke with decades of tradition for presidential candidates by refusing to release his income tax filings during his 2016 campaign. He has said he won't release them because he is being audited, but Cohen said he never received any documentation to support Trump's claim. CLICK HERE TO GET THE FOX NEWS APP Cohen also said that CFO Weisselberg would be best placed to confirm a bombshell New York Times report from October 2018 that Trump and his siblings set up a phony corporation in the 1990s to disguise millions of dollars in gifts from their parents. The report also stated that Trump helped his father take millions in improper tax deductions and formulated a strategy to undervalue his parents’ real estate holdings to cut the tax bill when the properties were transferred. Fox News' Andrew O'Reilly and The Associated Press contributed to this report.",
      "date": "February 27",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "PETA asks Ocasio-Cortez to promote ‘healthy vegan’ food policies",
      "url": "https://www.foxnews.com/politics/peta-asks-ocasio-cortez-to-promote-healthy-vegan-food-policies",
      "subtitle": "PETA asks Ocasio-Cortez to promote ‘healthy vegan’ food policies",
      "author": "Stephen Sorace",
      "content": " The animal rights group People for the Ethical Treatment of Animals (PETA) has sent a letter to Rep. Alexandria Ocasio-Cortez, D-N.Y., praising her push for a Green New Deal and asking the congresswoman to promote more vegan food policies. The combative activist group made its case to Ocasio-Cortez to help it “reclaim the Earth.” It wants to limit the country’s dependence on an animal food supply to help curb greenhouse emissions and provide Americans with what the group called “healthful eating.” DESPITE GREEN NEW DEAL PUSH, CLIMATE CHANGE NOT A HIGH PRIORITY FOR PEOPLE IN 2019 “Because animal agriculture not only is devastating to animals but also poisons the environment and makes Americans sick, what we need is a Vegan Green New Deal,” PETA President Ingrid Newkirk said in a statement. “PETA hopes Representative Alexandria Ocasio-Cortez will promote equity, environmental justice, health, and kindness by recognizing the need for vegan food policies.” The Green New Deal proposed by Ocasio-Cortez and other Democrats recently made headlines for a reference to “farting cows.” In a recent TV appearance, Ocasio-Cortez said \"Maybe we shouldn't be eating a hamburger for breakfast, lunch and dinner.\" ALEXANDRIA OCASIO-CORTEZ SLAMMED BY WOMEN'S GROUP FOR QUESTIONING IF IT'S 'OKAY TO STILL HAVE CHILDREN' The unprecedented plan, which calls for a sweeping overhaul of the economy and energy sector over 10 years, comes with an expensive price tag estimated at $93 trillion -- or about $600,000 per household, according to a study by the American Action Forum. Ocasio-Cortez has yet to respond to the PETA letter. CLICK HERE TO GET THE FOX NEWS APP Meanwhile, PETA has recently come under fire for calling fashion designer Karl Lagerfeld  \"our old nemesis\" following his death last week, and again for comments criticizing the late wildlife conservationist Steve Irwin after Google honored him on what would have been his 57th birthday.",
      "date": "February 28",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Melissa Francis says Ocasio-Cortez should ask herself, 'How does taking away furniture help children?'",
      "url": "https://www.foxnews.com/politics/melissa-francis-says-ocasio-cortez-should-ask-herself-how-does-taking-away-furniture-help-children",
      "subtitle": "Melissa Francis says Ocasio-Cortez should ask herself, 'How does taking away furniture help children?'",
      "author": "Charles Creitz",
      "content": " Rep. Alexandria Ocasio-Cortez, D-N.Y., should consider who really gets hurt when she praises a workers' strike at a company supplying beds to border facilities, according to Melissa Francis. The company, Wayfair, must consider its bottom line and not politics to continue operating responsibly, Fox Business host Francis told Tucker Carlson on \"Tucker Carlson Tonight.\" \"I mean, it's idiotic,\" she said. \"Wayfair is a public company first of all -- they are losing money. Their CEO doesn't get to make decisions like that, he has a legal fiduciary responsibility to do best with the shareholders' money, it is not his money. He can't make decisions based on his own politics or his own definition of morality. He has to try to make money for his shareholders. AOC CRITICIZED FOR PROMOTING WORKER STRIKE AT COMPANY SELLING BEDS TO BORDER FACILITIES \"How does taking away furniture help children?... It doesn't.\" The \"After The Bell\" host claimed Congress is to blame for the border crisis. \"Our lawmakers have massively failed us,\" she said. \"This is a huge problem that is enormous because it has festered for so long. There is no easy way to solve it.\" CLICK TO GET THE FOX NEWS APP On Tuesday, both Ocasio-Cortez and Sen. Bernie Sanders, I-Vt., offered their support for Wayfair workers as the CEO refused to halt production. Whereas Ocasio-Cortez saw a means of standing in solidarity with migrants, others suggested the strike was counterproductive in that it halted operations at a company that helped improve the border conditions she has so often decried. \"Her logic is cold, callous, calculated and cruel,\" writer David Marcus said in a Federalist article. \"Rather than compromise in the slightest with the Trump administration, AOC would see children harmed so that Trump gets a black eye and the crisis gets worse,\" he said. Fox News' Sam Dorman contributed to this report.",
      "date": "June 26",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Moderate Dems fume over Ocasio-Cortez ‘list’ threat",
      "url": "https://www.foxnews.com/politics/dem-moderates-fume-over-ocasio-cortez-list-threat",
      "subtitle": "Moderate Dems fume over Ocasio-Cortez ‘list’ threat",
      "author": "Alex Pappas",
      "content": " Moderate Democrats are fuming over New York Democratic Rep. Alexandria Ocasio-Cortez’s closed-door warning last week that Democrats who vote with Republicans are \"putting themselves on a list\" – a comment interpreted as a primary challenge threat. Ocasio-Cortez has since downplayed her comments, made in the wake of 26 Democrats joining Republicans to vote for a provision requiring Immigration and Customs Enforcement to be notified if illegal immigrants attempt to purchase guns. OCASIO-CORTEZ WARNS OF 'LIST' FOR MODERATE DEMS WHO VOTE WITH REPUBLICANS Still, some House Democrats aren’t happy with her talk of a “list.” “I don't think it's productive,” Michigan Rep. Dan Kildee said Saturday on Fox News’ “Cavuto Live.” He added, “I don't think we should be interfering with one another's politics. The people who elected us get to make those choices.” New Jersey Democratic Rep. Josh Gottheimer, a co-chairman of the Problem Solvers Caucus, said Ocasio-Cortez’s use of the word “list” was “Nixonian.” “Being unified means ensuring that Democrats aren’t primary-ing other sitting Democrats,” Gottheimer told The Washington Post. “Since when is it okay to put you on a Nixonian list? We need to have a big tent in our party or we won’t keep the House or win the White House.” The brouhaha began last week when two-dozen moderate Democrats broke from their party's progressive wing and sided with Republicans on a legislative amendment having to do with illegal immigrants and guns. In a closed-door meeting afterward, according to The Washington Post, House Speaker Nancy Pelosi scolded her wayward center-leaning colleagues, telling them: \"We are either a team or we’re not.” Ocasio-Cortez then told fellow Democrats that those who voted with Republicans were \"putting themselves on a list.\" Ocasio-Cortez later claimed she wasn’t talking about a list for primary challenges. “I didn’t say that they were putting themselves on a list for primaries,\" Ocasio-Cortez tweeted. \"I said that by Dems distinguishing themselves by breaking off on procedural…votes, they were inadvertently making a list of targets for the GOP and for progressive advocates on their pro-ICE vote.” Reacting to Ocasio-Cortez's comments, one party strategist who works for moderate Democrats argued Ocasio-Cortez doesn’t “respect” the views of other Democrats who don’t embrace her progressive politics. “My main gripe about AOC is that while I respect her voice in the party, I don't think she respects mine or anyone else's who differs with her on policy or comes from a different political electoral reality,” said John Anzalone, a Democratic pollster in Alabama. There’s been speculation since she was elected to Congress that Ocasio-Cortez could get involved in Democratic primary fights in 2020, especially with the group Justice Democrats signaling plans to primary incumbent Democrats they see as insufficiently progressive. Ocasio-Cortez has been aligned with that group. It's a tactic that has been embraced by some conservative groups and politicians on the right, especially during the 2010 and 2012 elections, when incumbent lawmakers in the House and Senate were ousted in primaries by conservative challengers. Fox News’ Bradford Betz contributed to this report.",
      "date": "March 5",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Mark Steyn: Ocasio-Cortez 'strangely unwoke' on recycling plastic bags",
      "url": "https://www.foxnews.com/politics/mark-steyn-ocasio-cortez-strangely-unwoke-on-recycling-plastic-bags",
      "subtitle": "Mark Steyn: Ocasio-Cortez 'strangely unwoke' on recycling plastic bags",
      "author": "Victor Garcia",
      "content": " Conservative commentator Mark Steyn called freshman Rep. Alexandria Ocasio-Cortez, D-N.Y., \"strangely unwoke\" Thursday after she admitted in an interview that she threw away some of her plastic bags. \"Obviously in a certain sense this is a boutique issue.  We will be arguing about plastic bags at the time Kim Jong Un decides to drop the big one on Cleveland and we will look ridiculous,\" Steyn said on \"Tucker Carlson Tonight.\" \"What's oddly revealing about this is I think Alexandria Ocasio-Cortez comes across as strangely unwoke in this soundbite.\" \"I can be upset that I get 10 plastic bags at the grocery store and then have to toss out my plastic bags, because the recycling program in the area is tough. And that's okay,\" Ocasio-Cortez told Spectrum News NY1.  \"All of these are not reasons to stop fighting, all of these are reasons to keep fighting.\" Ocasio-Cortez's push for the Green New Deal, a much-debated resolution that addresses climate change and renewable energy among other issues, has opened up the congresswoman to scrutiny from the media and critics. The New York Post reported earlier this week that Ocasio-Cortez elected to take a minivan back to her Queens office Sunday instead of the subway, which was less than four blocks away. OCASIO-CORTEZ HIT WITH NEW ETHICS COMPLAINT OVER BOYFRIEND'S EMAIL ACCOUNT \"Living in the world as it is isn’t an argument against working towards a better future,” Ocasio-Cortez tweeted in response to the Post's story. Steyn criticized the congresswoman for not using reusable bags instead of taking the plastic ones. CLICK HERE TO GET THE FOX NEWS APP \"They take out the NPR tote bag and they have all the groceries in it and they don't have to have the plastic bags,\" Steyn told Tucker Carlson. \"There's no reason for this problem.\" \"She sounds weirdly 'unwoke,'\" Steyn reiterated. \"Where is Alexandria's Charlie Rose tote bag? That's what we want to know.\"",
      "date": "March 7",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "House Dem blasts 'juvenile' Ocasio-Cortez, chief of staff: 'Ignorance is beyond belief'",
      "url": "https://www.foxnews.com/politics/democrat-blasts-ocasio-cortez-pelosi",
      "subtitle": "House Dem blasts 'juvenile' Ocasio-Cortez, chief of staff: 'Ignorance is beyond belief'",
      "author": "Sam Dorman",
      "content": "  Rep. William Lacy Clay, D-Mo., added to the mounting Democratic criticism of Rep. Alexandria Ocasio-Cortez, D-N.Y., slamming her \"inappropriate\" suggestion that House Speaker Nancy Pelosi, D-Calif., is singling out the New Yorker and her \"squad\" of fellow freshman because of their race. Speaking to Fox News on Thursday night, Clay hammered Ocasio-Cortez's suggestion. \"It was such a weak argument to say she was being picked on and that four women of color were being picked on by the speaker,\" he said. \"It tells you the level of ignorance to American history on their part as to what we are as the Democratic Caucus. PELOSI RESPONDS TO AOC SLAM, SAYS CAUCUS HAS HER BACK FOR CONDEMNING CHIEF OF STAFF'S 'OFFENSIVE' TWEET \"It is so inappropriate. So uncalled for. It does not do anything to help with unity. It was unfair to Speaker Pelosi.\" Clay continued his broadside, saying the comment exposed how much Ocasio-Cortez and Reps. Ilhan Omar, D-Minn., Rashida Tlaib, D-Mich., and Ayanna Pressley, D-Mass., have to learn when it comes to being \"effective legislators\". \"It’s going to take a process of maturing for those freshman members. They will have to learn to be effective legislators,\" he said. \"It shows their lack of sensitivity to racism. To fall back on that (trope) is a weak argument. It has no place in a civil discussion.\" 'VIEW' TELLS AOC, OTHER DEMS TO RESPECT PELOSI AFTER RACISM ACCUSATION: 'BS' The lawmaker closed his remarks by suggesting the four freshmen could hurt Democratic chances in upcoming elections. \"It shows they have no sensibility to different members from our caucus. Some come from red districts and those are the ones who gave us the majority. We need them all,\" he said. His comments followed a feud between Pelosi and freshman congresswomen, like Ocasio-Cortez, that involved racially-charged criticism. Ocasio-Cortez's chief of staff, Saikat Chakrabarti, previously compared moderate Democrats to racists -- prompting Pelosi, at the request of some of her members, warn House Democrats not to attack each other on Twitter. GINGRICH ON DEMS' INFIGHTING: AOC, OTHER FRESHMEN QUESTIONING WHY THEY NEED TO LISTEN TO PELOS \"You got a complaint?  You come and talk to me about it.  But do not tweet about our members and expect us to think that that is just ok,\" she reportedly said. On the same day of that caucus meeting, Ocasio-Cortez called out Pelosi for what she sees as the speaker continually targeting her and other freshmen lawmakers of color. \"Their ignorance is beyond belief,\" Clay also said while in the Speaker's Lobby, according to The Hill. Clay reportedly saw Ocasio-Cortez and her chief of staff as \"juvenile.\" Clay wasn't the only one to attack Ocasio-Cortez on Thursday. \"The View\" hosts Joy Behar and Whoopi Goldberg criticized her's and others' decision to attack Democrats like Pelosi. \"I think this is more BS,\" Goldberg said of Ocasio-Cortez's comments on race. BERNIE SANDERS SEEMINGLY DIPS TOE INTO DEMOCRATS' FEUD, TELLS YOUNG PEOPLE TO EMBRACE PROGRESSIVE 'POWER' Pelosi, meanwhile, refused to provide further comment on the feud while discussing it during her weekly press briefing. “I've said what I'm going to say…What I said in the caucus yesterday had an overwhelming response from my members,\" she said. CLICK HERE TO GET THE FOX NEWS APP \"Because they know what the facts are and what we are responding to. We respect the value of every member of our caucus. The diversity of it all is a wonderful thing. Diversity is our strength. Unity is our power.\" Fox News' Alex Pappas contributed to this report.",
      "date": "July 11",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Biden dismissive of Ocasio-Cortez’s expected endorsement of Bernie Sanders",
      "url": "https://www.foxnews.com/politics/biden-dismissive-of-ocasio-cortezs-expected-endorsement-of-bernie-sanders",
      "subtitle": "Biden dismissive of Ocasio-Cortez’s expected endorsement of Bernie Sanders",
      "author": "Ronn Blitzer",
      "content": "  Former Vice President Joe Biden appeared to shrug off Rep. Alexandria Ocasio-Cortez, D-N.Y., on Wednesday in light of the freshman congresswoman's expected endorsement of Biden's 2020 rival, Sen. Bernie Sanders, I-Vt., in the presidential race. When asked about his plan to convince voters in light of the left-wing Democrat's support of Sanders, Biden smiled broadly and gave a dismissive response. TOMI LAHREN: AOC SHOULD WORRY ABOUT HER OWN REELECTION, NOT ENDORSING BERNIE \"That's how I do it,\" Biden said with a chuckle, while campaigning the day after the debate in Ohio. Ocasio-Cortez is one of three members of the so-called \"Squad\" of far-left first-year representatives who are throwing their support behind the Vermont democratic socialist. Rep. Ilhan Omar, D-Minn., is backing Sanders, tweeting a statement that Sanders is \"fighting for the soul of our democracy,\" along with a video explaining her endorsement. She touted Sanders' campaign promises, including his vow to cancel student debts. In addition, CNN reported that Rep. Rashida Tlaib, D-Mich., will endorse Sanders as well. CLICK HERE TO GET THE FOX NEWS APP Ocasio-Cortez is expected to join Sanders at a campaign event Saturday in Queens, N.Y. The rally is called \"Bernie's Back,\" and is meant to spark renewed enthusiasm for the Sanders campaign following his recent heart attack. So far, there is no indication as to whether the fourth \"Squad\" member, Rep. Ayanna Pressley, D-Mass., is endorsing any candidate. Fox News' Dom Calicchio contributed to this report.",
      "date": "October 16",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Ocasio-Cortez says she moved to new Bronx apartment",
      "url": "https://www.foxnews.com/politics/ocasio-cortez-says-she-moved-to-new-bronx-apartment",
      "subtitle": "Ocasio-Cortez says she moved to new Bronx apartment",
      "author": "",
      "content": "Freshman New York Rep. Alexandria Ocasio-Cortez on Sunday night confirmed The Post’s reporting that she’s relocated to a new Bronx apartment in her neighborhood. A day after residents at the Democratic congresswoman’s listed address told The Post they’d never seen her around, her spokesman on Sunday said she moved recently to a larger apartment “a block and a half away” with her boyfriend. In a tweet, the left-wing darling also said she remained a Bronx resident. “I still live in my hood and literally instagrammed from my apartment tonight,” Ocasio-Cortez, 29, wrote in response to The Post’s reporting. On Saturday, Ocasio-Cortez ducked questions about her living situation after an appearance. Her spokesman, Corbin Trent, claimed she relocated to a two-bedroom apartment with her beau earlier this month. Trent claimed that Ocasio-Cortez was at her new home Sunday afternoon, although he wouldn’t identify the address. “A man was just arrested last week with a stockpile of guns specifically trying to kill me & others,”Ocasio-Cortez added in her tweet. “So yeah I’m not gonna disclose my personal address or tell people when I move. Sorry!.” Ocasio-Cortez was referring to US Coast Guard Lt. Cristopher Paul Hasson who was allegedly plotting to murder Democrats and journalists when he was arrested on drugs and guns charges this month. The rep’s recent move still doesn’t explain why residents at her previous digs — a condo owned by her mom — insisted they had never seen her there. Click for more from The New York Post",
      "date": "February 25",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Greg Gutfeld: Ocasio-Cortez is being 'sneaky' with the truth after border visit",
      "url": "https://www.foxnews.com/politics/greg-gutfeld-ocasio-cortez-border-truth-sneaky",
      "subtitle": "Greg Gutfeld: Ocasio-Cortez is being 'sneaky' with the truth after border visit",
      "author": "Victor Garcia",
      "content": " Fox News' Greg Gutfeld expressed doubt that the accusations Rep. Alexandria Ocasio-Cortez, D-N.Y., made against Border Patrol officials at a Texas detention facility she visited were true, claiming the congresswoman was being \"sneaky\" with the truth. \"I think it's just her being sneaky because I don't believe this. My gut is that... no one's been drinking from any toilet,\" Gutfeld said on \"The Five\" Tuesday. \"The Greg Gutfeld Show\" noted that the drinking water was located above the toilet in the detention centers and believed that Ocasio-Cortez was treading lightly with the reality of the migrant detention center experience. \"So I think that what she did was she said something that is false but directionally true. Meaning she could get away with it,\" Gutfeld added. OCASIO-CORTEZ ACCUSES BORDER OFFICERS OF 'VIOLENT CULTURE' AFTER REPORT ON GRAPHIC FACEBOOK POSTS Gutfeld took issue with the congresswoman's \"demonization\" of Border Patrol agents and her comments that she didn't feel safe while touring the facility. \"In that last facility, I was not safe from the officers in that facility,\" Ocasio-Cortez told reporters Monday. \"I think the bigger story too is how the left has this free pass to demonize anyone. We've seen accusations of child abuse directed at people who work there. She's suggested that these guys might sexually assault her, she doesn't feel safe around them. These are horrible things to say about people casually,\" Gutfeld said. \"But if you respond angrily or you... criticize her and suddenly she becomes the victim.\" On Tuesday, having already made the controversial allegations of abusive treatment at the facilities, Ocasio-Cortez again compared them to \"concentration camps.\" Responding to the release of photographs taken inside facilities in Texas, she tweeted: “These are concentration camps. “According to concentration camp experts, people begin to die due to overcrowding, neglect, and shortage of resources. CLICK HERE TO GET THE FOX NEWS APP We saw all three of those signs on our trip yesterday. Another person died yesterday. And those are the deaths we know about.” Earlier on Tuesday, current and former immigration officials pushed back on Ocasio-Cortez’s recent high-profile accusations of cruel treatment at an El Paso border station, rejecting her claim that agents forced detainees to “drink out of the toilets” and insisting that their personnel “don’t treat people that way.”",
      "date": "July 2",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Ocasio-Cortez tells White House to ‘put down its saber,’ and negotiate with Iran",
      "url": "https://www.foxnews.com/politics/ocasio-cortez-tells-white-house-to-put-down-its-saber-and-call-tehran",
      "subtitle": "Ocasio-Cortez tells White House to ‘put down its saber,’ and negotiate with Iran",
      "author": "Edmund DeMarche",
      "content": " U.S. Rep. Alexandria Ocasio-Cortez, D-N.Y., took to Twitter late Thursday to urge the Trump administration to show restraint in its dealings with Iran. The freshman congresswoman's request came after the White House blamed Tehran for recent attacks on two oil tankers in the Strait of Hormuz and the downing of a drone in international airspace. \"This administration needs to put down its saber and pick up a phone,\" Ocasio-Cortez wrote. Ocasio-Cortez, who has emerged as a leading voice for Democrats, has been a fierce critic of Trump’s domestic and foreign policy. She was asked by CNN about “the handling of Iran” and responded, “I think they’re trying to goad us into a military conflict that’s completely irresponsible.” She ended her tweet, “Diplomacy is what grants us peace and stability- not war.” It is unclear if Iran would be willing to accept any diplomatic overtures from the U.S. despite Ocasio-Cortez’s urging. Iran’s Supreme Leader Sayyid Ali Hosseini Khamenei took a personal shot at President Trump last week when he was pressed about the oil tankers. He said Trump was not “worthy” of a reply. “I do not have any reply for him, now or in the future,” he said. Top White House officials met for a classified briefing that lasted over an hour about the recent downing of a U.S. Navy drone and those in attendance suggested that a “measured” response is likely coming soon. CLICK HERE TO GET THE FOX NEWS APP The New York Times reported that Trump approved strikes on Iranian targets including radar and missile batteries, but the plan was called off. The paper, citing a senior administration official, reported that planes and ships were in position, but were told to stand down. Fox News could not immediately confirm the Times’ report. The State Department did not immediately respond to an email from Fox News early Friday.",
      "date": "June 21",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Ocasio-Cortez defiant in face of criticism for opposing border $$ bill while decrying conditions",
      "url": "https://www.foxnews.com/politics/ocasio-cortez-defiant-in-face-of-criticism-for-opposing-border-bill-while-decrying-conditions",
      "subtitle": "Ocasio-Cortez defiant in face of criticism for opposing border $$ bill while decrying conditions",
      "author": "Brooke Singman",
      "content": " Rep. Alexandria Ocasio-Cortez is firing back at accusations of hypocrisy for railing against conditions in migrant detention centers, after having voted against funding legislation for the humanitarian crisis at the border. “People like AOC create the disaster, refuse to fix it, vote against funding to help people and then go down there to attack the people who are saying to her, ‘we don’t have enough money, we don’t have enough facilities,’” former GOP House Speaker Newt Gingrich said on Fox News’ “America’s Newsroom,” calling her \"viciously dishonest.\" The criticisms of Ocasio-Cortez, D-N.Y., come after the freshman Democrat traveled to the border in El Paso, Texas on Monday with almost a dozen members of the Congressional Hispanic Caucus, blasting border officials while claiming agents forced migrant women and children in cells to drink toilet water. OFFICIALS PUSH BACK ON AOC'S BORDER STATION CLAIMS, SAY SHE IS 'MISINFORMING' THE PUBLIC Ocasio-Cortez has battled with immigration officials ever since over the veracity of that claim. But she's also faced criticism over her “hell no” vote last week on a bipartisan bill that would provide $4.6 billion in funding for the crisis, and for voting against an earlier Democrat-backed aid package. She was insisting that restrictions on immigration enforcement be included. “How many migrant women did @AOC help by voting AGAINST the $4.6 billion bipartisan humanitarian aid that is FOR THEM?” Kellyanne Conway, counselor to President Trump, tweeted Tuesday in response to the lawmaker's accusations. “All talk, no dollars.” Republican GOP Rep. Dan Crenshaw of Texas also pushed back. “What they’re really doing is trying to stand on their moral high horse and sling arrows at everybody else while not offering a solution,” Crenshaw said on Fox News' “The Story” Tuesday. “They fought us tooth and nail against that $4.5 [billion] in humanitarian aid the president needed, that DHS needed.” But Ocasio-Cortez fired back, saying it’s “not” a funding problem, but a “deeper, systemic” one. She also claimed the border bill simply \"funded abuse\" and didn't fix the problem. “Are CBP officers waking up women in the middle of sleep a ‘funding’ problem? Is calling migrants ‘filthy’ ‘wh*res’ a funding problem? Is threatening violence on members of Congress a ‘funding’ problem?” she tweeted. “No, it’s not. It’s a far deeper, systemic, more violent problem than that.” But amid the political fight, immigration officials maintain that they are resource-starved in the face of a migration surge. A DHS official told Fox News that CBP agents are “not equipped for the sheer volume of people” in facilities. “HHS is backed up with children, so there is a real backlog at the CBP facilities there,” the official explained. “It’s a real problem. The supplemental funding will help, but it’s a band-aid on a much bigger problem.” DHS INSPECTOR GENERAL REPORT REVEALS OVERCROWDING AND MIGRANTS PLEADING FOR HELP DURING DETENTION-FACILITY TOUR A U.S. Customs and Border Protection spokesman told Fox News in a statement that during Ocasio-Cortez’s visit to the border with other members of Congress Monday, “local leadership highlighted investments in additional restroom and shower facilities, hygiene products, increased medical support and expanded transportation capabilities,” and said officials are doing the best they can with limited funding and resources. “Even with these investments, El Paso officials emphasized to members of Congress that USBP facilities were not designed for long-term holding,” the CBP spokesman said in a statement. “Officials also explained the critical challenges to USBP operations when ICE/ERO and HHS/ORR are unable to move those in custody as quickly as they are processed.” The spokesman added that it “was also reiterated that CBP takes allegations of mistreatment of individuals in our facilities seriously, and reports all allegations to both the DHS Office of the Inspector General and the CBP Office of Professional Responsibility.” “Any employee found to have violated our standards of conduct will be held accountable,” the spokesman said. DHS, meanwhile, is investigating a reported Facebook group where border officials posted graphic content mocking Ocasio-Cortez as well as migrants -- a development that only fueled the tensions between the lawmaker and immigration agencies. Also on Tuesday, the DHS inspector general released a report revealing that 8,000 immigrants being held in Border Patrol detention facilities in South Texas were subjected to “serious overcrowding” and prolonged detention. The report included photos of migrants in several facilities, packed into crowded standing-room-only cells and behind fences. Others are shown sleeping on the floor with aluminum blankets. The report also cited security incidents at multiple facilities. Some detainees have clogged toilets with the blankets and socks in order to be let out of their cells and some have refused to re-enter the cells after they had been cleaned. \"The current situation on the Southern Border represents an acute and worsening crisis,\" Acting Inspector General Jennifer Costello said in a letter to Jim Crumpacker, the director of the Government Accountability Office-OIG Liaison Office. \"Our immigration system is not equipped to accommodate a migration pattern like the one we are experiencing now.\" Fox News' Louis Casiano and The Associated Press contributed to this report.",
      "date": "July 3",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez rips Mitch McConnell for Green New Deal vote: 'He doesn't want to save our planet'",
      "url": "https://www.foxnews.com/politics/rep-alexandria-ocasio-cortez-mitch-green-new-deal",
      "subtitle": "Alexandria Ocasio-Cortez rips Mitch McConnell for Green New Deal vote: 'He doesn't want to save our planet'",
      "author": "Anna Hopkins",
      "content": " Senate Majority Leader Mitch McConnell doesn't want to save the planet and thinks \"we can all drink oil in 30 years.\" Or at least that's the charge delivered by Rep. Alexandria Ocasio-Cortez ahead of the Senate vote on her Green New Deal. Speaking to Vox reporter Ella Nilsen, Ocasio-Cortez accused McConnell of rushing a vote and not wanting to take action against climate change \"because he thinks we can drink oil in 30 years when all our water is poisoned. “What McConnell’s doing is that he’s trying to rush this bill to the floor without a hearing... without working through committee -- because he doesn’t want to save our planet. Because he thinks we can drink oil in 30 years when all our water is poisoned,” she reportedly said. OCASIO-CORTEZ BLASTS GOP'S UPCOMING 'BLUFF-VOTE' ON GREEN NEW DEAL MCCONNELL TO PUT GREEN NEW DEAL TO VOTE, FORCING DEMOCRATS TO GO ON RECORD A Senate test vote on the Green New Dea is set to take place Tuesday afternoon. Many Senate Democrats have slammed the vote as a \"sham\" and an attempt by the Republican leader to divide Democratic politicians on legislation that has not had the opportunity yet to be debated in Congress. Democratic Sen. Edward Markey, who co-sponsored the proposed legislation with Ocasio-Cortez, said that the Green New Deal was intended to spur debate throughout the 2020 presidential election about how best to tackle the delicate issue of climate change -- not to be put to a quick vote on the Senate floor. In a tweet on Monday, McConnell seemingly addressed accusations that he was manipulating the vote to divide Democrats. “I could not be more glad that the American people will have the opportunity to learn precisely where each one of their senators stand on the ‘Green New Deal’: a radical, top-down, socialist makeover of the entire U.S. economy,\" he wrote. CLICK HERE TO GET THE FOX NEWS APP Many Democrats plan to vote \"present.\"",
      "date": "March 26",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "'The Five' hosts discuss Sanders, Ocasio-Cortez teaming up on climate change, partnership's potential outcomes",
      "url": "https://www.foxnews.com/politics/alexandria-ocasio-cortez-bernie-sanders-five-climate-change",
      "subtitle": "'The Five' hosts discuss Sanders, Ocasio-Cortez teaming up on climate change, partnership's potential outcomes",
      "author": "Charles Creitz",
      "content": " Democratic presidential candidate Sen. Bernie Sanders, I-Vt., needs the support of Rep. Alexandria Ocasio-Cortez, D-N.Y., but it could come at a cost, according to \"The Five.\" Fellow 2020 hopeful Sen. Elizabeth Warren, D-Mass. -- considered Sanders' predominant progressive rival -- should also support any move by Ocasio-Cortez to formally endorse Sanders, Dana Perino and Dagen McDowell claimed Wednesday. \"You know why he wants Alexandria Ocasio-Cortez to help him?\" Perino asked. \"He absolutely needs her,\" she then said, pointing to a resolution co-sponsored by the two progressive lawmakers, as well as Rep. Earl Blumenauer, D-Ore., formally declaring a climate change emergency. OCASIO-CORTEZ, SANDERS CALL FOR CLIMATE CHANGE EMERGENCY MOBILIZATION OCASIO-CORTEZ: PELOSI GIVING ME BUSY WORK, MIGHT BE TRYING TO KEEP ME OUT OF THE WAY \"His campaign is almost invisible. Think about the debates. Nobody talked about him in the debates. Nobody's talked about him since. He had a pretty good fundraising number, but nobody even talked about that. \"He's got to figure out a way to have some relevance.\" Perino continued to say that Warren, as a fellow progressive, could benefit from Ocasio-Cortez sticking with Sanders in the long run. Expanding upon Perino's comments, McDowell claimed Ocasio-Cortez's controversial comments could be a boon to Warren if the Bronx lawmaker decides to support Sanders. AOC ACCUSES CONGRESS OF USING WOMEN, MINORITIES AS 'BARGAINING CHIPS' WHO HAVE BEEN 'AUCTIONED OFF' FOR DECADES \"If you get AOC's endorsement, you own that craziness or whatever that she might say that day that's idiotic or irrational,\" she said. In Congress, the climate change resolution calls for a wide-scale mobilization to combat the emergency and restore the climate “for future generations.” CLICK TO GET THE FOX NEWS APP “The global warming caused by human activities,” claims the draft resolution, according to the Mother Jones magazine, “has resulted in a climate emergency that … demands a national, social, industrial, and economic mobilization of the resources and labor of the United States at a massive scale.” Ocasio-Cortez and Blumenauer, meanwhile, also wrote to fellow members of Congress urging them to declare climate change an emergency in a bid to “swiftly mobilize federal resources in response.” Fox News' Lukas Mikelionis contributed to this report.",
      "date": "July 10",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Ocasio-Cortez, in sick burn, compares Trump to ‘nematode’",
      "url": "https://www.foxnews.com/politics/ocasio-cortez-trump-nematode",
      "subtitle": "Ocasio-Cortez, in sick burn, compares Trump to ‘nematode’",
      "author": "Danielle Wallace",
      "content": " Freshman Rep. Alexandria Ocasio-Cortez, D-N.Y., compared President Trump to a worm during an interview on “Late Night with Seth Meyers” on Thursday -- but you'd need your dictionary to know that. The 29-year-old congresswoman used an obscure term to take a swipe at Trump toward the end of her appearance, when Meyers asked her about winning the second-place prize as a teen in her high school science competition. AOC DEFENDS GREEN NEW DEAL, SAYS NARRATIVE BEING 'MANIPULATED' BY TRUMP, OTHER CRITICS “Science was my first passion,” said Ocasio-Cortez. “I studied microbiology and the impacts of antioxidants on a model organism known as the C. elegan, which is of the nematode family.” Meyers compared Ocasio-Cortez’s interest in science to that of Trump, interjecting “I think he did that, too.” “Because he’s a nematode?” she retorted while the crowd roared in laughter, comparing the president to the roundworms found as parasites in animals and plants. Ocasio-Cortez also vehemently defended her Green New Deal during her time on the show, claiming Trump and other critics are manipulating the narrative around her proposal for climate change reform. “They’re trying to say that the Green New Deal is about what we have to give up, what we have to cut back on, when in fact the Green New Deal itself is a resolution to be more expansive,” Ocasio-Cortez said. The massive climate change investment has been criticized for being too overreaching and too expensive. The self-proclaimed democratic socialist became the youngest woman ever elected to Congress after defeating 10-term Democratic incumbent Joe Crowley in the primary and then winning in the November general election. CLICK HERE TO GET THE FOX NEWS APP The bartender turned politician is a leader of the Democratic Party’s progressive wing and has managed to gain endorsements for her Green New Deal bill from Democratic 2020 hopefuls. Fox News’ Joseph A Wulfsohn contributed to this report.",
      "date": "March 22",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "",
      "url": "",
      "subtitle": "",
      "author": "",
      "content": "    ",
      "date": "",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Ocasio-Cortez repeats 'concentration camp' comparison, despite criticism over the remark",
      "url": "https://www.foxnews.com/politics/ocasio-cortez-repeats-concentration-camps",
      "subtitle": "Ocasio-Cortez repeats 'concentration camp' comparison, despite criticism over the remark",
      "author": "Liam Quinn",
      "content": " Rep. Alexandria Ocasio-Cortez once again compared border detention facilities to concentration camps on Tuesday, despite facing criticism for invoking the Holocaust by doing so. Ocasio-Cortez, D-N.Y., came under fire last month for saying the U.S. government is \"running concentration camps on our southern border” during an Instagram broadcast. The comment was widely condemned, including by two Holocaust survivors, Sami Steigmann and David Tuck, who told Turning Point USA that AOC's comments were ignorant and full of hubris. However, on Tuesday the New York congresswoman again made the shocking comparison. OFFICIALS PUSH BACK ON AOC'S BORDER STATION CLAIMS, SAY SHE IS 'MISINFORMING' THE PUBLIC Responding to the release of photographs taken inside facilities in Texas, she tweeted: “These are concentration camps. “According to concentration camp experts, people begin to die due to overcrowding, neglect, and shortage of resources. “We saw all three of those signs on our trip yesterday. Another person died yesterday. And those are the deaths we know about.” Earlier on Tuesday, current and former immigration officials pushed back on Ocasio-Cortez’s recent high-profile accusations of cruel treatment at an El Paso border station, rejecting her claim that agents forced detainees to “drink out of the toilets” and insisting that their personnel “don’t treat people that way.” HOLOCAUST SURVIVORS RESPOND TO AOC'S 'CONCENTRATION CAMP' COMMENTS IN NEW VIDEO AOC traveled to the border on Monday with almost a dozen members of the Congressional Hispanic Caucus, as she blasted border officials as “violent” and “inhumane” -- while claiming agents forced migrant women and children being detained in cells to drink toilet water. “They are not drinking out of the toilet—no Border Patrol agent is going to make anyone drink out of the toilet,” former U.S. Immigration and Customs Enforcement (ICE) director Tom Homan said on Fox News' “America’s Newsroom” Tuesday. “It’s just ridiculous on its face.” Homan alleged that Ocasio-Cortez was “clearly, intentionally misinforming the American public.” He added, “She’s lost all credibility.” SEN. JOHN KENNEDY ON AOC'S 'CONCENTRATION CAMP' COMPARISON: 'SHE KNOWS BETTER THAN THAT' Homan suggested she was referring to the “apparatus” in holding cells that has an attached sink and toilet, but two separate water lines. Ocasio-Cortez, though, maintained that while she did see the combination toilet-sink facilities, the station had only one of them, and the sink portion wasn't working. “So the women were told they could drink out of the bowl,” she tweeted. Homan acknowledged that the facilities “are jails” and “were not built for women and children,” saying that was why agents have been “begging” Congress for more funding for beds “so these families can be moved into a proper facility with proper care.” OCASIO-CORTEZ ALLEGEDLY SCREAMED AT BORDER AGENTS DURING RECENT TRIP TO SOUTHERN BORDER: REPORT But, a Department of Homeland Security official told Fox News on Tuesday that CBP agents “are not equipped for the sheer volume of people” in facilities. “HHS is backed up with children, so there is a real backlog at the CBP facilities there,” the official explained. “It’s a real problem. The supplemental funding will help, but it’s a band-aid on a much bigger problem.” The official was referring to a recently passed funding bill for the crisis at the border. Ocasio-Cortez’s visit and allegations came after the discovery of a secret Facebook group in which Border Patrol agents allegedly posted vulgar jokes and images about her, as well as illegal immigrants. OCASIO-CORTEZ ACCUSES BORDER OFFICERS OF 'VIOLENT CULTURE' AFTER REPORT ON GRAPHIC FACEBOOK POSTS The website ProPublica posted the story Monday headlined: “Inside the Secret Border Patrol Facebook Group Where Agents Joke About Migrant Deaths and Post Sexist Memes.” In one post reported by ProPublica, a group member referenced the visits by Democrats and encouraged an officer to throw a “burrito at these b-----s.” Other posts included a vile, fake photo illustration of Ocasio-Cortez engaged in oral sex with President Trump. CLICK HERE TO GET THE FOX NEWS APP U.S. Customs and Border Protection condemned the posts. “These posts are completely inappropriate and contrary to the honor and integrity I see—and expect—from our agents day in and day out,\" U.S. Border Patrol Chief Carla Provost said in a statement to Fox News. \"Any employees found to have violated our standards of conduct will be held accountable.” Fox News' Brooke Singman and Alex Pappas contributed to this report.",
      "date": "July 2",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Rush Limbaugh: Ocasio-Cortez pulling a 'stunt' on border, officials need to 'call her' on allegations",
      "url": "https://www.foxnews.com/politics/rush-limbaugh-aoc-border-stunt",
      "subtitle": "Rush Limbaugh: Ocasio-Cortez pulling a 'stunt' on border, officials need to 'call her' on allegations",
      "author": "Victor Garcia",
      "content": " Is Rep. Alexandria Ocasio-Cortez, D-N.Y., trying to use her experience at a Border Patrol detention center in Texas to her advantage? Conservative radio talk show host Rush Limbaugh suggested as much, saying the New Yorker is using the border crisis to generate media attention for herself. \"I think she’s trying to create a situation to make herself look good, make the federal employees look bad, and somebody needs to call her on it,\" Limbaugh said on his radio show Tuesday. OCASIO-CORTEZ ACCUSES BORDER OFFICERS OF 'VIOLENT CULTURE' AFTER REPORT ON GRAPHIC FACEBOOK POSTS The congresswoman alleged people of all ages were being mistreated and were \"drinking out of toilets\" as the guards laughed at the migrants' plight right in front of her during a tour of a facility in El Paso, Texas. Former and current Border Patrol officials have pushed back on Ocasio-Cortez's claims. Limbaugh continued, saying that hearings should be called so the congresswoman's claims can be put under scrutiny. \"The DOJ needs to call her on it. ICE, Border Patrol, they need to call her on it,\" he said. \"There need to be hearings held on these kinds of baseless charges. They need to be refuted, blown to smithereens.\" The radio talk show host expressed sympathy for federal employees working on the border saying there wasn't any compassion for Border Patrol agents. CLICK HERE TO GET THE FOX NEWS APP \"She's making federal employees look bad,\" Limbaugh said. \"She’s making these people who are doing what you wouldn’t do. Do you want that job, knowing you don’t have the support of a large percentage of the country? \"There isn’t any compassion for the people down there.\" Limbaugh closed his discussion by again expressing his doubts. \"To me, this whole thing is a stunt,\" he said.",
      "date": "July 2",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Ocasio-Cortez continues Twitter spat with Trump, links GOP to white supremacy",
      "url": "https://www.foxnews.com/politics/ocasio-cortez-twitter-trump-gop-white-supremacy",
      "subtitle": "Ocasio-Cortez continues Twitter spat with Trump, links GOP to white supremacy",
      "author": "Nick Givas",
      "content": " Alexandria Ocasio-Cortez continued her Twitter feud with President Trump on Monday and accused him of turning the GOP into a racist party, through his support of white supremacism. The New York Democrat said Trump's Sunday tweets telling \"Progressive Democratic Congresswomen\" to fix their home countries before they critique America was a racist statement and should alarm the entire country. Trump also mentioned House Speaker Nancy Pelosi in his Sunday tweets and said she would be glad to get rid of her progressive House members. It wasn't clear who Trump was referring to but it's assumed he was targeting Reps. Ocasio-Cortez, D-N.Y., Rashida Tlaib D-Mich., Ayanna Pressley, D-Mass., and Ilhan Omar, D-Minn. Ocasio-Cortez called on all Republicans to speak out against Trump's comments and said if they don't publicly denounce the president, voters can assume they condone racism. TRUMP TARGETS FRESHMAN CONGRESSWOMEN, PELOSI ON TWITTER, TELLS PROGRESSIVES TO 'GO BACK' 'HELP FIX' HOME COUNTRIES \"It’s important to note that the President’s words yday, telling four American Congresswomen of color 'go back to your own country,' is hallmark language of white supremacists. Trump feels comfortable leading the GOP into outright racism, and that should concern all Americans,\" the freshman New Yorker tweeted. \"Until Republican officials denounce yesterday’s explicitly racist statements (which should be easy!), we sadly have no choice but to assume they condone it. It is extremely disturbing that the *entire* GOP caucus is silent. Is this their agenda?\" Omar also gave a followup comment on Twitter after the feud began yesterday, and suggested Trump was sinking and beginning to implode. “There are few things more dreadful than dealing with a man who knows he is going under, in his own eyes, and in the eyes of others. Nothing can help that man. What is left of that man flees from what is left of human attention.” ~James Baldwin,\" she tweeted. TRUMP DOUBLES DOWN ON 'GO BACK' TWEETS AMID OUTRAGE, CALLS ON 'RADICAL REPS' TO APOLOGIZE Tlaib tweeted out a photo of all four women on Sunday in a show of solidarity, adding: \"Love to ALL my sisters in service (at home & in Congress), we only grow stronger lifting each other up.\" On Sunday, the Washington Post's global opinions editor Karen Attiah blamed Pelosi's harsh criticism of the four progressive members for their spat with Trump and said her actions gave him an opening to attack the Freshman Reps. CLICK HERE FOR THE FOX NEWS APP Ocasio-Cortez has spoken publicly about her relationship with Pelosi and suggested the speaker has been giving her busy work to keep her quiet and out of the public eye.",
      "date": "July 15",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez dismisses Trump’s ‘young bartender’ jab, says there's 'nothing wrong with being a working person'",
      "url": "https://www.foxnews.com/politics/alexandria-ocasio-cortez-dismisses-trumps-young-bartender-jab",
      "subtitle": "Alexandria Ocasio-Cortez dismisses Trump’s ‘young bartender’ jab, says there's 'nothing wrong with being a working person'",
      "author": "Ann W. Schmidt",
      "content": " Rep. Alexandria Ocasio-Cortez rebuffed President Trump’s recent comments calling her “a young bartender” by saying there’s dignity in “being a working person.” “I’m proud to be a bartender, ain’t nothing wrong with that,” the New York Democrat said Friday at the National Action Network convention. The congresswoman, who worked as a bartender and political organizer in New York City before unseating 10-term incumbent U.S. Rep. Joe Crowley in a Democratic primary last year, then listed a series of jobs that “there’s nothing wrong with” including working retail, folding clothes, preparing food and driving buses. OCASIO-CORTEZ CALLS FOR ‘AGENDA OF REPARATIONS’ AS 2020 DEMS GET ON BOARD “There is nothing wrong with being a working person in the United States of America and there is everything dignified about it,” she added. “I, in fact, am encouraged when people remind the country of my past, not because of anything about my story, but because it communicates that if I can work in a restaurant and become a member of the United States Congress, so can you,” she told the audience at the Al Sharpton-sponsored conference in New York City. Trump initially made the comment about Ocasio-Cortez on Tuesday about her signature Green New Deal. ALEXANDRIA OCASIO-CORTEZ PROMOTES ‘ANTI-CAPITALIST’ STREAMING SERVICE He didn’t explicitly name the freshman congresswoman, though he cautioned lawmakers against being too quick to defeat the plan, in hopes of campaigning against it in his 2020 re-election bid. \"The Green New Deal, done by a young bartender, 29 years old,\" Trump said at the National Republican Congressional Committee dinner in Washington. \"A young bartender, wonderful young woman.” “The first time I heard it, I said, 'That’s the craziest thing.' You have senators that are professionals, that you guys know, that have been there for a long time ... and they’re standing behind her shaking. They’re petrified of her,\" Trump continued. The Green New Deal calls for a massive overhaul of the nation’s economy and energy use, with an estimated cost that could reach well into the tens of trillions of dollars. The legislation failed to pass a test vote last week in the Senate. Fox News’ Stephen Sorace contributed to this report.",
      "date": "April 5",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Ocasio-Cortez turns attention to Mitch McConnell amid ongoing feud with Trump over controversial comments",
      "url": "https://www.foxnews.com/politics/ocasio-cortez-mcconnell-trump-tweets",
      "subtitle": "Ocasio-Cortez turns attention to Mitch McConnell amid ongoing feud with Trump over controversial comments",
      "author": "Sam Dorman",
      "content": " Rep. Alexandria Ocasio-Cortez, D-N.Y., turned her attention to Senate Majority Leader Mitch McConnell, R-Ky., amid her ongoing feud with President Trump over his recent controversial comments. In the broadside, the freshman Democrat said McConnell is \"complicit in advancing racism\" in the wake of the president's remarks about four Democratic congresswomen -- including Ocasio-Cortez -- needing to \"go back\" where they came from. Three of the four women were born in America. \"The majority leader is complicit in advancing racism in America if he doesn't even have the backbone to speak out,\" Ocasio-Cortez told ABC on Tuesday. Her comments followed days of controversy surrounding Trump's tweets, provoking responses from politicians in both chambers of Congress. McConnell, on Tuesday, called on \"everybody\" to \"tone down their rhetoric.\" PELOSI'S COMMENTS ON TRUMP'S 'RACIST' TWEETS RULED OUT OF ORDER, AFTER FLOOR FIGHT ERUPTS House Minority Leader Kevin McCarthy, R-Calif., similarly dismissed Ocasio-Cortez's and others' outrage surrounding Trump's tweets as \"all about politics.\" But according to Ocasio-Cortez, Trump's words constituted a \"classic line of white supremacy.\" Trump's comments appeared to unify, at least temporarily, Democrats and prompted House Speaker Nancy Pelosi, D-Calif., to adamantly condemn Trump's comments on the House floor. Before her comments, Trump attempted to tie the Speaker to Ocasio-Cortez and other freshmen in an apparent attempt to make the party seem more left-leaning before the 2020 elections. BRET BAIER: CENSURE VOTE AGAINST TRUMP A 'CAMPAIGN COMMERCIAL IN THE MAKING' FOR HOUSE DEMOCRATS Ocasio-Cortez similarly predicted the controversy could bode well for her party in the upcoming elections. \"Honestly, if these members go on the record condoning the president telling women of color to go back to their own country, I invite them to because we will win the 2020 election and we will take this country back.\" CLICK HERE TO GET THE FOX NEWS APP Not everyone Republican refrained from condemning Trump's remarks. Sens. Susan Collins, R-Maine, and Lisa Murkowski, R-Alaska, both denounced Trump's comments on Monday. “There is no excuse for the president’s spiteful comments –they were absolutely unacceptable and this needs to stop,” Murkowski tweeted.",
      "date": "July 16",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Ocasio-Cortez gets new 2020 challenger: a Republican immigrant from Jamaica",
      "url": "https://www.foxnews.com/politics/ocasio-cortez-gets-new-2020-challenger",
      "subtitle": "Ocasio-Cortez gets new 2020 challenger: a Republican immigrant from Jamaica",
      "author": "Alex Pappas",
      "content": " EXCLUSIVE -- Scherie Murray, a New York businesswoman who immigrated from Jamaica as a child and is active in state Republican politics, is launching a campaign Wednesday for the congressional seat held by Democratic Rep. Alexandria Ocasio-Cortez, Fox News has learned. In a phone interview, Murray, 38, confirmed her intention to run for the New York congressional seat as a Republican. TRUMP FIRES BACK AT SQUAD, CHALLENGES HOUSE TO ‘REBUKE’ THEM FOR ‘FILTHY AND HATE LACED’ LANGUAGE “There is a crisis in Queens, and it’s called AOC,” Murray told Fox News. “And instead of focusing on us, she’s focusing on being famous. Mainly rolling back progress and authoring the job-killing Green New Deal and killing the Amazon New York deal.” Murray, who was born in Jamaica and moved to the United States when she was 9, is officially launching her campaign Wednesday with an introductory video that takes sharp jabs at the 29-year-old Ocasio-Cortez. “Your representative in Washington chooses self-promotion over service, conflict over constituents, resistance over assistance,\" Murray said in the video. \"Queens and the Bronx needs someone who will create jobs instead of turning them away.\" Asked about Ocasio-Cortez’s brand of Democratic socialism, Murray said, “I think it’s far, far to the left and it is not connecting with everyday Americans.” As for \"Medicare-for-all,\" which Ocasio-Cortez has embraced, the Republican said: “Medicare-for-all, I think a lot of people are happy with their current health insurance.” And on the Green New Deal, the left-wing proposal to address climate change pushed by Ocasio-Ortez, she said: “We know that it certainly will kill jobs.” Murray joins four other Republicans who have filed to run for the seat: former police officer John Cummings, medical journalist Ruth Papazian, construction contractor Miguel Hernandez and entrepreneur Antoine Tucker. No Democrats have yet announced a primary challenge to Ocasio-Cortez, though there's been speculation that establishment Democrats could rally behind a primary challenger. Ocasio-Cortez shocked the political world in 2018 by defeating longtime Rep. Joe Crowley in a Democratic primary. Whichever Republican candidate emerges from the primary field will face a steep uphill climb in the overwhelmingly Democratic district. But Murray and others are looking to paint Ocasio-Cortez as more of a celebrity than a lawmaker, while stressing their ability to work across party lines. Murray's new campaign video, which doesn’t mention President Trump or the Republican Party, portrays Murray as a bridge-builder. She is a former state committeewoman of the New York State Republican Party. Asked during the interview if she considers herself a Trump supporter, she said “yes.” She said she is in the process of talking with national Republicans about her campaign, including South Carolina Sen. Tim Scott, a prominent black Republican in Congress. She expressed disgust over the recent spat between Trump and Ocasio-Cortez and her allies. Trump has taken heat for telling Ocasio-Cortez and other minority progressives to \"go back\" to where they came from – provoking accusations from Democrats that Trump's comments are racist. “I think it’s disgusting, to be quite honest,” Murray said of the controversy, without specifying which part of it disgusts her. “I think we are missing the point of why we’re elected to public office: to legislate on policy, to deliver results to those kitchen table issues that are affecting everyday Americans.” Murray later clarified her thoughts on the back-and-forth, saying of Trump's tweet, \"Is that how I would have worded it? No. Do I think the president is a racist? No.\" She added, \"But I want to get back to the core of why we’re even talking about this – there is a crisis at our border.\" Murray, who grew up in Southeast Queens and worked for the city’s Jamaica Bus Depot as a teenager, founded a television production and advertising company called The Esemel Group in 2004. She said her business generated employment for minorities in New York City. She said she no longer works for the company and is now a full-time mother. The GOP primary will take place in June 2020. Winning a general election in New York’s 14th congressional district would be a long shot for any Republican: In 2018, Ocasio-Cortez’s GOP opponent, Anthony Pappas, won just 14 percent of the vote. But Murray still insists a Republican could win – even in a Democratic-controlled district – because of dissatisfaction with Ocasio-Cortez. “A Republican can win the district,” she said. “There is an absolute path to victory when you look at a general election campaign.”",
      "date": "July 17",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Ocasio-Cortez: Nobody is ‘heartbroken’ at the prospect of losing private health insurance",
      "url": "https://www.foxnews.com/politics/ocasio-cortez-nobody-is-heartbroken-at-the-prospect-of-losing-private-health-insurance",
      "subtitle": "Ocasio-Cortez: Nobody is ‘heartbroken’ at the prospect of losing private health insurance",
      "author": "",
      "content": "Rep. Alexandria Ocasio-Cortez, D-N.Y., said on Wednesday nobody is \"heartbroken\" by the prospect of losing their private health insurance if Medicare for All were to be implemented. Her comments were first reported by Bloomberg's Sahil Kapur. \"@AOC, asked about warnings from Joe Biden on Medicare for All, says nobody is ‘heartbroken' at the idea of losing private insurance. ‘People like their health care, they like their doctor,' she says. ‘But I’d be interested in what the public polling on Aetna would look like,'\" Kapur tweeted. CLICK HERE TO GET THE FOX NEWS APP Earlier this week, Sen. Bernie Sanders, I-Vt., estimated his Medicare for All proposal would cost up to $40 trillion over 10 years. Sanders has also said he would raise taxes, including for the middle class, to pay for Medicare for All, and that \"there will be pain\" in a transition to a single-payer system. Former Vice President Joe Biden's healthcare plan, released on Monday, does not go as far as Medicare for All. His proposal includes a public option to buy into a Medicare-like plan and wouldn't eliminate private health insurance. Click for more from The Washington Free Beacon",
      "date": "July 18",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez thanks Bernie Sanders, Elizabeth Warren for defending Ilhan Omar after Trump’s 9/11 video",
      "url": "https://www.foxnews.com/politics/alexandria-ocasio-cortez-bernie-sanders-elizabeth-warren-ilhan-omar-trump-september-11",
      "subtitle": "Alexandria Ocasio-Cortez thanks Bernie Sanders, Elizabeth Warren for defending Ilhan Omar after Trump’s 9/11 video",
      "author": "Kathleen Joyce",
      "content": " Rep. Alexandria Ocasio-Cortez, D-N.Y., thanked those who came out in support of Rep. Ilhan Omar, D-Minn., after President Trump tweeted a video edited to suggest that the Minnesota congresswoman was dismissive of the significance of the September 11, 2001, terrorist attacks on the U.S. Ocasio-Cortez, 29, called on members of Congress to respond to Trump’s “explicit attack today.” AOC FACES BACKLASH FOR USING ‘FIRST THEY CAME…’ HOLOCAUST POEM IN DEFENSE OF OMAR “Ilhan Omar’s life is in danger. For our colleagues to be silent is to be complicit in the outright, dangerous targeting of a member of Congress. We must speak out,” she tweeted Friday. The freshman congresswoman thanked Sen. Bernie Sanders, I-Vt., for applauding Omar’s “strength and courage.” “She won’t back down to Trump’s racism and hate, and neither will we. The disgusting and dangerous attacks against her end,” Sanders tweeted. Ocasio-Cortez then thanked Sen. Elizabeth Warren, D-Mass., for calling out others who refused to condemn Trump’s video. WHITE HOUSE RIPS OMAR FOR CALLING STEPHEN MILLER A ‘WHITE NATIONALIST,’ HIGHLIGHTS HER ‘HISTORY OF ANTI-SEMITIC COMMENTS’ “The President is inciting against a sitting Congresswoman – and an entire group of Americans based on their religion. It’s disgusting. It’s shameful. And any elected leader who refuses to condemn it shares responsibility for it,” Warren tweeted. “Thank you for standing up for all of us, Sen. Elizabeth Warren,” Ocasio-Cortez said. The New York congresswoman retweeted comments from others who defended Omar including 2020 presidential contender Julian Castro and Rep. Antonio Delgado, D-N.Y. House Speaker Nancy Pelosi commented on Trump's video, saying \"The president shouldn't use the painful images of 9/11 for a political attack.\" “As we visit our troops in Stuttgart to thank them and be briefed by them, we honor our first responsibility as leaders to protect and defend the American people. It is wrong for the President, as Commander-in-Chief, to fan the flames to make anyone less safe,\" Pelosi said in a statement. Trump’s video pulled a snippet of Omar’s speech last month to the Council on American-Islamic Relations in which she described the 2001 terrorist attacks on the World Trade Center as \"some people did something,\" as well as news footage of the hijacked planes hitting the towers. Trump on Friday tweeted, \"WE WILL NEVER FORGET!\" In the speech, Omar, who is one of the first Muslim women to serve in Congress, told CAIR in Los Angeles that many Muslims saw their civil liberties eroded after the attacks, and she advocated for activism. \"For far too long we have lived with the discomfort of being a second-class citizen and, frankly, I'm tired of it, and every single Muslim in this country should be tired of it,\" she said in the March 23 speech, according to video posted online. \"CAIR was founded after 9/11 because they recognized that some people did something and that all of us were starting to lose access to our civil liberties.\" CAIR was founded in 1994, according to its website, but its membership increased dramatically following the attacks. Her comments prompted responses from Rep. Dan Crenshaw, R-Texas, who called her remarks \"unbelievable.\" Thursday’s cover of the New York Post addressed her remarks with a front page that featured an infamous photo of New York City’s Twin Towers on fire on the day of the attacks. The Associated Press contributed to this report.",
      "date": "April 13",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez shuns Hollywood elites in West Coast tour",
      "url": "https://www.foxnews.com/politics/alexandria-ocasio-cortez-shuns-hollywood-elites-in-west-coast-tour",
      "subtitle": "Alexandria Ocasio-Cortez shuns Hollywood elites in West Coast tour",
      "author": "Adam Shaw",
      "content": " New York congressional candidate Alexandria Ocasio-Cortez, currently one of the leading lights of the Democrats’ left-wing, is on a tour of the West Coast -- but is notably avoiding meeting up with the region’s Hollywood elites. Ocasio-Cortez, who represents the party’s democratic socialist wing, has visited homeless areas on Los Angeles’ Skid Row neighborhood, and has met with liberal activists. But as she has held low-dollar fundraisers, she has not engaged in glitzy events with high-profile Democratic donors and Hollywood celebrities. The move has already raised eyebrows, with The Hollywood Reporter asking: “Is Alexandria Ocasio-Cortez Too Far Left for Hollywood?” The outlet reported that it reached out to a number of “political operatives” and “members of the industry’s donor class,” who all said they were not aware of any meetings with her -- while others weren’t aware she was in L.A. She also reportedly didn’t reach out to L.A. Mayor Eric Garcetti. Instead she held an event with a $27-a-head fee, or $10 for students. The move is is line with her campaign -- which was not supported by the Democratic Party machine, did not receive significant funding, and still managed to upend expectations as she beat Democratic Party mainstay Rep. Joe Crowley, D-N.Y. While she has picked up the backing of some Hollywood celebrities, such as Susan Sarandon and Chelsea Handler, and has engaged in a whirlwind media tour, Ocasio-Cortez has so far held back from getting too close from the Democratic and Hollywood elites -- unlike other key Democratic figures like former President Barack Obama or 2016 presidential nominee Hillary Clinton, who were both comfortable in such circles. Even Sanders, with whom Ocasio-Cortez has allied, occasionally dabbled in the Hollywood fundraising circuit, despite promising not to raise money from millionaires and billionaires. In 2015 he was welcomed at a campaign fundraiser at the Hollywood home of real estate agent Syd Leibovitch -- where those who spent $2,700 or who raised $10,000 were invited to a \"pre-event reception.\" SOCIALIST CANDIDATE OCASIO-CORTEZ ONCE SAW HERSELF AS SMITHIAN CAPITALIST, VIEWED FEMINISM AS 'RELIC' She has embraced far-left issues such as Medicare-for-all and calls to abolish Immigration and Customs Enforcement (ICE.) She represents a rising left-wing within the party that has only been growing since democratic socialist Sen. Bernie Sanders, I-Vt., made a surprisingly strong primary challenge against eventual 2016 presidential nominee Hillary Clinton. But Ocasio-Cortez’s rapid ascension from unknown candidate to political celebrity has raised concerns from more mainstream Democrats about how her brand of hard-left democratic socialism will play outside of left-wing hubs of New York City and Los Angeles. Joe Lieberman, who was the Democratic Party's candidate for vice president in 2000, in an interview with Fox News last month, said that Ocasio-Cortez’s ideas will struggle to gain support across America. \"When I see somebody who really says she's a socialist -- she's a very captivating, charismatic candidate -- when you look at those policies, those policies will not be supported in many places across America,\" Lieberman said. Former President Barack Obama issued a lengthy list of midterm endorsements last week -- a list which notably did not include Ocasio-Cortez. That nervousness is unlikely to have been soothed by recent media appearances. In a recent interview with “The Daily Show” she struggled to lay out how she’d fund her agenda -- that interview quickly went viral in delighted right-wing circles. She also got into trouble after she referred to Israel's \"occupation\" of Palestine, before admitting she was \"not the expert\" on the subject. But in L.A., the enthusiasm for her only appears to be growing. The Hollywood Reporter reported that an event with Ocasio-Cortez quickly sold out with almost no marketing. \"She really inspires me, because she's so young and she's getting so far,\" said Melainey Jane Foerster, 16, a high-school student from suburban Santa Clarita, told The Associated Press. “She’s new, she’s a fresh voice — and we’ve been lacking that,’’ Faith Eberling, a longtime San Francisco Democrat, told Politico. The Associated Press contributed to this report.",
      "date": "August 4, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez slams Aaron Sorkin for telling new Dems to 'stop acting like young people'",
      "url": "https://www.foxnews.com/politics/alexandria-ocasio-cortez-filmmaker-aaron-sorkin-for-saying-new-dems-stop-acting-like-young-people",
      "subtitle": "Alexandria Ocasio-Cortez slams Aaron Sorkin for telling new Dems to 'stop acting like young people'",
      "author": "Frank Miles",
      "content": " Rep. Alexandria Ocasio-Cortez fired back Sunday at liberal Hollywood writer-director Aaron Sorkin after he claimed that the new Democrats in Congress should “stop acting like young people.” Sorkin, creator of “The West Wing,” talked about politics and the current state of America during an interview with CNN’s Fareed Zakaria. The average age of Congress’s new freshman class is 49, making it the youngest class in the past three cycles. Sorkin noted the Democrats have gotten too progressive. “I think there’s great opportunity here, now more than ever, for Democrats to be the non-stupid party,” he said. He also said Democrats need to think more about average Americans: “...That we haven’t forgotten the economic anxiety of the middle class but we’re going to be smart about this, we’re not going to be mean about it.” Ocasio-Cortez, who was sworn in earlier this month as a Democratic congresswoman from New York, hit back by citing some of her platforms. “News Flash: Medicare for All & equal rights aren’t trends,” 29-year-old Ocasio-Cortez, the youngest woman elected to the House, tweeted attaching the Sorkin video. “When people complain about low turnout in some demos, it’s not because communities are apathetic, it’s bc they don’t see you fighting for them,” Ocasio-Cortez added. “If we don’t show up for people, why should you feel entitled to their vote?” JAMES WOODS CALLS OCASIO-CORTEZ 'DANGEROUS,' BUT RESPECTS HER She spent the next hour on Twitter, tweeting in response. “Men have ‘gravitas,’ women get ‘likeable,’” she said, bringing up identity politics. She added: “If you notice, on the right they’ll flatly call people blanket terms, and even make things up. And I don’t mean trolls - I mean their biggest commentators + TV figures.” CLICK HERE TO GET THE FOX NEWS APP Members of the historic freshman class of House Democrats — together — helped flip the House from Republican control in November’s elections. The celebrity-studded group includes a record number of women, a new crop of veterans and diversity never before seen in Congress. The Associated Press contributed to this report.",
      "date": "January 20",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Ocasio-Cortez demands McConnell stop 'giving bogus excuses' and pass gun background check bill",
      "url": "https://www.foxnews.com/politics/ocasio-cortez-demands-mcconnell-stop-giving-bogus-excuses-and-pass-gun-background-check-bill",
      "subtitle": "Ocasio-Cortez demands McConnell stop 'giving bogus excuses' and pass gun background check bill",
      "author": "Andrew O'Reilly",
      "content": " In the wake of the mass shootings in El Paso, Texas, and Dayton, Ohio, Rep. Alexandria Ocasio-Cortez, D-N.Y., slammed Senate Majority Leader Mitch McConnell, R-Ky., for failing to call a vote on a gun reform bill that the Democratically-controlled House of Representatives passed in February. McConnell tweeted on Saturday that he and the country were \"horrified\" by the \"senseless violence\" in El Paso, where a lone gunman opened fire inside a Walmart and left at least 20 people dead and dozens more wounded. Following McConnell’s tweet, another gunman attacked a popular nightlife district in Dayton in the early hours of Sunday morning. Ocasio-Cortez called out McConnell in a tweet on Sunday for “giving bogus excuses” as to why the Senate hasn’t taken up the measure passed in the House that would tighten background checks for people seeking to purchase a firearm. POLITICIANS RESPOND TO SHOOTING AT WALMART IN EL PASO \"The House passed HR8, a Bipartisan Background Checks Act, *5 months ago* and the Senate has yet to vote on it,\" Ocasio-Cortez tweeted in response to McConnell’s own tweet. \"It was one of our 1st major priorities after ending the gov shutdown. You’ve been sitting on it since February giving bogus excuses. Care to explain the people why?\" The measure, HR 8, was passed back in February with overwhelming support from the newly elected Democratic majority and some Republican support. Ocasio-Cortez wasn’t the only lawmaker to call on McConnell to bring the resolution to a vote in the Senate. CLICK HERE TO GET THE FOX NEWS APP Sen. Bernie Sanders of Vermont, a leading candidate in the 2020 Democratic presidential primary, and Sen. Sherrod Brown, D-Ohio, also demanded that McConnell call the Senate back into session and take up a vote of the resolution. “Mitch McConnell should bring the Senate back into session immediately to pass HR 8, the gun safety bill that has already passed the House,” Sanders tweeted. “That's a first step to addressing our serious gun violence epidemic.”",
      "date": "August 4",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez tells Colbert she gives ‘zero’ f---s about Dem pushback",
      "url": "https://www.foxnews.com/politics/alexandria-ocasio-cortez-tells-colbert-she-gives-zero-f-s-about-pushback-from-dems",
      "subtitle": "Alexandria Ocasio-Cortez tells Colbert she gives ‘zero’ f---s about Dem pushback",
      "author": "Adam Shaw",
      "content": " Rep. Alexandria Ocasio-Cortez, D-NY, brushed off criticism from establishment Democrats on Monday, saying she gave “zero” f---s about the pushback to her radical push in Congress since she took office in January. Ocasio-Cortez was interviewed by talk show host Stephen Colbert, who mentioned the resistance she was facing from some within her party to her combative and radically left-wing stances on certain issues such as a Green New Deal and Medicare-for-all. OCASIO-CORTEZ HITS BACK AT DEMS FRETTING OVER HER 'TWITTER STAR' STATUS “Now, congresswoman, for you and other freshmen members of Congress, you're getting a fair amount of pushback, privately and publicly, from more established members of  even your own party saying ‘wait your turn, go slow, don't ask for so much so fast right now, you're new, wait your turn for everything and don't make waves,'\" Colbert said. “On a scale from zero to some, how many f---s do you give?” he later asked. “I think it’s zero,” Ocasio-Cortez responded. Ocasio-Cortez, who has become something of a media star since she ousted longtime Rep. Joe Crowley in a primary last year, has shot back before at critics from within her party before. Politico reported this month that parts of the caucus are mounting an operation to bring her into line, and warning her to stop “sniping” inside the tent. “She needs to decide: Does she want to be an effective legislator or just continue being a Twitter star?” one House Democrat told the outlet. “There’s a difference between being an activist and a lawmaker in Congress.” That sentiment was echoed by former Sen. Joe Lieberman, who said on Fox Business Network that Ocasio-Cortez should not be the future of the party. “With all respect,” he told Fox Business’ Neil Cavuto, “I certainly hope she’s not the future and I don’t believe she is.” OCASIO-CORTEZ CALLS CLIMATE CHANGE 'OUR WORLD WAR II,' WARNS THE WORLD WILL END IN 12 YEARS But Ocasio-Cortez swiped back with a snarky: “New party, who dis?” (a play on “new phone, who dis?” a meme people use to pretend not to know who a texter is). As for the Politico article, she tweeted a quote from comic book writer Alan Moore: “None of you understand. I'm not locked up in here with YOU. You're locked up in here with ME.” She also appeared in a video lending her support to the grassroots Justice Democrats, who backed her longshot bid against Crowley and runs a campaign to oust incumbent Democrats in favor of more liberal replacements. CLICK HERE TO GET THE FOX NEWS APP “There’s a lot of people in the Democratic caucus. When we are courageous enough to puncture the silence on an issue, they will move,” she says. “You can make 10 years worth of change in one term if you’re not afraid,” she later adds.",
      "date": "January 22",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Ocasio-Cortez claims climate change is driving migrant crisis",
      "url": "https://www.foxnews.com/politics/ocasio-cortez-claims-climate-change-is-driving-migrant-crisis",
      "subtitle": "Ocasio-Cortez claims climate change is driving migrant crisis",
      "author": "Stephen Sorace",
      "content": " Rep. Alexandria Ocasio-Cortez, D-N.Y., claimed climate change is a “major factor” of the global migrant crisis after earlier suggesting that the United States would have “blood on our hands” if legislation is not passed to tackle climate change. “The far-right loves to drum up fear & resistance to immigrants,” the freshman congresswoman tweeted on Tuesday. “But have you ever noticed they never talk about what‘s causing people to flee their homes in the first place? ALEXANDRIA OCASIO-CORTEZ SUGGESTS US WILL HAVE 'BLOOD ON OUR HANDS' IF CLIMATE CHANGE ISN'T TACKLED “Perhaps that’s bc they’d be forced to confront 1 major factor fueling global migration: Climate change.” But for many migrants traveling from Central America, violent crime and extreme poverty are the driving forces of migration. El Salvador has one of the highest murder rates in the world, due in part, to gangs like MS-13, which was started by Salvadoran immigrants in the U.S. and spread to El Salvador and other countries. In Honduras, nearly two-thirds of the population, or almost 5.5 million people, live in poverty, according to the World Bank. Per capita income averages just $120 per month. Earlier Tuesday, Ocasio-Cortez discussed the role of global warming and national security at a House Oversight Committee hearing with John Kerry, the former Secretary of State, and Chuck Hagel, the former Secretary of Defense. CALIFORNIA GOV. GAVIN NEWSOM PLANS CENTRAL AMERICA TRIP TO EXAMINE 'ROOT CAUSES OF MIGRATION' “So I think what we have laid out here is a very clear moral problem and in terms of leadership, if we fail to act or even if we delay in acting, we will have blood on our hands?” asked Ocasio-Cortez. “I don’t know if you’re allowed to agree with that Secretary Kerry or Secretary Hagel, but would you agree with that assessment?” Kerry responded that “we are complicit” as long as nothing is done to stem climate change. “And we’re going to contribute to people dying, we’re going to contribute to trillions of dollars of damage to property and we will change the face of life on this planet,” he said. CLICK HERE FOR THE FOX NEWS APP Ocasio-Cortez has championed the Green New Deal, a radical measure that calls for a massive overhaul of the nation’s economy and energy use to cut emissions. It is estimated to cost up to $93 trillion or $600,000 per household, according to studies. A test vote on the proposal recently failed in the Senate with no senator voting to begin debate on the legislation. Fox News' Chris Irvine and Frank Miles contributed to this report.",
      "date": "April 10",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez joins protest outside White House, calls for TPS amnesty",
      "url": "https://www.foxnews.com/politics/alexandria-ocasio-cortez-joins-protest-outside-white-house-calls-for-tps-amnesty",
      "subtitle": "Alexandria Ocasio-Cortez joins protest outside White House, calls for TPS amnesty",
      "author": "Liam Quinn",
      "content": " Rep. Alexandria Ocasio-Cortez is taking her fight for sweeping immigration reform right to Donald Trump’s doorstep. The rising democratic socialist star didn’t let a little rain stop her from joining a crowd of protesters calling on the Trump administration to let migrants in the country on Temporary Protected Status orders stay permanently. The freshman Democrat addressed the crowd, saying: “We are here to make sure that all TPS recipients become permanent members of the United States of America. OCASIO-CORTEZ CALLS TO ABOLISH ICE, SAYS LATINOS MUST BE EXEMPT FROM IMMIGRATION LAWS BECAUSE THEY ARE 'NATIVE' TO US “We are fighting for the longstanding principle and the longstanding that the people who built this country, stay in this country. “And we are part of the long, long fight for the people whose hands built this country be honored and respected in the United States of America.” Ocasio-Cortez’s remarks drew cheers from the crowd. Rep. Ayanna Pressley, D-Mass., also spoke at the rally, and said she hopes the White House can “see the humanity” in TPS holders, according to The Hill. OCASIO-CORTEZ BLASTS TRUMP'S COMPARISON OF GREEN NEW DEAL TO 'HS TERM PAPER' The event was organized by the National TPS Alliance. CLICK HERE FOR THE FOX NEWS APP TPS is a program that allows certain immigrants who have fled armed conflicts or natural disasters – such as those from El Salvador and Haiti – to live and work in the U.S. for a limited time.",
      "date": "February 12",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Ocasio-Cortez says her ex-chief of staff's attacks on moderate Dems were 'divisive'",
      "url": "https://www.foxnews.com/politics/ocasio-cortez-says-her-ex-chief-of-staff-attacks-on-moderate-dems-were-divisive",
      "subtitle": "Ocasio-Cortez says her ex-chief of staff's attacks on moderate Dems were 'divisive'",
      "author": "Lukas Mikelionis",
      "content": "  Rep. Alexandria Ocasio-Cortez continues to shun responsibility for heightened tensions among House Democrats, distancing herself from her former chief of staff Saikrat Chakrabarti whose attacks on moderates she called “divisive.” Her comments came soon after Chakrabarti’s surprise resignation earlier this month following a series of controversies that contributed to public divisions within the House Democratic Caucus. OCASIO-CORTEZ'S EMBATTLED CHIEF OF STAFF LEAVING POST AFTER CONTROVERSIES “I think it was divisive,” Ocasio-Cortez said during an interview with the New York Daily News, though she insisted the resignation had nothing to do with Chakrabarti’s attack on moderates. “I believe in criticizing stances, but I don't believe in specifically targeting members.”  She added that her office then spoke with Chakrabarti, prompting him to “immediately [take] the tweet down.” Chakrabarti, who helped manage Ocasio-Cortez’s upstart 2018 campaign, drew the ire of Democrats last month when he publicly criticized party moderates during policy spats between progressive members and party leadership. In June, he tweeted that Rep. Sharice Davids, D-Kansas, one of the first two Native American women to serve in Congress, enabled a racist system after she voted in favor of a Senate border bill not backed by progressives. HOUSE DEMOCRATIC CAUCUS RIPS AOC'S CHIEF OF STAFF FOR CRITICIZING LAWMAKER: 'KEEP HER NAME OUT OF YOUR MOUTH' “Who is this guy and why is he explicitly singling out a Native American woman of color?” the House Democratic Caucus' official account tweeted last month. \"Her name is Congresswoman Davids, not Sharice,\" the House Democrats added. \"She is a phenomenal new member who flipped a red seat blue.\" \"Keep Her Name Out Of Your Mouth,\" the tweet concluded -- with interspersed emojis of clapping hands. In July, Chakrabarti described centrist Democrats who blocked a liberal-backed emergency border bill as the \"new Southern Democrats.\" They “certainly seem hell bent [sic] to do to black and brown people today what the old Southern Democrats did in the 40s,” he tweeted in a now-deleted post. CLICK HERE TO GET THE FOX NEWS APP Chakrabarti’s comments contributed to the combative relationship between the progressive freshmen Democrats and House Speaker Nancy Pelosi, who took a swipe at Ocasio-Cortez along with Reps. Ilhan Omar of Minnesota, Rashida Tlaib of Michigan, and Ayanna Pressley of Massachusetts – whom she called \"four people\" who don't have any following. Ocasio-Cortez said they were singled out because they are newly elected women of color, further deepening divisions within the party. Democratic lawmakers, meanwhile, asked Ocasio-Cortez to fire Chakrabarti in an attempt to start over. His resignation came shortly after Ocasio-Cortez met with Pelosi in an effort to ease the tensions in the caucus. Fox News’ Louis Casiano contributed to this report.",
      "date": "August 9",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez faces questions after her boyfriend gets congressional email account",
      "url": "https://www.foxnews.com/politics/alexandria-ocasio-cortez-faces-questions-after-her-boyfriend-gets-congressional-email-account",
      "subtitle": "Alexandria Ocasio-Cortez faces questions after her boyfriend gets congressional email account",
      "author": "Lukas Mikelionis",
      "content": " Rep. Alexandria Ocasio-Cortez is facing ethics questions after revelations the freshman lawmaker's office gave her boyfriend a congressional email account. The democratic socialist waded into the issue in response to a tweet alleging boyfriend Riley Roberts had been put on staff. The tweet included a screenshot of an official House email address. Ocasio-Cortez insisted that he was only given the email account so he could access her calendar. “Actually this calendar designation is a permission so he can have access to my Google Calendar. Congressional spouses get Gcal access all the time,” Ocasio-Cortez wrote, after political consultant Luke Thompson tweeted the picture showing Roberts having an official account like other staffers on the Hill. \"Next time check your facts before you tweet nonsense.\" AMAZON BLASTS OCASIO-CORTEZ, SAYS 'WE DON'T WANT TO WORK IN THIS ENVIRONMENT IN THE LONG TERM' Asked about the arrangement, David O'Boyle, the spokesperson for the Office of the Chief Administrative Officer, told Fox News: \"From time to time, at the request of members, spouses and partners are provided House email accounts for the purposes of viewing the member’s calendar.\" But Jason Chaffetz, former chairman of the House Oversight Committee, said Ocasio-Cortez' claims don’t stack up. \"It’s totally naïve and inappropriate – you wouldn’t allow it in most companies, let alone the House of Representatives. There should be real consequences,” Chaffetz told Fox News. “When I was in the House, my scheduler would forward my wife my schedule once a week. But you’re not allowed unfettered access. And he isn’t even her spouse,” he added. “... It should be referred to the ethics committee for further investigation.” Meanwhile, Thompson's tweet touched off a Twitter battle with the congresswoman's staff. Saikat Chakrabarti, the congresswoman’s chief of staff, insisted that the boyfriend isn’t on the payroll and that he’s not doing any work related to the government. “He's not paid. We have no volunteers in the office. He's not doing any government work. He can see her calendar just like spouses/partners/family members in other congressional office,” he wrote, adding in another tweet, “Spouses and partners normally get http://mail.house.gov e-mail addresses for the purpose of getting calendar access.” ALEXANDRIA OCASIO-CORTEZ CALLS GREEN NEW DEAL A 'LIFE AND DEATH' ISSUE, ATTACKS GOP ON CLIMATE CHANGE House IT rules generally prohibit the use of “the House’s electronic mail systems and resources” by unauthorized members, and only “U.S. House of Representative Members, Officers, Employees, Fellows, Interns and Contractors” with appropriate permission can use the system. Still, O'Boyle cited the practice of sometimes allowing spouses access. Chaffetz said that Roberts having email access could also create other security issues and the matter should be referred to the Capitol Police for further investigation. “Being given a password to get into the House computer system has other potentially problematic issues,” he said. CLICK HERE FOR THE FOX NEWS APP Ocasio-Cortez’s office did not respond to Fox News’ requests for comment.",
      "date": "February 15",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Ocasio-Cortez uses Pelosi's own words against her after being accused of insulting House speaker",
      "url": "https://www.foxnews.com/politics/ocasio-cortez-pelosi-insult-democrat-speaker",
      "subtitle": "Ocasio-Cortez uses Pelosi's own words against her after being accused of insulting House speaker",
      "author": "Liam Quinn",
      "content": " Rep. Alexandria Ocasio-Cortez isn’t listening to accusations she insulted House Speaker Nancy Pelosi. Ocasio-Cortez, D-N.Y., pushed back on the claim after it was raised in an opinion piece published by The Independent, even invoking some of Pelosi’s own previous statements in the process. Responding to the piece, titled “Alexandria Ocasio-Cortez shouldn't insult Nancy Pelosi. She should learn from her,” the freshman New Yorker turned the Speaker’s words against her. “‘A glass of water could’ve [beat a 20-yr incumbt].’ ‘The Green Dream or whatever.’ ‘Their public whatever.’ AOC FIRES BACK AFTER PELOSI BLASTS FAR-LEFT DEMS' 'TWITTER WORLD' “Those aren’t quotes from me; they‘re from the Speaker. Having respect for ourselves doesn’t mean we lack respect for her. “It means we won’t let everyday people be dismissed.” AOC’s tweet was the latest in a string of tense clashes between her and Pelosi, D-Calif., and came just days after a New York Times interview in which the speaker criticized her fellow Democrat. “All these people have their public whatever and their Twitter world,” Pelosi told the Times, referring to Ocasio-Cortez, Reps. Ilhan Omar, D-Minn., Rashida Tlaib, D-Mich., and Ayanna Pressley, D-Mass., all of whom voted against the House's $4.5 billion bill to address humanitarian issues at the U.S.-Mexico border. PELOSI ON AOC, OMAR, OTHERS: 'THESE PEOPLE HAVE THEIR PUBLIC WHATEVER AND THEIR TWITTER WORLD' “But they didn’t have any following. They’re four people and that’s how many votes they got.” In response to those comments, unsurprisingly, Ocasio-Cortez hit back on Saturday night. AOC ACCUSES GOP OF TRYING TO 'MAKE AMERICA GREAT AGAIN' BY HURTING CHILDREN, MIGRANTS “That public ‘whatever’ is called public sentiment,” she tweeted. “And wielding the power to shift it is how we actually achieve meaningful change in this country.” She then defended the use of social media by herself and her fellow newcomers in Congress, over the more traditional – and often more expensive and time-consuming – methods favored by longer-serving lawmakers. CLICK HERE TO GET THE FOX NEWS APP “I find it strange when members act as though social media isn’t important,” Ocasio-Cortez wrote. “They set millions of [dollars] on [fire] to run TV ads so people can see their message. “I haven’t dialed for dollars *once* this year,” she added, “& have more time to do my actual job. Yet we’d rather campaign like it’s 2008.”",
      "date": "July 8",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez slammed over anti-Amazon push in New York City billboard: 'Thanks for nothing'",
      "url": "https://www.foxnews.com/politics/alexandria-ocasio-cortez-slammed-over-anti-amazon-push-in-new-york-city-billboard-thanks-for-nothing",
      "subtitle": "Alexandria Ocasio-Cortez slammed over anti-Amazon push in New York City billboard: 'Thanks for nothing'",
      "author": "Liam Quinn",
      "content": "  Alexandria Ocasio-Cortez is getting some negative reviews in her home city. Fresh off helping drive Amazon’s planned headquarters out of New York City, the rising Democratic star has inspired a billboard in Times Square. “Amazon Pullout, Thanks for Nothing, AOC,” the billboard, located on 42nd street near 8th Avenue, reads. OCASIO-CORTEZ GOES ON TEAR DEFENDING ROLE IN AMAZON'S NEW YORK EXIT The high-visibility blast is funded by the Job Creators Network and will be up for all to see until next Wednesday. “The Amazon pullout is a perfect example of what we’ve been saying: socialism takes and capitalism creates,” Alfredo Ortiz, JCN president and CEO said in a release on Wednesday. “The economic consequences of the HQ2 termination gives America a small taste of the harm that is to come if Ocasio-Cortez’s anti-business canon comes to fruition and is made federal policy.” NEW YORK CITY'S DE BLASIO BLAMES AMAZON FOR CAVING ON DEAL FOR NEW HEADQUARTERS IN CITY It comes after Ocasio-Cortez vigorously defended her role in sinking Amazon’s move to New York City on Tuesday in the face of bipartisan criticism, claiming the deal would have been “one of the biggest giveaways in state history” and would have priced people out of the local community. “Frankly, the knee-jerk reaction assuming that I ‘don’t understand’ how tax giveaways to corps work is disappointing,” she tweeted. “No, it’s not possible that I could come to a different conclusion. The debate *must* be over my intelligence & understanding, instead of the merits of the deal.” The freshman Democratic New York congresswoman has faced days of criticism from normally friendly media voices and fellow Democrats over her role in Amazon's decision to pull back from building a $2.5 billion campus in the Long Island City neighborhood of Queens. Amazon had cited the opposition of “a number of state and local politicians” in its decision to abandon the plans. Ocasio-Cortez and others at the local level had pointed to incentives such as a $2.5 billion in tax breaks as a reason for their opposition. “If we were willing to give away $3 billion for this deal, we could invest those $3 billion in our district ourselves, if we wanted to. We could hire out more teachers. We can fix our subways. We can put a lot of people to work for that money, if we wanted to,” Ocasio-Cortez said last week. Mayor Bill de Blasio pushed back on that claim on Sunday. Even as he slammed Amazon for its decision, the mayor said critics wrongly suggested that tax breaks represented money that could be spent on other things. He said it wasn’t “money you had over here. And it was going over there.” CLICK TO GET THE FOX NEWS APP The Democratic mayor said: “That $3 billion that would go back in tax incentives was only after we were getting the jobs and getting the revenue.” Fellow Democratic Rep. Carolyn Maloney, D-N.Y., accused those who are against the deal, including Ocasio-Cortez, of being opposed to jobs. \"It used to be that we would protest wars. Now we are protesting jobs?” she said on CNN Friday, before criticizing the economic arguments of those opposed to the Amazon move. \"I'm a progressive too, but I'm pragmatic,” she said. “We are $4 billion less than we usually get and yet we are kicking out a company that would have been projected [to pay] over 10 years roughly $27 billion in taxes.” Amazon announced in November that it had chosen the Long Island City section of Queens for one of two new headquarters, with the other in Arlington, Va. Both would get 25,000 jobs. A third site in Nashville, Tenn., would get 5,000. The company planned to spend $2.5 billion building the New York office, choosing the area in part because of its large pool of tech talent. The governor and the mayor had argued that the project would spur economic growth that would pay for the $2.8 billion in state and city incentives many times over.",
      "date": "February 20",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "PAC aligned with Alexandria Ocasio-Cortez paid boyfriend $6G for marketing work",
      "url": "https://www.foxnews.com/politics/pac-aligned-with-ocasio-cortez-paid-6g-her-boyfriend-for-marketing-work",
      "subtitle": "PAC aligned with Alexandria Ocasio-Cortez paid boyfriend $6G for marketing work",
      "author": "Lukas Mikelionis",
      "content": " A political action committee (PAC) aligned with Rep. Alexandria Ocasio-Cortez paid her boyfriend $6,000 during the infancy of her campaign. The Brand New Congress PAC (BNC), a political arm of Brand New Congress LLC, a company that was hired by Ocasio-Cortez to run and support her campaign, paid Riley Roberts for marketing services he provided to the PAC. According to FEC records, the PAC made two payments to Roberts – one in August 2017 and one in September 2017 – both for $3,000. ALEXANDRIA OCASIO-CORTEZ SLAMMED OVER ANTI-AMAZON PUSH IN NEW YORK CITY BILLBOARD: 'THANKS FOR NOTHING' In a statement to Fox News, BNC’s Communications Director Zeynab Day said that Roberts “is a professional digital marketing and growth consultant who specializes in social media presence and subscriber engagement” and his hiring was based “on his experience managing successful advertising and social media campaigns.” “He was hired through a 2 month trial period, beginning on August 3, 2017 and worked through the end of September, 2017,” she added. “Services to the Brand New Congress PAC consisted of advertising strategies for potential growth, developing metrics, and aiding in execution of strategy to increase brand awareness for the PAC as a whole.” The revelation that a PAC aligned with Ocasio-Cortez paid Roberts was first noticed by political consultant Luke Thompson who detailed his findings in a Medium post. The post drew the attention of Ocasio-Cortez and her chief of staff Saikat Chakrabarti because it also included unverified speculation of legal impropriety and an incorrect claim that the Democrat’s campaign raised only about $3,000 while spending nearly $28,000 by October 2017 – ignoring that the campaign also raised more than $33,000 from small donors. OCASIO-CORTEZ RAISES EYEBROWS AFTER COMPARING TRUMP'S BORDER WALL TO BERLIN WALL “The conspiracy machine is in full effect & it’s been disappointing to watch professionals get duped + amplify unvetted Medium posts as truth, treating journalism like it’s a high school Livejournal rumor mill or something,” Ocasio-Cortez tweeted. “No, I don’t shadily pay my boyfriend. Come on & VET.” Ocasio-Cortez’ office did not respond to Fox News’ request for comment. The scrutiny over Ocasio-Cortez’s boyfriend follows the discovery that Roberts was given a congressional email account, with some suggesting it was an ethics violation as boyfriends don’t reach the level of partners or spouses who might otherwise be given such access. ALEXANDRIA OCASIO-CORTEZ FACES QUESTIONS AFTER HER BOYFRIEND GETS CONGRESSIONAL EMAIL ACCOUNT \"It’s totally naïve and inappropriate – you wouldn’t allow it in most companies, let alone the House of Representatives. There should be real consequences,” Jason Chaffetz, former chairman of the House Oversight Committee, told Fox News. “When I was in the House, my scheduler would forward my wife my schedule once a week. But you’re not allowed unfettered access. And he isn’t even her spouse,” he added. “... It should be referred to the ethics committee for further investigation.” CLICK TO GET THE FOX NEWS APP The spokesperson for the Office of the Chief Administrative Officer, David O'Boyle, told Fox News that “from time to time, at the request of members, spouses and partners are provided House email accounts for the purposes of viewing the member’s calendar.”",
      "date": "February 21",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez slammed by women's group for questioning if it's 'okay to still have children'",
      "url": "https://www.foxnews.com/politics/alexandria-ocasio-cortez-slammed-by-womens-group-for-questioning-if-its-okay-to-still-have-children",
      "subtitle": "Alexandria Ocasio-Cortez slammed by women's group for questioning if it's 'okay to still have children'",
      "author": "Victor Garcia",
      "content": " The leader of a women’s group has slammed Rep. Alexandria Ocasio-Cortez (D-N.Y.) and other Democrats, accusing them of making babies the “enemy” and being anti-children. “What's is old is new again. AOC questioning if it is still okay to have children because of climate change is the same apoplectic anti-child rhetoric we’ve heard before,” Penny Nance, CEO of Concerned Women for America, told Fox News. “We heard about this in the late 1960s with zero population growth crowd who warned that we needed to limit our families or doomsday would come. Now, we worry about replacement rates.” PAYMENTS TO OCASIO-CORTEZ BOYFRIEND SPUR FEC COMPLAINT FROM REPUBLICAN GROUP Ocasio-Cortez spoke about climate change and mounting student loans during an Instagram Live stream last weekend, before telling her 2.5 million followers these issues have led \"young people\" to question whether or not they should bring more children into the world. “Our planet is going to face disaster if we don’t turn this ship around,” Ocasio-Cortez said. “And so it’s basically like, there is a scientific consensus that the lives of children are going to be very difficult and it does lead, I think young people, to have a legitimate question. You know, should—is it okay to still have children?” She continued: “Not just financially because people are graduating with 20, 30, 100 thousand dollars of student loan debt so they can’t even afford to have kids in the house, but there’s also just this basic moral question, like, what do we do? “And even if you don’t have kids, there are still children here in the world and we have a moral obligation to them to leave a better world to them.” DESPITE GREEN NEW DEAL PUSH, CLIMATE CHANGE NOT A HIGH PRIORITY FOR PEOPLE IN 2019 OCASIO-CORTEZ SAYS THERE IS A 'LEGITIMATE QUESTION' THAT NEEDS TO BE ASKED: 'IS IT OKAY TO STILL HAVE CHILDREN?' Conservatives were critical of Ocasio-Cortez’s comments. Nance also called out Senate Democrats tying them to Rep. Ocasio-Cortez for voting down a bill Monday that would have protected infants that survived abortions. CLICK HERE TO GET THE FOX NEWS APP “The common thread in all of this is that the Left is rarely in favor of having babies and certainly never in favor of large families. In fact, in many cases babies are considered the enemy,” Nance told Fox News. “Sadly, it was this belief system on full display yesterday when 44 Democratic Senators voted against protecting survivors of abortion.” The bill would have protected infants that survived failed abortions and sent doctors who didn’t try to save them to prison.",
      "date": "February 27",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Rep. Alexandria Ocasio-Cortez 'supports' impeachment, says Trump's finances should be focus instead of Russia",
      "url": "https://www.foxnews.com/politics/rep-alexandria-ocasio-cortez-supports-impeachment-says-trumps-finances-should-be-focus-instead-of-russia",
      "subtitle": "Rep. Alexandria Ocasio-Cortez 'supports' impeachment, says Trump's finances should be focus instead of Russia",
      "author": "Victor Garcia",
      "content": " Freshman Democrat Alexandria Ocasio-Cortez turned up the heat on President Trump's wallet, saying investigators should focus on his taxes and financial statements instead of Russian collusion. The New York congresswoman made the statement in a press conference on Monday, during which she also addressed impeachment and the crisis in Venezuela. \"While [Trump's] talking collusion, collusion, collusion I think, in oversight, we should be talking about taxes, taxes, taxes, and his bank account, bank account, his bank account,” Ocasio-Cortez said. GREENPEACE CO-FOUNDER TEARS INTO OCASIO-CORTEZ, GREEN NEW DEAL: 'POMPOUS LITTLE TWIT' “His financial statements, because that’s where I think, actually, some of the most troubling practices are with direct relevance to the American people under the scope of oversight.” The president responded Monday to reporters at the White House who asked if he would cooperate with House Judiciary Committee chairman Jerry Nadler, who announced he is expanding his investigations in the president. “I cooperate all the time with everybody and you know the beautiful thing, no collusion. It’s all a hoax,” President Trump responded while hosting the FCS national champion North Dakota State Bison football team Monday. HOUSE DEMS LAUNCH EXPANSIVE TRUMP PROBE WITH SLEW OF DOCUMENT REQUESTS At her press conference, Ocasio-Cortez was also asked whether she thought President Trump should be impeached which she said she would be “supportive of.” “It’s been very clear that I’ve been supportive of… how I would vote in terms of impeachment,” she said. “I understand if the leadership, perhaps, would like to build a stronger case and subpoena more records or figure out what’s happening, perhaps in the Mueller investigation. I defer to the chair, I defer to the party leadership. I certainly believe there is but enough misconduct happening out of this office that would be unbecoming of any president.” DEMOCRATIC LEADERS AIM TO PUT TRUMP ON TRIAL WITH 'SLOW-BLEED' HEARING STRATEGY The socialist rising star then weighed in on the crisis in Venezuela, urging caution while addressing the humanitarian crisis and a possible U.S. intervention. \"It's important that any solution we have centers the Venezuelan people and centers the democracy of Venezuelan people first,\" Ocasio-Cortez told reporters. CLICK HERE TO GET THE FOX NEWS APP She then voiced her lack of faith in the Trump administration to handle the situation correctly. \"I am generally opposed to U.S. interventionism as a principle but particularly under this administration and under his leadership, I think it’s a profound mistake.”",
      "date": "March 4",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Reps. Ocasio-Cortez, Crenshaw clash on gun control: 'This is America outside NYC'",
      "url": "https://www.foxnews.com/politics/reps-ocasio-cortez-and-crenshaw-gun-control",
      "subtitle": "Reps. Ocasio-Cortez, Crenshaw clash on gun control: 'This is America outside NYC'",
      "author": "Andrew O'Reilly",
      "content": " Reps. Alexandria Ocasio-Cortez, D-N.Y., and Dan Crenshaw, R-Texas, clashed in personal terms Wednesday over calls for universal background checks and other gun control measures in the wake of the mass shooting in Texas that left seven dead and at least 25 injured. Ocasio-Cortez went after Crenshaw for a tweet about a Houston-area woman who used a handgun to defend herself when five men tried to rob her. “Situations like this story are why we protect the 2nd Amendment,’ Crenshaw tweeted. CELEBRITIES CALL FOR GUN CONTROL AFTER TEXAS SHOOTING: 'WE HAVE A CRISIS HERE' He added: “Side note: With universal background checks, I wouldn’t be able to let my friends borrow my handgun when they travel alone like this. We would make felons out of people just for defending themselves.” Ocasio-Cortez quickly replied, asking why he is “lending” people his guns and accusing the Texas lawmaker of giving firearms to people who have “likely abused their spouse or have a violent criminal record.” Crenshaw did not take kindly to Ocasio-Cortez’s words – responding by questioning why she thinks his friends are domestic abusers and criminals, and saying that people lend one another guns for self-defense and hunting. Crenshaw then took a shot at Ocasio-Cortez’s hometown, saying, “This is America outside NYC.” But Ocasio-Cortez didn’t back down. To those defending Crenshaw, she tweeted: \"This idea of 'I know the guy, there’s no way he beats his wife' as the way we keep guns out of the hands of abusers is ridiculous. Any person who has been abused, assaulted, etc knows that abusers often present as 'upstanding.'\" She added, \"Domestic abusers can be master manipulators. Plus, domestic abuse is a HUGE indicator for gun violence. That’s why 'vouching for friend' isn’t a substitute for a background check.\" She also said that \"if a background check would be a problem, then you shouldn’t ‘lend’ a gun,” while arguing that her state is one of the safest regarding gun violence. \"Try to keep up,\" she tweeted. Crenshaw is now the second Texas lawmaker to get into a high-profile Twitter battle since the Odessa shooting. CLICK HERE FOR THE FOX NEWS APP On Sunday, Sen. Ted Cruz, R-Texas, took actress Alyssa Milano to task over her faith-based question about where in the Bible does it say that a person has the right to own a firearm. Cruz responded, telling the anti-gun activist, it was an \"excellent\" question, \"worth considering [without] the snark of Twitter,\" before citing a few examples from the Bible. \"It is of course not the right to a modern-day firearm that is God-give [sic] but rather the right to Life & the right to Liberty. Essential to that right to life is the right to DEFEND your life & your family,\" the Texas conservative began. \"The right to self-defense is recognized repeatedly in the Bible,\" Cruz wrote, for example, \"Exodus 22:2: 'If a thief is caught breaking in at night & is struck a fatal blow, the defender is not guilty of bloodshed.' (Note, though, verse 3 says it IS murder if during daylight (ie, not self-defense).\" He also clashed with Chicago's mayor over the gun violence debate. Fox News Caleb Parke contributed to this report.",
      "date": "September 4",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Rep. Alexandria Ocasio-Cortez slams fellow Democrats again over 'racist and false' immigration tropes",
      "url": "https://www.foxnews.com/politics/rep-alexandria-ocasio-cortez-slams-fellow-democrats-again-over-racist-and-false-immigration-tropes",
      "subtitle": "Rep. Alexandria Ocasio-Cortez slams fellow Democrats again over 'racist and false' immigration tropes",
      "author": "Liam Quinn",
      "content": " Rep. Alexandria Ocasio-Cortez has taken aim at Republicans and her fellow Democrats over their approach to immigration while coming to the defense of Rep. Ilhan Omar. Ocasio-Cortez, R-N.Y., fired off a string of tweets early Wednesday morning, blasting both parties for making decisions based off “racist and false tropes” when it comes to migrants. The tweet barrage came in response to Rep. Steve Scalise, R-La., criticizing Ocasio-Cortez ally Omar, D-Minn., and calling on House Speaker Nancy Pelosi to remove the controversial Democrat from the Foreign Affairs Committee. “If we’re so concerned about implied tropes, why aren’t we concerned about this one?” AOC wrote. AOC CALLS AFGHANISTAN WAR 'DISASTROUS + WRONG' RESPONSE TO 9/11, SAYS US SHOULD HAVE TRIED 'NON-INTERVENTION' “Where was the concern last week when 26 Dems voted for a GOP amendment to expand ICE powers rooted in the racist + false trope that Latino immigrants are more dangerous than US born citizens? “The entire PREMISE of a wall is not based in fact. It’s based in a racist + non-evidence based trope that immigrants are dangerous. Yet some Dems are willing to “compromise” & spend BILLIONS on a trope because we’ve accepted some kinds of racism as realpolitik in America.” She continued: “None of this is ‘whataboutism.’ Racism and bigotry of all forms is inextricably linked. “When you don’t address them as a system and attempt to pick them apart as though they are distinct and separable issues, eventually the thing that gets advanced is white supremacy + classism.” OCASIO-CORTEZ SAYS SHE WAS NOT INVITED TO BERNIE SANDERS’ KICKOFF RALLY The tweets came after the socialist star drew heat from moderate Democrats over a reported warning she delivered during a closed-door meeting last week. Ocasio-Cortez said fellow Dems who vote with Republicans are “putting themselves on a list” -- a comment interpreted as a primary challenge threat. Ocasio-Cortez has since downplayed her comments, made in the wake of more than two dozen Democrats joining Republicans to vote for a provision requiring Immigration and Customs Enforcement to be notified if illegal immigrants attempt to purchase guns. MODERATE DEMS FUME OVER OCASIO-CORTEZ 'LIST' THREAT Still, some House Democrats aren’t happy with her talk of a “list.” “I don't think it's productive,” Michigan Rep. Dan Kildee said Saturday on Fox News’ “Cavuto Live.” He added, “I don't think we should be interfering with one another's politics. The people who elected us get to make those choices.” REP. ALEXANDRIA OCASIO-CORTEZ 'SUPPORTS' IMPEACHMENT, SAYS TRUMP'S FINANCES SHOULD BE FOCUS INSTEAD OF RUSSIA New Jersey Democratic Rep. Josh Gottheimer, a co-chairman of the Problem Solvers Caucus, said Ocasio-Cortez’s use of the word “list” was “Nixonian.” Ocasio-Cortez later claimed she wasn’t talking about a list for primary challenges. CLICK HERE TO GET THE FOX NEWS APP “I didn’t say that they were putting themselves on a list for primaries,\" Ocasio-Cortez tweeted. \"I said that by Dems distinguishing themselves by breaking off on procedural…votes, they were inadvertently making a list of targets for the GOP and for progressive advocates on their pro-ICE vote.”",
      "date": "March 6",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Cher tweets support of Ocasio-Cortez dancing",
      "url": "https://www.foxnews.com/politics/cher-tweets-support-of-ocasio-cortez-dancing",
      "subtitle": "Cher tweets support of Ocasio-Cortez dancing",
      "author": "Elizabeth Zwirz",
      "content": " Rep. Alexandria Ocasio-Cortez seems to have found a fan in Cher. The famed singer took to Twitter early Saturday in support of the new lawmaker, saying “Know The Feeling @AOC. SOMETIMES JUST GOT— --TA DANCE.” The tweet came after a clip surfaced earlier this week that showed Ocasio-Cortez dancing while she was a college student, similarly in style to the \"Breakfast Club,\" according to Page Six. The clip reportedly appeared the day she was sworn in as a member of Congress. CLICK HERE TO GET THE FOX NEWS APP The Democratic congresswoman from New York retweeted Cher’s comment, adding, “The Queen has spoken!” She separately thanked the songstress. “We can fix Congress and have fun doing it – who says we can’t multitask?” she tweeted.",
      "date": "January 5",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Ocasio-Cortez says growing cauliflower in community gardens is 'colonial'",
      "url": "https://www.foxnews.com/politics/ocasio-cortez-growing-cauliflower-colonial",
      "subtitle": "Ocasio-Cortez says growing cauliflower in community gardens is 'colonial'",
      "author": "Lukas Mikelionis",
      "content": " Rep. Alexandria Ocasio-Cortez said Sunday that growing cauliflower in community gardens is part of the “colonial” attitudes that her Green New Deal will stamp out. The New York Democrat, who introduced the proposal to tackle climate change by radically transforming the economy, posted a series of Instagram videos filmed in her home state talking about community gardens as a “core component” of her proposal. DANIEL TURNER: OCASIO-CORTEZ HAS AN AGENDA FOR BIDEN – AND IT SEEMS TO BE WORKING “What I love too is growing plants that are culturally familiar to the community. It’s so important,” she said as she filmed a community garden in the Bronx. “So that’s really how you do it right. That is such a core component of the Green New Deal is having all of these projects make sense in a cultural context, and it’s an area that we get the most pushback on because people say, ‘Why do you need to do that? That’s too hard.’” She went on to add that growing cauliflower in such gardens is a “colonial approach” and the reason communities of color oppose environmentalist movements. “But when you really think about it -- when someone says that it’s ‘too hard’ to do a green space that grows Yucca instead of, I don’t know, cauliflower or something -- what you’re doing is you’re taking a colonial approach to environmentalism,” Ocasio-Cortez said. “That is why a lot of communities of color get resistant to certain environmentalist movements because they come with the colonial lens on them.” Ocasio-Cortez has emerged as the key Democratic voice on how to tackle climate change, going as far as to slam leading presidential candidate Joe Biden over reports that he’s exploring a “middle-ground” approach to tackling the issue. ALEXANDRIA OCASIO-CORTEZ APPLAUDS BILLIONAIRE'S OFFER TO PAY OFF ACADEMIC DEBT, BUT SAYS STUDENTS SHOULDN'T HAVE TO RELY ON GENEROSITY OF OTHERS But the latest Instagram stories aren’t the first time Ocasio-Cortez linked climate change and the oppression of communities of color. Last month, the freshman Democrat said the migrant crisis is due to climate change, adding that if the U.S. doesn’t pass legislation addressing climate change, the U.S. would “have blood on our hands.” “The far-right loves to drum up fear & resistance to immigrants,” she tweeted. “But have you ever noticed they never talk about what‘s causing people to flee their homes in the first place? Perhaps that’s bc they’d be forced to confront 1 major factor fueling global migration: Climate change.” “I think what we have laid out here is a very clear moral problem,” she said at the House Oversight Committee. “If we fail to act or if we delay in acting, we will have blood on our hands.” Senate Democrats in March failed to reach the 60 votes necessary to begin debate on the Green New Deal proposal, with 42 Democrats and Sen. Bernie Sanders, I-Vt., voting “present.” The lawmakers said they didn’t vote for the proposal because it was brought to a vote by Republican Senate Majority Leader for political purposes. CLICK HERE FOR THE FOX NEWS APP Ocasio-Cortez also said in February that “there is no justice and there is no combating climate change without addressing what has happened to indigenous communities… That means that there is no fixing our economy without addressing the racial wealth gap.”",
      "date": "May 21",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez falsely claims Republicans amended Constitution to kick FDR out of office",
      "url": "https://www.foxnews.com/politics/alexandria-ocasio-cortez-falsely-claims-republicans-amended-constitution-to-kick-fdr-out-of-office",
      "subtitle": "Alexandria Ocasio-Cortez falsely claims Republicans amended Constitution to kick FDR out of office",
      "author": "",
      "content": "Rep. Alexandria Ocasio-Cortez, D-N.Y., might want to brush up on some history after asserting, incorrectly, that Republicans in Congress amended the Constitution to kick President Franklin Delano Roosevelt out of office. \"They had to amend the Constitution of the United States to make sure Roosevelt did not get reelected,\" Ocasio-Cortez said Friday during a night hall event with MSNBC with Chris Hayes. Ocasio-Cortez was referring to the 22nd Amendment of the Constitution which passed in 1947. The text of the amendment states, “No person shall be elected to the office of the President more than twice.” FDR died in 1945, meaning he was dead for a full two years before presidential term limits were implemented. This is not the first time Ocasio-Cortez has made factually dubious statements. For instance, in December of last year she claimed \"Medicare for All\" could be funded by $21 trillion in accounting errors by the Pentagon. Click to read more from the Washington Examiner.",
      "date": "March 31",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez, Liz Cheney disagree on Twitter over knowledge of 22nd Amendment, Constitution",
      "url": "https://www.foxnews.com/politics/alexandria-ocasio-cortez-and-liz-cheney-disagree-on-twitter-over-knowledge-of-22nd-amendment-constitution",
      "subtitle": "Alexandria Ocasio-Cortez, Liz Cheney disagree on Twitter over knowledge of 22nd Amendment, Constitution",
      "author": "Kathleen Joyce",
      "content": " House Reps. Liz Cheney and Alexandria Ocasio-Cortez clashed on Twitter over each other's understanding of the Constitution. Cheney, R-Wyo., took issue with a comment Ocasio-Cortez, D-N.Y., made during a recent MSNBC town hall event in which the freshman congresswoman talked about Democrats being in control of Congress in the 1930s and 1940s. “When our party was boldest, the time of the New Deal, the Great Society, the Civil Rights Act and so on, we had, and carried, supermajorities in the House, in the Senate. We carried the presidency,” she told MSNBC’s Chris Hayes. “They had to amend the Constitution of the United States to make sure (President Franklin D.) Roosevelt did not get reelected,” Ocasio-Cortez continued. ALEXANDRIA OCASIO-CORTEZ USES PRICEY CROISSANTS TO CRITICIZE OPPONENTS OF $15 MINIMUM WAGE In response to Ocasio-Cortez’s remarks, Cheney tweeted: “We knew the Democrats let dead people vote. According to AOC, they can run for president too.” The New Yorker then fired off her own response. “Hey Rep. Cheney, I see from your dead people comment that you get your news from Facebook memes, but the National Constitution Center + Newsweek are just two of many places where you can clarify your misunderstanding of the history of the 22nd Amendment,” she wrote. According to the National Constitution Center, discussion of the 22nd Amendment and a term limit began in 1944 after presidential candidate Thomas Dewey warned a “16-year term for Roosevelt was a threat to Democracy.” Roosevelt died while in office in 1945 and the 22nd Amendment was proposed by Congress in 1947. The Amendment reads, “No person shall be elected to the office of the President more than twice, and no person who has held the office of President, or acted as President, for more than two years of a term to which some of other person was elected President shall be elected to the office of the President more than once.” OCASIO-CORTEZ’S RECORD AS YOUNGEST MEMBER OF CONGRESS MAY BE CHALLENGED BY FLORIDA REPUBLICAN Cheney, who received a J.D. from the University of Chicago Law School in 1996, continued to throw barbs at Ocasio-Cortez and tweeted a video from “Schoolhouse Rock” that talks about the basics of the Constitution. “Hey AOC, I know you’re busy so I thought this short would be helpful to introduce you to the basics of the Constitution. If you’re still trying to figure out how a bill becomes a law, they have a great video on that, too,” she wrote. As of Tuesday morning, Ocasio-Cortez didn’t respond to Cheney’s latest tweet.",
      "date": "April 2",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez calls out Jared Kushner's alleged use of WhatsApp for government business",
      "url": "https://www.foxnews.com/politics/alexandria-ocasio-cortez-appears-to-call-out-jared-kushners-alleged-whatsapp-use-what-is-next-putting-nuclear-codes-in-instagram-dms",
      "subtitle": "Alexandria Ocasio-Cortez calls out Jared Kushner's alleged use of WhatsApp for government business",
      "author": "Kathleen Joyce",
      "content": " Rep. Alexandria Ocasio-Cortez, D-N.Y., appeared to call out Jared Kushner, President Trump’s senior adviser and son-in-law, over claims he used the messaging service WhatsApp during a House hearing on Tuesday. The committee met to discuss White House security clearances when the freshman congresswoman brought up media reports alleging that Kushner used WhatsApp to conduct government business outside official channels. House Oversight and Reform Committee Chairman Elijah Cummings, D-Md., said in a letter that Abbe Lowell, a Kushner lawyer, indicated said her client had used WhatsApp to conduct official business, including by communicating with “people outside the United States.” In his response letter, Lowell stressed that he didn’t say if Kushner had used WhatsApp to communicate with foreign leaders or officials. He also said he informed the committee that Kushner had complied with all protocols involving classified information. ALEXANDRIA OCASIO-CORTEZ, LIZ CHENEY DISAGREE ON TWITTER OVER KNOWLEDGE OF 22ND AMENDMENT, CONSTITUTION “We are getting reports from press and from a wide variety of sources that indicate that folks are suggesting that we are conducting foreign relations with folks with security clearances via WhatsApp,” Ocasio-Cortez said at the hearing Tuesday. “Every day that we go on without getting to the bottom of this matter is a day that we are putting hundreds if not potentially thousands of Americans at risk. I mean, really, what is next, putting nuclear codes in Instagram DMs [direct messages]? This is ridiculous. We have to get to the bottom of this.” Ocasio-Cortez said subpoenas were needed because “people in this administration are not cooperating.” “And every day that there is an insecure line of communication that could be leaked, that could be hacked, that could be screenshot-ed without proper channels is a day that we are putting our national security at risk,” she said. MSNBC, NBC NEWS STAY SILENT ON EDITOR DNC 'BULLYING CONTROVERSY,' EMBRACE OCASIO-CORTEZ WITH TOWN HALL On Monday, Cummings released a memo with details from private committee interview with whistleblower Tricia Newbold, an 18-year government employee who oversaw the issuance of clearances for some senior White House aides. She said she'd compiled a list of at least 25 officials who were initially denied security clearances last year but were eventually granted access after senior officials overruled those decisions. Cummings’ panel has been investigating security clearances issued to senior officials including Kushner. The letter comes about a month after The New York Times reported that Trump ordered officials to grant Kushner clearance despite the objections of national security officials, and after Newbold spoke to NBC News and other news outlets about her concerns. The issue is setting up another clash between the White House and the Democrat-controlled House. Cummings said he will move this week to authorize his first subpoena in the probe. Kushner failed to initially disclose numerous foreign meetings on security clearance forms, and, according to The Times, career officials recommended against granting him a clearance before Trump personally overruled them. Fox News’ Frank Miles and The Associated Press contributed to this report.",
      "date": "April 2",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez hit with FEC complaint for alleged 'subsidy scheme'",
      "url": "https://www.foxnews.com/politics/alexandria-ocasio-cortez-hit-with-fec-complaint-for-alleged-subsidy-scheme",
      "subtitle": "Alexandria Ocasio-Cortez hit with FEC complaint for alleged 'subsidy scheme'",
      "author": "Andrew Keiper",
      "content": " EXCLUSIVE -- Rep. Alexandria Ocasio-Cortez, D-N.Y., has been hit with another Federal Election Commission (FEC) complaint, this one alleging she and her campaign manager operated a “subsidy scheme” that ran afoul of campaign finance laws. The crux of the complaint, which was given exclusively to Fox News in advance of its filing Wednesday, accused Ocasio-Cortez and her campaign manager, Saikat Chakrabarti, of overseeing a \"shadowy web\" of political action committees (PACs) that allowed them to raise more cash than they could have legally. It also alleged that a limited liability company (LLC) was created to avoid federal expenditure requirements by offering Ocasio-Cortez and other Democratic candidates political consulting services at a price so low that the company apparently shut down before the election was even over. AOC DENIES DARK MONEY ALLEGATIONS IN FEC COMPLAINT The complaint named Ocasio-Cortez, Chakrabarti (now her chief of staff), the Justice Democrats PAC, the Brand New Congress PAC and Brand New Congress LLC as the overlapping entities that aimed to “subsidize cheap assistance for Ocasio-Cortez and other candidates at rates far below market value.” Ocasio-Cortez dismissed the complaint when approached for comment by Fox News Wednesday afternoon, saying: \"I mean, it's conservative interest groups just filing bogus proposals\" before walking into a House Financial Services Committee meeting. At the center of the complaint is Brand New Congress LLC, a now-defunct company owned by Chakrabarti that aimed to recruit up to 400 candidates for national office and “fully run all of their campaigns,” according to a post on the Justice Democrats PAC website. “Chakrabarti was trying to create the Uber for politics,” said Dan Backer, the conservative attorney behind the complaint. “Uber functions because of a massive subsidy from venture capital. Here, it’s subsidized by these PACs to deliver a valuable service that people need and want, but can’t be delivered at the real cost of it.” The Virginia-based attorney has made political hay with recent complaints against Ocasio-Cortez. This is Backer’s second FEC complaint against her in less than a month. He used the first as somewhat of a springboard to launch the Stop the AOC PAC, which he said has raised a few thousand dollars and conducted polling in her New York City district. Backer's Stop the AOC PAC isn't his first political action committee. In recent years, he's registered organizations such as the Stop Hillary PAC, the pro-Donald Trump Great America PAC, and the Stop Pelosi PAC. Backer said Brand New Congress LLC was guilty of providing campaign contributions known as \"in-kind\" expenditures by only charging candidates for a portion of the total cost of the service. Essentially, Backer claimed the company operated at a loss to provide its approved candidates with campaign services on the cheap. OCASIO-CORTEZ CALLS OUT JARED KUSHNER'S ALLEGED USE OF WHATSAPP FOR GOVERNMENT BUSINESS This was a problem, he said, because of a series of 1990s-era FEC Advisory Opinions which essentially explained that goods and services provided to political campaigns must be paid for at fair market value – otherwise they could be considered in-kind contributions. It was unclear what Chakrabarti and Brand New Congress charged for their services -- and Backer said this was another part of the problem. He said the private company wouldn't be subject to the same disclosure and transparency laws that PACs are. In a May 2018 blog post, the Justice Democrats PAC admitted it was offering services at a rate that would never turn a profit, and that was exactly the point. \"[The] goal of creating the LLC was not to make a profit,\" the post read, \"and as such, we made our prices as low as possible while still satisfying the FEC's requirement that we are charging something reasonable because, again, if we weren't we would essentially be doing heavily discounted work for candidates and that is illegal and immoral since fighting dark money is literally what we want to do.\" Also driving the complaint were the overlapping leadership roles of Ocasio-Cortez and Chakrabarti on the implicated organizations. Ocasio-Cortez was in charge of her campaign while simultaneously serving as a board member of the Justice Democrats PAC. Her dual role isn’t unusual, according to Brendan Quinn, a spokesman for the Center for Responsive Politics. He said it hasn’t been out of the ordinary for members of Congress to sit on boards of multiple PACs, nor is it illegal or improper. Backer said Chakrabarti, however, “was on all sides of the scheme.” He owned Brand New Congress LLC, sat on the board of the Justice Democrats PAC and co-founded the Brand New Congress PAC—all while serving as Ocasio-Cortez’s campaign manager. Coming to a conclusion in the complaint may be a lengthy process, though. CLICK HERE TO GET THE FOX NEWS APP “The FEC has only four commissioners out of its usual slate of six,” said Corey Goldstone, media strategist at the Campaign Legal Center, which identifies as a nonpartisan watchdog group. “Since federal law requires at least four votes on the six-member commission to take official action, the FEC can barely lift a finger even when violations are clear and obvious. In this case, it’s not clear there was any wrongdoing, and the allegations seem speculative. We haven’t seen evidence that the PACs improperly subsidized work for the campaign or have reason to believe that laws were broken.” Backer said he expected the gridlock at the FEC and planned to sue if his complaints sit for 120 days and litigation is allowed under law. “At the end of the day,\" Backer said, \"It would be wonderful if the FEC would get off its dysfunctional ass and rule on these things.\" Fox News' Alex Diaz and Perry Chiaramonte contributed to this report.",
      "date": "April 3",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Charles Payne: Democrats are 'afraid' of their 'de facto leader' Alexandria Ocasio-Cortez",
      "url": "https://www.foxnews.com/politics/charles-payne-democrats-are-afraid-of-their-de-facto-leader-alexandria-ocasio-cortez",
      "subtitle": "Charles Payne: Democrats are 'afraid' of their 'de facto leader' Alexandria Ocasio-Cortez",
      "author": "Anna Hopkins",
      "content": " Freshman Rep. Alexandria Ocasio-Cortez, D-N.Y., is making major waves in the party, and her fellow lawmakers are afraid of her, according to Fox Business host Charles Payne. In response to President Trump's comments about the Democrat from New York and her proposed climate change reform, the Green New Deal, Payne said Ocasio-Cortez has \"thrown her weight around\" in Congress and terrified those around her. \"We just saw a vote where the Democrats ran away from it [the Green New Deal] when they had the opportunity to, but as soon as the Green New Deal came out, all of the major presidential candidates jumped on board, and in fact, many of them are doubling down,\" Payne said on \"America's Newsroom\" on Wednesday. CHARLES PAYNE CALLS OCASIO-CORTEZ'S DEFENSE OF GREEN NEW DEAL 'DISINGENUOUS' President Trump has consistently taken aim at Ocasio-Cortez and the Green New Deal, most recently during a speech at the National Republican Congressional Committee's spring dinner on Tuesday. While addressing attendees, he encouraged them not to vote down the Green New Deal just yet because he wants to run against it in 2020. \"If they beat me with the Green New Deal, I deserve to lose,\" President Trump said. A vote on the Green New Deal was set last week by Senate Majority Leader Mitch McConnell in a bid to divide Democratic senators on the issue, and the majority of lawmakers voted not to begin debate on the non-binding resolution. In response, Payne labeled the Democrats behavior towards the plan as \"absurd,\" and said that Rep. Ocasio-Cortez is \"running the show over there, bottom line.\" CLICK HERE TO GET THE FOX NEWS APP \"Alexandria Ocasio Cortez has thrown her weight around on a number of things, and she's dramatically changed the Democratic party, and she has become the de facto leader without a doubt,\" he continued.",
      "date": "April 3",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez suggests US will have 'blood on our hands' if climate change isn't tackled",
      "url": "https://www.foxnews.com/politics/alexandria-ocasio-cortez-suggests-us-will-have-blood-on-our-hands-if-climate-change-isnt-tackled",
      "subtitle": "Alexandria Ocasio-Cortez suggests US will have 'blood on our hands' if climate change isn't tackled",
      "author": "Chris Irvine",
      "content": " Alexandria Ocasio-Cortez (D-N.Y.) has suggested that the United States would have “blood on our hands” if legislation is not passed to tackle climate change. Her comments came during a House Oversight Committee hearing Tuesday with John Kerry, the former Secretary of State, and Chuck Hagel, the former Secretary of Defense, where the subject of the role of global warming and national security was discussed. Ocasio-Cortez first asked Hagel: “Do you think that neglecting to address these threats is – could contribute to an American – the loss of American life?” PELOSI APPEARS TO MOCK OCASIO-CORTEZ OVER-RELIANCE ON TWITTER FOR SUPPORT When he responded in the affirmative, she asked: “And do you think that denial or even delaying in that action could cost us American lives?” When he again replied “yes,” she asked Kerry: “Do you think that appointing a federal panel that questions 26 years of established climate science (could) be responsible for the loss of American life?” When Kerry said: “It could be,” she again followed up: “So I think what we have laid out here is a very clear moral problem and in terms of leadership, if we fail to act or even if we delay in acting, we will have blood on our hands? I don’t know if you’re allowed to agree with that Secretary Kerry or Secretary Hagel, but would you agree with that assessment?” CROWLEY HAD DIRT ON OCASIO-CORTEZ BUT DECIDED NOT TO USE IT IN CAMPAIGN Kerry replied: “As long as we do nothing, congresswoman, we are complicit in our acts of omission and commission of what we’re doing to choose for our energy, etc. And we’re going to contribute to people dying, we’re going to contribute to trillions of dollars of damage to property and we will change the face of life on this planet.” During the hearing, Kerry also praised Ocasio-Cortez for offering “more leadership in one day or one week than President Trump has in his lifetime” on climate change. CLICK HERE FOR THE FOX NEWS APP Ocasio-Cortez, who championed the Green New Deal, responded on Twitter, saying she was “honored and humbled” by the climate.",
      "date": "April 9",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez: Kirstjen Nielsen ‘oversaw one of the largest-scale human rights violations in history’",
      "url": "https://www.foxnews.com/politics/alexandria-ocasio-cortez-kirstjen-nielsen-human-rights",
      "subtitle": "Alexandria Ocasio-Cortez: Kirstjen Nielsen ‘oversaw one of the largest-scale human rights violations in history’",
      "author": "Kathleen Joyce",
      "content": " Rep. Alexandria Ocasio-Cortez, D-N.Y., slammed outgoing Homeland Security Secretary Kirstjen Nielsen on Tuesday, saying she “oversaw one of the largest-scale human rights violations in recent history.” Ocasio-Cortez responded to a tweet regarding a New York Times’ op-ed titled “Cancel Kirstjen Nielsen.” The opinion piece addressed a report from the paper that said Nielsen stayed in her position because “she was aware how awful life would/will be for her on the outside given her role in defending Donald Trump’s policies.” NIELSEN RESIGNS AS DHS SECRETARY AFTER WHITE HOUSE MEETING WITH TRUMP “Her role in terrorizing children should make her a permanent pariah,” the piece stated. “In stealing 1000s of children, deporting their parents, & refusing to provide info for reunification, Sec. Nielsen oversaw one of the largest-scale human rights violations in recent history,” Ocasio-Cortez tweeted. “Awarding her a lucrative deal or prestigious post is to legitimize+celebrate that abuse.” The freshman congresswoman was addressing the Trump administration’s practice of separating migrant children from their families at the southern border which was carried out by Nielsen. Last summer, the administration separated more than 2,500 children from their families before international outrage forced Trump to halt the practice and a judge ordered them reunited. The government recently said in court filings that it would take up to two years to reunify all the children already separated from their families. ALEXANDRIA OCASIO-CORTEZ CLAIMS CLIMATE CHANGE IS DRIVING MIGRANT CRISIS On Sunday, President Trump announced that Nielsen “will be leaving her position” after 16 months on the job. He announced that U.S. Customs and Border Protection (CBP) Commissioner Kevin McAleenan will replace Nielsen as acting secretary, tweeting: \"I have confidence that Kevin will do a great job!\" The Associated Press contributed to this report.",
      "date": "April 10",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "‘Squad’ members Ocasio-Cortez, Pressley team up to push for Hyde Amendment repeal",
      "url": "https://www.foxnews.com/politics/squad-members-aoc-and-pressley-team-up-with-veteran-lawmaker-barbara-lee-to-push-for-hyde-amendment-repeal-on-43rd-anniversary",
      "subtitle": "‘Squad’ members Ocasio-Cortez, Pressley team up to push for Hyde Amendment repeal",
      "author": "",
      "content": "Freshman lawmakers Rep. Alexandria Ocasio-Cortez, D-N.Y., and Rep. Ayanna Pressley, D-Mass., appeared in a video on Monday with former Congressional Black Caucus Chairwoman Rep. Barbara Lee, D-Calif., to push for the repeal of the Hyde Amendment, which bans federal money from funding abortions. In the video, which was published on The Root to mark the amendment's 43rd anniversary, Pressley and Ocasio-Cortez enthusiastically back the Equal Access to Abortion Coverage in Health Insurance Act (EACH Woman Act), a bill authored by Lee that would repeal Hyde. The bill has racked up 169 co-sponsors since its introduction in March. The Hyde Amendment was \"an egregious policy rider,\" Pressley said, \"which does not allow Medicaid to include abortion coverage.\" HOUSE REAUTHORIZES HYDE AMDNEMENT, DESPITE PROTESTS FROM 2020 DEMS Hyde, which bans any federal money from paying for abortion except in cases of rape and incest, was introduced in 1976 by Illinois Rep. Henry Hyde. Democrats and Republicans have voted to keep the amendment in effect through the years, notably this June when the House passed a spending bill to which a Hyde Amendment reauthorization was attached. Some Democrats and most Republicans disagree with Lee, Pressley and Ocasio-Cortez. \"The Hyde Amendment was historically a great compromise between pro-choicers and pro-lifers,\" conservative commentator Meghan McCain said on \"The View\" in June, soon after Democratic presidential contender Joe Biden reneged on his longtime support for the Hyde Amendment. \"I feel slighted as someone who was open to him being president, and I think that it’s a dangerous lane for him to take to go super far left.\" TRUMP CALLS AOC, SCHIFF AND NADLER 'DEMOCRAT SAVAGES' AS IMPEACHMENT CALLS INTENSIFY Lee, Pressley and Ocasio-Cortez say the Hyde Amendment particularly harms poor and minority communities. \"I was a staffer in 1977 to the late, great feminist congressman Ron Dellums,\" Lee said in the video for The Root. \"I knew exactly what this would do, and that would be to deny low-income women and women of color access to the full range of reproductive rights, including abortion.\" Later in the video, Ocasio-Cortez said the trio's effort to repeal Hyde was a defense of Roe v. Wade and women's right to abortion. CLICK HERE FOR THE FOX NEWS APP \"Our access to reproductive justice and reproductive freedom should not be income-based,\" Ocasio-Cortez said. \"Repealing Hyde means that low-income women, women who are incarcerated, nonbinary people who need access to an abortion can get it, not because they are wealthy but because they are an American.\"",
      "date": "September 30",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez slams justice system amid reports of Felicity Huffman’s alleged prison sentence",
      "url": "https://www.foxnews.com/politics/alexandria-ocasio-cortez-justice-system-felicity-huffman",
      "subtitle": "Alexandria Ocasio-Cortez slams justice system amid reports of Felicity Huffman’s alleged prison sentence",
      "author": "Kathleen Joyce",
      "content": " Rep. Alexandria Ocasio-Cortez, D-N.Y., blasted the justice system amid reports actress Felicity Huffman may get a lighter prison sentence for her part in the college admissions bribery scam. Huffman, 56, agreed earlier this month that she will plead guilty to one count of conspiracy and fraud for paying a consultant $15,000 disguised as a charitable donation to boost her daughter’s SAT score. Ocasio-Cortez reacted to a tweet that said though the sentencing guideline is four to 10 months of jail time, prosecutors “will make a recommendation for the lower end of that range and will allow Huffman to argue for a 0-6 month range.” ALEXANDRIA OCASIO-CORTEZ SAYS BIDEN PRESIDENTIAL RUN WOULD BE GOING BACK, INSTEAD OF MOVING FORWARD The freshman congresswoman said the U.S. justice system “criminalizes poverty + disproportionately targets race, yet routinely pardons large-scale crimes of wealth and privilege.” “Moments like these tell us it’s less a justice system, and more a class enforcement system,” she tweeted. This is not the first time Ocasio-Cortez has commented on the college admissions scandal. In March, Ocasio-Cortez compared the scandal to political elections. CLICK HERE TO GET THE FOX NEWS APP “I guess college admissions isn’t that different from elections, where lots of money can buy your spot too. Also an enviro where those make it despite the odds are suspected to not have ‘earned’ it, not truly belong, or assumed to not be able to perform at the same level,” she wrote. Also charged in the admissions bribery scheme is \"Full House\" star Lori Loughlin and her fashion designer husband, Mossimo Giannulli. Huffman is slated to enter her guilty plea on May 24. The Associated Press contributed to this report.",
      "date": "April 17",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Bernie, Warren clamber for Ocasio-Cortez nod",
      "url": "https://www.foxnews.com/politics/bernie-warren-clamber-for-ocasio-cortez-nod",
      "subtitle": "Bernie, Warren clamber for Ocasio-Cortez nod",
      "author": "Chris Stirewalt",
      "content": " **Want FOX News Halftime Report in your inbox every day? Sign up here.**\n\nOn the roster: Bernie, Warren clamber for Ocasio-Cortez nod - Trump campaign takes aim at ‘socialist organism’ - Primary day for scandalized N.C. House race - Audible: A tough old Tom - ‘This particular collection of crusts’\n\n\nBERNIE, WARREN CLAMBER FOR OCASIO-CORTEZ NOD\nPolitico: “The Alexandria Ocasio-Cortez primary is heating up. For the second time in five days, the star freshman congresswoman is appearing alongside Bernie Sanders at a high-profile event. Rep. Ro Khanna, co-chairman of Sanders' campaign, is talking with Ocasio-Cortez's staff about the primary. And Sanders' team told POLITICO that he and Ocasio-Cortez ‘have had phone calls.’ Ocasio-Cortez's work on Sanders' 2016 campaign — and the fact that several staffers from that bid went on to work for her and the pro-Ocasio-Cortez group Justice Democrats — suggest the Vermont senator has the inside track for her coveted endorsement. But Sen. Elizabeth Warren is making an aggressive pitch for Ocasio-Cortez's nod, too: She’s met with her privately and wrote a gushing essay about her for Time magazine. An aide to Warren said their teams have been in touch.” Bernie tries to keep his outsider status - WSJ: “Bernie Sanders, the independent Vermont senator who came up through that state’s democratic socialist party, launched his insurgent campaign for president four years ago as an outsider challenging the Democratic machine. Now, in this early stage of the 2020 presidential race, Mr. Sanders is a Democratic front-runner and newly minted millionaire, with high name recognition and $18 million raised in the first six weeks of his campaign, so far outpacing his rivals.”\n\nDems approach two dozen candidates as Montana governor joins fray - HuffPost: “Montana Gov. Steve Bullock (D) is running for president, he announced on Tuesday. ‘We need to defeat Donald Trump in 2020 and defeat the corrupt system that lets campaign money drown out the people’s voice, so we can finally make good on the promise of a fair shot for everyone,’ Bullock said in a campaign launch video. Bullock … is the only Democratic candidate who has won a statewide office in a state that went for the president in 2016: In his reelection that year, Bullock won by 4 percentage points even as Trump took Montana by 20. The two-term governor, who has served in that office since 2013, would not be able to run for reelection next year due to term limits. The Montana native and former state attorney general formed a political action committee, Big Sky Values PAC, in 2017, according to MTN News.”\n\nWhile others talk college, Castro zeroes in on pre-kindergarten - AP: “Democratic presidential candidate Julián Castro on Monday unveiled an education plan that joins other 2020 candidates in calling for tuition-free higher education, universal prekindergarten and raising teacher pay. The rollout follows the former Obama Cabinet member’s immigration plan that was more detailed than many of his rivals in the sprawling Democratic field. This time, Castro is getting behind education reforms that other candidates have also embraced ahead of the first debates in June that he believes will offer his slow-building campaign a new chance to stand out. Expanding prekindergarten was arguably Castro’s signature mark during his five years as mayor of San Antonio… Castro has also come around to eliminating tuition at public colleges. He had previously stopped short of championing the idea during his campaign launch in January, instead proposing to make the first two years of college ‘affordable’ and accessible.”\n\nTHE RULEBOOK: PROMISES MADE, PROMISES KEPT\n\n“As long, therefore, as the existing republican forms are continued by the States, they are guaranteed by the federal Constitution.” – James Madison, Federalist No. 43\n\nTIME OUT: DEEPER MEANING TO MODERN ART\nNatGeo: “When the Tetraeder was built in 1994, many residents of Bottrop, a post-industrial city in western Germany, thought it a waste of public money. But now there is no ignoring the 200-foot-tall, walkable steel pyramid rising out of a mine dump, with 400 stairs leading visitors close to the top. … When you first glimpse the Tetraeder—or the Tetrahedron—you might not know what to make of the weird and wonderful structure, one that looks like a colossal piece of modern art plucked from a mathematician’s laboratory. The higher you climb the staircase within, the more it creaks and sways. This is not by accident, notes Wolfgang Christ, the Tetraeder’s architect. The feeling of being unsafe is meant to remind visitors what it was like for miners descending deep into the coal mines. By the time you clamber to the top, you feel exactly what he means. The view is worth the climb.” \n\nFlag on the play? - Email us at HALFTIMEREPORT@FOXNEWS.COM with your tips, comments or questions.\n\nSCOREBOARD\n\nTrump job performance \n\nAverage approval: 43.6 percent\nAverage disapproval: 52 percent\nNet Score: -8.4 points\nChange from one week ago: up 0.4 points  \n\n[Average includes: IBD: 43% approve - 50% disapprove; NBC News/WSJ: 46% approve - 51% disapprove; Quinnipiac University: 41% approve - 55% disapprove; Gallup: 46% approve - 50% disapprove; NPR/PBS/Marist: 42% approve - 54% disapprove.]\n\nTRUMP CAMPAIGN TAKES AIM AT ‘SOCIALIST ORGANISM’\nFox News: “Inside the Trump re-election campaign offices overlooking the Potomac River, a rapidly growing operation is confronting a challenge of historic proportions – how to run against a field of nearly two-dozen candidates, all of whom are hurling rhetorical bombs at the incumbent on a daily basis. Communications Director Tim Murtaugh, whose job is to help shape that strategy, boils it down. The field, he says, is ‘one big socialist organism with 22 heads.’ It’s a message voters can expect to hear often as the Democratic primary field settles into place, with just a few more stragglers left to join. The Trump re-election team sees a target-rich environment emerging, especially with the rise in popularity of democratic socialist Bernie Sanders and policies like ‘Medicare for All’ and the ‘Green New Deal.’ While stitching that counter-‘socialist’ theme into the fabric of their message, the campaign is now starting to hit back more at the ensemble cast of potential 2020 foes after waiting and watching for months.”\n\nPRIMARY DAY IN DO-OVER FOR SCANDALIZED N.C. HOUSE RACE \nRoll Call: “The race for North Carolina’s 9th District is the 2018 election that just won’t end. Tuesday’s Republican primary will go a long way toward determining where this competitive special election is headed next. It all started with Republican Rep. Robert Pittenger. … He lost his primary to Mark Harris… Harris then faced Democrat Dan McCready, a solar energy financier and Marine veteran. … By the end of counting in November, Harris had beaten McCready — by just 905 votes. But the North Carolina State Board of Elections delayed certifying the results in the face of election fraud allegations. … Harris declined to run for the redo contest, citing health issues. Other big names, including former Gov. Pat McCrory and Pittenger, also passed on the race, which gave way to a crowded field of 10 Republican candidates. If none of them receive more than 30 percent of the vote, the runner-up may request a runoff, which would be held on Sept. 10, followed by a general election on Nov. 5. If there’s no runoff, the general election will be held on Sept. 10.”\n\nPLAY-BY-PLAY\nHouse Dems who make a plan to keep the seats they won from Republicans - NYT\n\nPergram: ‘Why the US-China trade war could settle the 2020 election in 2019’ - Fox News\n\nReport: California will likely lose one congressional seat after 2020 Census - Sacramento Bee\n\nReport: U.S. attorney John Durham has been reviewing origins of Russia probe 'for weeks’ - Fox News\n\nAUDIBLE: A TOUGH OLD TOM  \n\n“He hopes the State of Georgia will allow him to roll over the unused limit to next year.” – Deanna Congileo, spokeswoman for former President Jimmy Carter, in a statement on the 94-year-old’s successful hip surgery following a fall. Carter was on his way to go turkey hunting when he fell and was concerned that he had yet to reach his limit for spring gobbler season. \n\nShare your color commentary: Email us at HALFTIMEREPORT@FOXNEWS.COM and please make sure to include your name and hometown.\n\n‘THIS PARTICULAR COLLECTION OF CRUSTS’\nBBC: “A confused ‘crust-omer’ opened a loaf of bread only to find the bag was full of crusts. Timea Ganji was hoping to make sandwiches for her children's lunch when she made the unlikely discovery. … Kingsmill said it was investigating how it happened and had posted Mrs. Ganji a ‘more conventional loaf.’ ‘It just looked like a normal loaf when we bought it,’ said the 41-year-old, from Radcliffe-on-Trent in Nottinghamshire. ‘Because of the yellow packaging, you can't see it properly.’ … The mum-of-two posted photos of the find on Facebook and friends shared ways to use the crusts and old sayings about the benefits of eating them. ‘Maybe I'd like curly hair but I don't want a hairy chest,’ she added.… A spokeswoman said [Kingsmill] was investigating ‘to find out how this particular collection of crusts found its way into Mrs. Ganji's shopping.’”\n\nAND NOW, A WORD FROM CHARLES…\n\n“For America today, decline is not a condition. Decline is a choice.” – Charles Krauthammer (1950-2018) writing for The Weekly Standard on Oct. 19, 2009.\n\nChris Stirewalt is the politics editor for Fox News. Brianna McClelland contributed to this report. Want FOX News Halftime Report in your inbox every day? Sign up here.",
      "date": "May 14",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Charlie Kirk: Ocasio-Cortez 'the most powerful Democrat in office'",
      "url": "https://www.foxnews.com/politics/charlie-kirk-ocasio-cortez-the-most-powerful-democrat-in-office",
      "subtitle": "Charlie Kirk: Ocasio-Cortez 'the most powerful Democrat in office'",
      "author": "Charles Creitz",
      "content": " Rep. Alexandria Ocasio-Cortez, D-N.Y., may not be in House leadership, but she is still the most powerful Democratic lawmaker in office, according to Charlie Kirk. The lack of intraparty blowback against Ocasio-Cortez for comparing detention facilities along the U.S.-Mexico border to concentration camps is evidence of this, he claimed Tuesday on Fox News' \"The Ingraham Angle.\" \"Immediately, when she says something that is historically wrong or morally incorrect, or something that's totally detestable, anyone who calls her out for that or criticizes her, all of a sudden we are attacking her,\" the Turning Point USA founder told host Laura Ingraham. \"Isn't that strange? We can't have a conversation on something she said wrong without saying 'Republicans pounce',\" he said. ALEXANDRIA OCASIO-CORTEZ: THE U.S. IS 'RUNNING CONCENTRATION CAMPS ON OUR SOUTHERN BORDER' \"Let's just be very honest. She is basically the most powerful Democrat in office right now in America.\" Kirk claimed the Bronx congresswoman's presence on Instagram and other online platforms shows she can draw more attention than some in her party. \"If you really think about it, she has more social media power, she's able to draw crowds,\" he said. \"Most of the Democrats - they couldn't fill up this crowd if they paid people. They can't fill up coffee shops,\" Kirk continued, speaking from the Amway Center in Orlando, where President Trump held a large rally Tuesday night. Kirk attributed Ocasio-Cortez's popularity to the fact she often appears \"angry\" and favors ideas popular among the party's more liberal base. \"She has the power of the base of the party because she is angry and she's committed toward these radical ideas.\" Regarding her comments about concentration camps, Kirk said the New York Democrat should feel \"shame.\" CLICK HERE TO GET THE FOX NEWS APP Ocasio-Cortez told her Instagram followers Monday the U.S. government is \"running concentration camps on our southern border.\" \"That is exactly what they are. They are concentration camps,\" Ocasio-Cortez said during a live-stream that was viewed by Fox News. \"The fact that concentrations camps are now an institutionalized practice in the Home of the Free is extraordinarily disturbing and we need to do something about it,\" the freshman Democrat continued. Fox News' Joseph Wulfsohn contributed to this report.",
      "date": "June 18",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez slams Georgia’s controversial ‘heartbeat’ bill, refers to it as ‘backdoor ban’",
      "url": "https://www.foxnews.com/politics/ocasio-cortez-slams-heartbeat-bill",
      "subtitle": "Alexandria Ocasio-Cortez slams Georgia’s controversial ‘heartbeat’ bill, refers to it as ‘backdoor ban’",
      "author": "Kathleen Joyce",
      "content": " Rep. Alexandria Ocasio-Cortez ripped the “heartbeat” bill that Georgia Gov. Brian Kemp signed into law Tuesday morning, calling it “a backdoor ban.” The controversial bill, HB 481, technically called the “Living Infants Fairness and Equality (LIFE) Act,” will prohibit abortions in Georgia after a heartbeat is detected, as early as six weeks into a pregnancy. The law allows exceptions in the case of rape, incest, or if the life of the mother is in danger. It has been called the most extreme abortion law in the nation. The Republican governor said he was aware that the bill will most likely be challenged in court. The freshman Democrat tweeted Tuesday after news that the bill was signed into law, “6 weeks pregnant = 2 weeks late on your period.” “Most of the men writing these bills don’t know the first thing about a woman’s body outside of the things they want from it. It’s relatively common for a woman to have a late period + not be pregnant. So this is a backdoor ban.” OCASIO-CORTEZ SUGGEST TRUMP 'VULNERABLE TO SHADY ACTIVITY' DUE TO ALLEGED BUSINESS LOSSES DECADES AGO Ocasio-Cortez provided some context in a follow-up tweet. “For context, this kicks in within days of a typical at-home test working. If you were sexually assaulted (stress delays cycle), took a morning-after pill (throws off cycle), or have an irregular cycle, you’d have no idea. There are a TON of ways this law ignores basic biology,” she wrote. Current law allows women in Georgia to seek an abortion during the first 20 weeks of pregnancy. If it’s not blocked in court, the new ban would take effect Jan. 1. Opponents have promised to sue over the constitutionality of the bill and argue that because some women don't know they are pregnant when a heartbeat is detectable that the new law virtually bans all abortions in the state. Georgia state Sen. Jen Jordan called the bill “an all-out abortion ban.” Jordan said she is particularly worried that the new law will push obstetricians away from practicing in Georgia, worsening health care outcomes for women in a state that already has one of the nation's worst maternal mortality rates. CLICK HERE TO GET THE FOX NEWS APP \"It's about the unintended consequences,\" Jordan said. \"They're making policy choices that are going to end up causing women to die, and they're preventable deaths.\" The state has at least 11 abortion providers, according to the National Abortion Federation. Lawmakers in other states including Tennessee, Missouri, South Carolina, Florida, Texas, Louisiana and West Virginia, are considering similar proposals. A bill that recently passed the Alabama House would outlaw abortions at any stage of pregnancy, with a few narrow exceptions. Fox News’ Caleb Parke and The Associated Press contributed to this report.",
      "date": "May 8",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez speech broke C-SPAN record",
      "url": "https://www.foxnews.com/politics/alexandria-ocasio-cortez-speech-broke-c-span-record",
      "subtitle": "Alexandria Ocasio-Cortez speech broke C-SPAN record",
      "author": "Nicole Darrah",
      "content": " Freshman Rep. Alexandria Ocasio-Cortez, D-N.Y., made C-SPAN history on Wednesday during her first speech on the floor of the House of Representatives. Ocasio-Cortez, 29, addressed her colleagues on Capitol Hill for nearly four minutes, talking about one of her constituents in the Bronx — an air traffic controller who recently missed his first paycheck due to the partial government shutdown. Her speech was posted to C-SPAN's Twitter account, and, according to Howard Mortman, communication director for the public cable network, it became the \"most-viewed\" video of a House member's remarks ever tweeted by the channel. As of Thursday night, the video of Ocasio-Cortez's speech had around 12,000 retweets and more than 40,000 likes. Mortman said it received 1.16 million views in just over 12 hours. OCASIO-CORTEZ: TRUMP IS A 'RACIST' AND PEOPLE SHOULD BE 'UNCOMFORTABLE' The record for most views for the Senate involved Sen. Kamala Harris, D-Calif., questioning then-Supreme Court nominee Brett Kavanaugh in October, Mortman added. That video received 7.14 million views. Ocasio-Cortez, who was sworn into Congress on Jan. 3, said on Thursday that the current shutdown \"is actually not about a wall, it is not about the border, and it is certainly not about the well-being of everyday Americans.\" CLICK HERE TO GET THE FOX NEWS APP \"The truth is, this shutdown is about the erosion of American democracy, and the subversion of our most basic governmental norms,\" she said. Following her first House address, the youngest member of Congress — who's been active on social media in her search of Sen. Majority Leader Mitch McConnell, R-Ky. — co-taught a social media class to fellow representatives on \"the “most effective ways to engage constituents on Twitter and the importance of digital storytelling.\"",
      "date": "January 17",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez: The U.S. is 'running concentration camps on our southern border'",
      "url": "https://www.foxnews.com/politics/alexandria-ocasio-cortez-the-u-s-is-running-concentration-camps-on-our-southern-border",
      "subtitle": "Alexandria Ocasio-Cortez: The U.S. is 'running concentration camps on our southern border'",
      "author": "Joseph A. Wulfsohn",
      "content": " Rep. Alexandria Ocasio-Cortez, D-NY, on Monday told her Instagram followers that the U.S. government is \"running concentration camps on our southern border.\" \"That is exactly what they are. They are concentration camps,\" Ocasio-Cortez said during a live-stream that was viewed by Fox News. Her office did not immediately respond to Fox News' request for comment. The freshman representative did, however, retweet a screengrab for the Q&A with a caption that praised her accessibility. She told her followers she wants to talk to people \"who are concerned enough with humanity to say that 'never again' means something.\" \"The fact that concentrations camps are now an institutionalized practice in the Home of the Free is extraordinarily disturbing and we need to do something about it,\" the freshman Democrat continued. CLICK HERE TO GET THE FOX NEWS APP The New York representative insisted that \"we are losing to an authoritarian and fascist presidency.\" \"I don't use those words lightly,\" Ocasio-Cortez continued. \"I don't use those words to just throw bombs. I use that word because that is what an administration that creates concentration camps is. A presidency that creates concentration camps is fascist and it's very difficult to say that.\"",
      "date": "June 18",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Rep. Alexandria Ocasio-Cortez mocks cringeworthy tweet by Democratic National Committee",
      "url": "https://www.foxnews.com/politics/rep-alexandria-ocasio-cortez-mocks-cringe-worthy-tweet-by-democratic-national-committee",
      "subtitle": "Rep. Alexandria Ocasio-Cortez mocks cringeworthy tweet by Democratic National Committee",
      "author": "Anna Hopkins",
      "content": " A tweet from the official account for the Democratic National Committee raised some eyebrows over the weekend, including those of Rep. Alexandria Ocasio-Cortez. The original tweet, posted on Saturday, advertised a phone number followers could text in order to get an exclusive phone wallpaper with a photo of President Trump behind the phrase \"Boy Bye.\" It was accompanied by the caption, \"This is a whole mood.\" \"Somebody didn't go to my Twitter class,\" Ocasio-Cortez jokingly responded on Tuesday. The Democratic National Committee's tweet referenced a popular Beyonce song, \"Sorry,\" in which the singer repeats the same phrase, \"Boy, bye.\" In this case, however, the Democratic account appears to be referring to the impeachment of the president, or his defeat in the 2020 election. HOUSE JUDICIARY CHAIR BACKS AOC'S TWEET COMPARING MIGRANT CENTERS TO CONCENTRATION CAMPS TOMI LAHREN: ALEXANDRIA OCASIO-CORTEZ IS RIGHT ABOUT THIS (YES, I MEAN IT)... The tweet was criticized by a number of other popular figures on Twitter, including actor Kal Penn, writer Roxane Gay, and Charlotte Clymer, a writer and press secretary for the Human Rights Campaign. \"I can connect with you with a list of digital media consultants who will, free-of-charge, give you private feedback in order to avoid losing in 2020. Feel free to DM,\" Clymer wrote. CLICK HERE TO GET THE FOX NEWS APP The tweet has largely been condemned as an ineffective attempt to connect with a younger voter base.",
      "date": "June 19",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Where in the world does Alexandria Ocasio-Cortez live?",
      "url": "https://www.foxnews.com/politics/where-in-the-world-does-alexandria-ocasio-cortez-live",
      "subtitle": "Where in the world does Alexandria Ocasio-Cortez live?",
      "author": "",
      "content": "She may be America’s most famous freshman congresswoman, but in New York, Rep. Alexandria Ocasio-Cortez is a virtual ghost. She has no district office and no local phone number, unlike the state’s three other freshman members. And it’s unclear whether the 29-year-old lawmaker, who represents the Bronx and Queens, actually still lives in the Parkchester neighborhood that has been so closely tied to her rise — even though she won her upset victory over fellow Democrat Rep. Joe Crowley with accusations that his home in Virginia made him too Washington-focused to serve his district. OCASIO-CORTEZ GETS FRESH CRITICISM OVER AMAZON AS NEW BILLBOARDS IN NEW YORK EMERGE Ocasio-Cortez has used her deceased father’s Bronx condo on her voter registration since 2012, and even posed in the one-bedroom Bronx flat for celebrity photographer Annie Leibovitz in a Vogue magazine profile after her stunning November election. But The Post could find little indication she continues to live there. The Post e-mailed the Ocasio-Cortez’ spokesman, Corbin Trent, four times with specific questions — they were all ignored. On Saturday, The Post reached Corbin by phone. “We will not be commenting,” he said. Among the queries he refused to answer: Where does the congresswoman live? On Saturday night, a staffer promised a Post reporter that Ocasio-Cortez would talk to him after a speaking event in Corona. During the event, two staffers were seen reading an early edition of this story on their phones. “Come downstairs, I have to take a picture quick,” the congresswoman then told the reporter after the event, instructing him to wait for her. Twenty minutes later, she ducked out a back door, jumped into a chauffeured SUV, and zoomed off. Ocasio-Cortez was in New York City last weekend and this weekend, with appearances in Queens on both Saturdays — yet she was not seen coming or going from her Parkchester pad either day. Her apartment’s next-door neighbor said she had never seen Ocasio-Cortez. Another neighbor, who has lived down the hall from the congresswoman’s apartment for the last 40 years, said he’d never seen her or her boyfriend, Riley Roberts, who has claimed the address as his own since last spring. “I would have remembered,” said the neighbor when shown a photograph of Ocasio-Cortez. Workers at Jerry’s Pizzeria, less than a block from her building, and at the local grocery store said she had never patronized their businesses — and a server at a nearby taqueria said the congresswoman had only come in to be filmed by news crews. A postal worker who delivers mail to the building said that in the last 10 years he has only seen Ocasio-Cortez intermittently and that several months’ worth of mail regularly accumulates in the mailbox before anyone bothers to collect it. The worker said that Ocasio-Cortez and Roberts were the only ones getting mail at the address. CLICK HERE TO GET THE FOX NEWS APP “Just because their names are on the box doesn’t mean they live there,” he said. And in 2017, when Ocasio-Cortez first filed paperwork to become a congressional candidate, she didn’t even know what district she lived in, mistakenly declaring plans to run for neighboring District 15 before correcting the error days later. Meanwhile, in Washington, Ocasio-Cortez has rented a pad in a luxe building in the chic Navy Yard neighborhood, where studios start at $1,840 a month, according to the Washington Examiner. This story continues in the New York Post.",
      "date": "February 24",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez claims recent move explains address questions",
      "url": "https://www.foxnews.com/politics/alexandria-ocasio-cortez-claims-recent-move-explains-address-questions",
      "subtitle": "Alexandria Ocasio-Cortez claims recent move explains address questions",
      "author": "",
      "content": "Rep. Alexandria Ocasio-Cortez, D-N.Y., scrambled Sunday to explain why neighbors at her listed Bronx address never saw her there — and ended up claiming she recently relocated to a larger place nearby. The day after The Post reported that residents said they had never seen her around — and she ducked questions about it after an appearance — her spokesman said the Democratic freshman congresswoman now lives with her boyfriend in a two-bedroom apartment “a block and a half away.’’ The pair relocated there earlier this month, he said. “She lives in the same neighborhood she’s lived in for years,” said the spokesman, Corbin Trent. “She is not living in the exact same condo.’’ WHERE IN THE WORLD DOES ALEXANDRIA OCASIO-CORTEZ LIVE? The recent move still didn’t explain why residents at her previous digs — a one-bedroom Bronx condo owned by her mom — insisted they had never seen her there. U.S. reps and senators are required to have a residence in their home districts. Trent claimed that Ocasio-Cortez, 29, was at her new home Sunday afternoon, although he wouldn’t identify the address. CLICK HERE TO GET THE FOX NEWS APP Ocasio-Cortez, a former bartender-turned-progressive pacesetter, literally ducked questions about her residence after an appearance Saturday in Queens. She told The Post to wait for her to pose for a photograph — then slipped out a back door and into a waiting SUV. Ocasio-Cortez previously claimed that she has lived since 2011 in a mortgage-free, fourth-floor condo in Parkchester, which according to records was bought by her late dad, Sergio Ocasio, who died in 2008. This story continues in the New York Post.",
      "date": "February 24",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Rep. Alexandria Ocasio-Cortez attacks ICE as a 'dangerous agency'",
      "url": "https://www.foxnews.com/politics/rep-alexandria-ocasio-cortez-attacks-ice-as-a-dangerous-agency",
      "subtitle": "Rep. Alexandria Ocasio-Cortez attacks ICE as a 'dangerous agency'",
      "author": "Liam Quinn",
      "content": " Rep. Alexandria Ocasio-Cortez has launched a blistering twitter tirade attacking ICE, labeling the agency “dangerous”. The freshman Democrat, who has previously vowed to defund Immigrations and Customs Enforcement and see it abolished, made the comments in the wake of a party vote supporting a GOP amendment requiring “undocumented immigrants who try to buy guns be reported to ICE,” according to reports. “I was upset that 26 Dems forced the other 200+ to vote for a pro-ICE provision at the last min without warning. Because I think an agency that pins children down + forcibly injects them w/ antipsychotic drugs shouldn’t be given more power,” AOC’s first tweet read. OCASIO-CORTEZ CALLS TO ABOLISH ICE, SAYS LATINOS MUST BE EXEMPT FROM IMMIGRATON LAWS BECAUSE THEY ARE 'NATIVE' TO US “What I DID say was that I had to go back to my district & share the MTR vote to explain why a pro-ICE amendment was slipped into a gun safety law.” It was then that the New York rising star really turned up the heat on ICE, tweeting: “If you’re mad that I think people SHOULD KNOW when Dems vote to expand ICE powers, then be mad. OCASIO-CORTEZ WARNS OF 'LIST' FOR MODERATE DEMS WHO VOTE WITH REPUBLICANS: REPORT “ICE is a dangerous agency with 0 accountability, widespread reporting of rape, abuse of power, + children dying in DHS custody. Having a D next to your name doesn’t make that right.” She then took aim at colleagues in her own party, saying: “Mind you, the same small splinter group of Dems that tried to deny Pelosi the speakership, fund the wall during the shutdown when the public didn’t want it, & are now voting in surprise ICE amendments to gun safety legislation are being called the “moderate wing” of the party.” The comments came after Ocasio-Cortez made a speech against immigration laws and promised to abolish ICE. OCASIO-CORTEZ CLAIMS GOP IS EXPERIENCING 'HOSTAGE SITUATION,' PLEDGES SUPPORT TO IMPEACH TRUMP \"[ICE] do not deserve a dime until they can prove that they are honoring human rights, until they can make a good faith effort to expand and embrace immigrants … Until they can prove good faith to an American ideal, they do not deserve any resources for their radical agenda,” Ocasio-Cortez said. CLICK HERE TO GET THE FOX NEWS APP The call was backed by Minnesota Rep. Ilhan Omar and Michigan Rep. Rashida Tlaib. Fox News contacted Rep. Ocasio-Cortez’s office for comment.",
      "date": "March 2",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Ocasio-Cortez, Omar, Tlaib to endorse Bernie Sanders",
      "url": "https://www.foxnews.com/politics/ocasio-cortez-omar-tlaib-reportedly-will-endorse-bernie-sanders",
      "subtitle": "Ocasio-Cortez, Omar, Tlaib to endorse Bernie Sanders",
      "author": "Dom Calicchio",
      "content": " Three members of the so-called “Squad” of far-left freshman members of Congress are lining up behind Sen. Bernie Sanders for president. Fox News has learned that Rep. Alexandria Ocasio-Cortez, D-N.Y., will appear with Sanders on Saturday in Queens, N.Y., at a “Bernie’s Back” rally designed to generate excitement for the senator’s campaign following his recent heart procedure. Rep. Ihan Omar, D-Minn., will also endorse the candidate, Fox News confirmed. SANDERS PROMISES NEW JOBS FOR 'TENS OF MILLIONS OF AMERICANS' DURING DEMOCRATIC DEBATE In addition, CNN reported that Rep. Rashida Tlaib, D-Mich., will endorse Sanders as well. It was not immediately clear if Omar and Tlaib will appear at Saturday's event. \"Bernie is leading a working class movement to defeat Donald Trump that transcends generation, ethnicity and geography,\" Omar was quoted as saying in a statement posted on Twitter by the Sanders campaign — and that Omar retweeted on her own Twitter page. \"I believe Bernie Sanders is the best candidate to take on Donald Trump in 2020,\" Omar added. The endorsements would be a significant blow to the campaign of Sen. Elizabeth Warren, who, like Sanders, has been representing the party’s progressive wing. Word of the endorsements also followed Tuesday night’s Democratic debate in Ohio, where Warren was under attack from multiple candidates after rising in the polls in recent weeks. CLICK HERE TO GET THE FOX NEWS APP Winning the OK of the “Squad” members was also viewed as crucial in attracting young voters, as the top three Democrats in the polls are all senior citizens — Sanders is 78, former Vice President Joe Biden is 76 and Warren is 70 years old. There was no indication that the fourth member of the Squad, Rep. Ayannna Pressley, D-Mass., was ready to make an endorsement — either of Sanders or any other candidate. ​​​​​​​Fox News’ Paul Steinhauser and Andrew Craft contributed to this report.",
      "date": "October 15",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez promotes 'anti-capitalist' streaming service",
      "url": "https://www.foxnews.com/politics/alexandria-ocasio-cortez-promotes-anti-capitalist-streaming-service",
      "subtitle": "Alexandria Ocasio-Cortez promotes 'anti-capitalist' streaming service",
      "author": "Liam Quinn",
      "content": " Alexandria Ocasio-Cortez is putting her political brand behind a yet-to-be-launched socialist streaming service. Rep. Ocasio-Cortez, D-N.Y., late Thursday shared a video put together by Means TV, which describes itself as “an anti-capitalist on-demand digital streaming platform launching in late 2019.” The group’s website outlines how it plans to grow into being “an anti-capitalist media institution together,” featuring “your favorite Leftist influencers, comedians, writers, organizers, and voices.” TUCKER CARLSON: SOMEDAY, THE AOC MOMENT WILL PASS AND DEMS WILL REJOIN ADULT CONVERSATIONS ABOUT IMMIGRATION Ocasio-Cortez plugged the video with her own commentary on the ills of the capitalist system. “How on earth could young people, whose wages are flat, costs of living skyrocketing, experiencing increased social instability via bigotry, addiction, + violence, expected to live shorter lifespans than previous gens dare question the larger economic forces in their lives?!” she tweeted. The video itself featured comedian Sara June sarcastically explaining how capitalism works, and how to succeed in it. “Another beautiful day under capitalism, the greatest most functional economic system that has ever existed,” the clip begins, before June spits out a sip from a cup of coffee. “Under capitalism, there are two ways to make money, and you definitely have to make money. If you’re lucky, you own something like an apple farm, or a glue factory. That makes you the owning class. If you don’t own anything, you’re part of the working class and you make money by selling your labor. You pretty much sell your labor until you retire. Sorry, let’s take that again. You pretty much sell your labor until you die.” CLICK HERE TO GET THE FOX NEWS APP The clip wraps up with the line: “In conclusion, capitalism is a fun and efficient way to consolidate all the world's resources in the control of a tiny group of massively rich individuals at the expense of everyone else.”",
      "date": "April 5",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Ocasio-Cortez faces primary challenge from Queens activist",
      "url": "https://www.foxnews.com/politics/aoc-primary-challenge-badrun-khan",
      "subtitle": "Ocasio-Cortez faces primary challenge from Queens activist",
      "author": "Sam Dorman",
      "content": " Rep. Alexandria Ocasio-Cortez, D-N.Y., will have to get through a primary challenger if she wants to hold on to her seat in 2020. Democratic activist Badrun Khan, who has challenged Ocasio-Cortez for the Democratic nomination to represent New York's 14th district.  says on her website that she'll provide \"REAL Results... Not Empty Promises\" -- an apparent jab at the socialist darling. When asked about Khan's challenge, Ocasio-Cortez said: “I just focus on delivering for my district and doing the best job. I try not to focus too much on other folks in the field,\" according to The Hill. Khan filed her statement of candidacy with the Federal Election Committee in July. The website for New York City's government confirms that Khan serves on Queens Community Board 2. AOC HITS NEW YORK TIMES' 'CONDESCENSION' TOWARDS HER, SUGGESTS PAPER IS TRYING TO 'GASLIGHT' THE LEFT Khan's website doesn't appear to have an official announcement and she did not respond to Fox News' request for comment by the time of publication. Instead, her website detailed her background as a community activist and daughter of Bengali immigrants. \"Badrun has worked towards political and social empowerment for her community,\" her website read. \"Her service has gone well beyond the Bengali community. She is an active presence in schools and service to all the residents in her Queens community. She has volunteered and served with honor as a member of Community Board 2. Badrun continues to works diligently each day to help her community and the people of Queens.\" CLICK HERE TO GET THE FOX NEWS APP Khan's website says she wants to enhance Medicare and Social Security but appeared to take a shot at \"Medicare-for-all,\" a plan championed by progressives like Ocasio-Cortez. \"She will fight to make sure Health Care is made available for all and that those who have existing coverage can choose to keep what they currently have,\" the site said, apparently referring to concerns that \"Medicare-for-all\" would take away private insurance.",
      "date": "September 18",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez targeted by mystery multimillionaire donor",
      "url": "https://www.foxnews.com/politics/alexandria-ocasio-cortez-targeted-by-mystery-multimillionaire-donor",
      "subtitle": "Alexandria Ocasio-Cortez targeted by mystery multimillionaire donor",
      "author": "",
      "content": "Alexandria Ocasio-Cortez’s surging national profile has inspired a trio of Republican opponents from her home district — along with a multimillionaire mystery donor who could help close the gap in her foes’ long-shot race against her. Just three months after taking office, the Democratic socialist congresswoman’s challengers include an Egyptian American journalist, who has already tossed her hat in the ring, and an NYPD cop-turned-high-school-civics teacher and conservative talk-radio producer, both of whom are seriously exploring a run against her. And the fledgling challengers could get help from a wealthy New Yorker committed to backing an Ocasio-Cortez opponent, a GOP big said. AOC IMPERSONATOR, 8, TAKES ON GREEN NEW DEAL, SOCIALISM IN VIRAL VIDEO “There’s definitely national energy and money on this race,” Bronx Republican Chairman Mike Rendino told The Post, adding that he has been in touch with a mega-bucks donor hell-bent on getting AOC tossed. Rendino wouldn’t divulge the donor’s name but said the individual is “worth over $200 million, plus [has] connections to raise money in Manhattan.” Tom Doherty, a former Pataki deputy, said a Republican challenger to AOC would be able to “raise real national money. “We need to put individuals forward and make the incumbent work for re-election,” Doherty said. Click to read more from the New York Post.",
      "date": "April 21",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Bronx Republican preparing 2020 run against 'Bolshevik' Alexandria Ocasio-Cortez",
      "url": "https://www.foxnews.com/politics/bronx-republican-preparing-2020-run-against-bolshevik-alexandria-ocasio-cortez",
      "subtitle": "Bronx Republican preparing 2020 run against 'Bolshevik' Alexandria Ocasio-Cortez",
      "author": "Hollie McKay",
      "content": " She’s a medical journalist and former publicist with no political background, but Bronx native Ruth Papazian, 61, sees it as her duty – however much a long shot – to swipe the seat of 29-year-old Alexandria Ocasio-Cortez in the 2020 congressional elections. “It became clear that if I didn't step up to fight for our district, we'd end up with yet another passive Republican candidate who didn't bother to campaign,” Papazian told Fox News. “And Alexandria Ocasio-Cortez hasn't lived in the district since early childhood. Those of us who stuck it out, and actually live here, care about our future, and need representation.” Ocasio-Cortez used her deceased father’s Bronx condo on her voter registration since 2012, but has since denied reports that she doesn’t live in the Manhattan borough. Meanwhile, Papazian – the daughter of Egyptian immigrants who currently lives with her widowed mother – has accused the headline-making freshman representative of never responding to concerned people in the district “who have serious questions about her unrealistic and unworkable policies,” and claims that she “has a mostly unstaffed office in Queens, and when constituents call her office in DC to ask for help, they get phone recordings with full message boxes.” WHAT CHINESE SPIES WANT FROM AMERICANS But for this Bronx Republican, it is the incumbent’s economic policies that are the driving force behind her own political aspirations. “It has been galling listening to Ocasio-Cortez push really hackneyed big government ideas that have failed around the world. These include her Green New Deal and Medicare for all,” Papazian said. “This district is home to first and second-generation immigrants. It is a middle-class district, because our families came here, worked hard, bought houses, and flourished. Many of us come from families that escaped socialism. No one wants it here.” And as Papazian fears, some U.S. businesses also view the Ocasio-Cortez-led socialist economic plug as a possibility rather than a delusional fantasy. Independent retailer Metals.com last month surveyed more than 100,000 of its members across the country to gather insights on the attitudes and behaviors of U.S. retirees aged 60 and over, with some 91.5 percent labeling the Democrat party “as more socialist” since the 2018 election. “As Democrats control the House, they are becoming openly bold about socialist programs – like Medicare for All, confiscatory tax rates for top earners and a Green New Deal, their hard-left turn is no longer a matter for discernment,” said Metals Vice President Deric Scott. A Gallup poll last year found that more Democrats – some 57 percent – now have a more “positive” view of the word socialism than they did ten years ago amid the financial collapse. Papazian insists there is nothing optimistic about what her area’s representative is promoting. “Ocasio-Cortez seems to have zero understanding of how our economy works to create the relative wealth and comfort people have made for themselves and their families. The Whitestone Bridge connects the East Bronx and Northwest Queens portions of the district. Her policies are literally a threat to our way of life,” Papazian said. “Montefiore Hospital is the biggest employer in the Bronx part, and her Medicare for All plans would bankrupt them. Tens of thousands of well-paid healthcare workers would be out of work.” BERNIE SANDERS GRILLED ON SOCIALISM BY HARVARD STUDENT WHOSE FAMILY FLED SOVIET RUSSIA She also argued that Jet Blue and the airports are the biggest employers in the Queens part of the Ocasio-Cortez district and that her Green New Deal, “which would get rid of air travel, would make tens of thousands of well-paid avionics workers jobless.” Papazian said that she has established an “exploratory committee” to begin crafting her running plans, and will file her official papers with the Federal Election Commission in the next few months. She also noted that the issues she intends to run on are centered on “pro-growth tax policies for economic diversity, affordable private health insurance, border control as a national security issue, less government intrusion and regulation, strong defense and fewer wars” and the local matter of fixing the “crumbling roads and subway system” rather than bolstering the cost for vehicles heading into Manhattan as part of the Democratic Gov. Andrew Cuomo-backed push for a 2021 “congestion tax.” CLICK HERE TO GET THE FOX NEWS APP And while she is a rookie when it comes to an office run, Papazian is no newcomer when it comes to stymying political correctness and niceties. On her Facebook page, Papazian takes almost daily aim at Ocasio-Cortez – whom she refers to as the “Bronx Bolshevik” – illuminating her policies with both dismay and derision, lambasting the young Democrat for everything from failing to respond to her constituency and adequately staff her office, to her “reality show” struggles to set up IKEA furniture while the people in her district are left languishing amid real-life struggles, to suggesting she move to the ravaged socialist nation of Venezuela. “Seeing her in action, my shock turned to indignation at this takeover of an office that exists to meet our needs,” Papazian added. A spokesperson for Ocasio-Cortez did not immediately respond to a request for comment, but her representatives have previously stated that they “welcome” competition and Democratic values.",
      "date": "April 23",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Sean Hannity makes Ocasio-Cortez an offer",
      "url": "https://www.foxnews.com/politics/hannity-offers-aoc-a-full-hour-of-his-show-to-have-a-discussion",
      "subtitle": "Sean Hannity makes Ocasio-Cortez an offer",
      "author": "Victor Garcia",
      "content": " Fox News' Sean Hannity made an offer Thursday that he hopes U.S. Rep. Alexandria Ocasio-Cortez can't refuse. Hannity said that if the freshman Democratic congresswoman from New York agrees to appear on his program, he'll devote the entire hour to their conversation. \"I'm going to extend tonight an offer to Congresswoman Alexandria Ocasio-Cortez,\" Hannity said. \"I want to give you an hour invitation to come on this show to have a discussion.\" AOC PUSHES BACK AT PELOSI, SAYS HOUSE SPEAKER'S BELITTLING OF PROGRESSIVES 'PUZZLING' The Fox News host also offered up three hours of his radio program to Ocasio-Cortez. \"We get a lot of criticism on this program. We'll talk, we'll have a conversation. Hope you'll join us,\" Hannity added. Ocasio-Cortez has recently been clashing with House Speaker Nancy Pelosi, D-Calif., and has suggested that Pelosi has been singling out her and three fellow freshman congresswomen because of race. “But the persistent singling out ... It got to a point where it was just outright disrespectful. ... The explicit singling out of newly elected women of color,\" Ocasio-Cortez told the Washington Post. Those comments drew reactions Wednesday from Joy Behar and Whoopi Goldberg on \"The View,\" as well as from U.S. Rep. William Lacy Clay, D-Mo. \"It is so inappropriate. So uncalled for,\" Clay told Fox News on Thursday. \"It does not do anything to help with unity. It was unfair to Speaker Pelosi.\" AOC HITS BIDEN FOR DEFENDING SEGREGATIONIST REMARKS, DEBATE PERFORMANCE\n\n \n\nEarlier on \"Hannity,\" Sen. Lindsey Graham, R-S.C., weighed in on the Democratic conflict, saying ultimately President Trump wins. \"But if you're one of these 31 Democrats, Sean, you've got to pick between the energy of the Fab Four and the practicality of Nancy Pelosi. You're in a no-win situation,\" Graham said. CLICK HERE TO GET THE FOX NEWS APP \"Why am I thinking that if I'm Donald Trump, I'm a happy guy tonight?\" Hannity asked Graham. Ocasio-Cortez has emerged as the leader of the progressive wing of the Democratic Party and a strong advocate for addressing climate change, among other issues.",
      "date": "July 11",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "NYC council member launches Democratic primary challenge to Ocasio-Cortez",
      "url": "https://www.foxnews.com/politics/alexandria-ocasio-cortez-fernando-cabrera-democratic-primary",
      "subtitle": "NYC council member launches Democratic primary challenge to Ocasio-Cortez",
      "author": "Morgan Phillips",
      "content": " A prominent New York City Democrat filed with the Federal Election Commission (FEC) Thursday to launch a primary challenge for the House of Representatives seat currently held by Rep. Alexandria Ocasio-Cortez, D.-N.Y. City Council member Fernando Cabrera said he believes a moderate Democrat such as himself could beat the socialist Ocasio-Cortez. He plans to target her far-left views and highlight his belief that she is a “no show” in the district. “Only a Democrat is going to be able to defeat her, and it’s going to be a moderate Democrat,” Cabrera, who represents a Bronx City Council district, told Politico. “She’s a no-show in the district. She hasn’t brought about anything except division within the party.” “Socialism doesn’t work,\" Cabrera added. \"I don’t want it for my children, for my grandchildren.\" FOX NEWS POLL: BIDEN AND WARREN GAIN GROUND IN DEMOCRATIC RACE He said he decided to run after becoming fed up with Ocasio-Cortez’s railing against Amazon’s plans to build a headquarters in Queens-- plans Amazon pulled out because of backlash from New York City lawmakers. “It was staggering to me,” Cabrera said. “We have somebody who literally dismantled the possibility of us having 25,000 jobs, and she has yet to bring any jobs into the district.” LIZ CHENEY, OTHERS IN GOP SPEARHEAD BID TO SANCTION TURKEY FOR SYRIA INVASION Cabrera could face attacks over his past views on gay rights. According to Politico, a video surfaced in 2014 of Cabrera praising Uganda’s restrictive anti-gay laws. In response, Cabrera, who is also a pastor, pointed out that he has voted in favor of every piece of legislation supported by the LGBT caucus while on New York's city council. Cabrera was first elected to the city council in 2009, and he lives about a mile outside of the district which he is running to represent. Cabrera told City and State NY “I’ve done more for the Bronx and Queens than [Ocasio-Cortez] ever has.” Cabrera was a registered Republican until 2008. A number of Republicans have entered the race to challenge Ocasio-Cortez, but Cabrera is the first well-known Democrat to do so. Cabrera's complaints about Ocasio-Cortez echo those of Republican Scherie Murray, a businesswoman who emigrated from Jamaica and entered the race against Ocasio-Cortez in July. CLICK HERE TO GET THE FOX NEWS APP \"There is a crisis in Queens, and it’s called AOC,” Murray told Fox News at the time. “And instead of focusing on us, she’s focusing on being famous. Mainly rolling back progress and authoring the job-killing Green New Deal and killing the Amazon New York deal.” Four other Republicans have filed to run for the seat as well-- former police officer John Cummings, medical journalist Ruth Papazian, construction contractor Miguel Hernandez and entrepreneur Antoine Tucker.",
      "date": "October 10",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Rep. Alexandria Ocasio-Cortez compares GOP to Dwight Schrute",
      "url": "https://www.foxnews.com/politics/aoc-compares-gop-to-dwight-schrute",
      "subtitle": "Rep. Alexandria Ocasio-Cortez compares GOP to Dwight Schrute",
      "author": "Ryan Gaydos",
      "content": " Bears, beets and … the GOP? Rep. Alexandria Ocasio-Cortez, D-N.Y., compared the Republican Party to one of the most well-known television characters over the last decade: Dwight Schrute from NBC’s “The Office.” Ocasio-Cortez likened the GOP to the character because the party has a “technique” to take “dry humor” and “sarcasm” literally and fact check it, she tweeted Sunday. AOC HITS THE ECONOMIST FOR LINKING CELIBACY TO 'FEMALE EMPOWERMENT' “This is a technique of the GOP, to take dry humor + sarcasm literally and 'fact check” it,' the freshman Congresswoman tweeted. Like the ‘world ending in 12 years’ thing, you’d have to have the social intelligence of a sea sponge to think it’s literal. But the GOP is basically Dwight from The Office so who knows.” The comparison came in response to criticism for her explanation about taxing the rich. CLICK HERE TO GET THE FOX NEWS APP “When we say ‘tax the rich,’ we mean nesting-doll yacht rich. For-profit prison rich. Betsy DeVos, student-loan-shark rich,” she tweeted, adding “Because THAT kind of rich is simply not good for society, & it’s like 10 people.”",
      "date": "May 13",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez to campaign for Bernie Sanders in Iowa",
      "url": "https://www.foxnews.com/politics/alexandria-ocasio-cortez-campaign-bernie-sanders-iowa",
      "subtitle": "Alexandria Ocasio-Cortez to campaign for Bernie Sanders in Iowa",
      "author": "Adam Shaw",
      "content": " Rep. Alexandria Ocasio-Cortez, D-N.Y., will campaign for Sen. Bernie Sanders, I-Vt., in Iowa -- a sign of the important role the freshman congresswoman will play in the Vermont senator's 2020 presidential bid in a vital state. Sanders made the announcement Friday evening at a rally in Des Moines, according to the Des Moines Register, ahead of the Democratic Party’s Liberty and Justice Celebration. AOC BACKS SANDERS AT NEW YORK RALLY, CREDITS HIM WITH 'FUNDAMENTALLY' CHANGING POLITICS The duo will be at three events across two days between Nov 8-9, including a “Climate Crisis Summit.” The Register reported that she will promoting the Green New Deal at those events -- an expansive government-run overhaul of the economy and energy output to fight climate change. Ocasio-Cortez has shot to national attention since a longshot primary win against then-Rep. Joe Crowley, D-N.Y., and has become the most visible member of the left-wing group of freshman congresswomen known as “The Squad.” TRUMP RALLIES SUPPORTERS IN MISSISSIPPI AFTER HOUSE IMPEACHMENT PROBE VOTE, AHEAD OF TIGHT GOVERNOR'S RACE Since Sanders clinched her endorsement, she has featured prominently in his campaign. Ocasio-Cortez spoke at Sanders’ return to the campaign trail since heart surgery earlier this month, where she told a New York rally how the senator inspired her to embark on her own political bid. \"It wasn't until I heard of a man by the name of Bernie Sanders that I began to question and assert and recognize my inherent value as a human being that deserves health care, housing, education and a living wage,” she said. She said Sanders had spent decades fighting for those things to make life for her better, such as the Children’s Health Insurance Plan (CHIP), universal health care, and student debt forgiveness. “Bernie Sanders did not do these things because they were popular and that’s what we need to remember,” she said. “No one wanted to question this system and in 2016 he fundamentally changed politics in America.” CLICK HERE FOR THE FOX NEWS APP The congresswoman then appeared in a subsequent digital ad for Sanders. According to Politico, Sanders aides have said Ocasio-Cortez's endorsement represents the multiracial working-class coalition he is trying to build.",
      "date": "November 2",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    }
  ]
}