{
  "articles": [
    {
      "title": "Labor complaint charges Bernie Sanders’ campaign retaliated against employees for union activity",
      "url": "https://www.foxnews.com/politics/labor-complaint-charges-bernie-sanders-campaign-retaliated-against-employees-for-union-activity",
      "subtitle": "Labor complaint charges Bernie Sanders’ campaign retaliated against employees for union activity",
      "author": "Bradford Betz",
      "content": " A former campaign employee from the 2020 presidential bid of Sen. Bernie Sander filed a labor complaint this week, alleging that some employees faced retaliation for involvement in organizing for a collective bargaining agreement. The employee, who has not been publicly identified, filed the complaint with the National Labor Relations Board (NLRB) on Tuesday, according to a redacted copy of the charge obtained by Bloomberg Law. The complaint alleges that Sanders’ campaign made unionized employees work additional days without commensurate days off, thus violating the terms of their collective bargaining agreement. Campaign management \"retaliated against me when I organized the bargaining unit and sent an email requesting compliance with the [collective bargaining agreement],” the individual wrote in the charge. The charges, if true, could be yet another ironic blow for the self-proclaimed Democratic socialist senator, I-Vt., who has portrayed himself as an ally of organized labor. Sanders made history earlier this year after announcing that his campaign employees would be represented by a union. But The Washington Post reported last week, that campaign staffers have been “battling with … management, arguing that the compensation and treatment they are receiving does not meet the standards Sanders espouses in his rhetoric, according to internal communications.” CHARLES PAYNE: BERNIE SANDERS CUTTING STAFFERS’ HOURS TO MEET MINIMUM WAGE MARK TEACHERS HIM A ‘VALUABLE LESSON’ An agreement on that dispute was reached earlier this week, with Sanders announcing that pay would be raised from $36,000 to $42,000. The unfair labor practice charge filed on Tuesday alleges that some employees were not notified of their collective bargaining agreement before being hired and made to believe they were “at-will.” “The campaign leadership, from Senator Sanders on down, respects the rights of all of its employees to speak collectively and bargain about their terms and conditions of employment, and it supports the mission of the NLRB to enforce worker and union rights,\" Sanders' campaign said in a prepared statement to Fox News. \"That is exactly why the Bernie 2020 campaign voluntarily recognized the employees’ chosen union and engaged in good faith bargaining that resulted in a historic collective bargaining agreement.\" The campaign declined to discuss the specifics of the matter \"in order to maintain the integrity of the NLRB process.\" CLICK HERE TO GET THE FOX NEWS APP The NLRB’s office in Indianapolis is now investigating the allegations, The Hill reported. If the claims are proved to be true, and if the National Labor Relations Act and involved parties are unable to bring about a resolution, the case will be sent to an NLRB administrative law judge.",
      "date": "July 25",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders: US policy in Mideast can't be 'pro-Israel, pro-Israel, pro-Israel'",
      "url": "https://www.foxnews.com/politics/bernie-sanders-pro-israel-us-foreign-policy-benjamin-netanyahu-palestine",
      "subtitle": "Bernie Sanders: US policy in Mideast can't be 'pro-Israel, pro-Israel, pro-Israel'",
      "author": "Danielle Wallace",
      "content": " U.S. Sen. Bernie Sanders said Friday that U.S. foreign policy in the Middle East cannot be “pro-Israel.” The Democratic 2020 presidential candidate, who is Jewish and has lived in Israel in the past, made the remark Friday on the \"Pod Save America\" podcast. “Our policy cannot just be pro-Israel, pro-Israel, pro-Israel,” Sanders said. “It has got to be pro-region, working with all of the people, all of the countries in that area.” BERNIE BOOSTS OMAR AS DEMS’ ISRAEL RIFT DEEPENS The independent from Vermont said he fervently believes that “the people of Israel have absolutely the right to live in peace, independence, and security. End of discussion,” but added he has an issue with the way Prime Minister Benjamin Netanyahu has run the country in recent years, the Washington Examiner reported. “I think what has happened is in recent years under Netanyahu, you have an extreme right-wing government with many racist tendencies,” Sanders said, blaming the prime minister for worsening tensions between Israel and the Palestinians. Sanders also criticized President Trump’s decision to move the U.S. Embassy in Israel from Tel Aviv to the holy city of Jerusalem, something he believes put peace negotiations with Palestinians at risk. In May, the Trump administration officially opened the new U.S. Embassy in Jerusalem, in a historic move cheered by Israelis but met with mass protests from Palestinians that turned deadly in the lead-up to the ceremony. Clashes at the border had left dozens of Palestinians dead and hundreds wounded by the time the ceremony ended. But Israel's prime minister praised the Israeli security forces for protecting the Gaza-Israel border, as U.S. officials held out hope that the prospect of peace remained in reach. CLICK HERE TO GET THE FOX NEWS APP If he becomes president, Sanders said, he’d consider using the billions in aid the U.S. sends to Israel each year as leverage to force Netanyahu to change his actions, adding that Palestinians deserve to be treated with dignity and respect, the Examiner reported. Netanyahu became the longest-serving Israeli prime minister this month, having held office for more than 13 years, according to The Guardian. He needs to win an election in September and survive three corruption cases against him in order to remain in office. Fox News' Brooke Singman and Judson Berger contributed to this report.",
      "date": "July 27",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders blasted Baltimore as ‘Third World country’ and ‘disgrace’ in past comments",
      "url": "https://www.foxnews.com/politics/bernie-sanders-blasted-baltimore-as-third-world-country-and-disgrace-in-past-comments",
      "subtitle": "Bernie Sanders blasted Baltimore as ‘Third World country’ and ‘disgrace’ in past comments",
      "author": "Dom Calicchio",
      "content": " President Trump drew a torrent of criticism from Democrats on Saturday over a series of Twitter messages aimed at U.S. Rep. Elijah Cummings, D-Md., and the Baltimore district that Cummings represents in Congress. But just a few years ago, Sen. Bernie Sanders -- a candidate seeking the Democratic Party’s 2020 presidential nomination -- took his own shots at Baltimore, a struggling Northeast city grappling with high rates of violent crime, drug abuse, poverty and political corruption. “Anyone who took the walk that we took around this neighborhood would not think you’re in a wealthy nation,” Sanders said during a visit to the city’s West Baltimore section in December 2015, the Baltimore Sun reported. “You would think that you were in a Third World country.” TRUMP DOUBLES DOWN ON CUMMINGS CRITICISM AS DEMS, BALTIMORE OFFICIALS DEFEND 'HERO' REP The independent U.S. senator from Vermont also referred to Baltimore as “a community in which half of the people don’t have jobs.” “We’re talking about a community in which there are hundreds of buildings that are uninhabitable,” he added, according to the Sun. Sanders was visiting the section of Baltimore where a 25-year-old black man named Freddie Gray was arrested earlier that year for allegedly possessing an illegal knife. Gray fell into a coma while in police custody and died a few days later, sparking a national outcry against members of the city’s police department. But all six police officers who were suspended in connection with the death either had all charges against them dropped, or were acquitted. ARRESTS ANNOUNCED IN GUNPOINT ROBBERY OF BALTIMORE DEPUTY POLICE COMMISSIONER, WIFE In 2016, Sanders posted a Twitter message about Baltimore. “Residents of Baltimore’s poorest boroughs have lifespans shorter than people living under dictatorship in North Korea,” Sanders wrote. “That is a disgrace.” The bleak portrait Sanders painted back then seems little different from the one Trump presented Saturday, in which the president said the city had become a monument to governmental failures. In one message, Trump described Cummings’ district as “a disgusting, rat and rodent infested mess.” “If he spent more time in Baltimore,” the president added, “maybe he could help clean up this very dangerous & filthy place.” “Where is all this money going?” Trump asked later, referring to federal dollars sent to Baltimore over the years. “How much is stolen? Investigate this corrupt mess immediately!” CLICK HERE TO GET THE FOX NEWS APP Prominent Democrats – including House Speaker Nancy Pelosi of California, who was born in Baltimore and whose father was a Baltimore mayor, and presidential candidate Sen. Elizabeth Warren – were quick to defend Cummings and fire back at Trump. Also on Saturday, Sanders appeared to abandon his past critiques of Baltimore and focus instead on defending Cummings and bashing the president. “Here’s what’s really going on,” Sanders wrote. “@RepCummings has been busy revealing the failures of the Trump administration and exposing the greed of Trump’s friends in the pharmaceutical industry, and our racist president doesn’t like it.”",
      "date": "July 27",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders says Dems will 'lose the election' if they 'become obsessed' with Trump",
      "url": "https://www.foxnews.com/politics/bernie-sanders-says-dems-will-lose-the-election-if-they-become-obsessed-with-trump",
      "subtitle": "Bernie Sanders says Dems will 'lose the election' if they 'become obsessed' with Trump",
      "author": "Andrew O'Reilly",
      "content": " Sen. Bernie Sanders doesn’t want Democrats to become “obsessed” with beating President Trump in the 2020 election. Speaking to Jon Favreau on the podcast “Pod Save America,” Sanders, I-Vt., a 2020 Democratic presidential primary hopeful, admitted that it is difficult to ignore Trump’s controversial tweets, but argued that focusing on them and not the issues would almost guarantee that the current occupant of the White House remains there for another term. ‘[Y]ou cannot ignore Donald Trump and his tweets and his lies,” Sanders said. “But if you become obsessed with them, I guarantee you will lose the election.” BERNIE SANDERS CLAIMS 'MEDICARE-FOR-ALL' WILL SLASH HEALTH CARE COSTS WITH TAX HIKE Sanders also criticized his fellow candidates for not shifting the focus of their campaigns to include young and working-class voters. “The establishment hangs out with the wealthy and the comfortable and people in power and the establishment kind of forgets that as we speak there are millions of people living paycheck to paycheck, who can’t afford health care, who can’t–are paying 50 percent of their limited incomes on rent, who are scared to death about an illness in the family that might bankrupt them,” Sanders said. He added: I think the Democratic establishment to a significant degree, there’s a lot of rhetoric out there, but has really forgotten about that and has forgotten about the need to stand up the power.” Sanders appeared on the popular liberal podcast just days before he is set to take the stage at the second Democratic primary debate and as he battles with Sen. Kamala Harris of California for the second spot in the polls. CLICK HERE TO GET THE FOX NEWS APP Trump on Monday also suggested that “Crazy Bernie Sanders” be labeled as “a racist” for calling Baltimore a “Third World country” and a \"disgrace\" in 2015. This comes as Trump faces accusations himself of racism for his incendiary tweets. \"I assume that Bernie must now be labeled a Racist, just as a Republican would if he used that term and standard,\" Trump tweeted Monday. Sanders tweeted back that \"Trump's lies and racism never end. While I have been fighting to lift the people of Baltimore and elsewhere out of poverty with good paying jobs, housing and health care, he has been attacking workers and the poor.\" Fox News' Brooke Singman and The Associated Press contributed to this report.",
      "date": "July 29",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders shuts down 2020 opponent's 'Medicare-for-all' criticism with eyebrow-raising retort",
      "url": "https://www.foxnews.com/politics/bernie-sanders-tim-ryan-dem-debate-2020",
      "subtitle": "Bernie Sanders shuts down 2020 opponent's 'Medicare-for-all' criticism with eyebrow-raising retort",
      "author": "Sam Dorman",
      "content": " Sen. Bernie Sanders, I-Vt., turned up the heat on the Democratic debate stage on Tuesday as he vehemently defended his plan for reforming health care amid attacks from several of his fellow contenders. He was responding to Rep. Tim Ryan, D-Ohio, who told the Vermont senator he didn't \"know\" that \"Medicare-for-all\" would provide certain benefits. \"I wrote the damn bill!\" Sanders exclaimed in response. His comments came during a long, contentious exchange in which candidates clashed over competing visions for health care. Sanders has championed the Medicare-for-all program with his own bill in the Senate and, along with Sen. Elizabeth Warren, D-Mass., is perhaps its most vociferous proponent in the Democratic field. Sanders' team, on Twitter, doubled down on his fiery statement during the debate. CNN'S 'OVER-THE-TOP' DEBATE COVERAGE MOCKED \"Medicare-for-all means expanding benefits to include dental care, eyeglasses and hearing aids. I know that because I wrote the damn bill. #DemDebate,\" a tweet read. His team also tweeted his disappointment with former Rep. John Delaney, D-Md., whom he claimed spouted falsehoods about hospitals closing under his health care plan. WARREN, SANDERS BRACE FOR DEBATE-STAGE ATTACKS ON THEIR 'IMPOSSIBLE PROMISES' \"It's disappointing to see some Democrats repeating a lie you normally hear from health insurance lobbyists to attack Medicare for All,\" one read, linking to a PolitiFact article on Delaney's claim. The debate came just a day after the Mercatus Center released a study that estimated Sanders' plan would cost $32.6 trillion over 10 years. By 2031, the costs would reportedly reach nearly 12.7 percent of GDP. TIM RYAN CALLED OUT FOR NOT PLACING HAND ON HEART FOR NATIONAL ANTHEM AT DEM DEBATE Former Colorado Gov. John Hickenlooper, during the debate, also pushed back on large programs like \"Medicare for all,\" arguing that it limited choice for Americans seeking health coverage. He and Delaney have been outspoken critics of the more progressive positions in the Democratic field. CLICK HERE TO GET THE FOX NEWS APP Delaney, in particular, portrayed Sanders and Warren as attempting to take away private insurance from American citizens. Fox News' Brooke Singman contributed to this report.",
      "date": "July 30",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "What is ‘Democratic socialism’? Bernie Sanders' political ideology explained",
      "url": "https://www.foxnews.com/politics/what-is-democratic-socialism-bernie-sanders-political-ideology",
      "subtitle": "What is ‘Democratic socialism’? Bernie Sanders' political ideology explained",
      "author": "Madeline Farber",
      "content": " Once largely considered “taboo” and a “dirty word,” socialism — particularly, Democratic socialism — has seemingly started to trickle into the political mainstream in recent years, thanks, in part, to self-proclaimed Democratic socialist Sen. Bernie Sanders of Vermont and New York Rep. Alexandria Ocasio-Cortez. An August 2018 Gallup poll found Democrats had a “more positive image” of socialism than of capitalism, with 57 percent of Democrats and Democratic-leaning independents saying they had a positive view of socialism compared to 47 percent who had a positive view of capitalism. Sanders will join Fox News Channel for a town hall co-anchored by Bret Baier and Martha MacCallum on Monday, April 15, at 6:30 p.m. ET in Bethlehem, Pennsylvania. “Views of socialism among Democrats and Democratic-leaning independents are particularly important in the current political environment because many observers have claimed the Democratic Party is turning in more of a socialist direction,” Gallup noted at the time. 3 BERNIE SANDERS POLICIES NOW EMBRACED BY THE DEMOCRATIC FIELD Socialism — a term that first hatched in the early 19th century, per The Washington Post — has “meant different things to different people in different times and places, while maintaining a stable core of themes and objectives: social (as opposed to private) control of the means of production, and of all the societal, humanitarian and political-economic changes that entails, especially where the freedom and autonomy of working people are concerned,” Opinion columnist Elizabeth Bruenig wrote in August 2018. But what exactly does it mean to be a Democratic socialist? And how have Ocasio-Cortez, Sanders and other politicians who align with the political philosophy describe its meaning to them? Read on for a brief look Democratic socialism. Democratic socialism pulls from both Democracy and socialism, per the Democratic Socialists of America (DSA) website. Political theorist and activist Michael Harrington helped form the DSA in 1982. “Democratic socialists believe that both the economy and society should be run democratically — to meet public needs, not to make profits for a few,” the group states, noting to achieve a more “just society” many “structures of our government and economy must be radically transformed through greater economic and social democracy so that ordinary Americans can participate in the many decisions that affect our lives.” Democratic socialists favor decentralization; they don’t necessarily want to create “an all-powerful government bureaucracy” but are not in favor of “big corporate bureaucracies to control our society either,” reads the website. Those who align with the political ideology typically support pro-union politics, tuition-free public universities, universal healthcare and using tax money from the wealthy to fund social welfare programs, among other ideas, reported TIME in October 2018. “[What they want] is not a violent overthrow of capitalism, but working within the system through legal and peaceful means [such as] electoral and social movements,” Maurice Isserman, a professor of History at Hamilton College, told the magazine at the time. \"Medicare for All,\" strong unions and electoral power are three of the DSA’s current campaigns. Sanders, a Democratic presidential candidate in 2016 and now one of the many vying for the Democratic presidential nomination for the 2020 election, explained what the political ideology means to him during a CNN town hall in February. “These are not radical ideas,” said Sanders, 77. “What democratic socialism means to me is having, in a civilized society, the understanding that we can make sure that all of our people live in security and in dignity,” he said. “All people should have health care. You can’t get ahead in this country, in this world, unless you have a decent education.” \"We have got to, as a right, end the kinds of discrimination — the racism, the sexism, and the homophobia — that exists. To me, when I talk about democratic socialism, what I talk about are human rights and economic rights,” he continued, before going on to list his policies — such as tuition-free public universities, raising the minimum wage and universal health care — he would enact if elected president. New York Rep. Ocasio-Cortez, 29, echoed Sanders when speaking to Business Insider in March. \"So when millennials talk about concepts like Democratic socialism, we're not talking about these kinds of 'Red Scare' boogeyman,\" she said. \"We're talking about countries and systems that already exist that have already been proven to be successful in the modern world.\" \"We're talking about single-payer health care that has already been successful in many different models, from Finland to Canada to the UK,\" she added, before going on to say Democratic socialism enforces “basic levels of dignity so that no person in America is too poor to live.” Julia Salazar, who represents New York’s 18th State Senate District, is also a self-proclaimed Democratic socialist, telling October, a beer-centric magazine, she has been a DSA member for two years and is “committed to trying to build Democratic socialism.” On a personal level, Salazar, 28, said being a Democratic socialist “means fighting to make sure that every person is empowered to be able to determine their own destiny.” “That all of us have access to not only basic needs, but to what we need to thrive in society. Housing is a human right, not something that should be at the mercy of the market. Health care is a human right, similarly, that shouldn’t be accessible only by income or status,” she added. Rep. Rashida Tlaib, who represents Michigan’s 13th congressional district, has also spoken on the political ideology — telling In These Times in August of 2018 “it means a strong partner.” “When I talk about equitable, just fairness, I lean on a whole group of people who understand just how much the structures in place are set up against the people, people of color, and the working class. It helps me have an organization and people to lean on. It’s important to have that kind of partnership,” Tlaib, 42, said. Isserman told NPR in July 2018 “this is the most important moment in DSA history.” The group has garnered an increasing amount of visibility in recent years, increasing from roughly 7,000 members to 50,00 since President Trump’s election in 2016, according to a 2018 Axios report. The growing membership, combined with big wins for Democratic socialists are solid examples of the group’s “growing movement,” the publication added. BERNIE SANDERS' BIGGEST STAR-STUDDED BACKERS: MARK RUFFALO, DANNY DEVITO AND OTHERS No country to-date has fully instituted Democratic socialism, per the DSA’s website, which noted some countries — Canada, Sweden and France, among others — have pulled from the political ideology in terms of health care, childcare and beyond. Republicans, specifically, often refer to countries where socialism has arguably gone array — such as Zimbabwe and Venezuela, among others — to discredit some of the group’s ideologies. “Critics say the U.S. would be a poorer, less efficient society,” Michael Kazin, a professor of history at Georgetown University, also told TIME.",
      "date": "April 9",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "California man arrested for alleged online threat against Bernie Sanders rally: police",
      "url": "https://www.foxnews.com/politics/california-man-arrested-for-alleged-online-threat-targeting-bernie-sanders-rally-police",
      "subtitle": "California man arrested for alleged online threat against Bernie Sanders rally: police",
      "author": "Bradford Betz",
      "content": " A California man was arrested Monday for allegedly posting an online threat of violence against a scheduled rally by Democratic presidential candidate Sen. Bernie Sanders, I-Vt., police say. Jose Rafael Guzman, 27, of Huntington Park, was charged with criminal threats and threatening a public officer, Long Beach police said. \"We take all potential threats of violence very seriously and thoroughly investigate all reported incidents,\" Chief Robert Luna said in a statement. \"Our department will remain vigilant and continue to be visible to ensure the safety of our community.\" WARREN RISES, BIDEN REMAINS STEADY AND HARRIS DROPS IN NEW POST-DEBATE POLL The details of the alleged threat were unclear. Police said they were notified about the threat by \"a concerned community member.\" Police said Guzman was booked into the Long Beach City jail and was released after posting $50,000 bail. When reached for comment by Fox News, Sanders' campaign said it would \"not comment on matters of security.\" Long Beach police said they had scheduled extra patrols in high visibility areas and vowed to \"place all available resources in high visibility areas\" following a pair of mass shootings in the U.S. over the weekend. CLICK HERE TO GET THE FOX NEWS APP The Sanders rally is scheduled to take place Tuesday evening at Long Beach City College. Fox News' Tara Prindiville contributed to this report. Click for more from FoxLA.com. The Associated Press contributed to this report.",
      "date": "August 6",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "What to know about Bernie Sanders' Fox News town hall",
      "url": "https://www.foxnews.com/politics/bernie-sanders-fox-news-town-hall-bret-baier-martha-maccallum",
      "subtitle": "What to know about Bernie Sanders' Fox News town hall",
      "author": "",
      "content": "Bernie Sanders is getting ready to make his pitch for president in front of a large audience at Fox News' town hall on Monday. Fox News' Bret Baier, of \"Special Report,\" and Martha MacCallum, of \"The Story,\" will co-anchor the hour-long event. It will be the Vermont senator's first appearance on Fox News Channel since he agreed to be a guest on Baier's show in December 2018. He also participated in Fox News Channel's Democratic town hall back in 2016 alongside his then-competitor Hillary Clinton. 5 THINGS TO KNOW ABOUT BERNIE SANDERS Sanders, who raised $18 million in the first six weeks of his campaign, is considered a front-runner among a crowded field of 2020 presidential hopefuls. Before the self-proclaimed Democratic socialist takes the stage, here's a look at everything you need to know. The Sanders town hall will take place on Monday, April 15 from 6:30 p.m. to 7:30 p.m. ET in Bethlehem, Pennsylvania. You can watch the town hall on the Fox News Channel. The event will also be available via live stream — just log into your TV provider to watch the event in real-time on foxnews.com or the Fox News app. \"The Story with Martha MacCallum\" will air on Fox News immediately following the event at 7:30 p.m. ET. The 77-year-old — the longest-serving Independent member of Congress ever — is expected to focus on the economy and his plans for U.S. job growth. \"It’s time for an economy that works for all of us, not just the rich,\" Sanders has repeatedly said in the past. HOW DID BERNIE SANDERS MAKE HIS MONEY? A LOOK AT HIS WEALTH AND ASSETS In December 2018, Sanders outlined four ways to \"revitalize\" the U.S. economy: increasing the minimum wage to $15 by 2024, universal health care, tuition-free colleges and the creation of \"millions of jobs\" in sustainable energy. \"Our campaign is about creating a government and economy that work for the many, not just the few,\" tweeted Sanders in February. \"We should not have grotesque levels of wealth inequality in which three billionaires own more wealth than the bottom half of the country.\"",
      "date": "April 10",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "3 Bernie Sanders policies now embraced by the Democratic field",
      "url": "https://www.foxnews.com/politics/bernie-sanders-policies-now-embraced-by-the-democratic-field",
      "subtitle": "3 Bernie Sanders policies now embraced by the Democratic field",
      "author": "Jennifer Earl",
      "content": " Bernie Sanders is one of the front-runners — raising $18 million in the first six weeks of his campaign — among a crowded field of 2020 presidential hopefuls, but the self-described democratic socialist has also been a trend-setter for the field. Since the Vermont senator mapped out his plans for a \"political revolution\" in 2016, many members of Congress have embraced his policies and ideas. And now several candidates are using them as talking points as they hit the campaign trail. BERNIE SANDERS FAST FACTS: 5 THINGS TO KNOW ABOUT THE VERMONT SENATOR Sanders will join Fox News Channel for a town hall co-anchored by Bret Baier and Martha MacCallum on Monday, April 15, at 6:30 p.m. ET in Bethlehem, Pennsylvania. Here's a look at some of the biggest proposals the 77-year-old — the longest-serving independent member of Congress in U.S. history — has championed for years that 2020 Democrats are now touting. Sanders first introduced the \"Medicare for All\" bill in 2016. He saw it as a step toward achieving universal health care. The single-payer health insurance plan would require all U.S. residents to be covered with no copays and deductibles for medical services. The insurance industry would be regulated to play a minor role in the system. HOW MUCH WOULD 'MEDICARE FOR ALL' COST? DEMOCRATS' HEALTH CARE PLAN EXPLAINED In August 2017, Sen. Kamala Harris, D-Calif., became the first Senate Democrat to support Sanders' bill. During a speech to officially launch her 2020 run, Harris declared \"health care is a fundamental right\" and vowed to serve her constituents by supporting \"Medicare for All.\" Sanders introduced an updated version of his \"Medicare for All\" plan on April 10. The following 2020 candidates have already endorsed the updated proposal: Harris, Sen. Kirsten Gillibrand, D-N.Y., Sen. Elizabeth Warren, D-Mass., and Sen. Cory Booker, D-N.J. The latest edition of Medicare for All adds coverage for long-term care in home and community settings, on top of its basic promise of comprehensive health coverage, including dental and vison. Brand name prescription drugs would be subject to copays totaling no more than $200 annually. Several independent studies of Medicare for All have estimated that it would dramatically increase government spending on health care, in the range of about $25 trillion to $35 trillion or more over a 10-year period. But a recent estimate from the Political Economy Research Institute at the University of Massachusetts in Amherst suggests that the cost could be much lower. For years, Sanders has made passionate pushes to increase the minimum wage. He recently reintroduced legislation to increase the federal minimum wage from $7.25 per hour to $15 per hour by 2024. \"While the official unemployment rate is relatively low, too many workers in America today are making wages that don’t pay enough to make ends meet. Workers and their families cannot make it on $9 an hour or $10 an hour – or even less,\" Sanders said in a statement in November, claiming it would give 40 million workers a raise. \"We have got to raise the minimum wage in this country to a living wage – at least $15 an hour.\" At least 20 states increased their minimum wages since the start of the New Year, according to Fox Business. BERNIE SANDERS' BIGGEST STAR-STUDDED BACKERS: MARK RUFFALO, DANNY DEVITO AND OTHERS The Raise the Wage Act legislation that was reintroduced in the new Congress by Sanders this year, was cosponsored by several 2020 contenders including Booker, Gillibrand, Harris, Warren and Sen. Amy Klobuchar, D-Minn. Once again, Sanders has vowed as a presidential candidate that he will aim “to make public colleges and universities tuition free.” “Higher education in America should be a right for all, not a privilege for the few,” Sanders has said. “If we are to succeed in a highly competitive global economy and have the best-educated workforce in the world, public colleges and universities must become tuition-free for working families and we must substantially reduce student debt.” Under Sanders' \"College for All Act,\" which he introduced alongside Rep. Pramila Jayapal, D-Wash., in 2017, the government would be responsible for 67 percent ($47 billion) of the cost of tuition and states would pay for the remaining 33 percent ($23 billion). \"The legislation would eliminate tuition and fees at four-year public colleges and universities for families making up to $125,000 – about 80 percent of the population – and make community college tuition- and fee-free for all,\" according to a statement released by Sanders' campaign at the time. The proposal has been backed by Warren, Harris, Gillibrand. Some candidates, such as Klobuchar, however, have blasted the idea. “No, I am not for free college for all,” Klobuchar said during a televised town hall in Manchester in February. “I wish if I was a magic genie and could give that to everyone and we could afford it, I would.  I’m just trying to find a mix of incentives and make sure kids are in need- and that’s why I talked about expanding Pell Grants, can go to college and be able to afford it and make sure that people who can’t afford it are able to pay.” South Bend Mayor Pete Buttigieg, too, hasn't fully joined the tuition-free college rallying cry. “Americans who have a college degree earn more than Americans who don’t,” Buttigieg recently said, per Politico. “As a progressive, I have a hard time getting my head around the idea of a majority who earn less because they didn’t go to college subsidizing a minority who earn more because they did.” The Associated Press contributed to this report.",
      "date": "April 11",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders’ challenge: Standing out in a field of copycats",
      "url": "https://www.foxnews.com/politics/bernie-sanders-challenge-standing-out-in-a-field-of-copycats",
      "subtitle": "Bernie Sanders’ challenge: Standing out in a field of copycats",
      "author": "Paul Steinhauser",
      "content": " CONCORD, N.H. -- Sen. Bernie Sanders didn’t win the 2016 Democratic presidential nomination. But the self-proclaimed democratic socialist arguably accomplished a more lasting feat. He changed the conversation – bringing one-time fringe positions like a \"Medicare-for-all\" single-payer health care system, a massive increase in the national minimum wage, and free tuition at community colleges and some public schools into the mainstream of the Democratic Party’s agenda. WATCH THE BERNIE SANDERS TOWN HALL ON FOX NEWS CHANNEL AT 6:30 PM ET MONDAY Now, his own success in shaping that agenda has raised an obvious challenge: He's no longer the only candidate in the field who stands for these issues. In fact, he's one of many. Crystallizing this conundrum, the senator this week re-introduced an updated version of his Medicare-for-all bill and was quickly joined by four of his rivals for the nomination -- with Sens. Cory Booker of New Jersey, Kamala Harris of California, Kirsten Gillibrand of New York and Elizabeth Warren of Massachusetts all co-sponsoring. It was the latest example of how, as the independent senator from Vermont runs a second straight time for the Democratic presidential nomination, he's both leading the charge on these policies but also fighting to stand out in a field of nearly 20 candidates, many like-minded. For the time being, polling suggests primary voters are enthusiastic about the original purveyor of these proposals. He consistently rates at the top of the field alongside former Vice President Joe Biden, who has yet to jump in. Sanders himself is quick to remind voters he was the one promoting these ideas before they were so popular. “I want to offer a very special thanks to the people of New Hampshire. In 2016, this is where the political revolution took off. Thank you, New Hampshire,” Sanders said in March as he returned to the first-in-the-nation primary state for the first time since declaring his 2020 candidacy. Recalling his marathon primary battle against Hillary Clinton, he said, “the ideas that we were talking about then were considered by establishment politicians and mainstream media to be ‘radical’ and ‘extreme’ -- ideas, they said, that nobody in America would support.” He highlighted that thanks to the wave that nearly carried him to the nomination, “those ideas that we talked about four years ago that seemed so very radical at that time -- well, today, virtually all of those ideas are supported by a majority of the American people and have overwhelming support from Democrats and independents. And they're ideas that Democratic candidates all across the board are supporting.” Medicare-for-all is a prime example. A January poll by the Kaiser Family Foundation – which focuses on health care polling – indicated that 81 percent of Democrats supported a single-payer insurance model. That support dropped to 53 percent for independents and 23 percent among Republicans questioned. On Capitol Hill, meanwhile, support remains limited, with Democratic Leader Chuck Schumer stopping short of endorsing it. SANDERS' PROPOSALS NOW EMBRACED BY 2020 DEMS Sanders said his mission in the 2020 election is “to turn our vision and our progressive agenda into reality.” But that mission is also the goal for many of his rivals for the Democratic nomination. Sen. Warren, another politician popular on the left, is also pushing the same progressive proposals. And some of the other leading 2020 candidates – such as Sens. Booker of New Jersey and Harris of California, former Rep. Beto O’Rourke of Texas, and South Bend, Indiana Mayor Pete Buttigieg – are promoting similar plans, from criminal justice and immigration reform to refusing contributions from super PACs, corporations and lobbyists to battling climate change. And some of those rivals are years younger than the 77-year-old Sanders and don’t carry with them a ‘socialist’ target on their backs. Former Democratic National Committee Chairwoman Donna Brazile says that while Sanders does face a lot of competition in the progressive lane for the nomination, “they don’t have the same name ID as Hillary Clinton and the same type of broad support that Clinton had” in 2016. “I do believe this is Senator Sanders' opportunity – his last opportunity on the national level – to score a major victory. This is about delegates, not popularity,” explained Brazile, a Fox News contributor. SANDERS SAYS FELONS BEHIND BARS SHOULD BE ABLE TO VOTE It’s early in the 2020 cycle – we still have 10 months to go before the voting begins – but so far Sanders has kept other candidates from stealing his thunder. He surged out of the gate following his Feb. 19 announcement, drawing large crowds and racking up big bucks. Sanders hauled in $18.2 million in fundraising in the first 41 days of his campaign. The senator consistently registers in second place in double digits in 2020 polling, trailing Biden – an all-but-certain White House contender – but ahead of the rest of the field. And even though they have plenty of candidates to choose from this time around, many of his supporters are sticking with Sanders. New Hampshire Sanders supporter Lorna Wakefield, who came in person to see Sanders in March when he returned to the Granite State, said she’s sticking with the senator 100 percent. “Bernie’s the one who started this all. We’re with Bernie,” she said. And, Chris Liquori – a member of the Sanders steering committee in New Hampshire – argued, “Why settle for the imitation when you’ve got somebody who’s been doing this for 40 years, who brought the party to its knees and brought them where they are now? Why would you go with anyone else?”",
      "date": "April 12",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders touts working-class message at Pittsburgh rally",
      "url": "https://www.foxnews.com/politics/bernie-sanders-working-class-message-pittsburgh-rally",
      "subtitle": "Bernie Sanders touts working-class message at Pittsburgh rally",
      "author": "Samuel Chamberlain",
      "content": " Sen. Bernie Sanders, I-Vt., argued Sunday that among the presidential candidates, he was the best Democrat to win back a string of Midwestern states from President Trump in 2020, claiming that the sitting president had told working-class families a \"monstrous lie\" by vowing to take on monied interests in Washington. \"Donald Trump has told literally thousands of lies since he began his campaign and since he has been in the White House,\" Sanders told an estimated crowd of 4,500 at an outdoor rally in Pittsburgh. \"But, the biggest lie that he told the people of Pennsylvania ... was that he was going to stand up for working families and take on the establishment.\" Sunday's rally wrapped up a four-day, five-state swing during which Sanders also held rallies in Wisconsin and Michigan. Voters in all three states backed Trump over Hillary Clinton in 2016, stunning Democrats who had seen them as part of a \"blue wall\" held together by urban African-American voters and traditionally liberal white working-class voters. The Sanders campaign said in a memo prepared in advance of the trip that the pathway to victory runs through the Midwest. The memo said that Sanders has received donations from more than 8,000 people in Wisconsin, 14,000 in Michigan and 18,000 in Pennsylvania. Sanders was leading all Democratic candidates in fundraising. Sanders had a good showing in the industrial belt in 2016's Democratic primary, winning Michigan, Indiana and Wisconsin. But Hillary Clinton pounded him by 12 percentage points in Pennsylvania. \"We are going to win in Pennsylvania, we’re going to win in Michigan, we're going to win in Wisconsin, we're going to win in Indiana and Ohio,\" Sanders promised his cheering supporters. \"And, by the way, we’re going to win the election.\" Earlier in Lordstown, Ohio, and again in Pittsburgh, Sanders pressed Trump to put action behind his words on General Motors plant closings. Trump has assailed the company for shutting its small-car factory in Lordstown, in a politically important state, complaining about the company's leadership and a local union leader while seldom mentioning the other U.S. factories that GM plans to close. That's not enough, Sanders said. \"If you want a federal contract paid for by taxpayers, treat your workers with respect and dignity. No more paying your workers inadequate wages while you provide CEO's with multimillion-dollar parachutes, no more taking away health care benefits, no more denying workers the right to form a union. \"And if you are not a good and responsible corporate citizen, do not think that you will get federal contracts,\" Sanders added. The self-described democratic socialist said his political movement mirrored the labor movement, the civil rights movement, the women's movement and the gay rights movement in showing that \"real change never takes place from the top on down, always from the bottom up.\" He recited a laundry list of policies -- including raising the federal minimum wage, government-run health care and legalizing marijuana -- that he claimed were described as \"too radical\" by members of the media and political establishment. SEN. BERNIE SANDERS: WE NEED AN ECONOMY AND GOVERNMENT THAT WORKS FOR ALL, NOT JUST THE TOP ONE PERCENT \"Today, virtually all of those ideas are supported by a majority of the American people and they are ideas that Democratic candidates from school board to president of the United States now support,\" Sanders said, noting that his insurgent campaign for the 2016 Democratic nomination had netted \"more votes from young people than Trump and Clinton combined.\" Sanders also proudly noted that his supporters had campaigned successfully to change the party's rules governing superdelegates at next year's Democratic National Convention \"and maybe ending a system in which one candidate had 500 superdelegates before the first vote was cast.\" The Democratic National Committee voted last summer to prevent superdelegates from voting on the first presidential nomination ballot unless a candidate had enough votes from pledged delegates, who choose a candidate based on the results of the Democrats' primaries and caucuses. The Vermont senator also addressed his signature issue, vowing to health insurance companies that \"whether you like it or not, the United States will join every other major country on earth and guarantee health care to all people as a right.\" CLICK HERE TO GET THE FOX NEWS APP \"It is an international embarrassment that in America today we got 30 million people with no health insurance and even more who are underinsured with high deductibles and high co-payments and for all of that we end up spending twice as much per capita on healthcare as do the people of any other nation,\" said Sanders, who warned his audience that \"the insurance companies are getting nervous\" about his message. \"They are prepared and will spend hundreds of millions of dollars to stop us,\" he said, \"but we are gonna win this struggle and we will pass a Medicare for All single-payer program.\" Fox News' Jennifer Oliva in Pittsburgh and Adam Shaw contributed to this report.",
      "date": "April 14",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders says he was 'more fatigued' in months leading up to heart attack but ignored symptoms",
      "url": "https://www.foxnews.com/politics/bernie-sanders-says-he-was-more-fatigued-in-months-leading-up-to-heart-attack-but-ignored-symptoms",
      "subtitle": "Bernie Sanders says he was 'more fatigued' in months leading up to heart attack but ignored symptoms",
      "author": "Vandana Rambaran",
      "content": " Sen. Bernie Sanders, I-Vt., admitted Tuesday he \"was dumb\" and ignored warning signs of a health condition in the months leading up to his heart attack last week. \"I must confess, I was dumb,\" the 2020 presidential candidate said outside his home in Burlington, Vt. \"Thank God, I have a lot of energy during this campaign. I've been doing, in some cases, three or four rallies a day, going all over the state, Iowa, New Hampshire, wherever. And yet I, in the last month or two, just was more fatigued than I usually have been.\" \"I should have listened to those symptoms,\" the 78-year-old presidential hopeful said. BERNIE SANDERS RELEASED FROM HOSPITAL, DOCTORS SAY HE SUFFERED HEART ATTACK Sanders revealed that he never had a doctor in his Vermont hometown, \"let alone a cardiologist,\" because his primary physician is based in Washington, D.C. \"We're going to meet him,\" Sanders said moments before getting in a car with his wife, Jane, to attend the appointment with his new physician. \"I understand he's a very good cardiologist. Going to see him on a regular basis to get some checkups, and obviously, I'll be on-and-off in Vermont and so we're going to meet him today.\" Sanders insisted he was \"feeling good,\" adding that he doesn't think the heart attack, for which he had two stents inserted into his chest to help with blood flow, \"helps or hurts\" his chances of beating President Trump in 2020. His campaign also downplayed any skepticism that his ailments would have a negative impact on his presidential run. \"Make no mistake, Sen. Bernie Sanders is as committed — more so, even more now than he always has been, if that's even possible,\" national campaign co-chair Nina Turner told the Associated Press in an interview. Sanders is scheduled to attend the fourth Democratic presidential debate in Ohio next week. He said Tuesday that he \"certainly intends to be actively campaigning\" but will \"change the nature\" and frequency of rallies and events to \"make sure I have the strength to do what I have to do.\" “We were doing, you know, in some cases five or six meetings a day, three or four rallies and town meetings and meeting with groups of people,” Sanders said about his campaign prior to his heart attack. “I don’t think I’m going to do that.” Even before Sanders was rushed to the hospital after complaints of chest pains during a campaign rally in Nevada last week, the candidate faced questions about his age. The 78-year-old is the oldest candidate in the race and would be the oldest person to be elected president, should he win. Sanders said he still plans to release his medical records, promising to do so \"at the appropriate time.\" A spokesperson for Sanders did not respond to Fox News' request for comment. CLICK HERE FOR THE FOX NEWS APP \"If there's any message that I hope we can get out there, is that I want people to pay attention to their symptoms,\" Sanders said. \"When you're hurting, when you're fatigued, when you have pain in your chest, listen to it.\" Sanders received another piece of bad news on Tuesday. His daughter-in-law, 46-year-old Rainè Riggs, died at a Pennsylvania hospital two days after being diagnosed with cancer, according to an obituary posted on the Lee & Martin Funeral Home Facebook page. Riggs was married to Sanders' son Levi and the couple has three children. The Associated Press contributed to this report.",
      "date": "October 8",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Can Bernie Sanders make peace with grudge-nursing Democrats?",
      "url": "https://www.foxnews.com/politics/can-bernie-sanders-grudge-nursing-democrats",
      "subtitle": "Can Bernie Sanders make peace with grudge-nursing Democrats?",
      "author": "Paul Steinhauser",
      "content": " Hard feelings linger in campaign politics. “After every primary cycle, there’s always bad blood because people spill a lot of blood in the process,” said former Democratic National Committee chairwoman Donna Brazile, a Fox News contributor. “Unfortunately political wounds don’t heal as quickly as physical wounds.” WATCH THE BERNIE SANDERS TOWN HALL ON FOX NEWS CHANNEL ON MONDAY AT 6:30 PM ET. Need proof? Look no further than the 2020 Democratic presidential fight. Three years after Democrats witnessed a vicious presidential primary battle between eventual nominee Hillary Clinton and one-time longshot Bernie Sanders, there are concerns that a revival of the war of words between their two camps could do damage to the party in 2020. “I think there’s a small segment of people in both camps who harbor significant resentment,” a veteran Democratic campaign strategist told Fox News. The strategist, who asked for anonymity to speak more freely, warned that there “are Bernie people who have constantly attacked Clinton and there are Clinton people who resent the primary of 2016. I think this is a lingering problem that’s going to find its way into the 2020 nomination process.” BERNIE SANDERS POLICIES NOW BACKED BY 2020 DEM FIED Sanders and Clinton tried to bury the hatchet in the summer of 2016, in hopes of putting to rest a bitter and contentious primary fight for the Democratic presidential nomination that saw Sanders blast the party’s establishment favorite. But the delicate peace between the independent senator from Vermont and the former U.S. secretary of state was tepid at best. And following Clinton’s shocking loss to GOP nominee Donald Trump in the 2016 general election, Clinton and many of her top staffers blamed Sanders and his legions for her defeat. Fast forward to 2019 and the ill will lingers. Some of Clinton’s top aides from her 2016 campaign took aim at Sanders earlier this year, as he came out of the gate on a roll following the February launch of his second straight presidential campaign. Ex-Clinton staffers savaged Sanders over his use of private jets during the 2016 general election while he was stumping across the country for the Democratic nominee, as detailed in a Politico article. BERNIE'S BIG BUCKS: SANDERS HAULS IN $18.2 MILLION Explanations from the Sanders camp that the senator needed to fly private jets in order to keep a non-stop itinerary of nearly 40 rallies in 13 states during the closing weeks of the 2016 campaign didn’t fly with some of those Clinton aides. “Royal Majesty King Bernie Sanders would only deign to leave his plush D.C. office or his brand new second home on the lake if he was flown around on a cushy private jet like a billionaire master of the universe,” Zac Petkanas, the Clinton’s 2016 campaign’s director of rapid response, said. The spokesman for the Sanders 2016 campaign fired back, claiming that members of Clinton’s team are some of the “biggest a--holes in American politics.” “You can see why she’s (Clinton) one of the most disliked politicians in America,\" Michael Briggs added, speaking to Politico. Sanders did himself no favors in an appearance earlier this year on “The View.” Asked if he would be asking for advice from the 2016 nominee – as some rivals for the nomination have been doing – Sanders answered, “I suspect not….Hillary and I have fundamental differences.” Longtime Clinton spokesman Nick Merrill took to Twitter to punch back. “I don’t know who our nominee is going to be but I am damn sure that beating Trump & getting America back on the right footing is going to require a unified Democratic Party, so crap like this 613 days before Election Day is irresponsible, counter-productive, & sets us all back,” he tweeted. IT'S BIDEN, SANDERS AND BUTTIGIEG IN LATEST NH 2020 POLL The war of words is worrying some longtime Sanders supporters in New Hampshire, where the senator’s crushing victory over Clinton in the February 2016 primary rocketed him into the bloody battle with the eventual nominee. “They need to learn the lessons of why they lost what should have been an easy victory and just live with it so we can win [in 2020],” urged former state Sen. Burt Cohen, a member of the Sanders steering committee in the Granite State. “We have to keep our eyes on the prize, which is saving America from Trumpism,” he added. “Carrying forth 2016 bitterness does no good.” The call for unity to oust the Republican president from the White House in the 2020 election was echoed by Kathy Sullivan, a former longtime New Hampshire Democratic Party chair who for the last decade served as a Democratic National Committee member. “I think that everyone wants to beat Donald Trump and that’s the most important thing. I think most people would say ‘that’s over and done with and let’s focus on 2020.’ Let’s not hurt ourselves,” noted Sullivan, who backed Clinton in the 2016 primary. Judy Reardon, a veteran Granite State-based Democratic strategist who also supported Clinton last time around, said she’ll back whomever wins the nomination. “People like me who supported Hillary Clinton are very practical and will support the Democratic nominee for president. To the extent there are hard feelings, I don’t think they’ll impact how people vote.”",
      "date": "April 15",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders Town Hall with Fox News -- live blog",
      "url": "https://www.foxnews.com/politics/bernie-sanders-town-hall-with-fox-news-live-blog",
      "subtitle": "Bernie Sanders Town Hall with Fox News -- live blog",
      "author": "Nicole Darrah",
      "content": " Sen. Bernie Sanders, I-Vt., sat down with Fox News' Bret Baier and Martha MacCallum on Monday night at a town hall in Bethlehem, Pennsylvania. Follow FoxNews.com's live blog below. Mobile users click here.",
      "date": "April 15",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders, angry at potshots, slams left-wing group",
      "url": "https://www.foxnews.com/politics/bernie-sanders-angry-at-potshots-slams-left-wing-group",
      "subtitle": "Bernie Sanders, angry at potshots, slams left-wing group",
      "author": "Howard Kurtz",
      "content": " There were three big-time events over the weekend. Tiger Woods pulled off the most remarkable comeback in any sport with his Masters win. (And Donald Trump called it, said he'd win majors after they played together in February, you've gotta give him that.) Pete Buttigieg delivered an announcement speech (soon after the 18th hole) that drew Tiger levels of praise, as the media lovefest with the South Bend mayor continues unabated. (Beto who?) And Bernie Sanders picked a fight with a liberal website, making sure it was leaked to The New York Times. It's long past time to take Bernie seriously. \"Bernie Sanders is the Democratic Front-Runner,\" says the Atlantic. \"Stop Thinking of Bernie Sanders As a Gadfly. He's the Front-Runner,\" cautions the L.A. Times. He's raised the most money ($18 million), he's drawing big crowds, and in a new Emerson poll, he edges out the undeclared Joe Biden, 29 to 25 percent. Sanders even forced himself to talk to reporters for the first time in two months on the trail. So why on earth is he starting an intra-party battle with a scathing letter to the Center for American Progress? In the letter, Sanders wrote: \"This counterproductive negative campaigning needs to stop. The Democratic primary must be a campaign of ideas, not of bad-faith smears. Please help play a constructive role in the effort to defeat Donald Trump.\" The backstory: The Center for American Progress is a Hillary-centric think tank, founded by John Podesta 16 years ago and funded in part by George Soros. It remains filled with Democratic establishment figures. Sanders undoubtedly got screwed by the DNC and the party apparatus in 2016, when the playing field, including a meager number of debates, was tilted to favor Hillary Clinton. So he's understandably sensitive on the subject. But Bernie's beef is with ThinkProgress, a liberal website that is affiliated with CAP but which both groups say is editorially independent. What really burned Bernie was a posting that began: \"It's all very off-brand and embarrassing, but Sen. Bernie Sanders is a millionaire. Turns out railing against 'millionaires and billionaires' can be quite the lucrative enterprise.\" Now I happen to think this is utter BS. The Vermont senator achieved millionaire status in part by writing a book that became a best-seller. Absolutely nothing wrong with that. And Sanders made that point forcefully last night at a Fox News town hall with Bret Baier and Martha MacCallum. Sanders accused ThinkProgress of \"dishonesty\" and said the site was also being unfair to fellow liberals Elizabeth Warren and Cory Booker. ThinkProgress editor-in-chief Jodi Enda, a former CNN and Knight-Ridder reporter, responded by saying her site will not take sides in the Democratic primaries. \"Political leaders should not be able to muzzle or stop coverage that they consider critical,\" said Enda's statement, reported by the Times. But by yesterday CAP President Neera Tanden had backed down, saying a ThinkProgress video on Sanders “is overly harsh and does not reflect our approach to a constructive debate of the issues.” Sanders is obviously trying to send a message. But isn't he punching down by going after an ideological website? CLICK HERE TO GET THE FOX NEWS APP In other words, if he's on track to win the Democratic presidential nomination, he should be brushing off criticism by liberal writers. The letter makes him sound hypersensitive — and the leak broadcast the dispute to many millions who would never have seen the ThinkProgress post. Sanders is about to draw far tougher press scrutiny than he did in 2016, when the media never thought he had a shot at beating Hillary. And how he deals with that scrutiny will show people whether he has the toughness to take on Trump.",
      "date": "April 16",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders: Climate change poses a bigger threat to America than ISIS",
      "url": "https://www.foxnews.com/politics/bernie-sanders-climate-change-isis-2020",
      "subtitle": "Bernie Sanders: Climate change poses a bigger threat to America than ISIS",
      "author": "Nick Givas",
      "content": " 2020 presidential hopeful Sen. Bernie Sanders, I-Vt., said climate change represents a bigger threat to national security than ISIS or Al Qaeda, during a campaign speech in Des Moines, Iowa, Sunday. \"Four years ago I came here to Iowa and I was asked what is the major national security issue we face? And people thought I’d say ISIS or Al Qaeda, and those are big issues. The answer that I gave, in terms of national security, is climate change,\" Sanders said as the crowd cheered. Sanders has been an outspoken advocate of government intervention to combat climate change but also spent nearly $300,000 on private air travel in October 2018. BERNIE SANDERS CLAIMS 'MEDICARE-FOR-ALL' WILL SLASH HEALTH CARE COSTS WITH TAX HIKE Sanders’ 2018 campaign committee paid $297,685 on October 10 to New York-based Apollo Jets, a charter jet company used by famous sports stars, according to federal campaign reports obtained by VTDigger.org, a watchdog website in Vermont. “This expense was for transportation for the senator’s nine-day, nine-state tour to support Democratic candidates up and down the ballot ahead of Election Day,” said Arianna Jones, senior communications adviser for Friends of Bernie Sanders. Sanders also called President Trump an \"idiot\" on Twitter Saturday for being skeptical of climate change. \"Donald Trump believes climate change is a hoax. Donald Trump is an idiot,\" he wrote. CLICK HERE FOR THE FOX NEWS APP Anti-Trump Rep. Rashida Tlaib, D-Mich., responded to Sanders' tweet and called Trump \"a danger to our democracy and our country's future.\" Fox News Louis Casiano and David Montanaro contributed to this report.",
      "date": "August 12",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Ann Coulter says she’d consider vote for Bernie Sanders",
      "url": "https://www.foxnews.com/politics/ann-coulter-says-shed-consider-vote-for-bernie-sanders",
      "subtitle": "Ann Coulter says she’d consider vote for Bernie Sanders",
      "author": "Joseph A. Wulfsohn",
      "content": " Conservative commentator Ann Coulter said she could support Sen. Bernie Sanders, I-VT, in 2020 and even floated the idea of working in his administration if he returned to his earlier stance on immigration. In a preview clip of PBS’s “Firing Line with Margaret Hoover” released Wednesday, host Margaret Hoover asked Coulter how she viewed the progressive senator. She asked whether she would support him if he campaign on “getting rid of low-skilled workers” to ensure higher wages. FOX NEWS POLL: TRUMP APPROVAL STEADY SINCE MUELLER PROBE ENDED “If he went back to his original position, which is the pro-blue-collar position. I mean, it totally makes sense with him,\" she said. If he went back to that position, I’d vote for him. I might work for him. I don’t care about the rest of the socialist stuff. Just-- can we do something for ordinary Americans?” Coulter was apparently referencing Sanders’ policy position from 2007 where he opposed an immigration reform bill that he feared would drive down wages for lower-income workers. He co-authored a restrictive immigration amendment with Sen. Chuck Grassley, R-IA. The bill ultimately failed to pass the Senate. Sanders rejected the idea of having open borders while speaking at a campaign event earlier this month. GET THE FOX NEWS APP “What we need is comprehensive immigration reform. If you open the borders, my God, there's a lot of poverty in this world, and you're going to have people from all over the world. And I don't think that's something that we can do at this point. Can't do it. So that is not my position,” Sanders said. Coulter, who authored the book “In Trump We Trust” ahead of the 2016 election, was an early supporter of Donald Trump but has since become a vocal critic of the president for not keeping his campaign promise of building a wall at the southern border.",
      "date": "April 18",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Krugman defends Bernie Sanders' wealth, says he displays 'civic virtue'",
      "url": "https://www.foxnews.com/politics/nyts-paul-krugman-defends-bernie-sanders-wealth-says-hes-no-hypocrite-displays-civic-virtue",
      "subtitle": "Krugman defends Bernie Sanders' wealth, says he displays 'civic virtue'",
      "author": "Lukas Mikelionis",
      "content": " New York Times opinion columnis Paul Krugman-- who once called Sen. Bernie Sanders' economic policies “destructive self-indulgence”-- is now praising the leading 2020 candidate for “civic virtue” because he’s advocating his policies despite his riches. Krugman, a Nobel Prize-winning economist, offered a defense of Sanders on Thursday following the revelations that the senator became part of America's one percent, thanks to his 2016 presidential campaign that propelled him to national stardom and wealth. BERNIE SANDERS RELEASES 10 YEARS OF TAX RETURNS; DEMOCRATIC SOCIALIST MADE OVER $560G IN 2018 “A peculiar chapter in the 2020 presidential race ended Monday, when Bernie Sanders, after months of foot-dragging, finally released his tax returns,” Krugman wrote, calling the filings “perfectly innocuous.” He said that while it seems that “Sanders got a lot of book royalties after the 2016 campaign, and was afraid that revealing this fact would produce headlines mocking him for now being part of the 1 Percent,” he shouldn’t actually hide his wealth. “Politicians who support policies that would raise their own taxes and strengthen a social safety net they’re unlikely to need aren’t being hypocrites; if anything, they’re demonstrating their civic virtue,” Krugman wrote, calling such attacks “stupid.” The senator’s 2018 tax return revealed that he and his wife, Jane, earned over $550,000, including $133,000 in income from his Senate salary and $391,000 in sales of his book, “Our Revolution: A Future to Believe In.” The filings showed that Sanders has been among the top 1 percent of earners in the U.S. According to the liberal-leaning Economic Policy Institute, families in the U.S. earning $421,926 or more a year are part of this group. NY TIMES' PAUL KRUGMAN SAYS US PART OF 'NEW AXIS OF EVIL' WITH RUSSIA, SAUDI ARABIA Krugman’s rare defense of Sanders comes after his relentless attacks on the Sanders campaign during the 2016 election. In a January 2016 column, Krugman decried Sanders’ idealism, saying “it’s not a virtue unless it goes along with hardheaded realism,” which Sanders doesn’t have. “Sorry, but there’s nothing noble about seeing your values defeated because you preferred happy dreams to hard thinking about means and ends. Don’t let idealism veer into destructive self-indulgence,” he wrote. In a blog post the same month, Krugman also declared Sanders’ positions on financial reform and healthcare were “disturbing.” “And in both cases his positioning is disturbing — not just because it’s politically unrealistic to imagine that we can get the kind of radical overhaul he’s proposing, but also because he takes his own version of cheap shots,” he wrote. CLICK HERE TO GET THE FOX NEWS APP “Not at people — he really is a fundamentally decent guy — but by going for easy slogans and punting when the going gets tough.”",
      "date": "April 19",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders threatens to ‘leverage’ US aid to combat Israel ‘racism’",
      "url": "https://www.foxnews.com/politics/bernie-sanders-threatens-to-leverage-us-aid-to-combat-israel-racism",
      "subtitle": "Bernie Sanders threatens to ‘leverage’ US aid to combat Israel ‘racism’",
      "author": "Ronn Blitzer",
      "content": " Sen. Bernie Sanders, I-Vt., threatened Tuesday to use billions of dollars in aid to Israel as “leverage” to combat what he called “racism” from the Jewish state’s government, while going so far as to compare America's Israel alliance to its relationship with Saudi Arabia. Sanders, one of the leading candidates in the Democratic presidential primary race and an increasingly vocal critic of the Netanyahu government, said during a New Hampshire town hall event that the U.S. should take a broader view of the Middle East – and the Israeli-Palestinian conflict in particular – and not always side with Israel. SANDERS CAMPAIGN'S #MYBERNIESTORY BACKFIRES AS GRUDGE-BEARING DEMS LASH OUT OVER 2016 “The United States government gives a whole lot of money to Israel, and I think we can leverage that money to end some of the racism that we have recently seen in Israel,” he said. Sanders compared the situation to the United States' alliance with Saudi Arabia, which he called “a corrupt, murderous regime” despite being “good pals of ours” while opposing Iran. “You can criticize both,” he said. Regarding the absence of a lasting peace accord between Israel and the Palestinians, Sanders did make clear that he is not blaming only one side. BERNIE SANDERS SAYS CLIMATE CHANGE IS BIGGEST THREAT TO NATIONAL SECURITY “The fault is not all with Israel, you have very poor and corrupt Palestinian leadership, but what the goal of the United States has got to be is to bring people in the region together, the Palestinians and the Israelis to create a kind of workable peace which works for both parties, not just one.” This echoed what the self-proclaimed democratic socialist said in July on the “Pod Save America” podcast, where he said, \"Our policy cannot just be pro-Israel, pro-Israel, pro-Israel. It has got to be pro-region working with all of the people, all of the countries in that area.” In that segment, Sanders also made the Saudi Arabia comparison and suggested using aid as leverage. If elected, Sanders would be the first Jewish president. As such, he insisted at the New Hampshire event that opposition to Prime Minister Benjamin Netanyahu’s right-wing government is not anti-Semitic. The Democratic Party lately has struggled with how to frame criticism of Israel's government, with some lawmakers accusing members like Rep. Ilhan Omar, D-Minn., of using anti-Semitic language in suggesting Israel supporters in America are bought. She and congressional allies have also likened boycotts of Israel to boycotts of Nazi Germany. CLICK HERE FOR THE FOX NEWS APP The U.S. State Department recently updated its definition of anti-Semitism to include, \"Drawing comparisons of contemporary Israeli policy to that of the Nazis.\" Sanders has not used such language. But his accusations that the Netanyahu government is racist have drawn a rebuke from pro-Israel lobby AIPAC, which earlier this year tweeted in response: \"Name-calling by political leaders against the democratically elected government of Israel is counterproductive to maintaining close ties and advancing peace.\" Fox News' Dom Calicchio contributed to this report.",
      "date": "August 14",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders could beat Trump in 2020: Karl Rove",
      "url": "https://www.foxnews.com/politics/bernie-sanders-trump-2020-karl-rove",
      "subtitle": "Bernie Sanders could beat Trump in 2020: Karl Rove",
      "author": "Elizabeth Llorente",
      "content": " Republican strategist Karl Rove said on “Fox & Friends” Friday that Sen. Bernie Sanders' town hall on Fox earlier this week convinced him that the presidential candidate could win the Oval Office in 2020. He credited Sanders, who is 77 and from Vermont, for going on Fox News. “First of all, the simple fact that he went on” was impressive, Rove said. \"Bernie comes on to Fox, and gets the largest viewership of any campaign event thus far.” “That was a smart move on his part,” Rove said. Rove, who was the architect of George W. Bush’s presidential campaigns in 2000 and 2004, said that it is apparent that Sanders has run for president before and has learned from earlier missteps. HOW BERNIE WENT FROM SOCIALIST GADFLY TO FRONTRUNNER “He is a lot more fluid,” Rove said, noting that Sanders deftly pivoted to the messages he wanted to push when Fox News anchors Martha MacCallum and Bret Baier asked him tough questions about his taxes and to respond to presidential contender and Mayor Pete Buttigieg’s call for a “new generation of leadership.” “He says ‘I paid all the taxes I owe,’ and he quickly pivots and says ‘I released 10 years of tax returns, President Trump ought to do the same.’ Martha says ‘You know, here’s Mayor Pete, he says there should be a new generation of leadership. You will be 79 if you’re sworn in as president.’ He makes a joke. He says ‘It’s a fair question.’ He says ‘It’s not whether you’re young or old, it’s what you believe.’” “Every time he brought it back to his message,” said Rove, who wrote about Sanders' strong 2020 prospects in a Wall Street Journal editorial this week. “That demonstrated to me that he has learned from having run before. He really did a good job of softening the edges of socialism. Whenever the issue came up, he made it feel warm and fuzzy, kumbaya, shake hands, run around the campfire.” Rove noted that Sanders stressed the importance of not having an all anti-Trump message. Sanders said that Democrats “will lose if we spend our time bashing Trump.” CLICK HERE TO GET THE FOX NEWS APP “He was focused on what he was for,” Rove said. But while Sanders, a self-styled democratic socialist, tries to make socialism seem mainstream, he failed to provide details about how such concepts as Medicare-for-all would be funded, Rove said. “He says, ‘Everything we propose we’re paying for,’ without telling us that it’s trillions and trillions and trillions of dollars.” Rove said that Trump’s camp seems to view Sanders as a formidable contender for 2020. “Some of the Trump campaign people said ‘You know what? We’re paying attention to this guy. We’ve got to take him seriously.’”",
      "date": "April 19",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Former Bernie Sanders staffer sues pro-Sanders organization for racial discrimination",
      "url": "https://www.foxnews.com/politics/former-bernie-sanders-staffer-sues-pro-sanders-organization-for-racial-discrimination",
      "subtitle": "Former Bernie Sanders staffer sues pro-Sanders organization for racial discrimination",
      "author": "David Montanaro",
      "content": " A former Bernie Sanders campaign staffer has filed a racial discrimination lawsuit against the pro-Sanders group, Our Revolution. On \"Fox & Friends\" Monday, Tezlyn Figaro, who served as director for racial justice issues on the Sanders campaign in 2016, said she and others have been \"concerned for years with issues of racism\" among people working for the Vermont senator. \"I'm not saying he himself is racist, but his movement is. It is a reason why no one from the 2016 black outreach department is there working for Senator Sanders,\" she said. Figaro said it was \"important to [her]\" to file the federal lawsuit laying out her allegations and what she experienced in 2016. PETE BUTTIGIEG TOWN HALL WITH FOX NEWS: AS IT HAPPENED Host Steve Doocy pointed out reports last spring that said Figaro was fired from Our Revolution for offensive comments about immigrants. Figaro denied that was the case, alleging she was fired \"because of black outreach\" and disagreements about her advocacy on behalf of incarcerated African-Americans. She accused Lucy Flores -- who has accused former Vice President Joe Biden of inappropriate touching -- of pushing the story to media outlets, including Politico. She said that she was accused of being anti-immigrant because of her appearances on Fox News and a comment she made about immigrants receiving benefits that Americans are not getting. CLICK HERE TO GET THE FOX NEWS APP Doocy said the show reached out to the Sanders campaign and Our Revolution, but did not receive a response. Figaro called on Sanders to meet with her and other former staffers who worked on black outreach efforts. \"Show us that black lives really do matter, instead of just in a stump speech,\" she said.",
      "date": "May 20",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders backers upset with Pete Buttigieg over Trump comparison",
      "url": "https://www.foxnews.com/politics/bernie-sanders-backers-upset-with-mayor-pete-buttigieg-over-trump-comparison",
      "subtitle": "Bernie Sanders backers upset with Pete Buttigieg over Trump comparison",
      "author": "Liam Quinn",
      "content": " It doesn’t seem like Bernie’s bros with Mayor Pete. Or at least his supporters aren't. Buttigieg, the mayor of South Bend, Ind., made headlines when he compared President Trump’s supporters to those who back Bernie Sanders, stating both groups feel marginalized and want to tear down the system. “I think the sense of anger and disaffection that comes from seeing that the numbers are fine, like unemployment’s low, like all that, like you said GDP is growing and yet a lot of neighborhoods and families are living like this recovery never even happened,” the 37-year-old told high school students in Nashua, N.H. “It just kind of turns you against the system in general and then you’re more likely to want to vote to blow up the system, which could lead you to somebody like Bernie and it could lead you to somebody like Trump. I think that’s how we got where we are.” SANDERS NABS TOP SPOT IN NEW DEMS POLL AS PETE BUTTIGIEG GAINS MOMENTUM But the statement seemingly hasn’t gone over well with those who support Sanders -- including some prominent Democrats. “Come on ⁦@PeteButtigieg⁩. It is intellectually dishonest to compare Bernie to Trump,” Rep. Ro Khanna, D-Calif., tweeted, before listing some policy differences between Sanders and the president. Nina Turner, a vocal supporter of Sanders, tweeted: “Bernie Sanders’ supporters are not the same as Trump fans — Sen. @BernieSanders supporters are Democratic & Independent voters, many of whom are people of color.” Citizen Uprising, a far-left Twitter account, sent out a post reading: “Pete Buttigieg is officially over. He just blamed Trump AND Bernie voters for the problems we currently face.” PETE BUTTIGIEG WAS VOTED 'MOST LIKELY TO BE PRESIDENT' IN HIGH SCHOOL: REPORT However, Rep. Khanna’s and others protests were quickly shot down, with one prominent analyst referring to the California Democrat as a “Sanders surrogate.” “This is an extremely weird Narrative coming from some Sanders surrogates. Buttigieg's comments were extremely boilerplate, basically that Trump and Sanders voters both suffer economic anxiety and are disaffected with the system,” FiveThirtyEight’s Nate Silver tweeted. TRUMP WOULD BEAT SANDERS IN 2020 MATCHUP, OBAMA CAMPAIGN MANAGER SAYS “It's an extremely weird thing to get upset about unless they're deliberately looking to pick a fight with Buttigieg.” New York-based writer M. Mendoz Ferrer also took issue with complaints from those on the Sanders side. CLICK HERE TO GET THE FOX NEWS APP “So, it's interesting that the Sanders camp, including Ro Khanna, are upset with @PeteButtigieg for basically stating that Trump and Sanders voters both suffer economic anxiety and are disaffected with the system - because that is pretty much all Bernie Sanders ever says,” she tweeted.",
      "date": "April 22",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Biden hires former Bernie Sanders' spokesperson as senior adviser",
      "url": "https://www.foxnews.com/politics/biden-hires-former-bernie-sanders-spokesperson-as-seniro-advisor",
      "subtitle": "Biden hires former Bernie Sanders' spokesperson as senior adviser",
      "author": "Andrew O'Reilly",
      "content": "  Former Vice President Joe Biden has not only snagged the limelight from Sen. Bernie Sanders, I-Vt., with his announcement that he is joining the 2020 Democratic presidential field, but he also snagged away some of Sanders’ former staff. Biden, who made his long-awaited entry into the race for the White House on Thursday, has hired former Sanders’ staffer Symone Sanders to be one of his senior campaign advisers, his campaign announced. Sanders served as the Vermont lawmaker’s spokeswoman in the 2016 presidential race and is a well-known Democratic strategist and political commentator on CNN. PROGRESSIVE GROUP TAKES AIM AT BIDEN SOON AFTER LAUNCH The hiring of Sanders is another indication of the expected tough fight that Biden and Sanders are in for as the two frontrunners battle a deep Democratic field. While Sanders himself didn’t torch Biden as he jumped into the race, it’s clear that many of his progressive supporters view the former vice president as a threat. Biden’s entry into the race – at least in the early going – sets up a battle between himself and Sanders, who thanks to his fierce fight with eventual nominee Hillary Clinton for the 2016 Democratic nomination, enjoys name ID on the level of the former vice president. Justice Democrats -- who also called Biden “out-of-touch” – is an increasingly influential group among the left of the party. They’ve championed progressive Rep. Alexandria Ocasio-Cortez of New York as well as Sanders. The group was founded by members of Sanders 2016 presidential campaign. Biden has pushed back against the perception that he's a moderate in a party that's increasingly moving to the left. Earlier this month he described himself as an “Obama-Biden Democrat.” And Biden said he'd stack his record against \"anybody who has run or who is running now or who will run.\" CLICK HERE TO GET THE FOX NEWS APP Highlighting his early public push for same-sex marriage, he said, \"I'm not sure when everybody else came out and said they're for gay marriage.\" Former Democratic National Committee chair Donna Brazile – a Fox News contributor – highlighted that “Joe Biden can occupy his own lane in large part because he’s earned it. He’s earned the right to call himself whatever.” But she emphasized that “elections are not about the past, they’re about the future…I do believe he has the right ingredients. The question is can he find enough people to help him stir the pot.”",
      "date": "April 25",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders calls for doubling union membership, scrapping ‘right to work’ laws",
      "url": "https://www.foxnews.com/politics/sanders-aims-to-double-union-membership-scrap-right-to-work-laws",
      "subtitle": "Bernie Sanders calls for doubling union membership, scrapping ‘right to work’ laws",
      "author": "Paul Steinhauser",
      "content": " Democratic presidential candidate Sen. Bernie Sanders says he wants to double union membership and give workers the right to strike without the fear of their jobs being filled by replacement workers, ahead of a speech Wednesday to organized labor. In unveiling his \"workplace democracy plan\" Wednesday morning ahead his appearance at the Iowa AFL-CIO convention, the progressive senator from Vermont said “corporate America and the billionaire class have been waging a 40-year war against the trade union movement in America that has caused devastating harm to the middle class in terms of lower wages, fewer benefits and frozen pensions.” FIVE THINGS TO KNOW ABOUT BERNIE SANDERS Sanders, who is making his second straight bid for the Democratic presidential nomination, vowed “that war will come to an end when I am president. If we are serious about rebuilding the middle class in America, we have got to rebuild, strengthen and expand the trade union movement in America.” Sanders said if elected, he would aim to double union membership by the end of his first term in the White House in January 2025.  His plan also calls for ending so-called \"right to work\" laws favored by Republicans and decried by organized labor for weakening a union’s ability to negotiate contracts. Twenty-seven states currently have such laws, which prevent unions from insisting workers become union members as a work requirement. Sanders’ proposal would also give every union worker the right to strike and ban the replacement of striking workers. And the progressive senator also pledged to sign an executive order to prevent large corporations from engaging in union-busting and outsourcing jobs, while preventing companies that pay workers less than $15 per hour from obtaining federal contracts. WARNING SIGNS FOR SANDERS IN LATEST 2020 DEMOCRATIC PRIMARY POLLS The Sanders blueprint would also stop employers from “ruthlessly exploiting workers by misclassifying them as independent contractors or denying them overtime by falsely categorizing them as a ‘supervisor.’” The progressive senator has long been a friend to organized labor. He has headlined New Hampshire’s annual AFL-CIO Labor Day breakfast the past five years and this year on the presidential campaign trail he’s joined striking workers on the picket lines a handful of times. He has also confronted Walmart’s leadership at their annual shareholders meeting, asking for an increase in the company’s minimum wage. And Sanders has heavily criticized Amazon, helping to induce the company to raise its wages to at least $15 per hour.",
      "date": "August 21",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders signals his administration would pursue 'criminal' charges against oil executives",
      "url": "https://www.foxnews.com/politics/bernie-sanders-criminal-prosecution-oil-executives",
      "subtitle": "Bernie Sanders signals his administration would pursue 'criminal' charges against oil executives",
      "author": "Sam Dorman",
      "content": " Sen. Bernie Sanders, I-Vt., upped the ante in his progressive agenda on Thursday when he signaled support for criminal charges against executives at oil companies. \"Fossil fuel executives should be criminally prosecuted for the destruction they have knowingly caused,\" Sanders tweeted. His comments were the latest in progressive politicians' long line of attacks on big corporations and their role in climate change. It came on the same day that he released a sweeping $16 trillion plan to address climate change. Sanders painted his \"Green New Deal\" as a way to \"end the greed of the fossil fuel industry.\" OCASIO-CORTEZ: 'THERE'S NO DEBATE' THAT FOSSIL FUEL PRODUCTION SHOULD STOP \"We are going to end the greed of the fossil fuel industry and move to 100% renewable energy,\" he tweeted in an attack on natural gas. Sanders' website indicated that he would, as president, direct his Justice Department to pursue criminal charges against companies like Exxon. \"These executives have spent hundreds of millions of dollars protecting their profits at the expense of our future, and they will do whatever it takes to squeeze every last penny out of the Earth,\" his website reads. \"Bernie promises to go further than any other presidential candidate in history to end the fossil fuel industry’s greed, including by making the industry pay for its pollution and prosecuting it for the damage it has caused.\" BERNIE SANDERS: CLIMATE CHANGE POSES A BIGGER THREAT TO AMERICA THAN ISIS The American Petroleum Institute, a trade association for the oil and gas industry, responded to Sanders in a statement to Fox News. \"Pitting important environmental goals against working families who rely on affordable American energy is a false choice,\" the organization said. \"While some may use attacks on natural gas and oil to energize their political base, our industry will remain focused on providing the energy that powers America’s economy and modern lifestyle, while also continuing to lower carbon emissions beyond their current generational low.\" While Sanders' pledge seemed unprecedented, left-wing attacks on big oil are nothing new. Former New York Attorney General Eric Schneiderman led a coalition of more than a dozen states in investigating ExxonMobil over allegations it misled the public about climate change. RICK PERRY: DEMOCRATS 'LIVING IN A FANTASY WORLD' WITH CLIMATE CHANGE RHETORIC That turned into a federal lawsuit, alleging the oil giant defrauded its shareholders with its messaging on climate change. Schneiderman resigned in 2018 amid allegations of physical abuse but legal battles continued to swirl around the company. Sanders' plan, along with other Democratic climate change proposals, would likely inflict a heavy financial toll on companies like Exxon as Democrats embraced timelines that would drastically reduce carbon emissions within just decades of implementation. Congressional Democrats have, for example, proposed a carbon tax as a way to cut carbon emissions by 100 percent by 2050. The bill would purportedly rebate a majority -- 70 percent -- of revenues from the tax to low and middle-income Americans as a monthly dividend while spending the rest on infrastructure, energy innovation, and helping communities transition to a \"cleaner energy economy.\" ICELAND UNVEILS MEMORIAL FOR MELTED GLACIER The right-leaning Competitive Enterprise Institute indicated that businesses would collectively face trillions of dollars in costs as they upgraded commercial and industrial buildings. For example, the study found that the battleground state of Pennsylvania would face over $2 trillion in costs for upgrading residential, commercial and industrial buildings. Florida would encounter a $1.4 trillion price tag and New Hampshire, the first primary state, would face $102.8 billion in retrofitting costs. CLICK HERE TO GET THE FOX NEWS APP Sanders, and others, have claimed their plans would benefit the economy. The Vermont senator predicted his plan would create 20 million jobs and pay for itself over 15 years. \"The cost of inaction is unacceptable,\" Sanders' website claimed. \"Economists estimate that if we do not take action, we will lose $34.5 trillion in economic activity by the end of the century. And the benefits are enormous:  by taking bold and decisive action, we will save $2.9 trillion over 10 years, $21 trillion over 30 years, and $70.4 trillion over 80 years.\"",
      "date": "August 22",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders indicates climate plan will require nationalization of US energy production",
      "url": "https://www.foxnews.com/politics/sanders-climate-plan-federal-takeover-energy",
      "subtitle": "Bernie Sanders indicates climate plan will require nationalization of US energy production",
      "author": "Sam Dorman",
      "content": " The \"Green New Deal\" proposed by Sen. Bernie Sanders, I-Vt., seeks a complete transition to \"energy efficiency\" and \"sustainable energy\" — much of which would be owned and administered by the federal government. During an appearance on MSNBC Thursday night, Sanders told host Chris Hayes that the U.S. needed an \"aggressive\" federal approach to producing electricity and nodded after Hayes claimed he proposed a \"federal takeover of the whole thing.\" Sanders agreed with Hayes' assessment that he wanted to create a \"Tennessee Valley Authority [TVA] extension for the whole country.\" \"You can't nibble around the edges anymore,\" Sanders added. SANDERS RELEASES $16 TRILLION 'GREEN NEW DEAL' PLAN, PROMISES IT WILL 'PAY FOR ITSELF' The TVA is a federally owned corporation that was started in 1933 to provide flood control, electricity generation and a host of other services to the Tennessee Valley. The TVA's service area covers parts of seven southern states: Tennessee, Alabama, Mississippi, Georgia, Kentucky, North Carolina and Virginia. \"Look, the TVA has done a lot of good work ... What we need to do is have an aggressive federal government saying that we are going to produce a massive amount of energy from solar and from wind and from other sustainable energies,\" Sanders said. In his climate plan, Sanders praised the TVA but indicated that it and other federal, administrative bodies didn't cover enough of the United States. \"Currently, four federal Power Marketing Administrations [PMAs] and the Tennessee Valley Authority generate and transmit power to distribution utilities in 33 states,\" the plan read. \"We will create one more PMA to cover the remaining states and territories and expand the existing PMAs to build more than enough wind, solar, energy storage and geothermal power plants.\" DANIEL TURNER: BERNIE SANDERS' GREEN NEW DEAL IS AN IMPOSSIBLE DREAM THAT WOULD BE A NIGHTMARE Sanders' plan would entail the federal government massively regulating the U.S. energy supply, which he said would be \"sustainable\" by 2030 \"at the latest.\" \"The renewable energy generated by the Green New Deal will be publicly owned, managed by the federal Power Marketing Administrations, the Bureau of Reclamation and the Tennessee Valley Authority and sold to distribution utilities with a preference for public power districts, municipally- and cooperatively-owned utilities with democratic, public ownership, and other existing utilities that demonstrate a commitment to the public interest,\" the plan read. When Hayes asked Sanders how he responded to critics who balked at the program's cost, Sanders said the country couldn't \"afford not to afford it\" because the future of the planet was at stake. Sanders has claimed that his $16 trillion plan would \"pay for itself,\" something Heritage Foundation scholar Nick Loris suggested was ridiculous. BERNIE SANDERS SIGNALS HIS ADMINISTRATION WOULD PURSUE 'CRIMINAL' CHARGES AGAINST OIL EXECUTIVES \"Sanders' plan would cause energy prices to skyrocket, bankrupting families and businesses and empowering the federal government to control America’s energy economy,\" he said in a statement provided to Fox News. \"And what would we get for it? A change in the earth's temperature that’s barely measurable. The Green New Deal isn’t a 'climate thing' at all. Turns out it’s a green-glossed Trojan horse designed to increase government control over the economy.\" In addition to taking over the nation's energy supply, Sanders' plan claims to end unemployment by creating 20 million jobs, provide \"massive investments in research and development\" and impose fines and litigation on the fossil fuel industry. The plan predicts that income tax revenues, penalties for fossil fuel companies, a reduced need for safety net spending, \"making the wealthy and large corporations pay their fair share\" and other policy impacts would make the program pay for itself. BERNIE SANDERS: CLIMATE CHANGE POSES A BIGGER THREAT TO AMERICA THAN ISIS \"The cost of inaction is unacceptable,\" the plan read. \"Economists estimate that if we do not take action, we will lose $34.5 trillion in economic activity by the end of the century. And the benefits are enormous:  by taking bold and decisive action, we will save $2.9 trillion over 10 years, $21 trillion over 30 years, and $70.4 trillion over 80 years.\" The American Petroleum Institute, a trade association for the oil and gas industry, responded to Sanders in a statement to Fox News. CLICK HERE TO GET THE FOX NEWS APP \"Pitting important environmental goals against working families who rely on affordable American energy is a false choice,\" the organization said. \"While some may use attacks on natural gas and oil to energize their political base, our industry will remain focused on providing the energy that powers America’s economy and modern lifestyle, while also continuing to lower carbon emissions beyond their current generational low.\"",
      "date": "August 23",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "'Rude and cranky' Bernie Sanders loses San Francisco restaurant owner's vote: report",
      "url": "https://www.foxnews.com/politics/bernie-sanders-rude-cranky-loses-san-francisco-restaurant-owner-vote",
      "subtitle": "'Rude and cranky' Bernie Sanders loses San Francisco restaurant owner's vote: report",
      "author": "Danielle Wallace",
      "content": " The owner of a San Francisco restaurant famous for hosting politicians claimed Sen. Bernie Sanders lost his vote in the 2020 presidential election after the Vermont Democratic candidate was “rude and cranky” to his servers, a report said. John Konstin, who owns the 111-year-old John’s Grill, told Politico many Democrats dined at his bistro while the Democratic National Committee was in town for a three-day event over the weekend.  Sanders arrived for dinner with about 15 members of his campaign team and was not nice to any of the staff and didn’t want to shake hands or have his picture taken, he added. SANDERS SLAMS MCCONNELL'S 'COWARDICE' IN FIERY VISIT TO TOP REPUBLICAN'S HOME STATE OF KENTUCKY “It was all very nice, except for cranky Bernie,” Konstin told Politico. \"I think he was just hungry and didn't want to be a politician. He lost my vote.\" Sanders’ campaign did not respond to a request for comment from Fox News. Lee Housekeeper, the media contact for John's Grill, told SFGATE.com that it’s uncharacteristic for Konstin to speak ill of his restaurant patrons. \"Bernie had to be in a terrible mood,\" Housekeeper said. \"Anyone in the public eye needs to understand when it's time to order room service.\" Konstin told Politico that staff waiting on other Democrats, including one large party with the Secretary of State of California Alex Padilla, Lieutenant Governor of California Eleni Kounalakis, and House Speaker Nancy Pelosi, had a more pleasant experience. He described Pelosi as “pure class.” John's Grill opened its doors in 1908 and was famously featured in Dashiell Hammett's 1930 noir film \"The Maltese Falcon,\" SFGATE.com reported. The restaurant is popular among politicos and has pictures of politicians who’ve visited the establishment hanging on its wooden walls. CLICK HERE TO GET THE FOX NEWS APP Thirteen presidential candidates attended the DNC meeting in San Francisco over the weekend. Sen. Elizabeth Warren, D-Mass., dined out with her staff at San Francisco’s Ayala restaurant in the Union Square Hotel when she visited the city in June, SFGate.com reported. \"She was absolutely wonderful and came into our kitchen,\" Ayala General Manager Alexandra Loulias told the website. \"So complimentary of our staff. She took individual photos with everyone. Just the nicest lady.\"",
      "date": "August 27",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders slams Joe Biden campaign for accepting super PAC donations in effort to 'buy the election'",
      "url": "https://www.foxnews.com/politics/bernie-sanders-joe-biden-super-pac-big-donors-buy-election-2020",
      "subtitle": "Bernie Sanders slams Joe Biden campaign for accepting super PAC donations in effort to 'buy the election'",
      "author": "Danielle Wallace",
      "content": " Sen. Bernie Sanders’ campaign on Thursday accused Joe Biden of selling out to big donors in an effort to “buy the election” following reports that the former vice president and frontrunner for the Democratic Party’s 2020 presidential nomination would form a super PAC to accept unlimited donations from billionaires and corporate elites to cure his current fundraising woes. A spokesperson for Biden’s campaign responded Thursday evening, telling Fox News in a statement that, in the eyes of President Trump, “the general election has already begun,” and Democrats must use any means possible within the parameters of current federal elections laws to win back the presidency — even if that includes taking money from corporations and billionaires alike. TRUMP'S RECORD-BREAKING CASH HAUL REPORTEDLY RATTLING DEMOCRATS \"Joe Biden has spent his campaign promising elite donors that nothing will fundamentally change for them, and he has made clear to fossil fuel and pharmaceutical donors that he will be their ally,” Sanders’ campaign manager, Faiz Shakir, said in a statement. “As a result, he has had trouble generating significant grassroots support from Americans who are getting crushed by those same big donors — and so his supporters are suddenly begging for help from super PACs, even though they are vehicles for the kind of corporate corruption that Democrats should be fighting to stop.”\n\n\n\"Let’s be clear: super PACs exist for one reason and one reason only: to help billionaires and corporations bankroll a presidential campaign with unlimited amounts of money, in exchange for favors,” he continued. “Every Democratic candidate should forcefully reject any help from super PACs -- and they should tell their supporters and surrogates to stop engaging with super PACs that aim to buy elections and undermine our democracy.” Biden, who’s trailing his Democratic rivals in fundraising, said when he first announced his candidacy in April that he would not accept money from super PACs. The former U.S. senator from Delaware declared he was committed to driving perceived \"dark money\" from politics. Before entering the 2020 race, Biden told PBS NewsHour in January 2018 that he was the one who told Sanders not to accept super PAC money, arguing he would lose the trust of the middle class. TRUMP CAMPAIGN RESPONDS TO BIDEN’S ’60 MINUTES’ INTERVIEW, TAKES SWIPE AT HUNTER “My positions are a hell of a lot closer to Elizabeth Warren and Bernie Sanders on some of the economic positions,” Biden told PBS’s Judy Woodruff last year. “I mean, I sat with Bernie. I'm the guy that told him you shouldn't accept any money from a super PAC because people can't possibly trust you.” Within the third quarter, Biden’s campaign raised $15.2 million but was left with just $9 million after expenditures, Reuters reported. Meanwhile, the Trump campaign, which welcomes super PAC contributions, and the Republican Party together raised $125 million in that same time period for the president’s re-election, according to the Republican National Committee. Using these funds, Trump's campaign paid for attack ads targeting Biden amid an ongoing Democratic-led House impeachment inquiry against the president. While Biden’s campaign this week softened its stance on accepting super PAC donations, Sanders boasted his bid for the presidency is 100 percent grassroots funded. Biden’s campaign told Fox News on Thursday that he is still committed to eradicating private donations from federal elections — but until he becomes president, is open to big-donor contributions to defeat Trump. CLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM “As president, Joe Biden will push to remove private money from our federal elections. He will advocate for a constitutional amendment to overturn Citizens United [a 2010 Supreme Cout decision on campaign financing] and end the era of unbridled spending by Super PACs,” Kate Bedingfield, Biden’s deputy campaign manager, told Fox News. “Until we have these badly needed reforms, we will see more than a billion dollars in spending by Trump and his allies to re-elect this corrupt president,” she continued. “And let’s be clear: Donald Trump has decided the general election has already begun. In this time of crisis in our politics, it is not surprising that those who are dedicated to defeating Donald Trump are organizing in every way permitted by current law to bring an end to his disastrous presidency. Nothing changes until we defeat Donald Trump.”",
      "date": "October 25",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders campaign ratifies union contract for workers",
      "url": "https://www.foxnews.com/politics/bernie-sanders-campaign-union",
      "subtitle": "Bernie Sanders campaign ratifies union contract for workers",
      "author": "Ronn Blitzer",
      "content": " The Bernie Sanders campaign has made history by officially ratifying a union contract for its workers, becoming the first presidential campaign to do so. \"We are proud of our workers and proud to uphold Bernie's commitment to collective bargaining rights and a strong labor movement,\" campaign manager Faiz Shakir said in a statement. \"When Bernie Sanders is in the White House, he will make it easier not harder to join a union and we look forward to running a campaign powered by union workers.\" BERNIE SANDERS SUGGESTS DISNEY SHOULD USE 'AVENGERS: ENDGAME' PROFITS TO PAY WORKERS 'MIDDLE CLASS WAGE' The campaign first announced in March that their \"bargaining unit employees\" chose the United Food and Commercial Workers Local 400 as their \"exclusive bargaining representative.\" In a press release, the campaign touted \"unprecedented standards for campaign workers,\" including pay transparency, a defined wage scale, access to mental health care coverage, an anti-discrimination policy that protects immigrant and transgender staff members, and a \"pro-worker grievance and arbitration process.\" WHAT IS 'DEMOCRATIC SOCIALISM'? BERNIE SANDERS' POLITICAL IDEOLOGY EXPLAINED The union announcement came after they announced guidelines aimed at combatting sexual harassment and discrimination, following complaints of inappropriate conduct among staffers on the 2016 campaign.",
      "date": "May 8",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders calls for eliminating all medical debt at South Carolina event",
      "url": "https://www.foxnews.com/politics/sanders-calls-for-eliminating-all-medical-debt-at-south-carolina-town-hall",
      "subtitle": "Bernie Sanders calls for eliminating all medical debt at South Carolina event",
      "author": "Andrew Craft",
      "content": " Democratic presidential candidate Sen. Bernie Sanders, I-Vt., told an audience in South Carolina Friday that he is working on legislation that would \"eliminate medical debt in this country.\" Sanders made the remark during a question-and-answer period following a town hall meeting in Florence on \"Medicare-for-All.\" A female attendee explained to Sanders that she doesn't make enough money to qualify for ObamaCare and has a large amount of medical debt not covered by insurance. When the woman asked Sanders if he had a plan for that, the self-described democratic socialist told her: \"In another piece of legislation that we're offering, we're gonna eliminate medical debt in this country.\" The Sanders campaign confirmed to Fox News that the proposal was new, but details were scant. \"We are introducing legislation that would end all medical debt in this country,\" Sanders told reporters as he departed the town hall. \"The bottom line is it is an insane and cruel system, which says to people that they have to go deeply into debt or go bankrupt because of what? Because they came down with cancer or they came down with heart disease or they came down with Alzheimer’s, or whatever ... \"In the midst of a dysfunctional healthcare system, we have to say to people that you cannot go bankrupt or end up in financial duress,\" Sanders added. \"That is cruel and something we've gotta handle. This is something that we're working on and that we will introduce.\" Sanders has long touted his \"Medicare-for-All\" proposal, which would replace job-based and individual private health insurance with a government-run plan that guarantees coverage for all with no premiums, deductibles and only minimal copays for certain services. Health care has become a key issue in South Carolina, which is among the Republican-led states that turned down Medicaid expansion under the Affordable Care Act. Sanders' legislation does not specify new revenues, instead providing a separate list of \"options\" that include higher taxes on the wealthy, corporations and employers while promising the middle class will be better off. \"You're going to be paying more in taxes,\" Sanders said Friday to a man asking how he'd benefit from Medicare for All if his employer currently pays for most of his premiums. \"But at the end of the day, you're going to be paying less for health care than you are right now. It will be comprehensive.\" CLICK HERE TO GET THE FOX NEWS APP The healthcare industry has become a favorite whipping boy for Sanders, who told his audience Friday: \"Thirty years from now your kids and your grandchildren will be asking you was it really true? That there were people in America who could not go to the doctor when they wanted to? Was it really true that people went bankrupt because they could not pay their healthcare bills? And you will have to tell them, 'Yes, it was.' But together we are going to end that obscenity and we're going to end it in the next few years.\" The new proposal is not the only debt that Sanders has called for canceling. He has repeatedly called for the elimination of $1.6 trillion in student loan debt as well and calling for public college and universities to be tuition-free. According to the RealClearPolitics polling average, Sanders is the second choice among Democrats nationwide, garnering 17.1 percent of the vote. Former Vice President Joe Biden holds a comfortable lead with 28.9 percent support, while Elizabeth Warren is narrowly behind Sanders in third place at 16.5 percent support. The Associated Press contributed to this report.",
      "date": "August 30",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders to 'corporate elite' benefiting from Trump tax breaks: 'Spend that money quick'",
      "url": "https://www.foxnews.com/politics/bernie-sanders-spend-that-money-quick-trump-tax-cuts",
      "subtitle": "Bernie Sanders to 'corporate elite' benefiting from Trump tax breaks: 'Spend that money quick'",
      "author": "Victor Garcia",
      "content": " 2020 presidential candidate Bernie Sanders on Sunday lobbed a warning to the \"corrupt, greedy corporate elite\" who received tax breaks under President Trump, saying they'd better \"spend that money quick\" before he rescinds the legislation. \"The first thing that we are going to tell them is that Trump and his friends may have given them over a trillion dollars in tax breaks, but they had better spend that money quick,\" Sanders said at a town hall in Dover, New Hampshire.  \"Because we are going to... rescind those tax breaks as soon as we get into office.\" The Vermont independent senator has long been a critic of Trump's tax cuts, writing in a March Facebook post that they represented \"a massive giveaway to Wall Street, wealthy Republican campaign contributors, and large, profitable corporations. BERNIE SANDERS FAST FACTS: 5 THINGS TO KNOW ABOUT THE VERMONT SENATOR He also wrote, \"We must repeal the Republican tax breaks for the rich and enact real reform that helps working families struggling to get by in this country.\" This past April, anchor Bret Baier noted that Sanders benefited from Trump's tax bill, while Sanders pointed out that he voted against it during a Fox News town hall. WHAT IS 'DEMOCRATIC SOCIALISM'? BERNIE SANDERS' POLITICAL IDEOLOGY EXPLAINED \"In my view ... wealthy people and large corporations that are making billions in profits should start paying their fair share of taxes,\" the 2020 presidential hopeful told Baier. Fox News' Kelly Phares in Dover, N.H., and Jennifer Earl contributed to this report.",
      "date": "September 1",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders tells black student: Respect cops so 'you don’t get shot in the back of the head'",
      "url": "https://www.foxnews.com/politics/bernie-sanders-says-black-people-should-respect-cops-so-that-you-dont-get-shot-in-the-back-of-the-head",
      "subtitle": "Bernie Sanders tells black student: Respect cops so 'you don’t get shot in the back of the head'",
      "author": "Ronn Blitzer",
      "content": " Sen. Bernie Sanders, I-Vt., suggested at a forum over the weekend that young black Americans stay on their best behavior when dealing with police officers \"so that you don’t get shot in the back of the head.\" Sanders was speaking at the Second Step Presidential Justice Forum at the historically black Benedict College in Columbia, South Carolina, when a student asked him, if he were Sanders’ son, what advice he would give him when it comes to getting pulled over. RASHIDA TLAIB BACKS SANDERS FOR PRESIDENT AT DETROIT RALLY “I would do my best to identify who that police officer is. In a polite way, ask him or her for their name. I would respect what they are doing so that you don’t get shot in the back of the head,” the Democratic presidential candidate said. “But I would also be very mindful of the fact that as a nation we have got to hold police officers accountable for the actions that they commit.” Sanders then summed up by saying that while he would be cautious, people should still do their best to defend their individual rights and keep police officers in line. “So to answer your question, I would be very cautious if you were my son in terms of dealing with that police officer. But I would also defend my rights, and know my rights, and make sure -- if possible -- that police officer’s camera is on or goes on.” Sanders’ answer was very different from the one former Vice President Joe Biden gave when a female student asked a similar question at the same event. CLICK HERE FOR THE FOX NEWS APP “If you were my daughter, you’d be a Caucasian girl and you wouldn’t be pulled over,” Biden said. “But here’s the deal. Here’s the deal, what I tell you is that’s what’s wrong. That is what’s wrong. There is institutional racism that still exists.”",
      "date": "October 28",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders declares abortion is a ‘constitutional right’",
      "url": "https://www.foxnews.com/politics/bernie-sanders-abortion-a-constitutional-right",
      "subtitle": "Bernie Sanders declares abortion is a ‘constitutional right’",
      "author": "Alex Pappas",
      "content": " Democratic presidential candidate Bernie Sanders on Wednesday declared abortion is a “constitutional right,” an apparent response to the virtual abortion ban just approved in Alabama. ALABAMA SENATE PASSES BILL BANNING NEARLY ALL ABORTIONS In a tweet, the Vermont senator flatly stated, “Abortion is a constitutional right.” He did not elaborate. The statement prompted swift rebukes on Twitter. \"When human life begins, human rights begin,\" tweeted March for Life, the anti-abortion group. \"No one has the right to kill an innocent human being, no matter how young or helpless that human being is.\" The U.S. Constitution does not specifically address abortion. But abortion-rights activists argue the 14th Amendment to the Constitution, as cited by the Supreme Court in the 1973 Roe v. Wade decision, includes a \"right to privacy\" that allows women to decide whether to have an abortion. Sanders' comments follow Alabama’s legislature passing a bill that would make performing an abortion a felony at any stage of pregnancy with almost no exceptions. Other Democratic presidential candidates have made similar arguments, as they blast Alabama’s bill. “This is an outrage and it's nothing short of an attack on women's basic human rights and civil rights and it's something that women of America are going to have to fight against with everything they've got,” New York Sen. Kirsten Gillibrand said Wednesday on MSNBC. Former Vice President Joe Biden tweeted, \"Republicans in AL, FL, GA, and OH are ushering in laws that clearly violate Roe v Wade and they should be declared unconstitutional. Roe v Wade is settled law and should not be overturned.\" Campaigning in New Hampshire on Wednesday, California Sen. Kamala Harris said of the Alabama abortion law: “This will not stand.” In Alabama and other conservative states, anti-abortion politicians and activists emboldened by the addition of conservative justices to the U.S. Supreme Court hope to ignite legal fights and eventually overturn the landmark Roe v. Wade decision, putting an end to the right to abortion. Fox News’ Paul Steinhauser, Ben Florance and The Associated Press contributed to this report.",
      "date": "May 15",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Ilhan Omar, at Bernie Sanders rally, calls for 'mass movement of the working class' amid 'Lock him up' chants",
      "url": "https://www.foxnews.com/politics/ilhan-omar-bernie-sanders-minnesota-minneapolis",
      "subtitle": "Ilhan Omar, at Bernie Sanders rally, calls for 'mass movement of the working class' amid 'Lock him up' chants",
      "author": "Gregg Re",
      "content": " Amid repeated chants of \"Lock him up!\" and \"Green New Deal,\" Rep. Ilhan Omar, D-Minn., issued a full-throated endorsement of Bernie Sanders at a spirited rally in Minneapolis' Williams Arena on Sunday night, saying a \"mass movement of the working class\" is needed to take down President Trump and end \"Western imperialism,\" as she put it. \"I am excited for President Bernie Sanders!\" Omar thundered at the conclusion of her remarks, as rock music blared throughout the University of Minnesota venue. At no point did either Omar or Sanders attempt to stop attendees from shouting \"Lock him up\" whenever Trump was invoked. Last year, CNBC's John Harwood had predicted that \"any serious Democratic candidate will make a point of shutting down\" such chants directed at the president. Omar's endorsement was a break from the rest of the state’s delegation of Democrats, which endorsed Sen. Amy Klobuchar's more moderate campaign. It also constituted a youthful shot in the arm for Sanders' left-wing presidential bid, which has remained competitive with Joe Biden and Elizabeth Warren's campaigns. WHY DID OMAR VOTE 'PRESENT' ON RESOLUTION RECOGNIZING ARMENIAN GENOCIDE? \"Here in Minnesota, we don't just welcome refugees -- we sent them to Congress,\" Omar said to applause. \"Right now, achieving that universal dream feels more out of reach than it ever has in my lifetime.\" Then, pointedly refusing to mention President Trump's name, Omar continued: \"The current occupant of the White House likes to talk about making America great. But, every action, and virtually every word out of his mouth, is an attack on the very values and ideals that make this country a beacon of hope for me and the people around the world.\" Later on, still without mentioning the president's name, Omar incorrectly claimed that Trump called neo-Nazis \"very fine people\" -- a suggestion that White House officials repeatedly stressed was taken out of context. And, in a nod to the \"send her back\" chant that erupted at a Trump rally earlier this year, Omar remarked, \"None of us are going back. We're here to stay.\" Even as she accused Trump of \"coddling\" white supremacy, Omar insisted that Sanders' proposals -- such as free college and government-sponsored health care for everyone, including illegal immigrants -- were not \"radical.\" \"These are values that have been enshrined in the Universal Declaration of Human Rights for decades,\" Omar claimed, referring to the United Nations document. \"But, here is the cold truth: We can't achieve any of these goals if we don't build a movement that is representative of all of our aspirations, all of our pain, and all of our shared trauma.\" Omar also appeared to defend her decision to vote \"present\" on a congressional resolution recognizing the Armenian genocide, saying it was an effort to combat using genocides selectively as a \"political\" football. And Omar, who has been criticized by members of her own party for her past anti-Semitic statements, emphasized Sanders' Jewish faith in announcing her support. \"I am proud to stand with the son of a Jewish refugee who survived genocide,\" Omar said, referring to Sanders. \"The acknowledgment of pain and suffering is personal for both of us. The fight for human rights is undeniable. And when we recognize injustices of the past and present, whether it is genocide against Jewish people, Armenians or Rwandans or Bosnians or Native Americans or more.\" Sanders has been endorsed by other members of the so-called progressive \"squad\" of Democrats, including New York Rep. Alexandria Ocasio-Cortez and Michigan Rep. Rashida Tlaib. (The only member of the \"squad\" not to endorse Sanders is Massachusetts Rep. Ayanna Pressley.) Days before the endorsements were announced, the longtime Vermont senator suffered a heart attack on Oct. 1, prompting fears that his health issues could derail his presidential ambitions. Sanders was introduced at the arena by a spirited University of Minnesota college student who complained that fellow students \"are being put\" into debt. The student acknowledged that he personally was not in much debt, but very much felt the pain of those who were. Taking the microphone, Sanders praised Omar as an \"extraordinary woman who 30 years ago was in a refugee camp in Kenya.\" \"Thank you, Ilhan Omar,\" Sanders said, his voice cracking. Then, he unloaded a series of superlatives, punctuated by audible boos. \"It gives me no pleasure to tell all of you what you already know: that today, tragically, we have a president of the United States who is a pathological liar -- who is running the most corrupt administration in history, who has obstructed justice, who has used his office for personal gain, who has threatened to withhold national security funds from an ally in order to improve his political chances.\" Before calling Trump a racist, sexist, bigoted homophobe, Sanders remarked, \"This is a president who deserves to be impeached, and will be impeached.\" As the crowd erupted in a \"Lock him up\" chant -- in a reference to the \"Lock her up\" chants at Trump rallies, typically directed at Hillary Clinton -- Sanders stood by the microphone and didn't try to interrupt. But, minutes later, Sanders appeared to call for an end to divisiveness while reading from his prepared remarks. \"We are going to do exactly the opposite of what Trump is doing,\" he said. \"He is trying to divide us up. We are going to bring our people together... around an agenda that works for all of us, not just the one percent.\" CLICK HERE TO GET THE FOX NEWS APP \"People say that Ilhan and I make an odd political couple. But in fact, there is really nothing odd about it at all,\" Sanders continued. \"Ilhan and I share a common link as the descendants of families who fled violence and poverty, and who came to this country as immigrants. But that is not just my story, or Ilhan's story -- that is the story of America.\" He also said he and Omar both were working to eliminate \"all student debt in America,\" and make all public colleges \"tuition-free.\" Fox News' Andrew Craft contributed to this report.",
      "date": "November 3",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders targets Biden over top-dollar fundraisers",
      "url": "https://www.foxnews.com/politics/sanders-repeatedly-targets-biden-for-top-dollar-fundraisers",
      "subtitle": "Bernie Sanders targets Biden over top-dollar fundraisers",
      "author": "Paul Steinhauser",
      "content": " Two days after Sen. Bernie Sanders said he wouldn’t “disparage” his rivals for the 2020 Democratic presidential nomination, the independent senator from Vermont seemed to rib the front-runner right now in the race, former Vice President Joe Biden, over high-dollar fundraisers. In a fundraising email to supporters on Wednesday, Sanders spotlighted his campaign trip this week to Nevada, the first western state to voter in the primary and caucus calendar. BERNIE SANDERS MAKES BEHIND CLOSED DOORS PITCH TO TOP DEMOCRATS IN MUST WIN PRIMARY STATE “But I am not going to Nevada to attend a fundraiser hosted by a corporate CEO on the Las Vegas strip — I am going to Nevada to attend a rally with supporters and a town hall on immigration,” the populist senator emphasized. While not mentioning Biden by name, it was clear Sanders was referring to the former vice president, who campaigned in Nevada three weeks ago. On that trip, Biden held a fundraiser at the Las Vegas Strip that was hosted by MGM Resorts CEO Jim Murren, a Republican. The CEO and other top executives of  William Hill, the world’s biggest bookmaker, also co-hosted the fundraiser. It was the second time in less than a week that the independent sentaor from Vermont and his campaign targeted Biden for his numerous top-dollar fundraising events from coast to coast. BIDEN'S CAMPAIGN PACE CALLED INTO QUESTION In a fundraising email on Friday to supporters titled “We risk falling behind,” Sanders campaign manager wrote that Biden’s “raising huge sums of money at large fundraising events all across the country. And these are not grassroots fundraising events.” Faiz Shakir added that “these are high-dollar functions hosted and attended by corporate lobbyists, health care executives, a Republican casino-CEO, and a union-busting lawyer among others.” Sanders' Wednesday fundraising email came two days after the senator, at a campaign event in the first-in-the-nation presidential primary state of New Hampshire, said he knew most of his nearly two-dozen rivals for the Democratic nomination and stressed that “they are good people and you’re not going to get me to disparage them.” In the month since he launched his third bid for the White House, the former vice president appears to have become Sanders’ favorite foil on the campaign trail. Besides fundraising, the senator has also criticized Biden for his past support of free trade deals, for his 2002 vote in support of the Iraq War, and for taking a “middle ground” approach to combating climate change. Biden, the clear front-runner in the polls right now, has defended his record from attacks but has not directly fired back against Sanders or any of his other critics in the 2020 field. Biden’s been raising big bucks through small-dollar online donations – his campaign last week touted their online contributions and said those kinds of contributions made up the lion’s share of the whopping $6.3 million it raised in the 24 hours after the former vice president announced his candidacy last month. But Biden's also been holding some high-profile, high-end fundraisers. On his first night as a White House contender, he raised $700,000 at the Philadelphia home of a Comcast executive. He also hauled in big bucks at a Hollywood finance event earlier this month and at two Florida fundraisers last week. Wednesday night, during a campaign swing in Texas, Biden will headline a Dallas fundraiser hosted by some of the Lone Star state’s most prominent trial lawyers and political donors. The former vice president’s expected to hold two major fundraisers in Boston on June 5, and two more in New York City on June 17, sources close to Biden’s inner circle told Fox News. Fundraising was far from then-Sen. Biden’s wheelhouse in his unsuccessful White House runs in the 1988 and 2008 presidential cycles. But so far, the third time appears to be the charm, as Biden’s raking in big bucks both at traditional fundraisers with deep-pocketed donors -- which he's opened up to media coverage in a move for transparency -- as well as through online contribution The former vice president’s far from the only Democratic presidential candidate courting top donors. Sens. Cory Booker of New Jersey, Kirsten Gillibrand of New York, Kamala Harris of California and Amy Klobuchar of Minnesota are also holding behind closed doors finance events. And South Bend, Indiana Mayor Pete Buttigieg, a one-time long-shot who’s surged in recent months, is also competing for big money. Biden’s campaign has repeatedly pointed out they’re not accepting contributions from corporate political action committees or federally registered lobbyists. The courting of wealthy donors used to be commonplace, but this time around, Sanders and Sen. Elizabeth Warren of Massachusetts – another top progressive contender - have criticized Biden and said no to those types of donations. But Sanders reportedly has decided to now hold in-person fundraising events and has hired an official to oversee such finance events.",
      "date": "May 29",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders releases plan to eliminate $81B in past-due medical debt",
      "url": "https://www.foxnews.com/politics/bernie-sanders-plan-eliminate-medical-debt",
      "subtitle": "Bernie Sanders releases plan to eliminate $81B in past-due medical debt",
      "author": "Morgan Phillips",
      "content": " Democratic presidential candidate Bernie Sanders released a plan Saturday to eliminate $81 billion in past-due medical debt, going a step beyond his primary rivals who have called for a government-run health insurance program. “In America today, it is unacceptable that one out of every six Americans have past-due medical bills on their credit report, totaling $81 billion,” Sen. Sanders, I-Vt., said in a statement, adding: \"It is immoral and unconscionable that families across the country are being evicted, having their heat disconnected, or having their already-inadequate wages garnished because of crippling medical debt while the health care industry made more than $100 billion in profits last year.\" SUPREME COURT COULD HEAR GROUNDBREAKING CASE THAT CHALLENGES UN IMMUNITY Under his plan, Sanders said, the federal government would step in for the individual to negotiate and pay off past-due medical bills in collections reported to credit agencies. Sanders also vowed to create a public credit registry to replace the three for-profit credit reporting agencies in order to, as he put it: “remove the profit motive from assessing the creditworthiness of American consumers.” He said the registry would use \"public, transparent algorithm to determine creditworthiness that eliminates racial biases in credit scores.\" The self-described democratic socialist added that he would exclude medical debt from credit reports and end credit checking for rental housing, employment, insurance and other non-lending practices. BIDEN GOES ON THE ATTACK OVER UKRAINE CONTROVERSY, PLEDGES TO BEAT TRUMP 'LIKE A DRUM' Sanders made no mention in the proposal of how he planned to cover the $81 billion cost. According to Reuters, the Sanders campaign has said they would pay for the debt elimination proposal through a tax on corporations based on their pay for chief executives. The details of that proposal have not been released. During an interview with Fox News Sept. 3, Sanders acknowledged that $81 billion is \"a lot of money,\" but he added, \"Compared to what? Compared to the $1.5 trillion that Trump gave in tax breaks to the one percent and large corporations. Compared to the billions of dollars that we spent bailing out the crooks on Wall Street 11 years ago. It is a lot of money but I think it’s the right thing to do.” Sanders was one of the earliest supporters of “Medicare-for-All,” which would replace job-based and individual health insurance with a government-run plan. Other top Democratic rivals have expressed interest in a toned-down version of Medicare-for-All. Sen. Elizabeth Warren, D-Mass. has endorsed Sanders' plan but said there may be different ways to achieve coverage for all. Former Vice President Joe Biden has called to extend the Affordable Care Act by adding a public option. Sanders has also released a plan to eliminate $1.6 trillion in student loan debt while also making public college tuition-free. CLICK HERE TO GET THE FOX NEWS APP As for where he draws the line in wiping out debt, Sanders in his Sept. 3 interview said \"there's a difference\" between wiping out medical debt and credit card debt. \"I don't believe we wipe out credit card debt. You want something, you pay for it.,\" he said. \"If you want to go out and buy a fancy house, you want to go out and buy a yacht, and you go in debt, hey that’s your decision…But I do believe we have to make a distinction. Getting cancer is not your decision. And I think we have a moral obligation to do everything we can to cancel that debt.”",
      "date": "September 21",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders falls behind Elizabeth Warren in new poll",
      "url": "https://www.foxnews.com/politics/poll-shows-warren-pulling-ahead-of-sanders-among-likely-caucus-goers-in-nevada",
      "subtitle": "Bernie Sanders falls behind Elizabeth Warren in new poll",
      "author": "Sam Dorman",
      "content": " A new poll has some bad news for Bernie Sanders. Sen. Sanders, I-Vt., has slipped from second place to third in a new poll, with Sen. Elizabeth Warren, D-Mass., taking his spot among likely caucus-goers in Nevada. The poll, conducted by Monmouth University, showed Warren leading Sanders with 19 percent support compared to his 13 percent. Former Vice President Joe Biden continued dominating the field, however, with 36 percent in Nevada, an early indicator of Democratic success during the primaries. The survey was the first Nevada poll released this cycle that meets the Democratic National Committee’s criteria for qualifying for the debates. SANDERS EMBRACES DEMOCRATIC SOCIALISM, CALLS FOR NEW DEAL REVIVAL IN CAMPAIGN ADDRESS Previous polling has shown Warren trailing Sanders as both push a more progressive message against the frontrunner and perceived moderate Biden. While Biden led the field among \"moderate or conservative\" voters, \"very liberal\" voters, who made up about a quarter of likely caucus-goers, supported Warren and Sanders with 27 and 26 percent respectively. According to polling, likely caucus-goers rated health care (41 percent) as their most important issue when thinking about a candidate. Environmental concerns (17 percent) and immigration (19 percent) as the top issues voters identified. Only 14 percent, however, said \"beating\" President Trump was their top priority. Trump has become such a negative symbol among Democrats that many have cautioned against choosing a candidate based on other criteria. DEMOCRATIC PRESIDENTIAL CANDIDATES PUSH FOR BREAKUP OF BIG TECH Others, like Jacobin Magazine editor Bhaskar Sunkara, urged Democrats to push Biden to the left and force the party to endorse more progressive proposals. Among those proposals was \"Medicare for all\" which both Sanders and Warren have proposed as an alternative to the Affordable Care Act passed when Biden was Vice President. CLICK HERE TO GET THE FOX NEWS APP Monmouth's poll was another piece of good news for the two progressives who, according to a poll released on Tuesday, beat Trump in 2020 matchups.",
      "date": "June 12",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders has stents ‘successfully inserted’ after doctors find blockage in artery, campaign says",
      "url": "https://www.foxnews.com/politics/sen-bernie-sanders-has-stents-successfully-inserted-after-doctors-find-blockage-in-artery-campaign-says",
      "subtitle": "Bernie Sanders has stents ‘successfully inserted’ after doctors find blockage in artery, campaign says",
      "author": "Andrew O'Reilly",
      "content": " Democratic presidential primary contender Bernie Sanders is off the campaign trail for a few days after he had an emergency procedure Tuesday to repair a blocked artery, his campaign announced. The campaign said Wednesday that doctors have \"successfully inserted\" two stents, and the candidate is now \"conversing and in good spirits,\" but will be taking a few days to rest. WARREN EDGES BIDEN, SANDERS SLIPS, IN NEW NH PRIMARY POLL \"We are canceling his events and appearances until further notice, and we will continue to provide appropriate updates,\" Sanders' campaign said in a statement. Sanders himself took to Twitter in the afternoon to reassure his followers that he was on the mend and to do some campaigning for his push for universal healthcare. \"Thanks for all the well wishes,\" Sanders tweeted. \"I'm feeling good. I'm fortunate to have good health care and great doctors and nurses helping me to recover.\" He added: \"None of us know when a medical emergency might affect us. And no one should fear going bankrupt if it occurs. Medicare for All!\" The Vermont senator began to experience some chest discomfort during an event on Tuesday evening in Nevada and was taken to the hospital for a medical evaluation and treatment, where it was discovered that he had a blocked artery. The Sanders campaign also confirmed to Fox News that they’re postponing a $1.3 million TV ad buy in Iowa that was supposed to hit airwaves in the first caucus state starting on Thursday. The campaign announced the ad just one day ago. But a senior campaign official told Fox News that overall, “campaign operations are continuing as usual” while the senator is sidelined. The 78-year-old Sanders, the Democratic field's oldest candidate, sometimes jokingly refers to his age at town halls and other events, especially when interacting with younger participants. Sanders is one of the leaders in a crowded field vying to be the party's 2020 presidential nominee and take on President Trump in the general election. CLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM His campaign manager, Faiz Shakir, was on a telephone call with supporters Tuesday night but didn’t mention any health concerns about the candidate. Shakir said the “state of the campaign is strong” and he played up Sanders’ strong fundraising total for the third quarter. Sanders recently canceled some appearances in South Carolina because he lost his voice. The campaign said at the time he felt fine. Fox News' Paul Steinhauser and Kelly Phares and The Associated Press contributed to this report.",
      "date": "October 2",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders released from hospital, doctors say he suffered heart attack",
      "url": "https://www.foxnews.com/politics/bernie-sanders-released-from-hospital-doctors-say-he-suffered-heart-attack",
      "subtitle": "Bernie Sanders released from hospital, doctors say he suffered heart attack",
      "author": "Alex Pappas",
      "content": " Democratic presidential candidate Bernie Sanders was discharged from a Nevada hospital on Friday, as his doctors acknowledged for the first time that the 78-year-old had suffered a heart attack earlier in the week. The Sanders campaign released statements from his treating physicians acknowledging Sanders was diagnosed with a myocardial infarction – commonly known as a heart attack. “After presenting to an outside facility with chest pain, Sen. Sanders was diagnosed with a myocardial infarction,” the doctors, Arturo Marchand Jr. and Arjun Gururaj, said. “He was immediately transferred to Desert Springs Hospital Medical Center.” Sanders' campaign announced Wednesday that the senator from Vermont was recovering after an emergency procedure Tuesday to repair a blocked artery and that campaign events were being canceled. On Friday, Sanders said he feels \"great.\" “I want to thank the doctors, nurses, and staff at the Desert Springs Hospital Medical Center for the excellent care that they provided,” Sanders said in a statement released by his campaign. “After two and a half days in the hospital, I feel great, and after taking a short time off, I look forward to getting back to work.” SANDERS WILL ATTEND NEXT DEBATE DESPITE PAUSE AFTER HEART PROCEDURE, CAMPAIGN SAYS Soon after, he posted a video on Twitter showing him standing at a Las Vegas park with his wife Jane \"I just got out of the hospital a few hours ago and I'm feeling so much better,\" Sanders said. \"See you soon on the campaign trail.\" Sanders and his wife both thanked people for their warm wishes. The candidate was expected to return to Vermont. The candidate's doctors said Sanders is making “progress.” “The senator was stable upon arrival and taken immediately to the cardiac catheterization laboratory, at which time two stents were placed in a blocked coronary artery in a timely fashion. All other arteries were normal,” they said. The doctors added: “His hospital course was uneventful with good expected progress. He was discharged with instructions to follow up with his personal physician.” Sanders himself posted a message on Twitter Wednesday afternoon to reassure his followers that he was on the mend and to do some campaigning for his push for universal healthcare dubbed \"Medicare-for-all.\" CLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM \"Thanks for all the well wishes,\" Sanders tweeted. \"I'm feeling good. I'm fortunate to have good health care and great doctors and nurses helping me to recover.\" He added: \"None of us know when a medical emergency might affect us. And no one should fear going bankrupt if it occurs. Medicare for All!\" Fox News’ Andrew O’Reilly and The Associated Press contributed to this report.",
      "date": "October 4",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Chris Stirewalt: Bernie Sanders, Elizabeth Warren 'in a lunatic derby'",
      "url": "https://www.foxnews.com/politics/bernie-sanders-elizabeth-warren-free-college",
      "subtitle": "Chris Stirewalt: Bernie Sanders, Elizabeth Warren 'in a lunatic derby'",
      "author": "Charles Creitz",
      "content": " Democratic presidential contenders Sens. Bernie Sanders, I-Vt., and Elizabeth Warren, D-Mass., are trying to outdo each other with their campaign promises, according to Chris Stirewalt. Sanders and Warren are both staking their claim in the progressive wing of the 2020 primary field, and beginning to cause concern among party brass, Stirewalt said Monday on \"The Daily Briefing.\" \"By the time Bernie Sanders and Elizabeth Warren are done, they will be promising each and every American a new Buick LaCrosse in their parking lot,\" the Fox News politics editor claimed. \"They are in this lunatic derby. This is why Democratic leaders are rightly afraid of what's going on. Because, if Sanders - who is now promising to forgive the student loans of everybody, basically, 'throw in another trillion dollars,' - if either Sanders or Warren get the nomination, there is a reality that Democrats won't just miss out on taking the White House back, but they could get cleaned out in the Senate.\" HOME DEPOT CO-FOUNDER: BERNIE SANDERS IS THE 'ENEMY OF EVERY ENTREPRENEUR' Stirewalt claimed there is a danger the two candidates' platforms could cause Democrats to also lose control of the House. \"This stuff is way outside the mainstream,\" he claimed. \"That's what Democrats are afraid of.\" During a speech Saturday at Clinton College in Rock Hill, S.C., Sanders claimed graduates are put in an \"absurd position of having to pay that debt off for decades.\" CLICK TO GET THE FOX NEWS APP \"Some of those people, they can't afford to get married,\" he said, in a clip played by host Dana Perino. \"They can afford to have kids. They can't afford to buy their own home. Well, we are going to change that.\"",
      "date": "June 24",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders says he misspoke when he said campaign would slow its pace",
      "url": "https://www.foxnews.com/politics/bernie-sanders-says-he-misspoke-when-he-said-campaign-would-slow-its-pace",
      "subtitle": "Bernie Sanders says he misspoke when he said campaign would slow its pace",
      "author": "Vandana Rambaran",
      "content": " Sen. Bernie Sanders, I-Vt., backpedaled Wednesday on statements he made a day earlier about the pace of his presidential bid following his heart attack last week, telling NBC News that he was ready to \"get back into the groove of a very rigorous campaign.\" In Sanders' first sit-down interview since he had two stents inserted into his chest to clear a blocked artery, Sanders said he's feeling \"a hell of a lot better than I did a week ago.\" \"I have no pain, I'm out walking now, getting back to work, feel good,\" he told NBC's Harry Smith in a clip from the interview, which is scheduled to air Wednesday night. BERNIE SANDERS SAYS HE WAS 'MORE FATIGUED' IN MONTHS LEADING UP TO HEART ATTACK BUT IGNORED SYMPTOMS Sanders was at a campaign rally in Nevada last Tuesday when he began complaining of chest pains. \"Somebody said, do you want to do selfies and I said, 'My God, do I not want to do selfies. Let me get the hell out of here,'\" he recalled. The discomfort prompted Sanders to visit an urgent care facility. \"They did a few tests and the doctor there said, she said, 'You're having a heart event,' and it just struck me. I could not believe it,\" Sanders said. After Sanders was released from a Nevada hospital on Friday, the campaign disclosed that the 78-year-old had suffered a heart attack. However, Sanders pushed back on claims that his campaign tried to hide or conceal his health ailments from voters. \"No I don't accept that,\" Sanders said. \"That's nonsense and I think that sometimes, you know, I don't know what people think campaigns are. We're dealing with all kinds of doctors and we wanted to have a sense of what the hell was going on really. So the first thing that we're trying to do is understand what's going on and not run to The New York Times and not have to report every 15 minutes. This is not a baseball game. So I think we acted absolutely appropriately.\" \"No apologies,\" he added. Sanders told reporters Tuesday outside his home in Burlington, Vt., that he \"certainly intends to be actively campaigning\" but will \"change the nature\" and frequency of rallies and events to \"make sure I have the strength to do what I have to do.\" CLICK HERE FOR THE FOX NEWS APP “We were doing, you know, in some cases five or six meetings a day, three or four rallies and town meetings and meeting with groups of people,” Sanders said about his campaign prior to his heart attack. “I don’t think I’m going to do that.” Sanders said he \"misspoke\" when he suggested he would slow his pace on the campaign trail, but his wife, Jane O'Meara Sanders, said Wednesday that her husband has postponed all campaign events until next Tuesday when he will head to Ohio for the fourth Democratic debate.",
      "date": "October 9",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders' daughter-in-law dies from cancer shortly after being diagnosed",
      "url": "https://www.foxnews.com/politics/bernie-sanders-daughter-in-law-raine-riggs-dead-cancer",
      "subtitle": "Bernie Sanders' daughter-in-law dies from cancer shortly after being diagnosed",
      "author": "Nick Givas",
      "content": " Tragedy struck 2020 presidential candidate Sen. Bernie Sanders, I-Vt., as his daughter-in-law, Rainè Riggs, died of cancer shortly after she was diagnosed. The shocking news came as Sanders was recovering from a heart attack he suffered last week, which forced him to temporarily suspend campaign events while he recuperated. The 46-year-old Riggs reportedly died Saturday, two days after her diagnosis and the day Sanders returned to Vermont following his release from the hospital. She was suffering from neuroendocrine cancer, which causes rare tumors to sprout up on various parts of the body. BERNIE SANDERS RELEASED FROM HOSPITAL, DOCTORS SAY HE SUFFERED HEART ATTACK Riggs’ obituary says she worked as a neuropsychologist and frequently volunteered with pediatric hospice. She was married to Bernie's son Levi Sanders and met him while they both worked at a food shelter in Vermont. They had three children. The obituary also states Riggs worked as the director of behavioral medicine at Dartmouth Medical School and was the owner of Riggs Geriatric Psychology. Sanders received an outpouring of support on Twitter from media figures and his fellow political colleagues, including Sen. Marco Rubio, R-Fla., fellow 2020 presidential candidate Andrew Yang, and Meghan McCain. CLICK HERE TO GET THE FOX NEWS APP Earlier, Sanders said he is recovering well from his heart surgery and plans to continue on with his campaign for the White House. \"I have no pain, I'm out walking now, getting back to work, feel good,\" he told NBC's Harry Smith during an interview that aired Wednesday.",
      "date": "October 10",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders unfazed by ringing phone interrupting Skype call at union candidate forum",
      "url": "https://www.foxnews.com/politics/bernie-sanders-phone-call-union-fourm",
      "subtitle": "Bernie Sanders unfazed by ringing phone interrupting Skype call at union candidate forum",
      "author": "David Aaro",
      "content": " Senator Bernie Sanders showed an unwavering level of focus in the face of bothersome technology during a conference call with the United Food and Commercial Workers (UFCW) International Union presidential candidate forum on Sunday. In a funny series of events, the presidential candidate was interrupted not once, but twice by his home phone, which played the familiar caller ID \"call coming from\" voice before a woman appeared to answer the phone during a roughly 20-minute interview with the UFCW. As if that wasn't enough, towards the end of his forum - as he discussed needing bold solutions to our nation's problems - a loud ding could be heard coming from his home, indicating a text message being sent to a phone nearby. SANDERS ADDRESSES HEALTH AFTER RECENT HEART ATTACK, SAYS 'I'M GETTING STRONGER EVERY DAY' Again, somehow he didn't seem to notice and appeared to brush it off like his most recent heart surgery. Sanders, who was hospitalized on Oct. 2 for a blocked artery, seemed to be in good spirits, delivering his points at the candidate forum. On Oct. 2, he wrote on Twitter he was feeling good and thanked those around him for the \"well wishes.\" BERNIE SANDERS' DAUGHTER-IN-LAW DIES FROM CANCER SHORTLY AFTER BEING DIAGNOSED \"I'm feeling good. I'm fortunate to have good health care and great doctors and nurses helping me to recover,\" he wrote at the time. \"None of us know when a medical emergency might affect us. And no one should fear going bankrupt if it occurs.\" During the forum, the Vermont senator talked about some of his presidential proposals including his feelings on a 32-hour workweek, pension promises, wage theft, wealth equality, and automation. He relayed a need to be an \"organizer in chief\" by taking on greed and corruption within this country and didn't hold back words when addressing his feelings towards Donald Trump. CLICK FOR THE ALL-NEW FOXBUSINESS.COM \"Here is the story. We live in an unprecedented moment in American history and by that I mean only that we have the most dangerous president in the history of this country somebody who is a pathological liar a racist a sexist, a homophone xenophobe and a religious bigot.....We have a corrupt political system in which billionaires are able to spend hundreds of millions of dollars to buy elections undermining the whole thrust of what American democracy is supposed to be about,\" Sanders said.",
      "date": "October 13",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Michael Moore joining AOC at Bernie Sanders rally in NYC to announce endorsement",
      "url": "https://www.foxnews.com/politics/director-michael-moore-joining-aoc-at-bernie-sanders-rally-to-announce-endorsement",
      "subtitle": "Michael Moore joining AOC at Bernie Sanders rally in NYC to announce endorsement",
      "author": "Brie Stimson",
      "content": " Liberal filmmaker Michael Moore announced Friday that he will be joining Rep. Alexandria Ocasio-Cortez, D-N.Y., at a rally in New York City on Saturday for 2020 Democratic presidential candidate Sen. Bernie Sanders. “I am joining Alexandria Ocasio-Cortez tomorrow to officially & publicly endorse a true hero of the people, Senator Bernie Sanders, as our next President of the United States!” Moore posted on Twitter on Friday afternoon. “I will speak tomorrow for him at his “Bernie Is Back!” rally at 1pm in Queensbridge Park in NYC. Join us!” Ocasio-Cortez is also expected to formally endorse Sanders for president at the event. Her ally in Congress, Rep. Ilhan Omar, D-Minn., endorsed Sanders earlier this week. MICHAEL MOORE MOCKS ELIZABETH WARREN'S 'ACCOUNTABLE CAPITALISM' PLAN, SAYS 'THERE IS NO SUCH THING' Sanders’ “Bernie is Back” rally in Queensbridge Park, across the East River from Manhattan, will be the senator's first campaign rally since he was sidelined after undergoing a medical procedure following a heart attack Oct. 4. Moore also endorsed Sanders for president in 2016, saying at the time that he first backed Sanders when he was running for Congress in 1990. “I’ve been a supporter of his ever since, and he’s never given me reason to not continue that support,” Moore wrote at the time. Sanders addressed his recent health problems during Tuesday night’s debate in Ohio. “I’m healthy. I’m feeling great,\" he told the audience. \"We are going to be mounting a vigorous campaign all over this country. That is how I think I can reassure the American people.” CLICK HERE TO GET THE FOX NEWS APP The rally will be held near the country’s largest public housing development and a power plant, the Huffington Post reported, and Sanders plans to speak about affordable housing and Ocasio-Cortez's Green New Deal. The rally is meant as a reset after his heart attack and his lagging poll numbers behind surging progressive Sen. Elizabeth Warren, D-Mass.",
      "date": "October 19",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders hits Pete Buttigieg for suggesting Supreme Court noms should be like Justice Kennedy",
      "url": "https://www.foxnews.com/politics/bernie-sanders-pete-buttigieg-justice-kennedy-scotus",
      "subtitle": "Bernie Sanders hits Pete Buttigieg for suggesting Supreme Court noms should be like Justice Kennedy",
      "author": "Joseph A. Wulfsohn",
      "content": " Sen. Bernie Sanders, I-Vt., took a shot at South Bend, Ind., Mayor Pete Buttigieg for suggesting that he would nominate independent-minded judges like former Justice Anthony Kennedy to the Supreme Court. Buttigieg has been outspoken about his stance on expanding the Supreme Court in hopes of making it less partisan, but in an interview with Cosmopolitan, he shed some light as to the type of nominee he'd appoint as president. \"My appointments will definitely be people who share my values. But when I’m talking about the structure of the Supreme Court, I’m talking about something deeper,\" Buttigieg said. \"I’m talking about depoliticizing the Supreme Court Because right now, every time there’s a vacancy, there’s this apocalyptic ideological battle and it hurts the court and it hurts the country.\" Buttigieg went on to explain that he wanted justices \"who think for themselves\" and cited Kennedy and former Justice David Souter as examples. \"So I've floated several ideas and deliberately kept some level of open-mindedness about which ones are going to work best. One of them would be to have 15 members, but 5 of them can only be seated if the other 10 unanimously agree,\" Buttigieg continued. \"The idea here is you get more justices who think for themselves. Justices like Justice Kennedy or Justice Souter, and there are many legal scholars who think this could be done without a constitutional amendment under current law.\" The South Bend mayor faced backlash from the progressive left on social media with critics pointing to Kennedy's record on the Supreme Court -- including his votes with the majority on the landmark 2010 Citizens United campaign-finance case and in the ruling upholding the White House's travel restrictions affecting multiple Muslim-majority countries last year. Sanders, the first 2020 candidate to weigh in on Buttigieg's remarks, was a bit more subtle with his criticism. CLICK HERE FOR THE FOX NEWS APP \"Interesting, I’d like more justices like Ruth Bader Ginsburg and Sonia Sotomayor,\" Sanders tweeted. The Buttigieg campaign slammed the tweet that went viral, insisting it \"ignores\" how the candidate expressed in that same interview that he wants a nominee that shares his values. \"To be clear: Pete has consistently said he would appoint Justices to the Supreme Court who share his progressive values. Kennedy was not such a Justice,\" Buttigieg campaign rapid response communications director Sean Savett tweeted.",
      "date": "October 24",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders’ campaign workers complaining, fleeing over ‘poverty wages’: report",
      "url": "https://www.foxnews.com/politics/bernie-sanders-campaign-workers-complaining-fleeing-over-poverty-wages-report",
      "subtitle": "Bernie Sanders’ campaign workers complaining, fleeing over ‘poverty wages’: report",
      "author": "Dom Calicchio",
      "content": " Presidential candidate Sen. Bernie Sanders has pledged to American workers that he would institute a $15-per-hour minimum wage if he wins the White House in 2020. But unionized workers on Sanders’ own campaign say they wish he would start now -- by paying a higher wage to them. According to a report, members of Sanders’ staff have been using the senator's own campaign rhetoric against him as they try to wrestle more pay from the self-described democratic socialist. BERNIE SANDERS SAYS HIS $40 TRILLION MEDICARE-FOR-ALL PLAN WOULD HELP US SAVE MONEY In a letter to Sanders campaign manager Faiz Shakir, the campaign staffers claim they “cannot be expected to build the largest grassroots organizing program in American history while making poverty wages,” the Washington Post reported. “Given our campaign’s commitment to fighting for a living wage of at least $15.00 an hour,” the letter continues, “we believe it is only fair that the campaign would carry through this commitment to its own field team.” According to the Post, field organizers claim that their long hours working on behalf of Sanders drop their actual pay to about $13 per hour. “Many field staffers are barely managing to survive financially,” the union letter says, “which is severely impacting our team’s productivity and morale. Some field organizers have already left the campaign as a result.” But when contacted by the Post on Thursday, Shakir seemed to paint a different picture. “We know our campaign offers wages and benefits competitive with other campaigns, as is shown by the latest fundraising reports,” Shakir said in a statement, according to the Post. “Every member of the campaign, from the candidate on down, joined this movement in order to defeat Donald Trump and transform America. Bernie Sanders is the most pro-worker and pro-labor candidate running for president.” As for Sanders himself, the Post said it was unclear whether the candidate was aware of the grievances among his campaign staff. The Post report surfaced on the same day that the Democrat-controlled House voted in favor of a bill to gradually raise the federal minimum wage to $15 per hour. The current federal minimum wage is $7.25 per hour, unchanged since 2009. The situation in the Sanders campaign seems a far cry from March, when Sanders’ campaign proudly announced that its employees had chosen to be represented by the United Food and Commercial Workers Local 400. In May, the campaign ratified a union contract with the workers, making it the first presidential campaign in history to do so. At the time, the campaign touted \"unprecedented standards for campaign workers,\" including pay transparency, a defined wage scale, access to mental health care coverage, an anti-discrimination policy that protects immigrant and transgender staff members, and a \"pro-worker grievance and arbitration process.” Meanwhile, President Trump has offered a different perspective on conditions facing U.S. workers. CLICK HERE TO GET THE FOX NEWS APP During a campaign rally in Greenville, N.C., earlier this week, the president said 6 million new jobs had been created in the U.S. since he was elected and the nation’s unemployment rate of 3.7 percent was at its lowest point in decades. Republican leaders have said a minimum wage hike would be “devastating” for middle-class families, citing research from the Congressional Budget Office. The CBO report found that the Democrats’ bill would boost wages for about 17 million people – but it would also reduce business income, raise consumer prices and reduce the nation’s output. Overall, the CBO said the move would reduce real family income by about $9 billion in 2025 – or 0.1 percent. Fox News’ Ronn Blitzer and Fox Business’ Brittany De Lea contributed to this story.",
      "date": "July 19",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders talks health care at NAACP forum in Iowa -- but was asked about child care",
      "url": "https://www.foxnews.com/politics/bernie-sanders-seemingly-mistakes-childcare-question-for-health-care-in-2-and-a-half-minute-answer",
      "subtitle": "Bernie Sanders talks health care at NAACP forum in Iowa -- but was asked about child care",
      "author": "Brie Stimson",
      "content": " Democratic 2020 presidential contender Sen. Bernie Sanders, I-Vt., appeared to misunderstand a question about access to child care at an NAACP forum in Iowa on Saturday, launching into an answer about health care instead -- for more than two minutes. “Senator, the average cost of child care in Iowa is $8,200 a year,” Des Moines NAACP President and moderator Kameron Middlebrooks said, according to a report. “How would you both increase the availability of high-quality care, why at the same time reducing the costs so providers could still have a livable wage?” BIDEN MIXES UP IOWA, OHIO IN LATEST GAFFE -- BUT QUICKLY CORRECTS HIMSELF “The health care industry has done a good job of lying to the American people,” Sanders began. He continued to speak at length about the high costs of drugs and insurance, never mentioning child care. “We can, in fact, substantially lower the cost of health care for the average American and that’s what I intend to do,\" he concluded, according to Mediaite.com. CLICK HERE TO GET THE FOX NEWS APP The moderators did not comment on his answer. Sanders is in second place behind Sen. Elizabeth Warren, D-Mass., in a new Iowa poll that came out last week.",
      "date": "November 3",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders blasts Michael Bloomberg at Iowa rally: 'You ain't gonna buy this election'",
      "url": "https://www.foxnews.com/politics/bernie-sanders-blasts-michael-bloomberg-at-iowa-rally",
      "subtitle": "Bernie Sanders blasts Michael Bloomberg at Iowa rally: 'You ain't gonna buy this election'",
      "author": "Andrew Craft",
      "content": " Sen. Bernie Sanders, I-Vt., had a billionaire in his sights at a campaign rally in Iowa Saturday night -- and for once, it wasn't President Trump. “Tonight we say to Michael Bloomberg, 'Sorry, you ain’t gonna buy this election,'\" Sanders told a crowd in Coralville, outside Iowa City. \" ... Those days are gone.\" Bloomberg, the former mayor of New York City, qualified Friday to get on the ballot in Alabama, which holds its Democratic presidential primary on March 3, 2020, a date known as Super Tuesday. His team is also making plans to file in Arkansas, which has a Tuesday deadline and also holds its primary March 3. Sanders also excoriated Bloomberg for avoiding the earliest states on the primary and caucus calendar and focusing his efforts on the states that hold nominating contests on Super Tuesday and later in 2020. “You’re not going to get elected president by avoiding Iowa, New Hampshire, South Carolina, and Nevada,\" Sanders said. \"Yes, we don’t have a super PAC and I’m not worth $52 billion.\" The billionaire businessman initially ruled out a 2020 run, but began to reconsider in recent weeks, citing concerns about the ability of the current crop of contenders to defeat Trump. Now, the Sanders campaign is fundraising off the news. An email to supporters started off this way: \"Did you see the news? Mike Bloomberg is filing paperwork to run for President of the United States. Just what America needs...another billionaire using his wealth to try to buy an election.\" Bloomberg won two New York City mayoral elections as a Republican before winning a third term as an independent in 2009. In 2018, he switched his party affiliation to Democrat, saying he was \"far away\" from the Republican Party and wanted Democrats to provide the \"checks and balances our nation needs so badly.\" CLICK HERE TO GET THE FOX NEWS APP At an earlier campaign stop in Iowa Saturday, Rep. Alexandria Ocasio-Cortez, D-N.Y., appeared to refer to Bloomberg when she complained of candidates \"trying to completely purchase our political system [by] running as Republicans and now tossing in their hats as Democrats in the field as well.\" \"But what we're here to say is that in a democracy, it shouldn't matter how much money you have, what should matter is whether you vote, whether you caucus when you turn out,\" she went on. \"It's the numbers. It's the people. It's a movement.\"",
      "date": "November 9",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders laughs at idea Bezos urged Bloomberg to run: ‘That’s real class solidarity’",
      "url": "https://www.foxnews.com/politics/bernie-sanders-laughs-hysterically-at-idea-that-jeff-bezos-urged-michael-bloomberg-to-run-for-president-thats-real-class-solidarity",
      "subtitle": "Bernie Sanders laughs at idea Bezos urged Bloomberg to run: ‘That’s real class solidarity’",
      "author": "Brie Stimson",
      "content": " Sen. Bernie Sanders, I-Vt., laughed so hard Saturday when he learned Amazon CEO Jeff Bezos had urged Michael Bloomberg months ago to run for president that Rep. Alexandria Ocasio-Cortez, D-N.Y., had to step in to speak, according to a report. “Of course!” Ocasio-Cortez told the Des Moines Register. “They’ve got class solidarity. The billionaires are looking out for each other.” She added that Bill Gates being seemingly more willing to vote for President Trump than a Democrat shows how adamant billionaires are about protecting their “excess.” BERNIE SANDERS BLASTS MICHAEL BLOOMBERG AT IOWA RALLY: 'YOU AIN'T GONNA BUY THIS ELECTION' At that point Sanders interjected. “Jeff Bezos, worth $150 billion, supporting Mike Bloomberg, who’s worth only $50 billion, that's real class solidarity,” he told the Register. “I’m impressed by that grassroots movement.” Sanders has been critical of Jeff Bezos in the past, over the treatment of his employees, and takes credit for getting Amazon to raise its minimum wage to $15 per hour last year. CLICK HERE TO GET THE FOX NEWS APP Sanders’ and Sen. Elizabeth Warren’s proposed Medicare-for-all plans that would raise taxes on the wealthy have concerned billionaires like Bloomberg and Bezos. At a rally in Iowa earlier Saturday, Sanders told the crowd Bloomberg “ain’t gonna buy this election!” “You’re not going to get elected president by avoiding Iowa, New Hampshire, South Carolina, and Nevada,\" Sanders said. \"Yes, we don’t have a super PAC and I’m not worth $52 billion.” Bloomberg, a former mayor of New York City, qualified Friday to get on the Democratic presidential primary ballot in Alabama.",
      "date": "November 10",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders: AOC will have key role in my White House if I'm elected in 2020",
      "url": "https://www.foxnews.com/politics/bernie-sanders-ocasio-cortez-key-role-white-house",
      "subtitle": "Bernie Sanders: AOC will have key role in my White House if I'm elected in 2020",
      "author": "Nick Givas",
      "content": " Rep. Alexandria Ocasio-Cortez, D-N.Y., would be given a vital role in a Bernie Sanders administration and could even be tapped for a cabinet-level position, the 2020 presidential hopeful told ABC News on Sunday. \"Look, I have said this before, let me say it again -- and I don't want [Ocasio-Cortez] to hear this, because [her] head will explode,\" Sen. Sanders, I-VT., said during a joint interview alongside the freshman House member. \"I don't know of any person -- I've been in Congress for a few years, who in the course of less than one year -- she's been in office less than one year, who has had more of an impact on American politics as a freshman member of Congress than she has.\" When asked about the possibility of Ocasio-Cortez joining his cabinet, Sander responded that she's deserving of an influential role if he wins in 2020. BERNIE SANDERS CALLS GUN BUYBACKS 'UNCONSTITUTIONAL' AT RALLY: IT'S 'ESSENTIALLY CONFISCATION' \"She is, again, at the end of one year she is a leader in the United States Congress and her ideas are resonating all over this country,\" he said. \"If I am in the White House, she will play a very, very important role, no question.\" Sanders also criticized former New York City mayor and billionaire Michael Bloomberg in the same interview for floating the idea of his own presidential run, and declining to campaign in the early primary states. CLICK HERE TO GET THE FOX NEWS APP \"That is the arrogance of billionaires,\" he said  \"I'm doing five events this weekend right here in Iowa. \"We're all over New Hampshire, South Carolina, Nevada, California. But he's too important. You see, when you're worth $50 billion, I guess you don't have to have town meetings, you don't have to talk to ordinary people,\" Sanders said. \"What you do is you take out, I guess a couple of billion dollars, and you buy the state of California.\"",
      "date": "November 13",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders supporter files labor complaint against Elizabeth Warren’s campaign",
      "url": "https://www.foxnews.com/politics/bernie-sanders-supporter-labor-complaint-elizabeth-warren-campaign",
      "subtitle": "Bernie Sanders supporter files labor complaint against Elizabeth Warren’s campaign",
      "author": "Bradford Betz",
      "content": " A Colorado-based Bernie Sanders supporter has filed a labor complaint against Sen. Elizabeth Warren’s presidential campaign, taking aim at its use of a confidentiality agreement that says keeps staffers from speaking out on workplace conditions. Jason Legg, a tenant-rights attorney -- he has not worked for Warrent's campaign -- filed the challenge on Tuesday. Legg’s complaint said the Warren campaign’s use of a non-disparagement clause, which prohibited employees, interns, and fellows from making “any statement that may impair or adversely affect the goodwill or reputation of the organization,” flew “in the teeth” of the National Labor Relations Act. Legg has denied the complaint was a “politically motivated” move. He’s a supporter of Senator Sanders, I-Vt., but said Warren was his second choice. “I hope people think about the substance of the charge rather than my interest,” he said. BERNIE SANDERS’ CAMPAIGN WORKERS COMPLAINING, FLEEING OVER ‘POVERTY WAGES’: REPORT The National Labor Relations Board will review Legg’s charges and issue a government-backed complaint if it finds them credible, Bloomberg Law reported. Warren’s campaign did not return Fox News' request for comment. CLICK HERE TO GET THE FOX NEWS APP The charge was the second labor complaint against a Democrat’s presidential campaign this cycle. Late last month, a former employee from the Sanders campaign filed a labor complaint, alleging that some employees faced retaliation for involvement in organizing for a collective bargaining agreement.",
      "date": "August 15",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders tells crying baby to keep it down",
      "url": "https://www.foxnews.com/politics/sanders-crying-baby",
      "subtitle": "Bernie Sanders tells crying baby to keep it down",
      "author": "Brooke Singman",
      "content": " A squealing baby tested Bernie Sanders' cool during a town hall event on Tuesday in New Hampshire. The Democratic presidential candidate was about to answer a health care question from an audience member when the little one broke out into a shrill cry. BIDEN PLUNGES, TIED WITH WARREN AND SANDERS IN NEW NATIONAL POLL “Thank you very much, because it’s not easy getting up in front of a TV camera to talk about this,” Sen. Sanders, I-Vt., began. “Did I hear you correctly say you have to cut your pills in half?” Then Sanders snapped his head to the right, as the baby started making a racket. “If we could keep that down a little bit?” he said, pointing in the direction of the crying baby. “OK. Thanks.” SANDERS SAYS HE'D BACK US FUNDING FOR THIRD WORLD ABORTIONS, BIRTH CONTROL, AS PART OF CLIMATE PLAN The Trump campaign zinged Sanders Wednesday after the awkward moment. CLICK HERE TO GET THE FOX NEWS APP “Sanders not feeling the Bern for kids in the audience yesterday…” a Trump campaign official tweeted.",
      "date": "September 5",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders’ Iowa political director has left campaign, reports say",
      "url": "https://www.foxnews.com/politics/bernie-sanders-iowa-political-director-has-left-campaign-reports-say",
      "subtitle": "Bernie Sanders’ Iowa political director has left campaign, reports say",
      "author": "Dom Calicchio",
      "content": " Just days after a shakeup in the New Hampshire leadership of Sen. Bernie Sanders’ 2020 presidential campaign comes word that the candidate’s Iowa political director has departed as well. According to reports, a Sanders aide on Wednesday confirmed that Jess Mazour, who was named Sanders’ Iowa director in March, was let go from the campaign in recent weeks. The aide confirmed the departure on condition of anonymity because the aide wasn’t authorized to discuss personnel matters, The Associated Press reported. SANDERS SHAKES UP CAMPAIGN LEADERSHIP IN NEW HAMPSHIRE Prior to joining the sanders campaign, Mazour was an organizer for the progressive group Iowa Citizens for Community Improvement. The Washington Post was first to report that she had left the campaign. On Sunday, the Sanders campaign announced changes to its New Hampshire leadership after backers of the campaign expressed concern that the independent U.S. senator from neighboring Vermont could lose the first-in-the-nation New Hampshire primary early next year. The campaign announced that Shannon Jackson, who ran Sanders’ Senate reelection campaign in Vermont in 2018, would take over New Hampshire leadersip duties from Joe Caiazzo, who was transferred to Sanders’ operation in Massachusetts, according to the Washington Times. The Caiazzo-Jackson switch came one day after the Sanders campaign parted ways with senior New Hampshire adviser Kurt Ehrenberg. The changes in the Sanders campaign coincide with the loss of a key endorsement for Sanders to rival 2020 progressive candidate Sen. Elizabeth Warren, D-Mass., who this week attracted the backing of the Working Families Party -- a group that had supported Sanders in 2016. “Seeing the campaign not be able to outshine Warren with WFP progressives doesn’t have me questioning WFP’s process,” Rafael Shimunov, a 2016 Sanders volunteer and past national creative director for WFP told Politico. “It has me questioning where the Bernie campaign could have done better, because I want to make sure the strongest candidate unmasks Biden and unseats Trump.” CLICK HERE TO GET THE FOX NEWS APP A Fox News Poll released Wednesday shows that Warren has pulled virtually even with Sanders in second place behind former Vice President Joe Biden, with Sanders attracting support from 18 percent of respondents, Warren 16 percent, and Biden leading with 29 percent. Fox News’ Paul Steinhauser and The Associated Press contributed to this report.",
      "date": "September 18",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders wants to ban advertising during presidential primary debates",
      "url": "https://www.foxnews.com/politics/bernie-sanders-wants-to-ban-advertising-during-presidential-primary-debates",
      "subtitle": "Bernie Sanders wants to ban advertising during presidential primary debates",
      "author": "",
      "content": "Democratic presidential candidate Bernie Sanders says he wants to ban advertising during presidential primary debates. Sanders, a self-identified Democratic socialist, tweeted Tuesday that the relationship between media organizations hosting such debates and their corporate advertisers, which may prefer one candidate over another, is untenable. \"Private media outlets charge outrageous sums to run ads during presidential primary debates like tonight's — and many of their advertisers have vested interest in who is elected,\" he said. \"This type of influence must end. We're going to ban advertising during presidential primary debates.\" BERNIE SANDERS CAMPAIGN VIDEO CREATOR HIRED, FIRED WITHIN 24 HOURS OVER CONTROVERSIAL YOUTUBE COMEDY Tuesday's debate is co-hosted by The New York Times and CNN. For the two primary debates it broadcast in July, CNN required companies to commit to at least $300,000 worth of advertising on the network in order to have a spot appear during a debate, according to Variety. The price for one 30-second ad in a CNN debate was $110,000, Variety reported, which is approximately 11 times higher than an average spot in its primetime programming. CLICK HERE TO GET THE FOX NEWS APP Sanders regularly directs his ire against the rich and corporations as he pushes policies that aim to redistribute wealth from the rich to poor and middle-class Americans through high tax rates on higher earners and expansive entitlements such as so-called \"Medicare-for-all.\"",
      "date": "October 15",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Ocasio-Cortez, Omar, Tlaib to endorse Bernie Sanders",
      "url": "https://www.foxnews.com/politics/ocasio-cortez-omar-tlaib-reportedly-will-endorse-bernie-sanders",
      "subtitle": "Ocasio-Cortez, Omar, Tlaib to endorse Bernie Sanders",
      "author": "Dom Calicchio",
      "content": " Three members of the so-called “Squad” of far-left freshman members of Congress are lining up behind Sen. Bernie Sanders for president. Fox News has learned that Rep. Alexandria Ocasio-Cortez, D-N.Y., will appear with Sanders on Saturday in Queens, N.Y., at a “Bernie’s Back” rally designed to generate excitement for the senator’s campaign following his recent heart procedure. Rep. Ihan Omar, D-Minn., will also endorse the candidate, Fox News confirmed. SANDERS PROMISES NEW JOBS FOR 'TENS OF MILLIONS OF AMERICANS' DURING DEMOCRATIC DEBATE In addition, CNN reported that Rep. Rashida Tlaib, D-Mich., will endorse Sanders as well. It was not immediately clear if Omar and Tlaib will appear at Saturday's event. \"Bernie is leading a working class movement to defeat Donald Trump that transcends generation, ethnicity and geography,\" Omar was quoted as saying in a statement posted on Twitter by the Sanders campaign — and that Omar retweeted on her own Twitter page. \"I believe Bernie Sanders is the best candidate to take on Donald Trump in 2020,\" Omar added. The endorsements would be a significant blow to the campaign of Sen. Elizabeth Warren, who, like Sanders, has been representing the party’s progressive wing. Word of the endorsements also followed Tuesday night’s Democratic debate in Ohio, where Warren was under attack from multiple candidates after rising in the polls in recent weeks. CLICK HERE TO GET THE FOX NEWS APP Winning the OK of the “Squad” members was also viewed as crucial in attracting young voters, as the top three Democrats in the polls are all senior citizens — Sanders is 78, former Vice President Joe Biden is 76 and Warren is 70 years old. There was no indication that the fourth member of the Squad, Rep. Ayannna Pressley, D-Mass., was ready to make an endorsement — either of Sanders or any other candidate. ​​​​​​​Fox News’ Paul Steinhauser and Andrew Craft contributed to this report.",
      "date": "October 15",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Biden dismissive of Ocasio-Cortez’s expected endorsement of Bernie Sanders",
      "url": "https://www.foxnews.com/politics/biden-dismissive-of-ocasio-cortezs-expected-endorsement-of-bernie-sanders",
      "subtitle": "Biden dismissive of Ocasio-Cortez’s expected endorsement of Bernie Sanders",
      "author": "Ronn Blitzer",
      "content": "  Former Vice President Joe Biden appeared to shrug off Rep. Alexandria Ocasio-Cortez, D-N.Y., on Wednesday in light of the freshman congresswoman's expected endorsement of Biden's 2020 rival, Sen. Bernie Sanders, I-Vt., in the presidential race. When asked about his plan to convince voters in light of the left-wing Democrat's support of Sanders, Biden smiled broadly and gave a dismissive response. TOMI LAHREN: AOC SHOULD WORRY ABOUT HER OWN REELECTION, NOT ENDORSING BERNIE \"That's how I do it,\" Biden said with a chuckle, while campaigning the day after the debate in Ohio. Ocasio-Cortez is one of three members of the so-called \"Squad\" of far-left first-year representatives who are throwing their support behind the Vermont democratic socialist. Rep. Ilhan Omar, D-Minn., is backing Sanders, tweeting a statement that Sanders is \"fighting for the soul of our democracy,\" along with a video explaining her endorsement. She touted Sanders' campaign promises, including his vow to cancel student debts. In addition, CNN reported that Rep. Rashida Tlaib, D-Mich., will endorse Sanders as well. CLICK HERE TO GET THE FOX NEWS APP Ocasio-Cortez is expected to join Sanders at a campaign event Saturday in Queens, N.Y. The rally is called \"Bernie's Back,\" and is meant to spark renewed enthusiasm for the Sanders campaign following his recent heart attack. So far, there is no indication as to whether the fourth \"Squad\" member, Rep. Ayanna Pressley, D-Mass., is endorsing any candidate. Fox News' Dom Calicchio contributed to this report.",
      "date": "October 16",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez to campaign for Bernie Sanders in Iowa",
      "url": "https://www.foxnews.com/politics/alexandria-ocasio-cortez-campaign-bernie-sanders-iowa",
      "subtitle": "Alexandria Ocasio-Cortez to campaign for Bernie Sanders in Iowa",
      "author": "Adam Shaw",
      "content": " Rep. Alexandria Ocasio-Cortez, D-N.Y., will campaign for Sen. Bernie Sanders, I-Vt., in Iowa -- a sign of the important role the freshman congresswoman will play in the Vermont senator's 2020 presidential bid in a vital state. Sanders made the announcement Friday evening at a rally in Des Moines, according to the Des Moines Register, ahead of the Democratic Party’s Liberty and Justice Celebration. AOC BACKS SANDERS AT NEW YORK RALLY, CREDITS HIM WITH 'FUNDAMENTALLY' CHANGING POLITICS The duo will be at three events across two days between Nov 8-9, including a “Climate Crisis Summit.” The Register reported that she will promoting the Green New Deal at those events -- an expansive government-run overhaul of the economy and energy output to fight climate change. Ocasio-Cortez has shot to national attention since a longshot primary win against then-Rep. Joe Crowley, D-N.Y., and has become the most visible member of the left-wing group of freshman congresswomen known as “The Squad.” TRUMP RALLIES SUPPORTERS IN MISSISSIPPI AFTER HOUSE IMPEACHMENT PROBE VOTE, AHEAD OF TIGHT GOVERNOR'S RACE Since Sanders clinched her endorsement, she has featured prominently in his campaign. Ocasio-Cortez spoke at Sanders’ return to the campaign trail since heart surgery earlier this month, where she told a New York rally how the senator inspired her to embark on her own political bid. \"It wasn't until I heard of a man by the name of Bernie Sanders that I began to question and assert and recognize my inherent value as a human being that deserves health care, housing, education and a living wage,” she said. She said Sanders had spent decades fighting for those things to make life for her better, such as the Children’s Health Insurance Plan (CHIP), universal health care, and student debt forgiveness. “Bernie Sanders did not do these things because they were popular and that’s what we need to remember,” she said. “No one wanted to question this system and in 2016 he fundamentally changed politics in America.” CLICK HERE FOR THE FOX NEWS APP The congresswoman then appeared in a subsequent digital ad for Sanders. According to Politico, Sanders aides have said Ocasio-Cortez's endorsement represents the multiracial working-class coalition he is trying to build.",
      "date": "November 2",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders hits 4 million donations mark, campaign announces",
      "url": "https://www.foxnews.com/politics/sanders-campaign-touts-topping-the-4-million-donations-mark",
      "subtitle": "Bernie Sanders hits 4 million donations mark, campaign announces",
      "author": "Paul Steinhauser",
      "content": " Sen. Bernie Sanders is part of a top tier of candidates in the national and early voting state polls who are vying for the Democratic presidential nomination. But when it comes to donations to his campaign, the longtime progressive lawmaker and populist champion from Vermont is in a league of his own, far ahead of his 2020 rivals. Sanders' campaign announced on Tuesday morning that it's now received more than 4 million individual contributions from people across the country, making the senator the fastest candidate in history to reach the fundraising mark. THE LATEST FROM FOX NEWS ON THE 2020 PRESIDENTIAL CAMPAIGN “Working-class Americans across the country are chipping in $3, $18, $27, or whatever they can to help elect Bernie Sanders because they know he is the only candidate who will fight for them and take on corporate greed and corruption,” campaign manager Faiz Shakir touted. “This is what momentum looks like.” Sanders is making his second straight White House run. His campaign highlighted that the candidate didn’t reach the 4 million individuals milestone in the 2016 cycle until after February’s New Hampshire primary, which is still more nearly three months away. Sanders, though, didn’t announce his 2016 bid until late April 2015. This time around, Sanders launched his presidential campaign in February of 2019, two months ahead of his 2016 schedule. Sanders – like his progressive rival Sen. Elizabeth Warren of Massachusetts – is relying on small-dollar grassroots donations to fuel his campaign. He hauled in $25.3 million in the July-September third quarter of fundraising, more than any other Democratic White House hopeful. That haul was powered by some 1.4 million contributions. Sanders’ donor announcement came on the eve of Wednesday’s fifth-round Democratic presidential nomination debate, which will be held in Atlanta.",
      "date": "4 days ago",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders slams Elizabeth Warren as ‘capitalist’",
      "url": "https://www.foxnews.com/politics/dividing-lines-bernie-sanders-slams-elizabeth-warren-as-capitalist",
      "subtitle": "Bernie Sanders slams Elizabeth Warren as ‘capitalist’",
      "author": "Alex Pappas",
      "content": " Vermont Sen. Bernie Sanders – the self-proclaimed Democratic socialist whose standing in the 2020 primary has become threatened by Massachusetts Sen. Elizabeth Warren’s surge in the Democratic primary with progressive voters – is seeking to cut into the support of his rival by dismissing her as a “capitalist.” “There are differences between Elizabeth and myself,” Sanders said during an interview Sunday on ABC’s “This Week.” “Elizabeth I think, as you know, has said that she is a capitalist through her bones. I’m not.” BILLIONAIRES COULD FACE UP TO 97.5 PERCENT TAX RATES UNDER SANDERS’ PLAN: ECONOMISTS The comments come amid a rise in socialism in the Democratic Party, as candidates become more willing to openly embrace socialism over capitalism. It also follows polling showing that Democrats now view socialism more positively than they do capitalism. Last year, when asked if she was a capitalist, Warren reportedly said, \"I am a capitalist to my bones.\" Sanders explained he is not a capitalist because he \"will not tolerate for one second the kind of greed and corruption and income and wealth inequality and so much suffering that is going on in this country today, which is unnecessary.” A Gallup poll this year found that 43 percent of Americans think socialism would be a good thing for the United States, while 51 percent say it would be a bad thing. Gallup noted that in 1942, a Roper/Fortune survey that found 40 percent of Americans described socialism as a bad thing while only 25 percent called it a good thing. The polling is fresh evidence that attitudes toward socialism are changing, amid the popularity in the Democratic Party of Democratic socialists like Sanders and New York Rep. Alexandria Ocasio-Cortez, who pushes policies like “Medicare-for-all” and the Green New Deal. Meanwhile, two economists at the University of California, Berkeley, claim that billionaires could face a 97.5 percent average effective tax rate under Sanders' plan, which would easily thump other Democrats running for president in 2020. Emmanuel Saez, one of the professors, told Bloomberg that “with the wealth tax, you get directly at the stock instead of hitting the flow of income, making it a much more powerful de-concentration tool than income taxes.\" The report pointed out that Sanders has said that the number of billionaires in the U.S. would be cut in half within 15 years under the plan. The plan unveiled by Sanders seeks a 1 percent levy on households worth more than $32 million and proposes tax rates that would increase for wealthier people, up to 8 percent for fortunes in excess of $10 billion. Sanders vowed to go further than Warren and generate more than $4 trillion over the next decade, substantially reducing billionaires’ fortunes. Billionaires would face a 62 percent average effective tax rate under Warren. Sanders’ plan goes further because it starts on fortunes worth less, kicking in at $32 million. Warren also proposes increasing the wealth tax up to 3 percent on any net worth of more than $1 billion, while Sanders’ tax rates don’t top out until 8 percent for the richest households. CLICK HERE TO GET THE FOX NEWS APP The Massachusetts senator has topped Sanders in recent polls of Democrats in Iowa and New Hampshire that show her running about even with the longtime front-runner, former Vice President Joe Biden, in those states. Fox News' Edmund DeMarche and the Associated Press contributed to this report.",
      "date": "October 14",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    }
  ]
}