{
  "articles": [
    {
      "title": "Trump donates three-month salary to Department of Education",
      "url": "https://www.foxnews.com/politics/trump-donates-three-month-salary-to-department-of-education",
      "subtitle": "Trump donates three-month salary to Department of Education",
      "author": "",
      "content": "President Donald Trump is donating his second-quarter salary to the Department of Education. White House press secretary Sarah Huckabee Sanders says Trump chose to give the department $100,000. His first-quarter salary donation went to the Department of Interior. \"It's that time again, as many of you have probably noticed, for us to announce where the president will be donating his quarterly salary,\" Sanders said Wednesday during the daily White House press briefing. \"This quarter the president will be donating his salary to the Department of Education.\" Education Secretary Betsy DeVos says the donation is being used to pay for a science, technology, engineering and mathematics (STEM) camp sponsored by the department. As a candidate, Trump had promised not to take a salary if elected. But by law he must be paid, so he is donating the money. Taxpayers can write off such donations, potentially lowering their income taxes. DeVos says she is grateful for the donation. \"The president is committed to our nation’s students, and to reforming education in America so that every child, no matter their ZIP code, has access to a high-quality education,\" she said after receiving the check from Sanders during the briefing. The Trump administration has also proposed a 13 percent cut to the Education Department's budget, slashing it by $9.2 billion. The Associated Press contributed to this story.",
      "date": "July 27, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Anti-Trump vandalism sweeps country: Yacht, Hollywood star latest targets",
      "url": "https://www.foxnews.com/politics/anti-trump-vandalism-sweeps-country-yacht-hollywood-star-latest-targets",
      "subtitle": "Anti-Trump vandalism sweeps country: Yacht, Hollywood star latest targets",
      "author": "Adam Shaw",
      "content": " Two years into the Trump administration, aggrieved activists are not only accosting Cabinet members or driving them out of restaurants -- they're increasingly taking out their frustration on inanimate objects. A burst of anti-Trump vandalism against possessions and property associated with administration officials is the latest flare-up in a “resistance” that has taken many forms. Last year, protesters marked the anniversary of President Trump's election by screaming at the sky. Lately, the tactics have become more confrontational, touching off a national debate over civility in politics. But smashing and spray-painting are yet another outlet. Here are some of the items that have been the focus of anti-Trump activists’ rage. Trump’s Star on the Hollywood Walk of Fame Trump’s star on the Walk of Fame has been subjected to repeat acts of vandalism, with one protester going so far as to smash it with a pick ax last month. Brawls have since broken out at the spot after crowds of Trump supporters and protesters gathered near the contentious marker. But this isn’t the first time the star has been under assault. Back in 2016, before Trump was elected, the star was defaced by a vandal who scratched off his name and a TV icon. The vandal told TMZ he was doing it so that the removed parts could be auctioned for the legal defense of Trump accusers. Earlier that year, the star was defaced in February of 2016 when someone spray-painted it with a swastika. Betsy DeVos’ Yacht A $40 million boat owned by Education Secretary Betsy DeVos was untied from its Ohio dock last week, causing it to drift into a dock and incur up to $10,000 in damages. The vessel, named the Seaquest, ended up with large scratches before the crew was able to get control of it. DeVos is unlikely to be too troubled by the damage -- the Seaquest is one of 10 vessels owned by the DeVos family. Ben Carson’s House Ben Carson, the Housing and Urban Development secretary, said in a Facebook post last August that his home in Virginia, along with his neighbor’s house, was vandalized by anti-Trump types who “wrote hateful rhetoric about President Trump.” “We were out of town, but other kind, embarrassed neighbors cleaned up most of the mess before we returned,” Carson said. Trump Golf Courses Of all the officials in the Trump administration, President Trump will always be the main villain in the eyes of his opponents. This, in turn, makes his properties a prime target. The Trump International Golf Course near his Florida estate was hit by splotches of red paint in April, obscuring some of the letters on the sign at the entrance of the club in  West Palm Beach. In October, a Hawaii man reportedly was charged with criminal mischief for defacing four golf courses owned by the Trump Organization, by allegedly carving messages into the greens. Trump International Hotel In October 2016, Trump's hotel in downtown Washington D.C. was vandalized with the phrases \"black lives matter\" and \"no justice, no peace.\" In May 2017, the same hotel briefly had messages in light projected onto the hotel, including one that said \"Pay Trump Bribes Here.\" Another read \"emoluments welcome,\" in reference to the controversy surrounding Trump's alleged financial conflicts. Trump Paraphernalia Make America Great Again? Well, don't declare it too loudly, as there have been multiple reports of Trump supporters being accosted for wearing a MAGA cap, or other signs of Trump support. Just this week, a woman in Massachusetts was taken into custody after allegedly deliberately ramming into a car sporting a Trump bumper sticker. “She said, ‘You voted for Trump?’” the man she hit recalled her saying. “I said yes. She called me a racist and several other names.” The man then claimed that the woman repositioned her vehicle and hit his car with hers, the Cape Cod Times said, citing the police report. After this, the woman reportedly left the scene. Fox News’ Morgan Evans, Frank Miles and The Associated Press contributed to this report.",
      "date": "August 3, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Trump names Dow Chemical CEO Liveris to head Manufacturing Council",
      "url": "https://www.foxnews.com/politics/trump-names-dow-chemical-ceo-liveris-to-head-manufacturing-council",
      "subtitle": "Trump names Dow Chemical CEO Liveris to head Manufacturing Council",
      "author": "",
      "content": "President-elect Donald Trump, on a “thank you tour” stop in Grand Rapids, Mich., announced Friday that he would name Dow Chemical Co. CEO Andrew Liveris to head the American Manufacturing Council and “find ways to bring industry back to America.” Liveris, 62, is a dual U.S.-Australian citizen, Reuters reported. During the stop, Trump also noted Michigan had helped him get elected while his opponents “forgot about you people.” Trump was the first Republican presidential candidate to win Michigan since 1988. Trump also introduced his choice for education secretary, Betsy DeVos, who lives in Michigan. The Associated Press contributed to this report",
      "date": "December 9, 2016",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Video of Candace Owens firing back at Ted Lieu nears CSPAN record",
      "url": "https://www.foxnews.com/politics/candace-owens-ted-lieu-cspan-twitter-record",
      "subtitle": "Video of Candace Owens firing back at Ted Lieu nears CSPAN record",
      "author": "Lukas Mikelionis",
      "content": " The viral clip of conservative commentator Candace Owens accusing Rep. Ted Lieu, D-Calif., of distorting her comments in such fashion that he must “believe black people are stupid” has become the most-viewed C-SPAN Twitter video from a House hearing. The Twitter video of the exchange so far accumulated nearly 6.8 million views and appears to be on track to be most watched C-SPAN clip from a House hearing on all platforms. CANDACE OWENS EXPLODES AT TED LIEU MID-HEARING AFTER HE PLAYS SHORT CLIP OF HER HITLER COMMENTS “In less than 24 hours, this video is the most watched C-SPAN Twitter video from a House hearing (4.47 million views),” tweeted Jeremy Art, C-SPAN’s social media senior specialist, before the video got another 2.3 million views. He added that it’s not yet the most watched C-SPAN video from a House hearing ever as it still lacks a couple of millions views – 5 million at the time of the tweet, though the gap has been cut in half since – to be on par with a video from a House hearing in 2017 in which Secretary of Education Betsy DeVos was criticized for not being able to “come up with one example of discrimination that you would stand up for students.” In the explosive video, Lieu fired the first shot at Owens by playing a short audio recording of her previous remarks at a conference in December, which were widely circulated in February, where she argued that she doesn’t have a problem with “nationalism.” “I think the definition gets poisoned by elites that want globalism. Globalism is what I don't want.  When we say ‘nationalism,’ the first thing people think about — at least in America — is Hitler,” she is heard saying. “You know, he was a national socialist, but if Hitler just wanted to make Germany great and have things run well, OK then, fine. The problem is, he had dreams outside of Germany. He wanted to globalize. He wanted everyone to be German. ...” CANDACE OWENS: HEARING WAS A HOAX, DEMOCRATS WANT AFRICAN-AMERICANS TO FAIL Owens fired back at Lieu, accusing him of intentionally misrepresenting her views to drive a false narrative. “I think it’s pretty apparent that Mr. Lieu believes that black people are stupid and will not pursue the full clip in its entirety,” Owens said. “He is assuming that black people will not go and pursue the full two-hour clip. He purposefully cut off -- and you didn't hear the question that was asked of me. He's trying to present as if I was launching a defense of Hitler in Germany, when in fact the question that was presented to me was pertaining to whether I believed in nationalism, and that nationalism was bad,” she continued. CLICK TO GET THE FOX NEWS APP Fox News’ Gregg Re contributed to this report.",
      "date": "April 12",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Falwell says Trump offered him education secretary job",
      "url": "https://www.foxnews.com/politics/falwell-says-trump-offered-him-education-secretary-job",
      "subtitle": "Falwell says Trump offered him education secretary job",
      "author": "",
      "content": "RICHMOND, Va. – Liberty University President Jerry Falwell Jr. says President elect-Donald Trump offered him the job of education secretary, but that he turned it down for personal reasons. Falwell tells The Associated Press that Trump offered him the job last week during a meeting in New York. He says Trump wanted a four- to six-year commitment, but that he couldn't leave Liberty for more than two years. Falwell says he couldn't afford to work at a Cabinet-level job for longer than that and didn't want to move his family, especially his 16-year-old daughter. Trump announced Wednesday he had selected charter school advocate Betsy DeVos for the job. Falwell says he thinks DeVos is an \"excellent choice.\" Trump spoke at the Christian university in Lynchburg, Virginia, in January and Falwell later endorsed him.",
      "date": "November 27, 2016",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Education Department investigating Michigan State over Nassar allegations",
      "url": "https://www.foxnews.com/politics/education-department-investigating-michigan-state-over-nassar-allegations",
      "subtitle": "Education Department investigating Michigan State over Nassar allegations",
      "author": "",
      "content": "WASHINGTON – The Education Department said Monday that it has opened an investigation into how Michigan State University handled allegations of sexual assault against Dr. Larry Nassar, a longtime employee who has been sentenced to decades in prison for molesting young athletes and possessing child pornography. Education Secretary Betsy DeVos said investigators will look at \"systemic issues\" with how the school has dealt with such complaints. In a statement, she called Nassar's actions \"unimaginable.\" She added, \"The bravery shown by the survivors has been remarkable.\" DeVos, who is from western Michigan, said she appreciates that the university's acting president, John Engler, has ordered the school to cooperate fully with the investigation. The Education Department was already reviewing separate complaints about the school's compliance with Title IX, the law that requires schools to prevent and respond to reports of sexual violence, and compliance with requirements about providing campus crime and security information. The Michigan Attorney General's office also is investigating Michigan State's handling of Nassar, who was a campus sports doctor. Later Thursday, some of Nassar's victims will join Michigan lawmakers in announcing new bills in the wake of the scandal. One measure would add college employees and youth sports coaches, trainers and volunteers to Michigan's list of people who must report suspected abuse or neglect to child protective services. Other proposals would eliminate certain time limits for victims of childhood sexual abuse to sue, lift the statute of limitations for prosecutors to file charges in certain cases of criminal sexual misconduct, and eliminate governmental immunity for people and entities that allow sexual assaults to occur.",
      "date": "February 26, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Schiff refers Blackwater founder Prince to DOJ over alleged false statements to Congress",
      "url": "https://www.foxnews.com/politics/schiff-refers-blackwater-founder-erik-prince-to-doj-over-alleged-false-statements-to-congress",
      "subtitle": "Schiff refers Blackwater founder Prince to DOJ over alleged false statements to Congress",
      "author": "Brooke Singman",
      "content": "  House Intelligence Committee Chairman Adam Schiff, D-Calif., formally referred Blackwater founder Erik Prince to the Justice Department for a criminal investigation over whether Prince lied to the panel about a 2016 meeting in the Seychelles islands with a Russian banker tied to Vladimir Putin. In a statement, the committee said it had “identified at least six categories of materially false statements” Prince made about the meeting with Kirill Dmitriev when he appeared before the committee in November 2017. In a letter to Attorney General William Barr, Schiff said Special Counsel Robert Mueller's report on allegations of collusion between the Trump campaign and Russian officials “strongly indicates that Erik Prince knowingly and willfully provided materially false testimony,” which Schiff argued “hindered the Committee’s ability to fully understand and examine foreign efforts to undermine our political process and national security, develop appropriate legislative and policy remedies to counter future malign influence operations targeting campaigns and presidential transitions, and inform the American public, as appropriate.” SCHIFF HEDGES ON TRUMP IMPEACHMENT, SAYS INSTEAD, 'VOTE HIS A-- OUT OF OFFICE' “I do believe that there is very strong evidence that he willingly misled the committee and willingly made false statements to the committee,” Schiff told The Washington Post’s Bob Costa during a panel event earlier Tuesday. “The evidence is so weighty that the Justice Department needs to consider this. His testimony, which I can discuss because it is public record, was that his meeting in Seychelles with this Russian banker [Dmitriev] was purely by chance. He just happened to go to Seychelles for about a day and have a chance meeting with the Russian banker.” Prince, the founder of the private military contractor Blackwater, and the brother of Education Secretary Betsy DeVos, testified in 2017 that the meeting with the Russian banker was a chance encounter. Special Counsel Robert Mueller’s report revealed that the meeting was set up ahead of time. “We know from the Mueller report that this was not a chance meeting,” Schiff said Tuesday. “We know there were communications after he returned.” Schiff added that Prince had “discussions” with former White House adviser Steve Bannon about the meeting before he left, and “communications” after he returned from the meeting, a claim the lawmaker said was contradicted by the Mueller report. SCHIFF REFUSES TO BACK DOWN ON CLAIMS AGAINST TRUMP, SAYS HE HAS NO REGRETS “Somehow, mysteriously, magically, the communications between Prince and Bannon have apparently fled their devices,” Schiff said. “In very material ways, I think the evidence strongly suggests that he willingly misled our committee and the Justice Department needs to consider whether there’s a prosecutable case.” Schiff added that when Bannon appeared before his committee, he “refused to answer almost all of our questions.” “He said he was not answering questions because the White House asked him not to,” Schiff said. Schiff was also asked whether his panel felt that President Trump’s eldest son, Donald Trump Jr., or his son-in-law and adviser Jared Kushner gave false testimony. CLICK HERE TO GET THE FOX NEWS APP “I don’t want to comment on any others. We have reached the point of ripeness with Prince’s testimony that we feel it appropriate to refer it,” Schiff said. “I don’t want to comment on any others.” Schiff’s comments come in the midst of a heated battle between Congress and the White House over subpoenas for former and current officials to testify before House committees leading sweeping Trump-focused probes. Schiff’s panel is currently investigating the president’s finances. The Associated Press contributed to this report.",
      "date": "April 30",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Blackwater founder considering Wyo. Senate bid: AP Source",
      "url": "https://www.foxnews.com/politics/blackwater-founder-considering-wyo-senate-bid-ap-source",
      "subtitle": "Blackwater founder considering Wyo. Senate bid: AP Source",
      "author": "",
      "content": "Blackwater Worldwide founder Erik Prince is considering a Republican primary challenge to Wyoming Sen. John Barrasso, a senior member of the Senate Republican leadership team. A person familiar with Prince's thinking says he was in Wyoming this weekend to discuss a possible Senate campaign with family members. Prince has been encouraged to run by Steve Bannon, a former top strategist to President Donald Trump. That's according to the person who spoke on condition of anonymity to describe private deliberations. Prince's potential candidacy was first reported by The New York Times. Also founder of Frontier Resource Group, a private equity firm, Prince is brother of Education Secretary Betsy DeVos. Security contractor Blackwater came under scrutiny after its guards were involved in the shooting deaths of 14 civilians in Baghdad in 2007.",
      "date": "October 8, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Trump honors Jon Voight, James Patterson, others with National Medal of Arts, National Humanities Medal",
      "url": "https://www.foxnews.com/politics/trump-honors-jon-voight-james-patterson-others-with-national-medal-of-arts-national-humanities-medal",
      "subtitle": "Trump honors Jon Voight, James Patterson, others with National Medal of Arts, National Humanities Medal",
      "author": "Morgan Phillips",
      "content": " President Trump on Thursday honored eight people with the National Medal of the Arts and the National Humanities Medal -- four in each category. Recipients included novelist James Patterson, actor Jon Voight, and the musicians of the U.S. military, among others. “These are the highest honors available for contributions to American art and culture,” the president stated. Vice President Pence, Treasury Secretary Steve Mnuchin and Education Secretary Betsy DeVos were in the audience for the ceremony. Trump began by honoring actor Voight, whom he called a “great friend” and “one of America’s greatest living legends.” Trump called Voight’s movie “The Champ” “the greatest boxing movie of all time.” “Everyone was crying at the end of the movie but I tried not to, John,” Trump added. Voight has starred in dozens of feature films since the late 1960s, when he rose to prominence for his Oscar-nominated role in “Midnight Cowboy.” Voight, the father of actors Angelina Jolie and James Haven, is also known for his roles in “Coming Home,” “Heat,” “The Rainmaker,” and “Ali.” More recently, he was seen in the “National Treasure” series, “Zoolander,” and “Four Christmases,” among others. Voight was an outspoken liberal in his early career, protesting the Vietnam War alongside actress Jane Fonda. However, he endorsed both Sen. Mitt Romney in 2012 and President Trump in 2016. He spoke at an inauguration rally for Trump in January 2017. “We love having you here, especially since it happens to be somebody that I really like,” said Trump. Trump then presented a medal to Sharon Rockefeller. Sharon Percy Rockefeller was the wife of former West Virginia Sen. Jay Rockefeller, but her philanthropic work and public advocacy are what earned her the medal. As first lady of West Virginia, Rockefeller worked on behalf of the state’s schoolchildren, among other causes. Rockefeller promoted the Public Broadcasting Service and served as the CEO and president of WETA, D.C.’s flagship public television and radio stations. She chairs the Board of Trustees for the National Gallery of Art. She also serves on the board of the Museum of Modern Art, Sibley Memorial Hospital and the Rockefeller Foundation. Next, Trump presented a medal to author Patterson, whom he called a personal friend and “one of the most prolific and talented fiction authors of all time.” Patterson has written 277 books and sold over 400 million copies. “You’ve sold a lot more books than me. More than anyone except maybe one -- the Bible has you by a little bit,” said Trump. PRESIDENT TRUMP PRESENTS MEDAL OF HONOR TO GREEN BERET FOR 2008 AFGHANISTAN HEROICS Among Patterson’s works are “Red Alert,” “Along Came a Spider,” “The President is Missing” which he co-wrote with former President Bill Clinton, and “Filthy Rich,” a story of disgraced financier Jeffrey Epstein, published in 2016, years before the shocking 2019 revelations that led to his arrest and subsequent apparent suicide. Of Patterson’s works, 218 titles have earned a spot on The New York Times bestseller list, and 95 have ranked No. 1. Trump then turned to Allison Krauss. Krauss is an American bluegrass-country singer. She’s won 27 Grammy awards and 42 nominations, earning more Grammy awards than any other woman. She’s known for hits such as “Every Time You Say Goodbye,” “Baby Now That I’ve Found You,” “Whiskey Lullaby” and \"When You Say Nothing at All.” TRUMP PRESENTS MEDAL OF HONOR TO FORMER ARMY STAFF SERGEANT WHO RESCUED ENTIRE SQUAD IN IRAQ The president then honored Patrick O’Connell as “one of the greatest chefs of our time.” O’Connell opened The Inn at Little Washington, which Trump said he and the first lady planned to visit. Also honored was the Claremont Institute for informing Americans how America’s founding principles “made this nation the greatest of anywhere on earth.” He then honored Teresa Lozano Long for her support of the arts. Together with her husband, Long has donated over $130 million to universities and institutions in Texas. She is also the namesake of the Teresa Lozano Long Institute of Latin American Studies (LLILAS) at the University of Texas at Austin, for which she and her husband created a $10 million endowment. CLICK HERE TO GET THE FOX NEWS APP Lastly, Trump recognized the musicians of the U.S. military. “Forming 136 bands worldwide, they perform over 35,000 times each year, from concert halls to war zones,” the president said. “Many could be in great concert halls of the world but this is where they want to be.”",
      "date": "2 days ago",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Who's in Trump's Cabinet? A full list of the president's top advisers",
      "url": "https://www.foxnews.com/politics/whos-in-trumps-cabinet-a-full-list-of-the-presidents-top-advisers",
      "subtitle": "Who's in Trump's Cabinet? A full list of the president's top advisers",
      "author": "",
      "content": "President Trump’s Cabinet is made up of department heads and advisers he’s hand-picked – and they all have vastly different backgrounds. But his Cabinet, which includes the heads of 15 executive departments and others, such as the vice president and White House chief of staff, hasn’t remained the same since he took office. Some members have resigned, and others have shuffled to different positions. As the Trump administration continues to change, here’s an up-to-date look at who is currently serving in the president’s Cabinet. Mike Pence is the 48th vice president of the U.S. Trump named Pence as his running mate during his presidential campaign in July 2016. Assumed office: January 20, 2017 Prior job: Indiana governor, congressman Fun fact: Before going into politics, Pence was a radio talk show host in Indiana in the 1990s. Mike Pompeo was sworn in as the 70th secretary of state in April, replacing Rex Tillerson. Assumed office: April 26, 2018 Prior job: CIA director Fun fact: He is the first former CIA director to lead the State Department. Steven Mnuchin is the 77th secretary of the Treasury Department. In his role, Mnuchin oversees the department that is seen as the steward of economic and financial systems in the U.S. Assumed office: February 13, 2017 Prior job: Trump campaign’s financial chairman Fun fact: Before working for Trump, Mnuchin founded and led hedge fund Dune Capital Management as well as Dune Entertainment, which invested in major Hollywood films such as “Avatar” and “The Devil Wears Prada.” He is listed as an executive producer on other major films, including “American Sniper,” “The Lego Movie” and “Suicide Squad.” William Barr is the acting attorney general, taking over after Jeff Sessions left the post. Assumed office: Feb. 14, 2019 Prior job: Lawyer with Kirkland & Ellis in Washington, D.C. Fun fact: Barr has already held the position of attorney general, serving under the late President George H.W. Bush from 1991 to 1993. David Bernhardt is the acting secretary of the Interior Department following Ryan Zinke's departure. Assumed office: January 2, 2019 Prior job: Deputy secretary of the interior Fun fact: He worked in the Interior Department under multiple roles from 2001 to 2009 as well, according to his biography. A former farmer and agribusinessman, George Ervine “Sonny” Perdue is the 31st secretary of agriculture. Assumed office: April 25, 2017 Prior job: Georgia governor Fun fact: Perdue was the designated survivor during Trump’s first official State of the Union address. Wilbur Ross is the 39th secretary of commerce. In his role, Ross is the “principal voice of business in the Trump administration,” according to his Commerce Department biography. Assumed office: February 28, 2017 Prior job: Investment banker, chairman of WL Ross & Co. LLC Fun fact: Ross has been given honors by former South Korean President Kim Dae-jung and Akihito, the emperor of Japan, for his financial help with both countries, according to his biography. Alex Acosta is the 27th labor secretary. Assumed office: April 28, 2017 Prior job: Dean of the Florida International University College of Law Fun fact: The son of Cuban refugees, Acosta was a first-generation college student, earning a degree in economics and a law degree from Harvard, according to his Labor Department biography. Alex Azar is the 24th health and human services secretary. He was nominated for the position after Trump’s first pick, Tom Price, resigned after less than a year in the position over his use of private planes. Assumed office: January 29, 2018 Prior job: Attorney, deputy secretary of the Department of Health and Human Services Fun fact: Azar clerked for the late Supreme Court Justice Antonin Scalia, according to his Health and Human Services Department biography. Dr. Ben Carson is the 17th Department of Housing and Urban Development secretary. Assumed office: March 2, 2017 Prior job: Director of pediatric neurosurgery at Johns Hopkins Children’s Center Fun fact: Carson became the youngest major division director in Johns Hopkins’ history when he was named director of pediatric neurosurgery at the age of 33, his Housing and Urban Development Department biography states. He is also a recipient of the Presidential Medal of Freedom and the Spingarn Medal, the highest honor awarded by the NAACP. Elaine Chao is the 18th secretary of transportation. Assumed office: January 31, 2017 Prior job: Former director of the Peace Corps Fun fact: This isn’t Chao’s first Cabinet appointment; she served as the Department of Labor secretary under former President George W. Bush. Born in Taiwan, she is also the wife of Senate Majority Leader Mitch McConnell. Rick Perry is the 14th secretary of the Department of Energy. Assumed office: March 2, 2017 Prior job: Texas governor Fun fact: Perry appeared as a contestant on ABC’s “Dancing with the Stars” but was eliminated in the second round. Betsy DeVos is the 11th Department of Education secretary. Assumed office: February 7, 2017 Prior job: Michigan GOP chairwoman Fun fact: DeVos and her husband are known for their philanthropic work – especially when it comes to education – in the state of Michigan. But the couple also produced a short-lived Broadway musical with Kathie Lee Gifford. Robert Wilkie was selected as the secretary of veterans affairs after Trump fired David Shulkin. Assumed office: July 30, 2018 Prior job: Undersecretary of defense for personnel and readiness at the Defense Department Fun fact: Wilkie previously served as assistant secretary of defense under Robert Gates and Donald Rumsfeld during the Bush administration – making him the youngest senior leader in that department, according to his Defense Department biography. The president has had a few chiefs of staff during his first term, including Mick Mulvaney who currently serves in the role. He replaced John Kelly, a decorated military veteran, in 2019. Kelly replaced Reince Priebus in 2017. Assumed office: January 2, 2019 Prior job: South Carolina congressman Fun fact: Mulvaney and his wife are the parents of triplets. Dan Coats is the 5th director of national intelligence. In his role, he leads the U.S. intelligence community and advises Trump, according to his biography. Assumed office: March 16, 2017 Prior job: Indiana senator, congressman Fun fact: Coats served as ambassador to Germany beginning in 2001, appointed just days before the 9-11 terrorist attacks. Mick Mulvaney is the director of the Office of Management and Budget. Trump also appointed Mulvaney to lead the Consumer Financial Protection Bureau after its leader quit in November 2017. Assumed office: February 16, 2017 Prior job: South Carolina congressman Fun fact: Mulvaney and his wife are the parents of triplets. After Mike Pompeo was sworn in as secretary of state, Gina Haspel assumed the role as acting CIA director. She was sworn in on May 21, 2018. Assumed office: May 21, 2018 Prior job: Deputy CIA director Fun fact: Haspel is the first woman to lead the CIA. Andrew Wheeler was tapped to replace Scott Pruitt as the 14th administrator of the U.S. Environmental Protection Agency in an interim role. Assumed office: July 9, 2018 Prior job: Deputy administrator of the EPA Fun fact: Wheeler worked at the EPA in the early 1990s and was staff chief of the Senate Environment Committee before becoming coal industry lobbyist.",
      "date": "July 12",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Trump speaks at CPAC -- live blog",
      "url": "https://www.foxnews.com/politics/trump-speaks-at-cpac-live-blog",
      "subtitle": "Trump speaks at CPAC -- live blog",
      "author": "",
      "content": "President Trump speaks at the Conservative Political Action Conference (CPAC) Friday, and touched on the topics of gun reform, immigration and sanctions against North Korea. Other members of Trump's Cabinet have already appeared at the annual conference, including Vice President Pence, Secretary of Labor Alex Acosta and Secretary of Education Betsy DeVos. Foreign conservative politicians, like French politician Marion Maréchal-Le Pen and ex-UKIP leader Nigel Farage, are also on the CPAC agenda. The political conference is being hosted at the Gaylord National Resort & Convention Center in National Harbor, Maryland.",
      "date": "February 23, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "MSNBC analyst makes bizarre claim that Mnuchin 'basically' said 'I hate black people' with Harriet Tubman decision",
      "url": "https://www.foxnews.com/politics/steve-mnuchin-basically-said-i-hate-black-people-msnbc-analyst",
      "subtitle": "MSNBC analyst makes bizarre claim that Mnuchin 'basically' said 'I hate black people' with Harriet Tubman decision",
      "author": "Sam Dorman",
      "content": " MSNBC contributor Jason Johnson took shots at two of President Trump's officials on Sunday, calling one sexist and the other racist. Johnson argued that both Housing and Urban Development Secretary Ben Carson and Treasury Secretary Steve Mnuchin were \"incompetent\" leaders whom Rep. Ayanna Presley \"took out.\" \"Who I think won the week, not only [through] Ben Carson but also Mnuchin. And that is [Rep.] Ayanna Presley. Ayanna Pressley basically took out two of the most incompetent -- the only other person that she didn't take out this week was [Education Secretary] Betsy DeVos who I think is the third of the Three Amigos of incompetence in this administration,\" he said. His comments came after a hearing in which Pressley, D-Mass., questioned Carson on the state of public housing. Carson, for some, didn't give a satisfactory answer. HUD SECRETARY BEN CARSON RESPONDS TO CALLS FOR RESIGNATION \"She also got Ben Carson to reveal once again that he's not only incompetent -- he is not only basically asleep three-quarters of the time when he's doing his job -- but he's also a sexist fool,\" Johnson said on MSNBC's \"AM Joy.\" He also took aim at Mnuchin for postponing the release of a $20 bill design featuring Underground Railroad and anti-slavery icon Harriet Tubman. \"She not only got Mnuchin basically to say on camera, like, 'I hate black people -- you're not going to get any Tubmans in 2020,'\" he said, before mentioning Carson. Carson received criticism from Rep. Ilhan Omar, D-Minn., who joked that the HUD secretary wanted to sleep during the hearing. Carson fired back by commenting on how much endurance he had as a surgeon. CLICK HERE TO GET THE FOX NEWS APP \"Since you brought it up... I know what it's like to actually be sleepy, especially after 18-hour surgeries and operating on babies in the womb,\" he tweeted \"I hope @IlhanMN knows I care about all people, even those she doesn't recognize as having a right to life.\"",
      "date": "May 28",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Trump backs away from Special Olympics funding cut",
      "url": "https://www.foxnews.com/politics/trump-backs-away-from-special-olympics-funding-cut",
      "subtitle": "Trump backs away from Special Olympics funding cut",
      "author": "Frank Miles",
      "content": " After days of controversy and criticism, President Trump said he is backing off a budget request that would have cut funding for the Special Olympics. Trump told reporters at the White House on Thursday, “I’ve overridden my people for funding the Special Olympics.” The president added: “I’ve been to the Special Olympics. I think it’s incredible.” The Trump administration’s education budget proposal called for the elimination of $17.6 million for the Special Olympics, roughly 10 percent of the group’s overall revenue. “We express our gratitude to President Trump for reauthorizing funding for Special Olympics school-based programming. He joins a long history of over 50 years of United States presidents and members of Congress on both sides of the aisle in their support of Special Olympics and the work we do in communities throughout the country,” the organization said in a statement after Trump’s announcement. “This is a nonpartisan issue and we are proud of our work to create inclusion in schools and among young people.\" Trump officials previously called for the elimination of Special Olympics funding in their budget proposal for 2019, but Congress rejected the idea. Lawmakers from both parties said they would reject it again for 2020. CLICK HERE TO GET THE FOX NEWS APP Democrats pressed Education Secretary Betsy DeVos on the topic during a Senate budget hearing Thursday, just days after House Democrats grilled her on the proposal and sparked criticism online. In a heated exchange with Sen. Dick Durbin, D-Ill., DeVos said she “wasn’t personally involved” in pushing for the cut, but she defended it as her agency seeks to pare $7 billion from the 2020 budget. The Special Olympics provides both training and competition for children and adults with disabilities, with partners around the globe. The Associated Press contributed to this report.",
      "date": "March 28",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Rep. Alexandria Ocasio-Cortez compares GOP to Dwight Schrute",
      "url": "https://www.foxnews.com/politics/aoc-compares-gop-to-dwight-schrute",
      "subtitle": "Rep. Alexandria Ocasio-Cortez compares GOP to Dwight Schrute",
      "author": "Ryan Gaydos",
      "content": " Bears, beets and … the GOP? Rep. Alexandria Ocasio-Cortez, D-N.Y., compared the Republican Party to one of the most well-known television characters over the last decade: Dwight Schrute from NBC’s “The Office.” Ocasio-Cortez likened the GOP to the character because the party has a “technique” to take “dry humor” and “sarcasm” literally and fact check it, she tweeted Sunday. AOC HITS THE ECONOMIST FOR LINKING CELIBACY TO 'FEMALE EMPOWERMENT' “This is a technique of the GOP, to take dry humor + sarcasm literally and 'fact check” it,' the freshman Congresswoman tweeted. Like the ‘world ending in 12 years’ thing, you’d have to have the social intelligence of a sea sponge to think it’s literal. But the GOP is basically Dwight from The Office so who knows.” The comparison came in response to criticism for her explanation about taxing the rich. CLICK HERE TO GET THE FOX NEWS APP “When we say ‘tax the rich,’ we mean nesting-doll yacht rich. For-profit prison rich. Betsy DeVos, student-loan-shark rich,” she tweeted, adding “Because THAT kind of rich is simply not good for society, & it’s like 10 people.”",
      "date": "May 13",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Trump mulls backing Justin Amash primary challenger: report",
      "url": "https://www.foxnews.com/politics/trump-mulls-backing-justin-amash-primary-challenger-report",
      "subtitle": "Trump mulls backing Justin Amash primary challenger: report",
      "author": "Brie Stimson",
      "content": " President Trump has reportedly discussed the possibility of backing a primary challenger to Republican Rep. Justin Amash who came out in favor of impeaching the president over the Mueller Report’s findings weeks ago. Trump has mulled potential support of challenger State Rep. Jim Lower with several people, including Vice President Mike Pence and North Carolina Rep. Mark Meadows. Lower has a 16-point lead in a recent poll, Politico reported. JUSTIN AMASH GONE FROM HOUSE FREEDOM CAUCUS AFTER SAYING TRUMP'S CONDUCT WAS 'IMPEACHABLE' On Monday, Amash and Meadows made a mutual decision he would leave the House Freedom Caucus, which they co-founded, because he didn’t want to be a “distraction.” Betsy DeVos’ family, who are one of the richest and most influential in Michigan, decided to end their years-long support of Amash just two weeks ago and their decision could influence other donors to leave the Michigan representative, according to Politico. Amash has been meticulous and vocal in laying out his case for impeachment, calling some of Trump’s actions “inherently corrupt.” The president, in return, has derided Amash as a “loser” and a “lightweight.” CLICK HERE TO GET THE FOX NEWS APP Neither the White House nor Amash have commented on the report.",
      "date": "June 13",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Investigation underway after Education Department employee's 'figurines and pictures' damaged",
      "url": "https://www.foxnews.com/politics/devos-calls-for-probe-after-black-employees-office-reportedly-vandalized-at-education-dept",
      "subtitle": "Investigation underway after Education Department employee's 'figurines and pictures' damaged",
      "author": "Alex Pappas",
      "content": " The Department of Education confirmed Friday that authorities are investigating vandalism of an employee’s office. “We can confirm there was an incident involving an employee’s personal belongings on the third floor,” spokeswoman Angela Morabito said in a statement, adding that Education Secretary Betsy DeVos referred the matter to Federal Protective Services (FPS) \"for a comprehensive investigation.\" TRUMP SIGNS EXECUTIVE ORDER CANCELLING STUDENT LOAN DEBT FOR DISABLED VETERANS FPS spokesman Rob Sperling said an employee's personal items -- “figurines and pictures” – were damaged at about noon on Tuesday. “No reported suspects at this time,” Sperling added. “No one was injured and the employee was absent when the incident occurred.” Earlier Friday, NBC News reported that department employees are concerned the incident could have been racially motivated. According to the story, “African art figurines were found beheaded, with their limbs removed, and a school desegregation poster was damaged.” The report said the incident took place at the department’s Office of Elementary and Secondary Education. The NBC report added that the employee is an African-American woman who works to provide “diversity and inclusion training” to department staffers. Neither the Department of Education or Federal Protective Services would comment on the nature of the damage or give details about the affected employee. FPS said the incident was still under investigation. CLICK HERE TO GET THE FOX NEWS APP \"Because this is an ongoing law-enforcement matter, it is inappropriate for us to comment any further on specifics,\" said Morabito, who added that DeVos has taken steps to encourage inclusion at the department. “For your awareness, the diversity change agent program at the Department trains employees involved in the program to foster a more inclusive workplace,\" she said, \"and Secretary DeVos has strengthened it since taking office to ensure a strong culture of inclusion at the Department.\" Fox News’ Ashley Cozzolino contributed to this report.",
      "date": "August 23",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Krauthammer: Trump's pick for Education Secretary shows 'he is serious about school choice'",
      "url": "https://www.foxnews.com/politics/krauthammer-trumps-pick-for-education-secretary-shows-he-is-serious-about-school-choice",
      "subtitle": "Krauthammer: Trump's pick for Education Secretary shows 'he is serious about school choice'",
      "author": "",
      "content": "Syndicated columnist Charles Krauthammer said Wednesday on “Special Report with Bret Baier” that by picking Betsy Devos as Education Secretary, \"this is Donald Trump's way of saying that he is serious about school choice.  Republicans talked about it, have talked about it for 30 years.\" But, he said, the American Federation of Teacher's decision to condemn the President-elects selection for Education Secretary only shows that they don't really care about the public interest and are only concerned about themselves and not the public. \"The American federation of teachers is probably the single most reactionary organization in American life,\" he said. \"They have condemned generations, of particularly inner city students to really blighted lives as a result of the fact that as a monopoly that they provided the most exorable education and they look after themselves, which is what unions do.\" \"Their pretense to be acting in the public interest is extremely hollow and this, I think, is a tremendous opportunity because it would make a huge difference in the lives of inner city students,\" he added. Krauthammer said that picking Devos would \"be an opportunity to demonstrate that conservative ideas can work if implemented and I think it showed seriousness about policy, which has not been a strong point for the President-elect.\"",
      "date": "November 23, 2016",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Single, immigrant mother loves Trump's pick for Ed. Department",
      "url": "https://www.foxnews.com/politics/single-immigrant-mother-loves-trumps-pick-for-ed-department",
      "subtitle": "Single, immigrant mother loves Trump's pick for Ed. Department",
      "author": "",
      "content": "While the Left and teachers' unions are up in arms over President-elect Trump's selection of Betsy DeVos to be secretary of education, one single mother who immigrated to the United States is defending the pick. In a letter to the editor in the Arizona Republic, Maria Salazar writes, \"DeVos' work helped low-income Arizona children access tax-credit scholarships. Nydia [Salazar's daughter] was able to attend a college-prep high school, graduate this year with honors and go on to college.\" DeVos was chair of the American Federation for Children, a pro-school choice group. She's also financially supported several other school choice organizations. Salazar immigrated to the U.S. from Peru. Her letter refers to individual income tax credits that Arizona gives to those who donate to nonprofit groups that give scholarships to students in need. As of the 2014-15 school year, 16,493 students got scholarships thanks to the tax credits. Read more on WashingtonExaminer.com",
      "date": "January 6, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Republicans push back on Trump's pick for Education secretary",
      "url": "https://www.foxnews.com/politics/republicans-push-back-on-trumps-pick-for-education-secretary",
      "subtitle": "Republicans push back on Trump's pick for Education secretary",
      "author": "Barnini Chakraborty",
      "content": " In back-to-back speeches from the Senate floor, a pair of Republican senators on Wednesday broke rank and said they’d oppose the nomination of Betsy DeVos as Education secretary. GOP Sens. Susan Collins of Maine and Alaska’s Lisa Murkowski are the first Republicans to come out against one of President Trump’s Cabinet picks. “I was trying to get to yes, I couldn’t,” Murkowski said. Collins called DeVos “a product of her experience.” “She appears to view education through the lens of her experience promoting alternatives to public school education in Detroit and other cities,” Collins said. Despite the Republican pushback, White House press secretary Sean Spicer expressed confidence - “100 percent” - that DeVos  would be confirmed and added she was “unbelievably qualified” for the post. Senate Majority Leader Mitch McConnell’s office told Fox News that they aren’t worried about her confirmation. If all of the other GOP senators support DeVos- as expected - and all Democrats oppose the nomination, DeVos would end up with a 50-50 vote in the Senate. If that happens, it would be up to Vice President Mike Pence to break the tie. DeVos, a billionaire charter school advocate, has emerged as a polarizing figure. The wealthy Republican donor has been denounced by Democrats – and now two Republicans - who have slammed her credentials. DeVos has never worked in the public school system nor has she sent her children to public school. Controversy surrounding DeVos increased Monday after she was accused of lifting several sentences or phrases from sources – including one from a top Obama administration civil rights official - without attribution in her written responses to questions from lawmakers on the Senate Health, Education, Labor and Pensions Committee. On Tuesday, the Senate committee voted along party lines to send her confirmation to the full Senate for final approval. A full Senate vote could come early next week.",
      "date": "February 1, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Pence could play historic role to break deadlock on Education secretary pick",
      "url": "https://www.foxnews.com/politics/pence-could-play-historic-role-to-break-deadlock-on-education-secretary-pick",
      "subtitle": "Pence could play historic role to break deadlock on Education secretary pick",
      "author": "",
      "content": "Betsy DeVos cleared a major hurdle in the Senate Friday in her bid to become the next Education secretary – but likely will need Vice President Pence’s help getting over the finish line next week. The billionaire Republican donor and school choice activist has emerged as one of President Trump’s most controversial Cabinet nominees, with two Republican senators having announced they will join Democrats in opposition on the final vote. Both those senators – Susan Collins of Maine and Lisa Murkowski of Alaska – went along with advancing her nomination early Friday morning by voting to end debate. The 52-48 vote was along party lines. But multiple Senate sources tell Fox News they expect the final confirmation vote, coming as early as Monday, to split 50-50 – with Collins, Murkowski and all 48 Democratic senators voting against DeVos. This would put the pressure on Pence to cast a historic tie-breaking vote. DeVos supporters indeed are expecting Pence to do so, giving the nominee the necessary 51 votes to win confirmation. If he does, it would mark the first time in history a vice president has voted to break a tie to confirm a Cabinet officer. The procedural gymnastics come as the Trump Cabinet confirmation process gets increasingly tied up in a complex partisan battle, related not only to the nominees themselves but some of Trump’s more controversial executive actions and simmering resentment over the way Republicans treated nominees under the Obama administration. DeVos, though, has come under fierce criticism from labor unions, who accuse her of seeking to dismantle public education, given her history promoting charter schools. Senate Minority Leader Chuck Schumer of New York calls her \"one of the worst nominees.\" \"Ms. Devos does not deserve to be secretary of education,\" he said. At Tuesday’s Senate education committee meeting on the nomination, Republican Chairman Lamar Alexander chided his Democratic colleagues. “I believe their concerns are misplaced,” he said, arguing DeVos’ stance on the role of the federal government in local school systems aligns with what an overwhelming majority of senators voted for in replacing the controversial No Child Left Behind law in 2015. The Tennessee senator urged colleagues to let the new president “have his Cabinet choice.” A tie-breaking vote by the vice president would be rare on any matter, let alone a Cabinet pick. The VP has not cast a tie-breaking vote at all in almost nine years. Then-Vice President Biden did not cast any such votes; then-Vice President Cheney was the last to break a tie, in a budget resolution vote in March 2008. Fox News’ Chad Pergram and The Associated Press contributed to this report.",
      "date": "February 3, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Transgender families press education secretary on rights",
      "url": "https://www.foxnews.com/politics/transgender-families-press-education-secretary-on-rights",
      "subtitle": "Transgender families press education secretary on rights",
      "author": "",
      "content": "WASHINGTON – Education Secretary Betsy DeVos watched a transgender girl eat apple sauce and draw and listened to another student's emotional story of feeling marginalized at school, as activists pressed DeVos to make good on her promise to protect all students. Parents and activists who met with DeVos on Wednesday said they thought she was moved by their stories, but they still left with little hope that she would be a strong advocate for transgender children. The meeting at the Education Department came two weeks after the Trump administration rescinded Obama-era guidance that instructed schools to let students use bathrooms in line with their stated gender identity, not their assigned gender at birth. The decision was strongly condemned by civil rights groups, who said that it would harm already highly vulnerable students, but it was applauded by conservatives, who said the guidelines violated the safety and privacy of all other students. Attending the meeting were Ellie Ford, a 5-year-old transgender girl, and high school student Grace Dolan-Sandrino, who told DeVos the middle school she attended did not let her use the girls' bathroom — as the Obama guidance was not in place then. SUPREME COURT RETURNS CASE ON TRANSGENDER BATHROOM ACCESS TO LOWER COURT DeVos would not commit to any specific actions to help protect students like Grace and Ellie, the parents said. One parent at the meeting said she had lost a transgender child to suicide. Grace's mother, Karen Dolan, said of the education secretary: \"She sat there and listened to our stories through our tears and at times she seemed to appear visibly moved, but she didn't react.\" DeVos agreed that there were \"thousands and thousands\" of transgender students across the country and that children are born that way, according to Dolan, who lives in Washington's Maryland suburbs. \"There is one thing between increasing your understanding and having your heart moved for an hour and then out of her position of power either acting to protect transgender and gender nonconforming children or acting in a way that will make their lives worse,\" Dolan added. \"I haven't seen any concrete action that would give me any reason to be hopeful.\" Grace, 16, who now goes to an inclusive high school where she can use the girls' bathroom, said that she told DeVos that her decision to scrap the guidance was \"an extremely cruel thing to do.\" She said that being in an unwelcoming environment dramatically increases a transgender child's chances of developing depression or committing suicide. \"It is not fair for them to grow up with their human rights being denied,\" Grace said in an interview with The Associated Press. \"This is beyond bathrooms; this is about our right as transgender people, as humans to exist, to simply exist.\" Vanessa Ford, Ellie's mother and a resident of the District of Columbia, said that the Education Department already has an existing document, published on its website, that outlines best practices that some schools have used with regard to transgender students. She urged DeVos to promote the document publicly and urge schools to use it. Mara Keisling, executive director of the National Center for Transgender Equality, said that she was grateful to DeVos for devoting two hours of her time to the meeting. \"I think decision makers should meet the people they are deciding about.\" At the same time Keisling said rescinding the bathroom guidance was \"extremely harmful\" and urged DeVos to take steps to undo the harm and increase protections for transgender children. DeVos said she was glad to meet with transgender families and hopes to continue the dialogue. \"Every school and every school leader has a moral responsibility to protect all students and ensure every child is respected and can learn in an accepting environment,\" DeVos said in a statement. \"I remain committed to advocating for and fighting on behalf of all students.\"",
      "date": "March 9, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Trump names Haley, DeVos to cabinet; Carson says he's 'thinking about' offer 'on the table'",
      "url": "https://www.foxnews.com/politics/trump-names-haley-devos-to-cabinet-carson-says-hes-thinking-about-offer-on-the-table",
      "subtitle": "Trump names Haley, DeVos to cabinet; Carson says he's 'thinking about' offer 'on the table'",
      "author": "",
      "content": "Just in time for Thanksgiving, President-elect Donald Trump continued stocking his cabinet on Wednesday, naming two new nominees as his one-time rival Dr. Ben Carson said he is still \"thinking about\" options to serve in the new administration. In an exclusive interview on \"The Kelly File,\" Carson, who is rumored to head the department of Housing and Urban Development, said \"the offer was on the table,\" but that news should come out \"in the next few days.\" \"There are a lot of things that were put on the table, and I am thinking about them,\" Carson said, referring to if he plans to serve in a role in or outside the government. Earlier on Wednesday, Trump announced the choices of South Carolina Gov. Nikki Haley to be U.S. ambassador to the United Nations and charter school advocate Betsy DeVos to lead the Department of Education. All three cabinet positions require Senate confirmation before they become official. The retired pediatric neurosurgeon, who had previously been rumored to be a contender for a job heading Veteran’s Affairs, Education or Health and Human Services, could appear at first glance as an odd choice for HUD. However, Carson wrote and spoke about the department and issues affected by its actions numerous times during his time as a primary candidate, and he also addressed some of what may soon face him in a Wednesday Facebook post that hinted at a HUD job offer from Trump. “After serious discussions with the Trump transition team, I feel that I can make a significant contribution particularly to making our inner cities great for everyone,” Carson wrote. “We have much work to do in strengthening every aspect of our nation and ensuring that both our physical infrastructure and our spiritual infrastructure is solid. An announcement is forthcoming about my role in helping to make America great again.” On Tuesday, Carson told Fox News Channel’s “Your World with Neil Cavuto” that the HUD position was \"one of the offers [from Trump] that is on the table.\" \"Our inner cities are in terrible shape,\" Carson said. \"And they definitely need some real attention. There have been so many promises made over the last several decades and nothing has been done, so it certainly is something that has been a long-term interest of mine.\" Minutes after Carson left a meeting with Trump at Trump Tower Tuesday, the billionaire mogul tweeted: “I am seriously considering Dr. Ben Carson as the head of HUD. I’ve gotten to know him well—he’s a greatly talented person who loves people!” Carson ran against Trump during the Republican primary battle. But after he dropped out of the White House race in March, the subdued doctor quickly endorsed the boisterous businessman and became one of Trump’s most visible surrogates. The path to a secretary nomination was far different for Haley, who often critiqued Trump during the campaign, though she eventually – and somewhat begrudgingly – said she would vote for him for president. \"This is no longer a choice for me on personalities because I’m not a fan of either one,\" Haley said in October. \"What it is about is policy.\" Born in South Carolina and of Indian descent, Haley is the third Asian-American to serve as U.S. governor. She drew praise for her handling of the aftermath of a racially-charged mass shooting at a black Charleston church and also presided over the removal of the Confederate flag from the South Carolina state house grounds. Haley was beginning to earn buzz as a possible vice presidential pick in January when she delivered the Republican response to President Obama's final State of the Union address. Parts of her speech, however, were viewed as a rebuke not only of Obama, but also of Trump. But her past criticism – and support of Sens. Marco Rubio and Ted Cruz – were apparently set to the side during a Thursday meeting with Trump. A Trump spokesperson said Wednesday that Trump and Haley had \"natural chemistry\" and her selection as UN ambassador was an easy choice. DeVos, from Michigan, is a longtime advocate for charter schools and school vouchers. She currently leads the advocacy group, American Federation for Children, and sits on the board of the Jeb Bush-led Foundation for Excellence in Education. Bush, another fierce critic of Trump prior to the election, praised the decision to choose DeVos. “The status quo in education is not acceptable,\" DeVos said in a Wednesday statement. The DeVos family has been active in Republican politics for decades, especially as donors to GOP candidates and the Republican Party. DeVos' husband, Dick, is an heir to the Amway fortune and a former president of the company. The couple gave $22.5 million to the Kennedy Center for the Performing Arts in Washington in 2010, at the time the largest private donation in the center's history. Hours before the DeVos pick was announced, conservative policy leader Frank Cannon, president of American Principles Project, called her \"an establishment, pro-Common Core secretary of education.\" Asked about DeVos' support for the Common Core standards, Trump spokesman Jason Miller noted that \"the president-elect has been consistent and very clear in his opposition to Common Core.\" \"Anybody joining the administration is signing on to the president-elect's platform and vision for moving America forward,\" Miller said.",
      "date": "November 23, 2016",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Liberal groups accused of hypocrisy over call for recusals in DeVos confirmation",
      "url": "https://www.foxnews.com/politics/liberal-groups-accused-of-hypocrisy-over-call-for-recusals-in-devos-confirmation",
      "subtitle": "Liberal groups accused of hypocrisy over call for recusals in DeVos confirmation",
      "author": "Adam Shaw",
      "content": " Liberal groups are calling on senators who got contributions from President-elect Donald Trump's education secretary pick to recuse themselves from voting on her confirmation – drawing accusations of hypocrisy from Republicans who note Democrats never recused themselves in similar situations. In a letter to 21 Republican senators, to whom nominee Betsy DeVos has given almost $1 million in campaign donations, Generation Progress and other left-wing groups called for them to recuse themselves “or risk imperiling the legitimacy of DeVos’ confirmation.” DeVos, a strong advocate for school choice, has her Senate confirmation hearing scheduled for Tuesday. “In addition to these individual campaign contributions, DeVos and her family contributed $2.25 million during the fall campaign to the Senate Leadership Fund, and have also given $900,000 to the National Republican Senatorial Committee. That comes out to a $4 million bid to influence you,” the letter says. Generation Progress is an arm of the Center for American Progress. But Republicans are pushing back, arguing that previous Obama Cabinet picks had donated to Democratic politicians and causes, and Democrats cast confirmation votes anyway. Penny Pritzker, Obama’s now-Commerce secretary, was a bundler for Obama’s 2012 re-election bid, collecting more than $1 million in campaign donations. The Wall Street Journal reported she also raised more than $250,000 for him in 2008, when she served as finance chair of his campaign. Pritzker had also donated roughly $20,000 to at least 20 of the 51 Democrats who voted on her confirmation on June 25, 2013. In 2009, she also made a $28,340 donation to the Democratic Senatorial Campaign Committee, according to Open Secrets. Sally Jewell, Obama’s now-Interior secretary, had also donated to a number of Democratic senators who voted on her 2013 confirmation, including $4,250 to Sen. Patty Murray, D-Wash. – who introduced her nomination. Republicans denounced what they saw as a “shameless” double-standard. \"The hypocrisy of Democrats and their liberal allies is truly shameless. Where was their outrage when Democrats voted for Obama cabinet nominees who donated to his and their campaigns?\" Raj Shah, a spokesman for the Republican National Committee, told FoxNews.com. While the amounts donated by Pritzker and Jewell don’t hit the same numbers as DeVos’ donations, her supporters describe the situations as similar. “If you accept the faulty premise that political contributions create a conflict of interest, then any amount is problematic,” Ed Patru, spokesman for Friends of Betsy DeVos, told The Washington Post. “I don’t remember a single Democrat, citing conflicts of interest, recusing themselves from a vote on billionaires like Penny Pritzker.”",
      "date": "January 16, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Education Department unveils new Title IX guidance for campus sexual assault: Here's what would change",
      "url": "https://www.foxnews.com/politics/education-department-unveils-new-title-ix-guidance-for-campus-sexual-assault-heres-what-would-change",
      "subtitle": "Education Department unveils new Title IX guidance for campus sexual assault: Here's what would change",
      "author": "Kaitlyn Schallhorn",
      "content": " Education Secretary Betsy DeVos unveiled the long-awaited overhaul to the guidance for how schools handle complaints of sexual misconduct, adding more protections for those who have been accused of assault and harassment. The proposed Title IX changes would limit the definition of sexual harassment and allow for the cross-examination of the accused by the accuser’s defense team. The proposal also seeks to “clarify that in responding to any claim of sex discrimination under Title IX, recipients are not required to deprive an individual of rights that would be otherwise guaranteed under the U.S. Constitution; prohibit the Department’s Office for Civil Rights (OCR) from requiring a recipient to pay money damages as a remedy for a violation of any Title IX regulation; and eliminate the requirement that religious institutions submit a written statement to qualify for the Title IX religious exemption.\" While conservatives have heralded the changes, victims’ rights advocacy groups have slammed the proposed regulations. “DeVos is making plain with these unlawful rules that she is turning her back on survivors. The results of this rule are clear: Fewer will report their assaults and harassment. Schools will be more dangerous. And, more survivors will be denied their legal right to equal access to education after experiencing sexual violence,” Jess Davidson, the interim director of End Rape on Campus, said in a statement. The Democratic National Committee accused the Trump administration of delivering “one devastating blow after another to women and victims of sexual misconduct.” But DeVos, one of the more controversial figures in President Trump’s Cabinet, said her focus is “on ensuring that every student can learn in a safe and nurturing environment.” “Every survivor of sexual violence must be taken seriously, and every student accused of sexual misconduct must know that guilt is not predetermined,” she said in a statement. “We can, and must, condemn sexual violence and punish those who perpetrate it, while ensuring a fair grievance process. Those are not mutually exclusive ideas.” Last year, DeVos rescinded a set of 2011 rules created during the Obama administration that guided schools on how to handle complaints. Advocates for accused students said those regulations tipped the scales in favor of accusers, and some college leaders complained the rules were too complex and could be overly burdensome. The Title IX law, enacted in 1972, forbids discrimination based on sex in education. It was once seen as a measure to ensure equity in college sports, but President Barack Obama’s Department of Education’s Office for Civil Rights issued several letters in 2011 directing college administrations on how to tackle the nation’s ongoing campus rape epidemic – and prove on paper they were doing so – or risk losing federal funding. Since then, many colleges saw an uptick in lawsuits alleging mishandling of assault complaints. According to RAINN, the nation’s largest anti-sexual violence organization, 11.2 percent of college students experience rape or sexual assault. Read on for a look at what could change with DeVos’ new plan. The proposed changes narrow the definition of what exactly constitutes sexual harassment. DEVOS TO ROLL BACK OBAMA-ERA TITLE IX REGULATIONS DEEMED UNFAIR TO THE 'ACCUSED' Under the new regulations, it would be defined as: “unwelcome sexual conduct; or unwelcome conduct on the basis of sex that is so severe, pervasive, and objectively offensive that it effectively denies a person equal access to the recipient’s education program or activity.” For sexual assault cases in higher education, the accuser has the right to cross-examine the accused and witnesses through an “advisor” or attorney during a live hearing, according to the proposal. During the cross-examination, questions about either party’s sexual history cannot be asked, in line with rape shield protections which guards victims against “invasion of privacy, potential embarrassment and stereotyping,” according to the proposal. Either party may also request to be separated, placed different rooms, with a video feed for the live hearing. DEVOS CONSIDERING ALLOWING STATES TO USE FEDERAL FUNDS TO BUY GUNS: REPORT “The proposed regulations thereby provide the benefits of cross-examination while avoiding any unnecessary trauma that could arise from personal confrontation between the complainant and the respondent,” the proposal states. For elementary and secondary schools, cross-examination is allowed but not required due to the young ages of those involved. The plan would only hold schools responsible for investigating complaints if the incident occurred on campus or another area overseen by the school and only if they are reported to certain campus officials with the authority to take action. However, it does allow for schools to offer support services or intervene with a student conduct proceeding if a reported incident happened outside of that scope. The Education Department would also adopt the policy that a school “acts with deliberate indifference only when it responds to sexual harassment in a manner that is ‘clearly unreasonable in light of the known circumstances.’” The proposal requires schools to provide free “supportive measures” to the accused or accuser – even if a formal complaint hasn’t been filed. These services, which are meant to be confidential, include counseling, changes to class or work schedules, extensions on deadlines, campus escort services, changes to housing, leave of absence or increased security. US COLLEGES REFUSE TO EASE SEX ASSAULT RULES DESPITE SLEW OF LAWSUITS FILED BY ACCUSED A school will be “given a safe harbor from finding of deliberate indifference” by the Education Department if it offers one of those services to someone after a formal complaint, the proposal said. The proposal would ensure schools establish a “presumption that the respondent is not responsible for the alleged conduct until a determination regarding responsibility is made at the conclusion of the grievance process.” Under the Obama administration's guidance, schools were told to use a “preponderance of the evidence” standard, meaning an allegation “is more likely than not” true. Under the proposal, schools would adopt a “clear and convincing” standard, meaning the claim is highly probable. Fox News' Caleb Parke and The Associated Press contributed to this report.",
      "date": "November 16, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "DeVos foes in furious push to defeat nomination, still one vote short",
      "url": "https://www.foxnews.com/politics/devos-foes-in-furious-push-to-defeat-nomination-still-one-vote-short",
      "subtitle": "DeVos foes in furious push to defeat nomination, still one vote short",
      "author": "Joseph Weber",
      "content": " Teachers unions, advocacy groups and others are jamming Senate phone lines, funding TV ads and rallying on the ground to stop Betsy DeVos from becoming President Trump’s secretary of Education. But their efforts, at least for now, appear to be coming up one vote short. With her final Senate confirmation vote set for Tuesday at noon, the chamber still seems locked in a 50-50 split on the nomination. If that happens, Vice President Pence is expected to cast a historic, tie-breaking vote to confirm her. This scenario has DeVos' critics going into overdrive in a bid to peel off one more Republican to vote nay. “We are trying to do everything we can to persuade just one more Republican to join us,” Sen. Patty Murray, D-Wash., said Monday. “Double down on your advocacy. … She’s spent her career trying to destroy public schools.” The Democrats' appeals come after GOP Sens. Susan Collins, of Maine, and Lisa Murkowski, of Alaska, announced their opposition last week to DeVos, the school choice advocate and wealthy Michigan political donor. Presuming all 48 Democratic senators oppose DeVos, this brings the tally to 50-50. Several of the major groups rallying against DeVos, including the American Federation of Teachers union, declined on Monday to name which of the remaining Republican senators they are targeting. Senate Democrats acknowledged the challenge ahead, as they took the floor Monday planning an all-night session of speeches railing against her nomination. While teachers unions and others say DeVos’ support for voucher programs and other school-choice efforts will hurt public education, backers say her plans will provide more opportunities to families and an alternative to public schools, which in some parts of the country are showing little progress improving student proficiency in core subjects. Pence, speaking on \"Fox News Sunday,\" predicted victory for their nominee. \"We are very confident that Betsy DeVos is going to be the secretary of Education,\" he said. \"It would be my high honor to cast the deciding tie-breaking vote on the floor of the Senate.\" Among the names mentioned early as potential targets to flip were GOP Sens. Pat Toomey, Pennsylvania; Deb Fischer, Nebraska; and Rand Paul, Kentucky. All of them, however, have publicly backed DeVos. “If you are a Republican senator who is going to vote against DeVos, you would have needed to make that clear well in advance,” David Payne, a Republican strategist and partner at Vox Global, said Monday. “No way would somebody do that on the Senate floor. That would be a massive embarrassment. Not going to happen.” Among the other major groups trying to fight the nomination are End Citizens United and Every Voice, whose strategy is largely focused on trying to get senators who have received DeVos campaign donations to recuse themselves from voting. “We’re continuing to cast a wide net with our work to pressure senators with donations from the DeVos family … to avoid any conflicts of interest,” Laura Friedenbach told Fox News on Monday. To be sure, members of Congress have reported a high volume of calls since Trump, a Republican, was elected in November. “We are seeing a heavier-than-normal amount of constituent calls,” Collins spokeswoman Annie Clark told Fox News on Monday. However, Clark, like other Capitol Hill aides, have made clear that the calls are for a variety of constituent concerns, including the future of ObamaCare and Cabinet nominations beyond DeVos, and that many are from out-of-state voters. Clark also said “an extremely high volume” of calls have come from out of state. Friedenbach also made clear that Every Voice’s efforts to expose money in politics and the critique of DeVos will continue even if she becomes Education secretary. “The after-effects of the widespread public backlash to her nomination will linger,” she said. “People are tired of a government that works best for the wealthiest among us. … Rewarding a big donor with a Cabinet position will only add fuel to the fire.” American Federation of Teachers President Randi Weingarten said Monday: “We’re seeing a massive wave of opposition to Betsy DeVos. ... We’ve never seen someone tapped for this job who is so ill informed … and who would give such preferential treatment to for-profit schools, vouchers and other strategies that actively drain funding from public schools.”",
      "date": "February 6, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "DeVos foes now claiming her policies could 'kill children,' ruin public schools",
      "url": "https://www.foxnews.com/politics/devos-foes-now-claiming-her-policies-could-kill-children-ruin-public-schools",
      "subtitle": "DeVos foes now claiming her policies could 'kill children,' ruin public schools",
      "author": "",
      "content": "‏If her critics are to be believed, Education Secretary nominee Betsy DeVos is a danger to special education, could end public schooling and has plans that “will kill children.” Think that’s hyperbole? “That is not an exaggeration in any sense,” tweeted Vanity Fair film critic Richard Lawson, who fired off a series of tweets early Tuesday arguing that DeVos’ confirmation would be deadly for “queer and other at-risk kids” – because of DeVos’ support for voucher programs. “Voucher programs will create systems in which queer kids have literally zero access to support apparatus bc they are in religious schools,” Lawson wrote. “Meaning voucher programs will lead to more suicides. Betsy DeVos’s policies will kill children.” DeVos’ nomination is set for a noon vote in the Senate on Tuesday, and, despite the defection of two Republican senators, she’s likely to be confirmed – though by the slimmest of margins. Vice President Mike Pence is expected to cast the deciding vote in his role as president of the Senate. But critics like Lawson have gone into overdrive in a bid to convince just one more senator to oppose the school choice advocate. Democrats kept the Senate in session all night into Tuesday morning protesting the DeVos nomination on the floor. “The president’s decision to ask Betsy DeVos to run the Department of Education should offend every single American man, woman, and child who has benefitted from the public education system in this country,” Senate Minority Leader Chuck Schumer said in a statement. Schumer’s warning paled in comparison to some of the vitriol aimed at DeVos from the media. “Betsy DeVos is the worst person to be around schoolbooks since Lee Harvey Oswald,” Bill Maher snarked on his “Real Time” show. The New Republic urged readers not to “normalize Betsy Devos. Her views are simply much too dangerous.” Actor-vist Mark Ruffalo appealed to Florida Sen. Marco Rubio on Twitter to be the third Republican “no” vote needed to defeat DeVos. “Come on Marco, know where you stand and actually STAND there! You got kids. They have friends. You know better,” he wrote. The United Federation of Teachers called DeVos a “danger to special education,” while disabilities writer Elizabeth Picciuto wrote a piece for The Daily Beast saying she has “a special-needs son and Betsy DeVos scares me to death.” Comedian John Fugelsang compared DeVos’ nomination to the Syrian refugee crisis. “Refugees vetted 2 yrs before allowed to reunite w/families. Betsy Devos vetted 5 mins per Senator before allowed to run America’s schools,” Fugelsang wrote on Twitter. “Westworld” and James Bond actor Jeffrey Wright has frequently blasted DeVos, including one tweet that implied Chief of Staff Reince Priebus only cared about the money DeVos has contributed to Republican political candidates. Sherrilyn Ifill, president of the NAACP Legal Defense and Educational Fund, suggested her confirmation could threaten the “existence of public education.” On Tuesday morning, White House Counselor Kellyanne Conway voiced confidence in DeVos' confirmation and defended her views on public school alternatives. \"[Democrats are] trying to humiliate and embarrass some of these nominees,\" Conway told Fox News, saying DeVos is committed to education. DeVos herself has not engaged the online critics. Her most recent tweet came on Jan. 31: “If confirmed, I look forward to fighting for quality education for all students.”",
      "date": "February 7, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "DeVos confirmed as education secretary, Pence casts historic tie-breaking vote",
      "url": "https://www.foxnews.com/politics/devos-confirmed-as-education-secretary-pence-casts-historic-tie-breaking-vote",
      "subtitle": "DeVos confirmed as education secretary, Pence casts historic tie-breaking vote",
      "author": "",
      "content": "School choice advocate Betsy DeVos was narrowly confirmed Tuesday as the next education secretary despite deep opposition from teachers unions and other groups, after Vice President Pence intervened to cast a historic tie-breaking vote. Pence’s vote marked the first time in American history a vice president has broken a tie on a Cabinet nominee’s Senate confirmation – and the first tie-breaking vote by a VP since 2008. Pence was compelled to cast the vote after two Republican senators – Susan Collins of Maine and Lisa Murkowski of Alaska – joined all 48 Senate Democrats in opposing DeVos. “The Senate being equally divided, the vice president votes in the affirmative and the nomination is confirmed,” Pence said, stepping into his role as president of the Senate in a brief appearance on Capitol Hill. With his support, DeVos was confirmed on a 51-50 vote. Devos was sworn in later by Pence in a ceremony at the vice president's ceremonial office, which he called \"the easiest vote I ever cast.\" The confirmation of the wealthy GOP donor will mark a sharp change in philosophy at the helm of federal education policy, given DeVos’ history boosting alternatives to public education. “She’s led the most effective school reform movement of the last 30 years,” Senate education committee Chairman Lamar Alexander, R-Tenn., said moments earlier on the floor, shoring up DeVos' Republican support. Democrats mounted an all-night speaking marathon railing against her nomination in the run-up to the vote, questioning her experience and ties to charter schools though their opposition combined with lobbying efforts by teachers unions were not enough to block her. \"Mrs. DeVos demonstrated a complete lack of experience in, knowledge of and support for public education. She was unable to address basic issues that any New Hampshire school board member could discuss fluently,\" said Sen. Maggie Hassan, D-N.H., whose son has cerebral palsy but studied in public schools under a federal law that guarantees access for disabled students. Several Democrats questioned DeVos' commitment to and understanding of that law. But Republicans accused Democrats of slow-walking DeVos and other qualified nominees to placate liberal base voters who still haven't come to terms with President Trump's election. \"[Democrats are] trying to humiliate and embarrass some of these nominees,\" White House Counselor Kellyanne Conway told Fox News earlier Tuesday, saying DeVos is committed to education. \"It seems this gridlock and opposition has far less to do with the nominees actually before us than the man who nominated them,\" said Senate Majority Leader Mitch McConnell, R-Ky. \"Enough is enough.\" In addition to DeVos, Republicans hope to confirm a series of other controversial nominees this week. They successfully broke a Democratic filibuster Tuesday afternoon on the nomination of Sen. Jeff Sessions for attorney general. The 52-47 vote sets up the Alabama Republican for likely confirmation Wednesday evening. The Senate Veterans Affairs' Committee also endorsed physician David Shulkin to be veterans affairs secretary, sending his nomination to the full Senate. Also awaiting floor votes are GOP Rep. Tom Price of Georgia for health secretary and financier Steven Mnuchin for treasury secretary. In each case Democrats intend to use the maximum time allowed under the Senate's arcane rules to debate the nominations, which may result in a late-night votes this week and delay Mnuchin's approval until Saturday. Republicans complain that previous presidents have been able to put their Cabinets in place more quickly. Democrats say it's Trump's fault because many of his nominees have complicated financial arrangements and ethical entanglements they claim they have not had enough time to dissect. The Associated Press contributed to this report.",
      "date": "February 7, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Trump education pick DeVos promotes school choice at confirmation hearing",
      "url": "https://www.foxnews.com/politics/trump-education-pick-devos-promotes-school-choice-at-confirmation-hearing",
      "subtitle": "Trump education pick DeVos promotes school choice at confirmation hearing",
      "author": "",
      "content": "Education secretary nominee Betsy DeVos voiced strong support for public school alternatives at her confirmation hearing Tuesday, telling senators that \"parents no longer believe that a one-size-fits-all model of learning fits the needs of every child.\" DeVos told the Senate Health, Education and Pensions Committe that she would be \"a strong advocate for great public schools\" if confirmed, but added that \"if a school is troubled, or unsafe, or not a good fit for a child ... we should support a parent's right to enroll their child in a high-quality alternative.\" DeVos, 59, also said she will seek to address rising higher education costs and massive student debt, but also advance trade and vocational schools as well as community colleges because \"craftsmanship is not a fallback — but a noble pursuit.\" President-elect Donald Trump's nomination of DeVos to lead the Department of Education was harshly criticized by teacher's unions, who have claimed that DeVos wants to undermine the public education system, which provides instruction to more than 90 percent of the country's students. In his opening statement, committee chairman Lamar Alexander, R-Tenn., himself a former secretary of education, said DeVos is \"on our children's side.\" \"I believe she is in the mainstream of public opinion, and her critics are not,\" said Alexander. That praise was echoed by Sen. Tim Scott, R-S.C., who introduced DeVos to the committee by calling her \"a champion of education, and specifically a champion of education for poor kids.\" Former Connecticut Sen. Joe Lieberman also appeared before his onetime colleagues to introduce DeVos. \"We just can't accept the status quo in education anymore,\" Lieberman said. \"We need a change agent and an education reformer to be education secretary ... and that is exactly the kind of education secretary I believe Betsy DeVos can and will be.\" Sen. Patty Murray, D-Wash., the committee's ranking member, expressed concern that lawmakers had not received an ethics review for the nominee. \"I am extremely disappointed that we are moving forward with this hearing without receiving the proper paperwork from the Office of Goverment Ethics,\" Murray said. Murray also told DeVos that federal policy should be focused on strengthening public schools, \"and certainly not toward diverting taxpayer dollars to fund vouchers that don't work for unaccountable private schools.\" She asked DeVos point-blank to pledge that she would not seek to privatize public schools or take money away from them. DeVos, whose husband is the heir to the Amway marketing fortune, has for decades used the family’s influence and wealth in her home state of Michigan to advocate for charter schools and promote conservative religious values. Critics of DeVos have expressed concerns about her financial contributions and possible conflicts of interest. The nominee attempted to assuage those concerns during the question-and answer period, pledging that she \"will not be conflicted. Period.\" DeVos also said that she will take a government salary of $1 if confirmed. Asked outright by Sen. Bernie Sanders, I-Vt., if she got the job because of her family's political contributions, DeVos said: \"As a matter of fact I do think that there would be that possibility. I have worked very hard on behalf of parents and children for the last almost 30 years.\" On tuition-free public colleges and universities, DeVos said: \"I think we also have to consider the fact that there is nothing in life that is truly free. Somebody is going to pay for it.\" She skirted Sanders' question on whether she would support making child care free or much more affordable for low-income families as is the case in many countries around the world, saying only that she feels strongly about \"parents having an opportunities for child care for their children.\" \"But it's not a question of opportunity,\" Sanders fired back, raising his voice. \"It's a question of being able to afford it!\" As the hearing dragged on into its fourth hour, Democratic senators made repeated requests with Chairman Alexander to allow them to pose another round of questions to DeVos, but he refused, citing procedures at previous hearings. DeVos is expected to get enough votes in the committee and before the full Senate to be confirmed, considering she needs only a simple majority, with Republicans having 52 senators and Democrats having 48. In a letter addressed to the committee, 38 prominent education groups and teachers' organizations expressed concern that DeVos' track record bodes ill for public education. \"Over the course of her career as a major campaign contributor, soft-money donor and lobbyist, DeVos has used her considerable wealth to influence legislation and the outcomes of elections to advance policies that have undermined public education and proved harmful to many of our most vulnerable students,\" the letter said. LGBT groups also have protested Trump's choice of DeVos, saying she has funded conservative religious groups that promote what they consider to be traditional family values, including one organization that supports conversion therapy -- counseling of gay, lesbian, bisexual or transgender people with the aim of changing their sexual orientation. DeVos repeatedly disavowed any support for conversion therapy Tuesday, saying in her opening statement that \"every child in America deserves to be in a safe environment that is free from discrimination.\" Under questioning from Sen. Al Franken, D-Minn., DeVos said that \"I have never believed in\" conversion therapy and \"I believe in the innate value of every single human being.\"  Alexander later read into the record a letter of support from the Log Cabin Republicans, a Republican organization pushing for LGBT rights. DeVos supporters, meanwhile, applauded her nomination. Eva Moskowitz, CEO of Success Academy Charter Schools, said that American public education \"is in deep crisis,\" with 35 countries outranking American schools in math and 20 in reading. \"I believe Betsy DeVos has the talent, commitment and leadership capacity to revitalize our public schools and deliver the promise of opportunity that excellent education provides, and I support her nomination as U.S. secretary of education,\" Moskowitz said in a statement. DeVos has also garnered strong backing from two dozen state governors, as well as another former education secretary, William Bennett. It’s time we take a major turn in American education,” Bennett told Fox News Channel’s “Happening Now” on Tuesday. “Betsy DeVos represents a change. She is experienced in the field with children from all over the country. … She understands what the problems with education are.” The Associated Press contributed to this report.",
      "date": "January 17, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "DeVos plans Title IX changes in wake of report on campus denial of due process",
      "url": "https://www.foxnews.com/politics/devos-plans-title-ix-changes-in-wake-of-report-on-campus-denial-of-due-process",
      "subtitle": "DeVos plans Title IX changes in wake of report on campus denial of due process",
      "author": "",
      "content": "U.S. Education Secretary Betsy DeVos is set to give a major speech Thursday on Obama-era directives on campus rape in the wake of a damning report spotlighting a lack of due process rights for accused students across university campuses. DeVos is expected to make an announcement regarding Title IX, the 1972 campus gender equality law, at George Mason University in Virginia, BuzzFeed News reported. Insiders have described the event as “centered around equal opportunity and equal protection of all.” Education experts have long expected DeVos to make a move on Title IX and the Education Department 2011 directive named “A Dear Colleague Letter” that set the procedures for colleges that receive a sexual assault report. The procedures include setting how long campus sexual investigations should take, what standards of evidence should be used, and prohibiting colleges from just sending a case to police, BuzzFeed News notes. Some have criticized the directive and standards used in the prosecution of sexual assault on campus, claiming the accused students often do not receive significant protections and due process rights – turning university investigations into so-called “kangaroo courts.” DeVos has often been attacked for expressing interest in changing Title IX. During her confirmation hearing, she came under fire for having donated to a group that has been critical of how Title IX is enforced on campus, Politico reported. More recently, feminist groups criticized her for meeting with so-called men’s rights activists who opposed campus policies, the New York Times reported. The possible major changes to Title IX would follow a damning report by the Foundation for Individual Rights in Education (FIRE) that found most American universities deny due process rights to the accused. According to a first-of-its-kind report titled “Spotlight on Due Process 2017” – which looked at 53 top American universities – almost 74 percent of schools did not presume a student to be innocent until proven guilty in non-academic cases. At the same time, 85 percent of top schools in the country received the lowest grades for due process protections and 79 percent of surveyed institutions received a D or F rating for protecting the rights of a student accused of sexual misconduct. Less than half of surveyed universities, meanwhile, “require that fact-finders — the institution’s version of judge and/or jury — be impartial”, the report said. A number of Ivy League universities, for example, do not guarantee the presumption of innocence during sexual misconduct trials and rarely give the accused access to evidence or conducts a cross-examination. No universities have scored the top A score.",
      "date": "September 6, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "DeVos: Replace Obama-era rules on campus sexual assault cases with more ‘fair system’",
      "url": "https://www.foxnews.com/politics/devos-replace-obama-era-rules-on-campus-sexual-assault-cases-with-more-fair-system",
      "subtitle": "DeVos: Replace Obama-era rules on campus sexual assault cases with more ‘fair system’",
      "author": "",
      "content": "Education Secretary Betsy DeVos on Thursday called for replacing the Obama administration's rules for investigating allegations of sexual violence on campuses across the country with a more “workable, effective and fair system.” During a speech at George Mason University, DeVos announced plans to review and overhaul the way colleges and universities handle investigations. “Here is what I’ve learned: the truth is that the system established by the prior administration has failed too many students,” DeVos said. She added, “Survivors, victims of a lack of due process, and campus administrators have all told me that the current approach does a disservice to everyone involved. That’s why we must do better, because the current approach isn’t working.” DeVos said the department will seek public comment and university expertise to develop rules to replace the current policy. “We will seek public feedback and combine institutional knowledge, professional expertise, and the experiences of students to replace the current approach with a workable, effective, and fair system,” DeVos said. The Title IX law, enacted in 1972, forbids discrimination based on sex in education. It was once seen as a measure to ensure equity in college sports, but in recent years has become associated with efforts to address sexual assault and harassment at college campuses. The Obama administration reshaped how colleges handle complaints of sexual assault, setting new rules and starting hundreds of investigations into colleges accused of straying from them. Central to the debate is a 2011 department memo that laid out rules colleges must follow when responding to complaints of sexual assault from their students. The memo requires colleges to investigate complaints even if there's a separate criminal inquiry. It also established what has become a polarizing standard of evidence used to judge cases. Unlike in criminal courts, where guilt must be proved beyond a reasonable doubt, colleges judge students based on whether it's \"more likely than not\" they committed the offense. Colleges that are found to have violated Title IX rules can lose federal funding entirely, although the department has never imposed that penalty. Some advocacy groups say the Obama-era policies are flawed but worth saving. They argue the policies have protected many students and forced colleges to confront problems that were long kept quiet. On Thursday, about two dozen protesters gathered outside the auditorium where DeVos delivered her speech. DEVOS PLANS TITLE IX CHANGES IN WAKE OF REPORT ON CAMPUS DENIAL OF DUE PROCESS The protesters included women who said they were assaulted on campus and victims' advocates. \"Donald Trump supports Betsy DeVos supports perpetrators,\" read the sign of one protester. But opponents say the rules have swung the pendulum too far and pressure colleges to take hasty and heavy action against students accused of misconduct. “Every survivor of sexual misconduct must be taken seriously,” DeVos said Thursday. “Every student accused of sexual misconduct must know that guilt is not predetermined. These are non-negotiable principles.” She added: “Due process either protects everyone, or it protects no one. The notion that a school must diminish due process rights to better serve the ‘victim’ only creates more victims.” Fox News’ Alex Pappas and The Associated Press contributed to this report.",
      "date": "September 7, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Senate in all-night session as Democrats protest DeVos nomination",
      "url": "https://www.foxnews.com/politics/senate-in-all-night-session-as-democrats-protest-devos-nomination",
      "subtitle": "Senate in all-night session as Democrats protest DeVos nomination",
      "author": "",
      "content": "The Senate was in session all night Monday into Tuesday morning as members debated the nomination of Betsy DeVos to be education secretary ahead of her likely confirmation at noon. DeVos is poised to be confirmed for education secretary by the narrowest possible margin as Vice President Mike Pence is expected to break a potential deadlocked vote. DeVos, a wealthy GOP donor, has devoted herself to boosting alternatives to public education and sparked concerns among educators that she won’t be a strong champion for public schools. Two GOP senators, Susan Collins of Maine and Lisa Murkowski of Alaska, have announced plans to oppose DeVos in a Senate split 52-48 between Republicans and Democrats. That will leave her with a tie vote if all other Republicans support her and all Democrats oppose her as expected, and will require Pence to put her over the top. A vice president breaking a tie on a Cabinet nomination would be a first in the history of the Senate, according to the Senate historian's office. The chamber went to brief, intermittent quorum calls as senator after senator completed his or her remarks and yielded the floor to a colleague. And a lone Republican senator, South Carolina's Time Scott, went to the floor to speak, as well, arguing that lawmakers' focus should be not on DeVos, but on ways to improve the education system. Emotions ran high ahead of the vote as constituents jammed senators' phone lines with calls and protesters gathered outside the Capitol, including one person in a grizzly bear costume to ridicule DeVos' comment during her confirmation hearing that some schools might want guns to protect against grizzlies. “Mrs. DeVos demonstrated a complete lack of experience in, knowledge of and support for public education. She was unable to address basic issues that any New Hampshire school board member could discuss fluently,\" said Sen. Maggie Hassan, D-N.H., whose son has cerebral palsy but studied in public schools under a federal law that guarantees access for disabled students. Several Democrats questioned DeVos' commitment to and understanding of that law. Republicans accused Democrats of dragging their feet on DeVos and other qualified nominees to appease liberal voters who still haven’t come to terms with Trump’s election. \"It seems this gridlock and opposition has far less to do with the nominees actually before us than the man who nominated them,\" said Senate Majority Leader Mitch McConnell, R-Ky. \"Enough is enough.\" The clash over nominees has created a toxic atmosphere in the Senate that mirrors the tense national mood since Trump's election, with Democrats boycotting committee votes and Republicans unilaterally jamming nominees through committee without Democrats present. Yet there is little suspense about the final outcome on any of the nominees because Democrats themselves changed Senate rules when they were in the majority several years ago so that Cabinet nominees can now be approved with a simple majority, not the 60 votes previously required. Fox News’ Chad Pergram and the Associated Press contributed to this report.",
      "date": "February 7, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Protesters initially block DeVos from entering DC school",
      "url": "https://www.foxnews.com/politics/protesters-initially-block-devos-from-entering-dc-school",
      "subtitle": "Protesters initially block DeVos from entering DC school",
      "author": "",
      "content": "Protesters initially blocked newly confirmed Education Secretary Betsy DeVos from entering a Washington, D.C., school on Friday – with one “Black Lives Matter” demonstrator even briefly standing in front of her vehicle. DeVos later made it into Jefferson Middle School Academy in Southwest D.C. for her first visit as secretary to a public school. This was only after a teacher/parent “vigil” blocked the road by the front entrance, and a handful of Black Lives Matter protesters caused problems when DeVos tried to enter through the back entrance. Protesters shouted “shame, shame” at the secretary as she was led back into her vehicle. One holding a Black Lives Matter sign then stood in front of the van, but was scolded by fellow protesters to “let her leave,” and he stepped aside. White House Counselor Kellyanne Conway tweeted afterward: \"Don't we want the Sec of Education to visit schools?\" Following the visit, DeVos issued a statement thanking D.C. school officials, teachers and students for welcoming her and stressing that she believes a focus on students and families “is at the heart of providing an exceptional education.” She added, \"I respect peaceful protest, and I will not be deterred in executing the vital mission of the Department of Education. No school door in America will be blocked from those seeking to help our nation's school children.\" THE WEEK IN PICTURES The disruption is the latest in a series of protests against Trump administration officials and policies. DeVos’ nomination was fiercely opposed by teachers unions and Democratic lawmakers in large part over her long support for charter schools and other public school alternatives. Two Republicans joined Democrats to oppose her in the Senate earlier this week, but Vice President Pence broke the 50-50 tie to ensure her confirmation. According to Fox5DC, the “vigil” in front of the D.C. school on Friday was not labeled a protest, but designed to urge DeVos to “support and fund our public schools.” Most of the few-dozen “vigil” participants were retired teachers and parents, but several Black Lives Matter demonstrators also attended and were more aggressive toward DeVos. Jefferson Academy is a Title I school, meaning a majority of its students come from lower-income homes. The school's principal, Natalie Gordon, previously headed two D.C. charter schools before she was asked to take over at Jefferson Academy, which was struggling with low test scores. City officials say the school has made a dramatic turnaround over the last few years. Friday's protest comes after Rep. Jason Chaffetz, R-Utah, reportedly confronted protesters at a town hall in his home state of Utah on Thursday. Fox News’ Garrett Tenney contributed to this report.",
      "date": "February 10, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "DeVos attacks continue; critics incorrectly blame her for Twitter typo",
      "url": "https://www.foxnews.com/politics/devos-attacks-continue-critics-incorrectly-blame-her-for-twitter-typo",
      "subtitle": "DeVos attacks continue; critics incorrectly blame her for Twitter typo",
      "author": "",
      "content": "Internet trolls on Sunday blamed new Education Secretary Betsy DeVos for a typo on the department’s Twitter feed that misspelled the name of a prominent African-American sociologist, but a spokesman said the mistake was made by a longtime employee. The tweet included a quotation attributed to W.E.B. Du Bois that incorrectly spelled the sociologist’s last name with an \"e.\" The mistake immediately drew hundreds of responses mocking the department's misspelling. DeVos, a wealthy political donor, was confirmed last week as President Trump’s pick for Education secretary. But she faced a difficult Senate confirmation process in large part because of her support for voucher programs and other alternatives to public education and because she purportedly never taught in a public school. On Friday, DeVos’ third full day on the job, she was temporarily blocked by protesters from entering a District of Columbia public school. By midday Sunday, the U.S. Education Department had posted a new tweet with the correct spelling and an apology. However, the post drew another round of critics because it included another typo, which was later fixed. One commenter tweeted: \"I love that your initial apology for a typo included a typo. We don't need any further proof that DeVos runs this account.\" Another post urged further rebuke by urging people to “make this go viral.” Still, the department under DeVos leadership received some support amid the dozens of negative comments. “As a public school teacher, it's important to embrace failures and learn from them. Slow down, it isn't a race. Proofreading helps,” one person wrote. A spokesman for the Education Department said Sunday the misspellings had been made by a longtime department employee. He said a new review process was being put in place with additional staff to prevent future tweet errors. The Associated Press contributed to this report.",
      "date": "February 13, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Texas prof resigns from law firm after tweeting he'd be 'ok' with DeVos sexual assault",
      "url": "https://www.foxnews.com/politics/texas-prof-resigns-from-law-firm-after-tweeting-hed-be-ok-with-devos-sexual-assault",
      "subtitle": "Texas prof resigns from law firm after tweeting he'd be 'ok' with DeVos sexual assault",
      "author": "",
      "content": "A Texas professor and lawyer reportedly has resigned from his firm after tweeting that he’d be “ok” with Education Secretary Betsy DeVos being sexually assaulted. Robert Ranco had posted a tweet late last week saying, “I’m not wishing for it… but I’d be ok if #BetsyDevos was sexually assaulted.” The tweet was one of several criticizing DeVos for moving to overhaul how Title IX rules are applied to campus sex assault cases. DeVos claims those rules have led to improper investigations, though Ranco alleged she was making the world more dangerous for girls. Ranco’s account and the tweet itself have since been taken down. As reported by Campus Reform, Ranco is an adjunct professor of paralegal studies at Austin Community College and part of the Carlson Law Firm. But according to Fox 7 in Austin, the firm’s founder Craig Carlson has announced Ranco’s resignation – after a Twitter backlash. “I wasn’t going to make a rash decision about a member of this family just to appease people on social media. That said, I considered the health of everyone in our organization, promised my partners and my employees that we would act according to the values of our firm, and sat down to speak with Mr. Ranco,” he said in a statement, according to Fox 7. Carlson said they concluded that “even expressing apathy towards sexual assault is [an] affront to all victims and a line that simply cannot be uncrossed.” He said Ranco “is taking full responsibility and choosing to resign.” In a statement to KVUE, Ranco called the tweet a “mistake.” He apologized and said he takes “full responsibility.”",
      "date": "September 12, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "DeVos: 'School choice' will not be mandated by Washington",
      "url": "https://www.foxnews.com/politics/devos-school-choice-will-not-be-mandated-by-washington",
      "subtitle": "DeVos: 'School choice' will not be mandated by Washington",
      "author": "",
      "content": "Betsy DeVos, the U.S. education secretary, said Monday that although President Trump’s administration will put forward plans of a historic expansion of school choice, the ultimate decision will be left with the states, not Washington. Politico reported that DeVos made the comments during a speech at an Indianapolis summit hosted by the American Federation for Children. “When it comes to education, no solution, not even ones we like, should be dictated or run from Washington, D.C.,” she said. DeVos told the Senate Health, Education and Pensions Committee in January that she would be \"a strong advocate for great public schools,” but added that \"if a school is troubled, or unsafe, or not a good fit for a child ... we should support a parent's right to enroll their child in a high-quality alternative.\" Trump's nomination of DeVos to lead the Department of Education was harshly criticized by the teachers’ unions, who have claimed that DeVos wants to undermine the public education system, which provides instruction to more than 90 percent of the country's students. Vince M. Bertram, the author of “One Nation Under Taught: Solving America’s Science, Technology, Engineering and Math Crisis, wrote that DeVos’ most important task will be to cast a vision for what education can be for our next generation to meet the demands of a global economy. Politico reported that DeVos did not go into detail about what steps the Trump administration will take to implement its school-choice goals. She said states that opt out would be making a “terrible mistake” and will be “hurting the children and families who can least afford it.”",
      "date": "May 23, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "US Marshals guard DeVos after tense nomination process",
      "url": "https://www.foxnews.com/politics/us-marshals-guard-devos-after-tense-nomination-process",
      "subtitle": "US Marshals guard DeVos after tense nomination process",
      "author": "",
      "content": "U.S. Education Secretary Betsy DeVos is being guarded by the agents from the U.S. Marshals Service after a bruising nomination process, Politico reported. Drew J. Wade, a spokesman for the service, told the magazine that he is not aware of these agents guarding an education secretary in the past. The education secretary is traditionally guarded by a small security unit from the education department, the report said. The report said that few other details are available about the security arrangement. Despite her win, DeVos emerged bruised from her highly divisive nomination fight. Opposed by half the Senate, she faced criticism, even ridicule for lack of experience. At one point, she said some schools should have guns because of the threat of grizzly bears. And there has been scathing opposition from teachers unions and civil rights activists over her support of charter schools and her conservative religious ideology. President Trump accused Democrats of seeking to torpedo education progress. In a tweet before the vote, he wrote, \"Betsy DeVos is a reformer, and she is going to be a great Education Sec. for our kids!\" Pence tweeted later in the day that supporting DeVos was \"a vote for every child having a chance at a world-class education.\" In a separate development, DeVos announced Friday that a government website devoted to students with disabilities, which had been down for more than a week, has been restored and will be updated with input from interested parties. She also accused the previous administration of neglecting the website. The American Federation of Teachers disputed that contention. The Associated Press contributed to this report",
      "date": "February 18, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "19 AGs sue DeVos for delaying for-profit college rules",
      "url": "https://www.foxnews.com/politics/19-ags-sue-devos-for-delaying-for-profit-college-rules",
      "subtitle": "19 AGs sue DeVos for delaying for-profit college rules",
      "author": "",
      "content": "Democratic attorneys general from 18 states and the District of Columbia sued U.S. Education Secretary Betsy DeVos on Thursday over her decision to suspend rules that were meant to protect students from abuse by for-profit colleges. The lawsuit, filed in federal court in Washington, says DeVos violated rule-making laws when she announced a June 14 decision to delay so-called borrower defense to repayment rules, which were finalized under President Barack Obama and scheduled to take effect July 1. In her announcement saying the rules would be delayed and rewritten, DeVos said they created \"a muddled process that's unfair to students and schools.\" Education Department spokeswoman Elizabeth Hill called the lawsuit by attorneys generals \"ideologically driven\" and said the now-delayed rules suffered from \"substantive and procedural flaws\" that need to be addressed. \"That is why the Secretary decided it was time to take a step back and hit pause on these regulations ... to make sure these rules achieve their purpose: helping harmed students,\" Hill said in a statement. The rules would have forbidden schools from forcing students to sign agreements that waive their right to sue. Defrauded students would have faced a quicker path to get their loans erased, and schools, not taxpayers, could have been held responsible for the costs. A final version of the rules was announced last fall after nearly two years of negotiations. The Obama administration started pursuing new rules after the Corinthian Colleges chain shut down in 2015 amid allegations of misconduct, leading to a flood of applications from students seeking to get their loans forgiven. Massachusetts Attorney General Maura Healey, who is leading the lawsuit against DeVos, said the regulation was a \"common-sense measure\" meant to protect students. \"Since Day One of the Trump administration, Secretary of Education Betsy DeVos and the administration have sided with for-profit schools over students,\" Healey told reporters. \"For me and my colleagues, it's simple: When students and families are cheated out of an education and taxpayers foot the bill, everybody loses.\" The lawsuit says DeVos and the Education Department failed to take legally required steps to delay already established rules. It says they failed to open the decision to public comment and failed to provide an adequate legal justification for delaying the rules, among other faults. In June, the Education Department said it was delaying the rule because a federal court was weighing a lawsuit brought by a California trade group made up mostly of for-profit colleges seeking to block the rules. The department cited a law allowing such a delay for litigation if it's found \"that justice so requires.\" The attorneys general said that justification is \"a mere pretext\" for repealing and replacing the regulation. The other states that joined the lawsuit are California, Connecticut, Delaware, Hawaii, Iowa, Illinois, Maryland, Minnesota, New Mexico, New York, North Carolina, Oregon, Pennsylvania, Rhode Island, Vermont, Virginia and Washington. Last week, a group of 47 Democrats in Congress, along with independent Sen. Bernie Sanders of Vermont, sent a letter to DeVos opposing the delay, saying the department had never used litigation as a reason to delay rules. A separate lawsuit against the Education Department was filed Thursday on behalf of two former students of a Boston-area for-profit college. The suit says the students were counting on protections in the new rules to sue the New England Institute of Art, which they say deceived them and left them with few job prospects and heavy debt. The school's parent company did not immediately comment. \"Secretary Betsy DeVos has effectively revoked students' rights under the rule while giving a pass to predatory schools that wield influence with this administration,\" said Julie Murray, an attorney for Public Citizen, a liberal think tank in Washington that's representing the students. The lawsuits set up a legal battle that has been brewing outside the courts for months. Advocacy groups and some congressional Democrats have been gearing up for a fight to preserve Obama-era rules that were intended to hold for-profit colleges accountable, while the Trump administration has sought to roll back regulations it sees as burdensome. Last Friday, DeVos said she was also suspending the new \"gainful-employment\" rule, another hallmark of the Obama administration that was set to take effect in July. The regulation would have cut off federal funding to career programs that consistently left students with more debt than they could afford. Data released by the Obama administration in January found that more than 800 programs across the country were failing to meet the rule's standards.",
      "date": "July 7, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "DeVos rescinds Obama-era rules on campus sexual assault cases",
      "url": "https://www.foxnews.com/politics/devos-rescinds-obama-era-rules-on-campus-sexual-assault-cases",
      "subtitle": "DeVos rescinds Obama-era rules on campus sexual assault cases",
      "author": "",
      "content": "Education Secretary Betsy DeVos on Friday rescinded Obama-era guidelines for investigating allegations of sexual assault on campus, replacing them with guidelines she said would help schools “treat all students fairly.” DeVos, who has been highly critical of the Obama administration’s approach, had announced earlier this month she planned to replace the policy she describes as unfair. \"This interim guidance will help schools as they work to combat sexual misconduct and will treat all students fairly,\" DeVos said in a statement Friday. \"Schools must continue to confront these horrific crimes and behaviors head-on. There will be no more sweeping them under the rug. But the process also must be fair and impartial, giving everyone more confidence in its outcomes.\" The temporary guidance will be in place while the Education Department gathers comments and comes up with new rules. The Obama administration had reshaped how colleges handle complaints of sexual assault, setting new rules and starting hundreds of investigations into colleges accused of straying from them. Central to the debate is a 2011 department memo that laid out rules colleges must follow when responding to complaints of sexual assault from their students. The memo requires colleges to investigate complaints even if there's a separate criminal inquiry. It also established what has become a polarizing standard of evidence used to judge cases. Critics have, among other complaints, claimed the system denies due process to the accused. Unlike in criminal courts, where guilt must be proved beyond a reasonable doubt, colleges judge students based on whether it's \"more likely than not\" they committed the offense. Colleges that are found to have violated Title IX rules can lose federal funding entirely, although the department has never imposed that penalty. The department is now withdrawing that 2011 letter, with DeVos saying in a statement “the era of rule by letter is over.” In a fact sheet, the department said schools must address sexual misconduct that is “severe, persistent or pervasive,” while conducting fair and impartial investigations in a “timely manner.” The department said such investigations must be led by an individual free of conflicts of interest. The department maintained the changes do not limit the rights of anyone to file such a Title IX complaint. Some advocacy groups say the Obama-era policies are flawed but worth saving. They argue the policies have protected many students and forced colleges to confront problems that were long kept quiet. The Associated Press contributed to this report.",
      "date": "September 22, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "DeVos awards Texas district $1M grant for recovery after Santa Fe High shooting",
      "url": "https://www.foxnews.com/politics/devos-awards-texas-district-1m-grant-for-recovery-after-santa-fe-high-shooting",
      "subtitle": "DeVos awards Texas district $1M grant for recovery after Santa Fe High shooting",
      "author": "Frank Miles",
      "content": " Secretary of Education Betsy DeVos awarded a $1 million Project School Emergency Response to Violence (SERV) grant to the Texas school district affected by the May 18 shooting at Santa Fe High. The money is to aid in the “healing and recovery process.” “No student, parent or educator should have to experience the trauma suffered by so many at Santa Fe High School and other schools throughout the country,” said DeVos, according to KTRK. “Every day, the work of the Federal Commission on School Safety grows more urgent. We continue to focus on identifying proven ways to prevent violence and keep our students safe at school.” President Trump created a commission to review ways to make schools safer, naming DeVos to chair it. The panel on Thursday made its first field trip, to a Baltimore-area elementary school. The Texas school shooting left eight students and two substitute teachers dead. Student Dimitrios Pagourtzis, 17, faces capital murder charges in the attack. Investigators say he carried out the massacre with a shotgun and a pistol that belonged to his father. “This a crucial first step in federal funding to help the Santa Fe High School community recover,” Sen. Ted Cruz, R-Texas, said in a statement. “I applaud Secretary DeVos for expediting this grant, and will continue to work to ensure Santa Fe High School receives the assistance it needs. I also remain committed to working with the governor, the administration and my congressional colleagues to put an end to these violent crimes and protect our students.” Gov. Greg Abbott recently unveiled plans to offer $120 million in funding to help strengthen school security across Texas. The Associated Press contributed to this report.",
      "date": "May 31, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Trump Cabinet officials in the crosshairs as Dems zero in on DeVos, Zinke, others",
      "url": "https://www.foxnews.com/politics/trump-cabinet-officials-in-the-crosshairs-as-dems-zero-in-on-devos-zinke-others",
      "subtitle": "Trump Cabinet officials in the crosshairs as Dems zero in on DeVos, Zinke, others",
      "author": "Gregg Re",
      "content": " President Trump won't be the only high-profile target on House Democrats' investigative agenda when the new Congress is seated in January, with top officials in his Cabinet also expected to face a torrent of scrutiny. Trump's Cabinet has seen several shakeups this year -- including the departures of Secretary of State Rex Tillerson, embattled Environmental Protection Agency Administrator Scott Pruitt and Attorney General Jeff Sessions. But several controversial figures remain. And Cabinet officials generally are easier for Congress to investigate than senior White House officials and the president, who can assert executive privilege to presumptively shield both his communications and deliberative processes from review. House Democrats have signaled a particular interest in probing Secretary of Education Betsy DeVos, Interior Secretary Ryan Zinke, and Housing and Urban Development head Ben Carson. Other possible officials to go under the microscope include Homeland Security Secretary Kirstjen Nielsen, though Trump reportedly has indicated she may leave the administration, and Commerce Secretary Wilbur Ross. DeVos, who has reportedly received round-the-clock protection from the U.S. Marshals after being accosted last year, was once called the “most hated Cabinet secretary\" by \"60 Minutes\" host Lesley Stahl. A wealthy Republican donor with limited education experience, DeVos was confirmed by a 51-50 vote in the Senate -- a result ensured only by Vice President Pence's tiebreaking vote, which marked the first time in history a vice president had to vote to confirm a Cabinet official. Rep. Rosa DeLauro, D-Conn., who is slated to chair an appropriations subcommittee that handles education funding, has criticized Devos on everything from her handling of student loan debt to her department's guidance on campus sexual assault policy. She has vowed to “hold Secretary DeVos accountable for her agency’s failure to uphold federal protections for our students.” STOSSEL: WHAT THE HATERS DON'T GET ABOUT BETSY DEVOS Chief among Democrats' objections are DeVos' efforts to enact regulatory rollbacks favorable to major providers of student loans, including Navient and FedLoan Servicing, that DeVos has said are aimed at reducing confusion and inefficiencies in the student loan process. Democrats have also opposed DeVos' narrowing of the definition of fraud in the student loan context, which conservatives have argued was an important step in reducing potentially frivolous litigation that would ultimately result in big-digit judgments that come out of taxpayers' pockets. Rep. Mark Takano, who is slated to chair the Veterans' Affairs Committee, told Politico that he wants \"to examine the extent to which her rollbacks of regulations negatively impact veterans,\" who enroll at for-profit colleges at high rates. And Rep. Maxine Waters, D-Calif., who is expected to chair the House Financial Services committee, has accused DeVos of waging a “full-on attack on civil rights protections for students—particularly students of color, students with disabilities, transgender students, and survivors of sexual assault.” At a contentious hearing with DeVos in March, DeLauro charged that \"despite your statements all morning about supporting states’ rights, what your office has done, you’ve issued a declaration to pre-empt state regulations on companies that collect student loans.\" In February, DeVos issued a notice effectively saying states have no legal authority to regulate such lenders, who are facing several lawsuits from state attorneys general and investigations by various agencies. More recently, DeVos has moved to block efforts by states and federal regulators to obtain information about student loans, citing federal privacy laws. Legal challenges concerning that effort are ongoing, with one judge ruling that the Education Department couldn't assert those privacy protections to hide from discovery requests. Democrats have also raised concerns about DeVos' new proposed guidance for how campuses should handle sexual assault claims, which Republicans have long claimed are unfair to students accused of misconduct. \"Every survivor of sexual violence must be taken seriously, and every student accused of sexual misconduct must know that guilt is not predetermined,\" DeVos said in a statement announcing the proposal, which would provide the accused the right to question his or her accuser. The two could communicate through an intermediary and would not need to be in the same room. But DeLauro, again, was unconvinced: “In the ongoing battle to eradicate sexual assault from college campuses, Secretary Betsy DeVos is on the side of those accused rather than the victims,\" she said in a statement earlier this month. Zinke, a former Montana congressman and U.S. Navy SEAL who served in Iraq and Bosnia, has come under criticism for his alleged misconduct as interior secretary, centering on a real estate deal in his home state involving a foundation he created and the chairman of the energy giant Halliburton that does business with Interior. Multiple media reports have indicated the Interior Department's watchdog, Inspector General Mary Kendall, has referred that probe to the Justice Department for possible criminal charges. Virginia Democratic Rep. Gerry Connolly, who is expected to lead the House Oversight Government Operations Subcommittee, told Politico that \"Zinke is one the most ethically challenged members of the Cabinet and maybe one of the most ethically challenged secretaries of the Interior we’ve had in living memory.\" \"[There’s] rich material here to look into his behavior and his fitness for continued service in the office,\" Connolly added. The 57-year-old Zinke also raised ethical concerns when he blocked two Connecticut tribes from opening a casino and redrew boundaries to shrink a Utah national monument. Kendall's team cleared Zinke in a separate probe into his air travel, faulted him for violating department regulations when he allowed his wife to ride in government vehicles, and said there were insufficient records to determine whether Zinke's staff re-assignments broke policy. Zinke has also been inundated with criticism even for his legally above-board policy decisions and statements. As head of the Interior, Zinke has reduced the boundaries protecting some national monuments to open more land to drilling and mining operations, angering some in his home state of Montana. Last week, he blamed \"radical environmentalists” for the deadly California wildfires that have left dozens dead, saying they'd rather “burn down the entire forest than cut a single tree.” Rep. Raul Grijalva, D-Ariz., the probable incoming chair of the House Natural Resources Committee, said it \"can't be dismissed as merely a coincidence\" that Zinke reportedly sought to replace Kendall with a political appointee shortly after the DOJ referral. Grijalva made clear on Friday he's going after Zinke in a USA Today op-ed calling for his resignation, prompting a fiery response from the secretary. But it remains a possibility that Zinke, like former EPA head Pruitt, might step aside rather than face Democrat-led investigations. Citing several sources familiar with his discussions, Politico reported earlier this month that Zinke plans to resign before the end of the year. \"It's laughably false and belongs in The Onion,\" the Interior's press office wrote on Twitter concerning the report. President Trump indicated to reporters at a post-Election Day White House press conference on Nov. 7 that Zinke's fate was in doubt. ZINKE BLAMES 'RADICAL ENVIRONMENTALISTS' FOR CALIFORNIA FIRES “We’re looking at that, and I do want to study whatever is being said,” Trump said. \"I think he’s doing an excellent job, but we will take a look at that, and we’ll probably have an idea on that in about a week.” But two days later, Trump told reporters he had no immediate plans to fire Zinke. \"No, I’m going to look into any complaints,” he said. At a roundtable discussion in Biloxi, Miss., on Monday evening, Trump said he's still thinking of potentially changing some Cabinet positions, but added that he'd be very happy if he left his Cabinet as it is now. For his part, Zinke wrote on Twitter after Election Day that he was \"looking forward\" to working with new members of Congress in January. Carson, a former neurosurgeon who challenged Trump for the 2016 GOP presidential nomination, is most dogged by ethical complaints concerning his allegedly excessive spending at the Department of Housing and Urban Development (HUD). Earlier this year, HUD announced it would cancel an order for a $31,561 dining set purchased for a costly makeover of Carson's office after a complaint by Helen Foster, HUD’s former chief administrative officer. Foster said she faced retaliation for objection to the cost of the set, saying that $5,000 was the statutory max. The New York Times first reported on the decision, made in late 2017 -- shortly after the White House moved to cut various HUD programs for low-income individuals. A HUD spokesperson told The Times that Carson “didn’t know the table had been purchased\" -- a claim that Democrats are sure to probe in January. House Oversight Committee Chairman Rep. Trey Gowdy, R-S.C., already demanded that HUD turn over all documents related to the purchase earlier this year, but a Democrat-led probe would likely be more expansive and could include subpoenas for additional information and testimony by more officials at HUD. In something of an investigative crossover twist, an email sent by Carson on Oct. 12 apparently described the plan to replace Kendall after she referred her investigation of Zinke to the DOJ. BEN CARSON HITS BACK AT 'HYSTERICAL' CRITICS, SAYS RENT REFORM HELPS THE POOR In his email, Carson wrote that assistant secretary for administration Suzanne Israel Tufts was leaving to replace Kendall as the Interior Department's watchdog -- an assertion the White House quickly called \"false.\" House Democrats have promised to determine how exactly Carson got the idea that Kendall would depart. Carson has taken criticism for arguing for advocating rent reforms that he says will help boost people out of poverty.  Saying ”$50 a month is not a lot of skin the game,\" Carson has moved to boost the minimum rent contribution from poor people receiving government housing benefits from $50 to $150. He has also sought to have residents pay a larger percentage of their income towards rent, and move income verification checks from once a year to once every three years -- a change he says will encourage people to work more. “The real meat of the rent reform is things like making the assessment of income every three years instead of one year so that people aren’t discouraged from taking a raise,” Carson said this summer. “People aren’t discouraged from bringing another income earner in or getting married, things like that. Those are the things that have kept people chronically in poverty.” But backlash has been severe, with Democrats countering that more work requirements and higher rent costs would drive more people into homelessness. Nielsen has been front-and-center in recent days, after members of the leading migrant caravan from Central America attempted to storm the port of entry at San Ysidro, Calif., on Sunday. During the episode, U.S. Border Patrol authorities used tear gas to disperse the migrants, including several who threw what appeared to be rocks across the border. At a rally late Monday in Mississippi, Trump seemingly sounded a note of confidence in Nielsen's work overseeing border security efforts, which resulted in dozens of arrests. No members of the caravan made it into the U.S. without being apprehended, according to U.S. officials. \"Are we doing OK on the border, folks?\" Trump said to cheers of \"Build that wall.\" WATCH: HUNDREDS OF MIGRANTS RUSH BORDER AT SAN YSIDRO \"We're not going to have it -- you've got to come into our country legally,\" the president added. \"We have a lot of [the wall] built, and it's going up. And the rest of it -- it's pretty nasty looking wire, isn't it? We're doing well.\" In between his two Mississippi rallies, Trump attended a roundtable with law enforcement leaders on his bipartisan criminal justice reform effort. There, he charged that some migrants -- whom he identified as \"grabbers\" -- were essentially using children as human shields at the border. After the president instituted a zero-tolerance policy that all illegal immigrants should be referred for criminal prosecution, administration officials argued that the Flores consent decree legally prevented them from keeping adults and children in custody together for more than two weeks. That decree, made amid litigation during former President Bill Clinton's administration, ostensibly limits the amount of time that federal authorities can detain illegal immigrant minors who are caught along with their parents. But amid fierce criticism against both the White House and Nielsen, Trump signed an executive order this summer barring family separations at the border, although it remains subject to legal challenges. Democrats have called for investigations into the family separations, as well as for Nielsen's resignation amid a report by the DHS Office of Inspector General finding various possible deficiencies in the agency's handling of the matter. If Nielsen remains \"Donald Trump’s puppet, continues to flout the law, lie to Congress and ignore the plight of these children in the face of these findings, then she is truly unfit to lead the Department,\" Rep. Bennie Thompson, D-Miss., said in October. Thompson is set to chair the House Homeland Security committee. In a statement late Monday, Nielsen backed up Trump's comments about migrants, just as DHS earlier supported Trump's remarks that the caravan contained hundreds of criminals. But in an exclusive interview with Fox News' Chris Wallace on \"Fox News Sunday\" earlier this month, Trump said he wanted to see more from Nielsen. \"Well, I like her a lot. I respect her a lot,\" Trump said, referring to Nielsen. \"She’s very smart. I want her to get much tougher and we’ll see what happens there. But I want to be extremely tough. ...  I like her very much, I respect her very much, I’d like her to be much tougher on the border -- much tougher, period.\" He added there's a \"chance\" that Nielsen, who was accosted in a restaurant this summer by far-left progressive activists, will continue in her role. House Democrats have signaled their intent to scrutinize Ross' finances, as well as his responses to federally required disclosure forms and his possible ties to Chinese and Russian interests. In a letter this summer, several leading Democrats, including likely incoming Judiciary Committee Chairman Jerry Nadler, D-N.Y., requested that a government watchdog look into Ross' decision to short Navigator Holdings in October 2017,  just days after he became aware that The New York Times planned to publish a report on his investments with the company. On Nov. 5, 2017, The Times published a story titled, \"Commerce Secretary’s Offshore Ties to Putin ‘Cronies,'\" which linked Navigator Holdings to Russian President Vladimir Putin and a Russian oligarch. “Secretary Ross’ holdings in Navigator, his sale of those holdings, and his lack of transparency with regard to those holdings, are especially troubling given that he is responsible for promoting the interests of U.S. companies and for implementing sanctions against Russia,” the Democrats wrote. They also questioned whether Ross had properly divested himself of his interest in companies co-owned by the Chinese government and other companies that he can influence -- as he said he would during his confirmation hearings -- or whether he had simply distributed his holdings among his family members. Separately, Democrats have sought to question Ross on the Trump administration's decision to add a citizenship question to the 2020 census, though the Supreme Court has blocked those efforts in connection with several lawsuits. Ross had claimed in March, when the decision to add the citizenship question was announced, that he considered adding it after a request to do so last December from the Justice Department. However, in October, Justice Department lawyers filed a new document in which Ross said he now remembered speaking with former senior White House adviser Steve Bannon in spring 2017 about adding the question. That apparent inconsistency could provide fuel for Democrats' efforts to highlight the citizenship issue more broadly. Democrats claim a citizenship question would scare illegal immigrants and lead many to avoid participating in the census. Because the number of congressional seats awarded to each district in the House of Representatives is currently determined by population totals provided by census results -- citizens and noncitizens -- Democrats fear the Trump administration's change will dramatically cut into their representation in Congress. But late Monday, Bloomberg, citing three people familiar with Trump's thinking, reported that despite these potential headaches and widespread speculation, the president has no plans to replace either Ross or Treasury Secretary Steven Mnuchin. If accurate, the news would mark something of a bailout for Ross, who himself helped Trump avoid a personal bankruptcy in Atlantic City, N.J., in the 1990s. It was evident even decades later that the president hasn't forgotten Ross' investing prowess. \"This guy knows how to make money, folks,\" Trump said at a rally in 2016 after picking Ross for the top Commerce job. \"I put on a killer.\" Fox News' Samuel Chamberlain, Dom Callicchio, Bret Baier and Paulina Dedaj contributed to this report.",
      "date": "November 30",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "DeVos donates salary to education, special needs charities",
      "url": "https://www.foxnews.com/politics/devos-donates-salary-to-education-special-needs-charities",
      "subtitle": "DeVos donates salary to education, special needs charities",
      "author": "",
      "content": "A spokeswoman says Education Secretary Betsy DeVos will donate her nearly $200,000 salary to four charities focusing on education and special needs. Department spokeswoman Liz Hill said in a statement Wednesday that DeVos’ one-year salary of $199,700 will be divided evenly among the four organizations. One of the groups, Dreams Soar, works to encourage girls to pursue careers in the fields of science, engineering and mathematics. Another, Kids Hope USA, helps at-risk children. Vision to Learn provides eyeglasses to low-income children and Special Olympics helps children and adults with disabilities. DeVos is married to Dick DeVos, the heir to the Amway marketing fortune. She travels around the country on her own private plane and foots the bill.",
      "date": "February 14, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Petition asks Trump to name LeBron James new education secretary, replacing DeVos",
      "url": "https://www.foxnews.com/politics/petition-asks-trump-to-name-lebron-james-new-education-secretary-replacing-devos",
      "subtitle": "Petition asks Trump to name LeBron James new education secretary, replacing DeVos",
      "author": "Ryan Gaydos",
      "content": " A petition calling for NBA superstar LeBron James to replace Betsy DeVos as secretary of education has attracted thousands of signatures. As of early Friday, more than 23,000 people had signed the Care2 petition, asking President Trump to replace DeVos with the Los Angeles Lakers star. The three-time NBA champion recently opened his I Promise School in Akron, Ohio. “I am very excited by the overwhelmingly positive reception of the petition, but am also unsurprised,” Rebecca Gerber, who started the petition, told USA Today. “Its success is undoubtedly due, in part, to the effect of LeBron James as a singular role model in our culture, and his ability to not only be a superstar athlete, but a superstar activist that so many men, women and children admire.” Gerber said she hopes the petition can “send a message” and claimed that people were frustrated with Trump’s alleged “petty, racist attacks against James and other black athletes.” DeVos is one of the most criticized members of the Trump administration. She assumed office as secretary of education in February 2017. Last month, vandals untied a $40 million yacht owned by DeVos' family, setting it adrift at a boat club in Huron, Ohio, resulting in thousands of dollars in damage. Unfortunately for Gerber, James signed a four-year contract with the Lakers over the summer. He also has a busy year in Hollywood coming up as he is set to be producing several TV series and “Space Jam 2.”",
      "date": "August 10, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Unions bankrolling DeVos opposition",
      "url": "https://www.foxnews.com/politics/unions-bankrolling-devos-opposition",
      "subtitle": "Unions bankrolling DeVos opposition",
      "author": "",
      "content": "Three of the groups challenging the reform agenda of President-elect Donald Trump and his education secretary nominee Betsy DeVos received more than $2.6 million from teachers unions and their allies, according to federal labor filings. BY THE NUMBERS: TEACHER UNION CONTRIBUTIONS DeVos, a pioneer in the school choice and charter school movements over the last two decades, has received vocal opposition from Democrats and some of the country’s most powerful unions. The National Education Association, American Federation of Teachers, and AFL-CIO, which serves as an umbrella group for dozens of unions including the AFT, have all called on the Senate to reject the nomination. LIBERAL GROUPS ACCUSED OF HYPOCRISY OVER CALL FOR RECUSALS IN DEVOS CONFIRMATION They have also pumped millions of dollars into think tanks and activist groups that have supplied Democrats with intellectual ammunition to oppose her. DeVos, the head of the American Federation for Children, has come under scrutiny from a number of liberal groups and media outlets, along with unions. The Economic Policy Institute (EPI) and Center for American Progress (CAP) have each released reports critical of charter schools since President-elect Donald Trump announced the nomination in November. Click for more from The Washington Free Beacon",
      "date": "January 17, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "DeVos blasts media over ‘shameful’ coverage of Special Olympics proposed cuts",
      "url": "https://www.foxnews.com/politics/devos-blasts-media-over-shameful-coverage-of-special-olympics-cuts",
      "subtitle": "DeVos blasts media over ‘shameful’ coverage of Special Olympics proposed cuts",
      "author": "Louis Casiano",
      "content": " Education Secretary Besty DeVos blasted the media Wednesday, accusing news outlets of reporting “falsehoods” about her department’s plan to cut funding to the Special Olympics. “It is unacceptable, shameful and counterproductive that the media and some members of Congress have spun falsehoods and fully misrepresented the facts,\" DeVos said in a statement. \"Make no mistake: we are focused every day on raising expectations and improving outcomes for infants and toddlers, children and youth with disabilities, and are committed to confronting and addressing anything that stands in the way of their success,” she continued. BETSY DEVOS TO VISIT STRUGGLING SOUTH CAROLINA SCHOOLS DeVos drew attention to the $13.2 billion in federal grants awarded to states for special education. The secretary faced a storm of criticism after she was grilled by the House Appropriations subcommittee over proposed budget cuts that would eliminate nearly $18 million in federal funding for the athletic competition for disabled youth and adults while calling for a $60 million increase in charter school funding. She said she has “personally supported” the Special Olympics, but added that it could be supported through philanthropy as well. The Special Olympics received $17.6 million from the Education Department this year, according to records. In her statement, she said the organization raises more than $100 million annually and that “There are dozens of worthy nonprofits that support students and adults with disabilities that don't get a dime of federal grant money.” “But given our current budget realities, the federal government cannot fund every worthy program, particularly ones that enjoy robust support from private donations.” CLICK HERE TO GET THE FOX NEWS APP Meanwhile, U.S. Sen. Roy Blunt, R-Mo., who chairs the Senate Appropriations subcommittee, declared Wednesday that the proposed cuts would not be approved. \"I’m a longtime supporter of the Special Olympics and proud that Missouri is home to the largest Special Olympics training facility in the world,\" Blunt said in a statement, according to the Washington Times. \"I was just at the World Games and saw, as I have many times before, what a huge impact the organization has on athletes, their families, and their communities. Our Department of Education appropriations bill will not cut funding for the program.\" Just last week, Blunt attended the 2019 Special Olympics World Summer Games, held in Abu Dhabi, Roll Call reported. DeVos is expected to present her budget to Blunt's panel Thursday. The Associated Press contributed to this report.",
      "date": "March 28",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "DeVos considering allowing states to use federal funds to buy guns: report",
      "url": "https://www.foxnews.com/politics/devos-considering-allowing-states-to-use-federal-funds-to-buy-guns-report",
      "subtitle": "DeVos considering allowing states to use federal funds to buy guns: report",
      "author": "Benjamin Brown",
      "content": " Education Secretary Betsy DeVos is reportedly considering allowing states to use federal funds to buy firearms for educators. The New York Times, citing multiple people with knowledge of the plan, reported Wednesday evening that the department is focusing on a federal education law that does not explicitly prohibit the purchase of firearms through federal funds called the Student Support and Academic Enrichment grants. It would be up to DeVos to approve of any such measure, The Times reported. The Department of Education did not immediately respond to an email from Fox News. A spokeswoman for the education department told the paper that the agency is “constantly considering and evaluating policy issues, particularly issues related to school safety,” but did not specifically address whether the department is considering granting states the option to use federal funds for weapons purchases. “The secretary nor the department issues opinions on hypothetical scenarios,” the spokeswoman said. Former Arizona congresswoman Gabrielle Giffords -- who was injured during a 2011 shooting at a meet-and-greet event in Tuscon, Az. – said arming teachers puts “children in even more danger.” “Arming teachers is not a solution. It recklessly puts American children in even more danger,” Giffords tweeted late Wednesday evening. “We can forge a better path. It’s time for Americans to find the courage to fight for our own safety.” Stricter gun control laws have been at the forefront of hotly debated topics in Washington since a gunman opened fire at a high school in Parkland, Florida, and killed 17 students and faculty members. President Trump in February expressed his support for arming “gun adept teachers with military or special training experience,” as a way to prevent another “savage sicko” from causing mass causalities. He also advocated for gun control measures, such as raising the minimum age to purchase a firearm to 21. DeVos unveiled a federal commission on school safety in March to study whether to ban gun sales to people under 21, among other things.",
      "date": "August 23, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Trump picks charter school advocate Betsy DeVos for education secretary",
      "url": "https://www.foxnews.com/politics/trump-picks-charter-school-advocate-betsy-devos-for-education-secretary",
      "subtitle": "Trump picks charter school advocate Betsy DeVos for education secretary",
      "author": "",
      "content": "President-elect Donald Trump selected a charter school advocate and GOP donor from Michigan on Wednesday to be education secretary. Betsy DeVos becomes the second woman chosen to fill a spot in Trump's Cabinet. Earlier Wednesday, Trump named South Carolina Gov. Nikki Haley as U.S. ambassador to the United Nations earlier in the day. Both Cabinet-level positions require Senate confirmation. While some initially cheered Haley's selection, despite her limited experience on the international stage, the DeVos choice faced criticism even before it was formally announced Wednesday. Conservatives warned that DeVos, a longtime Republican donor, previously supported the Common Core education standards that Trump railed against during the campaign. Trump, who was at his Palm Beach estate Wednesday for the Thanksgiving holiday, called DeVos \"a brilliant and passionate education advocate.\" DeVos, from Michigan, is a longtime advocate for charter schools and school vouchers. She currently leads the advocacy group, American Federation for Children, and sits on the board of the Jeb Bush-led Foundation for Excellence in Education. \"Under her leadership we will reform the U.S. education system and break the bureaucracy that is holding our children back so that we can deliver world-class education and school choice to all families,\" Trump said. DeVos said in her own statement, \"The status quo in education is not acceptable.\" The DeVos family has been active in Republican politics for decades, especially as donors to GOP candidates and the Republican Party. DeVos' husband, Dick, is an heir to the Amway fortune and a former president of the company. The couple gave $22.5 million to the Kennedy Center for the Performing Arts in Washington in 2010, at the time the largest private donation in the center's history. Hours before the DeVos pick was announced, conservative policy leader Frank Cannon, president of American Principles Project, called her \"an establishment, pro-Common Core secretary of education.\" \"This would not qualify as 'draining the swamp,'\" Cannon said, referencing Trump's campaign trail slogan. \"And it seems to fly in the face of what Trump has stated on education policy up to this point.\" In a statement to Fox News, American Federation of Teachers President Randi Weingarten said DeVos \"has no meaningful experience in the classroom or in our schools.\" “The president-elect, in his selection of Betsy DeVos, has chosen the most ideological, anti-public education nominee put forward since President Carter created a Cabinet-level Department of Education,\" Weingarten said. “In nominating DeVos, Trump makes it loud and clear that his education policy will focus on privatizing, defunding and destroying public education in America.\" Former presidential contender and Florida Gov. Jeb Bush called DeVos \"an outstanding pick\" for the position. “She has a long and distinguished history championing the right of all parents to choose schools that best ensure their children’s success,\" he said in a statement. When asked about DeVos' support for the Common Core standards, Trump spokesman Jason Miller said \"the president-elect has been consistent and very clear in his opposition to Common Core.\" \"Anybody joining the administration is signing on to the president-elect's platform and vision for moving America forward,\" Miller said. There was less immediate opposition to Haley's selection. Haley, the daughter of Indian immigrants, is the only minority member chosen by Trump so far. Retired neurosurgeon and Trump loyalist, Ben Carson, an African-American, has been offered the job of secretary of the Department of Housing and Urban Development, according to a person familiar with the offer who spoke on the condition of anonymity because the person was not authorized to discuss the deliberations publicly. Carson has not yet accepted the offer, but he tweeted on Wednesday that \"an announcement is forthcoming about my role in helping to make America great again.\" Trump said that Haley, his UN choice, \"has a proven track record of bringing people together regardless of background or party affiliation to move critical policies forward for the betterment of her state and our country.\" \"She is also a proven dealmaker, and we look to be making plenty of deals,\" he said in a statement. \"She will be a great leader representing us on the world stage.\" South Carolina Sen. Lindsey Graham praised his home-state governor as a good choice and said in a statement that he looks forward to working with her on \"overdue reforms of the United Nations.\" Graham is chairman of the Senate's Foreign Operations Subcommittee on Appropriations, which is responsible for funding the UN and all American foreign assistance. Haley said she accepted the assignment partly out of \"a sense of duty.\" \"When the president believes you have a major contribution to make to the welfare of our nation, and to our nation's standing in the world, that is a calling that is important to heed,\" she said in a statement. Not all presidents have treated the ambassadorship to the U.N. as a Cabinet-level position, and Republicans have tended not to grant that status. Trump spokesman Jason Miller said Trump is \"spending significant time\" weighing his choice for secretary of state. Among those he has interviewed is 2012 GOP presidential nominee Mitt Romney, who repeatedly denounced Trump during the 2016 campaign. After secretary of state, the UN ambassador is the highest-profile diplomatic position, often serving as the voice for U.S. positions on the international stage. As part of the Cabinet, Haley would have more opportunity to shape U.S. policies, rather than simply defend the administration's positions. Yet it could be an awkward role at times. Trump campaigned on the theme of \"America first\" and said he is skeptical about \"international unions that tie us up and bring America down.\" Trump has also described the United Nations as weak and incompetent. Haley would be the third consecutive female U.S. ambassador to the UN, after Susan Rice and Samantha Power, the current ambassador. Bad blood between Trump and Haley was evident through much of the campaign. \"The people of South Carolina are embarrassed by Nikki Haley!\" Trump wrote on Twitter in March. Haley denounced several of Trump's campaign comments and urged voters to \"reject the siren call of the angriest voices.\" DeVos, too, was slow to warm to Trump. She told The Associated Press in July, \"A lot of the things he has said are very off-putting and concerning.\" The Associated Press contributed to this report.",
      "date": "November 23, 2016",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Harvard students protest Betsy DeVos speech, hold sign calling her 'white supremacist'",
      "url": "https://www.foxnews.com/politics/harvard-students-protest-betsy-devos-speech-hold-sign-calling-her-white-supremacist",
      "subtitle": "Harvard students protest Betsy DeVos speech, hold sign calling her 'white supremacist'",
      "author": "",
      "content": "Harvard University students staged a protest as Education Secretary Betsy DeVos delivered a speech Thursday on school choice. Some held up fists. One held up a sign reading in red ink: ‘White supremacist.” Others called for protections for victims of campus sexual assault. DeVos last week revoked Obama administration guidance that instructed colleges on how to investigate sexual assault cases on college campuses. DeVos said policy was skewed against those accused of assault and had “weaponized” the Education Department to “work against schools and against students.” DeVos did not stop her speech to address the protesters but later took some questions from the audience. The Associated Press reported the protest was mostly silent, though some students snapped their fingers or cheered in support of some questions. HHS SECRETARY TOM PRICE RESIGNS OVER PRIVATE PLANE TRIPS Asked about protections for transgender students, DeVos said she is committed to making sure all students are safe. Earlier this year, she rescinded guidance that allowed transgender students to use bathrooms that matched their gender identity. \"With respect to any student that feels unsafe or discriminated against in their school, that is the last thing we want and the Office for Civil Rights at the Department of Education continues to hear and work with the schools that have any of those issues to deal with,\" DeVos said. \"And we are committed to doing that on behalf of the students.\" DeVos said she wanted new rules on campus sexual assault to be fair to both the victims and the accused. She was asked by a student how much her net worth was expected to increase due to school choice. Devos responded: \"I have written lots of checks to support giving parents and kids options to choose a school of their choice. The balance on my income has gone very much the other way and will continue to do so.\" School choice referred to efforts that give students options other than their local public schools, such as charter or private schools. Charter schools were funded by public money but usually operated by entities that were independent of school districts. DeVos was a supporter of school choice efforts in Michigan before becoming President Trump’s education chief. Before she spoke, she announced $253 million in grants to expand charter schools across the country. The awards went to nine states, two state agencies and over 20 nonprofit charter management organizations. The grants were awarded as part of the Every Student Succeeds Act. TILLERSON IN CHINA TO TALK ABOUT NORTH KOREA, TRADE Tony DelaRosa, 27, a student at Harvard's Graduate School of Education, held a sign reading \"Our Students Are Not 4 Sale.\" \"We need public schools not to lose our funding and be given to charter schools,\" DelaRosa told the AP. \"Administering more charters anywhere, it's going to take funding from somewhere.\" Samantha White, a 19-year-old neurobiology major, said she came to the speech to ask DeVos why she rescinded the guidance on campus sexual assault. \"I am very upset and angry about it,\" White said. \"Sexual assault is such a huge problem on college campus already and if you are rolling this back, it makes survivors of sexual assault more vulnerable and it's more difficult for them to seek justice when there aren't these regulations.\" The Associated Press contributed to this report.",
      "date": "September 30, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "DeVos on college admissions scandal: We need equal opportunity for students",
      "url": "https://www.foxnews.com/politics/devos-on-college-cheating-scandal-we-need-equal-opportunity-for-students",
      "subtitle": "DeVos on college admissions scandal: We need equal opportunity for students",
      "author": "Victor Garcia",
      "content": " Education Secretary Betsy DeVos says higher education institutions and K-12 schools are \"not fair\" when it comes to giving opportunities to students from different financial backgrounds and that the Trump administration is pushing for “equal opportunity for all students” during comments on the college admissions scandal Wednesday. “This is a matter that all Americans want things to be fair and they’re clearly not,” DeVos said on “The Daily Briefing with Dana Perino.” “This goes to K-12 education as well, and we don’t have the same opportunities for all students in K-12 education, we don’t in higher education and that’s one of the things that this administration is really advocating for. Equal opportunity for all students.” DeVos said students need to be considered by colleges and universities on their merit and that the Education Department was investigating how it factors into the investigation. “We are still researching and looking into how the department might interface with this. Obviously this is a Department of Justice operation but we are looking very closely at it and we’ll see if any of the regulations we’re responsible for have been broken,” DeVos told Perino when asked if there was anything her department could do to assure the system wasn’t rigged in favor of the wealthy. The scam was allegedly masterminded by William Rick Singer of California, who helped parents get their children admitted to top colleges and universities through bribes, according to court documents. CELEBRITIES MOCK LORI LOUGHLIN AND FELICITY HUFFMAN OVER COLLEGE CHEATING SCANDAL Fifty people have been charged, including more than 30 parents, and nine coaches.  Actresses Lori Loughlin and Felicity Huffman are among those parents charged. DeVos also talked to Perino about the Department of Education proposing teacher vouchers for professional development. “We believe that teachers need to have the freedom to decide how they can better develop their own talents and become better teachers themselves,” DeVos said. WHO IS WILLIAM RICK SINGER, THE COLLEGE ADMISSIONS CHEATING SCANDAL'S ALLEGED RINGLEADER A proposed $200 million would go to these vouchers. DeVos also said part of the proposal included a tax credit that would become scholarships for students across the country, with states deciding whether or not to participate.",
      "date": "March 13",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Betsy DeVos says visit to Florida high school after shooting was 'sobering, inspiring'",
      "url": "https://www.foxnews.com/politics/betsy-devos-says-visit-to-florida-high-school-after-shooting-was-sobering-inspiring",
      "subtitle": "Betsy DeVos says visit to Florida high school after shooting was 'sobering, inspiring'",
      "author": "Phil Keating",
      "content": " Parkland, Florida high school students walked into Marjorie Stoneman Douglas High School Wednesday morning for their first, full, normal school day—three weeks to the day since the deadliest high school shooting in U.S. history. Principal Ty Thompson and his teachers, welcomed the boys and girls and a special guest, Department of Education Secretary Betsy DeVos. Secretary DeVos came to Stoneman Douglas, where Building 12 remains locked up and a crime scene, to “connect with students and teachers” in the wake of the tragic shooting on Feb. 14. Her visit inside the school was closed to the press, but afterward, she spoke to the media at a Parkland hotel. “It was a very, as I said, sobering and inspiring moment and visit,” DeVos said. “I come committed on behalf of this administration to continuing to work to find solutions so that no student and no parent ever has to go through what this community has had to endure.” She said she heard a variety of things from the students with whom she spoke with. “Some of them are doing quite well, but they all acknowledge that it’s a day-to-day situation,” she said. “For students who were actually in the building involved, it’s very tough.” School safety—and what to do about it—has dominated the political landscape since former student Nikolas Cruz allegedly took an Uber to the school, unpacked his AR-15 assault rifle with multiple magazines and unloaded 150 rounds inside the classrooms and hallways. Fourteen students died, along with one teacher, the athletic director and a coach. Sixteen others were shot and wounded. In Tallahassee, the state capital, the Senate passed its Marjory Stoneman Douglas Public Safety Act afterhours Monday night. It calls for raising the age to buy a rifle from 18 to 21, mandates a three-day waiting period for all gun purchases, boosts funding for mental health care and aims to post armed officers at ever school. One controversial proposal, to arm teachers with guns in the classrooms if their school districts approve, was removed by the Senators. The proposal was opposed by Gov. Rick Scott. The bill is now in the Florida House and a House vote on the massive, $400 million package could come Wednesday. Broward county prosecutors are presenting evidence in front of a secret, grand jury this week. A formal indictment with 17 counts of first-degree murder is expected. Suspected mass killer Nikolas Cruz remains locked up in solitary confinement. Fox News has obtained jailhouse observations by corrections staff. They include: \"Inmate avoids eye contact, looks downward with blank stare,\" \"appears to be coherent while speaking to his attorneys,\" \"had a family visit per command staff,\" and \"inmate requested to read i.e. (Bible)\"",
      "date": "March 7, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Warren promises to pick public school teacher as education secretary in response to 'terrible' DeVos",
      "url": "https://www.foxnews.com/politics/warren-promises-to-pick-public-school-teacher-as-education-secretary-in-response-to-terrible-devos",
      "subtitle": "Warren promises to pick public school teacher as education secretary in response to 'terrible' DeVos",
      "author": "Ronn Blitzer",
      "content": " Presidential hopeful Sen. Elizabeth Warren, D-Mass., made a surprise promise regarding her potential cabinet on Monday, in the midst of a tirade against Secretary of Education Betsy DeVos. Warren blasted DeVos for her history of being in favor of for-profit colleges and lack of teaching experience. In contrast, Warren guaranteed that, if she wins in 2020, she will only consider hiring someone with public school teaching experience. ELIZABETH WARREN DESCRIBED AS 'DIEHARD CONSERVATIVE' IN SCHOOL \"She doesn't really believe in public education,\" Warren said about DeVos in a video message posted in a Twitter thread targeting DeVos. \"So here's what I promise: in a Warren administration, we'll have a Secretary of Education who is committed to public education. In fact, I'll double down on that. I will only appoint for Secretary of Education someone who has been a public school teacher.\" Warren's remarks included a number of angry statements about DeVos, calling her \"a terrible Secretary of Education\" and \"a symptom of a badly broken system.\" Under the current system, she said, \"America's teachers are being crushed\" by low budgets and salaries, as well as their own student debt. She said hiring someone with public school experience would be part of a necessary \"big structural change.\" JOHN STOSSEL: WHAT HATERS DON'T GET ABOUT BETSY DEVOS The Democratic senator added, \"we need to make it easier to join a union,\" saying that would give them negotiating power that would be \"good for making sure we put the resources we need directly into our schools.\"",
      "date": "May 13",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Betsy DeVos' family boat untied from dock, causing up to $10G in damage, police say",
      "url": "https://www.foxnews.com/politics/betsy-devos-family-boat-untied-from-dock-causing-up-to-10g-in-damage-police-say",
      "subtitle": "Betsy DeVos' family boat untied from dock, causing up to $10G in damage, police say",
      "author": "Kaitlyn Schallhorn",
      "content": " A $40 million yacht owned by Education Secretary Betsy DeVos' family was untied from its dock this weekend, causing thousands of dollars in damage, police said. The 163-foot Seaquest yacht had been moored at the Huron Boat Basin when the captain alerted authorities early Sunday morning it had been untied and set adrift, according to a police report provided to Fox News. According to the Toledo Blade, which first reported on the incident, the yacht had \"several large scratches and scrapes\" from hitting a dock – resulting in what the captain estimated to be between $5,000 to $10,000 in damage. The investigation is ongoing, Huron Police Chief Bob Lippert told Fox News on Thursday morning. DeVos was in Ohio earlier this month to tour a career center and a correctional treatment program. One of the more controversial figures in the Trump administration, she assumed office as secretary of the Education Department in February 2017. PROTESTERS BLOCK DEVOS FROM ENTERING DC SCHOOL She’s a proponent of school choice and charter schools – which has resulted in large protests when she addresses college students. Her decision to rescind an Obama-era guidance instructing how college campuses investigate allegations of campus sexual assault was also met with indignation. DeVos and her husband are known for their philanthropic work – especially when it comes to education – in their home state of Michigan. SEN. MARK WARNER’S OFFICE VANDALIZED; SUSPECT ARRESTED A spokeswoman previously announced that DeVos plans to donate her nearly $200,000 salary to charities that focus on special needs and education. She also travels on her own private plane, but foots the bill, The Associated Press reported. The Seaquest is one of 10 vessels owned by the DeVos family. According to MarineTraffic.com, the yacht was back in Harbor Springs, Michigan, Thursday morning. The Associated Press contributed to this report.",
      "date": "July 26, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Betsy DeVos cancels $150 million of student loan debt after losing court battle",
      "url": "https://www.foxnews.com/politics/betsy-devos-cancels-150-million-of-student-loan-debt-after-losing-court-battle",
      "subtitle": "Betsy DeVos cancels $150 million of student loan debt after losing court battle",
      "author": "Kaitlyn Schallhorn",
      "content": " The Department of Education said it will cancel $150 million of student loan debt, impacting about 15,000 people whose schools closed. The Obama-era borrower defense relief program – which essentially ground to a halt under Education Secretary Betsy Devos – provided a path for people to seek forgiveness for federal student loans if a shuttered school violated specific laws or misled students. DeVos was highly critical of the program, reportedly calling it a “free money” giveaway, and sought to change and delay the program. However, she was sued, and a federal judge ruled in September the program needed to “go into effect.” Those eligible for loan forgiveness must have been enrolled at the school when it closed and not enrolled at another Title-IV school within three years of the previous school’s closing, according to the Education Department. PLUS loans – which parents took out on behalf of children – could also be eligible for discharge. EDUCATION DEPARTMENT UNVEILS NEW TITLE IX GUIDANCE FOR CAMPUS SEXUAL ASSAULT: HERE’S WHAT WILL CHANGE So far, about 15,000 people have been flagged by the Education Department as eligible. About $80 million of the $150 million debt is attributed to the now-defunct Corinthian schools. Borrowers will begin to be notified of student loan discharges by email on Friday, the department said. BETSY DEVOS CONSIDERING ALLOWING STATES TO USE FEDERAL FUNDS TO BUY GUNS: REPORT “This is a good first step, but it’s not good enough,” said Sen. Patty Murray, the top Democrat on the Education Committee. She called on DeVos to “abandon her attempts to rewrite the borrower defense rule to let for-profit colleges off the hook and instead fully implement the current rule and provide relief to more than 100,000 borrowers who were cheated out of their education and savings.” Republican Sen. Lamar Alexander, the Education Committee chair, previously argued the “Obama administration went too far in rewriting this provision by setting overly broad and vague standards and as a result, put taxpayers on the hook for too many loans.”",
      "date": "December 14",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Education Secretary Betsy DeVos recovering in wheelchair from bicycle accident injuries",
      "url": "https://www.foxnews.com/politics/education-secretary-betsy-devos-recovering-in-wheelchair-from-bicycle-accident-injuries",
      "subtitle": "Education Secretary Betsy DeVos recovering in wheelchair from bicycle accident injuries",
      "author": "",
      "content": "Education Secretary Betsy DeVos is wheelchair-bound after breaking her pelvis and hip socket in a bicycling accident over the holidays. “Secretary DeVos is back in the office full time. The accident happened over the holiday. She’s doing well,” Education Department Press Secretary Liz Hill told Fox News. DeVos made her first public appearance while recovering from the incident at an entrepreneurship event Thursday in Washington, D.C. DEVOS REWRITE OF TITLE IX SEX ASSAULT RULES WILL ALLOW CROSS-EXAMINATION OF ACCUSERS, REPORT SAYS “Very painful,” she said at The Lemonade Day event, according to Politico. “But it will heal. I just have to stay off of it for quite a few weeks, so I’m getting around with other means.” The Education Department reported last week that DeVos simply had broken a bone and underwent surgery to repair it. DeVos needed a few days of bed rest but was expected to make a full recovery, Hill said. CLICK HERE TO GET THE FOX NEWS APP The Lemonade Day, was hosted by Gallup and focused on overcoming entrepreneurial challenges faced by business-related startups. DeVos reportedly hammered home her belief that the American education experience should be individualized, which, in turn, will foster more American entrepreneurship. She also expressed her excitement about schools that provide career programs to students early on in life.",
      "date": "January 17",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Dem-pushed probe into Betsy DeVos' personal email use finds no 'active or extensive' misconduct",
      "url": "https://www.foxnews.com/politics/democrat-probe-betsy-devos-personal-email-misconduct",
      "subtitle": "Dem-pushed probe into Betsy DeVos' personal email use finds no 'active or extensive' misconduct",
      "author": "Gregg Re",
      "content": " Education Secretary Betsy DeVos did not make \"active or extensive\" use of her personal email accounts to conduct official business, according to an internal watchdog inquiry long pushed by House Democrats that concluded with a whimper on Monday. Congressional Democrats for months have aggressively pursued a variety of probes into DeVos, who has frustrated liberal lawmakers by embracing deregulation and methodically dismantling the Obama administration's education platform. But this particular review largely came up empty, with the Education Department's Office of Inspector General saying it searched the department's email system and found only a \"limited\" number of messages to or from DeVos' personal accounts. In total, the watchdog said there were \"fewer than 100\" emails linked to four personal accounts. Most of the emails were from the first six months of 2017, soon after DeVos took office, and most were from a single person, the inquiry found. DEVOS BLASTS 'SHAMEFUL' MEDIA COVERAGE OF SPECIAL OLYMPICS PROPOSED CUTS The person, who was not identified in the report, was writing to recommend candidates for agency jobs. Other emails were from people who congratulated DeVos on her confirmation or offered other job advice. The secretary's office told investigators it was taking \"additional steps to identify and preserve\" emails in her personal accounts. A department spokeswoman declined to comment. SECRETARY OF EDUCATION BETSY DEVOS TAKES EXCEPTION WITH JOE BIDEN FOR SAYING WE NEED TO END TRUMP-DEVOS EDUCATION AGENDA Under department rules, employees are forbidden from using personal emails for government business except in rare circumstances when their work accounts are unavailable. In those cases, employees are required to forward the messages to their work accounts within 20 days. But in DeVos' case, the report said, that never happened. \"We did not identify any instances where the secretary forwarded emails from her personal accounts to her department email accounts,\" the report said. It added that \"the secretary's emails related to government business were not always being properly preserved.\" The inspector general's office urged the department to improve its training on the issue. It said there was no other evidence of irregularities around the use of personal emails. During his 2016 campaign, President Trump repeatedly attacked Democratic rival Hillary Clinton over findings that she used a private email server for work while she was secretary of state. At rallies, Trump often called for her prosecution and led supporters in chants of \"lock her up!\" CLICK TO GET THE FOX NEWS APP DeVos, unlike Clinton's subordinates, did not delete tens of thousands of emails that were subpoeaned by Congress, nor did DeVos maintain private email servers hosted in her homes. Additionally, none of the emails sent by DeVos involved classified information, while several emails that found their way onto Clinton's personal email server contained classified materials -- including messages that were marked classified at the time they were sent. The Education Department review was requested in October 2017 by Rep. Rosa DeLauro, D-Conn. However, the inspector general's office said it was unable to begin work until \"well into 2018\" because of staffing challenges. The Associated Press contributed to this report.",
      "date": "May 20",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "DeVos held in contempt of court in loan forgiveness dispute",
      "url": "https://www.foxnews.com/politics/devos-held-in-contempt-of-court-in-loan-forgiveness-dispute",
      "subtitle": "DeVos held in contempt of court in loan forgiveness dispute",
      "author": "",
      "content": "WASHINGTON -- A federal judge has held Education Secretary Betsy DeVos in contempt of court for violating an order to stop collecting loans from thousands of former for-profit college students. U.S. Magistrate Judge Sallie Kim issued the ruling Thursday in San Francisco. She also fined the Education Department $100,000. Kim previously ordered DeVos to stop collecting federal loans from former Corinthian Colleges students who applied for loan forgiveness after the chain shut down in 2015 amid allegations of fraud. The Obama administration sought to make it easier for defrauded students to get loans forgiven, but the Trump administration has worked to tighten the rules. The Education Department acknowledged in September that it continued to collect loans from more than 3,000 former Corinthian students, prompting Kim's response. The department did not immediately comment.",
      "date": "October 25",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Betsy DeVos held in contempt by federal judge for violating order on student loan collection",
      "url": "https://www.foxnews.com/politics/betsy-devos-contempt-violating-order-student-loan-collection",
      "subtitle": "Betsy DeVos held in contempt by federal judge for violating order on student loan collection",
      "author": "Vandana Rambaran",
      "content": " A federal judge held Education Secretary Betsy DeVos in contempt of court on Thursday and sanctioned the Education Department with a $100,000 fine after it said DeVos refused to comply with a court mandate to cease collection of loans from students who were defrauded by now-defunct Corinthian Colleges. The move comes after the Education Department continued to garnish wages and seize tax returns of nearly 1,800 borrowers who were granted loan forgiveness by the courts under the borrower defense to repayment program, after Corinthian -- embroiled in scandal and bankruptcy -- was forced to close in 2015, the court said. The initiative sought to provide loan relief to students who were misled by the school, but DeVos, a Trump appointee, tried to limit the scope of the program even after a judge's ruling in 2018. “Given that there are over 16,000 borrowers who have suffered damages from [the] defendants’ violation of the preliminary injunction, and given that there may be some administrative expenses to remedy the harm, the court finds the amount reasonable,” Sallie Kim, a federal magistrate judge in California, wrote in a court order. BETSY DEVOS BLASTS DEMOCRATS' 'CRAZY' PLANS TO ELIMINATE STUDENT LOAN DEBT \"Here, there is no question that [the] defendants violated the preliminary injunction,” the court order said. “There is also no question that [the] defendants’ violations harmed individual borrowers who were forced to repay loans.” According to Kim, “the evidence shows only minimal efforts to comply with the preliminary injunction\" to grant full relief to students. Instead, the judge said DeVos implemented a new methodology that calculated a borrower's eligibility for partial loan forgiveness based on their average earnings. The judge also said that the Education Department \"mistakenly notified at least 3,000 Corinthian borrowers that their loans are entering repayment, rather than stopped collection or forbearance status.\" CLICK HERE FOR THE FOX NEWS APP Kim threatened to \"impose additional sanctions, including the appointment of a Special Master to ensure compliance with the preliminary injunction” if DeVos and the Education Department  “fail to comply” with the order.",
      "date": "October 24",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    }
  ]
}