{
  "articles": [
    {
      "title": "Trump asks Supreme Court to block House subpoena for financial records",
      "url": "https://www.foxnews.com/politics/trump-asks-supreme-court-to-block-house-subpoena-for-financial-records",
      "subtitle": "Trump asks Supreme Court to block House subpoena for financial records",
      "author": "",
      "content": "WASHINGTON – President Donald Trump wants the Supreme Court to keep House Democrats from getting his financial records at least until the justices resolve a broader fight over efforts to subpoena a sitting president’s records. Trump filed an emergency appeal with the court Friday in a case from Washington, D.C., over a subpoena from a House committee for financial records held by Trump’s accountants. The request comes a day after he urged the high court to rule that a president cannot be prosecuted or even investigated for crimes while in office. The Thursday filing involves a subpoena issued by the Manhattan district attorney demanding Trump’s tax returns from the same accounting firm. A temporary order blocking the enforcement of the House subpoena could allow the court to consider the two cases together. The New York dispute is on a fast timetable under which the high court is being asked to render a decision by late June. Without an order from the justices, the House Committee on Oversight and Reform would be able to ask for the records from the Mazars USA firm as early as Wednesday. Mazars has indicated it will comply with the subpoena unless ordered not to. CLICK HERE TO GET THE FOX NEWS APP Trump directed his request to Chief Justice John Roberts because he handles emergency matters arising from courts in the nation’s capital. Roberts could ask the full court to weigh in, but he has the authority to issue an order on his own. The two subpoenas are similar. Indeed, Manhattan District Attorney Cyrus Vance Jr. has said he copied the House subpoena, although he substituted tax returns for the financial records the House is demanding. The House subpoena does not specifically mention Trump’s tax returns.",
      "date": "November 15",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Trump ordered to pay $2M in Trump Foundation settlement, admits misuse of funds",
      "url": "https://www.foxnews.com/politics/potus-to-pay-2-million-admits-misuse-of-trump-foundation-funds-in-settlement-with-ny-ag",
      "subtitle": "Trump ordered to pay $2M in Trump Foundation settlement, admits misuse of funds",
      "author": "Ronn Blitzer",
      "content": " The New York Attorney General's office announced Thursday that a judge has ordered President Trump to pay $2 million in damages for improper use of funds at the Trump Foundation in connection with the 2016 presidential primaries and his own political purposes, as part of a lawsuit Trump and the foundation settled with state Attorney General Letitia James. James' office had requested $2.8 million in restitution and a $5.6 million penalty, but Judge Saliann Scarpulla decided $2 million was a more reasonable restitution amount and declined to issue a penalty. As part of the settlement, Trump admitted to misusing Trump Foundation funds and agreed to limitations placed on future charitable work. If he chooses to start a new charitable organization, he would have to report it to the state attorney general's office, according to an announcement from James' office. TRUMP FOUNDATION AGREES TO DISSOLVE AFTER LAWSUIT ALLEGED 'ILLEGAL CONDUCT' \"The Trump Foundation has shut down, funds that were illegally misused are being restored, the president will be subject to ongoing supervision by my office, and the Trump children had to undergo compulsory training to ensure this type of illegal activity never takes place again,” Attorney General Letitia James said in statement. “The court’s decision, together with the settlements we negotiated, are a major victory in our efforts to protect charitable assets and hold accountable those who would abuse charities for personal gain.\" But Trump himself released a statement on Twitter on Thursday night saying James is “deliberately mischaracterizing this settlement for political purposes.\" The state filed the lawsuit against the Trump Foundation in June 2018, and the settlement includes four stipulation agreements, the first of which was fulfilled when the Trump Foundation agreed to shut down in Dec. 2018. The other three stipulations were added in Oct. 2019. They include distribution of the remainder of the foundation's assets to charities approved by James' office, training for the president's children Ivanka, Eric, and Donald Jr., and 19 paragraphs of Trump's admissions of illegal activity. Those admissions include failure of the foundation's board to meet or engage in proper oversight, and details regarding coordination with Trump's 2016 campaign, including a Trump Foundation fundraiser that the campaign organized, and use of foundation funds to pay legal obligations, and for a $10,000 portrait of Trump. As part of the settlement, James' office said, Donald Trump Jr. reimbursed the foundation for the portrait. CLICK HERE FOR THE FOX NEWS APP The Attorney General's office stated that the $2 million in damages and the remaining $1.78 million that the foundation has will go to Army Emergency Relief, the Children’s Aid Society, Citymeals-on-Wheels, Give an Hour, Martha’s Table, United Negro College Fund, United Way of National Capital Area, and the U.S. Holocaust Memorial Museum. In a statement, a Trump Foundation spokesperson said the foundation was \"pleased to donate an additional $2 million\" to those organizations. \"Following the 2016 presidential election, the Trump Foundation publicly announced its intention to voluntarily dissolve and distribute all of its remaining funds to charity,\" the statement said. It continued: \"Unfortunately, that donation was delayed due to the Attorney General’s politically motivated lawsuit.  We are pleased that the Court, in rejecting the Attorney General’s frivolous request for statutory penalties, interest and other damages, recognized that every penny ever raised by the Trump Foundation has gone to help those most in need. Now that this matter is concluded, the Trump Foundation is proud to make this additional contribution.\" Fox News' John Roberts contributed to this report.",
      "date": "November 7",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Donald Trump's feud with McCain family escalates: 'I was never a fan'",
      "url": "https://www.foxnews.com/politics/donald-trumps-ongoing-feud-with-meghan-and-john-mccain-escalates-with-new-social-media-posts",
      "subtitle": "Donald Trump's feud with McCain family escalates: 'I was never a fan'",
      "author": "Liam Quinn",
      "content": " The feud between President Trump and John's McCain family escalated Tuesday as a top campaign adviser clashed with daughter Meghan McCain, and the president himself declared he's \"not a fan\" of the late Republican senator. “I was never a fan of John McCain and I never will be,” Trump told reporters at the White House, during a meeting with Brazil's visiting president. The comments comes after Meghan McCain, who on Monday tore into the president during an emotional segment on “The View,” went back on the offensive on social media. The 34-year-old shared a Toronto Star cartoon on Instagram showing her late father’s military medals side-by-side with a collection of pacifiers under the heading, “Donald Trump.” Shortly afterward, Trump campaign senior adviser Katrina Pierson fired back by mocking her post with one of her own. MEGHAN MCCAIN SLAMS DONALD TRUMP IN EMOTIONAL 'THE VIEW' SEGMENT: 'HE WILL NEVER BE A GREAT MAN' Pierson shared an edited version of the cartoon with the presidential seal replacing the pacifiers under Trump’s name. The cartoonist’s name and the Toronto Star had also been cropped out of the image. The latest shots were fired after McCain hammered Trump on Monday’s episode of “The View.” “He spends his weekend obsessing over great men because he knows it, I know it, and all of you know it, he will never be a great man,” she said. “My father was his kryptonite in life and he was kryptonite in death. On a personal level, all of us have love and families and when my father was alive until adulthood we would spend our time fishing, cooking, really celebrating life and I think it’s because he almost died. MEGHAN McCAIN HAS SHARP RESPONSE TO TRUMP'S JOHN MCCAIN DOSSIER TWEET “And I just thought ‘your life is spent on weekends not with your family, not with your friends but obsessing.’ Obsessing over great men you could never live up to. That tells you everything you need to know about his pathetic life.” McCain closed out the rebuke by adding: “I genuinely feel bad for his family. I can’t imagine having a father that does this on the weekends.” Trump has repeatedly tweeted about John McCain in recent days, falsely claiming the late senator graduated “last in his class” at Annapolis and slamming his role in the Russia investigation. “So it was indeed (just proven in court papers) “last in his class” (Annapolis) John McCain that sent the Fake Dossier to the FBI and Media hoping to have it printed BEFORE the Election. He & the Dems, working together, failed (as usual). Even the Fake News refused this garbage!” Trump tweeted Sunday morning. COURT FILES REVEAL ROLE OF MCCAIN, ASSOCIATE IN SPREADING ANTI-TRUMP DOSSIER On Saturday, the president responded to reports McCain and an associate had shared with the FBI and various media outlets the unverified dossier alleging that Moscow held compromising information on Trump. “Spreading the fake and totally discredited Dossier ‘is, unfortunately, a very dark stain against John McCain.’ Ken Starr, Former Independent Counsel,” Trump wrote. “He had far worse ‘stains’ than this, including thumbs down on repeal and replace [of the Obama-era Affordable Care Act] after years of campaigning to repeal and replace!” CLICK HERE TO GET THE FOX NEWS APP Meghan McCain, bristling at the remark, fired back with her own Twitter post, in which she said that “no one will ever love you the way they loved my father.” Trump has made of habit of attacking McCain, even after the former Arizona senator’s death in August last year. Fox News' Paulina Dedaj contributed to this report.",
      "date": "March 19",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Donald Trump, down to earth",
      "url": "https://www.foxnews.com/politics/donald-trump-down-to-earth",
      "subtitle": "Donald Trump, down to earth",
      "author": "Chris Stirewalt",
      "content": " On the roster: Donald Trump, down to earth - Time Out: Wolfgang leads the pack - Trump Labor nominee teetering - Netanyahu seeks ‘no gaps’ ahead of Trump meeting - Unabashed haberdasher\n\nDONALD TRUMP, DOWN TO EARTH\nThe departure of Michael Flynn as President Trump’s national security adviser has official Washington grinding like a chop saw on a ham hock.\n\n To call it a full freak out would be an insult to freaks.\n\n But as we have often discussed here, one of the most common conceits of humankind is that the matters of our own moment are unlike anything that have come before. While much of our current political condition is extraordinary, the truth is that we have been here before. Or at least in this neighborhood.\n\n We will come back to Flynn and the current discombobulation at the White House, but first, let’s hop in the Wayback Machine.\n\n It was Feb. 3, 2009 that the newly minted Obama administration hit the skids.\n\n Recall the initial promise of the 44th president’s tenure: a cool, technocratic, center-leftism that would deliver liberal policies but with such smart efficiency that even the business world would stand up and cheer.\n\n If you had “transformative” on your Beltway buzzword bingo game, congratulations.\n\n Here was the idea: The Panic of 2008 and the deepening recession would make America ready for a new, pragmatic leftism powered by newly chic policy geeks, big data and the connectedness of its supporters that would sweep away the grubby, short-sighted politics of the previous 20 years in favor of strategic thinking.\n\nPresident Obama was like FDR. No, wait. Like Lincoln. Hold on. He’s really Mr. Spock.\n\n Front and center on the bridge of the Enterprise and channeling the excitement of the coming technocratic revolution was former Senate Majority Leader Tom Daschle.\n\n Though he had become a Washington influence peddler since getting bounced out on his fodder shocks by the voters of South Dakota in 2004, this transgression could be forgiven. Daschle was serving as the guru of what was and would, unfortunately for the new president, remain the centerpiece of his administration: a massive restructuring of the American health care system.\n\n But revolutionizing American health care was just part of the transformation. The way government itself operated would change as well. Accordingly, the president ordered the creation of the position of “chief performance officer” and tapped management consultant extraordinaire Nancy Killefer to launch the office.\n\n With a master’s in business from M.I.T. and a sterling record at mega-consultancy McKinsey & Co., Killefer was going to give the federal government the equivalent of a colonoscopy to root out waste, inefficiency and outmoded practices.\n\n It was particularly important because Obama was pushing a $775 billion spending package that looked suspiciously like Washington business as usual, an unfocused heap of spending larded with goodies for powerful politicians and their friends.\n\n Not so, said Obama, vowing Killefer would take “unprecedented measures to ensure that taxpayers keep track of how this money is spent.” Obama allowed that his plan would cause the deficit spending about which had been so bitterly complaining under his predecessor to further skyrocket.\n\n The new president promised, though, that best practices imposed by Killefer and her fellows would ensure that the tide of red ink would soon be turned back and balanced budgets would return.\n\n But then **poof** both she and Daschle were gone.\n\n They had both failed to pay some of their taxes and having just pushed through Timothy Geithner’s nomination as treasury secretary despite his own tax foibles, the president and his administration had no appetite for further embarrassments of the same kind.\n\n And in one day, the narrative changed. The transformational technocratic president and his team became bumblers whose arrogance and lack of experience was putting everything at risk. By April, the health law was a mess and the stimulus was a “shovel-ready” joke.\n\n Now, we have no idea what twists and turns will follow Flynn’s late-night ejection from the Trump bubble. But we can know that this is one of those moments when the impossible expectations of a presidency come hurtling earthward.\n\n Of course, the narrative around Trump was quite the opposite of the one that welcomed Obama. Trump was greeted as a fascistic destroyer who would turn the federal government into a ruthlessly efficient engine of sadistic racism and cruelty.\n\n If Obama was going to turn America into “Star Trek,” Trump was staging a remake of “The Man in the High Castle.”\n\n The good thing about the stumbles of presidential administrations is how they remind Americans of the real limits of practical power in our system. Remember that the best argument against conspiracy theories is the rank evidence of human incompetence everywhere.\n\n If the Nixon administration couldn’t cover up a botched burglary do you think it really faked the moon landing?\n\n Flynn’s tumultuous tenure was an easily avoided mistake. The president and his aides had been warned repeatedly about Flynn’s unnerving proximity to the Kremlin and bent toward other controversial views.\n\n Trump, understandably grateful that Flynn had long ago staked his then-considerable reputation on backing Trump’s once-improbable presidential bid gave his “favorite general” the benefit of the doubt and assigned Flynn to the plum post\n\n When Flynn was found to have misled Vice President Mike Pence about – of all subjects! – his contacts with Russian officials, the mistake was plainly evident. And, quite understandably, Flynn had to go before he further compromised the trust of the national security team or did more damage to the administration on the already fraught subject of Kremlin ties.\n\n **Poof**\n\n Trump has work to do in buttoning up his White House and finding some way to plug the leaks that so often plague factious administrations such as this one, but that’s not why Flynn is gone. He’s gone because he lived down to the expectations of his critics and proved to be a liability that exceeded his value to the president.\n\n And that is the most normal thing of all for a new administration. And like every other administration this one will make more mistakes as it learns the ropes of governance. The failure of Flynn is just one of many moments in which the missed expectations of the new team will be painfully revealed.\n\n Remember, it’s not just the press and the public with outsized ideas about what a new president is capable of...\n\nTHE RULEBOOK: SOME THINGS NEVER CHANGE\n“Divide et impera [divide and rule] must be the motto of every nation that either hates or fears us.” ― Alexander Hamilton, Federalist No. 7\n\nTIME OUT: WOLFGANG LEADS THE PACK\nAletia: “The artist who sold more albums than anyone in 2016 had no need to promote his work with an international tour. In fact, he has not given a concert himself in some 200 years (though his work is covered by other artists all the time). His name is more widely recognized than that of any living performer. According to a report published by Billboard, Wolfgang Amadeus Mozart broke all records this year thanks to the publication of a new collection containing his entire musical work. Released in October, Mozart 225: The New Complete Edition is a 200-disc collection containing the complete catalogue of the Austrian genius: symphonies, concertos and even unfinished fragments are all included. Priced just over $300, the collction became the year’s top seller, leaving Beyoncé, Kanye, and Adele way behind. Although a little more than 6,000 copies of the collection have been sold, because it consists of 200 discs the total number of sold records amounts to 1,250,000. Not bad for an artist who has never made a music video or shown up at the Grammy Awards in a rhinestone tuxedo, huh?”\n\nFlag on the play? - Email us at HALFTIMEREPORT@FOXNEWS.COM with your tips, comments or questions.\n\nTRUMP LABOR NOMINEE TEETERING\nWaPo: “Andrew Puzder, the fast-food executive whom President Trump nominated to be labor secretary, emerged Monday as Democrats’ last, best hope of defeating one of Trump’s Cabinet choices as four key Republicans are on the fence about his nomination. … Puzder has also been accused of domestic abuse — an accusation that was later recanted — and has acknowledged hiring an undocumented worker for his home.  … The Republican senators who were noncommittal about Puzder’s nomination on Monday — Susan Collins (Maine), Johnny Isakson (Ga.), Lisa Murkowski (Alaska) and Tim Scott (S.C.) — sit on the committee that will hold his confirmation hearing Thursday. If they oppose him, his nomination is all but certainly dead.”\n\nMnuchin minted as new Treasury chief - NYT: “The Senate confirmed Steven T. Mnuchin, a former Goldman Sachs banker and Hollywood film financier, to be Treasury secretary on Monday, putting in place a key lieutenant to President Trump who will help drive the administration’s plans to overhaul the tax code, renegotiate trade deals around the world and remake financial regulations. By a vote of 53 to 47, the Senate confirmed Mr. Mnuchin, who was Mr. Trump’s top campaign fund-raiser. … The new Treasury secretary will have little time to celebrate. He will be under pressure to help finalize the Trump administration’s tax plan, accelerate the rollback regulations and raise the government’s borrowing limit. The administration has said it will release a comprehensive plan to rewrite the tax code in the coming weeks, and it will have to deal with the debt ceiling next month.”\n\nMcMahon steps into the ring - The Hill: “The Senate on Tuesday cleared pro wrestling magnate Linda McMahon to lead the Small Business Administration (SBA). McMahon, the World Wrestling Entertainment co-founder and former CEO, was approved by an 81-19 vote. She needed a simple majority vote to be confirmed. Despite her lack of government experience, McMahon found bipartisan support, clearing through the Small Business and Entrepreneurship Committee with only Sen. Cory Booker (D-N.J.) voting against her.”\n\nNETANYAHU SEEKS ‘NO GAPS’ AHEAD OF TRUMP MEETING\nReuters: “Prime Minister Benjamin Netanyahu, preparing for his first meeting with President Donald Trump at the White House, will work with advisers on Tuesday to align Israeli and U.S. thinking on the Middle East and ensure ‘no gaps’ remain…Those reassurances came as Netanyahu took a cautious line on whether he would support a two-state solution to the Israeli-Palestinian conflict, the bedrock of U.S. diplomacy for two decades, when he sits down [Wednesday] with Trump. During the presidential campaign, Trump was often unabashedly pro-Israel, promising to move the U.S. embassy from Tel Aviv to Jerusalem, backing David Friedman, a supporter of settlements, as his envoy to Israel, and saying that he wouldn’t apply pressure for talks with the Palestinians. But in the three-and-a-half weeks since taking office, positions have shifted.”\n\n [Watch Fox: New Fox News poll numbers on President Trump’s job performance, top priority in the first 100 days and the president’s executive order on immigration are released at 6 p.m. ET on “Special Report with Bret Baier.”]\n\nAUDIBLE: OVER\n “He knew he’d become a lightning rod” – Trump Adviser Kellyanne Conway in an interview with NBC on Gen. Michael Flynn’s decision to resign as National Security Adviser.\n\nPLAY-BY-PLAY\nTop Dem on House Intel Committee says more to come on Flynn-Russia ties – Politico\n\nTrump, Republicans eye ‘illegal’ leaks after Flynn resignation – Fox News\n\nSen. Roy Blunt, R-Mo., calls for exhaustive investigation of Trump-Russia connections - The Hill\n\nAt look at some possible replacements for Flynn - Roll Call\n\nGossip shop: Kushner holds Bannon tight - Vanity Fair\n\nTrump scraps plans to sign measure repealing Obama coal rule in Ohio - WashEx\n\nJudges on two coasts deal blows to Trump refugee ban - Bloomberg\n\nWhite House posts wrong versions of Trump’s orders on its website - USA TODAY\n\nWhite House to resume public tours after lawmakers complain - WashEx\n\nFROM THE BLEACHERS\n “If the phone calls are recorded and listened to, why all the hullabaloo?  Just listen and report.” – Geraldine Ross, Pennsylvania\n\n[Ed. note: Oh, don’t I wish I had access to them, Ms. Ross! The point I was aiming for on Monday was that while the secrets are seldom divulged, they are known to someone. Presidents often succeed in keeping things secret from the public, but their work requires that those around them are aware of what’s happening. That’s not just to help them implement the orders but also protect the boss from spies and the release of false information. It’s a lonely life there in the middle of the presidential fishbowl. We should be grateful that so many good men throughout our history have been willing to pay the price.]\n\n “You and Dana are outstanding. I wish you were on more than once a week. If you weren't a Cardinal fan, i would give you even more compliments about\n your outstanding work on Fox, but enough is enough. Looking forward to pounding the Cardinals again this year and listening to you and Dana continue.” – George Lesniak, Chicago\n\n[Ed. note: Your note reaches me just as pitchers and catchers report so I am awash with the good spirits that always emerge from the start of another season. I am full of hope and good cheer. So I have decided: I’m fine with the Cubs keeping up their current pace of championships. One every 108 years sounds just right to me!]\n\nShare your color commentary: Email us at HALFTIMEREPORT@FOXNEWS.COM and please make sure to include your name and hometown.\n\nUNABASHED HABERDASHER\nDaily Mail: “An angry tailor has sent its customer a shirt emblazoned with male genitalia after she complained about its alteration work to her $2,000 suit. Perth lawyer Francesca Bucolo said the shirt – featuring dozens of penises - was personally delivered to her Perth office on Friday. … The delivery comes three months after Ms Bucolo sued LGFG Fashion House over a $2,000 three-piece suit which she bought in May last year. … Ms Bucolo said she was forced to return the suit to the Canada-based tailor eight times, before she finally gave up and resorted to taking legal action to get her money back. LGFG Fashion House offered Ms Bucolo a 50 per cent refund on the suit and five free tailored shirts to settle the lawsuit out of court. But when the shirts were personally delivered to her office on Friday, three months after the settlement, Ms Bucolo said she was disgusted.”\n\nChris Stirewalt is the politics editor for Fox News. Want FOX News Halftime Report in your inbox every day? Sign up here.",
      "date": "February 14, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Donald Trump Jr.'s wife, Vanessa, files for divorce",
      "url": "https://www.foxnews.com/politics/donald-trump-jr-s-wife-vanessa-files-for-divorce",
      "subtitle": "Donald Trump Jr.'s wife, Vanessa, files for divorce",
      "author": "Brooke Singman",
      "content": " Vanessa Trump filed for divorce from her husband, President Trump’s eldest son, Donald Trump Jr., on Thursday in New York City. As first reported by the New York Post Page Six on Thursday and confirmed by Fox News, the president’s daughter-in-law filed in an uncontested proceeding in Manhattan Supreme Court, meaning she does not expect a legal battle over custody of their five children or assets. In a statement obtained Thursday night, the couple said: \"After 12 years of marriage, we have decided to go our separate ways. We will always have tremendous respect for each other and our families. We have five beautiful children together and they remain our top priority. We ask for your privacy during this time.” Vanessa and Trump Jr. were married in 2005. Page Six reported earlier this week that the couple has been struggling through marital problems. The White House declined to comment to Fox News. Last month, Vanessa was taken to the hospital after receiving a letter containing white powder that was later deemed to be non-hazardous, New York City police told Fox News. The president’s daughter-in-law opened the letter addressed to Donald Jr. in the couple’s Manhattan apartment. It is still unclear what the white powder was. He tweeted at that time that he was “thankful that Vanessa & my children are safe and unharmed after the incredibly scary situation that occurred this morning. Truly disgusting that certain individuals choose to express their opposing views with such disturbing behavior.” Trump Jr. ditched his Secret Service detail for a period of time in September, reportedly because he wanted more privacy. Sources told Page Six that Vanessa is a private person. But his detail was reactivated about a week later.",
      "date": "March 15, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "House rebukes Trump on border wall, but he plans veto",
      "url": "https://www.foxnews.com/politics/house-rebukes-trump-on-border-wall-but-he-plans-veto",
      "subtitle": "House rebukes Trump on border wall, but he plans veto",
      "author": "",
      "content": "The Democratic-controlled House is making a second attempt to overturn President Donald Trump's use of emergency powers to raid military base projects such as schools and target ranges to pay for his long-promised border fence. The 236-174 vote sent the legislation to Trump, who is sure to veto it just as he killed a similar measure in March. The Senate passed the measure last week with about a dozen veteran Republican lawmakers rebuking Trump. Friday's vote was different because it followed the recent release by the administration of a list of 127 military construction projects totaling $3.6 billion that will be canceled to pay for the border wall, including numerous projects in GOP districts and states.",
      "date": "September 27",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Donald Trump, Hillary Clinton loom over Virginia 2018 Senate race",
      "url": "https://www.foxnews.com/politics/donald-trump-hillary-clinton-loom-over-virginia-2018-senate-race",
      "subtitle": "Donald Trump, Hillary Clinton loom over Virginia 2018 Senate race",
      "author": "",
      "content": "A Senate race between Hillary Clinton’s running mate and a candidate characterized as the Donald Trump of Virginia is likely to garner massive national attention, even if it isn’t competitive—and for now, polls indicate it isn’t. President Trump’s approval rating took its toll on Republicans in Virginia’s 2017 state elections, while Clinton has drawn little positive attention since her 2016 loss in the presidential race. Nevertheless, both will be paramount in this contest. “If Hillary Clinton wants to come to Virginia, of course we would welcome her,” Ian Sams, the campaign spokesman for Sen. Tim Kaine, D-Va., told Fox News. “Remember, she did win Virginia in 2016 by five-and-a-half points.” The top Republicans vying to challenge Kaine seem ready for Hillary themselves. Corey Stewart, the chairman of the Prince William County Board of Supervisors, is known for battling illegal immigration and defending Confederate statues. “We’re not just going to tie him to her run for president, but to the things she has said since November 2016,” Stewart told Fox News, referencing the recent Clinton comment on married women’s inability to think for themselves if they didn’t vote for her. “The Clinton campaign outspent the Trump campaign 7-1 in Virginia,” Stewart said. “Trump pulled his resources from Virginia to focus on more competitive states. It was probably the right call, but even after all that, Clinton-Kaine only won by 5 points.” Trump’s campaign fired Stewart a month before election day for joining a protest in front of Republican National Committee headquarters. Stewart has name recognition after nearly winning the Republican gubernatorial primary in 2017. That could be changing after state Del. Nick Freitas delivered a viral speech on the Virginia House floor regarding the Second Amendment and Democratic rhetoric. Freitas said he’s gotten an overwhelming increase in volunteers, social media followers and donors since the speech. Republican legislative leaders in Virginia, as well as U.S. Sens. Rand Paul, R-Ky., and Mike Lee, R-Utah, endorsed Freitas. After a March 17 debate in Richmond between Stewart and Freitas—the only two so far to gain enough signatures for ballot access before the March 29 deadline—Freitas won a non-scientific straw poll of 217 tea party activist by 65 percent to 35 percent. Freitas similarly said Kaine’s presence on a ticket with Clinton should be “a big issue.” “Hillary Clinton has done her level best to alienate as many Americans as possible by saying they are evil, cruel and bigoted human beings if they didn’t vote for her,” Freitas told Fox News. “Sen. Kaine ran alongside her and I am tired of that divisiveness.” Freitas, a veteran Green Beret and Iraq war veteran, could unite Trump voters and Chamber of Commerce voters, said Stephen Farnsworth, director of the Center for Leadership and Media Studies at the University of Mary Washington in Fredericksburg, Virginia. “Freitas is the one to watch. He is drawing Republican support to his campaign with the viral video appeals to conservatives, while he’s also appealing to Republican insiders,” Farnsworth told Fox News. The Kaine campaign contends the senator has bridged partisan divide on issues such as immigration and veterans. “His record of working together to get things done will be a focus of this campaign, regardless of who the Republicans nominate,” his spokesman Sams said. Kaine once referred to the Russia probe as a “treason investigation.” The June 12 primary could be wide open. The most recent scientific poll, released by Christopher Newport University in early March—before the Freitas speech—found Stewart with 16 percent support against just 6 percent for Freitas and 7 percent for E.W. Jackson, a conservative black pastor who was the 2013 GOP nominee for lieutenant governor. The poll found that 66 percent were still undecided, while 5 percent backed other candidates. Stewart, Jackson and Freitas all lose by a dozen points to Kaine in a hypothetical matchup. “If I were Tim Kaine, I wouldn’t run as Hillary Clinton’s running mate, but as a successful former governor and a U.S. senator,” Quentin Kidd, director of the Wason Center for Public Policy at Christopher Newport University in Newport News, Virginia told Fox News. “There are few worse things he could do than bring Hillary Clinton to the state to campaign for him. It wouldn’t gain any Democratic support but it would energize the Republican base.” The Washington Post reported last December on an “anybody-but-Stewart” sentiment among some state and national Republicans. “These so-called strategists that say I can’t win have never won in Virginia,” Stewart said, later adding, “I’m not going to be more controversial than the president himself.” The region of commonwealth where Republicans consistently get hammered is the Washington suburbs of Northern Virginia. That’s a region where Stewart has repeatedly won, elected to the board of supervisors for Prince William County—the state’s second most populous county—in 2002, and becoming its chairman in 2006. For his part, Freitas notes that he won in his district by 68 percent last year, despite the statewide wave election that saw Democratic Gov. Ralph Northam win by 9 points and massive down ticket gains for Democrats in the state legislature. Fred Lucas is the White House correspondent for the Daily Signal.",
      "date": "March 26, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Bevin lashes himself to Trump, sinks anyway",
      "url": "https://www.foxnews.com/politics/bevin-lashes-himself-to-trump-sinks-anyway",
      "subtitle": "Bevin lashes himself to Trump, sinks anyway",
      "author": "Chris Stirewalt",
      "content": " **Want FOX News Halftime Report in your inbox every day? Sign up here.**\n\nOn the roster: Bevin lashes himself to Trump, sinks anyway - Impeachment hearings to begin next week - Buttigieg health plan under the microscope - Audible: What about a sweater for a shotgun? - Cat-ica! Cat-ica! Cat-ica!\n\n\nBEVIN LASHES HIMSELF TO TRUMP, SINKS ANYWAY\nLexington [Ky.] Herald Leader: “Kentucky voters rejected Gov. Matt Bevin Tuesday, bucking a statewide Republican trend as they turned their backs on a politician known as much for his blustery personality as his conservative values. Democrat Andy Beshear, who ran a campaign as the anti-Bevin and stuck to a script of ‘kitchen table issues’ — education, pensions, health care and jobs — declared a narrow victory over the incumbent governor. Bevin refused to concede the race. … Beshear’s apparent victory comes even as Bevin clinged tightly to President Donald Trump, with several administration officials visiting throughout Bevin’s campaign, including two visits from Trump himself. Trump’s inability to lift an unpopular Bevin in a state the president won by almost 30 percentage points creates a perception the president is weak as he heads into the 2020 elections and as talk of impeachment swirls in D.C.”\n\nWhat’s next? - Louisville Courier Journal: “The first step under Kentucky law is a recanvass of the vote, which is a review of the vote totals by each county clerk — counting absentee votes and checking printouts to make sure the numbers they transmitted to the State Board of Elections were correct. State law allows for a recanvassing if a county clerk or a county board of elections notices a discrepancy, or if a candidate makes a written request to the secretary of state.  ...the next possible step in the process under Kentucky law — a formal recount that includes a physical examination of the ballots. There is no provision for an automatic recount under Kentucky law. A candidate must file a petition with the Franklin Circuit Court by the Tuesday following the election. If petitioned, the judge would take possession of the paper ballots and voting machines and conduct their own recount. After doing so, the judge would make the final decision on who won the race, but that would be subject to appeal to the Kentucky Court of Appeals or the Kentucky Supreme Court.”\n\nSuburban Trump backlash leads Virginia Dems to historic win - NYT: “In capturing both chambers of the legislature in Virginia, Democrats have cleared the way for Gov. Ralph S. Northam, who was nearly driven from office earlier this year, to press for measures tightening access to guns and raising the minimum wage that have been stymied by legislative Republicans. … For the first time since 1993, Democrats control both chambers in the legislature and the governor’s office — allowing them to redraw the state’s legislative boundaries after next year’s census. Linking Republican incumbents to the unpopular president and criticizing them for opposing gun control measures in the aftermath of a mass shooting in Virginia Beach in May, Democratic challengers built their victory with strong showings in suburbs stretching from outside Washington to Richmond and Hampton Roads. In Fairfax County, the state’s largest jurisdiction, the last remaining Republican lawmaker was defeated.”\n\nMississippi Republicans sweep statewide, first since Reconstruction - Jackson [Miss.] Clarion Ledger: “Republican Lt. Gov. Tate Reeves won the race for Mississippi governor Tuesday night, defeating Democratic Attorney General Jim Hood. Republicans were on track Tuesday to control all statewide elected offices in Mississippi and are expected to maintain super-majority control of the Legislature. It will be the first time since Reconstruction that Republicans control all statewide elected offices in Mississippi. In incomplete and unofficial results, Reeves led Hood on Tuesday night 52% to 47%. After a race filled with attack ads, Reeves took a conciliatory tone in his victory speech in downtown Jackson. ‘I will try to do what is right for the future of Mississippi,’ Reeves said. ‘And I mean all the people of Mississippi.’”\n\nRepublicans routed in Pennsylvania - Philadelphia Inquirer: “The political forces that shaped last year’s midterm elections showed no signs of abating Tuesday, as voters turned on Republicans and establishment Democrats alike in races from Philadelphia and Scranton to the suburbs of Delaware and Chester Counties. … Democrats will hold all five seats on the Delaware County Council, a Republican stronghold since the Civil War, and also assumed a majority on the legislative body in Chester County. In Bucks County, Democrats captured the Board of Commissioners for the first time since 1983. And in Philadelphia, a third-party insurgent candidate weakened an already marginalized GOP by securing one of the at-large City Council seats reserved for minority parties – a seat Republicans have held for decades.”\n\nGonzales: Some lessons from Tuesday’s results - Roll Call: “Kentucky was not an upset. Inside Elections changed its rating on the governor’s race from Lean Republican to Toss-up in mid-July after finding Gov. Matt Bevin very vulnerable. So those who were surprised by Democrat Andy Beshear’s declared victory weren’t paying close enough attention. … Tuesday’s results continued to demonstrate GOP problems in the suburbs since Trump took office. The latest was in northern Kentucky in the Cincinnati suburbs, where Bevin won in 2015 and Beshear won in 2019. Or in northern Mississippi, in the Memphis suburbs where the GOP margin in DeSoto County dropped from 61 points to 20 points... These are just the latest pieces of evidence after Democrat Dan McCready’s overperformance in the Charlotte suburbs from 2018 to the 2019 special election in North Carolina’s 9th District. It should be particularly concerning for President Trump in his efforts to win Pennsylvania, Michigan, Arizona, Georgia, and Texas in 2020.”\n\nTHE RULEBOOK: CHECK POINT\n\n“To what purpose then require the co-operation of the Senate [when the president nominates individuals]? I answer, that the necessity of their concurrence would have a powerful, though, in general, a silent operation. It would be an excellent check upon a spirit of favoritism in the President, and would tend greatly to prevent the appointment of unfit characters from State prejudice, from family connection, from personal attachment, or from a view to popularity.” – Alexander Hamilton, Federalist No. 76\n\nTIME OUT: WHEN EINSTEIN BECAME EINSTEIN\nSmithsonian: “When the year 1919 began, Albert Einstein was virtually unknown beyond the world of professional physicists. By year’s end, however, he was a household name around the globe. November 1919 was the month that made Einstein into ‘Einstein,’ the beginning of the former patent clerk’s transformation into an international celebrity. On November 6, scientists at a joint meeting of the Royal Society of London and the Royal Astronomical Society announced that measurements taken during a total solar eclipse earlier that year supported Einstein’s bold new theory of gravity, known as general relativity. Newspapers enthusiastically picked up the story. ‘Revolution in Science,’ blared the Times of London; ‘Newtonian Ideas Overthrown.’ A few days later, the New York Times weighed in with a six-tiered headline—rare indeed for a science story. ‘Lights All Askew in the Heavens,’ trumpeted the main headline. … The spotlight would remain on Einstein and his seemingly impenetrable theory for the rest of his life.”\n\nFlag on the play? - Email us at HALFTIMEREPORT@FOXNEWS.COM with your tips, comments or questions.\n\nSCOREBOARD\n\nDEMOCRATIC 2020 POWER RANKING\nBiden: 28.2 points (↑ 0.6 points from last wk.)\nWarren: 21.4 points (↑ 0.6 points from last wk.)\nSanders: 16.2 points (↑ 0.2 points from last wk.)\nButtigieg: 7.8 points (↑ 1.4 points from last wk.)\nHarris: 2.8 points (↓ 2 points from last wk.)\nYang: 2.8 points (↑ 0.6 points from last wk.)\nKlobuchar: 2.8 points (↑ 1 point from last wk.)\n\n[Averages include: NBC News/WSJ, ABC News/WaPo, Fox News, IBD and USA Today/Suffolk University.]\n\n\nTRUMP JOB PERFORMANCE \nAverage approval: 42 percent\nAverage disapproval: 55.4 percent\nNet Score: -13.4 percent\nChange from one week ago: ↓ 2.4 points\n\n[Average includes: Monmouth University: 45% approve - 52% disapprove; NBC News/WSJ: 45% approve - 53% disapprove; ABC News/WaPo: 39% approve - 59% disapprove; Fox News: 42% approve - 57% disapprove; IBD: 39% approve - 56% disapprove.]\n\nWANT MORE HALFTIME REPORT? \n\nYou can join Chris and Brianna every day on Fox Nation. Go behind-the-scenes of your favorite political note as they go through the must-read headlines of the day right from their office – with plenty of personality. Click here to sign up and watch!\n\nIMPEACHMENT HEARINGS TO BEGIN NEXT WEEK\nFox News: “The House Intelligence Committee will hold its first open hearings next week as part of the formal impeachment inquiry into President Trump featuring current and former officials with knowledge of the Ukraine controversy. ‘Next week, the House Intelligence Committee will hold its first open hearings as part of the impeachment inquiry,’ Intelligence Committee Chairman Adam Schiff, D-Calif., tweeted Wednesday. ‘On Wednesday, November 13, 2019, we will hear from William Taylor and George Kent,’ Schiff continued. ‘On Friday, November 15, 2019, we will hear from Marie Yovanovitch.’ ‘More to come,’ he added. … Meanwhile, U.S. diplomat David Hale appeared before the committees leading the impeachment inquiry on Wednesday behind closed doors. Hale is expected to tell lawmakers that political considerations were behind the State Department's decision to withhold U.S. military aid from Ukraine.”\n\nMcCarthy to adjust committee ahead of hearings - WaPo: “House Minority Leader Kevin McCarthy is planning to make a last-minute lineup change before open impeachment hearings of President Trump… Rep. Jim Jordan (R-Ohio) … is not a member of the House Permanent Select Committee on Intelligence, which Democrats last week voted to give the sole power to conduct public hearings. According to three Republicans familiar with the talks but not authorized to comment publicly, McCarthy (R-Calif.) is considering placing Jordan on the panel, as well as others — such as Reps. Mark Meadows (R-N.C.) and Lee Zeldin (R-N.Y.)… Matt Sparks, a McCarthy spokesman, confirmed comments that McCarthy made Tuesday to Politico indicating that he planned to ‘make adjustments to that committee accordingly, for a short period of time’ during the impeachment proceedings. Sparks said [Rep. Devin] Nunes would remain the top Republican in any scenario.”\n\nMore witnesses head to the Hill - AP: “Hale, who arrived Wednesday morning to testify behind closed doors, will also say that the State Department worried about the reaction from President Donald Trump’s personal attorney Rudy Giuliani, also one of the strongest advocates for removing the ambassador. … Also scheduled to testify Wednesday was State Department Counselor T. Ulrich Brechbuhl, an adviser to Secretary of State Mike Pompeo and close friend of the secretary. But Brechbuhl did not appear, instead departing with Pompeo on a trip to Germany early Wednesday morning. Two other witnesses who were scheduled for Wednesday — Russ Vought, the acting director of the White House Office of Management and Budget, and Rick Perry, the Energy secretary — also are not expected to show up. Both have strongly criticized the probe.”\n\nSenate GOP looks for ways to tar Bidens during impeachment - WaPo: “Senate Republicans are privately debating whether they should use an impeachment trial of President Trump to scrutinize former vice president Joe Biden and his son Hunter as some Trump allies push to call them as witnesses while others dismiss the suggestion as a risky political ploy. The ongoing discussions are a revealing glimpse into the fault lines in the GOP ahead of a possible trial of Trump in the Senate, where there are varying appetites among Republicans for the type of political combat relished by the president and his most ardent defenders. Among a group of Trump’s allies inside and outside Congress, there is intense and growing interest in countering the House Democrats’ impeachment inquiry by delving into Hunter Biden’s business dealings in Ukraine and China.”\n\nBUTTIGIEG HEALTH PLAN UNDER THE MICROSCOPE\nNYT: “Mr. [Pete] Buttigieg, like others in the field, has a plan for expanding health insurance coverage to the uninsured. But he also has a plan for limiting the prices that hospitals and doctors can charge to patients, even if they get their insurance from a private company. Mr. Buttigieg’s approach is slightly complicated… But it is a policy clearly intended to lower medical prices. … His plan would cap medical costs in an indirect way. It would allow insurers and medical providers to agree on whatever prices they wish in a contract. But it would limit how much insurers have to pay when providers are ‘out of network.’ The limit, double what Medicare pays them, would help patients who end up at a place that is not covered by their insurance. But it will also tend to influence the negotiations between hospitals and insurance companies, putting downward pressure on in-network prices.”\n\nGalston: ‘Elizabeth Warren’s health-care hara-kiri’ - WSJ: “Ms. [Elizabeth] Warren should be commended for the wealth of detail in her plan, which allows voters to judge it for themselves. This said, she may well have penned the longest suicide note in recorded history. There’s no reason for the entire Democratic Party to sign it.”  \n\nPLAY-BY-PLAY\nMcConnell insists spending battle won’t deter Senate from confirming judges - WashTimes\n\nNYC voters adopt ranked-choice voting system - Fox News\n\nAUDIBLE: WHAT ABOUT A SWEATER FOR A SHOTGUN?\n\n“The Trump presidency — it’s like every day is Christmas. You don’t know what’s under the tree. It can be that shotgun you’ve been hoping to get, or it can be a sweater you don’t want. ... There’s something under the tree. ... It makes it fun.” – Sen. Lindsey Graham, R-S.C., in an interview with Politico.\n\nFROM THE BLEACHERS\n\n“Why don't we have separate polls for both parties and another for independents? These uneven, slanted polls raise the possibility that they are predetermined to show a particular result by design. If we had 3 distinctly separate polls, we could see how strong (or weak) Trump is with registered Republicans and who the Democrats want.  The real useful poll though would be who the independents like, which takes us back to how worthless the polls really are, and that it all boils down to who gets out to vote in November.” – Tom Weekly, Gilbert, Ariz.\n\n\n[Ed. note: Every poll we use does exactly that, Mr. Weekly. Good surveys break out the various partisan groups. But we need all three groups because: a) some voters go vote against their own party’s nominees and b) voters’ perceptions of themselves are apt to change over the course of time. Someone may consider themselves very independent today but by Election Day will have picked a side.]\n\n\n“I have a prediction. Given: The house will proceed on full investigation for Trump impeachment. Sham or not they will use all means to channel the facts to support their coming up with their version of the articles of impeachment. They will effectively use the media to be the outlet of their opinion of the facts. So far so good. Pelosi will then ‘decide’ to formally draft the articles of impeachment but she will NOT call for a vote of the house on the articles. Her logic will be that they have all the ‘facts’ to support a vote and action by the Senate but since we are so close to the election she will leave it up to the voters to get Trump out of office because that is the democratic right way of doing it. Let the people decide. Regardless of the process used to gather the ‘facts,’ how the hearings are run, cherry picking the witnesses, determining what questions will be allowed, it will be out there for public consumption mostly one sided. No Senate trial to actually determine guilt or innocence but that won’t matter as it is the court of public opinion that will determine Trumps re-electability and the deck will be stacked. Just my silly, but I believe realistic, opinion and it has nothing to do with my political leaning. I just despise the entire process.” – Alan Edelkind, Dublin, N.H.\n\n\n[Ed. note: I had not thought about that! Hearings but no vote! You could be on to something, Mr. Edelkind. I will explore this possibility further. It certainly would solve several problems for Democrats. I don’t know whether rank and file members would allow it, but it’s certainly quite an idea.]\n\nShare your color commentary: Email us at HALFTIMEREPORT@FOXNEWS.COM and please make sure to include your name and hometown.\n\nCAT-ICA! CAT-ICA! CAT-ICA!\nFox News: “A 7-year-old cat currently available for adoption at the Friends For Life Animal Rescue and Adoption Organization in Houston is causing mischief and his rebellious nature is going viral. Quilty, named after a character in Vladimir Nabokov's novel, ‘Lolita,’ got into trouble after repeatedly letting the other cats out of their rooms and into the shelter lobby. ‘Quilty will not be contained. And he has no shame,’ the shelter wrote in an Oct. 29 Facebook post. ‘Quilty loves to let cats out of the senior room. Repeatedly. Several times a day.’ Since then, the shelter has been inundated with potential homes for Quilty. The antics have reached more than 135,000 people on Twitter. ‘We're pretty floored and excited about the response we've received on Quilty's antics,’ Jennifer Hopkins with Friends for Life told Chron.com. ‘He's an awesome cat.’”\n\nAND NOW, A WORD FROM CHARLES…\n\n“Washington, it seems, is a city in decline. History has taken up residence in Budapest and Tokyo, Brussels and Seoul. After a brief spurt of prominence and wealth owed to the Depression, Hitler and the cold war, Washington, we are told, has lapsed into a somnambular state. This is an exaggeration, but not too far from the truth.” – Charles Krauthammer (1950-2018) writing in Time magazine May 21, 1990.\n\nChris Stirewalt is the politics editor for Fox News. Brianna McClelland contributed to this report. Want FOX News Halftime Report in your inbox every day? Sign up here.",
      "date": "November 6",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "President Trump visits the United Kingdom",
      "url": "https://www.foxnews.com/politics/president-trump-united-kingdom-trip-slideshow",
      "subtitle": "President Trump visits the United Kingdom",
      "author": "",
      "content": "",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Trump launches black outreach effort for 2020",
      "url": "https://www.foxnews.com/politics/trump-launches-black-outreach-effort-for-2020",
      "subtitle": "Trump launches black outreach effort for 2020",
      "author": "",
      "content": "During the 2016 campaign, candidate Donald Trump stood in front of largely white crowds and asked black voters to consider, \"What the hell do you have to lose?\" Four years later, the president has a new message for black voters: Look what I've delivered. Trump and his campaign launched a new \"Black Voices for Trump\" outreach initiative in Atlanta on Friday dedicated to \"recruiting and activating Black Americans in support of President Trump,\" according to the campaign. Much of that effort will focus on highlighting ways that African Americans have benefited from the Trump economy, according to advisers. \"The support we're getting from the African American community has been overwhelming,\" Trump told the crowd, which included supporters wearing red \"BLACK LIVES MAGA\" hats. He predicted victory in 2020, and said, \"We're going to do it with a groundswell of support from hardworking African American patriots.\" That prediction is met with skepticism from critics, however, given Trump's consistently dismal approval rating with black voters, who overwhelmingly disapprove of the job he's doing. Trump has spent much of the last four years engaged in racially charged attacks, going after minority members of Congress, claiming \"no human being\" would want to live in rat \"infested,\" majority-minority Baltimore and claiming that there were \"very fine people on both sides\" of the deadly Charlottesville protest against white supremacists. Shortly after landing in Georgia on Friday, Trump retweeted a call from one black supporter for submissions for a \"#MAGACHALLENGE\" competition featuring Trump-friendly rap songs. Trump said he would be announcing the winners and inviting them to the White House to meet with him and perform. \"I think black Americans are not the audience for these outreach efforts,\" said Theodore Johnson, a senior fellow at the Brennan Center for Justice who is an expert in race and politics. While Trump might be able to maintain the low level of black support he received in 2016, or perhaps expand it by one or two points, he sees little evidence the president can change many minds. \"I think this is not going to move the needle at all,\" Johnson said. Before launching the new effort, Trump met with supporters at a fundraiser that was expected to raise about $3.5 million for a joint committee benefiting the Republican National Committee, the Trump campaign and the campaign of Sen. David Perdue, R-Ga. Nearby, a small group of protesters chanted, \"Lock him up!\" Scores of protesters also gathered outside the convention center where Trump was speaking, chanting, \"Impeach and remove.\" Carl Dix, of the group Refuse Fascism, said he thought the launch was aimed at trying to send a message to Trump's white supporters that he's \"not a racist. 'I've got black friends.'\" In 2016, 6% of black voters supported Trump, according to a Pew Research Center analysis of people who participated in its polls and were confirmed to have voted. There is no indication his support is growing. Polling shows that African Americans continue to be overwhelmingly negative in their assessments of the president's performance, with his approval hovering around 1 in 10 over the course of his presidency, according to Gallup. Yet Trump's campaign dismissed the numbers, insisting the campaign has seen favorable movement and arguing the president can increase his margins with black voters by bringing new people into the fold. \"The polls have never been favorable for Trump, and the only poll that matters is on Election Day,\" said senior campaign adviser Katrina Pierson. The campaign has launched similar coalitions for women, Latinos and veterans. Darrell Scott, a black Ohio pastor and a longtime supporter of the president who is co-chair of the new coalition and spoke at Friday's event, said that in 2015 and 2016, supporters trying to sell Trump to black voters could only point forward to share things they anticipated from Trump. \"Now that it's 2020, we're able to point backwards and to some very definitive accomplishments that the president has done,\" Scott said. \"He delivered on promises he didn't even make.\" The campaign and White House point to a list of achievements, including passage of bipartisan criminal justice reform legislation, which Trump signed into law last year, along with his ongoing support for opportunity zones in urban areas and new investments in historically black colleges. \"I don't know anyone who's done that kind of work outside of the president on attacking those big issues or trying to stop drugs from coming into the neighborhood and, at the same time, giving people second chances,\" said Ja'Ron Smith, deputy assistant to the president and one of the White House's few minority high-ranked officials. Advisers also point to a series of economic gains, including the fact that black unemployment hit a record low last year, with fewer blacks living in poverty. But Trump and his campaign also have a tendency to exaggerate the gains, giving Trump credit for trends that were years in the making, seizing on momentary upticks, cherry-picking favorable statistics and ignoring more troubling ones, such as black home ownership and net worth. Congressional Black Caucus Chairwoman Karen Bass, D-Calif., said Thursday that contrary to Trump's claims, in the three years of his presidency, African Americans have lost a lot. \"He has never had support from African Americans, but what we know about the president is that he will lie and say that he has,\" said Bass, who noted that Trump rarely appears before black audiences. \"He has to identify a handful of African Americans and take them with him wherever he goes,\" she said. If he were any other Republican incumbent who inherited declining unemployment numbers and was able to sustain them, Trump would have a legitimate case to make to black voters, said Republican strategist Shermichael Singleton. But \"because of some of his racial pronouncements ... I think a significant percentage of African Americans are completely turned off.\" A September AP-NORC poll found that only roughly 3 in 10 Americans say the things Trump has done as president have been good for African Americans. And just 4% of African Americans said they think Trump's actions have had a positive impact on African Americans in general, while 81% said they think they've been bad. Yet even if he can't win over black voters, some suspect that's not the point. As long as the campaign can keep on-the-fence voters from casting their ballots for the eventual Democratic nominee, the campaign will be helping Trump inch closer to a second victory. Some analysts have pointed to a precipitous drop in black turnout in 2016 as one of the reasons Trump beat his Democratic rival Hillary Clinton, who was far less popular — especially among black men —than former President Barack Obama, the nation's first black president. According to the U.S. Census Bureau, about 60% of non-Hispanic blacks voted in 2016, versus about 67% in 2012. And that drop was seen in cities with significant African American populations in critical swing states that helped Trump eke out a victory. \"I do think the main objective is to discourage turnout,\" said Johnson. \"I absolutely think this is about creating doubt in black voters' minds about the Democratic nominee\" so people feel like \"there's almost no one worth voting for.\" And he said that fears were growing it might work. \"There is a pretty tangible fear among black Americans that Trump is going to win again because black turnout won't be enough to mute the white turnout,\" he said. \"There's a sense that in 2020 he's going to win again.\"",
      "date": "November 8",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Trump casts Louisiana vote as impeachment referendum",
      "url": "https://www.foxnews.com/politics/trump-casts-louisiana-vote-as-impeachment-referendum",
      "subtitle": "Trump casts Louisiana vote as impeachment referendum",
      "author": "Chris Stirewalt",
      "content": " **Want FOX News Halftime Report in your inbox every day? Sign up here.**\n\nOn the roster: Trump casts Louisiana vote as impeachment referendum - Trump operative Stone convicted of lying, obstruction - Time Out: And now you know the rest of the story - Biden breaches Warren’s Nevada firebreak - See, cows\n\n\nTRUMP CASTS LOUISIANA VOTE AS IMPEACHMENT REFERENDUM\nUSA Today: “President Donald Trump returned to the campaign trail Thursday to stump in Louisiana for the second time in as many weeks, using a raucous rally to mock two U.S. diplomats who raised questions about his dealings with Ukraine at the center of an impeachment inquiry. … ‘The people of this country aren't buying it – you see it because we're going up and they're going down,’ Trump said. ‘Let's keep it going for a while.’ …  Stung by Kentucky Gov. Matt Bevin's loss last week to Democrat Andy Beshear, Trump is putting considerable emphasis on Louisiana. Republican businessman Eddie Rispone is challenging Democratic incumbent Gov. John Bel Edwards in a Nov. 16 runoff election. … ‘You gotta give me a big win please,’ Trump told the crowd. ‘Please.’”\n\nWill black voters rally for Edwards? -  FiveThirtyEight: “While election forecasters like Sabato’s Crystal Ball estimate that Edwards needs about 30 percent or so of the white vote to win reelection, that’s not the only thing that matters for Edwards’ candidacy. He also needs black voters to turn out. … And so far, black voter turnout is slightly down for Edwards. In the initial vote, 27.6 percent of all voters were black, according to data from the Louisiana secretary of state, compared to 28.1 percent in the first round of the 2015 gubernatorial election. [When] you consider that Democrats win more than 90 percent of African American voters in the state, slightly lower black turnout matters a lot in a race this close.”\n\nBevin cries uncle - Louisville [Ky.] Courier Journal: “An upbeat Andy Beshear claimed victory — again — in the Kentucky governor's race Thursday, shortly after incumbent Republican Gov. Matt Bevin said he would not contest the results of the close election. ‘The race is now officially over,’ Beshear, a Democrat and Kentucky's attorney general, said at a news conference where he appeared with Lt. Gov.-Elect Jacqueline Coleman, an educator. Beshear spoke at the Kentucky Education Association in Frankfort, apparently to underscore his support by teachers angry with Bevin over his public criticisms of them during a dispute over pension changes. Beshear has designated Kentucky teachers as grand marshals of his inaugural parade down Capitol Avenue. But Beshear stressed Thursday that the tone will change in his administration following his Dec. 10 inauguration.”\n\nNew map could cost Republicans two House seats in North Carolina - The [Raleigh] News & Observer: “Republicans in the North Carolina General Assembly are advancing a new map for the 2020 U.S. House races that could cost their party seats in Congress. The map passed the N.C. House Thursday afternoon and was sent to the Senate, which could pass the map into law or come up with a new proposal. ‘I do believe this is a fair and honest attempt to address the issues that have been brought up,’ said Republican Rep. David Lewis, one of the legislature’s top redistricting leaders. He was referring to a lawsuit that challenged the constitutionality of the current maps. As it stands now, the state has a 10-3 Republican advantage in the U.S. House of Representatives, even though Democratic and Republican candidates typically get around the same number of votes statewide.”\n\nTRUMP OPERATIVE STONE CONVICTED OF LYING, OBSTRUCTION\nFox News: “Roger Stone was found guilty on all counts of obstruction, witness tampering and making false statements to Congress by a jury in Washington, D.C. federal court, after deliberations had been going on since Thursday morning. The former Trump associate and longtime political operative faced charges that stemmed from Robert Mueller’s Russia investigation. Sentencing has been set for Thursday Feb. 6. Stone was accused of providing false statements to the House Intelligence Committee about communications having to do with WikiLeaks, obstructing a congressional investigation of Russian election interference by falsely denying that he had evidence to turn over, and witness tampering. The prosecution argued that Stone intentionally lied about his use of intermediaries to get information about WikiLeaks’ possession and release of hacked Democratic emails. They said he hid the truth to protect Trump’s campaign.”\n\nTensions boil over at impeachment hearing - Fox News: “Tensions between lawmakers boiled over Friday on the second day of the public impeachment hearings, when House Intelligence Chairman Adam Schiff, D-Calif., repeatedly shut down GOP Rep. Elise Stefanik, R-N.Y., citing House procedure -- as an astonished Ranking Member Devin Nunes, R-Calif., accused him of ‘gagging’ the lawmaker. … The explosive moment came during the questioning of Marie Yovanovitch, the former U.S. ambassador to Ukraine…  Yovanovitch pointed her finger at Trump lawyer Rudy Giuliani while detailing her sudden removal from her diplomatic post, as the president fired back in real-time and said every place she worked ‘turned bad.’ Trump’s comments ignited an outcry from Democrats: Intelligence Committee chairman Adam Schiff read Trump's anti-Yovanovitch tweet during the hearing, and called it ‘witness intimidation.’ Yovanovitch told lawmakers, regarding the tweet: ‘It's very intimidating.’”\n\nLegal woes mount for Giuliani - Bloomberg: “Rudy Giuliani, President Donald Trump’s personal lawyer, is being investigated by federal prosecutors for possible campaign finance violations and a failure to register as a foreign agent as part of an active investigation into his financial dealings, according to three U.S. officials. The probe of Giuliani, which one official said could also include possible charges on violating laws against bribing foreign officials or conspiracy, presents a serious threat to Trump’s presidency from a man that former national security adviser John Bolton has called a ‘hand grenade.’ A second official said Giuliani’s activities raise counterintelligence concerns as well, although there probably wouldn’t be a criminal charge related to that. The officials, who asked for anonymity to discuss a sensitive matter, provided the first indication of the potential charges under investigation.”\n\nCareer White House budget official to testify - WaPo: “A longtime career employee at the White House Office of Management and Budget is expected to break ranks and testify Saturday in the House Democrats’ impeachment inquiry, potentially filling in important details on the holdup of military aid to Ukraine. Mark Sandy would be the first OMB employee to testify in the inquiry, after OMB acting director Russell T. Vought and two other political appointees at the agency defied congressional subpoenas to appear. The White House has called the impeachment inquiry unconstitutional and ordered administration officials not to participate. Unlike these other OMB officials, Sandy is a career employee, not one appointed by the president. He has worked at the agency off and on for over a decade, under presidents of both parties, climbing the ranks to his current role as deputy associate director for national security programs.”\n\nTHE RULEBOOK: THE LABORATORIES OF DEMOCRACY, INDEED\n\n“If those who are inclined to consult their jealousy only, would exercise it in a careful inspection of the several State constitutions, they would find little less room for disquietude and alarm, from the latitude which most of them allow in respect to elections, than from the latitude which is proposed to be allowed to the national government in the same respect.” – Alexander Hamilton, Federalist No. 61\n\nTIME OUT: AND NOW YOU KNOW THE REST OF THE STORY\nSmithsonian: “Founded in 1912 in Cincinnati, [Kutol’s] primary product—a soft, pliable compound used for wiping soot from wallpaper—was no longer in demand and the firm’s future looked bleak. Fortunately, the sister-in-law of one of its principals had an idea: let kids play with it. Kutol Products had become the largest wallpaper cleaner manufacturer in the world in the early 20th century. Fortunes began to change in the 1950s, though. With the transition from heating with dirtier coal to cleaner oil, gas and electricity, sooty buildup on wallpaper was no longer an issue in many households. Joseph McVicker was trying to turn around the struggling company when his sister-in-law read an article about how wallpaper cleaner could be used for modeling projects. Sister-in-law Kay Zufall, a nursery school teacher, tested the nontoxic material with children, who loved molding it into all kinds of shapes. She told McVicker of her discovery and even suggested a new name: Play-Doh.”\n\nFlag on the play? - Email us at HALFTIMEREPORT@FOXNEWS.COM with your tips, comments or questions.\n\nSCOREBOARD\nDEMOCRATIC 2020 POWER RANKING\nBiden: 27.6 points (no change from last wk.)\nWarren: 22.6 points (no change from last wk.)\nSanders: 17.6 points no change from last wk.)\nButtigieg: 7.6 points (no change from last wk.)\nHarris: 3.2 points (no change from last wk.)\n[Averages include: Monmouth University, NBC News/WSJ, ABC News/WaPo, Fox News and IBD.]\n\n\nTRUMP JOB PERFORMANCE \nAverage approval: 42 percent\nAverage disapproval: 55.4 percent\nNet Score: -13.4 percent\nChange from one week ago: no change\n[Average includes: Monmouth University: 45% approve - 52% disapprove; NBC News/WSJ: 45% approve - 53% disapprove; ABC News/WaPo: 39% approve - 59% disapprove; Fox News: 42% approve - 57% disapprove; IBD: 39% approve - 56% disapprove.] \n\nWANT MORE HALFTIME REPORT? \n\nYou can join Chris and Brianna every day on Fox Nation. Go behind-the-scenes of your favorite political note as they go through the must-read headlines of the day right from their office – with plenty of personality. Click here to sign up and watch!\n\nBIDEN BREACHES WARREN’S NEVADA FIREBREAK\nFox News: “Democrats’ strong desire for a candidate who can defeat President Trump gives Joe Biden the edge in the nomination race, while Hispanic voters help both Biden and Bernie Sanders top Trump in hypothetical 2020 matchups. That’s according to a Fox News Poll of Nevada voters. In the nomination contest, Biden receives the backing of 24 percent of Democratic caucusgoers, followed by Sanders and Elizabeth Warren each at 18 percent. Next is Pete Buttigieg at 8 percent, Tom Steyer at 5 percent, Kamala Harris at 4 percent, Andrew Yang 3 percent, and Tulsi Gabbard and Amy Klobuchar at 2 percent apiece. Cory Booker and Julian Castro each get 1 percent. Biden (23 percent) and Warren (21 percent) receive nearly equal backing among white caucusgoers, followed by Sanders (13 percent) and Buttigieg (12 percent).”\n\nPoll shows tight race in North Carolina for Trump - Fox News: “North Carolina voters give President Trump mixed reviews on his job performance and about half oppose his impeachment. That leads to tight races in 2020 ballot tests, according to a Fox News Poll of North Carolina voters. In hypothetical matchups, Joe Biden edges Trump by two points and Bernie Sanders is up by one.  The president tops Elizabeth Warren by one point and Pete Buttigieg by four.  Each race is within the poll’s margin of error. There is added uncertainty considering no candidate hits 50 percent and 11-18 percent are undecided. Trump topped Hillary Clinton by nearly 4 points in the Tar Heel State. Ninety-four percent of Republicans voted for him in 2016. Today, 91 percent of Republicans approve of the job he’s doing and 89 percent back him in the matchup against Biden.”\n\nNorth Korean news agency calls Biden a ‘rabid dog’ - ABC News: “After a campaign ad for Former Vice President Joe Biden implied Kim Jong Un was a ‘tyrant,’ North Korean state media responded on Thursday by blasting the 2020 Democratic candidate. The commentary called Biden a ‘rabid dog’ and advocated that rabid dogs ‘can hurt lots of people’ and ‘must be beaten to death with a stick.’ … The ad for Biden said, in part: ‘We live in the most dangerous moment in a generation. Our world, set on edge by an erratic, unstable president. Dictators and tyrants are praised -- our allies, pushed aside.’ Kim's photo appears at the mention of the word ‘tyrants.’ The Biden campaign hit back, calling Kim a ‘repugnant dictator,’ arguing that sharp words from North Korea highlight the strength of their candidate.”\n\nPLAY-BY-PLAY\nPresident Trump asks Supreme Court to block subpoena for his taxes - AP\n\nDrucker: Sessions lashes Republicans for failing Trump on immigration - WashEx\n\nMessages show Rep. Rashida Tlaib asked campaign for personal money, as ethics probes announced - Fox News\n\nJustice Department investigating Rep. Ross Spano, R-Fla., for campaign-finance violations - Politico\n\nAUDIBLE: TAKES ONE TO KNOW ONE\n\n“Delusion runs deep in the veins of Massachusetts politicians thinking of running for president.” – Sen. Mitt Romney, R-Utah, making fun of his own failed presidential candidacies when asked about his successor Massachusetts governor, Deval Patrick’s announcement of a presidential run.\n\nANY GIVEN SUNDAY\n\nThis weekend Mr. Sunday will sit down with Reps. Steve Scalise, R-La., and Jim Himes, D-Conn. Watch “Fox News Sunday with Chris Wallace.” Check local listings for broadcast times in your area.\n\n#mediabuzz - Host Howard Kurtz has the latest take on the week’s media coverage. Watch #mediabuzz Sundays at 11 a.m. ET. \n\nFROM THE BLEACHERS\n\n“Mr. Stirewalt: Why doesn't the President simply claim whistleblower status for himself? U.S. law prohibits adverse actions against anyone reporting suspicion of wrongdoing. I looked -- it doesn't say the report must be made to a US authority.  … Clearly, the President disclosed information that he believed evidenced violation of ANY law (including the law of Ukraine), a gross waste of funds, and an abuse of authority.  He should therefore be protected against any adverse action as a result. (I'm not a lawyer, but it seems like a gift-wrapped solution . . . am I missing something?)” – Michael Whalen, Weirton, W. Va.\n\n\n[Ed. note: I’m not sure how facetious you’re being, Mr. Whalen, but this note will always make allowances for readers from West Virginia’s Northern Panhandle! I guess I’d have to ask in reply: Protection from what? If it’s protection from Congress that you seek, I’m afraid not. Congress’ power to impeach is absolute. The president does have many protections in dealing with Congress – shielding intimate advisers from testifying about private conversations, etc. – but when it comes to impeachment, Congress is at the apex of its powers. Go Red Riders!]\n\nShare your color commentary: Email us at HALFTIMEREPORT@FOXNEWS.COM and please make sure to include your name and hometown.\n\nSEE, COWS\nAFP: “Three cows swept into the ocean when Hurricane Dorian struck the US east coast in September were found living on a string of sandy islands miles away from their home… The bovine trio is believed to have swum four to five miles before placing hoof on land – in this case an island of sand dunes and scattered vegetation that is part of North Carolina's Outer Banks… The animals were recently discovered by park rangers at the Cape Lookout National Seashore... Three months had gone by since the animals, belonging to a free-range herd living on private land on Cedar Island, went missing during the storm. Category One Hurricane Dorian created a ‘mini-tsunami’ that swept cattle and some 30 wild horses from Cedar Island into the ocean when it struck on September 6. The cows were identified by their keeper, Woody Hancock. They will likely be sedated and sent home on a boat…”\n\nAND NOW, A WORD FROM CHARLES…\n\n“France does not expect to rival America but to tame it, restrain it, thwart it — and to accept the world's laurels for having led the way.” – Charles Krauthammer (1950-2018) writing in Time magazine on March 17, 2003.\n\nChris Stirewalt is the politics editor for Fox News. Brianna McClelland contributed to this report. Want FOX News Halftime Report in your inbox every day? Sign up here.",
      "date": "November 15",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "McConnell chides Trump for calling impeachment inquiry a 'lynching'",
      "url": "https://www.foxnews.com/politics/mcconnell-chides-trump-for-calling-impeachment-inquiry-a-lynching",
      "subtitle": "McConnell chides Trump for calling impeachment inquiry a 'lynching'",
      "author": "Gregg Re",
      "content": " Senate Majority Leader Mitch McConnell on Tuesday called President Trump's use of the word \"lynching\" to describe the House impeachment investigation \"unfortunate,\" even as some Republicans have accused their Democratic colleagues of flagrant hypocrisy on the issue. In a tweet Tuesday, Trump compared the House impeachment inquiry into his dealings with Ukraine to \"a lynching,\" essentially likening the horrors of a deadly and racist chapter in U.S. history to a process laid out in the Constitution. The president added: \"All Republicans must remember what they are witnessing here - a lynching.\" His words have brought bipartisan condemnation. McConnell, speaking to reporters, said \"that was an unfortunate choice of words.\" McConnell added: \"Given the history in our country, I would not compare this to a lynching.\" But, some Republicans pointed to video showing prominent Democrats, including Reps. Gregory Meeks and Danny Davis, calling Bill Clinton's impeachment proceedings a de facto \"lynching\" in 1998. GOP Rapid Response Director Steve Guest also pointed to an October 2008 comment from now-Judiciary Committee Chairman Jerry Nadler, D-N.Y, that was published in an Associated Press article. The quote from Nadler read: \"I am the president’s defender in the sense that I haven’t seen anything yet that would rise, in my opinion, to the level of impeachable offense. … I wish we could get this over with quickly. … In pushing the process, in pushing the arguments of fairness and due process the Republicans so far have been running a lynch mob.\" This time around, however, Democrats have sounded a sterner tone. \"That is one word no president ought to apply to himself,\" said South Carolina Democratic Rep. James Clyburn, the highest-ranking African American in Congress. \"That is a word that we ought to be very, very careful about using.\" Rep. Bobby Rush, D-Ill., who is also black, called on Trump to delete his tweet. \"Do you know how many people who look like me have been lynched, since the inception of this country, by people who look like you. Delete this tweet,\" Rush wrote. Sen. Doug Jones, D-Ala., tweeted to Trump: \"No sir! No, @realDonaldTrump: this is NOT a lynching, and shame on you for invoking such a horrific act that was used as a weapon to terrorize and murder African Americans.\" The New York Times, in a tweet, condemned Trump for \"using a term that invokes the decades-long racist history of white mob murders of black people to describe a legal process laid out in the Constitution.\" Meanwhile, Republican legislators largely tried to put the focus on what they said was the unfair way in which Democrats are conducting the inquiry. Sen. Lindsey Graham, R-S.C., said Trump's description was \"pretty well accurate.\" He called the impeachment effort a \"sham\" and a \"joke\" because the president does not know the identity of his accuser, and the process is playing out in private. \"This is a lynching in every sense,\" said Graham, who is close to Trump. CLICK HERE TO GET THE FOX NEWS APP South Carolina GOP Sen. Tim Scott, the Senate's only black Republican, agreed with Trump's sentiment but not his word choice. \"There's no question that the impeachment process is the closest thing (to) a political death row trial, so I get his absolute rejection of the process,\" Scott said. He added, \"I wouldn't use the word lynching.\" The Associated Press contributed to this report.",
      "date": "October 22",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Trump campaign to launch 'Latinos for Trump' effort in Miami",
      "url": "https://www.foxnews.com/politics/latinos-trump-miami-campaign-pence",
      "subtitle": "Trump campaign to launch 'Latinos for Trump' effort in Miami",
      "author": "Louis Casiano",
      "content": " President Trump is beginning his 2020 re-election effort by trying to woo Hispanic voters with a kickoff event in the crucial swing state of Florida. Vice President Mike Pence will visit Miami on Tuesday to roll out the \"Latinos for Trump\" campaign, a nationwide project aimed at engaging Hispanic communities. Florida is home to more 2 million Hispanic voters and could play a key role in next year's presidential election, Politico reported. \"The strong Latino support for President Trump and his policies will be instrumental in re-electing the president for a second term,\" Hannah Castillo, director of coalitions for the Trump campaign, told The Hill in a statement. FLORIDA COUNTIES SCRAMBLING AFTER ABRUPT ORDER MANDATING BILINGUAL BALLOTS BY 2020 PRIMARY Florida Lt. Gov. Jeanette Núñez, a Cuban American, will co-chair the outreach effort. Trump won Florida in 2016 with 35 percent of the Hispanic vote, bolstered in part by pro-Republican Cubans, according to Politico. More than two-thirds of non-Hispanic Cubans voted for Hillary Clinton, The central part of the state has seen an increase in Puerto Ricans -- who tend to support Democrats -- who've relocated from their traditional base in places like New York and from the island territory in the wake of a devastating blow by Hurricane Maria in 2017. Castillo pointed to low unemployment rates and his support of Venezuelan opposition leader Juan Guaidó over President Nicolas Maduro as reasons why Hispanics support Trump. US MILITARY TO PROVIDE MEDICAL CARE, TRAINING TO PUERTO RICO Trump's effort could face barriers. He's drawn criticism and scorn from many for his previous comments and policies that largely impact Hispanics. During his 2016 campaign launch, he said Mexico was sending \"rapists\" and criminals across the border. He has referred to Central Americans fleeing violence and poverty as \"thugs\" and criminals. On Monday, he tweeted that Immigration and Customs Enforcement (ICE) would be \"removing the millions of illegal aliens who have illicitly found their way into the United States\" next week. His administration has drawn criticism for its response to Puerto Rico in the aftermath of Hurricane Maria. He squabbled with Puerto Rican officials and threatened to withhold aid from the island and has complained about having to do so regularly on Twitter. He's also refused to acknowledge a Harvard study that concluded the death toll from the hurricane was closer to 4,600, more than 70 times the original number reported. In an interview with Spanish-language network Telemundo slated to air Thursday night, Trump pushed back on assertions that a sizable majority of Hispanics fear his rhetoric and promises to deport millions of people. CLICK HERE TO GET THE FOX NEWS APP \"They want me to do it. They’re here illegally,\" Trump said. \"Mr. President, they do not,\"  anchor José Díaz-Balart responded, while also telling Trump that MS-13 gang members do not make up the majority of migrants seeking to enter the U.S., a talking point Trump has continued to push. .",
      "date": "June 20",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Biden buoyed amid Trump attacks",
      "url": "https://www.foxnews.com/politics/biden-buoyed-amid-trump-attacks",
      "subtitle": "Biden buoyed amid Trump attacks",
      "author": "Chris Stirewalt",
      "content": " **Want FOX News Halftime Report in your inbox every day? Sign up here.**\n\nOn the roster: Biden buoyed amid Trump attacks - Giuliani’s woes mount - Trump legal team trashes Gowdy - Dems divided on timing of impeachment vote - ‘This is a nudge to pick up the fudge’\n\nBIDEN BUOYED AMID TRUMP ATTACKS\nFox News: “Together Joe Biden and Elizabeth Warren capture the support of more than half of Democratic primary voters, according to the latest Fox News national poll on the 2020 election. Biden stays on top in the race with 32 percent support among primary voters, up 3 points since September. He’s followed by Elizabeth Warren at 22 percent -- that’s up 6 points and a new high for her. Bernie Sanders is at 17 percent, down 1 point since last month. While Biden’s support has stayed between 29-35 percent since March, his current 10-point advantage is about half of his 19-point lead in June. The rundown continues with Kamala Harris at 5 percent, Pete Buttigieg at 4 percent, Beto O’Rourke at 3 percent, and Cory Booker, Amy Klobuchar and Andrew Yang each at 2 percent. Michael Bennet, Julian Castro, Tulsi Gabbard, Tim Ryan, Tom Steyer, and Marianne Williamson receive 1 percent apiece.”\n\nBiden’s firewall still strong - WaPo: “[Contrary] to the expectations of analysts, the fears of supporters and the hopes of rivals, Biden maintains a sizable loyal following. Nowhere is that more evident than in the African American community, recent interviews suggest, especially in states like South Carolina, which holds a crucial early primary. Martha Beck, a retired high school teacher from Charleston … gushed about Sens. Elizabeth Warren (D-Mass.) and Bernie Sanders (I-Vt.) but said Sanders is ‘too old and grumpy and he just shouts at people all the time.’ And she doesn’t think the same country that elected [Donald] Trump would put Warren, or any other woman, in the White House four years later.”\n\nWill any Dem dare mention the swampy stuff? - NYT: “It’s the one question about impeachment that no Democratic presidential candidate wants to answer head on. Should Joe Biden’s son Hunter have been allowed to sit on the board of a foreign company while his father served as vice president? In the past few weeks, Mr. Biden and his campaign team have spent significant amounts of time and energy denouncing any whiff of impropriety between his son’s work and his service as vice president. … So far, none of the Democratic primary candidates have taken a hard swing at Mr. Biden, focusing instead on the impeachment inquiry into Mr. Trump. But a few are, quite delicately, trying to raise some concerns. … In past debates, candidates who have taken on Mr. Biden’s personal characteristics, like his age, have faced blowback. The questions surrounding his son may be even more sensitive… Echoing an attack introduced and continually leveraged — in false ways — by Mr. Trump could risk raising Democrats’ ire.”\n\nJane Sanders takes starring role in husband’s campaign - NYT: “When it comes time to make critical decisions regarding his presidential campaign, Senator Bernie Sanders often relies on a committee of two: himself and his wife, Jane Sanders. … When doctors confirmed to her on Thursday that Mr. Sanders had suffered a heart attack, she said, it was her decision to wait until he was discharged the next day to release that information. And when it was time to say publicly that Mr. Sanders would be easing the pace of his campaigning after his heart attack, Ms. Sanders … stood beside him to explain the reason: His closest advisers, ‘especially me,’ had told him to slow down. … In a rare interview on Wednesday at their home in Burlington, Ms. Sanders said it would be ‘egotistical’ to call herself Mr. Sanders’s top adviser but allowed that she was ‘very much a close adviser.’ Above all, she said, she was ‘his wife.’”\n\nVoter intensity on both sides through the roof - Gallup: “A year before the 2020 presidential election, roughly seven in 10 Democrats and Republicans say they have given ‘quite a lot of thought’ to the election. About half of political independents have done so. The lack of a Republican-Democratic difference in thought given to the election is notable because Republicans usually have an advantage over Democrats, including in each of the past seven final presidential pre-election surveys, as well as in most surveys conducted throughout presidential election years historically. The current results are based on combined data from interviews with more than 2,400 U.S. adults aged 18 and older, conducted between Aug. 15 and Sept. 30, 2019. Gallup has measured thought given to the election since 1952, and it has shown a relationship to actual voter turnout among all Americans in past elections.”\n\nTHE RULEBOOK: CLOAK AND DAGGER \n\n“It seldom happens in the negotiation of treaties, of whatever nature, but that perfect SECRECY and immediate DESPATCH are sometimes requisite. These are cases where the most useful intelligence may be obtained, if the persons possessing it can be relieved from apprehensions of discovery.” – John Jay, Federalist No. 64\n\nTIME OUT: ‘A STATUE OF FLORENTINE BRONZE’\nParis Review: “In the late summer of 1866, a black equestrian stuntwoman made her Paris debut and galvanized the city. She was known only as ‘Sarah the African,’ and history has left us few traces of her: just some battered posters, inky clippings, and burlesque scripts. Sarah was, in the words of the men who wrote about her, ‘the finest horsewoman of the King of Morocco,’ ‘an Ethiopian,’ or ‘a statue of Florentine bronze.’ A ‘negress’ who performed as neither slave nor clown, whose name evoked Sarah Baartman, the Khoikhoi woman dissected by Georges Cuvier just a few decades before in Paris, and Selika, the queen heroine of Meyerbeer’s hit posthumous opera, L’Africaine. She was a woman named for a whole continent. … On her debut in September she was billed above Méphistophélès the bareback horse, above a race of forty horses all mounted by women, above the rubber horseman, William Meyer, and even above Mlle Adèle, who made her Sidy-Laraby dance with no reins.”\n\nFlag on the play? - Email us at HALFTIMEREPORT@FOXNEWS.COM with your tips, comments or questions.\n\nSCOREBOARD\n\nDEMOCRATIC 2020 POWER RANKING\nBiden: 28 points (↑ 1.2 points from last wk.)\nWarren: 26.2 points (↑ 3.4 points from last wk.)\nSanders: 14.4 points (↓ 1.6 points from last wk.)\nButtigieg: 5.4 points (↓ 0.6 points from last wk.)\nHarris: 4.2 points (↓ 1.4 points from last wk.)\n\n[Averages include: Fox News, Quinnipiac University, IBD, Monmouth University and NBC News/WSJ.]\n\n\nTRUMP JOB PERFORMANCE \nAverage approval: 42.8 percent\nAverage disapproval: 53.4 percent\nNet Score: -10.6 percent\nChange from one week ago: ↑ 0.4 points\n\n[Average includes: NPR/PBS/Marist: 45% approve - 51% disapprove; Fox News: 43% approve - 55% disapprove; NBC/WSJ: 43% approve - 53% disapprove; Quinnipiac University: 40% approve - 54% disapprove; IBD: 43% approve - 54% disapprove.]  \n\nWANT MORE HALFTIME REPORT? \n\nYou can join Chris and Brianna every day on Fox Nation. Go behind-the-scenes of your favorite political note as they go through the must-read headlines of the day right from their office – with plenty of personality. Click here to sign up and watch!\n\nGIULIANI’S WOES MOUNT\nABC News: “The business relationship between President Donald Trump's private lawyer Rudy Giuliani and the men charged Thursday in a campaign finance scheme is a subject of the ongoing criminal investigation being conducted by federal authorities in New York, according to two sources familiar with the matter. The investigation became public after the FBI had to quickly move to arrest Lev Parnas and Igor Fruman before they boarded a flight out of the country from Washington Dulles Airport with one-way tickets. They have been named as witnesses in the ongoing impeachment inquiry into President Trump. The investigation is being conducted by the FBI's New York field office and prosecutors in the Southern District of New York, the same U.S. Attorney's office Giuliani ran before he became mayor of New York.”\n\nFormer Ambassador to Ukraine cites Giuliani pressure campaign - AP: “Former U.S. Ambassador to Ukraine Marie Yovanovitch told lawmakers Friday that President Donald Trump pressured the State Department to oust her from her position. Yovanovitch said in an opening statement obtained by The Associated Press that she was ‘abruptly’ recalled in May and told the president had lost confidence in her. She said she was told by an official that there was a ‘concerted campaign against me’ and that Trump had pressured officials to remove her for almost a year. ‘Although I understand that I served at the pleasure of the president, I was nevertheless incredulous that the U.S. government chose to remove an ambassador based, as best as I can tell, on unfounded and false claims by people with clearly questionable motives,’ Yovanovitch wrote in the statement.”\n\nReport: Trump pushed Tillerson to help a Giuliani client - WaPo: “President Trump sought to enlist then-Secretary of State Rex Tillerson in the fall of 2017 to work with Rudolph W. Giuliani to help stop the prosecution of a Turkish Iranian gold trader represented by the former New York mayor, according to people with knowledge of the request. Trump urged Tillerson in an Oval Office meeting to try to craft a diplomatic ‘deal’ to stop the U.S. case against Reza Zarrab on corruption charges in exchange for concessions from Turkey. The request shocked the then-secretary of state, said the people, who spoke on the condition of anonymity to describe private conversations involving the president. At the time, Turkish President Recep Tayyip Erdogan was personally lobbying Trump to get the charges dropped. Trump, in turn, repeatedly raised the topic with Tillerson — including directly in the Oval Office meeting, according to people with knowledge of the episode.”\n\nPete Session’s political revival threatened by Ukraine role - NYT: “Former Representative Pete Sessions, a Texas Republican who is seeking a return to Congress, was caught in the fallout of the Ukraine scandal on Thursday when he was referred to in the indictment of two presidential allies accused of campaign finance allegations. Mr. Sessions, who served 11 terms in Congress until he was swept out last year, is described as ‘Congressman-1’ in the indictment of Lev Parnas and Igor Fruman, who were arrested and charged on Thursday with illegally funneling foreign money to American political candidates and campaigns. The two men are associates of Rudolph W. Giuliani… Mr. Sessions’s appearance in the indictment, which was filed just a week after he announced he would run for Congress in 2020, was an early and potentially damaging blow to his campaign. Mr. Sessions is not named in the indictment, nor is he accused of any wrongdoing. On Thursday, he issued a statement that denied any wrongdoing and said he had no knowledge of the scheme detailed by federal prosecutors.”\n\nContinetti: We are all Ukrainians - Free Beacon: “From Varsity Blues to Jeffrey Epstein, from China and the NBA to Ukraine and Hunter Biden, Americans are taking a crash course on the ways in which powerful people manipulate the system for personal advantage and globalization merges political cultures as well as economies. What has been uncovered as impeachment rolls on does nothing to spur confidence in the integrity of our system. America is exceptional, but our elites are not. Today we are all Ukrainians.”\n\nTRUMP LEGAL TEAM TRASHES GOWDY\nYahoo: “The president’s decision to bulk up his legal team with former South Carolina Rep. Trey Gowdy amid a widening impeachment inquiry is drawing criticism from one of his high-profile supporters. On Wednesday morning, the day after news leaked that Gowdy was set to serve as outside counsel to the president, Victoria Toensing, a veteran Washington lawyer who has been working with Trump’s personal attorney, Rudy Giuliani, expressed concern and disbelief that the onetime advocate for congressional oversight would be coming onboard. ‘Trey Gowdy doesn’t know s***,’ she said. … ‘He screwed up the Benghazi hearings, and he came out with the advice to Trump, ‘Well, if you’ve done nothing wrong, just talk to Bob Mueller.’’ Toensing and her husband, Joe diGenova, work with Giuliani though they are not officially on Trump’s legal team.”\n\nAnd he can’t even join until January - WashEx: “Former Republican Congressman Trey Gowdy cannot join President Trump's legal team until early next year, the president announced Thursday. Speaking to reporters on the South Lawn of the White House, Trump said, ‘Trey Gowdy is a terrific guy. I think there’s a problem with, he can’t start for another couple of months because of lobbying rules and regulations.’ It was only a day after Jay Sekulow, counsel to the president, announced Gowdy had joined the team to assist with the response to the House Democrats' impeachment inquiry. … Gowdy, 55, is a former federal prosecutor who retired from Congress on Jan. 3 after representing the 4th Congressional District of South Carolina for four terms. He then rejoined his old white-collar law firm, Nelson Mullins Riley & Scarborough. Despite his return to the legal profession, federal law prevents Gowdy from taking on Trump as a client in the impeachment fight until Jan. 3, 2020.” DEMS DIVIDED ON TIMING OF IMPEACHMENT VOTE\nPolitico: “House Democrats are grappling with whether to take more steps to formalize their impeachment inquiry and silence a chief Republican criticism of their efforts, with competing factions beginning to emerge. President Donald Trump and his allies on Capitol Hill have hammered Speaker Nancy Pelosi for not holding a vote authorizing the House’s impeachment proceedings — arguing that without a vote, the entire process is illegitimate. Pelosi has refused to cave, dismissing Trump’s demand last week and insisting it is not required under the Constitution or House rules. And allies close to the speaker say her position hasn’t changed, describing the idea as the latest ‘Republican canard’ in a series of stall tactics the GOP will employ to protect Trump. … Yet some Democratic lawmakers and aides have begun to say privately — and, to a lesser extent, publicly — that the House should just vote to formalize the inquiry, robbing the GOP of its main talking point. The debate is threatening to cleave Democrats’ unified front as the White House makes the arcane procedural arguments the centerpiece of its impeachment defense.”\n\nHouse members get an earful from voters back home - Politico: “The ‘Make America Great Again’ hats were in the front row Thursday night at freshman Rep. Anthony Brindisi’s first town hall event since Speaker Nancy Pelosi blessed an impeachment inquiry against President Donald Trump. But for all the criticism the centrist Democrat faced from pro-Trump voters, the sharper questions came from his own supporters about why he is one of just seven in his caucus who has refused to endorse the impeachment push. … Swing-district Democrats doggedly avoided the impeachment debate when they first got to Washington. Now they can’t avoid it. … But at dozens of town halls over the two-week recess, Brindisi and other vulnerable freshmen had to fend for themselves — serving as the party’s on-the-ground voices on impeachment. Whether they can deliver a message that resonates could determine Democrats’ chances of winning over the public and holding on to their seats and the House majority in 2020.”\n\nIndependents’ support for impeachment jumps 10 points - NPR: “A slim majority of Americans now approve of the Democratic House-led impeachment inquiry into President Trump, a new NPR/PBS NewsHour/Marist poll finds. Fifty-two percent say they approve of the inquiry, while 43% disapprove. That's a slight increase in support from two weeks ago, when 49% approved and 46% disapproved. The numbers are in line with other polls that have been released this week also showing majority support or an increase in support for the inquiry. The uptick in support in the NPR poll comes mostly from a swing among independents. In late September, more independents disapproved of the inquiry than approved, by a 50-44% margin. Now, in a reversal, more independents approve of the inquiry than disapprove, by a 54-41% margin, a net change of 19 points. On the questions of whether Trump should be impeached or removed from office, Americans are split — 49-47% in favor of impeachment and 48-48% on whether the Senate should vote to remove him.”\n\nROMNEY STEPS UP HIS ROLE FOR GOP\nPolitico: “President Donald Trump wants to sideline Mitt Romney — but the Utah senator isn’t having it. Even as he faces a barrage of attacks from the president and his allies, Romney is mapping out plans to play a central role in 2020 — headlining party events, shelling out cash from his campaign war chest, and hitting up his donor network for vulnerable senators on the ballot next year.Later this month, Romney will take his most aggressive step yet to insert himself into the 2020 campaign when he hosts a New York City fundraiser for Maine Sen. Susan Collins, Colorado Sen. Cory Gardner and Michigan Senate hopeful John James. All are establishment-aligned figures confronting tough races in swing states. Behind the scenes, Romney’s team has also begun directing his donors to help GOP candidates in Senate battlegrounds. Romney aides say he's always intended to help in competitive Senate races and that his desire to do so has never been influenced by Trump’s efforts to ostracize him.”\n\nDems eye Chelsea Clinton for New York House seat - NYT: “Ms. [Nita] Lowey’s announcement set off a wave of speculation about other potential contenders, including Chelsea Clinton, the daughter of former President Bill Clinton and Hillary Clinton, as well as a state assemblyman, David Buchwald. Last year, when asked if she envisioned running for elected office, Chelsea Clinton told The Journal News, which covers the Hudson Valley, that ‘if someone were to step down or retire,’ she would ‘have to think if it’s the right choice for me.’ Ms. Clinton did not mention any particular office, although she is clearly familiar with Ms. Lowey’s district: Her parents’ house in Chappaqua, N.Y., is in the district. Ms. Clinton herself does not live in Westchester, but congressional candidates are not required to live in the district they represent. A representative for Ms. Clinton did not return a request for comment. Mr. Buchwald said he would make an announcement within a few days.”\n\nOcasio-Cortez draws credible primary challenger - Fox News: “A prominent New York City Democrat filed with the Federal Election Commission (FEC) Thursday to launch a primary challenge for the House of Representatives seat currently held by Rep. Alexandria Ocasio-Cortez, D.-N.Y. City Council member Fernando Cabrera said he believes a moderate Democrat such as himself could beat the socialist Ocasio-Cortez. He plans to target her far-left views and highlight his belief that she is a ‘no show’ in the district. ‘Only a Democrat is going to be able to defeat her, and it’s going to be a moderate Democrat,’ Cabrera, who represents a Bronx City Council district, told Politico. ‘She’s a no-show in the district. She hasn’t brought about anything except division within the party.’ ‘Socialism doesn’t work,’ Cabrera added.”\n\nPompeo ally steps aside in Kansas Senate race - The Wichita [Kan.] Eagle: “A Kansas business leader with longtime ties to Mike Pompeo will not run for U.S. Senate after weighing a bid for months — renewing speculation about whether the secretary of state will enter the race. Alan Cobb, the president and CEO of the Kansas Chamber of Commerce, in the past has said he would defer to Pompeo if the chief diplomat decided to mount a campaign. Cobb, a former Koch Industries lobbyist, advised Pompeo in 2014 during a congressional primary battle against former Rep. Todd Tiahrt. He made no mention of Pompeo in a lengthy statement Thursday announcing his decision. Cobb said that ‘after months of serious deliberation, analysis, and careful and prayerful consideration with friends, colleagues and my family, I have decided that the best place for me to pursue my passion is to remain as the President and CEO of the Kansas Chamber.’”\n\nPLAY-BY-PLAY\nIt was the foreign policy he promised, but Trump still pays price - NYT\n\nLocations and dates for 2020 general election debates announced Friday - CPD Judges rule in favor of House Dems seeking Trump’s tax returns - NYT\n\nRead this: The pen pal who changed a president - Narratively\n\nReese’s dominates Halloween candy favorites poll- Monmouth University\n\nAUDIBLE: YOU DO YOU\n\n“Well, I’m going to assume it’s a guy who said that… And I’m going to say, then just marry one woman. I’m cool with that. If you can find one.” – Sen. Elizabeth Warren’s answer during CNN’s Equality Town Hall on Thursday night, when asked what she would say to a supporter who believes marriage is between one man and one woman.\n\nANY GIVEN SUNDAY\n\nThis weekend Mr. Sunday will sit down with Sen. Chris Van Hollen, D-Md. Watch “Fox News Sunday with Chris Wallace.” Check local listings for broadcast times in your area.\n\n#mediabuzz - Host Howard Kurtz has the latest take on the week’s media coverage. Watch #mediabuzz Sundays at 11 a.m. ET. \n\nFROM THE BLEACHERS\n\n“I need your help. I don’t get what is going on with the Syria/Turkey situation. I understand the following: Trump has proclaimed that he is pulling troops from Syria after what has been a long involvement (partnering) with the Kurds. But, that doesn’t happen overnight, right? Once Trump announced the pulling of troops, Turkey is waiting on the sideline frothing at the chance to attack. They then attack, even with threats from Trump that they better not or there will once again be sanctions. Now the number of Kurds killed are rolling in, but are our troops still there? If they are, what are they doing? Is there something that Trump picked up on that is going on with the Kurds? The conspiracist side of me thinks he sniffed something out. My husband is an Iowa farmer and I work in crop insurance. We don’t have many ties to the military but sure understand how government a lot of the time just doesn’t make sense. Any insight would be appreciated.” – E’Lise Bracker, Underwood, Iowa\n\n\n[Ed. note: No conspiracy here, Ms. Bracker. The number of U.S. troops in the disputed area was very small – measured in dozens. They were not a credible threat in terms of actually combating Turkey’s forces but rather something of a marker. By having the troops there, we were telling the Turks to stay out and leave our Kurdish allies alone. It was a small-scale version of the U.S. forces in South Korea: To fight, the Turks would have had to kill Americans, thereby bring our military down on their heads. Upon the president’s order, the U.S. troops were quickly out of the Turks’ zone of aggression. The Americans went to Iraq and other U.S. spots in the region, clearing the way for the Turks to start pummeling their ancient Kurdish enemies.] \n\n\n“I am a huge fan of the Halftime Report and never miss it! Your struggle to remain fairly balanced is appreciated, especially by this reader who also struggles mightily to find truth and facts amid the bias and innuendo currently being passed off as ‘news.’  But I am confused by most of the polls' questions (especially the polls you quote) that seem to ask a compound question: Do you favor impeachment and removal of President Trump? I was under the impression that these are two distinct question.  That impeachment is like a grand jury investigation, i.e. a procedure (in the House) designed to decide whether there are grounds for a trial (by the Senate) to decide if removal is warranted or not. Am I wrong?  Please explain!  And keep up the good work!!!” – Tom Scherer, Udon Thani, Thailand\n\n\n[Ed. note: This is an excellent question, Mr. Scherer! Different pollsters do indeed ask these questions in different ways. The complexity of the situation is partly to blame. An “impeachment inquiry” is not a thing. It’s like a couple being “pre-engaged.” But some pollsters have been asking about it, which tends to screw things up. Getting respondents to differentiate between an “impeachment inquiry” and “impeachment” is quite a lot of hair-splitting for civilians. Our poll does it the right way (obvi) and asks whether voters support impeachment, impeachment and removal or no impeachment. Those are the three constitutional possibilities. In our poll, 4 percent of respondents said they wanted the president impeached but not removed. That adds up to 55 percent favoring impeachment and 51 percent favoring removal.]\n\n\n“All my teams have long gone home for the winter. So now we have your traditional Nine in the form of the quite surprising Cardinals playing your hometown Nationals (who should be the Senators and in the American League with Walter Johnson throwing flames, but oh, well). Where do your loyalties lie?” – Mary Carol Miller, Greenwood, Miss.\n\n\n[Ed. note: Hometown!? Washington, D.C.!? My place of residence, certainly. And I do love living here. But c’mon, Doc! My hometown is Wheeling, W.Va. and the Cardinals, whose order I lustily joined as a boy when my family moved to St. Louis for four years, are my baseball team. I admire the Nats’ pluck and am grateful for the chance they are affording me to watch the National League Championship Series in person. But I love the Cardinals and am absolutely over the moon with this year’s squad. What a bunch! The infield alone may be the greatest since my glory days of fandom in the mid-1980s. Matt Carpenter is an absolute rock for the team and the personification of professionalism, Paul DeJong is a clutch player (whoever heard of a slugger shortstop?) who seems like he was born to be a Cardinal, Kolten Wong surfs second base like the pros ride waves at Honoli’i in his hometown and Paul Goldschmidt has shown in his tenacity, play and quality of his character that he is truly in the right uniform. And Yadi is nothing less than a national treasure. So suffice it to say: Viva el Birdos!]        \n\n\n“How ‘bout them Redbirds! We miss you on Twitter where we could delight in the pure joy emanating from Cardinals gifs, memes, and tweets after a playoff series win…but the mailbag will have to do!” – Jack Whiteman, St. Louis\n\n\n[Ed. note: *fredbird waving giant flag gif*]\n\nShare your color commentary: Email us at HALFTIMEREPORT@FOXNEWS.COM and please make sure to include your name and hometown.\n\n‘THIS IS A NUDGE TO PICK UP THE FUDGE’\nAP: “Officials in a southwest Missouri city are planting small flags in piles of abandoned dog poop as part of a campaign to get residents to clean up after their pets downtown. The Police Department in Springfield, Mo., posted photos of the flags in use on its Facebook page Wednesday. The flags contain messages such as, ‘Is this your turd? ‘Cuz that's absurd’ and ‘This is a nudge to pick up the fudge.’ The campaign started this week and the department noted on Facebook that leaving behind a pet's mess in many cases violates a city ordinance. The city's Environmental Services said the flags are made of bamboo and recycled paper and downtown crews will pick them up if they have to clean up pet waste.”\n\nAND NOW, A WORD FROM CHARLES…\n\n“The whole debate arouses dismay, and not just because of the overreaching claims of both sides. One has an instinctive feeling that religion has a place in American public life, and that both sides misunderstand it—that between sectarianism and secularism lies something else.” – Charles Krauthammer (1950-2018) writing in the New Republic on April 9, 1984.  \n\nChris Stirewalt is the politics editor for Fox News. Brianna McClelland contributed to this report. Want FOX News Halftime Report in your inbox every day? Sign up here.",
      "date": "October 11",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Donald Trump Jr. has message for Ocasio-Cortez after she bashed Politico article",
      "url": "https://www.foxnews.com/politics/donald-trump-jr-agrees-with-ocasio-cortez-who-bashed-politico-article-as-gossip",
      "subtitle": "Donald Trump Jr. has message for Ocasio-Cortez after she bashed Politico article",
      "author": "Frank Miles",
      "content": " For a day, there is bipartisanship in Washington. President Trump’s son went on Twitter to agree with Rep.-elect Alexandria Ocasio-Cortez, D-N.Y., who called out mainstream media’s “fake news.” “Welcome to our world... You think that's bad? Imagine what it's like when they actually hate you,” Donald Trump Jr. tweeted, retweeting her Tuesday afternoon swipe at a news article that she'd dismissed as “gossip.” The article in Politico, citing anonymous sources, claimed the Democratic socialist from the Bronx is seeking to challenge House leadership, seen as too conservative for Justice Democrats; this far-left group is seeking future bids to run primary candidates against moderate Democrats in coming elections. The news outlet’s vice president of marketing and communications, Brad Dayspring, stood by Politico’s journalism: “It’s hard to know what the criticism of the piece is, since the congresswoman-elect doesn’t specify (nor has she or anyone from her staff asked for a correction). We stand by our reporting.” Ocasio-Cortez, together with other newly elected lawmakers, is set to start her term on Jan. 3.",
      "date": "December 19",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Rush Limbaugh: Democrats desperate to get 'Donald Trump out of office' turning attacks on AG William Barr",
      "url": "https://www.foxnews.com/politics/rush-limbaugh-democrats-desperate-to-get-donald-trump-out-of-office-now-turning-attacks-on-attorney-general-william-barr",
      "subtitle": "Rush Limbaugh: Democrats desperate to get 'Donald Trump out of office' turning attacks on AG William Barr",
      "author": "Liam Quinn",
      "content": " Desperate Democrats determined to oust President Trump are now trying to delegitimize Attorney General William Barr’s summary of Special Counsel Robert Mueller’s report. That’s according to conservative media star Rush Limbaugh, who made the fiery claim during an appearance on Fox News Channel’s “Hannity” on Thursday night. Limbaugh opened the interview by declaring the Democratic Party is at “war” with the president and his fellow Republicans, before turning his attention to Mueller’s Russia investigation. “The objective remains to get Donald Trump out of office, either by driving his numbers down or impeaching him or defeating him in 2020,” he told Hannity. “It is not over. It is still happening. The Democrat party and the media and all of these people from the Obama Administration that ran this scandal are still running it.\" RUSH LIMBAUGH URGES TRUMP TO TAKE SWEEPING ACTION AT END OF MUELLER PROBE Limbaugh added: “The New York Times has the story that the Mueller report is 300 pages and the Barr summary is four pages and, therefore, Barr is lying…Pelosi literally said that we cannot trust the attorney general.” Limbaugh continued his denunciation of Democrats, before taking a swipe at the media. “These people are believing now that there is evidence of collusion in the Mueller report and that Barr is not telling the truth,” he said. “The New York Times is leading this effort. The rest of the drive-by media is going to pick it up because it prolongs the narrative that Trump is unworthy, that Trump cheated, that we need to redo the election results of 2016.” GRAHAM DERIDES DEMS 'OLIVER STONE' APPROACH TO MUELLER REPORT The conservative host then posed a question: “So we are being led to believe that this report does contain evidence of collusion. Barr is lying about it… this is so silly. If it contains evidence of collusion, then where is Mueller on television all night saying ‘wait a minute, wait a minute. That is not what my report says. My report says there is plenty of evidence of collusion.” Earlier, Limbaugh appeared on “Special Report with Bret Baier” and called on the president to declassify everything related to the Mueller report and the Foreign Intelligence Surveillance Act -- and that only began Limbaugh's list. “You know what I wish he would do? Declassify everything to do with FISA and everything to do with this investigation, then announcing he's closing the border and shutting down immigration until we can get a handle on it,” Limbaugh told Bret Baier. “And then pardon everybody that has been abused by this unnecessary investigation.” REP. SWALWELL: TRUMP COULD HAVE STILL COLLUDED DESPITE MUELLER REPORT The conservative host called the Russia investigation a “manufactured coup” and said accountability is needed from the Obama administration to the media. CLICK HERE TO GET THE FOX NEWS APP “There needs to be an investigation into this. There needs to be accountability for everybody who participated in this from people high up in the Obama administration all the way down and including most of the mainstream media,” Limbaugh said. “The people of this country were told their president was a traitor. They were assured their president had colluded and stolen the election. None of it happened. And the special counsel has known there was no collusion since before the investigation began. There has never been any evidence of it.”",
      "date": "March 29",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Dem strategist: Republicans focus on Joe Biden allegations because he’s potential candidate ‘Donald Trump fears the most’",
      "url": "https://www.foxnews.com/politics/jon-summers-republicans-focus-on-joe-biden-allegations-because-hes-the-potential-presidential-candidate-donald-trump-fears-the-most",
      "subtitle": "Dem strategist: Republicans focus on Joe Biden allegations because he’s potential candidate ‘Donald Trump fears the most’",
      "author": "Talia Kaplan",
      "content": " Democratic strategist Jon Summers charged Thursday that Republicans were working to keep alive stories about Joe Biden allegedly inappropriately touching women because he's the potential 2020 candidate \"Donald Trump fears the most.\" “I think Republicans are grabbing onto this, they want this story out there as much as they can, because (he's) the one (they fear), he’s the one that Donald Trump fears the most,” Summers, former communications director for Harry Reid, said on “Fox & Friends” Thursday, pointing out he is not supporting any particular candidate but is “just stating the obvious.” BIDEN TEAM CHARGES AHEAD WITH 2020 PLANS DESPITE ALLEGATIONS: IT'S 'STRENGTHENED HIS RESOLVE' He added, “That when the president comes out and says (he'd) love to run against Joe Biden, the reality is that’s exactly the guy he doesn’t want to run against, so they keep this story alive.” Biden addressed the growing backlash on Twitter Wednesday, releasing a video and writing in a tweet, “Social norms are changing. I understand that, and I’ve heard what these women are saying. Politics to me has always been about making connections, but I will be more mindful about respecting personal space in the future. That’s my responsibility and I will meet it.” The release of the video on Wednesday came amid allegations from numerous women that Biden had made them feel uncomfortable with what was described as inappropriate touching. Moments after Biden tweeted the video, a Washington Post story relayed the accounts of three more women claiming improper contact, on the heels of four similar allegations. BIDEN DEFENDED BY INSIDERS, TRASHED BY OUTSIDERS, DEPENDING ON THEIR POLITICS “Anyone who has ever met him (Biden) knows that he is about one of the most kind, caring people you could ever ask for,” said Summers. CLICK HERE TO GET THE FOX NEWS APP He added, “He actually understands your issues and really wants to connect. And I think what he’s realized is that we’re in a place now where the way he has handled that in the past, he can’t do that anymore and he has admitted that and that he’s going to change his ways. I think when you contrast that with our current president, who has been caught on tape bragging about sexually assaulting women and who has still yet to apologize even for the comments much less the actions, I think there is a very clear contrast there and I think that’s refreshing to most people.”",
      "date": "April 4",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Donald Trump Jr. trolls BuzzFeed following Mueller team's report dispute: 'Hahahahaha'",
      "url": "https://www.foxnews.com/politics/donald-trump-jr-reacts-to-mueller-team-disputing-buzzfeed-report-hahahahaha",
      "subtitle": "Donald Trump Jr. trolls BuzzFeed following Mueller team's report dispute: 'Hahahahaha'",
      "author": "Elizabeth Zwirz",
      "content": " Donald Trump Jr. had a lot to say on Twitter Friday night after Special Counsel Robert Mueller’s office released a statement disputing a BuzzFeed News report that claimed the president directed Michael Cohen to lie about the timing of discussions over a proposed Trump Tower project in Moscow. Trump Jr.’s flurry of tweets on the topic appeared to start with his response to a post from BuzzFeed News that criticized Trump supporters' position on the controversial report. The reaction: one of simple laughter, as he wrote \"haha\" over and over again. The statement from the Special Counsel’s Office was released Friday evening, claiming that “BuzzFeed’s description of specific statements to the Special Counsel’s Office, and characterization of documents and testimony obtained by this office, regarding Michael Cohen’s Congressional testimony are not accurate.” TRUMP ATTORNEY DISMISSES REPORT ALLEGING PRESIDENT TOLD COHEN TO LIE TO CONGRESS; DEMS CALL FOR INVESTIGATION In a story published Thursday, BuzzFeed cited two unnamed federal law enforcement officials involved in an investigation on the matter who said Cohen acknowledged to Mueller’s office that he was instructed by Trump in 2017 to lie to Congress about the now-abandoned real estate deal to build a Trump Tower in Russia. The report said Mueller’s office first learned of the directive from interviews with witnesses from the Trump Organization and internal company email, text messages and documents. The report, which was not confirmed by Fox News, was immediately dismissed by President Trump’s legal team. MUELLER TEAM DISPUTES BUZZFEED REPORT CLAIMING TRUMP TOLD COHEN TO LIE Slamming the report as fake news, Donald Trump Jr. went on to tweet about how the media might cover the special counsel’s statement. “If the media does not spend — minute for minute — the same amount of time on the death of the latest #FakeNews from @BuzzFeed (RIP) that they did speculating about 'IF IT’S TRUE!' then they should quit even pretending to be unbiased,” he tweeted. “What a disgrace. #RIPbuzzfeed” CLICK HERE TO GET THE FOX NEWS APP He also took aim at Rep. Adam Schiff, D-Calif., responding to a previous tweet from the lawmaker, saying “Hey Adam, turns out it was Full of Schiff!” The earlier tweet from Schiff described the allegation as being “among the most serious to date.” He vowed that “we will do what’s necessary to find out if it’s true.” Fox News’ Alex Pappas, Brooke Singman and Jake Gibson contributed to this report.",
      "date": "January 18",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Donald Trump Jr. compares Buzzfeed coverage to Catholic HS confrontation, says Schiff leaking",
      "url": "https://www.foxnews.com/politics/donald-trump-jr-on-buzzfeed",
      "subtitle": "Donald Trump Jr. compares Buzzfeed coverage to Catholic HS confrontation, says Schiff leaking",
      "author": "Gregg Re",
      "content": " Donald Trump Jr., in an exclusive interview Monday night with Fox News' \"The Ingraham Angle,\" accused House Intelligence Committee Chair Adam Schiff of orchestrating a series of inaccurate leaks aiming to damage the White House, saying there is a \"99.9 percent chance he's the guy that was leaking my testimony as I was testifying\" in 2017. Trump Jr. also compared Thursday's discredited BuzzFeed article, which alleged that President Trump directed Michael Cohen to lie to Congress, to the media coverage this weekend surrounding a widely documented encounter near the Lincoln Memorial involving several pro-Trump Catholic high school students, black activists shouting homophobic slurs, and a Native American man. \"You had some Catholic schoolboys that were at a right-to-life march, okay? They were wearing a MAGA hat,\" Trump Jr. said. \"They had to pounce because the media wants that to be true. They want a bunch of nice, Catholic kids -- happen to be white -- they want them to be the enemy.\" Many liberal and conservative commentators criticized the students -- and, in some cases, called for them to be personally harassed and their school closed -- based on initial, incomplete videos of the encounter,  only to walk back their comments after a fuller video showed that the students themselves had been harassed, and that the students did not appear to approach the Native American man or the activists at any point. BUZZFEED REPORTER UNABLE TO EXPLAIN KEY DISCREPANCY IN POST-ARTICLE STATEMENTS; CNN ANCHOR RIPS BUZZFEED'S 'DERELICTION OF DUTY' And after the BuzzFeed article was published, some commentators and top Democrats said it raised the possibility the president should be impeached if it were accurate. \"They need it to be true, Laura,\" Trump Jr. added. \"They've been pushing this nonsense for two years. They've found nothing. ... If you're not sure it's true, don't push it for 14 hours straight.\" He continued: \"This isn't the first time that happened. You saw it right after I did my testimony, and they said, 'Oh, Donald Trump Jr. had the Wikileaks information,' because presumably, Adam Schiff leaked it right after my testimony to them, and conveniently took out the one before the four, turning the 14th into the 4th, meaning I had it six days before the world saw it, as opposed to four days after the entire world saw it.\" In late 2017, CNN senior congressional correspondent Manu Raju reported that Trump Jr. had received early, private access to Wikileaks documents -- a story that turned out to be entirely false. Trump Jr. has previously accused Schiff, D-Calif., of leaking details about his closed-door testimony before the Senate Intelligence Committee. In response, a Schiff spokesman asserted that Schiff and his staff \"do not leak classified or confidential information. ... [But] we do not permit witnesses to represent publicly that they are fully cooperating with our committee and privately refuse to answer questions pertinent to our investigation on the basis of meritless claims of privilege.\" Trump Jr.'s longstanding allegations that the media uses unreliable leaks to treat the White House unfairly were thrust into the spotlight again this week, after BuzzFeed News investigative reporters Anthony Cormier and Jason Leopold authored their bombshell, since-discredited report on Thursday. (Schiff, on Sunday, vowed to launch a probe into the substance of the story.) The article cited two law enforcement officials who said Michael Cohen had acknowledged to Special Counsel Mueller’s office that President Trump told him to lie to Congress about a potential real-estate deal in Moscow, and to claim that the negotiations ended months before they did so as to conceal Trump’s involvement. The article claimed that \"internal company emails, text messages, and a cache of other documents\" confirmed Trump's instruction to Cohen. But Mueller issued his first public statement in more than a year to repudiate the BuzzFeed report just one day later, asserting in a brief statement that the story's key elements were \"not accurate.\" The Washington Post has since reported that Mueller intended his rare denial to mean that the story was \"almost entirely incorrect,\" and that the special counsel's office immediately \"reviewed evidence to determine if there were any documents or witness interviews like those described, reaching out to those they thought might have a stake in the case. They found none.\" And Trump attorney Rudy Giuliani told Fox News on Monday that his team communicated with Mueller's office last week about the BuzzFeed article -- and agreed a significant portion of it was false. \"There are no texts and emails or other documents to corroborate BuzzFeed's claim for the simple reason that it is not true,\" Giuliani told Fox News. \"Whoever is responsible for this is lying.\" He added: \"We commend them for standing up for the truth,\" referring to Mueller’s team. MUELLER TEAM COMMUNICATED WITH TRUMP LAWYERS BEFORE DENYING DISCREDITED BUZZFEED REPORT,  GIULIANI SAYS Leopold has been involved in numerous scandals during his career related to his false reports, including one in 2002 for Salon.com about Enron that the outlet said was \"riddled with inaccuracies and misrepresentations,\" and another incorrect story in 2006 for Truthout.org about supposedly pending indictments against former George W. Bush aide Karl Rove. In an interview with CNN on Sunday, Cormier declined to explain why Leopold had claimed to have seen the documents proving that Trump had ordered Cohen to lie to Congress -- contradicting Cormier's insistence in a separate post-article interview on Friday that he had not personally seen the documents. \"We can't get into, like, the details there,\" Cormier, sitting next to BuzzFeed News Editor-in-Chief Ben Smith, told CNN's \"Reliable Sources\" host Brian Stelter. \"We really can't go any further at all, in order not to jeopardize our sources.\" Leopold did not appear for the interview, which occasionally became tense as Stelter openly criticized BuzzFeed's journalistic practices. Smith claimed Leopold, who has been out of the public view since Friday, was busy \"reporting.\" In an interview on Friday, Cormier told CNN, “No, I’ve not seen it personally,” when asked if he had seen the documents mentioned in the story that purportedly showed Trump told Cohen to lie. Cormier only claimed that the two sources he cited were “fully, 100 percent read-in to that aspect of the special counsel’s investigation.” However, Leopold, speaking separately to MSNBC, remarked that, \"I don’t think we’ve said we haven’t seen [the documents]\" and clarified, \"I’ll say we’ve seen documents and been briefed.\" CLICK TO GET THE FOX NEWS APP Leopold later suggested that he meant to say that he has seen the documents, but that Cormier has not, telling Mediaite, \"Yes. Anthony said HE had not personally seen the documents.” Cormier added in the interview with Stelter on Sunday: \"I have further confirmation that this is right. We are being told to stand our ground … The same sources that we used in that story are standing behind it, as are we.” But Smith and Cormier also acknowledged they were not aware of the precise language Trump would have used in instructing Cohen to lie. Stelter, in the interview, also slammed Leopold's terse request for comment to Mueller's office, sent just hours before the article was published, as a \"dereliction of duty\" by the publication. President Trump has called BuzzFeed's decision to publish the discredited article \"disgraceful,\" and Vice President Mike Pence charged on Sunday that the media was \"obsessed\" with taking down Trump. \"It was remarkable what we saw happening for 24 hours in the media, on the basis of the report that appeared in BuzzFeed,\" Pence told \"Fox News Sunday\" anchor Chris Wallace. \"It's one of the reasons why people are so frustrated with many in the national media.\" Fox News' Laura Ingraham, John Roberts, Chris Wallace, and Samuel Chamberlain contributed to this report.",
      "date": "January 21",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Donald Trump, exceptionalist",
      "url": "https://www.foxnews.com/politics/donald-trump-exceptionalist",
      "subtitle": "Donald Trump, exceptionalist",
      "author": "Chris Stirewalt",
      "content": " **Want FOX News Halftime Report in your inbox every day? Sign up here.** On the roster: Donald Trump, exceptionalist - Russian outrage over Syria strikes - It’s official: Gorsuch confirmed as Justice - ‘Power Play’ plays on - Orgies are a young snake’s game\n\n DONALD TRUMP, EXCEPTIONALIST \nIf you wondered what American exceptionalism looks like, the 59,000 pounds of U.S. warheads raining down on Syria’s air force is a pretty good snapshot.\n\n America, the apex power of the world, does not tolerate the use of chemical weapons. We forbid it. Another country used chemical weapons – repeatedly – in its civil war, so the United States punished that nation by depleting its military.\n\n There are other countries in the world with the capability to deliver that kind of firepower and spend something approaching $100 million to send a message about the rules of war. But only the United States has the wherewithal to do so without even breaking a sweat.\n\n And, we dare say, that no other country in the world combines such capabilities with our moral authority.  As much maligned, sometimes rightly, as America’s overseas interventions have been, no great power in history can match our track record of the use of force without conquest. \n\n Members of Congress, Democratic and Republican, want President Trump to get congressional authorization if he intends to keep up the strikes or undertake, ahem, a forward strategy of freedom to remove Syrian dictator Bashar al-Assad from power and install a Western-style liberal democracy in his place.\n\n But as for the legality of this attack, there’s not much to debate. As when the British Empire unilaterally decided in 1807 to use its navy to stop the slave trade, powerful nations have special privileges when confronting moral odium. Right and might together are hard to beat.\n\n And that is what the traditional understanding of American Exceptionalism has been, not the more recent vintage that held that it was a little different from patriotism. Exceptionalism does not here refer to the qualities of the nation, but rather that there are exceptions to the rules for this nation because of its qualities. \n\n America can have nuclear weapons but says that others can’t. America can sail its navy when and where it pleases, but forbid others so to do. And so on… It is not fair, but for more than a century, and in some ways since our founding, it is a right which America has claimed and defended as a privilege merited by our virtue.\n\n Now, you may or may not like that role for our country. You may, as Trump held during his campaign, believe that America is a sap and a sucker that spends money and sheds blood overseas without anything in return, allowing other countries to take advantage of us.\n\n Or you may believe, as Trump did when his predecessor, Barack Obama, contemplated a similar action punishing for atrocities committed four years ago, that such interventions threaten U.S. national security and divert needed resources from rebuilding the United States. \n\n And given the ways in which America has failed in the exercise of its power over the decades, these are far from unsupported arguments. In fact, what is happening in Syria today can properly be said to substantially descend from a confused and confusing application of American power.\n\n And here we get to the questions with which human beings always struggle the most. \n\n We arrange our thinking and pursuits very much around questions relating to the word “can.” Those are simpler since they relate more to the other understanding of being exceptional -- can we do it? The hard ones are about “should.” The application of American power, exceptional or not, should always be governed more by the latter than the former.\n\n But as for the question of what America’s rightful role in the world is, Trump, after many years arguing the opposite, has placed himself firmly on the side of the exceptionalists. \n  \nRUSSIAN OUTRAGE OVER SYRIA STRIKES\nAP: “World leaders rallied around the United States after it launched a missile strike early Friday on a Syrian air base in response to this week's chemical attack, while Russia condemned the move as ‘aggression’ and suspended crucial coordination with Washington in Syria's congested skies. The overnight missile attack, which marked the first time the U.S. has directly targeted Syrian President Bashar Assad's forces, was condemned by his allies in Russia and Iran but welcomed by the Syrian opposition and its supporters, who expressed hope it signaled a turning point in the devastating six-year-old civil war. The bombing represents Trump's most dramatic military order since taking office and thrusts the U.S. administration deeper into the complex Syrian conflict. The Obama administration threatened to attack Assad's forces after previous chemical attacks, but never followed through.”\n\nBut claim they wouldn’t have been harmed - Miami Herald: “The Russian military says its facilities in Syria are reliably protected by cutting edge air defense weapons … Russian Defense Ministry spokesman Maj. Gen. Igor Konashenkov said Friday that the S-400 and Pantsyr air defense systems offer a ‘guaranteed protection’ to Russian warplanes stationed at Hemeimeem air base in Syria's province of Latakia. He added that a Russian navy outpost in Syria's Mediterranean port of Tartus is protected by S-300 air defense systems. Konashenkov has previously said that the Russian military would help the Syrian military beef up its air defenses following the U.S. strike.\n\n And Iran isn’t happy either - LA Times: “Iran on Friday condemned the Trump administration’s missile strikes against Syria, saying the unilateral U.S. action would strengthen terrorists and ‘further complicate the situation’ in the Middle East. The Islamic republic, a strong ally of Syrian President Bashar Assad, said that while it condemned the use of chemical weapons, the U.S. response was ‘dangerous, destructive and a violation of international law.’ Iranian Foreign Ministry spokesman Bahram Ghassemi rejected the conclusion that Assad’s forces had carried out the poison attack on Tuesday that killed more than 70 people in the town of Khan Sheikhoun, in rebel-held Idlib province.”\n\nSOME MEMBERS OF GOP ARE NOT ON BOARD\nThe Hill: “Sen. Rand Paul (R-Ky.) said Thursday night that President Trump needs congressional authorization for military action in Syria after Trump ordered an airstrike in retaliation for a deadly chemical attack earlier this week. ‘While we all condemn the atrocities in Syria, the United States was not attacked,’ Paul said in a statement shortly after reports that the U.S. had launched more than 50 Tomahawk cruise missiles against an airfield in Syria. ‘The President needs congressional authorization for military action as required by the Constitution, and I call on him to come to Congress for a proper debate,’ Paul said.\n\nTHE RULEBOOK: ONE COURT TO RULE THEM ALL \n“To avoid the confusion which would unavoidably result from the contradictory decisions of a number of independent judicatories, all nations have found it necessary to establish one court paramount to the rest, possessing a general superintendence, and authorized to settle and declare in the last resort a uniform rule of civil justice.” – Alexander Hamilton, Federalist No. 22 TIME OUT: HAIL, LEXINGTON! \nHistory: “On this day in 1776, Navy Captain John Barry, commander of the American warship Lexington, makes the first American naval capture of a British vessel when he takes command of the British warship HMS Edward off the coast of Virginia. The capture of the Edward and its cargo turned Captain Barry into a national hero and boosted the morale of the Continental forces. Barry was born in the seaboard county of Wexford, Ireland, in 1745 and offered his services to the Continental Congress upon the outbreak of the American Revolution. Congress purchased Barry’s ship, Black Prince, which it renamed Alfred and placed under the command of Commodore Esek Hopkins. It was the first ship to fly the American flag, raised by John Paul Jones.” Flag on the play? - Email us at \nHALFTIMEREPORT@FOXNEWS.COM with your tips, comments or questions. IT’S OFFICIAL: GORSUCH CONFIRMED AS JUSTICE\nAP: “The Senate confirmed Neil Gorsuch to become the newest associate justice on the Supreme Court Friday, elevating Donald Trump's nominee following a corrosive partisan confrontation that could have lasting impacts for the Senate and the court. Vice President Mike Pence was presiding as the Senate voted 54-45 in favor of Gorsuch, a 49-year-old veteran of the 10th U.S. Circuit of Appeals in Denver whose rulings make him an intellectual heir to the late Justice Antonin Scalia, whose seat he will fill. Gorsuch won support from 51 of the chambers' Republicans as well as three moderate Democrats up for re-election in states Trump won last fall: Joe Manchin of West Virginia, Heidi Heitkampof North Dakota and Joe Donnelly of Indiana. GOP Sen. Johnny Isakson of Georgia did not vote.” TRUMP SON-IN-LAW DIDN’T DISCLOSE RUSSIA MEETINGS \nNYT: “When Jared Kushner, President Trump’s son-in-law and senior adviser, sought the top-secret security clearance that would give him access to some of the nation’s most closely guarded secrets, he was required to disclose all encounters with foreign government officials over the last seven years. But Mr. Kushner did not mention dozens of contacts with foreign leaders or officials in recent months. They include a December meeting with the Russian ambassador, Sergey I. Kislyak, and one with the head of a Russian state-owned bank, Vnesheconombank, arranged at Mr. Kislyak’s behest. The omissions, which Mr. Kushner’s lawyer called an error, are particularly sensitive given the congressional and F.B.I. investigations into contacts between Russian officials and Trump associates.”\n\n Tell us how you really feel, Steve Bannon - The Daily Beast: Donald Trump’s chief strategist Stephen Bannon has called the president’s senior advisor and son-in-law Jared Kushner a ‘cuck’ and a ‘globalist’ during a time of high tension between the two top aides, several Trump administration officials told The Daily Beast. The fighting between Kushner and Bannon has been ‘nonstop’ in recent weeks, according to sources who spoke on condition of anonymity. It’s been an ‘open secret’ that Bannon and Kushner often clash ‘face-to-face,’ according to senior officials.”\n\n‘POWER PLAY’ PLAYS ON\nAnother week, another round of “Power Play with Chris Stirewalt.” We liked our addition of the weekly news quiz so much we did it again. Have you been following this week’s news close enough to “Fill-In the Trump?” It was no walk in the park for this week’s brave contestants, Byron York and Katie Pavlich. See if your knowledge has the power to play. WATCH HERE\n\n PLAY-BY-PLAY\nMatthew Continetti explains why Trump supporters are getting what they voted for - Free Beacon\n\nRepublican National Committee 2017 fundraising off to a strong start - WSJ\n\nFreedom Caucus members show signs of support for health care bill with changes - Reuters\n\nMarch job numbers show low growth - AP\n\nANY GIVEN SUNDAY\n Fox News Sunday - Sens. John Cornyn R-Texas and Ben Cardin D-Md., discuss the latest on U.S. military action in Syria. Plus, the anticipated confirmation of Judge Neil Gorsuch is over. Senate Republicans can celebrate but how are the Democrats feeling about the outcome. Watch “Fox News Sunday with Chris Wallace” Check local listings for broadcast times in your area.\n\n#mediabuzz - Host Howard Kurtz has the latest take on the week’s media coverage. Watch #mediabuzz Sundays at 11 a.m. ET. AUDIBLE: ASK PAZUZU… \n“Why did it take John Cena so long to propose marriage to Nikki Bella? And remember you’re under oath.” – Rep. Rod Blum shares a lighter moment with Linda McMahon head of the Small Business Administration and the former World Wrestling Entertainment CEO.\n\n FROM THE BLEACHERS\n“I enjoy reading your Halftime Report and here's an Alexander Hamilton thought that's quite timely: “If a pertinacious minority can control the opinion of a majority...[the government's] situation must always savor of weakness, sometimes border upon anarchy.” I found that in an Atlantic article about Cato turning the Roman senate into a morass. The authors posited that the Founding Fathers were familiar with what Cato's actions led to (the First Triumvirate) and the Feds had no desire for the minority to lead the majority around by the nose. Bipartisan actions are preferable to one-party rule and I hold out hope that senators will seek to serve country rather than party, but what's America without hope? France? The filibuster is not in the U.S. Constitution and deserves the boot. And the absence of the filibuster gives the New York Times one less opportunity to be hypocritical -- sweet!” – Michael Friend, Atlanta, Ga. \n\n[Ed. note: You are quite right, Mr. Friend. There is nothing magical about vote thresholds in the U.S. Senate. But I would argue that the increased thresholds have been a good check on the factionalism intensified by direct election over the past century. I do believe the Senate will endure, and may even thrive in this new era. But I still cannot help thinking that the loss of comity, though perhaps unavoidable, will come at some greater cost, especially for the court. A bad idea is not made good by virtue of bipartisan support. It is possible for both parties to be wrong at the same time. What pains me to see, however, is that with the rise of mobocracy, there is so little room for leadership.]  \n\n“Any chance you could describe the difference between partisan and ‘rank partisan’? Possibly you might look to see if there is a correlation between the rise of the demos replacing the republic and the loss of the ‘most free’ nation on earth to out of the top 10.” – George Chapogas, Rivas, Nicaragua \n\n[Ed. note: I think you’re on to something, Mr. Chapogas! At the risk of sounding sanctimonious, I will say that the difference between a partisan and a rank partisan is ordinal in nature. Partisanship is fine if it still leaves room for putting your country first.]\n\n “I think you are trying to prove we live in a multiverse. My version of the universe has the last three Democrat Supreme Court nominees getting approved, mostly along philosophical lines, without a talk-a-thon or filibuster. In your version of the universe it’s OK for the Democrats to act like 2 year old, crying because they didn't get their way, because their nominee for the Supreme Court wasn't considered? The lack of getting their nominee considered was  exactly because they laid out a set of rules about 40 years ago and then amplified by their ex VP, that said that no Supreme Court nominee from the opposing party would be consider in the last year of their President's term..... Is there a remote possibility that we could bring these two universes back to one, where we can all conduct our conversation based on one set of data, not multiple sets?” – Paul Hill, New Bern, N.C.\n\n[Ed. note: There’s no debate that Democrats had it coming on the nuclear option. But whatever universe you live in, it sometimes proves helpful to consider things from a view outside of tu quoque arguments. I don’t blame Republicans for taking the step that they did, but I still lament the deterioration of republican ideals.]\n\nShare your color commentary: Email us at HALFTIMEREPORT@FOXNEWS.COM and please make sure to include your name and hometown.\n\n ORGIES ARE A YOUNG SNAKE’S GAME\nNat Geo: “Right now in Manitoba, Canada, tens of thousands of red-sided garter snakes are emerging from their winter dens to mate in massive, roiling throngs. While this bizarre reproductive strategy seems like it might be dangerous for the females, who may have upwards of one hundred males trying to mate with each of them at once, a new study published this week in the Royal Society journal Proceedings B finds that it’s the males who suffer most in the long-term. ‘Our results suggest that the male snakes may face a cost of such intense reproductive investment in the form of shortened telomeres, which cap the ends of chromosomes,’ says Emily Uhrig, a behavioral ecologist who coauthored the study while completing a PhD at Oregon State University.”\n\nAND NOW, A WORD FROM CHARLES…\n “I'm just saying that when a superpower changes its policy radically because a president is moved by pictures, you've got to wonder about the stability of the foreign policy.” –Charles Krauthammer on “Special Report with Bret Baier.” Chris Stirewalt is the politics editor for Fox News. Brianna McClelland contributed to this report. Want FOX News Halftime Report in your inbox every day? Sign up here.",
      "date": "April 7, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Donald Trump Jr. calls out Schiff after reports say that blocked phone calls weren’t to father",
      "url": "https://www.foxnews.com/politics/don-jr-calls-out-schiff-following-reports-that-mysterious-blocked-phone-calls-werent-to-trump",
      "subtitle": "Donald Trump Jr. calls out Schiff after reports say that blocked phone calls weren’t to father",
      "author": "Stephen Sorace",
      "content": " Donald Trump Jr. late Thursday laid into House Intelligence Committee Chairman Rep. Adam Schiff, D-Calif., after reports appeared to vindicate the younger Trump of Democratic suspicions that he made phone calls to President Trump around the time of the Trump Tower meeting with Russians in June 2016. Senate investigators obtained phone records which appeared to show that Trump Jr. had actually spoken to two longtime Trump family friends – Brian France, the chief executive of Nascar, and the investor Howard Lorber, the New York Times reported, citing two people briefed on the matter. TRUMP AND THE RUSSIA INVESTIGATION: WHAT TO KNOW Trump Jr. responded to the reports on Twitter, knocking Schiff. “Has anyone heard from Adam Schiff?” Trump Jr. tweeted. “I imagine he’s busy leaking other confidential info from the House Intelligence Committee to change the subject?!?” Democrats have long suspected the calls were between Trump Jr. and his then-candidate father regarding a meeting with Russians offering dirt on Hillary Clinton during the 2016 campaign. Schiff appeared on MSNBC Thursday night and said that Democrats were unable to confirm the reporting \"because the Republicans wouldn't let us get the phone records.\" SCHIFF PREVIEWS NEW LINE OF ATTACK AGAINST TRUMP: DEUTSCHE BANK 'LAUNDERED RUSSIAN MONEY' Trump Jr. said in a statement to the Times that, “After a year of hearing about this one ad nauseam, yet another left-wing narrative officially bites the dust.” Sources told the paper that the report was seen by the White House as a victory. The findings marked an important development for Trump allies who've seen a challenging week that culminated with the arrest of longtime ally Roger Stone. President Trump responded to the reports late Thursday, appearing to call out Democrats and the media. “Just out: The big deal, very mysterious Don Jr telephone calls, after the innocent Trump Tower meeting, that the media & Dems said were made to his father (me), were just conclusively found NOT to be made to me,” Trump wrote. “They were made to friends & business associates of Don. Really sad!” He followed up later Thursday with a second tweet, saying “This witch hunt must end!” Trump Jr. has maintained that Natalia Veselnitskaya, the Russian lawyer he met with at Trump Tower, did not have any information to share and instead wanted to discuss the Magnitsky Act and other sanctions. CLICK HERE TO GET THE FOX NEWS APP The Trump Tower meeting has been under intense scrutiny from investigators seeking whether Trump colluded with Russia in the 2016 presidential election. Investigators are also looking at the financial ties between some Trump associates and the Kremlin. A special counsel, led by Robert Mueller, was appointed to investigate potential wrongdoing more than one year ago, and the team has already brought multiple charges against people associated with the presidential campaign. Fox News' Kaitlyn Schallhorn contributed to this report.",
      "date": "January 31",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "House subpoenas Lewandowski, ex-Trump aide in Trump probe",
      "url": "https://www.foxnews.com/politics/house-subpoenas-lewandowski-ex-trump-aide-in-trump-probe",
      "subtitle": "House subpoenas Lewandowski, ex-Trump aide in Trump probe",
      "author": "",
      "content": "The House Judiciary Committee is subpoenaing former Trump campaign manager Corey Lewandowski and an ex-White House aide as part of its investigation into President Donald Trump's conduct in office. The committee chairman, Democratic Rep. Jerrold Nadler of New York, says he committee wants to hear publicly from Lewandowski and Rick Dearborn on Sept. 17 \"as part of its efforts to hold the president accountable.\" TRUMP BOOSTS POSSIBLE LEWANDOWSKI SENATE BID AHEAD OF NEW HAMPSHIRE RALLY Lewandowski and Dearborn were both \"prominently featured\" in former special counsel Robert Mueller's report on Trump's possible obstruction of justice. The report says Lewandowski and Dearborn were aware of Trump's efforts to have Mueller fired. The Trump administration has been blocking former aides from testifying before Congress, setting off a legal battle that is expected to deepen in the fall.",
      "date": "August 15",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Media use John McCain's death to denigrate Donald Trump",
      "url": "https://www.foxnews.com/politics/media-use-john-mccains-death-to-denigrate-donald-trump",
      "subtitle": "Media use John McCain's death to denigrate Donald Trump",
      "author": "Howard Kurtz",
      "content": " No matter when John McCain left this earth, he would have been praised to the skies by the journalists who admired him enormously, even though they liked him far better when he was taking on his own party. But because he died in the Trump era, there is in many of the media tributes an implicit or explicit contrast being drawn with the president who most of these same journalists decidedly do not admire. And President Trump has fueled that story line by balking at saying anything positive about the 81-year-old senator after his death on Saturday—even, according to The Washington Post, nixing a plan by John Kelly, Sarah Huckabee Sanders and other staffers to have the White House put out a statement praising McCain as a hero. And in final words read by his former campaign chief Rick Davis, McCain appeared to take a subtle shot by saying we shouldn't confuse patriotism with \"tribal rivalries\" and \"weaken it when we hide behind walls, rather than tear them down.\" Trump, after a fierce backlash, again lowered the White House flag to half-staff yesterday with a statement that \"despite our differences on policy and politics, I respect Senator John McCain's service to our country.\" I'll leave it to readers and viewers to decide which of these two tough-talking adversaries they prefer. But there is simply no question that in giving the onetime Vietnam POW a hero's sendoff, many journalists and commentators are delivering an implicit rebuke of Trump. It's a case study in the disparity between the way the media treat politicians they like, personally and ideologically, and those they dislike. McCain, who once jokingly called the press \"my base,\" provided enormous access and was the most frequent Sunday show guest ever. Trump says 80 percent of the media is fake news and frequently attacks journalists and their outlets, though he does provide more access than is commonly realized because he doesn't hold formal press conferences. None of that should matter when it comes to coverage, but it does. Post columnist David Ignatius, while acknowledging the late senator’s flaws, begins a piece this way: \"John McCain's death offers a moment to think about the insurgency in the GOP that vexed him during his final decade as a politician, and that produced in Donald Trump a man he seemed to loathe, but couldn't figure out how to stop.\" Ignatius, a \"Morning Joe\" fixture, goes on to say he believes McCain was among those who could never imagine that enough Americans \"would actually vote for someone of such low moral character. McCain's refusal to temporize about Trump, as other Republicans have, was one of his finest moments.\" So it becomes a litmus test: If, like McCain, you are a person of moral character, then you must stand up to Trump. New York Times columnist David Leonhardt warily embraces \"McCainism,\" but first feels obliged to tell readers about the conservative lawmaker’s bad side: \"I'm well aware that McCain could be maddeningly inconsistent and flawed. He equivocated about the Confederate flag in 2000. He too often acquiesced to Mitch McConnell's torching of Senate norms. For goodness sake, McCain decided Sarah Palin should be vice president. As he himself admitted, he should have done much more to fight Republican extremism.\" And yet, the piece says, \"the sum total of his career still represents a meaningful alternative to Trump, McConnell and the rest of today's Republican leadership.\" And so, like so much else in today's society, everyone must be judged by where he or she stands on Trump or his policies. The acrimony between the two men makes that an easier story line, but it's not the only story line. John McCain was shot down over Hanoi in 1967. He was first elected to Congress in 1982. He had an entire career, an entire life, before Trump took office last year. To judge this wounded warrior through the lens of Trumpism is unfair, and suggests to me that too many in the media feel compelled to make everything about this president.",
      "date": "August 28, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Donald Trump Jr. rips Instagram 'gods' for deleting pic of him with wounded vet at NRA event",
      "url": "https://www.foxnews.com/politics/donald-trump-jr-instagram-gods-deleting-wounded-vet-nra",
      "subtitle": "Donald Trump Jr. rips Instagram 'gods' for deleting pic of him with wounded vet at NRA event",
      "author": "Danielle Wallace",
      "content": " Donald Trump Jr. accused the “social media gods” at Instagram of bias and censorship Tuesday after a photo of him smiling alongside a wounded U.S. Army veteran was reportedly deleted from the platform. The president’s eldest son posed with retired Army Sgt. Omar \"Crispy\" Avila at an NRA convention in Indianapolis last week. The veteran from Texas claimed that Instagram took down the photo from his account. TRUMP JR. CALLS MAINSTREAM MEDIA 'A BLIGHT ON OUR REPUBLIC' “I honestly don’t know why this picture was taken down by Instagram,” Avila wrote Monday on a repost of the image. “Not sure what guidelines it violates But here we go again… Thank you @donaldjtrumpjr for always taking the time out your busy schedule to say hello to chat.” WARNING: GRAPHIC LANGUAGE Trump Jr. posted the photo to his official Instagram account on Tuesday with some harsh words for the Facebook-owned app. “INSTAGRAM IS AT IT AGAIN WITH THEIR BIAS DELETING POSTS,” Trump Jr. wrote Tuesday. “There was nothing harsh or political in there and as usual it magically somehow ‘violated @Instagram standards,’ presumably because I’m in it.” “If @instagram can censor this great American hero for simply posting a picture with me, who won’t they censor? The bias has to stop. It’s gone too far,” Trump Jr. added on Twitter. However, an Instagram spokesperson told Fox News that the post was reviewed, but was not deleted by the company after it found the post did not violate their standards. The spokesperson said that there are a number of reasons a post may no longer be available, including if the account holder deletes either the account or the post. CLICK HERE FOR THE FOX NEWS APP Trump Jr. concluded his Instagram post by praising the “severely wounded” Avila for his positive use of Instagram to spread messages of support for other wounded veterans. “His adventures often documented right here are amazing,” he wrote. “I’ve never once seen anything but an incredible attitude towards life despite the obvious.” Fox News' Chris Ciaccia contributed to this report.",
      "date": "May 1",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Donald Trump calls on freshman Democrat Ilhan Omar to 'resign from Congress' over Israel comments",
      "url": "https://www.foxnews.com/politics/donald-trump-calls-on-freshman-democrat-ilhan-omar-to-resign-from-congress-over-israel-comments",
      "subtitle": "Donald Trump calls on freshman Democrat Ilhan Omar to 'resign from Congress' over Israel comments",
      "author": "Liam Quinn",
      "content": " President Donald Trump has called on freshman Democratic Rep. Ilhan Omar to resign over her controversial Israel comments. “Anti-Semitism has no place in the United States Congress,” Trump told reporters during a Cabinet meeting. “I think she should either resign from Congress or she should certainly resign from the foreign affairs committee.” The call for Omar’s resignation came after Trump said Monday the Minnesota Democrat “should be ashamed of herself”. ILHAN OMAR'S MOST CONTROVERSIAL MOMENTS, FROM AIPAC TWEET TO 'NOT 1 DOLLAR FOR DHS' CALL Omar apologized Monday for comments in which she implied that a prominent pro-Israel lobby compensated lawmakers for their support of the Jewish state, but insisted on what she called \"the problematic role of lobbyists in our politics.\" She drew condemnation from members of both parties after she tweeted Sunday evening that AIPAC has been paying members of Congress to support Israel. On Monday, House Speaker Nancy Pelosi, D-Calif., called on Omar to apologize, saying that \"her use of anti-Semitic tropes and prejudicial accusations about Israel's supporters is deeply offensive.\" REPUBLICAN REP. LEE ZELDIN DISMISSES ILHAN OMAR'S 'SORRY NOT SORRY' APOLOGY, BLASTS 'ANTI-ISRAEL' HATE Rep. Eliot Engel, D-N.Y., the chairman of the House Foreign Affairs Committee, said it was \"shocking to hear a Member of Congress invoke the anti-Semitic trope of 'Jewish money.'\" Judiciary Committee Chairman Jerrold Nadler, D-N.Y., called the comments \"deeply disappointing and disturbing.\" CLICK HERE FOR THE FOX NEWS APP However, the apology is not enough for some lawmakers, with Lee Zeldin, a Jewish Republican from New York, describing it as a ‘sorry not sorry’ apology.",
      "date": "February 12",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Donald Trump called Andrew McCabe's wife a 'loser', ex-FBI official claims in new book",
      "url": "https://www.foxnews.com/politics/donald-trump-calls-andrew-mccabes-wife-a-loser-ex-fbi-official-claims-in-new-book",
      "subtitle": "Donald Trump called Andrew McCabe's wife a 'loser', ex-FBI official claims in new book",
      "author": "Liam Quinn",
      "content": " President Trump mocked Andrew McCabe’s wife as a “loser” during a conversation between the two, the ex-FBI deputy director claims in a new book. McCabe detailed the alleged discussion, which was included in an excerpt published by The Atlantic, saying it took place shortly after the firing of FBI Director James Comey. The subject of McCabe's wife Jill, a physician, came up when Trump asked about her failed 2015 bid for a Virginia state Senate seat, for which she received several hundred thousand dollars in campaign donations from a PAC linked to the Clintons. “He said, How is your wife? I said, 'She’s fine.' He said, 'When she lost her election, that must have been very tough to lose. How did she handle losing? Is it tough to lose?'\" McCABE DETAILS CENTRAL ROLE IN RUSSIA PROBES; DOJ MEETINGS ON WHETHER TO OUST PRESIDENT “I replied, I guess it’s tough to lose anything. But she’s rededicated herself to her career and her job and taking care of kids in the emergency room. That’s what she does. “He replied in a tone that sounded like a sneer. He said, ‘Yeah, that must’ve been really tough. To lose. To be a loser.’” McCabe went on to say he wrote a memo about the conversation “that very day,” so that he had a “contemporaneous record of conversations with a person who cannot be trusted.” JILL McCABE, WIFE OF FIRED FBI OFFICIAL ANDREW McCABE, BREAKS SILENCE ON CAMPAIGN MONEY Jill McCabe, a pediatric emergency physician, ran in 2015 for Virginia’s state senate. She was defeated by Republican incumbent Dick Black by four points. In 2018, she denied accusations contributions to her campaign from a top Hillary Clinton ally's political organization played any role in the FBI investigation into Clinton's personal email server. In the op-ed for the Washington Post, Jill McCbae wrote claims the contributions from Virginia Gov. Terry McAuliffe's political action committee had any influence on the Clinton email probe \"could not be further from the truth. In fact, it makes no sense.\"",
      "date": "February 14",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "The Clickbait Era, Donald Trump and plunging trust in media",
      "url": "https://www.foxnews.com/politics/the-clickbait-era-donald-trump-and-plunging-trust-in-media",
      "subtitle": "The Clickbait Era, Donald Trump and plunging trust in media",
      "author": "Howard Kurtz",
      "content": " The Huffington Post headline was designed to get its anti-Trump readers to click. \"Kellyanne Conway: Trump’s Anti-Media Attacks ‘Are Not Healthy.'\" What? Was she saying this publicly? Was even the president's counselor off the reservation? But it turned out to be a blatant distortion. Here's what Conway actually said, when asked by Christiane Amanpour on her new PBS show whether \"the president might take a stance of his own to pull back from this,\" meaning attacks on the media. \"I do agree that it's not healthy for the body politic on either side,\" Kellyanne said. She said that she and others \"have tried, the president has tried, to turn down the temperature, to give more access.\" So Conway's it's-unfortunate-both-sides-do-it-but-we've-tried-to-fix-it sentiment got twisted into her criticizing her boss. And what the short piece didn't mention was that she also said this: \"We see things every single day on TV and in print that I promise you, I swear to God, are patently false.\" This is why people don't trust the press. And yes, the obvious rejoinder to that the White House sometimes struggles with the truth. On Monday, economic adviser Kevin Hassett said the president was wrong when he tweeted that \"the GDP Rate (4.2%) is higher than the Unemployment Rate (3.9%) for the first time in over 100 years!\" It's actually 10 years. (But those figures do show a booming economy.) Still, pointing to presidential misstatements and distortions doesn't let the press off the hook when it comes to accuracy and fairness. A new study out yesterday from the Knight Foundation and Gallup shows that most Americans are losing faith in the media, and their reasons largely center on matters of accuracy or bias. A stunning 69 percent of adults say they have lost trust in the media over the past decade, a figure that rises to 94 percent for Republicans. Among Democrats, 42 percent have lost trust, and the number is 75 percent for independents. Those of us in the news business have company. Social media, run by the tech giants, were once seen as a liberating and democratic force. Now there are deep suspicions of Big Tech, and its increasingly maligned leaders have lost their heroic glow. Here, too, self-inflicted wounds play a major role. These outfits were slow to police their sites, combat Russian propaganda, address the scourge of bullying and fabrication and—in an echo of the MSM’s plight—are regularly assailed for discriminating against the right. As NYT columnist Nathaniel Popper puts it: \"Admiration of the tech world has, in the wake of a growing list of scandals, quickly soured into an intense suspicion that manages to cross partisan lines, similar to what Wall Street faced after 2008.\" Now Facebook, Twitter, Google and the like resemble a machine that its makers can no longer control, even if they are willing to spend the vast sums that would require. All these doubts seem weaponized in the age of Trump, given that much of the country distrusts the president and a sizable chunk of the country admires the president while distrusting his adversaries. This constant warfare, which Kellyanne alluded to, leads to sinking confidence in both sides, as the White House and the press routinely trade charges of lying and bias. It’s as though airlines were constantly running ads accusing the others of being unsafe. \n Things have reached the point where not only do many people believe the New York Times shouldn't have published the op-ed by the unnamed senior official, but some accuse the paper of outright deception by saying the author actually works there. That is of a piece with Bob Woodward describing a dysfunctional administration and the president accusing the veteran journalist of writing fiction and making up sources. Maybe, in another time and place, the media and other institutions can regain some of the trust they have lost. Some people in the Knight study, at least, say they're open to that. But it doesn't seem to be on the horizon any time soon.",
      "date": "September 12, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Donald Trump attacks Spike Lee over 'racist hit' during Oscars acceptance speech",
      "url": "https://www.foxnews.com/politics/donald-trump-attacks-spike-lee-over-racist-hit-during-oscars-acceptance-speech",
      "subtitle": "Donald Trump attacks Spike Lee over 'racist hit' during Oscars acceptance speech",
      "author": "Liam Quinn",
      "content": " President Trump on Monday blasted Spike Lee after the legendary director took a shot at him during his Oscars acceptance speech. “Be nice if Spike Lee could read his notes, or better yet not have to use notes at all, when doing his racist hit on your President, who has done more for African Americans (Criminal Justice Reform, Lowest Unemployment numbers in History, Tax Cuts,etc.) than almost any other Pres!” Trump tweeted. AND THE OSCAR GOES TO: SEE THE FULL LIST OF 2019'S WINNERS Lee, after winning Best-Adapted Screenplay for \"BlacKkKlansman,” on Sunday night urged viewers to make the “moral choice” in the 2020 presidential race, as Trump seeks re-election. “When we regain our humanity it will be a powerful moment,” the “Do The Right Thing” director read from his notes. SPIKE LEE 'FURIOUS' WHEN 'GREEN BOOK' WON BEST PICTURE OSCAR, APPEARS TO TRY TO STORM OUT OF THEATER: REPORT “The 2020 election is around the corner – let’s all mobilize and be on the right side of history. Make the moral choice between love versus hate,” Lee said. The spat with the president comes after a tumultuous 24 hours for Lee, who appeared to try to storm out of the Dolby Theatre after it was announced that “Green Book\" won the award for Best Picture. Lee, a lifelong New York Knicks basketball fan, compared the \"Green Book\" win to a referee making \"the wrong call.\" In a stunning move shortly after \"Green Book\" was announced the winner, the director walked toward the back of the auditorium, according to a reporter for Deadline. RAMI MALEK, BEST ACTOR WINNER, TREATED BY PARAMEDICS AFTER FALL AT OSCARS He eventually got back to his seat and got into what appeared to be an intense conversation with the writer Jordan Peele. The report said that Lee turned his back to the stage during the speech. “I’m snakebitten,\" Lee said while backstage. \"I mean, every time somebody is driving somebody, I lose. But, they changed the seating arrangement. But, in ’89 I didn’t get nominated, so this one we did.\" CLICK TO GET THE FOX NEWS APP Lee's \"Do the Right Thing\" lost to \"Driving Miss Daisy\" in 1990. He told New York Magazine years later that \"when Driving Miss Motherf—-ing Daisy won Best Picture, that hurt. [But] no one’s talking about \"Driving Miss Daisy\" now.\" Fox News' Louis Casiano, Julius Young and the Associated Press contributed to this report.",
      "date": "February 25",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Donald Trump Jr. says family has no fears over Mueller investigation report",
      "url": "https://www.foxnews.com/politics/donald-trump-jr-says-family-have-no-fears-over-mueller-investigation-report",
      "subtitle": "Donald Trump Jr. says family has no fears over Mueller investigation report",
      "author": "Victor Garcia",
      "content": " Donald Trump Jr. dismissed any notion that he, the President or his family have any fears relating to the Mueller investigation or a probe by the Southern District of New York. “‘This is going to be it, we finally got him.’ I’ve been hearing this for two years,’” Trump Jr. told “Fox & Friends\" on Monday morning. “This is as political as it gets. Their dream in life is to try to find something to get Trump. I mean, it’s that old Stalinist tactic, you know? ‘Show me the men, and I’ll show you the crime.' SCHIFF: DEMS 'ABSOLUTELY' WILL TAKE DOJ TO COURT OVER MUELLER REPORT IF NECESSARY “So, you know, there’s no doubt that they’ll try. But again, I know how we functioned as a company. I know how we function as individuals, and that’s why despite all this – for two years – we don’t appear all that worried, because we know there’s nothing there.” Sunday former New Jersey Governor Chris Christie was on ABC’s “This Week” and highlighted the Southern District of New York’s investigation into the Trump Organization and the Trump Inaugural Committee, saying that it poses a bigger threat to Trump than the Mueller report does. MUELLER PROBE 'NEAR THE END GAME' AMID SHAKEUP AT DOJ, SOURCES SAY “The Southern District of New York investigation is monumentally more perilous to the president than Bob Mueller ever was or ever will be. They have two tour guides and no restriction on where they can go,” Christie told host George Stephanopoulos. “What they did was – they put incredible pressure on regular guys that couldn’t afford millions of dollars in legal fees, and got them to slip up and say something incorrectly,” Trump Jr. said of the Southern District of New York’s investigation. The Mueller report is expected this week according to reports. MUELLER SENTENCING MEMO SAYS MANAFORT 'REPEATEDLY AND BRAZENLY' VIOLATED LAW Trump Jr. also commented on President Trump’s former attorney testifying before Congress this week while his father is having a summit with North Korean leader Kim Jong-un in Vietnam. “You got a President trying to deal with a major world issue, and to try to distract – or whatever it is – by bringing in a convicted felon and known liar. I mean, it’s pretty pathetic, but it really shows you how much the Democrats hate Trump. They hate Trump more than they love America, by a long shot, and it’s pretty disgusting that they would do that,” Trump Jr. said. Cohen has closed-door hearings set for Tuesday and Thursday with Senate and House Intelligence Committees. Wednesday Cohen has a public Congressional hearing with the House Oversight Committee the same day President Trump will meet with Jon-un in Hanoi, Vietnam.",
      "date": "February 25",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Donald Trump Jr. lashes out at media, 'Big Tech' for silencing conservative speech",
      "url": "https://www.foxnews.com/politics/donald-trump-jr-lashes-out-at-media-big-tech-silencing-conservative-speech",
      "subtitle": "Donald Trump Jr. lashes out at media, 'Big Tech' for silencing conservative speech",
      "author": "Victor Garcia",
      "content": " Donald Trump Jr. lashed out at the left, the media and social media platforms for positioning themselves against conservatives and censoring free speech, in a “Tucker Carlson Tonight” interview Tuesday. “Why is the press standing by as the First Amendment erodes?” Tucker Carlson asked Trump Jr. “The majority of the press are now left-wing activists,” Trump Jr. told Carlson. “They are not on the side that is being stymied, they’re not on the side that is being oppressed.” Trump Jr. began the interview by talking about his troubles with Instagram and how many of his followers informed him that social media platforms were censoring their content because of their conservative nature. “I can do this because I have a big platform. I have a big soapbox, I can get it out there, but some of the little guys, they can’t,” Trump Jr. said. “They don’t have the ability. They end up just taking it.” COVINGTON CATHOLIC STUDENT'S LAWSUIT A 'SIGNIFICANT CASE' OR NOT? Trump Jr. went after “Big Tech” in an op-ed last Friday claiming some companies have been acting in a partisan manner to try preventing President Trump’s reelection. “Unfortunately, Silicon Valley is showing us that tech companies, too, can manipulate information for partisan ends. Their censorship is increasing at an alarming rate, just in time for them to try to spoil my father’s re-election bid, but we won’t let them get away with it.,” Trump Jr. wrote. He called the alleged social-media manipulation a “one-way systematic attack on free speech” while talking to Carlson. CLICK HERE TO GET THE FOX NEWS APP “To me, it reads like it’s a trial run for 2020,” Trump Jr. said. “I’m not saying every account is suppressed, but you do it enough. You take off ‘x’ percent of the top. You cut the message in half.” “I think we have to start pushing back and I think we have to start pushing back hard,” Trump Jr. said. “If we don’t, we’ll never get the chance again.”",
      "date": "February 26",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "'Fox & Friends' calls out Biden's 2007 stance against sanctuary cities: 'Sure sounds a lot like Donald Trump'",
      "url": "https://www.foxnews.com/politics/joe-biden-2007-stance-against-sanctuary-cities-sounds-like-trump",
      "subtitle": "'Fox & Friends' calls out Biden's 2007 stance against sanctuary cities: 'Sure sounds a lot like Donald Trump'",
      "author": "David Montanaro",
      "content": " In a previous bid for the presidency, then-Sen. Joe Biden's stance on illegal immigration sounded a lot like President Trump's current views, the hosts of \"Fox & Friends\" noted Tuesday. Steve Doocy flagged a clip from a September 2007 presidential debate, when then-candidate Biden was asked if he would allow cities to ignore federal law. Biden answered that so-called sanctuary cities ignore federal immigration law because they lack the funding to carry out enforcement. \"Part of the problem is you have to have a federal government that can enforce laws,\" he said, calling out the George W. Bush administration for being \"fundamentally derelict\" in providing the necessary funding. LIMBAUGH SAYS DEMOCRATIC PRESIDENTIAL PRIMARY MAY BE OVER WITH BIDEN LEADING THE WAY GILLIBRAND PINS BIDEN'S LARGE POLL LEAD ON NAME ID The Delaware Democrat was then asked, \"yes or no, would you allow those cities to ignore the federal law?\" \"No,\" Biden responded. The \"Fox & Friends\" hosts noted that \"politics\" and the current views of the crowded Democratic Party field have forced Biden to alter his rhetoric. In a 2006 video that resurfaced last week, Biden is seen advocating for a southern border wall and punishment for employers who hired illegal immigrants. Biden told a South Carolina rotary club that he voted for a border fence despite other Democrats opposing the measure. CLICK HERE TO GET THE FOX NEWS APP \"Folks, I voted for a fence; I voted, and unlike most Democrats -- and some of you won't like it -- I voted for 700 miles of fence,\" he said, in the video unearthed by CNN. \"But, let me tell you, we can build a fence 40 stories high -- unless you change the dynamic in Mexico and -- and you will not like this, and -- punish American employers who knowingly violate the law when, in fact, they hire illegals. Unless you do those two things, all the rest is window dressing,\" he added. BORDER PATROL OFFICIAL TO CONGRESS: 'WE CAN'T ARREST OUR WAY OUT OF THIS PROBLEM' His spokesman reportedly indicated that his position hadn't changed but that a border wall wouldn't \"address the real issues.\" \"As then-Senator Biden said at the time, 'we can build a fence 40 stories high,' but it will not address the real issues here. Vice President Biden believes we have to stop trying to scare people and instead have an immigration discussion based on facts,\" spokesman Andrew Bates said. Fox News' Sam Dorman contributed to this report.",
      "date": "May 21",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Donald Trump Jr. blasts Pelosi's 'cover-up' claim: Democrats don't want my father to have 'any wins'",
      "url": "https://www.foxnews.com/politics/donald-trump-jr-nancy-pelosi-cover-up",
      "subtitle": "Donald Trump Jr. blasts Pelosi's 'cover-up' claim: Democrats don't want my father to have 'any wins'",
      "author": "David Montanaro",
      "content": " After House Speaker Nancy Pelosi accused his father of a \"cover-up,\" Donald Trump Jr. said on \"Fox & Friends\" Thursday that Democrats are not interested in working with President Trump on infrastructure or other issues. \"They don't want him to rack up any wins,\" said the president's oldest son on the deck of the USS New York, adding that, at the same time, Democratic presidential candidates are running on the idea of government \"failing\" Americans. His comments came one day after President Trump demanded Democrats end their \"phony investigations\" before he'll negotiate with them on issues like infrastructure, as he delivered a fiery statement from the Rose Garden after cutting a meeting short with Pelosi and Senate Democratic Leader Chuck Schumer. TRUMP DEMANDS END TO 'PHONY INVESTIGATIONS' IN FIERY ROSE GARDEN STATEMENT, AFTER MEETING WITH DEMS CUT SHORT The president had met for mere minutes with the two Democratic leaders in a session scheduled to discuss a possible bipartisan infrastructure package. But moments before that sit-down, Pelosi accused Trump of having \"engaged in a cover-up\" regarding the Russia probe. BIDEN CAMPAIGN, UNFAZED BY N. KOREA INSULTS, SAYS IT'S 'NO SURPRISE' ROGUE NATION PREFERS TRUMP Trump Jr. asked how his father can deal with Democrats who accused him of collusion with Russia, obstruction of justice and now a cover-up. \"You can't deal with someone like that. You can't say we're gonna deal with infrastructure, but meanwhile we're impeaching you while that is going on,\" he said. Trump Jr. agreed last week to appear behind closed doors to give testimony to the Senate Intelligence Committee concerning Russian interference in the 2016 election. He said he has already given 30 hours of testimony \"about nonsense and been fully cleared.\" CLICK HERE TO GET THE FOX NEWS APP He blasted committee Chairman Richard Burr, R-N.C., for being \"too weak to stand up to the Democrats\" and going along with their calls for him to testify again. Trump Jr. said the committee has become more partisan after two Senate Democrats on the committee, Kamala Harris, D-Calif., and Michael Bennet, D-Colo., launched their 2020 presidential campaigns.",
      "date": "May 23",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Paul Manafort committed crimes, but is being punished for association to Donald Trump: Brit Hume",
      "url": "https://www.foxnews.com/politics/brit-hume-manafort-committed-crimes-didnt-collude-with-russia",
      "subtitle": "Paul Manafort committed crimes, but is being punished for association to Donald Trump: Brit Hume",
      "author": "Victor Garcia",
      "content": " Paul Manafort, while guilty, is also paying for his association to President Trump, Fox News' Senior Political Analyst Brit Hume said Wednesday. “It’s also true that Manafort undoubtedly committed these crimes after all he’s acknowledged doing so,” Hume said on “America’s Newsroom,\" just moments before Manafort was sentenced to a total of 81 months in prison in connection with his guilty plea related to foreign lobbying and witness tampering. The term he will serve includes the 47-month sentence handed down in a separate case in Virginia last week. “But there’s one thing that’s also true. None of this, none of this whole prosecution of him and the alleged crimes of obstruction of justice that he committed during the investigation would have happened had he not served as Donald Trump’s campaign chairman.” PAUL MANAFORT SENTENCED ON FOREIGN LOBBYING AND WITNESS TAMPERING CHARGES JOSEPH DIGENOVA: NO MATTER WHAT MUELLER REPORT FINDS, DEMS WILL STILL WANT TO OVERTURN 2016 ELECTION Hume said the investigation into Manafort was dormant until the political advisor became associated with Trump. “He is where he is today because he made the mistake, as it turned out for him, of serving as Trump’s campaign advisor,” Hume said. “Because if you don’t have that you don’t have this investigation.” “The main effort here as the judge in Virginia pointed out was to squeeze him to try and turn him against Donald Trump and have him give up the goods,” Hume said. “We don’t know... if he didn’t give up the goods because he didn’t want to or because he didn’t have any goods. ANDREW MCCARTHY: MANAFORT WAS NOT A RUSSIAN AGENT The senior political analyst made clear that he had no sympathy for Manafort but said it is unlikely that Manafort or Trump colluded with Russia. “I hold no grief for Paul Manafort, I’ve always looked at him and his dead eyes with a view that he might not be the right person if you were looking to have a political consultant. The things he did are obviously criminal and he’s admitted them,” Hume said. He added: “I think in the end it may have turned out he didn’t do anything with regards to collusion with Russia and perhaps Mr. Trump didn’t either.”",
      "date": "March 13",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Democrat 2020 candidates 'scare' Donald Trump, have bold, progressive ideas: DNC official",
      "url": "https://www.foxnews.com/politics/dnc-communications-director-trump-scared-of-our-candidates",
      "subtitle": "Democrat 2020 candidates 'scare' Donald Trump, have bold, progressive ideas: DNC official",
      "author": "Victor Garcia",
      "content": " The Democratic field of candidates have President Donald Trump running scared -- or at least that's what the director of communications for the Democratic National Committee believes. “I think Donald Trump has a lot of thoughts about the Democratic Party because frankly, he’s scared about who he is going to potentially face,” Xochitl Hinojosa told “America’s Newsroom” Friday. Hinojosa defended the ideas expressed by the Democratic Party’s candidates and accused the president of trying to instill “fear in the communities.” “It’s okay to come forward with bold progressive ideas and have the voters decide who they want as the Democratic nominee,” Hinojosa told co-host Sandra Smith. “So, we’re going to see this process play out but we’re out there talking about the issues while Donald Trump is out there trying to instill fear in the communities.” SEN. GILLIBRAND PROPOSES GIVING SOCIAL SECURITY TO ILLEGAL IMMIGRANTS She added: “There will be other issues we bring up during the primary and it’ll be up to other voters to decide whether or not they like those ideas.” The DNC communications director said Democrats were focused on the issues of healthcare and the economy. Hinojosa also downplayed presidential candidate Sen. Kirsten Gillibrand’s, D-N.Y., comments this week calling for the expansion of Social Security payments to potentially include people living in the country illegally. “If you are in this country now, you must have the right to pay into Social Security, to pay your taxes, to pay into your local school system, and to have a pathway to citizenship. That must happen,” Gillibrand said. FAR-LEFT MOVEON.ORG ASKS 2020 PRESIDENTIAL CANDIDATES TO SKIP PRO-ISRAEL AIPAC CONFERENCE “We know that our immigration system is broken, I think Republicans can agree with us on that. But they believe our solution is a border wall and we believe it’s comprehensive immigration reform,” Hinojosa said. Hinojosa also emphasized Democratic support of Israel even as many Democratic candidates declined invitations to attend the American Israel Public Affairs Committee's annual Policy (AIPAC) conference next week. CLICK HERE TO GET THE FOX NEWS APP “I don’t speak for each of those candidates but I will say as a whole, as the Democratic Party we will never waver in our support for Israel,” Hinojosa said.",
      "date": "March 22",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Donald Trump Jr. celebrates Mueller report release and findings: 'TOLD YA!!!'",
      "url": "https://www.foxnews.com/politics/donald-trump-jr-reacts-to-mueller-report-told-ya",
      "subtitle": "Donald Trump Jr. celebrates Mueller report release and findings: 'TOLD YA!!!'",
      "author": "Kathleen Joyce",
      "content": " Donald Trump Jr. echoed his father Thursday after Special Counsel Robert Mueller’s report was released. Attorney General William Barr held a press conference Thursday to discuss the 448-page report before its release. Barr outlined the key findings in the report and said investigators did not find evidence of collusion between the 2016 Trump campaign and Russia. However, he revealed an account of how the president attempted to seize control of the probe into Russian interference in the 2016 election and force out Mueller from leading the inquiry. After Barr’s remarks -- and before the report was released to the public -- Trump tweeted a “Game of Thrones”-inspired image that read, “No Collusion. No Obstruction. For the haters and the radical left Democrats – Game Over.” MUELLER REPORT SHOWS PROBE DID NOT FIND COLLUSION EVIDENCE, REVEALS TRUMP EFFORTS TO SIDELINE KEY PLAYERS Trump Jr. echoed his father’s thoughts in a number of tweets. “It’s so much fun hate-watching CNN right now. I don’t normally take joy in other people’s misery, but after the lies and discord they sowed for the past three years about my family and me I’ll make an exception today,” he wrote. In another tweet, he simply wrote, “TOLD YA!!!” CLICK HERE TO GET THE FOX NEWS APP In the report, Mueller wrote that he believed prosecutors would be unlikely to meet the burden of proof to show that Trump Jr. and other participants in the highly scrutinized June 9 Trump Tower meeting “had general knowledge that their conduct was unlawful.” Mueller's probe also did not find evidence they knew that foreign contributions to campaigns were illegal or other particulars of federal law. “The investigation has not developed evidence that the participants in the meeting were familiar with the foreign-contribution ban or the application of federal law to the relevant factual context,” the report read. “The government does not have strong evidence of surreptitious behavior or efforts at concealment at the time of the June 9 meeting.\" Trump Jr. helped set up the controversial meeting involving himself, Jared Kushner, former campaign chairman Paul Manafort and Russian attorney Natalia Veselnitskaya, among others. Fox News’ Brooke Singman and the Associated Press contributed to this report.",
      "date": "April 18",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Joe Biden makes unfortunate ‘Freudian slip’ as he targets ‘Donald Hump’",
      "url": "https://www.foxnews.com/politics/biden-freudian-slip-donald-hump",
      "subtitle": "Joe Biden makes unfortunate ‘Freudian slip’ as he targets ‘Donald Hump’",
      "author": "Paul Steinhauser",
      "content": " MANCHESTER, NH – It’s a line former vice president Joe Biden uses repeatedly on the campaign trail as he jabs at the man he hopes to replace in the White House, President Trump. But as the front-runner in the Democratic nomination race addressed thousands of party activists at the New Hampshire Democratic Party’s annual convention, he had what he termed a ‘Freudian slip’ BIDEN CALLS ENVIRONMENTAL ACTIVIST 'KIDDO' AS HE DEFENDS FUNDRAISER WITH FOSSIL FUEL COMPANY CO-FOUNDER “We cannot and I will not let this man be re-elected president of the United States,” Biden said. of Trump. “Limited to four years, I believe history will look at the presidency as an aberrate moment in time.” “If Donald Hump, Donald Trump, Freudian slip,” he emphasized, to cheers. Biden corrected himself and delivered the line again, saying “if Donald Trump is re-elected, he will forever and fundamentally alter the character of this nation.” The former vice president has made a number of high profile gaffes the past couple of months which have gone viral and grabbed headlines. One came during his previous trip to the first-in-the-nation primary state, when Biden mistakenly said he was in neighboring Vermont. And the previous day, he mixed up numerous facts when telling the story of pinning a medal on a soldier during a trip to Afghanistan. ALEXROD CLAIMS BIDEN 'SERIALLY DISTORTING RECORD Biden’s campaign has dismissed the verbal slip-ups as part of a national press narrative but they appeared to have raised enough concerns that some allies of the former vice president reportedly suggested he scale back the number of events he did on the campaign trail. The former vice president – who’s made electability one of his top selling points as he battles for the Democratic nomination - spent much of his address to the audience in New Hampshire targeting Trump. CLICK HERE FOR THE FOX NEWS APP Repeating a line he uses often on the campaign trail, Biden said Trump “lacks the moral authority to lead…This president has more in common with George Wallace than George Washington.”",
      "date": "September 7",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Democratic 'squad' goes after Donald Trump again in new interview, say he is 'biggest bully' they have encountered",
      "url": "https://www.foxnews.com/politics/democratic-squad-donald-trump-bully",
      "subtitle": "Democratic 'squad' goes after Donald Trump again in new interview, say he is 'biggest bully' they have encountered",
      "author": "Joseph A. Wulfsohn",
      "content": " The four progressive congresswomen referred to as the \"Squad\" blasted President Trump during an interview on Tuesday, calling him the \"biggest bully\" they've ever encountered. Reps. Alexandria Ocasio-Cortez, D-N.Y., Rashida Tlaib, D-Mich., Ilhan Omar, D-Minn., and Ayanna Pressley, D-Mass., sat down with \"CBS This Morning\" host Gayle King and were asked about their first reaction to Trump's controversial tweets attacking them on Sunday. \"I'm dealing with the biggest bully I've ever had to deal with in my lifetime,\" Tlaib said in the preview clip, \"and trying to push back on that and trying to do the job that we have all been sent here to do which is centered around the people at home. This is a distraction.\" \"Do you think that enough Republicans have spoken up against the president?\" King asked. 'THE SQUAD'  AMASS  MILLIONS AMID FEUDS WITH PARTY, TRUMP \"Absolutely not,\" Ocasio-Cortez responded. \"We just held a vote today and not a single Republican could bring themselves, no matter what their public statement, or public gesture or public discomfort, they could not bring themselves to have the basic human decency to vote against this statement that the president made on the floor. \"What message does that send?\" King followed. \"The normalization of it, the fact that it's against our core values. that they are choosing him over country,\" Tlaib said. The House approved a resolution condemning President Trump's tweets in a  240-187 vote. Four Republican lawmakers joined the Democrats, including Reps Will Hurd, R-Texas, Brian Fitzpatrick, R-Penn., Fred Upton, R-Mich., and Susan Brooks, R-Ind., as well as Rep. Justin Amash, I-Mich.. CLICK HERE TO GET THE FOX NEWS APP The full interview is set to air Wednesday.",
      "date": "July 16",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Sanford, mulling GOP primary bid in 2020, confesses: ‘I don’t think anybody’s going to beat Donald Trump’",
      "url": "https://www.foxnews.com/politics/sanford-mulling-gop-primary-donald-trump",
      "subtitle": "Sanford, mulling GOP primary bid in 2020, confesses: ‘I don’t think anybody’s going to beat Donald Trump’",
      "author": "Paul Steinhauser",
      "content": " Ask Mark Sanford if any Republican can knock off President Trump in the Republican primaries and he’ll give you an honest answer. “I always like to be real, and I don’t think anybody’s going to beat Donald Trump. That’s my personal opinion,” the former South Carolina governor and congressman said in an interview Monday with Fox News. VOCAL TRUMP CRITIC MARK SANFORD MULLS PRIMARY BID AGAINST PRESIDENT But Sanford, who last week announced he was taking 30 days to decide whether to launch a primary challenge against the president, said that if he runs, it’s not about ousting the president. At least not completely. “I think it’s about trying to force a larger national debate and a debate within Republican circles,” he said. That debate, for Sanford, centers on the national debt, which now stands at over $22 trillion. Sanford warned that we’re “walking our way towards the most predictable financial crisis in history of our country if we don’t do something about the government spending issue. It is profound.” And the longtime deficit hawk predicted that “we’re setting ourselves up for a real fall that will hurt our retirement accounts, our savings accounts, our jobs and our way of life.” THE LATEST FROM FOX NEWS ON THE 2020 PRESIDENTIAL CAMPAIGN Sanford’s mission, if he launches a primary bid, is to take the GOP back to fiscal issues, targeting the national debt and spiraling government spending. “The idea of financial sanity, the idea of financial prudence, was a linchpin to the conservative movement and by extension the Republican Party, “ he said. “That has been lost of late.” And he noted “I was just dumbstruck to hear Rush Limbaugh’s comments over the weekend that deficits don’t matter. It is something that we have to get back to.” Asked what his deciding factors will be in launching a primary challenge, Sanford listed viability. “The energy, resources, and the people who come my direction versus not, will tell me a lot as to how viable such a run will be. And by viable, I don’t mean necessarily beating the president, but I mean viable in terms of getting a voice and message out there that I think needs to be heard,” he said. And he argued that “we need to have a conversation as Republicans about what we’re about.” In a party dominated by Trump, such ideas aren’t welcome words, especially in his home state. After Sanford announced he was mulling a primary challenge, South Carolina GOP Chairman Drew McKissick responded “the last time Mark Sanford had an idea this dumb, it killed his Governorship….This makes about as much sense as that trip up the Appalachian Trail.” The ‘Appalachian Trail’ is a reference to Sanford’s original excuse of where he was during a week-long disappearance in June 2009. It was later revealed that Sanford was out of the country, having an affair with an Argentinian woman. The episode ended his marriage and derailed the political career of the popular two-term governor who was considered an early leading contender for the 2012 GOP presidential nomination. But politics is full of second chances and the former governor won back his old congressional seat in a 2013 special election. He won re-election in 2014 and 2016. But Sanford, a vocal Trump critic, was targeted by the president in his 2018 re-election and lost a primary challenge to a pro-Trump candidate. LAST YEAR SANFORD ACKNOWLEDGED HIS POLITICAL CAREER WAS LIKELY OVER Asked if his possible primary challenge against the president is revenge for his 2018 loss, Sanford quickly answered: “Absolutely not.” Sanford noted that he was concerned with the “send her back” chants at a Trump rally in North Carolina last week that were directed at Democratic Rep. Ilhan Omar of Minnesota, whom the president days earlier on Twitter had urged to go back to her native country, fix things and return to \"show us how it's done.\" Democrats and even some Republicans have called the tweets racist. After condemning the chants in the wake of the ensuing criticism, Trump later called the crowd “patriotic” and resumed his attacks on Omar and three other liberal freshman congresswomen known as ‘the squad.’ Sanford said the chant is “a long way from what we all learn about when we go to church Sunday, which is ‘we’re to love God with all our heart, soul and mind, we’re to love our neighbors as ourselves.’” “It’s at odds with what the good book says on that front,” he added. Sanford said it’s likely he’ll visit Iowa and New Hampshire – the states that kick off the presidential primary and caucus calendar – during his 30-day listening tour. And he noted that he’s been in contact with conservative Bill Kristol, a leader of the ‘Never Trump’ movement. If he runs, Sanford would join former Massachusetts Gov. Bill Weld in primary-challenging the president. Sanford praised Weld, saying “I admire his courage. I admire that he was willing to step out on the ice first while nobody else was even thinking about it.” Weld, campaigning in New Hampshire on Monday, told Fox News that Sanford “could be a real factor in the southern states, either in the primary or running as a favorite son in the general election. I think he could certainly deny Mr. Trump enough votes in those states so that Mr. Trump will have a hard time winning those states.” He welcomed a possible Sanford campaign, emphasizing that “the more people who come in, it makes it seem more like a real primary, harder for the president to duck debates.”",
      "date": "July 22",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Donald Trump Jr. stands by original testimony as he returns for Senate committee interview",
      "url": "https://www.foxnews.com/politics/donald-trump-jr-says-nothing-to-correct-as-he-goes-before-senate-committee",
      "subtitle": "Donald Trump Jr. stands by original testimony as he returns for Senate committee interview",
      "author": "Ronn Blitzer",
      "content": "  Donald Trump Jr. stood by his prior testimony as he returned Wednesday to Capitol Hill for an interview behind closed doors with the Senate Intelligence Committee, following a subpoena from the committee's Republican chairman, North Carolina Sen. Richard Burr. The president's son was called to field questions related to the committee's Russia investigation, and possibly clear up some confusion surrounding his original statements. Queries were expected to address issues including Trump Jr.'s knowledge of negotiations for a Trump Tower in Moscow before the 2016 election. During an earlier 2017 interview on Capitol Hill, Trump said he had only been \"peripherally aware\" of the possible deal. But President Trump's former lawyer Michael Cohen, who is currently serving a prison sentence for offenses including lying to Congress, said he spoke to Trump Jr. about the deal multiple times. TRUMP JR. BLASTS OMAR, TLAIB ON TWITTER AS LEADERS OF 'THE HAMAS CAUCUS' When asked Wednesday morning if he was going to correct any of his past testimony, Trump Jr. said there was \"nothing to correct.\" He reiterated this upon completing the interview, saying: \"In reality, there was nothing to change. If there needed to be clarification because [of] Michael Cohen, who let's not forget is serving time right now for lying to these very investigative bodies, I'm happy to do that.\" Trump Jr. went on to say he is happy to be done with the matter. \"I'm glad that this is finally over,\" he said. \"We're able to put some final clarity on that, and I think the committee understands that.\" When asked if he was concerned about the risk of perjury, Trump Jr. said, \"Not at all.\" A source familiar with the testimony told Fox News that the interview lasted less than three hours. All of the questions were asked by staff members. Much of the interview focused on statements about Trump Jr. that had been made by Cohen and former Trump campaign member Rick Gates. Among these were alleged details surrounding the June 9, 2016 Trump Tower meeting that Trump Jr. set up between a Russian attorney and senior Trump campaign members. Cohen claimed that Trump Jr. had told then-candidate Trump about the meeting beforehand. Gates claimed that Trump Jr. mentioned it at a campaign meeting, saying that he would be getting dirt on Hillary Clinton on that same date from a group in Kyrgyzstan. Trump Jr. denied these claims. Fox News also has learned that Trump Jr. was asked about Roger Stone, Wikileaks and Paul Manafort. DONALD TRUMP JR. BASHES MICHAEL COHEN'S MOTIVES DURING HOUSE TESTIMONY Wednesday's closed-door hearing came after Trump Jr. already testified for more than 20 hours and provided thousands of documents to Congress. Last month, President Trump supported his son, questioning the need for additional testimony. \"I don't know why. I have no idea why. But it seems very unfair to me,\" the president said. Some Republicans even said Trump Jr. should not have complied with the subpoena, which is believed to be the first subpoena targeting a member of the president's family. Burr's home state colleague, Sen. Thom Tillis, R-N.C., tweeted, \"It's time to move on & start focusing on issues that matter to Americans.\" Sen. John Cornyn of Texas, a GOP member of the panel, said he understood Trump Jr.'s frustration. Cornyn's Texas colleague, Republican Sen. Ted Cruz, said there was \"no need\" for the subpoena. Fox News' John Roberts and Jason Donner contributed to this report.",
      "date": "June 12",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Sarah Sanders says God 'wanted Donald Trump to become president'",
      "url": "https://www.foxnews.com/politics/sarah-sanders-says-god-wanted-donald-trump-to-be-president",
      "subtitle": "Sarah Sanders says God 'wanted Donald Trump to become president'",
      "author": "Nicole Darrah",
      "content": " White House press secretary Sarah Sanders on Wednesday said that she believes a higher power wanted her boss, Donald Trump, to be elected president. \"I think God calls all of us to fill different roles at different times and I think that He wanted Donald Trump to become president,\" Sanders told the Christian Broadcasting Network (CBN). PRESIDENT TRUMP TWEETS SUPPORT FOR BIBLE LITERACY CLASSES IN PUBLIC SCHOOLS Sanders, who held her first press briefing of 2019 and the first in 41 days on Monday, added, \"That's why he's there and I think he has done a tremendous job in supporting a lot of the things that people of faith really care about.\" Her response came after CBN's David Brody questioned if she was asked if it \"blew [her mind]\" that Trump, \"of all people,\" was the sitting president. The press secretary then chastised Democratic leadership in the House of Representatives for not condemning two freshman lawmakers who have been accused of harboring anti-Semitic views. \"I think it is outrageous that the leadership of Democrats haven't called on these people to either take their comments back. They haven't condemned them,\" Sanders said. \"Anytime somebody who's not even associated with the President says something, the first thing is will you condemn. Will you say that this is terrible?\" GROWING NUMBER OF STATES PUSHING 'BIBLE LITERACY' CLASSES IN PUBLIC SCHOOLS Sanders added that \"it's very hard at this point to even take a lecture from Democrats on what is moral and what isn't,\" in reference to Speaker Nancy Pelosi calling a border wall along the southern U.S. \"immoral.\" \"The idea that protecting the people of your country, which is the fundamental duty of being president of the United States would in some way be immoral is a ridiculous charge,\" Sanders told the news station. CLICK HERE TO GET THE FOX NEWS APP \"I would think Speaker Pelosi may even regret making that comment because she's seen how ridiculous that sounds and how the evidence is so contrary to that comment,\" she continued. Sanders added that \"you can expect [Trump] to continue to lead on the effort\" to build a wall, because \"he's a natural born leader\" and a wall is \"a priority for him.\"",
      "date": "January 30",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Donald Trump Jr. takes on Justin Amash on Twitter over impeachment comments",
      "url": "https://www.foxnews.com/politics/donald-trump-jr-takes-on-justin-amash-on-twitter-over-impeachment-comments",
      "subtitle": "Donald Trump Jr. takes on Justin Amash on Twitter over impeachment comments",
      "author": "Nick Givas",
      "content": " Donald Trump Jr. took on Republican Rep. Justin Amash on Twitter Thursday and pushed for a primary challenge, after Amash became the first GOP House member to call for the impeachment of President Trump. Amash called for Trump's impeachment in May and accused Attorney General William Barr of misrepresenting the final findings of the Mueller report. ROMNEY: MUELLER REPORT DID NOT SHOW OBSTRUCTION, 'I DON'T THINK IMPEACHMENT IS THE RIGHT WAY TO GO' Amash announced he would be leaving the conservative House Freedom Caucus on Monday, which he co-founded -- after leadership reacted negatively to his comments. Amash claimed his exit was voluntary and will help avoid unwanted distractions. JUSTIN AMASH GOP PRIMARY CHALLENGER: 'COMPLETELY RIDICULOUS' TO CONSIDER TRUMP'S IMPEACHMENT Trump Jr. shared a \"Political Polls\" tweet Thursday, showing Amash down 16 points to state Rep. Jim Lower and said he's looking forward to primary season in Michigan's third congressional district. Amash replied less than two hours later and quoted a line from Trump Jr.'s email chain, which he released in 2017 as part of the Russia investigation. CLICK HERE TO GET THE FOX NEWS APP The president is reportedly considering joining the primary effort against Amash and has discussed the issue with several prominent figures, including Vice President Mike Pence and Freedom Caucus co-founder Rep. Mark Meadows.",
      "date": "June 13",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Orlando Sentinel issues scathing op-ed announcing it won't endorse Donald Trump in 2020 election",
      "url": "https://www.foxnews.com/politics/orlando-sentinel-endorse-anyone-but-trump",
      "subtitle": "Orlando Sentinel issues scathing op-ed announcing it won't endorse Donald Trump in 2020 election",
      "author": "Anna Hopkins",
      "content": " The Orlando Sentinel published a lengthy op-ed on Tuesday outlining the reasons they do not plan to endorse Donald Trump in the 2020 presidential election. President Trump is currently in Orlando readying the official launch of his 2020 campaign. The publication recognized that with more than a year until the election day, some may say it's too early to determine whether or not Trump has earned an endorsement. However, the paper's editorial board wrote that \"the chaos, the division, the schoolyard insults, the self-aggrandizement, the corruption, and especially the lies,\" over the last two and a half years were enough to decide than any other candidate would be better than Trump. BIDEN PREDICTS 2020 VICTORY ACROSS THE SOUTH WHERE DEMOCRATS HAVEN'T WON IN DECADES The article went on to discuss some of the questionable claims Trump has made throughout his presidency, including his assertion that he lost the popular vote was because of illegal voters, his claim in 2018 that North Korea is no longer a nuclear threat, and his quip that windmills cause cancer. It also cited a Washington Post database which claims to have tracked Trump's statements over the last few years and claims the president has made more than 10,000 false or misleading statements. \"Trump’s successful assault on truth is the great casualty of this presidency, followed closely by his war on decency,\" the Sentinel piece continued. In 2016, the publication endorsed Hillary Clinton for president, but said this year that if a Republican candidate like Mitt Romney or John Kasich were to emerge, they would \"eagerly give them a look.\" TRUMP LAUNCHES CAMPAIGN MACHINE WITH MASSIVE WAR CHEST, DESPITE POLLING LAG Trump has waged a long battle against the media throughout the duration of his first campaign and presidency and frequently slams mainstream news outlets such as CNN and the New York Times. CLICK HERE TO GET THE FOX NEWS APP During a segment on \"America's Newsroom\" on Tuesday, the Sentinel's op-ed was brought up to Newt Gingrich, who said he knew of \"no president who could have gotten 92 percent negative press coverage and still be standing.\"",
      "date": "June 18",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Donald Trump Jr blasts Joe Biden, asks why he didn’t ‘cure cancer’ in last 50 years",
      "url": "https://www.foxnews.com/politics/donald-trump-jr-mocks-joe-biden-at-re-election-rally-something-off-with-that-guy",
      "subtitle": "Donald Trump Jr blasts Joe Biden, asks why he didn’t ‘cure cancer’ in last 50 years",
      "author": "Brie Stimson",
      "content": " While warming up the crowd at President Trump’s re-election rally in Orlando Tuesday,  Donald Trump Jr. took a few swipes at the Democratic frontrunner. “I hear brilliant guys like Joe Biden,” he said to the fired-up crowd of some 20,000, “‘Government has failed you.’ Usually, as he’s groping someone.” Biden has been accused by several women of “inappropriate touching.” TRUMP CAMPAIGN KICKOFF APPEARS TO OUTDRAW SIMILAR EVENT FOR OBAMA'S RE-ELECTION BID “There’s something off with that guy,” Trump Jr. added. “Maybe you’re the problem, Joe Biden?” he suggested, referencing his decades in government – a record which could cause the former vice president problems on key issues like the Hyde Amendment. The president’s son also ridiculed Biden’s promise that he would “cure cancer” if he was elected president. “Why the hell didn’t you do that over the last 50 years, Joe?” Trump has focused much of his attention on Biden in the last few months as the former vice president quickly shot to the top of Democratic polls. CLICK HERE TO GET THE FOX NEWS APP A few recent polls pitting the president against Biden (including internal Trump campaign polling) have shown the president losing to Biden in several key states, including Florida, North Carolina and Texas.",
      "date": "June 19",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Donald Trump Jr. mocks Roy Moore after campaign announcement, reigniting criticism",
      "url": "https://www.foxnews.com/politics/trump-jr-mocks-roy-moore-after-campaign-announcement-continuing-feud",
      "subtitle": "Donald Trump Jr. mocks Roy Moore after campaign announcement, reigniting criticism",
      "author": "Sam Dorman",
      "content": " The president's son took another shot at Alabama Judge Roy Moore on Thursday, alluding to sexual misconduct allegations the Republican senate candidate faced during his run in 2017. Donald Trump Jr.'s criticism came in response to a report that Moore said he would improve on his previous run by engaging in \"more personal contact with people.\" \"This can't be real... can it? Based on the allegations I'd stay away from that but hey I'm new to this,\" Trump Jr. tweeted. SCANDAL-SCARRED ROY MOORE ANNOUNCES NEW SENATE BID, DESPITE GOP PROTESTS Moore announced his 2020 candidacy on Thursday despite leading Republicans criticizing him and President Trump publicly saying he couldn't win. “Can I win?\" Moore said at his announcement on Thursday. \"Yes, I can win. Not only can I, they know I can. That’s why there’s such opposition.\" ROY MOORE SAYS TRUMP 'DOESN'T CONTROL WHO VOTES': ALABAMIANS ARE 'SMARTER THAN THAT' Trump Jr. also disputed Moore's claim that he wasn't \"going against\" his father with his decision to run. \"This is pure fake news. I can assure everyone that by running, Roy Moore is going against my father and he’s doing a disservice to all conservatives across the country in the process,\" Trump Jr. tweeted on Thursday. In May, he also mocked Moore after he teased another Senate bid. \"You’re literally the only candidate who could lose a GOP seat in pro-Trump, pro-USA ALABAMA,\" Trump Jr. tweeted. \"Running for office should never become a business model. If you actually care about #MAGA more than your own ego, it's time to ride off into the sunset, Judge.\" SCANDAL-SCARRED ROY MOORE ANNOUNCES NEW SENATE BID, DESPITE GOP PROTESTS Republicans in Washington have made clear they don’t want Moore to run again, saying they believe any other Republican will beat Jones in 2020. The National Republican Senatorial Committee has said its motto in the race is “ABRM,” which stands for “anyone but Roy Moore.” CLICK HERE TO GET THE FOX NEWS APP \"We believe most Alabama Republicans realize that nominating Roy Moore would be gift wrapping this Senate seat for Chuck Schumer,\" Jack Pandol, a spokesman for the Senate Leadership Fund, which is aligned with Senate Majority Leader Mitch McConnell, said Thursday. \"It remains to be seen whether Moore can escape his baggage without his candidacy collapsing under its own weight, regardless of what groups on the outside do.\" Fox News' Alex Pappas contributed to this report.",
      "date": "June 20",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Fox News Poll: Did God favor Donald Trump in 2016?",
      "url": "https://www.foxnews.com/politics/fox-news-poll-did-god-favor-donald-trump-in-2016",
      "subtitle": "Fox News Poll: Did God favor Donald Trump in 2016?",
      "author": "Dana Blanton",
      "content": " White House Press Secretary Sarah Sanders said in a recent interview that she believes God wanted Donald Trump to become president. A quarter of voters agrees. A Fox News Poll released Wednesday finds 25 percent believe God wanted Trump to win the election.  Sixty-two percent disagree and 14 are unsure. CLICK HERE TO READ THE COMPLETE POLL RESULTS. Over half of white evangelical Christians, 55 percent, feel God put Trump in office.  That drops to 36 percent among Protestants and 20 percent among Catholics. Trump voters are nearly six times as likely as Clinton voters to believe God wanted Trump to win the election (46 vs. 8 percent).  The results are nearly identical among Republicans (45 percent) and Democrats (9 percent). In a January interview with the Christian Broadcasting Network, Sanders said, “I think God calls all of us to fill different roles at different times and I think that he wanted Donald Trump to become president, and that's why he's there.” The Fox News poll is based on landline and cellphone interviews with 1,004 randomly chosen registered voters nationwide and was conducted under the joint direction of Beacon Research (D) (formerly named Anderson Robbins Research) and Shaw & Company Research (R) from February 10-12, 2019.  The poll has a margin of sampling error of plus or minus three percentage points for all registered voters.",
      "date": "February 13",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "NBC News analysis declares Donald Trump the winner of first Democratic debate",
      "url": "https://www.foxnews.com/politics/donald-trump-winner-of-first-democratic-debate",
      "subtitle": "NBC News analysis declares Donald Trump the winner of first Democratic debate",
      "author": "David Montanaro",
      "content": " An NBC News analyst declared President Trump the winner of the first Democratic presidential debate of the 2020 election cycle. Author and reporter Jonathan Allen expressed surprise that Trump emerged \"largely unscathed\" as the field of 10 candidates mostly avoided direct attacks on him. Allen said the Democrats seemed more focused on positioning themselves furthest to the left to win over primary voters, rather than appealing to the swing voters that decided the 2016 election. \"For long stretches, it seemed, they completely forgot about the man who has been at the center of pretty much every discussion among Democrats for the last two-plus years — the man they're competing to take on next year. The obvious reason: The motivation to beat each other was, on this night, more urgent than defeating Trump — a life-or-death moment for some of their campaigns. Trump was the chief beneficiary of that dynamic,\" Allen wrote. MSNBC HOSTS CLASH AFTER ONE SAYS NOBODY ON STAGE COULD BEAT TRUMP He noted that after the debate, Sen. Elizabeth Warren, D-Mass., argued that ignoring Trump was intentional because \"he’s an old show that people are getting tired of.” Allen argued that by doing so, Democrats could allow Trump \"to exploit their divisions and position himself for re-election\" and \"he was one step closer to that after Wednesday's debate.\" The sentiment was shared by MSNBC host Joe Scarborough, who said it was “a missed opportunity” for Democrats to not go after frontrunner Joe Biden or President Trump. Another MSNBC commentator, Donny Deutsch declared confidently after the debate that none of the 10 candidates on the stage could defeat Trump next year, including Warren. CLICK HERE TO GET THE FOX NEWS APP Meantime, New York Post columnist John Podhoretz saw things similarly, taking particular issue with the candidates' far-left push on immigration. He said the candidates \"spent far more time talking about how they would help illegal immigrants than about how they would help the voters they most need to win over\" and that will benefit Trump. \"If I were Brad Parscale, Donald Trump’s campaign manager, I would be dancing a jig — because if this is the way the Democrats and the media want to discuss the economy and immigration, he is going to have a field day with the quotes they will generate from now until the election,\" he wrote.",
      "date": "June 27",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Biden says his first action as president will be 'defeat Donald Trump'",
      "url": "https://www.foxnews.com/politics/gaffe-machine-biden-says-his-first-action-as-president-will-defeat-donald-trump",
      "subtitle": "Biden says his first action as president will be 'defeat Donald Trump'",
      "author": "Joseph A. Wulfsohn",
      "content": " Former Vice President Joe Biden had a questionable response to the moderators about what his first action would be as president. In the second half of the debate, MSNBC moderator Chuck Todd explained that President Obama wanted to address healthcare and climate change in office and only managed to tackle one of them. All ten of the candididates were asked what \"first issue\" they would take on from the Oval Office. The answers varied from one candidate to the other, some like Sen. Michael Bennet, D-CO, pointed to climate change while Rep. Eric Swalwell, D-Calif, invoked gun control. But when Biden's turn was up, he began by defending his former running mate. SWALWELL ZINGS BIDEN ON HIS AGE, CALLS ON HIM TO 'PASS THE TORCH' \"I think you so underestimated what Barack Obama did,\" Biden said. \"He's the first man to bring together the entire world, 196 countries to commit to the deal with climate change. Immediately.\" CLICK HERE TO GET THE FOX NEWS APP The Democratic frontrunner then went on to answer the question... but answered with something that should have been done by the time he is sworn in as president. \"The first thing I would do is make sure that we defeat Donald Trump. Period,\" Biden confidently declared.",
      "date": "June 28",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Newt Gingrich: Donald Trump will win in 2020 if these two things happen",
      "url": "https://www.foxnews.com/politics/newt-gingrich-donald-trump-2020",
      "subtitle": "Newt Gingrich: Donald Trump will win in 2020 if these two things happen",
      "author": "Julia Musto",
      "content": " President Trump needs just two things to happen for him to win the White House again in 2020, according to former House Speaker Newt Gingrich. Speaking on \"America's Newsroom\", Gingrich said the president will get another four years if the economy continues on an upward trajectory and if he stays focused on the job. “If the economy stays good and the president stays focused, he’s going to win,” he remarked. While making the prediction, Gingrich pointed to the Trump campaign’s increasing momentum, which he said: “is all predicated on just tremendous amounts of hard work.” TRUMP CAMPAIGN, RNC ANNOUNCE $105M FUNDRAISING HAUL, BLOWING PAST DEM CANDIDATES On Tuesday the campaign and Republican National Committee (RNC) announced they had fundraised a record $105 million dollars in the second quarter of 2019. The president already had an unprecedented $40.8 million in cash-on-hand on April 1, 2019. The Republican National Committee and their joint fundraising committees had a combined $82 million cash-on-hand. \"“Deep down, I think President Trump’s pretty confident that—when it’s over—he’s going to be reelected,\" Gingrich said, before turning his attention to 2020 Campaign Manager Brad Parscale. Gingrich has worked with Parscale since the Republican National Convention in 2016 and told the co-anchors he knows Parscale to be “very close” to the president. He said Parscale is the right man for the job because he believes Trump is \"going to get reelected.\" “I mean, two things: look at the amount of money Parscale has raised and then look at the size of every one of these rallies,” Gingrich exclaimed. RNC'S MCDANIEL SAYS 'RADICALIZATION' OF DEM PARTY ON 'FULL DISPLAY' AT DEBATES During his own appearance on “The Story” with Martha MacCallum Tuesday evening, Parscale shared Gingrich's optimism. He told MacCallum, “I think the president could beat anybody. The momentum we're seeing right now. I mean look...$105 million raised, a hundred million cash on hand. What we're seeing overall the president success is overseas, the momentum behind this president right now is like nothing that history has ever seen.” “I think the president is set for four more years,” Parscale said definitively. During his \"America's Newsroom\" appearance Wednesday, Gingrich also took aim at the crop of 2020 Democratic candidates, suggesting many people believe they are \"going to go so far to the left.” BUTTIGIEG TRIPLES FUNDRAISING HAUL IN LAST QUARTER, RAKES IN NEARLY $25M He cited the moment all ten Democratic candidates on the second debate stage raised their hands in favor of providing government-funded health care for illegal immigrants. “They’re going to leave a gap about 25 miles wide between their views and the American people,” he said. And, in terms of any Democratic contenders who could potentially dethrone the president? According to Gingrich, there’s “no one.” Although, former Vice President Joe Biden and Senator Kamala Harris, D-Calif., both pose a threat to the president. “She’s probably the most dangerous of the Democrats. But, I also think that a leftwing politician from California is a pretty long way from the center of the American political system.” CLICK HERE TO GET THE FOX NEWS APP Gingrich predicted: “In my mind, they’re going to have a nominee of the Democratic party. It will be a very leftwing person and they will have almost and impossible time defending their positions.”",
      "date": "July 3",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Donald Trump Jr. bashes Michael Cohen's motives during House testimony",
      "url": "https://www.foxnews.com/politics/donald-trump-jr-bashes-michael-cohens-motives-during-house-testimony",
      "subtitle": "Donald Trump Jr. bashes Michael Cohen's motives during House testimony",
      "author": "Liam Quinn",
      "content": " Donald Trump Jr. has blasted Michael Cohen, questioning his motives for testifying before the House Oversight and Reform Committee on Wednesday. Cohen, the ex-Trump fixer who has been sentenced to three years in prison, unloaded on President Trump during his testimony by repeatedly saying he was “ashamed” of his past work for Trump, while also claiming he had “suspicions” -- though no evidence -- regarding whether Trump's presidential campaign coordinated with Russia in 2016. Cohen began his testimony saying of Trump: “He is a racist. He is a conman. And he is a cheat.” After outlining numerous alleged misdeeds by Trump, Cohen expressed regret and repeated the refrain “yet I continued to work for him.” MICHAEL COHEN CONDEMNS TRUMP AT HEARING: 'HE IS A RACIST. HE IS A CONMAN. AND HE IS A CHEAT.' Cohen came to the hearing with a slew of exhibits, including checks that he said are proof of his previous claims that Trump organized hush-money payments to two women who claimed affairs with Trump during the campaign. But Trump Jr. was not swayed by any of the comments or exhibits, and instead unloaded on Cohen in a series of tweets. “And that’s what all this is about. Cohen just wants to be famous. He always wanted his own TV show and the limelight and when he couldn’t get it one way he had to try another,” Trump Jr. tweeted. He earlier mocked Cohen by writing: “This sounds like a breakup letter... and I’m keeping your sweatshirt.” In his testimony, Cohen claimed President Trump previously told him and others that Trump Jr.: \"had the worst judgment of anyone in the world.\" Earlier, the much-awaited hearing began with fireworks, as Republicans portrayed Cohen as a liar and unsuccessfully moved to postpone the hearing while Democratic Chairman Elijah Cummings accused the GOP of trying to suppress the testimony. RNC TELLS MICHAEL COHEN TO ‘HAVE FUN IN PRISON,’ AS GOP READIES WAR ROOM TO PUSH BACK ON TESTIMONY In his opening statement, Cummings acknowledged that Cohen “repeatedly lied in the past,” calling it an “important factor we need to weigh.” He said if Cohen doesn’t tell the truth, he’ll refer him to the Justice Department for prosecution. But Cummings said the hearing is important for understanding the president’s past actions, adding, “the days of this committee protecting the president at all costs are over.” CLICK HERE TO GET THE FOX NEWS APP Ohio GOP Rep. Jim Jordan, the ranking member on the committee, in his opening statement ripped Democrats for calling Cohen to testify, emphasizing Cohen’s guilty plea to previously lying to Congress. Jordan went on to accuse Democrats of holding the hearing so they can later try to impeach the president. “The first announced witness for the 116th Congress is a guy who is going to prison in two months for lying to Congress,” Jordan said. Fox News' Alex Pappas contributed to this report.",
      "date": "February 27",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Bernie Sanders knocks Biden after 'Medicare-for-all' criticism: Sounds 'like Donald Trump'",
      "url": "https://www.foxnews.com/politics/bernie-sanders-joe-biden-sounds-donald-trump-medicare-for-all",
      "subtitle": "Bernie Sanders knocks Biden after 'Medicare-for-all' criticism: Sounds 'like Donald Trump'",
      "author": "Sam Dorman",
      "content": " Sen. Bernie Sanders, I-Vt., has taken aim at Democratic front-runner Joe Biden, accusing the former vice president of \"sounding like Donald Trump\" on one key issue. Sanders, in a new interview, was defending his sweeping \"Medicare-for-all\" plan when he took a swipe at Biden. “I am disappointed, I have to say, in Joe, who is a friend of mine, really distorting what Medicare for all is about,” Sanders said on Wednesday, according to The New York Times. \"Unfortunately, he is sounding like Donald Trump. He is sounding like the health care industry in that regard.” BERNIE SANDERS: AMERICANS 'WILL BE DELIGHTED TO PAY MORE IN TAXES' FOR FREE HEALTH CARE, EDUCATION Sanders' slam came after Biden pushed for a modified version of the Affordable Care Act which he and former President Obama championed, rather than embracing \"Medicare-for-all,\". “I understand the appeal to ‘Medicare-for-all,” Biden previously said. “But folks supporting it should be clear that it means getting rid of ObamaCare. And I’m not for that. I was very proud the day I stood there with Barack Obama and he signed that legislation.” Sanders' criticism highlighted how the progressive push for health care expansion has divided the Democratic field. Sanders' campaign has specifically called out Sen. Kamala Harris, D-Calif., and former Colorado Gov. John Hickenlooper for their take on policies like \"Medicare-for-all.\" Jeff Weaver, a Sanders campaign adviser, suggested on Wednesday that Harris was unrealistic in her reluctance to raise taxes to pay for a \"Medicare for all\" program under her would-be administration. BIDEN PROPOSES BIG CHANGE TO OBAMACARE, IN BID TO SAVE IT FROM 'MEDICARE-FOR-ALL' CROWD “Without unicorns, magic wands, health care is not free. There’s doctors, nurses that have to be paid. There’s hospitals. You have to pay for it,” Weaver told MSNBC. Weaver's remarks also came on the same day that the Vermont senator gave a speech defending his health care proposal. That paired well with a speech he gave on democratic socialism in June after another 2020 hopeful, former Rep. John Delaney, D-Md., was booed for opposing the program while speaking at California Democrats' annual convention. CLICK HERE TO GET THE FOX NEWS APP Weaver's comments echoed a criticism Sanders' campaign issued after Hickenlooper held a press conference criticizing democratic socialism. Tweeting an old video of former President Franklin Delano Roosevelt, Sanders seemed to suggest that Hickenlooper was unrealistic to expect solutions to major issues without accepting high government spending. Sanders has said he would likely raise both payroll and income taxes to pay for his health care proposal.",
      "date": "July 18",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Donald Trump slams Kellyanne Conway's husband as 'total loser'",
      "url": "https://www.foxnews.com/politics/donald-trump-slams-kellyanne-conways-total-loser-husband",
      "subtitle": "Donald Trump slams Kellyanne Conway's husband as 'total loser'",
      "author": "Liam Quinn",
      "content": " President Trump has ensured some awkward dinner-table conversations at the Conway household, taking direct aim Tuesday at adviser Kellyanne Conway’s husband. “A total loser!” Trump tweeted, in response to a post from campaign manager Brad Parscale about George Conway -- who despite his wife's senior role in the administration has emerged as an outspoken Trump critic. “We all know that @realDonaldTrump turned down Mr. Kellyanne Conway for a job he desperately wanted. He barely worked @TheJusticeDept and was either fired/quit, didn’t want the scrutiny? Now he hurts his wife because he is jealous of her success. POTUS doesn’t even know him!” Parscale had tweeted Monday night. KELLYANNE CONWAY'S HUSBAND RIPS TRUMP FOR 'PATHOLOGICAL' LYING, CLAIMS PRESIDENT HAS 'DISORDER' Conway himself responded shortly afterward, tweeting: “Congratulations!  You just guaranteed that millions of more people are going to learn about narcissistic personality disorder and malignant narcissism!  Great job!” The fiery tweets came after George Conway, who has frequently criticized Trump, questioned the president's mental health. Conway elaborated early Monday, saying that Trump’s barrage of tweets over the weekend – including critiques of the late Sen. John McCain and “Saturday Night Live” – were a “product of his pathologies” rather than a “rational plan or strategy.” He then retweeted a post from \"Duty To Warn,\" which tried to demonstrate that Trump's activities matched the criteria for narcissistic personality disorder. GEORGE CONWAY RAMPS UP TRUMP ATTACKS AS KELLYANNE DEFENDS BOSS It was the latest salvo from George Conway, who last week posted a thread that began when he called out Trump for claiming that Judge Amy Berman Jackson's sentencing of former Trump campaign chairman Paul Manafort earlier in the day had exonerated the president from the Russian collusion narrative. “Have we ever seen this degree of brazen, pathological mendacity in American public life?\" Conway asked in a tweet. \"One day he makes a harmless slip of the tongue, something any mentally balanced person would laugh off. But instead he lies about it. He denies what the world can see on videotape. Even his donors and supporters wonder, what is wrong with him? Why would he feel compelled to tell such an absurd lie?” The president’s camp has largely avoided responding to George Conway until now, with Eric Trump one of the few to fire back. \"Of all the ugliness in politics, the utter disrespect George Conway shows toward his wife, her career, place of work, and everything she has fought SO hard to achieve, might top them all,\" Eric Trump wrote in December. CLICK HERE TO GET THE FOX NEWS APP \"@KellyannePolls is a great person and frankly his actions are horrible.\" Fox News' Joseph A. Wulfsohn contributed to this report.",
      "date": "March 19",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Court files shed light on Kamala’s awkward donation from Donald Trump",
      "url": "https://www.foxnews.com/politics/court-files-shed-light-on-kamalas-awkward-donation-from-donald-trump",
      "subtitle": "Court files shed light on Kamala’s awkward donation from Donald Trump",
      "author": "Brooke Singman",
      "content": " Sen. Kamala Harris has a long record of political stances from her prosecutor days that don’t quite square with her current national profile as a liberal champion — but one of the most awkward items from her past may be her acceptance of a $5,000 donation from Donald Trump nearly a decade ago. Now, court records reviewed by Fox News have provided additional details about the circumstances surrounding the contribution from the man she wants to unseat in 2020 and whose policies she now calls \"vile.\" KAMALA HARRIS TURNS TRUMP'S TWEETS AROUND, TELLS HIM TO 'GO BACK TO WHERE HE CAME FROM' According to sworn affidavits signed by Trump and his daughter Ivanka, disgraced former New York Attorney General Eric Schneiderman was behind the hefty contribution to Harris’ re-election campaign for California attorney general. The affidavit was part of an ethics complaint against Schneiderman filed on Dec. 2, 2013, by Trump, who claimed the top prosecutor had given him the impression that his investigation into Trump University was over when it was not. Trump argued in his sworn statement that given Schneiderman’s “persistent, unsolicited and unqualified reassurances that the investigation would never eventuate in a lawsuit, and my sincere belief that there was no wrongdoing on the part of [Trump University], I did not perceive any issue with trying to assist Mr. Schneiderman whenever I or other Trump Org. executives were able.” He described one such case: the donation for Harris that a Schneiderman aide purportedly solicited and Ivanka helped arrange. “Mr. Schneiderman’s former transition committee leader asked my daughter Ivanka if she would arrange for me to make a contribution to a fundraising event sponsored by Mr. Schneiderman for newly elected California Attorney General Kamala Harris,” Trump wrote. “In response, I made a $5,000 contribution to Ms. Harris’ campaign—the highest level of sponsorship listed in the invitation—and Ivanka attended the event together with some of Trump Org.’s other top executives.” The 2011 donation is one of several Trump made to now-Democratic candidates for president that could cause lingering headaches for their campaigns -- especially considering Trump likes to remind voters of the past financial help and favors he offered to figures who now fiercely criticize him. Trump donated to Sen. Kirsten Gillibrand twice -- $1,050 in December 2007 and $2,400 in September 2010. And Trump donated $1,000 to then-Sen. Joe Biden in December 2001. But the Trumps donated to Harris' attorney general re-election campaign three times. Aside from the $5,000 donation in 2011, Trump donated $1,000 on Feb. 20, 2013, and Ivanka Trump donated $2,000 on June 3, 2014. The Sacramento Bee and other publications reported on those donations earlier this year, but the affidavits provide more context for the transactions. Those donations also could prove distinctly awkward for a candidate who lately has assailed Trump for his comments suggesting Rep. Ilhan Omar, D-Minn., and other minority congresswomen “go back” where they came from, fix things and return to show how it's done. Harris slammed Trump’s comments as “vile,” “ignorant,” “shallow” and “hateful.” But Harris did not publicly condemn Trump in 2011—when he was pushing \"birther\" conspiracy theories about former President Barack Obama. A spokesperson for the Harris campaign told The Sacramento Bee in March that Harris donated the $6,000 she received from Trump to a nonprofit that focuses on the rights of Central Americans but did not do so until 2015—one year after she won her re-election campaign. It is unclear at this point if Harris ever returned or donated the $2,000 contribution from Ivanka Trump. Asked Wednesday for any further comment on the donation, a spokesman told Fox News: \"All Trump's money was donated to an immigrants' rights charity.\" The main 2011 fundraising event was held on Sept. 22 of that year at law firm SNR Denton’s headquarters in Midtown Manhattan. The invitation, seen by Fox News, showed tiers of donations: $1,000 to be considered a “Donor,” $2,500 to be considered a “Sponsor,” and $5,000 to be considered a “Host.” According to the invitation, Schneiderman was the “Special Guest Speaker.” A copy of Trump’s check, also obtained by Fox News, shows the check dated Sept. 13, 2011; it was stamped on Sept. 26, 2011. The check, for $5,0000, was signed by Trump and made out to the order of: “RE-ELECT ATTORNEY GENERAL KAMALA D HARRIS 2014.” Ivanka Trump’s sworn affidavit also reflected Schneiderman’s involvement in soliciting the funds for Harris’ campaign. “In September 2011, Mr. Schneiderman’s former transition committee leader again contacted me and said that Mr. Schneiderman would ‘greatly appreciate’ if I attended a fundraising event for newly elected California Attorney General Kamala D. Harris as Mr. Schneiderman’s guest,” Ivanka said. “In response, my father made a $5,000 contribution to Ms. Harris’ campaign and I attended the fundraiser,” she continued. “At the event, an intimate gathering of New York business people, I was one of only a small handful of Mr. Schneiderman’s personal guests.” Ivanka added that “not wanting to disappoint” Schneiderman, she “personally contributed $500 to Mr. Schneiderman’s reelection campaign in honor of his birthday.” The $5,000 donation to Harris came amid Schneiderman's investigation into Trump University after receiving complaints from nearly a dozen students about the school. It was not until August 2013 that Schneiderman filed a civil suit accusing Trump University of employing illegal business practices. The case ended in April 2018 with a $25 million settlement. Schneiderman was later forced to resign from his post as New York’s attorney general in May 2018, after he was accused of physically abusing several women. An investigation launched by Gov. Andrew Cuomo ended in December 2018 and resulted in no criminal charges against him -- the statute of limitations prevented any form of prosecution. But Harris also led an investigation into several for-profit colleges, including Trump University, which was revealed in October 2013. No charges were filed in connection with the probe.",
      "date": "July 31",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Donald Trump Jr. subpoenaed by Senate Intelligence Committee, source says",
      "url": "https://www.foxnews.com/politics/donald-trump-jr-subpoenaed-by-senate-intelligence-committee-source-says",
      "subtitle": "Donald Trump Jr. subpoenaed by Senate Intelligence Committee, source says",
      "author": "Elizabeth Zwirz",
      "content": "  The Senate Intelligence Committee has issued a subpoena for Donald Trump Jr., a source confirmed to Fox News on Wednesday. The subpoena is in regards to remarks President Trump's oldest son made while testifying before the Senate Judiciary Committee in 2017, The Associated Press reported, citing a person familiar with the situation. The committee’s desire to speak to Trump Jr. follows testimony from Michael Cohen, the president’s former attorney, in February. MICHAEL COHEN SWIPES AT TRUMP AS HE REPORTS TO PRISON: ‘THERE STILL REMAINS SO MUCH TO BE TOLD’ Cohen told a House committee at the time that he had briefed Trump Jr. approximately 10 times about a plan to build a Trump Tower in Moscow. Trump Jr. told the Senate Judiciary Committee in 2017 he was only \"peripherally aware\" of the proposal. The Senate Intelligence Committee has been looking into Russian election interference and Trump's ties to Russia for the last two years. The move to subpoena Trump Jr. was met with disapproval from House Minority Leader Kevin McCarthy, R-Calif., who argued that politicians should redirect their energy away from investigating potential Russian collusion. \".@DonaldJTrumpJr has already spent dozens of hours testifying in front of Congressional committees,” McCarthy tweeted. “Endless investigations—by either party—won't change the fact that there was NO collusion. It's time to move on. It’s time to focus on ISSUES, not investigations.\" SCHUMER BRANDS MCCONNELL’S FIERY SPEECH TO MOVE ON FROM RUSSIA INVESTIGATION AS ‘DESPICABLE’ A source close to Trump Jr. also aired their frustrations about the subpoena to Fox News while slamming Senate Intelligence Committee Chairman Richard Burr, R-N.C. The source spoke about Trump Jr.’s prior testimony, arguing that he has consistently been cooperative. “Don is a private citizen, who has already been cleared by Mueller after a two-year investigation. He has done 8-9 hours of testimony in front of Senate Intel already and 27 hours of testimony in front of various committees in total,” the source said. “When he originally agreed to testify in front of the Senate Intel Committee in 2017, there was an agreement between Don and the Committee that he would only have to come in and testify a single time as long as he was willing to stay for as long as they’d like, which Don did.\" A comment from Trump Jr. was not immediately available. The Associated Press contributed to this report.",
      "date": "May 8",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Biden warns of ‘eight more years of Donald Trump’",
      "url": "https://www.foxnews.com/politics/biden-warns-of-eight-more-years-of-donald-trump",
      "subtitle": "Biden warns of ‘eight more years of Donald Trump’",
      "author": "Dom Calicchio",
      "content": " Does Democratic frontrunner Joe Biden believe President Trump plans to remain in the White House longer than the two terms allowed under the U.S. Constitution? During Wednesday’s Democratic presidential debate in Detroit, Biden said that “eight more years of Donald Trump will change America in a fundamental way.” PROTESTERS REPEATEDLY INTERRUPT DEM PRIMARY DEBATE, SHOUT DOWN BIDEN, BOOKER, DE BLASIO It was unclear whether “eight years” referred to a possible second and third term for Trump, or if Biden simply misspoke. The idea of Trump attempting to serve longer than two terms – perhaps matching the four terms to which Democrat Franklin Roosevelt was elected before the 22nd Amendment took effect in 1951 -- has been a source of mainstream media speculation since Trump took office. In May, Trump joked during a rally in Pennsylvania that he may look to serve as many as five terms. \"Now we're going to have a second time,\" the president told the crowd in Montoursville, Pa. \"And then we'll drive them crazy. Ready? And maybe if we really like it a lot and if things keep going like they're going, we'll go and we'll do what we have to do. We'll do a three and a four and a five.\" Later, Biden sparked some confusion by referring to \"Joe 30330,\" without clarifying whether he was referring to a website, text messaging number or some other communications platform. CLICK HERE TO GET THE FOX NEWS APP Meanwhile, the Republican Party has argued that the first two-and-a-half years of the Trump administration have already changed America in some fundamental ways. “Wages are up, unemployment is down, paychecks are growing,” GOP Chairwoman Ronna McDaniel wrote in a Twitter message Wednesday. Fox News' Danielle Wallace contributed to this story.",
      "date": "August 1",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Donald Trump Jr sparks protests, fan support during stop at UCLA",
      "url": "https://www.foxnews.com/politics/donald-trump-jr-sparks-protests-fan-support-during-stop-at-ucla",
      "subtitle": "Donald Trump Jr sparks protests, fan support during stop at UCLA",
      "author": "",
      "content": "Donald Trump Jr., who is on a nationwide book tour that included a tense stop last week at “The View,\" visited Sunday the University of California, Los Angeles, where he was received by both protesters and some supporters. Trump Jr.'s appearance was marked by an argument between him and the audience over why he would not take questions, The Guardian newspaper reported. Trump was greeted with shouts of \"USA! USA!\" when he first appeared on the stage of a lecture hall, but members of the audience eventually turned to louder, openly hostile chants of \"Q and A! Q and A!\" after they were told he would not take questions, the newspaper reported. The Guardian said that Trump Jr. told the audience that taking questions from the floor risked creating soundbites that left-wing social media posters would abuse and distort. Kimberly Guilfoyle, his girlfriend, told audience members that they were being rude, according to The Guardian. After the stop at the university, Trump Jr. posted on Twitter that he appeared at the Reagan Library in Simi Valley, where he reportedly stayed for over four hours and had about 1,400 in attendance. He said the audience had high energy.",
      "date": "November 11",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Donald Trump Jr. on day one of public impeachment hearings: ‘I’ve never seen anything more ridiculous’",
      "url": "https://www.foxnews.com/politics/donald-trump-jr-on-day-one-of-public-impeachment-hearings-ive-never-seen-anything-more-ridiculous",
      "subtitle": "Donald Trump Jr. on day one of public impeachment hearings: ‘I’ve never seen anything more ridiculous’",
      "author": "Talia Kaplan",
      "content": " Donald Trump Jr. reacted to the first day of public hearings in the impeachment inquiry against his father on Wednesday saying, ‘‘I’ve never seen anything more ridiculous.” The first day of public hearings wrapped up with no major revelations -- but he said it also highlighted weaknesses in Democrats' key witnesses, who relied primarily on second-hand information. Speaking on “Hannity” on Wednesday night, Trump was quick to point that out. DAY ONE OF PUBLIC IMPEACHMENT HEARINGS PUTS PRESSURE ON MODERATE DEMS \"You see exactly what America voted against in 2016, career government bureaucrats doing their thing,” the executive vice president of the Trump Organization said. “Everything was hearsay, ‘I heard it from a friend, who heard it from a friend, how heard it from a friend.’ I’m saying, ‘this is a joke.’” At one point in Wednesday's hearing, Rep. Mike Quigley, D-Ill., even appeared to embrace hearsay testimony, claiming that \"hearsay can be much better evidence than direct\" and that \"countless people have been convicted on hearsay because the courts have routinely allowed and created, needed exceptions to hearsay.\" It was unclear which of those limited exceptions would apply to Wednesday's testimony -- and whether Quigley's argument would persuade critical swing-vote Democrats. Trump commented on Quigley’s statements telling Sean Hannity, “Then I heard the Democrats, and this is when you realize how bad or, frankly, nonexistent their case is, ‘well hearsay is often times much better than regular evidence.’ I’m saying, ‘did that guy say that with a straight face?’” Trump then compared Quigley’s comments to “the telephone game we learned about in Kindergarten.” “So it’s better to have heard it from a friend who heard it from a friend who heard it from a friend than to have heard it with your own ears? I mean that’s the level of insanity that you’re seeing from these bureaucrats who’ve taken an anti-Trump position,” he said. Earlier Wednesday Trump Jr. also tweeted about Quigley’s comments writing, “Can you believe this insanity? “Heresay [sic] can be much better evidence than DIRECT EVIDENCE” according to Democrat Mike Quigley. Are you fricken kidding me? 3rd and 4th party info better than hearing it yourself?” On \"Hannity\" Trump said, “When Republicans start questioning, [House Intelligence Committee Chairman] Adam Schiff changes the rules, changes the goal posts, pretends they can’t even ask that question anymore. It’s never ending. It’s a comedy at this point.” WATCH: SCHIFF CUTS OFF GOP CONGRESSWOMAN WHO BRINGS UP HIS 'PARODY' CALL The House is now comprised of 431 members, meaning Democrats need 217 yeas to impeach Trump. There are currently 233 Democrats, so Democrats can only lose 16 of their own and still impeach the president. 31 House Democrats represent more moderate districts that Trump carried in 2016. CLICK HERE TO GET THE FOX NEWS APP Trump Jr. told Hannity on Wednesday that the left “is not looking to govern, they’re not looking to do anything, they are looking to try to resist. Because they know they can’t beat Trump in the polls, they’re going to try to impeach and it’s not going to work in the long run and the American people see through it. They are sick of this garbage.” Fox News’ Gregg Re contributed to this report.",
      "date": "November 14",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    }
  ]
}