{
  "articles": [
    {
      "title": "MSNBC's Scarborough defends Joe Biden, cites FDR in wake of attacks for working with segregationist senators",
      "url": "https://www.foxnews.com/politics/scarborough-cites-fdr-to-stand-up-for-biden-following-segregation-comments",
      "subtitle": "MSNBC's Scarborough defends Joe Biden, cites FDR in wake of attacks for working with segregationist senators",
      "author": "Nick Givas",
      "content": " MSNBC host Joe Scarborough defended Joe Biden against his own party on \"Morning Joe\" Thursday, after the 2020 presidential hopeful was criticized for working with segregationist senators. Biden highlighted his work with Sens. James Eastland of Mississippi and Herman Talmadge of Georgia during a fundraiser in New York City on Tuesday and said he was able to see past their beliefs for the good of the country. Scarborough played a clip of Sen. Kamala Harris D-Ca, criticizing Biden's comments and calling them \"misinformed and wrong.\" She also declined to say if Biden should apologize for his remarks. \"First of all, Kamala -- I love Kamala. But Joe Biden didn’t coddle any segregationist in anything that he said. In fact, I think he called one of them one of the meanest people he ever met,\" Scarborough said. BETO O'ROURKE: JOE BIDEN WOULD BE RETURN TO THE PAST: 'WE'VE GOT TO BE BOLDER' BIDEN SLAMMED BY DEM RIVALS FOR HIGHLIGHTING ABILITY TO WORK WITH SEGREGATIONIST SENATORS He then compared Biden to Franklin Delano Roosevelt and said bipartisanship, in any form, is usually a good thing. \"If that’s coddling, please stay away from me Joe. Don’t hug me, don’t coddle me. That's not coddling. Also, he didn’t speak with adoration about these segregationists,\" Scarborough continued. \"He picked the people who were the most repugnant to him -- who he disagreed with the most. And he said I could even work with him. Now, who was it that says -- was it Rumsfeld that says, you fight on the battlefield with the enemy that's presented to you...  Well, guess what, FDR -- the brilliance of FDR was he could work with Yankees from New England and he could work with segregationists and racists from the south. \"And you know what happened when FDR did that? He passed Social Security. He passed the New Deal. He saved this country and he saved poor people like my parents. In the deep south, he also saved black Americans.\" MSNBC'S SCARBOROUGH RIPS INTO 'HIGH AND MIGHTY' ROBERT MUELLER, SAYS IT IS 'RIDICULOUS' HE HAS NOT TESTIFIED Scarborough said history would have changed for the worse if world leaders refused to have dialogues with those they disagreed with. He also said the 60 vote threshold in the Senate is the only way to actually change American policy and is seldom achieved without some type of unpleasantness. \"FDR didn’t sit there and go, 'you know what -- I’m not going to deal with the racists in the south. Eleanor and I are going to just sit here and have tea and we’re going to have radio broadcasts where we speak in self-righteous indignation all day. And we may have a crumpet, too. But the point is I'm not talking with those people because they offend me.' It would have been a pretty bad country if that happened,\" he said. \"[FDR] also had to deal with the same segregationists as we moved toward World War II to defeat Hitler. You sometimes, to get to 60 votes to change America, you have to deal with people whose views you may find repugnant.\" Biden also faced backlash from Sen. Corey Booker D-Nj, who issued a statement saying he was disappointed in the former vice president, and calling on him to make an \"immediate apology.\"  Biden fired back and flipped the script on Booker, demanding an apology of his own. CLICK HERE TO GET THE FOX NEWS APP “Cory should apologize,” Biden said in response on Wednesday. “He knows better. Not a racist bone in my body. I've been involved in civil rights my whole career. Period. Period. Period.”",
      "date": "June 20",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Rep. John Lewis defends Joe Biden amid controversy on working with segregationists, says remarks not offensive",
      "url": "https://www.foxnews.com/politics/rep-john-lewis-defends-joe-biden-segregationist-senators",
      "subtitle": "Rep. John Lewis defends Joe Biden amid controversy on working with segregationists, says remarks not offensive",
      "author": "Anna Hopkins",
      "content": " Congressman John Lewis, D-Ga., has joined the ranks of Democrats defending Joe Biden after the 2020 hopeful came under fire for touting his past success in working with segregationist senators. Biden made the controversial comments at a fundraiser on Tuesday while speaking on the importance of \"civility\" in politics and the necessity to work with others regardless of their beliefs. The former vice president spoke of the ability to \"get things done\" with Sens. James Eastland and Herman Talmadge, both staunch segregationists. Rep. Lewis, a civil rights hero himself, came to Biden's defense on Friday while speaking with reporters. He noted that in the Civil Rights Era, he too worked with people who opposed his rights. \"I don’t think those remarks are offensive, they’re in the height of the Civil Rights Movement,\" Lewis said. We worked with people, and got to know people - there was members of the Klan, people who opposed us, even people who beat us, arrested us and jailed us. JOE BIDEN SAYS CORY BOOKER 'SHOULD APOLOGIZE' FOR SLAM OVER WORKING WITH SEGREGATIONIST SENATORS \"We never gave up on our fellow human beings – and I would not give up on any human being,\" he continued. Lewis said that Biden's camp had reached out to discuss the response to the vice president's remarks, but he had not had the opportunity to return their calls. Lewis is not the only one to attempt to quell the criticisms of Biden in light of his comments - House Speaker Nancy Pelosi, D-Calif., and the Congressional Black Caucus also spoke out in support of the 2020 presidential candidate. Pelosi described Biden as \"authentic,\" while Rep. Hakeem Jeffries, D-N.Y., spoke on his own experience working with President Trump, who represents an administration he disagrees with. “I think we here in the House Democratic Caucus have ourselves taken the position that sometimes you have to work with the opposition to the extent they’re in power without compromising your values if you can get things done,\" Jeffries said. BIDEN DEFIANT AS RIVALS SLAM REMARKS ON SEGREGATIONISTS: 'APOLOGIZE FOR WHAT?' Others, however, have spoken out against Biden, including some of his 2020 competitors. Sen. Cory Booker called Biden's approach \"not the model for how we make America a safer and more inclusive place for black people, and for everyone.\" Former New York Mayor and presidential candidate Bill de Blasio said it's \"past time for apologies or evolution\" from Joe Biden. In light of the criticism, Lewis advised Biden to \"keep his eyes on the prize.\" and keep his eyes on the prize.\" CLICK HERE TO GET THE FOX NEWS APP \"Never give up, or become bitter or hostile. Work hard,\" he added.",
      "date": "June 21",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Sean Spicer: Joe Biden a 'flip-flopping gaffe machine' benefitting largely from Obama ties",
      "url": "https://www.foxnews.com/politics/sean-spicer-joe-biden-gaffes-obama-ties",
      "subtitle": "Sean Spicer: Joe Biden a 'flip-flopping gaffe machine' benefitting largely from Obama ties",
      "author": "Charles Creitz",
      "content": " Democratic 2020 frontrunner Joe Biden is reliably gaffe-prone and is leading in the polls chiefly due to his association with former President Barack Obama, according to Sean Spicer. The former vice president's name identification is another reason he leads a pack of more than 20 candidates -- not because he is running a good campaign, Spicer, a former White House press secretary under President Trump. said Friday on Fox News' \"Hannity.\" \"I think there's a false narrative out there that Joe Biden is some sort of political success,\" Spicer told guest host Jason Chaffetz. \"He's been saying dumb things since he was first elected in the early 1970s. He has run for president twice and epically failed. BIDEN DEFIANT AS RIVALS SLAM REMARKS ON SEGREGATIONISTS: 'APOLOGIZE FOR WHAT?' \"Biden right now benefits from eight years of ... being vice president to, frankly, a popular president from the Democratic Party.\" However, Biden's penchant for making public gaffes and the absence of Obama at his side will hurt him when he joins his fellow contenders for next week's primary debates in Miami, Spicer said. \"He is a flip-flopping gaffe machine,\" Spicer claimed. \"Right now, once the other candidates have an opportunity to go after him on the debate stage coming up ...  and he doesn't have Obama to carry the ticket, he will fail epically as he has twice before.\" Most recently, Biden remained defiant after making comments about how he was able to work well with former Sens. Herman Talmadge, D-Ga., and James O. Eastland, D-Miss., despite the fact they were avowed segregationists. CLICK HERE TO GET THE FOX NEWS APP Biden's campaign defended the comments while the candidate himself rebuffed calls for his apology -- and has fired back at his critics. “Apologize for what?” Biden told reporters Wednesday night when asked about the criticism over his remarks. “Not a racist bone in my body. I've been involved in civil rights my whole career. Period. Period. Period.” Fox News' Paul Steinhauser contributed to this report.",
      "date": "June 21",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Lara Trump: Joe Biden tanking earlier than expected, 'maybe he regrets now even deciding to run'",
      "url": "https://www.foxnews.com/politics/lara-trump-joe-biden-gaffes",
      "subtitle": "Lara Trump: Joe Biden tanking earlier than expected, 'maybe he regrets now even deciding to run'",
      "author": "Charles Creitz",
      "content": " Former Vice President Joe Biden's popularity is taking a hit from recent gaffes, and the 2020 hopeful may be having second thoughts, according to Lara Trump. Biden has been taking heat that could hurt his chances to be the Democratic nominee, Trump suggested during an interview on \"The Todd Starnes Show.\" \"I don't know what's going on with Joe Biden,\" she said. TRUMP: 'SLEEPY JOE BIDEN' HASN'T 'APOLOGIZED' FOR INVOLVEMENT IN 1994 CRIME LAW \"We don't know if Joe Biden is going to be who we run against in 2020, but it certainly isn't looking promising for him. I feel like he's really started to tank a little bit earlier than anyone expected. \"Maybe he regrets now even deciding to run, because there's been a lot that's happened that doesn't look great for him since he announced he was running for president.\" Host Todd Starnes then raised two recent controversies the former vice president has faced -- accusations of inappropriate touching from several women, as well as comments he made about working with segregationist senators. Trump said such instances are more reason her father-in-law, President Trump, should allow Democrats to battle amongst themselves. \"With all the Democrats, I say just let them keep digging,\" she said. CLICK TO GET THE FOX NEWS APP \"I don't know who gave them the shovel but let them keep digging it deeper. We're going to see the debates this week. It should be very interesting. \"As we say in the South, 'bless his heart'.”",
      "date": "June 24",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Joe Biden making millions, living in lavish homes since leaving office: report",
      "url": "https://www.foxnews.com/politics/joe-biden-has-made-millions-since-leaving-vice-presidency-moved-into-5m-mansion-report",
      "subtitle": "Joe Biden making millions, living in lavish homes since leaving office: report",
      "author": "Liam Quinn",
      "content": " Former Vice President Joe Biden has raked in millions since leaving office while upgrading his lifestyle substantially, according to a new report -- details that could challenge his 'Middle Class Joe' public persona. Biden, who was never one of the wealthier members of Congress during his decades as a senator, has seen his fortunes turn considerably since the Obama administration thanks to speeches and book deals, according to The Washington Post. The Post reported, citing public documents, that Biden was paid as much as $200,000 for some speeches. The former VP’s campaign told the newspaper Biden has given fewer than 50 paid speeches. The ex-vice president also got some pricey perks as part of his speaking gigs, including chartered flights, town cars and professional drivers, luxury hotel suites, and reimbursements, according to the report. BIDEN WARNS AGAINST DEMONIZING THE RICH DURING FUNDRAISER: 'RICH PEOPLE ARE JUST AS PATRIOTIC' Meanwhile, Biden has moved into a sprawling mansion outside Washington since leaving the White House. “Middle Class Joe” now resides in a 12,000-square-foot home in McLean, Virginia, that comes complete with “five bedrooms and 10 bathrooms, marble fireplaces, a gym and a sauna,” the report stated. The Bidens are renting the home, according to the Post, from multi-millionaire Mark Ein. Zillow estimates rent on the property would set Joe and Jill back almost $20,000 a month. According to property website Zillow, the mansion -- which was owned by President Ronald Reagan’s secretary of state, Alexander Haig -- is worth almost $5 million. BIDEN SLAMMED BY DEM RIVALS FOR HIGHLIGHTING ABILITY TO WORK WITH SEGREGATIONIST SENATORS In 2017, the Bidens also purchased a beach house in Rehoboth Beach, Delaware, for almost $3 million. Fox News contacted the Biden campaign for comment but has not received a response. The report came after the former vice president last week seemed to challenge the narrative building among some in his party when he argued it wasn't always appropriate to \"demonize\" rich people. \"I mean, we may not want to demonize anybody who’s made money,” Biden reportedly said during a New York City fundraiser with wealthy donors. According to Bloomberg, Biden seemed to knock Sen. Bernie Sanders', I-Vt., inclination toward \"revolution,\" saying that it wasn't the right way to improve economic well-being. DONALD TRUMP JR BLASTS JOE BIDEN, ASKS WHY HE DIDN'T 'CURE CANCER' IN LAST 50 YEARS “When you have income inequality as large as we have in the United States today, it brews and ferments political discord and basic revolution,” he said. He also pushed back on the view that wealthy people were \"the other\" in society and told them \"I need you very badly.\" CLICK HERE TO GET THE FOX NEWS APP “Remember, I got in trouble with some of the people on my team, on the Democratic side, because I said, you know, what I’ve found is rich people are just as patriotic as poor people,\" he also said. Biden, the clear front-runner in the primary battle, is leading Sanders and Sen. Elizabeth Warren, D-Mass., in the polls. The latter two were among the most prominent Democrats railing against Wall Street and large corporations while introducing sweeping economic reforms.",
      "date": "June 25",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Bret Baier on Round One for 2020 Dems: Joe Biden had a 'pretty good' night",
      "url": "https://www.foxnews.com/politics/bret-baier-on-round-one-for-2020-dems-joe-biden-had-a-pretty-good-night",
      "subtitle": "Bret Baier on Round One for 2020 Dems: Joe Biden had a 'pretty good' night",
      "author": "Julia Musto",
      "content": " The key takeaway from the first 2020 Democratic debate according to “Special Report” host Bret Baier? Former Vice President Joe Biden had a “pretty good night.” “He wasn’t mentioned once,” Baier told “America’s Newsroom” anchor Sandra Smith on Thursday. On Wednesday, ten Democratic presidential candidates took the stage in downtown Miami for the first of twelve debates in the 2020 election cycle. Another ten of their rivals will follow Thursday night. Baier also said candidate Julian Castro “really made a name for himself. For people who have not been following the race, he obviously had a town hall here on Fox News, but he came out of the shadows and was the most searched on Google as far as a candidate on the debate stage.” Castro has struggled for months to burst through in the crowded field. In addition, Baier told Smith, “The centrist approach that (former Democratic representative John) Delaney was laying out on health care got him applause in the hall. I think it would be interesting to watch Delaney if Biden somehow has a stumble, there may be a flight to safety as far as the Democrats looking for a center option. He’s a center option.”",
      "date": "June 27",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Mo Elleithee: Joe Biden won first night of 2020 Democratic presidential debate, though absent",
      "url": "https://www.foxnews.com/politics/joe-biden-2020-democratic-debate-elleithee",
      "subtitle": "Mo Elleithee: Joe Biden won first night of 2020 Democratic presidential debate, though absent",
      "author": "Charles Creitz",
      "content": " Despite being absent from the stage, former Vice President Joe Biden was one of the winners of the first night of 2020 Democratic presidential debates, according to Mo Elleithee. Biden remains at the front of the pack because no one criticized him on Wednesday, Elleithee claimed Thursday on \"Special Report.\" \"One of the biggest winners last night, honestly, was Joe Biden because no one touched him,\" he said. \"And while Warren had some good moments, Booker had good moments, Castro had a really good night, they helped themselves a bit, they didn't really change the overall contours of the race. 2020 DEMS CLASH ON 'MEDICARE-FOR-ALL,' IMMIGRATION AT DEBATE MARRED BY TECHNICAL DIFFICULTIES \"Biden is still the front-runner and no one challenged him last night.\" The former DNC communications director added it will be interesting to see how Biden is treated by fellow candidates when he is present on the stage Thursday evening in Miami. Elleithee said that one candidate who had a regrettable moment after his debate appearance was New York City Mayor Bill de Blasio. \"The best thing Bill de Blasio has going for him is that there's another debate in a couple of hours that's going to take all the headlines away,\" he said. LATE-NIGHT COMEDIANS MOCK BETO O'ROURKE FOR SPANISH DEBATE ANSWER: LIKE 'EMBARRASSING DAD AT A MEXICAN RESTAURANT' De Blasio was criticized for quoting Cuban revolutionary Che Guevara when he spoke at the Miami airport in support of striking union workers on Thursday. \"Hasta la victoria siempre,\" the mayor said while holding a microphone. He later apologized, tweeting he did not mean the comment in an offensive manner. CLICK TO GET THE FOX NEWS APP \"I did not mean to offend anyone who heard it that way. I certainly apologize for not understanding that history,\" he said. \"I only meant it as a literal message to the striking airport workers that I believed they would be victorious in their strike.\"",
      "date": "June 27",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Donna Brazile on Kamala Harris confronting Joe Biden: 'It's right to bring these issues up'",
      "url": "https://www.foxnews.com/politics/donna-brazile-joe-biden-debate-racial-justice",
      "subtitle": "Donna Brazile on Kamala Harris confronting Joe Biden: 'It's right to bring these issues up'",
      "author": "Anna Hopkins",
      "content": " Former Democratic National Committee Chair Donna Brazile responded Friday to presidential candidates Joe Biden and Kamala Harris sparring at Thursday night's debate over the vice president's voting history on civil rights issues. Biden drew criticism recently for lauding his work alongside known segregationist Sens. James Eastland and Herman Talmadge in the 1970s. Many politicians, including Sens. Harris and Cory Booker, criticized Biden for his comments and called on him to apologize. \"It is right to bring these issues up because we need to have a conversation, not just as Democrats but as Americans,\" Brazile said during an appearance on \"Fox and Friends\" on Friday morning. \"Whenever we have a conversation about race, people become uncomfortable,\" she continued. \"But I would try to encourage people to not look at it as a fight but more as a way to litigate how do we go forward, not just look backward.\" VAN JONES SAYS BIDEN'S RESPONSE TO KAMALA HARRIS ON WORKING WITH SEGREGATIONISTS WAS 'HEARTBREAKING' Biden's political history on civil rights issues has been a point of contention throughout his campaign, first after his support of the 1994 Crime Bill was publicly drawn into question, and later after his own admission that he \"got things done\" by working with segregationist senators by exercising \"civility.\" \"I think his long record and long history with dealing with many of our racial challenges from busing, equality, to voting rights, civil rights, Joe Biden has been on the forefront on racial justice issues,\" Brazile said. When asked about \"winners or losers\" of the first round of debates, Brazile said there's still too much that can happen before that can be determined. CLICK HERE TO GET THE FOX NEWS APP \"What we can determine is that the Democratic party is going to have a very, very long primary season where we are going to have debates each and every month until we choose our nominee,\" she said. \"If you think this is hotter than July wait until the next debate in July. It's going to get heated. You better put on your sunscreen,\" she continued.",
      "date": "June 28",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Hunter Biden didn't invite father, Joe, to his recent wedding: report",
      "url": "https://www.foxnews.com/politics/hunter-joe-biden-wedding-no-invite",
      "subtitle": "Hunter Biden didn't invite father, Joe, to his recent wedding: report",
      "author": "Joseph A. Wulfsohn",
      "content": " Hunter Biden did not send a wedding invitation to his father, former Vice President Joe Biden, who learned about the marriage by a phone call following the ceremony. The 49-year-old vice president's son detailed his new relationship with 32-year-old South African filmmaker Melissa Cohen, which began in early May and saw the two married days later, during an interview with the New Yorker. In the piece, Hunter recounted the conversation he had with his father, Joe, after the wedding had already taken place. \"I called my dad and said that we just got married,\" he said, according to the magazine. BIDEN'S CAMPAIGN FACING POSSIBLE FALLOUT FROM SON'S MESSY PERSONAL LIFE \"He was on speaker, and he said to her, ‘Thank you for giving my son the courage to love again.' And he said to me, ‘Honey, I knew that when you found love again that I’d get you back.’\" Biden said the two then shared a touching moment, with him telling his father: \"Dad, I always had love. And the only thing that allowed me to see it was the fact that you never gave up on me, you always believed in me.\" Hunter Biden was previously married to wife Kathleen for 23 years before their divorce in 2017. They had three children. The son of the former vice president made plenty of headlines in 2016 when he formed a reported affair with his sister-in-law Hallie Biden following the death of his brother, Beau Biden, who died of cancer. HUNTER BIDEN ACCUSED OF FATHERING CHILD WITH ARKANSAS WOMAN The interview comes after it was reported last month an Arkansas woman claimed Hunter is the father of her child. In the Arkansas case, Lunden Alexis Roberts, 28, filed a petition for paternity and child support against Hunter, stating that she gave birth to their child in August 2018. CLICK HERE TO GET THE FOX NEWS APP The woman wants the court to confirm that Hunter is the biological father and seeks child support and health insurance for the baby.",
      "date": "July 1",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Juan Williams: Joe Biden in 'big trouble' after CNN interview revelation",
      "url": "https://www.foxnews.com/politics/juan-williams-joe-biden-in-big-trouble-after-cnn-interview-revelation",
      "subtitle": "Juan Williams: Joe Biden in 'big trouble' after CNN interview revelation",
      "author": "Victor Garcia",
      "content": " Fox News's Juan Williams says former Vice President Joe Biden is in \"big trouble\" after the Democratic presidential frontrunner said he was wasn't ready for Sen. Kamala Harris' attacks during last week's debate. \"He gave the impression he wasn't ready to be challenged. ... If that's true, boy, that's big trouble. He should have known as the frontrunner, there were long knives ready for him,\" Williams said on \"The Five.\" BIDEN AND HARRIS CAMPAIGNS ENGAGE IN NASTY TWITTER FEUD OVER BUSING In an interview with CNN, Biden told host Chris Cuomo that he \"wasn't prepared\" for Harris' attack. “I was prepared for them to come after me, but I wasn’t prepared for the person coming at me the way she came at me. She knew Beau [Biden] and she knows me,” Biden told CNN. Williams praised the California senator for her performance. \"That's how other people are going to rise and challenge him as the frontrunner and that's exactly what Kamala Harris did, she took command of the stage and that's the reasons we have seen her jump ahead in the polls,\" Williams said. CLICK HERE TO GET THE FOX NEWS APP",
      "date": "July 5",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Charlie Hurt: Joe Biden has been 'part of the problem in DC for 50 years'",
      "url": "https://www.foxnews.com/politics/charlie-hurt-joe-biden-problem-dc-50-years",
      "subtitle": "Charlie Hurt: Joe Biden has been 'part of the problem in DC for 50 years'",
      "author": "Charles Creitz",
      "content": " Former Vice President Joe Biden constant push to become president has made him a big part of the problem with the federal government, according to Charlie Hurt. In his time in D.C., Biden's main focus has been trying to win his way to the Oval Office, Hurt claimed Tuesday on \"The Story.\" \"People forget Joe Biden has been part of the problem in Washington for nearly 50 years,\" he said. \"The entire time he's been in Washington, he's been trying to figure out how to become president. He's run a couple of times and it's been disastrous. BIDEN MAKES ANOTHER EYEBROW-RAISING CAMPAIGN PROMISE \"The closest he's ever gotten to the White House is when Barack Obama needed somebody that fit his description. It's a good reminder that he really is kind of bad at this.\" Looking at past elections, the Washington Times opinion editor added the current crop of more liberal Democratic candidates resembles a candidate from the 2004 presidential election. Hurt said many Democratic voters didn't like then-President George W. Bush, but instead of immediately coalescing around a centrist Democrat, they sought politicians like former Vermont Gov. Howard Dean. \"They ran off with Howard Dean for a long time, and then at the last minute they were reminded electability was the only thing they cared about, so they jumped into the arms of John Kerry,\" he said. \"Of course it didn't work out so well.\" CLICK TO GET THE FOX NEWS APP On the campaign trail, Biden recently raised eyebrows with his latest campaign promise -- this time, pledging to cut prison incarceration by \"more than\" 50 percent. Speaking with an ACLU member at a campaign event on in South Carolina over the weekend, Biden was asked about the initiative being headed by the organization to develop a \"roadmap for cutting incarceration by 50 percent.\" \"Do you commit to cutting incarceration by 50 percent?\" the man, who identified himself as an ACLU member, asked. \"More than that,\" Biden responded. \"We can do it more than that.\" Fox News' Joseph Wulfsohn contributed to this report.",
      "date": "July 9",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Karl Rove: Kamala Harris' hit on Joe Biden over busing wasn't as clean as we thought",
      "url": "https://www.foxnews.com/politics/karl-rove-kamala-harris-hit-joe-biden-over-busing",
      "subtitle": "Karl Rove: Kamala Harris' hit on Joe Biden over busing wasn't as clean as we thought",
      "author": "David Montanaro",
      "content": " Fox News contributor Karl Rove said Wednesday that former Vice President Joe Biden was \"smart\" to issue an apology for his comments on working in the past with segregationist senators. Biden delivered an apology Saturday to a mostly black audience of several hundred in Sumter, S.C. “Was I wrong a few weeks ago? Yes, I was. I regret it, and I’m sorry for any of the pain of misconception that caused anybody.” Rove said on \"America's Newsroom\" that Biden appears to have put the issue behind him and is still in a strong position in the polls after a forceful challenge from Sen. Kamala Harris at last month's Democratic debate. CNN’s FAREED ZAKARIA SAYS TRUMP WAS RIGHT ABOUT ASYLUM SYSTEM, 'PAINS ME TO SAY' FORMER DEMOCRATIC SEN. JOE LIEBERMAN: JOE BIDEN HAD NOTHING TO APOLOGIZE FOR The former White House deputy chief of staff under President George W. Bush argued that Harris, D-Calif., was trying to get in a \"cheap shot\" on Biden over his past opposition to forced busing. \"He got hammered in the debate, but then it turned out not to be as clean a hit as we thought,\" said Rove, noting that Harris' position on busing was essentially the same as Biden's. \"They're in favor of local busing. They're not in favor of the federal government dictating to local school districts whether they've got to bus or not.\" CLICK HERE TO GET THE FOX NEWS APP He went on to point out that Biden picked up valuable backing from influential African-American congressmen James Clyburn, D-S.C., and John Lewis, D-Ga., as well as the endorsement from Atlanta Mayor Keisha Lance Bottoms. \"My sense is that probably has stabilized him some,\" said Rove, noting that the RealClearPolitics polling average gives Biden a 12-point lead on Harris, who's in a tight three-way race for second with Sens. Bernie Sanders, I-Vt., and Elizabeth Warren, D-Mass.",
      "date": "July 10",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Biden drops to fourth among Iowa Democrats, new poll shows",
      "url": "https://www.foxnews.com/politics/biden-drops-to-4th-in-iowa-among-dems-new-poll-shows",
      "subtitle": "Biden drops to fourth among Iowa Democrats, new poll shows",
      "author": "Vandana Rambaran",
      "content": " A new poll of Iowa Democrats shows three 2020 candidates inching ahead of former vice president Joe Biden, signaling a tightening contest for the Democratic nomination. A Quinnipiac University poll released Wednesday showed 20 percent of voters support Sen. Elizabeth Warren, D-Mass., followed by 19 percent supporting South Bend, Ind., Mayor Pete Buttigieg, 17 percent for Sen. Bernie Sanders, I-Vt. and 15 percent for Biden. The poll has a 4.5 percentage point margin of error. Just three months shy of the Iowa caucus, Quinnipiac University Polling Analyst Mary Snow described the heated competition as \"a close race with a crowded field of frontrunners.\" \"While Senator Elizabeth Warren, former Vice President Joe Biden, and Senator Bernie Sanders have held top tier status in national polls for months, South Bend Mayor Pete Buttigieg joins their ranks in the 2020 Iowa caucus. And it's a race that is up for grabs. Half of likely Democratic caucus-goers who support a candidate say they may change their minds before Feb. 3,\" Snow added. AIRTIGHT PRIMARY RACE IN IOWA AS BUTTIGIEG BREAKS INTO TOP TIER: POLL Although Biden remains in the clear top tier of candidates, his slump in the polls both in Iowa and nationally has paved the way for other frontrunners to inch closer to him, and provide tight competition in the earliest primary states. Fifty-two percent of likely Democratic voters surveyed said they could still change their minds before the first nominating contest in the 2020 Democratic presidential primaries, while 46 percent of voters said their mind is already made up. The poll also showed that Sanders supporters were most committed to their chosen candidate, with 61 percent saying their minds were made up, compared to 48 percent of Biden voters, 44 percent of Warren voters and 40 percent of Buttigieg supporters. Of the Democratic caucus-goers polled, 33 percent said they are looking for \"someone who can win the general election.\" AYANNA PRESSLEY, IN BREAK FROM THE 'SQUAD,' BACKS WARREN FOR PRESIDENT \"Likely caucus-goers who selected electability as most important are divided in their top choice in the caucus, with Biden, Buttigieg, and Warren each getting 21 percent,\" Snow said. \"There is no one candidate with a clear edge.\" Democrats who described themselves as “very liberal” were divided between Sanders and Warren as their top picks, as they garnered 32 and 30 percent of the votes respectively. Those who describe themselves as “somewhat liberal” are divided between Warren at 29 percent and Buttigieg at 24 percent. Buttigieg and Biden won favor with “moderate and conservative” Democrats, polling at 19 and 18 percent respectively. Voters identified health care is the top issue in 2020, with 26 percent saying Sanders is strongest on the issue and 22 percent saying Warren. Both progressive candidates have largely agreed on the idea of a single-payer \"Medicare-for-all\" health care system, but have recently butted heads on how to fund such a plan. Thirty-five percent of Sanders supporters from the 2016 caucus say they still support him while 23 percent of his former voters say they now support Warren and 19 percent said they support Buttigieg. Biden had the backing of 27 percent of Hillary Clinton's 2016 caucus supporters, while 21 percent said they now support Buttigieg and 18 percent say they would vote for Warren. CLICK HERE FOR THE FOX NEWS APP The survey polled 698 likely Iowa Democratic caucusgoers between Oct. 30 and Nov. 5. Outside of the main contenders, Sen. Amy Klobuchar, D-Minn. got 5 percent of the vote, Sen. Kamala Harris D-Calif. got 4 percent, and businessman Tom Steyer, tech entrepreneur Andrew Yang and Rep. Tulsi Gabbard, D-Hawaii, each got 3 percent.",
      "date": "November 6",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Joe Biden takes indirect shot at Kamala Harris over her support for Medicare for All",
      "url": "https://www.foxnews.com/politics/joe-biden-shot-kamala-harris-medicare-for-all",
      "subtitle": "Joe Biden takes indirect shot at Kamala Harris over her support for Medicare for All",
      "author": "Paul Steinhauser",
      "content": " PORTSMOUTH, NH – Former Vice President Joe Biden says he has “pretty profound differences” with some of his top rivals for the Democratic presidential nomination race over the costs and consequences of Medicare for All. Biden, the current front-runner in the nomination battle, appeared on Friday evening to take a jab at Sen. Kamala Harris of California over a lack of straightforwardness on her support for Medicare for All. At the same time, he singled out Sen. Bernie Sanders for being honest about the ramifications of implementing the single-payer healthcare plan. BIDEN FACES PROTESTS DURING NH CAMPAIGN STOP OVER OBAMA-ERA DEPORTATIONS \"Bernie's been very honest about it. He said you're going to have to raise taxes on the middle class. He said it's going to end all private insurance. I mean, he's been straightforward about it. And he's making his case,\" Biden said after an impromptu gaggle with reporters following a stop at an ice cream shop in New Hampshire, the state that holds the first primary in the White House race. Sanders, the independent senator from Vermont who’s making his second straight bid for the Democratic nomination, has long pushed for Medicare for All. Sanders touts that under his proposal, premiums, co-payments and out-of-pocket expenses would be eliminated, but admits that taxes would increase. Biden is the only one of the top contenders who opposes the plan, in which all Americans would obtain their health insurance from a government operated program like Medicare. THE LATEST FROM FOX NEWS ON THE 2020 PRESIDENTIAL CAMPAIGN When asked if other Democratic White House hopefuls are as straightforward about their support for the single-payer system, the former vice president answered, \"well, so far, not. So far, not. They may.” Asked specifically by reporters if Harris has been honest about whether her version of Medicare for All would end private insurance, Biden answered, \"I'll let you guys make that judgment.\" Harris has said her plan would allow private insurance to continue to exist. But during last month’s first round of presidential primary debates, she raised her hand when the candidates were asked whether – if elected – they would eliminate private insurance. She later explained that she had misheard the question. In the pivotal moment of that debate, Harris went on the attack against Biden, as she criticized recent comments by the former vice president spotlighting his ability to find common ground during the 1970s with segregationist senators with whom he disagreed, and over his opposition decades ago to federally mandated school busing. Harris has seen her poll numbers soar in the wake of that nationally televised showdown, while Biden’s once big lead in the national and early primary and caucus voting state surveys has started to slip. At those debates, Sen. Elizabeth Warren of Massachusetts showcased her strong support for Medicare for All. Warren, along with Harris and two more White House contenders – Sens. Cory Booker of New Jersey and Kirsten Gillibrand of New York – co-sponsored the 2017 Medicare for All bill introduced by Sanders. But Biden has issues with the plan. \"I'm not saying that people will necessarily vote against it,\" he told reporters. But he added: “I think it gets hard to explain it and indicate how you're going to be OK; there's going to be nothing missing, as my mother would say, between the cup and the lip.\" Earlier, at a campaign event in nearby Dover, New Hampshire, Biden emphasized he would prefer to keep the Affordable Care Act, better known as Obamacare, but expand it by giving people an option to buy into a Medicare-like program. “Keep Obamacare. Restore the cuts that have been made, and add a public option,” he said to applause. “If you like your employer insurance, you get to keep it.” Biden, who served eight years as President Barack Obama’s vice president, infamously called Obamacare a “big f—king deal” during the bill’s White House signing ceremony in 2010. CLICK HERE FOR THE FOX NEWS APP Congressional Republicans for years tried unsuccessfully to repeal the government health care program. But Obamacare’s been severely weakened since GOP President Donald Trump succeeded Obama in the White House.",
      "date": "July 13",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Joe Biden hits Booker over Newark record, says he won't be 'polite' at next debate showdown",
      "url": "https://www.foxnews.com/politics/joe-biden-booker-newark-debate",
      "subtitle": "Joe Biden hits Booker over Newark record, says he won't be 'polite' at next debate showdown",
      "author": "Paul Steinhauser",
      "content": "  Former Vice President Joe Biden is turning up the volume on his criticism of presidential primary rivals ahead of next week’s second round of Democratic debates where he’ll be standing alongside two of his most vocal political foes. \"I'm not going to be as polite this time,” the front-runner in the nomination race told supporters at a fundraiser in Detroit on Wednesday evening. BIDEN PUSHES BACK AT BOOKER OVER MASS INCARCERATIONS And asked by Fox News on Thursday if he’ll be more aggressive in next week’s showdown, Biden smiled as he simply teased “we’ll see.” Biden already has started taking swipes at Sen. Cory Booker's record as Newark mayor, and pushing back at criticism from Sen. Kamala Harris. This, after Biden's once large polling lead over his 2020 rivals deteriorated following his less-than-stellar performance a month ago at the first round of Democratic presidential nomination debates, when he was cold-cocked by Harris. In the defining moment of that debate, the California Democrat criticized recent comments by the former vice president spotlighting his ability to find common ground during the 1970s with segregationist senators with whom he disagreed, and over his opposition decades ago to federally mandated school busing. Biden told reporters following his appearance on Wednesday at the annual NAACP convention that he \"was probably overly polite in the way I did respond to an attack\" in the first debate. The former vice president was anything by “overly polite” this week, as he forcefully pushed back against repeated attacks by another rival – Sen. Booker of New Jersey – over Biden’s role as a senator from Delaware in crafting the landmark 1994 crime bill. That legislation has been blamed by Booker, Harris, and many other Democrats for contributing to the mass incarceration of black people in the United States. THE LATEST FROM FOX NEWS ON THE 2020 PRESIDENTIAL CAMPAIGN After Biden earlier this week unveiled a new, wide-ranging plan to reduce the country’s prison population, reform the nation’s criminal justice system and eliminate racial and income disparities in sentencing – which would reverse the stricter sentence terms for crack versus powder cocaine that were implemented by the 1994 law – Booker took aim at the former vice president. The senator slammed Biden for being “the proud architect of a failed system\" and argued that the crime bill “put mass incarceration on steroids and so I'm disappointed that it's taken him so long to own up to that.” But Biden punched back at Booker's claim that he was the mass incarceration \"architect,\" telling reporters \"Cory knows that's not true.\" The former vice president then jabbed at his rival's record -- criticizing the stopping and frisking of black men by Newark police during Booker's tenure as the city's mayor. He added that during his years as vice president, \"the Justice Department took action against them, held the police department accountable. He (Booker) objected to federal interference.\" Booker disputed those allegations. Biden also turned up on the volume on his criticism of Harris over her support for \"Medicare-for-all.\" BIDEN TARGETS HARRIS OVER MEDICARE-FOR-ALL At the same time, he singled out another leading 2020 rival – Sen. Bernie Sanders of Vermont for being honest about the ramifications of implementing the single-payer health care plan. Sanders, the independent senator from Vermont who’s making his second straight bid for the Democratic nomination, has long pushed for \"Medicare-for-all.\" Sanders touts that under his proposal, premiums, co-payments and out-of-pocket expenses would be eliminated, but admits that taxes would increase. But Harris has said she would implement the plan without raising middle-class taxes. Biden – who’s the only one of the top contenders who opposes the plan, in which all Americans would obtain their health insurance from a government-operated program like Medicare – on Wednesday questioned her truthfulness. “I find that people will say they’re for Medicare-for-all but they're not going to tax the middle class because we don't need to do that. Come on. My point is this is a fantasy world here,” Biden emphasized. \"I think we should have an honest debate. Look, you can't go out and you can't run for president and beat Donald Trump without leveling with the American people about what you're going to do and how you're going to pay for it. I'm anxious for that debate,” he added. Biden won’t have to wait long. He'll be standing center stage on Wednesday night, surrounded by Booker on one side and Harris on his other side. Mo Elleithee, the founding executive director of Georgetown University's Institute of Politics and Public Service and a Fox News contributor, noted that there’s a lot on the line for Biden next week. Elleithee, a senior spokesman for Hilary Clinton’s 2008 presidential campaign who later served as communications director for the Democratic National Committee, said that “Biden needs to rebound. Biden needs to show people that last time was a fluke.” Biden's new aggressiveness on the campaign trail is a shift from the first two months of his campaign, when he rarely engaged with his rivals. Asked in early June if he would return fire, Biden told Fox News: “I think the worst thing we could do is get into a match where we’re going after each other in the Democratic Party. So I’m going to try my best not to be negative relative to my opponents.” And he said that “just like I’m not going to go down to Trump’s level when he starts his attacks, I’m not going to go down to anybody else’s level when they start attacks.” But he added he would respond at times to “set the facts straight.” He added, “I’ll respond to assertions. I’m not likely to go and point out what they’re doing.”",
      "date": "July 25",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Trump says ahead of debates he thinks 'Sleepy Joe' Biden will be 2020 Democratic nominee",
      "url": "https://www.foxnews.com/politics/trump-says-he-thinks-sleepy-joe-biden-will-be-2020-democratic-nominee-ahead-of-debates",
      "subtitle": "Trump says ahead of debates he thinks 'Sleepy Joe' Biden will be 2020 Democratic nominee",
      "author": "Brooke Singman",
      "content": " President Trump said Tuesday he thinks “Sleepy Joe” Biden will be the 2020 Democratic presidential nominee, just hours ahead of the second round of Democratic primary debates. “I think right now, I am watching, I think right now it will be Sleepy Joe, I think,” Trump said from the White House lawn on Tuesday. “I feel he’ll cross the line, so, what I think doesn’t mean anything, but I know the other people, I know him.” TRUMP SLAMS BIDEN AS 'WEAK MENTALLY,' AS POTENTIAL 2020 FOES STORM IOWA He added: “I think he’s off his game by a lot, but I think personally it’s gonna be Sleepy Joe.” Trump’s comments came as former Vice President Biden is enjoying an apparent rebound in the latest polls. Biden took a hit in the polls after the first round of debates in Miami, Fla. last month. Trump has been hurling insults at Biden for months, calling him “weak mentally” and repeatedly saying he hopes he will be the nominee. BIDEN SLAMS TRUMP AS 'EXISTENTIAL THREAT' Last month, Trump called Biden a “loser” and a “dummy.” But Biden hasn’t held back. He’s blasted the president as an “existential threat to America.” “This is a guy who does everything to separate and frighten people,” Biden said in a speech last month. CLICK HERE TO GET THE FOX NEWS APP Trump has also taken aim at Biden’s age, saying he “looks different than he used to” and is “even slower than he used to be.” Trump, 73, has said he would “easily” beat Biden in 2020. Biden is 76, but is not the oldest in the crowded Democratic primary field. Sen. Bernie Sanders, I-Vt., is 77.",
      "date": "July 30",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Bernie, Warren, Buttigieg, Biden knotted in N.H.",
      "url": "https://www.foxnews.com/politics/bernie-warren-buttigieg-biden-knotted-in-n-h",
      "subtitle": "Bernie, Warren, Buttigieg, Biden knotted in N.H.",
      "author": "Chris Stirewalt",
      "content": " **Want FOX News Halftime Report in your inbox every day? Sign up here.**\n\nOn the roster: Bernie, Warren, Buttigieg, Biden knotted in N.H. - Detroit Democrat does impeachment flip-flop-flip - Audible: How it’s done - The car that caught the dog\n\nBERNIE, WARREN, BUTTIGIEG, BIDEN KNOTTED IN N.H.\nBoston Globe: “A new Suffolk University/Boston Globe poll of likely New Hampshire Democratic primary voters shows a tight, four-way contest, with Senator Bernie Sanders of Vermont on top but statistically tied with Senator Elizabeth Warren of Massachusetts, Mayor Pete Buttigieg of South Bend, Ind., and former vice president Joe Biden. It has been decades since this many candidates have jostled for the lead so soon before a New Hampshire presidential primary. On Monday, longtime New Hampshire Secretary of State Bill Gardner officially scheduled the vote for Feb. 11. The survey found Sanders, who won the New Hampshire primary in 2016, leading the field with 16 percent, including those who lean toward the candidate. Warren had 14 percent, Buttigieg had 13 percent, and Biden had 12 percent. All other candidates, including former Massachusetts governor Deval Patrick, who jumped in the race this month, were in single digits. The poll suggested little about this race is set in stone.”\n\nSenior Biden staffer, Latina adviser quits campaign - Politico: “A senior Joe Biden campaign staffer in charge of outreach to Latino, African-American and women’s groups has quit her post, telling two allies she was frustrated over her lack of input and with the presidential candidate’s immigration rhetoric. Vanessa Cárdenas, the most senior Latina Biden staffer, had been serving as national coalitions director since the campaign formally announced its existence April 25. She resigned last week and has since changed her bio on Twitter to say she was ‘formerly with @joebiden.’ Cárdenas did not return a call or text message, but two friends familiar with her thinking told POLITICO that she felt the campaign wasn’t heeding her advice on immigration as she tried to reach out to Latino groups that have had longstanding concerns with the former vice president’s rhetoric and record stemming from the Obama administration.”\n\nBloomy’s low-key, high-dollar launch - NYT: “Michael R. Bloomberg started his campaign at a hushed diner in downtown Norfolk, Va. … before strolling to a nearby hotel ballroom and making an efficient statement before a bank of television cameras. Accompanied by a small platoon of aides, including two of his former deputy mayors from New York City and a security team that flitted around a downtown waterfront nearly barren of pedestrians, Mr. Bloomberg described himself as a political pragmatist skilled at wielding his wealth to win elections. … If Mr. Bloomberg’s first in-person appearance as a presidential candidate lacked something in organic political energy, he has already jolted the race through the sheer scale of his political spending, stunning the Democratic political establishment and stirring an outcry from the party’s populist wing.”\n\nDeval Patrick has a long way to go - Politico: “To call Deval Patrick’s campaign a shoestring operation would be insulting to shoestrings. Attend a Patrick event and there’s not a bumper sticker or pin to be found, let alone organizers with clipboards collecting names of would-be voters. His ground game looks to be nonexistent: The entire campaign appears to consist of a handful of volunteers and one publicly announced staffer, campaign manager Abe Rakov. In comparison, other campaigns have several hundred paid staffers and dozens of offices combined — and that’s just in New Hampshire. Patrick has spent the first dozen days of his campaign trying to persuade senior Democratic leaders in the early voting states to take him seriously. They want to give the former Massachusetts governor with an inspirational life story and friendship with Barack Obama the benefit of the doubt. But Patrick has a way to go before they fully buy in.”\n\nRyan Lizza: Waiting for Obama - Politico: “The post-presidency of Obama is unlike any other. Many presidents have had to navigate the tricky politics of leaving office when a president from the other party takes over. And plenty of presidents have had to grapple with the delicate situation of their vice president seeking a promotion. But Obama has to grapple with both situations simultaneously, and under unprecedented conditions: Obama is under near daily personal assault from the president, who has tweeted about him relentlessly in the past three years, often accusing him and his top officials of an array of crimes, a situation that no ex-president has faced or even imagined.”\n\nTHE RULEBOOK: IT’S IN THE DETAILS\n\n“THE erection of a new government, whatever care or wisdom may distinguish the work, cannot fail to originate questions of intricacy and nicety; and these may, in a particular manner, be expected to flow from the establishment of a constitution founded upon the total or partial incorporation of a number of distinct sovereignties.” – Alexander Hamilton, Federalist No. 82\n\nTIME OUT: PLEASE LEAVE A MESSAGE AFTER THE TONE\nSmithsonian: “In the spring of 1900, twenty-four years after Alexander Graham Bell introduced the telephone, a Danish inventor named Valdemar Poulsen unveiled the ‘telegraphone’ at the Exposition Universelle in Paris. It was an engineering marvel—Poulsen recorded sound on a wire using nothing but a magnet, similar to the principle that underlies computer hard drives—and it was a minor social miracle, an antidote to Bell’s constantly ringing telephone. The telegraphone was the world’s first answering machine. … Not everyone was overjoyed. AT&T, which held a monopoly on the U.S. phone system and forbid the use of third-party technology, suppressed the innovation for more than half a century, according to research by Mark Clark, a historian of technology. … A big concern was that the device would be used not just to answer calls but to record conversations. The American Telegraphone Company, which had attempted unsuccessfully to market the machine, claimed that AT&T feared the device’s ability to record calls.”\n\nFlag on the play? - Email us at HALFTIMEREPORT@FOXNEWS.COM with your tips, comments or questions.\n\nSCOREBOARD\n\nDEMOCRATIC 2020 POWER RANKING\nBiden: 27.6 points (no change from last wk.)\nWarren: 22.6 points (no change from last wk.)\nSanders: 17.6 points no change from last wk.)\nButtigieg: 7.6 points (no change from last wk.)\nHarris: 3.2 points (no change from last wk.)\n\n[Averages include: Monmouth University, NBC News/WSJ, ABC News/WaPo, Fox News and IBD.]\n\n\nTRUMP JOB PERFORMANCE \nAverage approval: 44 percent\nAverage disapproval: 52.6 percent\nNet Score: -8.6 percent\nChange from one week ago: ↑ 2.8 points\n\n[Average includes: CNN: 43% approve - 53% disapprove; NPR/PBS/Marist: 44% approve - 51% disapprove; Gallup: 43% approve - 54% disapprove; Monmouth University: 45% approve - 52% disapprove; NBC News/WSJ: 45% approve - 53% disapprove.]\n\nWANT MORE HALFTIME REPORT? \n\nYou can join Chris and Brianna every day on Fox Nation. Go behind-the-scenes of your favorite political note as they go through the must-read headlines of the day right from their office – with plenty of personality. Click here to sign up and watch!\n\nDETROIT DEMOCRAT DOES IMPEACHMENT FLIP-FLOP-FLIP\nDetroit Metro Times: “Rep. Brenda Lawrence [D-Mich.] is walking back statements she made about impeaching President Trump in an interview with Charlie LeDuff. In a written statement to Metro Times, Lawrence said she still supports impeaching Trump but censure may be a more viable option because of Republicans’ opposition to impeachment. ‘I was an early supporter for impeachment in 2017,’ Lawrence says. ‘The House Intelligence Committee followed a very thorough process in holding hearings these past two weeks. The information they revealed confirmed that this President has abused the power of his office, therefore I continue to support impeachment. However, I am very concerned about Senate Republicans and the fact that they would find this behavior by the President acceptable.’”\n\nPLAY-BY-PLAY\nJudge rules McGahn must comply with House subpoena - WaPo\n\nSupCo shields Trump’s financial records from House for now - WaPo\n\nTrump signs bill making animal cruelty a federal crime - Fox News\n\nTrump donates 3rd-quarter salary toward efforts to help nation’s opioid crisis - AP\n\nMortality rates skyrocket for Americans 25 to 34, drugs, alcohol, suicide key drivers - WaPo\n\nAUDIBLE: HOW IT’S DONE\n\n“Chris Wallace is a damn good reporter. He asked me a very direct question. He asked me about hacking the DNC computer. I heard him say I thought he'd said meddling in the election. Chris was right. I was wrong. So let me be clear. Russia hacked the DNC computer. I have no evidence whatsoever that Ukraine did it.” – Sen. John Kennedy, R-La., on “America’s Newsroom” taking a do-over for statements he made on “Fox News Sunday.”\n\nFROM THE BLEACHERS\n\n“Upon hearing yet another of Joe Biden’s continuing verbal gaffes, I’m reminded that when Gov. Rick Perry had ONE instance of ‘brain fade’ during a presidential debate, it did great damage to his campaign and his viability as a candidate. But when we hear Biden’s frequent brain fades, during debates and everywhere else, Democrats and the MSM shrug and say, ‘Oh that’s just good ol’ Uncle Joe.’  Doesn’t seem like a level playing field to me – what was levied against the goose ought to be levied against the gander. Short-term memory loss is often a fact of life as we age – OK, fine! But should someone who continuously exhibits those symptoms be in the most powerful position on the planet? Should that person be the commander-in-chief?” – Dave Wittnebert, Seneca, S.C.\n\n\n[Ed. note: I thiiiiink you may be shading the past in a favorable light for the former secretary of energy. Perry burst into the 2012 primary race as a frontrunner. When he declared in August of 2011 he was already running even with Mitt Romney. By mid-September, Perry was way out in front with a double-digit lead on his fellow former governor. But then the cracks started to show. Aside from some spectacularly bad political moves – dissing Iowa, feuding with the Bush family, etc. – Perry was a simply awful debater. One performance in September in which Perry tried to attack Romney for inconstancy turned into such a debacle that commentators openly wondered about his health. In October, Perry seemed to rally for a bit, but his steep descent had already begun. By the time of the “brain fade” you reference in November, Perry was tied for fifth and headed for the exits. When he couldn’t remember the third federal agency he had called to shutter – ironically, the one he would eventually lead – it was bad enough. But that he stood there vapor locking so long and then eventually said, Heaven help us, “Oops,” it wasn’t instant disqualification. It was the coda to a long symphony of Perry’s ill-conceived, poorly executed presidential campaign. (He would later reveal that the after effects of intense back surgery the summer before his entry had been worse than he had admitted.) Biden takes a lot of abuse for his rambling, discursive answers and the anxiety-inducing inability to land answers. But that’s been his thing for 40 years. Biden was a notorious blarney and bluster merchant when he first ran in 1988. So I don’t know how much of it is media bias or, as Perry did in his subsequent 2012 candidacy and federal service, what another former Texas governor might call “the soft bigotry of low expectations.”]  \n\n\n“I am puzzled by the whole quid pro quo/bribery charge against Trump for calling for an investigation of Biden. If the investigation showed that there was no wrongdoing, wouldn’t that benefit Biden and be detrimental to Trump? So, those who believe the President urging Zelensky to investigate Biden was bribery (i.e., a benefit to Trump for a granted favor) must assume the investigation would find that Biden is guilty of wrongdoing.” – Pat Conroy, West Lake Hills, Texas\n\n\n[Ed. note: Why would you ever, ever, ever want a sitting president to directly involve himself in a criminal or corruption matter involving his leading political rival? Instead, one would want the sitting president to keep himself as far removed from the process on that matter more than any except for those that might involve himself or those close to him. Members of the House may get the chance to decide whether what Trump did merits removal and they can debate the names they want to use for specific conduct. But that isn’t about whether Biden did or didn’t do the things Trump claims. The conduct at issue in Congress is about Trump involving himself personally and through his personal attorney in the process. Maybe think of it this way: police or judicial misconduct isn’t dependent on whether the suspect is guilty or not. The two issues are separable.]\n\nShare your color commentary: Email us at HALFTIMEREPORT@FOXNEWS.COM and please make sure to include your name and hometown.\n\nTHE CAR THAT CAUGHT THE DOG\nWPTV: “What dog doesn’t love a car ride? Better yet- a ride behind the wheel? Some Port St. Lucie neighbors watched a dog get the ride of a lifetime. It was stuck inside a car spinning in reverse for nearly an hour. Neighbors say the dog did not seem to mind at all. ‘I figured ‘how the heck did they manage to do that?’’ said neighbor Anna Sabol. Sabol said she looked out her window Thursday morning and a police car grabbed her attention. … She realized they were all responding to a grey sedan spinning in reverse in a cul-de-sac. The one occupant inside was a Black Labrador. … Police say the dog’s owner had briefly stepped out of the car when the dog somehow knocked the car into reverse. Police say they were able to stop the joyride by punching the passcode into the driver’s side door. But, not before the dog took out a mailbox, a trash can, and moved some bricks in front of a home. … Police say the dog was not hurt. No neighbors were hurt. … Instead, they say the dog seemed pretty happy about his first, and likely last, solo drive.”\n\nAND NOW, A WORD FROM CHARLES…\n\n“The sun rises regularly, too, but so often that we can't help being dulled to the wonder of its rhythm. And what rhythms, beyond that of the familiar year, really touch us?” – Charles Krauthammer (1950-2018) writing in the Washington Post on Dec. 13, 1985.\n\nChris Stirewalt is the politics editor for Fox News. Brianna McClelland contributed to this report. Want FOX News Halftime Report in your inbox every day? Sign up here.",
      "date": "2 days ago",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Lara Trump: Timing of Joe Biden accusations seems 'very convenient'",
      "url": "https://www.foxnews.com/politics/lara-trump-the-timing-of-the-biden-accusations-seem-convenient",
      "subtitle": "Lara Trump: Timing of Joe Biden accusations seems 'very convenient'",
      "author": "Victor Garcia",
      "content": " Trump 2020 senior campaign advisor Lara Trump expressed some suspicions that accusations of inappropriate touching against former Vice President Joe Biden happened to emerge on the cusp of his expected 2020 presidential announcement. “I don't know Joe Biden personally I've never met him. I don't really know his character but he's been in the public eye, Sandra, for so long that for all of a sudden the timing of this, it just seems very convenient,” Trump said on “America’s Newsroom.” \"If I were already in the race for the 2020 Democratic nomination I probably would not like to run against Joe Biden.” A number of women have accused Biden in recent weeks of inappropriate, unwanted touching. BIDEN SAYS HE'LL BE 'MORE MINDFUL ABOUT RESPECTING PERSONAL SPACE' SANDERS TEAM DENIES PUSHING BIDEN ACCUSER ALLEGATIONS Biden attempted to tamp down the controversy with a video in which he vowed to be \"more mindful about respecting personal space in the future.\" Trump told \"America's Newsroom\" she feels Biden needs to do a little more explaining but believes the former VP should receive the benefit of the doubt. “I take everything with a grain of salt these days because I know what it's like and our family knows what it's like better than anyone to have things said about you and you be accused of things and maybe it's not the full truth,” Trump said. She also addressed the president’s tweet featuring an edited video that poked fun of accusations against Biden. “We can always count on the president for a little comic relief and a little humor. I think he's having fun with it,” Trump said. When asked by co-host Sandra Smith if the accusations should disqualify Biden from running Trump left that up to Democratic voters. CLICK HERE TO GET THE FOX NEWS APP “I'll leave that up to the Democrat voters and they can decide,” Trump said. Fox News’ Paul Steinhauser contributed to this report.",
      "date": "April 5",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Trump unloads on Biden: ‘Joe is not playing with a full deck’",
      "url": "https://www.foxnews.com/politics/trump-says-hed-be-thrilled-if-biden-is-the-nominee-joe-is-not-playing-with-a-full-deck",
      "subtitle": "Trump unloads on Biden: ‘Joe is not playing with a full deck’",
      "author": "Adam Shaw",
      "content": " President Trump on Friday unloaded into Democratic 2020 frontrunner Joe Biden, saying he would be \"thrilled\" if the former vice president was his opponent next year and mocking him for his most recent gaffes on the campaign trail. “Look, Joe is not playing with a full deck,” Trump told reporters outside the White House. “He made that comment and I said 'whoa.'\" BIDEN SAYS 'POOR KIDS' JUST AS BRIGHT AS 'WHITE KIDS' IN LATEST GAFFE “This is not somebody you can have as your president, but if he got the nomination I’d be thrilled,” he said. Trump was responding to mistakes made by Biden on the campaign trail Thursday when he told a crowd in Iowa that “poor kids are just as bright and talented as white kids.” Biden quickly corrected himself after some applause from the crowd at the Asian & Latino Coalition PAC, and finished, “wealthy kids, black kids, Asian kids.” His campaign was also quick to respond to Trump’s zinger with one of its own on Friday. “Donald Trump’s deck is all jokers,” a campaign aide told Fox News. Trump has delighted in making fun of Biden for what he sees as Biden’s declining mental capacity. Earlier this week, responding to Biden comparing his rhetoric to that of former Alabama Gov. George Wallace, Trump said that Biden has “truly lost his fastball, that I can tell you.” On Friday, Trump kept returning to mocking the former Delaware senator, when he was asked about Democratic claims that he is a white nationalist. “They call anyone a racist that when they run out of cards...they've got candidates,” he said. “Joe Biden can’t answer a simple question, something's going wrong with him.” He then went on to make reference to the recent testimony of former Special Counsel Robert Mueller, who at times appeared to be struggling through the hearing at which he testified. “A lot of people think he's the one who wanted Bob Mueller to testify,” Trump said. “Because it made Joe look intelligent.” Fox News’ Brooke Singman and Edmund DeMarche contributed to this report.",
      "date": "August 9",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Biden still riding high",
      "url": "https://www.foxnews.com/politics/biden-still-riding-high",
      "subtitle": "Biden still riding high",
      "author": "Chris Stirewalt",
      "content": " **Want FOX News Halftime Report in your inbox every day? Sign up here.**\n\nOn the roster: Biden still riding high - GOP Sens. offer support for red flag, background bills - Mississippians head to the polls for primary day - Audible: Toni Morrison, R.I.P. - When your guilt ketches up to you\n\nBIDEN STILL RIDING HIGH \nFox News: “Former Vice President Joe Biden and Sens. Bernie Sanders of Vermont and Elizabeth Warren of Massachusetts remain the top three contenders in the first poll conducted in the first-in-the-nation presidential primary state of New Hampshire following last week’s Democratic nomination debates. But the Suffolk University survey for the Boston Globe released Tuesday also indicates a slip in support for Sen. Kamala Harris of California when compared with polls conducted prior to the debates. Biden stands at 21 percent among likely Democratic primary voters in New Hampshire according to the survey, with Sanders at 17 percent, Warren at 14 percent, and Harris at 8 percent. Biden stood at 23 percent in an average of the two live operator surveys – University of New Hampshire/CNN and Saint Anselm College – conducted in early to mid-July, before the debates. Warren averaged 18 percent, Sanders 15 percent and Harris 14 percent.”\n\nAugust heat will melt Dem field - Politico: “With two sets of debates and six months of fundraising finished, a new stage is opening in the Democratic presidential primary: The summer slog. For six weeks until the next debate, in mid-September, candidates will shift their focus more completely to the early primary states, grinding through a ritualistic run of picnics, forums, and party fundraisers: The Wing Ding, the Iowa State Fair, the Summer Sizzler, Londonderry’s Old Home Days. For the frontrunners, the rigors of a month full of intimate, often less scripted public appearances will present a significant test. But the weaker contenders will also come under considerable pressure. Some will likely begin running out of money or will fail to qualify for the next set of debates, culling the now-sprawling field.”\n\nHarris and Booker attended church where previously called gay sex a sin - The Mercury News: “Presidential candidates Kamala Harris and Cory Booker attended services this weekend at a Baptist church led by a pastor who’s called being gay a sin — ‘enough to send you to hell’ — and Bernie Sanders held a town hall at the church last month. It isn’t clear what the three presidential candidates — all staunch supporters of LGBTQ rights — knew about the Rev. Robert E. Fowler Sr.’s position on homosexuality when they campaigned at Las Vegas’ Victory Missionary Baptist Church, but his views are hardly a secret: A 2017 Las Vegas Review-Journal column about his perspective on gay rights shows up on the first page of results for a Google search of his name. … The visits to the church illustrate potential hazards as Democrats vie for voters in battleground states with more conservative views.”\n\nDem candidates compete to give away billions in taxpayer money - Fox News: “Candidates like Cory Booker, Marianne Williamson and Andrew Yang are among those pitching cash handout plans this election cycle. [Yang’s] plan is simple, on the surface: every American citizen over the age of 18 gets $1,000 every month. … The only major caveat for Yang's plan is that those receiving benefits such as welfare or disability would not be eligible… Booker, meanwhile, has his own proposal which he's already pursuing in Congress -- legislation to start a savings account for every American child when they're born. … Williamson’s platform includes a far more costly plan to pay between $200 billion and $500 billion over a 20-year period to black communities as reparations for slavery. She views that money as ‘payment of a debt that is owed’ due to ‘a great injustice that has never been dealt with.’”\n\nMike Gravel ends presidential campaign - USA Today: “Mike Gravel, a former U.S. senator and anti-war firebrand who launched an online-centric campaign for president, is officially wrapping up his quest for the White House. The Twitter account affiliated with Gravel's campaign on Saturday thanked staffers and supporters who had helped the 89-year-old former senator from Alaska raise his profile and eventually draw more than 65,000 donors to his campaign. ‘Of course, the true key has been the #Gravelanche itself, our incredible supporters and donors. Thank you from the bottom of our hearts,’ the account tweeted. Gravel is set to endorse Sen. Bernie Sanders' campaign, according to The Daily Beast.”\n\nTHE RULEBOOK: YOU GUYS ARE COOL, BUT… \n\n“The founders of our republics have so much merit for the wisdom which they have displayed, that no task can be less pleasing than that of pointing out the errors into which they have fallen.” – James Madison, Federalist No. 48\n\nTIME OUT: WHICH TRUTHS?\n\nHistorian David Wootton meditates on how our changing understanding of happiness bedevils modern humankind. Lapham’s Quarterly: “Thomas Jefferson lived in a world of slavery and pervasive inequality; he knew perfectly well that the world was not as it ought to be. But he believed, rightly, that a world in which people were free to pursue happiness would be one in which liberty would slowly spread, until all could benefit from it. What seemed evident to him would not have seemed remotely plausible to any educated person before the English Civil War. In 1690, [John Locke’s] arguments were still peculiar and pioneering; by 1776 they had become, as they still are for us, self-evident. … But there is an important difference between us and the founding fathers. They saw life, liberty, and the pursuit of happiness as the alternative to despotism and intolerance. We now can see that a society devoted to self-gratification may, in the end, destroy the conditions of its own existence.”\n\nFlag on the play? - Email us at HALFTIMEREPORT@FOXNEWS.COM with your tips, comments or questions.\n\nSCOREBOARD\n\nTrump job performance\n\nAverage approval: 42.4 percent\nAverage disapproval: 53.6 percent\nNet Score: -11.2 points\nChange from one week ago: down 2.8 points \n\n[Average includes: IBD: 40% approve - 56% disapprove; Gallup: 42% approve - 54% disapprove; Quinnipiac University: 40% approve - 54% disapprove; Fox News: 46% approve - 51% disapprove; NPR/PBS/Marist: 44% approve - 53% disapprove.]\n\nWANT MORE HALFTIME REPORT? \n\nYou can join Chris and Brianna every day on Fox Nation. Go behind-the-scenes of your favorite political note as they go through the must-read headlines of the day right from their office – with plenty of personality. Click here to sign up and watch!\n\nGOP SENS. OFFER SUPPORT FOR RED FLAG, BACKGROUND BILLS\nPolitico: “A shaken Sen. Rob Portman on Tuesday spoke out against white nationalism and expressed support for red flag laws, after horrific mass shootings over the weekend in Texas and his home state of Ohio. The Republican's endorsement of limited gun control comes one day after President Donald Trump called for such laws, which allow police and family members to block access to firearms for people who are an imminent threat to others or themselves. Sen. Lindsey Graham (R-S.C.) said Monday he would introduce legislation to encourage more states to adopt red flag laws…. Sen. Pat Toomey (R-Pa.) on Monday vowed to renew efforts to pass legislation with Sen. Joe Manchin (D-W.Va.) that would expand background checks after Trump called for similar legislation via tweet, though the president didn’t follow up on the call during a televised address several hours later. The Manchin-Toomey proposal failed in 2013 and 2015 and has little Republican support.”\n\nNRA infighting leaves group weakened - WaPo: “Fresh calls for gun control following massacres in two U.S. cities over the weekend are testing the resilience of the National Rifle Association at a time when the nation’s largest gun lobby is riven by leadership clashes and allegations of reckless spending. The NRA, which has blocked proposed restrictions after past mass shootings, including at Sandy Hook Elementary School in Newtown, Conn., has lost key veterans in recent months, including lobbyist Christopher Cox, who back-channeled with the White House and lawmakers during previous political crises. The NRA’s longtime advertising firm, which helped craft its hard-edge responses to past gun violence, is battling the organization in court. Last week, three NRA board members resigned, saying they were sidelined after demanding audits of the organization’s spending. Rank-and-file members are urging changes, while other gun rights groups are seeking to capi­tal­ize on the NRA’s struggles.”\n\nDavid Brooks: The other-ism - NYT: “Finally, pluralism is the adventure of life. Pluralism is not just having diverse people coexist in one place. It’s going out and getting into each other’s lives. It’s a constant dialogue that has no end because there is no single answer to how we should live. Life in a pluralistic society is an ever-moving spiral. There are the enemies of pluralism ripping it apart and the weavers of community binding it together. There is no resting spot. Its change, fluidity and movement all the way down. The terrorists dream of a pure, static world. But the only thing that’s static is death, which is why they are so pathologically drawn to death. Pluralism is about movement, interdependence and life. The struggle ahead is about competing values as much as it is about controlling guns and healing damaged psyches. Pluralism thrives when we name what the terrorists hate about us, and live it out.”\n\nMISSISSIPPIANS HEAD TO THE POLLS FOR PRIMARY DAY\nPolitico: “It's primary day in Mississippi, where voters will head to the polls to pick nominees for governor … The Democratic side is fairly straightforward: There’s more than a handful of candidates on the ballot, but state Attorney General Jim Hood is considered the prohibitive favorite. But the Republican primary is more competitive. Three candidates — Lt. Gov. Tate Reeves, former state Supreme Court Justice Bill Waller, Jr. and state Rep. Robert Foster — are all vying for the nomination. A recent Mason-Dixon poll in the state highlights the uncertainty: Reeves leads the other two men, but sits at 41 percent, below the simple majority required to avoid a runoff election. Waller is in second with 31 percent, and Foster is at the back of the pack at 13 percent. If no one clears 50 percent, there will be a runoff in three weeks. … [Despite Reeves many] endorsements — and a massive fundraising and spending advantage favoring Reeves — Waller is still hanging around.”\n\nPLAY-BY-PLAY\nJon Huntsman resigns as ambassador to Russia - Fox News\n\nSen. Ben Sasse announces 2020 re-election campaign - Roll Call\n\nEmbattled Rep. Duncan Hunter draws top-tier primary challenger - Politico\n\nAUDIBLE: TONI MORRISON, R.I.P.\n\n“She is a friend of my mind. She gather me, man. The pieces I am, she gather them and give them back to me in all the right order. It’s good, you know, when you got a woman who is a friend of your mind.” – Author Toni Morrison (Feb. 18, 1931-Aug. 5, 2019) writing the dialogue of Sixo, a character in her 1987 Pulitzer Prize-winning novel “Beloved.”  \n\nFROM THE BLEACHERS\n\n“You let the other, and equally important, side of the story of Charlottesville out of your otherwise outstanding synopsis of White Nationalism. Black Lives Matter and Antifa militants were approved by the Charlottesville authorities to stage a counter protest several blocks away from the White Nationalist rally. It was the BLM/Antifa group that ignored their lawful permit and left their designated area to engage the White Nationalists in racial combat. Had they cared about civility, they would’ve stayed within the area reserved for them and Charlottesville would’ve been an ugly local news footnote like Fountain Square in Cincinnati and numerous other places where the Klan, Aryan Brotherhood and others have marched and faded away. But, of course, it didn’t happen that way. The racial arsonists and the anarchists fought their battle. All three groups got their twisted need of coverage filled. Trump fumbled away his opportunity with a poor choice of words and the Left had a new clarion call. Because, in today’s polarized environment, these tiny, fringe of the fringe political movements are driving the narrative. They may represent .001% of our population but their influence is magnitudes greater. Expression of thought isn’t hate but translate the thought into action and it’s a crime against civility. Perpetrators of these crimes need to be fairly prosecuted to the fullest without the lens of left-right politics. Perhaps, if we can get the Country back to ‘fair and equal,’ then all the people can again believe they live under the best system on the Planet.” –Steve Aue, Brock, Texas\n\n\n[Ed. note: You make a worthwhile point about the cycle of attention seeking, Mr. Aue. But our discussion Monday was about white nationalism, not its competing radical ideologies. That was the topic because a white nationalist in El Paso, Texas slaughtered 20 Hispanic people in the name of that cause. I could have explored the back and forth between attention-seeking extremists, but I rather think that would have obscured the point and would have risked diluting the blame for the murders. Yes, there is a symbiosis between these militant groups, but that doesn’t lessen the moral judgement against white nationalism as a cause or mitigate the actions of the killer. On Monday, we were exploring how a media fixation on the president’s responses to murders by white nationalists obscures a more useful discussion about the movement itself and the roots racial violence in America today. I don’t think tarrying over the lack of civility by counter-demonstrators in Charlottesville would have been at all elucidating.] “It took you 20 paragraphs of regurgitation to get to the bottom line and tell America that our national illness can only be fixed from the bottom up. Indeed, Trump is a reflection of our problems, not the cause, yet you managed to regurgitate every negative you could to attribute white nationalism to him: YOU put fuel on a fire.” – Linda Harward, Crawford, Texas\n\n\n[Ed. note: As I perused your note, Ms. Harward, I had just finished reading about the Democratic outrage over a headline in today’s NYT: “Trump urges unity vs. racism.” The freak out was pretty remarkable, even for these freaked out times. The headline was certainly accurate, even if one doubts the president’s sincerity. It may have been too simplistic for a complicated story, but that’s life in big-league journalism. Not every headline is a winner. But the response was just, well, wild. One presidential candidate even suggested the Times was complicit in murder and another let fly with a string of obscenities about media coverage. Really profoundly stupid stuff. There is a powerful temptation to conflate coverage with causality in these polarized times. There is an even stronger impulse to shut out points of view that challenge our own worldviews or make us feel uncomfortable about our political choices. All of us, not just politicians, are obliged to resist these temptations.]  \n\n  \n“When the NRA has the [Senate majority leader], Mitch McConnell, in their pocket from the $1.2 million USD they have spent on his elections AND the [Senate majority leader], Mitch McConnell, refuses to let 2 Bi-PARTISAN gun reform bills that passed in the House 5 months ago get a vote on the Senate floor - it's really, really hard to believe it's a ‘bottom-up’ problem! The ‘it's us, not them’ suggestion doesn't hold water in this particular instance!” – Jill Rackiewicz Henderson, St. Paul, Minn.\n\n\n[Ed. note: It is true that the House did pass two bipartisan firearms bills. One would extend the waiting period from three days to 10 days for weapon sales when the federal background check system fails to deliver (as it sometimes does) another would require all firearm transfers to be subject to background checks, including private sales, family gifts, etc. A couple of thoughts here: Both bills have the same problem as many proposed in the wake of mass murders. Neither would have prevented the massacres to which they are offered as responses. That makes it harder to get lawmakers to back bills that come at a political cost. But also: How do you think McConnell’s constituents in Kentucky feel about gun control? Your suggestion here is that McConnell would back these bills or at least bring them out for a vote if it wasn’t for the donations of the National Rifle Association. I doubt it. The NRA is very powerful, or at least was until it its recent crack up, but that power isn’t from its contributions. McConnell will never want for money in any race, but he would face serious problems is the organization’s millions of members declared him an enemy. What makes the gun-rights activist community powerful isn’t its money but its members. I’m not suggesting that there is no federal part to play in addressing these killings. But I do believe that it is up to Americans to form a new consensus on these issues rather than partisan blame casting. That’s what we’ve been doing for 30 years and it has gotten us exactly nowhere.]   \n\n\n“Are you able to explain how the President is able to willy nilly make up new tariffs and screw with the entire economy without the consent of the Congress, please? Why is the legislative branch so weak when it comes to this area? Thanks!” – Katie Hacker, Evington, Va.\n\n\n[Ed. note: It’s pretty simple, Ms. Hacker: Congress gave away the power. In various pieces of legislation, particularly the Trade Expansion Act of 1962 and the Trade Act of 1974 and its successor legislation, Congress ceded its own authority to set tariffs to the executive branch. For example, when the president threatens new taxes on cars made by foreign manufacturers – including those assembled here – he is citing the 1962 legislation that grants him such power in order to protect “national security.” To Trump, winning the trade wars is a national security issue so, blammo, he’s got the power. This anguishes many Republicans, but they are deathly afraid of Trump, who has demonstrated his power repeatedly to punish dissent in his party. Many Democrats, meanwhile, secretly admire Trump’s protectionism and are unlikely to pipe up. The lesson for Congress, is that power is much more easily surrendered than reclaimed. Any decent custodian of Congress’ constitutional power should think first how a power ceded to the executive could be abused before considering how it might be used.]  \n\nShare your color commentary: Email us at HALFTIMEREPORT@FOXNEWS.COM and please make sure to include your name and hometown.\n\nWHEN YOUR GUILT KETCHES UP TO YOU\nNY Post: “She wouldn’t cut the mustard as a hardened criminal. A thief who swiped a bottle of ketchup from a New Jersey restaurant was so wracked with guilt — and suffering from bad karma — that she secretly returned to drop off two containers of Heinz. ‘I hope returning two new bottles will restore some [luck] for me, and I can stop carrying around this guilt,’ wrote the contrite condiment klepto in a note left with the ketchup outside a door at Perkins Restaurant & Bakery on Route 9 in Forked River. The thief — who workers at the eatery insist is a young woman, judging from her penmanship — admitted in the note that she had no good reason to steal from the Lacey Township restaurant. ‘A few weeks ago, I had taken one of your ketchup bottles off the table because for some odd reason I thought it’d be ‘risky,’’ said the note… The culprit didn’t leave a name but signed off with, ‘From, an awful person.’”\n\nAND NOW, A WORD FROM CHARLES…\n\n“Growing up (as I did) in the province of Québec, you learn not just the joys but also the perils of bilingualism. … Canada, of course, had no choice about bilingualism. It is a country created of two nations at its birth, and has ever since been trying to cope with that inherently divisive fact.” – Charles Krauthammer (1950-2018) writing in Time magazine on June 4, 2006.\n\nChris Stirewalt is the politics editor for Fox News. Brianna McClelland contributed to this report. Want FOX News Halftime Report in your inbox every day? Sign up here.",
      "date": "August 6",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Joe Biden confuses Burlington, Iowa, with Burlington, Vt., in latest gaffe",
      "url": "https://www.foxnews.com/politics/joe-biden-confuses-burlington-iowa-for-burlington-vt-in-latest-gaffe",
      "subtitle": "Joe Biden confuses Burlington, Iowa, with Burlington, Vt., in latest gaffe",
      "author": "Brie Stimson",
      "content": " Gaffe-prone Democratic 2020 frontrunner Joe Biden reportedly added another factual blunder to his list Friday. During a campaign fundraiser in his home state of Delaware, the former vice president was referencing a speech he had made to a group of 275 people, in which he accused  President Trump of \"fueling a literal carnage” in the country through his rhetoric. But Biden mistakenly recalled the location of the speech as Burlington, Vt., instead of Burlington, Iowa, according to The Washington Examiner. Whether Biden had Democratic rival Bernie Sanders -- a former mayor of Burlington, Vt. -- on his mind was not immediately known. GAFFE-PRONE BIDEN SHOULDN'T BE CLOISTERED, OBAMA AIDE SAYS: 'HE EITHER CAN CUT IT OR HE CAN'T' The mistake was the latest in a series of gaffes the 76-year-old Biden has made that have caused concern among some Democrats that's he's too old and prompted President Trump to say he isn’t “playing with a full deck.” Last week in Iowa, Biden said “poor kids” are just as smart as “white kids,” and last weekend he mistakenly said he met with survivors of the February 2018 Parkland, Fla., school shooting while vice president -- even though he had left office more than a year before the attack. He has also confused former British Prime Minister Margaret Thatcher for Theresa May twice since May. Biden’s press secretary told CNN the focus on Biden's blunders is a “press narrative, not a voter narrative.\" CLICK HERE TO GET THE FOX NEWS APP The candidate himself, however, appears to take his verbal slip-ups in stride. “I am a gaffe machine, but, my God, what a wonderful thing compared to a guy who can’t tell the truth,\" according to The Washington Post. Some Biden allies have suggested limiting his appearances due to the mistakes, the Examiner reported.",
      "date": "August 17",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Biden buoyed amid Trump attacks",
      "url": "https://www.foxnews.com/politics/biden-buoyed-amid-trump-attacks",
      "subtitle": "Biden buoyed amid Trump attacks",
      "author": "Chris Stirewalt",
      "content": " **Want FOX News Halftime Report in your inbox every day? Sign up here.**\n\nOn the roster: Biden buoyed amid Trump attacks - Giuliani’s woes mount - Trump legal team trashes Gowdy - Dems divided on timing of impeachment vote - ‘This is a nudge to pick up the fudge’\n\nBIDEN BUOYED AMID TRUMP ATTACKS\nFox News: “Together Joe Biden and Elizabeth Warren capture the support of more than half of Democratic primary voters, according to the latest Fox News national poll on the 2020 election. Biden stays on top in the race with 32 percent support among primary voters, up 3 points since September. He’s followed by Elizabeth Warren at 22 percent -- that’s up 6 points and a new high for her. Bernie Sanders is at 17 percent, down 1 point since last month. While Biden’s support has stayed between 29-35 percent since March, his current 10-point advantage is about half of his 19-point lead in June. The rundown continues with Kamala Harris at 5 percent, Pete Buttigieg at 4 percent, Beto O’Rourke at 3 percent, and Cory Booker, Amy Klobuchar and Andrew Yang each at 2 percent. Michael Bennet, Julian Castro, Tulsi Gabbard, Tim Ryan, Tom Steyer, and Marianne Williamson receive 1 percent apiece.”\n\nBiden’s firewall still strong - WaPo: “[Contrary] to the expectations of analysts, the fears of supporters and the hopes of rivals, Biden maintains a sizable loyal following. Nowhere is that more evident than in the African American community, recent interviews suggest, especially in states like South Carolina, which holds a crucial early primary. Martha Beck, a retired high school teacher from Charleston … gushed about Sens. Elizabeth Warren (D-Mass.) and Bernie Sanders (I-Vt.) but said Sanders is ‘too old and grumpy and he just shouts at people all the time.’ And she doesn’t think the same country that elected [Donald] Trump would put Warren, or any other woman, in the White House four years later.”\n\nWill any Dem dare mention the swampy stuff? - NYT: “It’s the one question about impeachment that no Democratic presidential candidate wants to answer head on. Should Joe Biden’s son Hunter have been allowed to sit on the board of a foreign company while his father served as vice president? In the past few weeks, Mr. Biden and his campaign team have spent significant amounts of time and energy denouncing any whiff of impropriety between his son’s work and his service as vice president. … So far, none of the Democratic primary candidates have taken a hard swing at Mr. Biden, focusing instead on the impeachment inquiry into Mr. Trump. But a few are, quite delicately, trying to raise some concerns. … In past debates, candidates who have taken on Mr. Biden’s personal characteristics, like his age, have faced blowback. The questions surrounding his son may be even more sensitive… Echoing an attack introduced and continually leveraged — in false ways — by Mr. Trump could risk raising Democrats’ ire.”\n\nJane Sanders takes starring role in husband’s campaign - NYT: “When it comes time to make critical decisions regarding his presidential campaign, Senator Bernie Sanders often relies on a committee of two: himself and his wife, Jane Sanders. … When doctors confirmed to her on Thursday that Mr. Sanders had suffered a heart attack, she said, it was her decision to wait until he was discharged the next day to release that information. And when it was time to say publicly that Mr. Sanders would be easing the pace of his campaigning after his heart attack, Ms. Sanders … stood beside him to explain the reason: His closest advisers, ‘especially me,’ had told him to slow down. … In a rare interview on Wednesday at their home in Burlington, Ms. Sanders said it would be ‘egotistical’ to call herself Mr. Sanders’s top adviser but allowed that she was ‘very much a close adviser.’ Above all, she said, she was ‘his wife.’”\n\nVoter intensity on both sides through the roof - Gallup: “A year before the 2020 presidential election, roughly seven in 10 Democrats and Republicans say they have given ‘quite a lot of thought’ to the election. About half of political independents have done so. The lack of a Republican-Democratic difference in thought given to the election is notable because Republicans usually have an advantage over Democrats, including in each of the past seven final presidential pre-election surveys, as well as in most surveys conducted throughout presidential election years historically. The current results are based on combined data from interviews with more than 2,400 U.S. adults aged 18 and older, conducted between Aug. 15 and Sept. 30, 2019. Gallup has measured thought given to the election since 1952, and it has shown a relationship to actual voter turnout among all Americans in past elections.”\n\nTHE RULEBOOK: CLOAK AND DAGGER \n\n“It seldom happens in the negotiation of treaties, of whatever nature, but that perfect SECRECY and immediate DESPATCH are sometimes requisite. These are cases where the most useful intelligence may be obtained, if the persons possessing it can be relieved from apprehensions of discovery.” – John Jay, Federalist No. 64\n\nTIME OUT: ‘A STATUE OF FLORENTINE BRONZE’\nParis Review: “In the late summer of 1866, a black equestrian stuntwoman made her Paris debut and galvanized the city. She was known only as ‘Sarah the African,’ and history has left us few traces of her: just some battered posters, inky clippings, and burlesque scripts. Sarah was, in the words of the men who wrote about her, ‘the finest horsewoman of the King of Morocco,’ ‘an Ethiopian,’ or ‘a statue of Florentine bronze.’ A ‘negress’ who performed as neither slave nor clown, whose name evoked Sarah Baartman, the Khoikhoi woman dissected by Georges Cuvier just a few decades before in Paris, and Selika, the queen heroine of Meyerbeer’s hit posthumous opera, L’Africaine. She was a woman named for a whole continent. … On her debut in September she was billed above Méphistophélès the bareback horse, above a race of forty horses all mounted by women, above the rubber horseman, William Meyer, and even above Mlle Adèle, who made her Sidy-Laraby dance with no reins.”\n\nFlag on the play? - Email us at HALFTIMEREPORT@FOXNEWS.COM with your tips, comments or questions.\n\nSCOREBOARD\n\nDEMOCRATIC 2020 POWER RANKING\nBiden: 28 points (↑ 1.2 points from last wk.)\nWarren: 26.2 points (↑ 3.4 points from last wk.)\nSanders: 14.4 points (↓ 1.6 points from last wk.)\nButtigieg: 5.4 points (↓ 0.6 points from last wk.)\nHarris: 4.2 points (↓ 1.4 points from last wk.)\n\n[Averages include: Fox News, Quinnipiac University, IBD, Monmouth University and NBC News/WSJ.]\n\n\nTRUMP JOB PERFORMANCE \nAverage approval: 42.8 percent\nAverage disapproval: 53.4 percent\nNet Score: -10.6 percent\nChange from one week ago: ↑ 0.4 points\n\n[Average includes: NPR/PBS/Marist: 45% approve - 51% disapprove; Fox News: 43% approve - 55% disapprove; NBC/WSJ: 43% approve - 53% disapprove; Quinnipiac University: 40% approve - 54% disapprove; IBD: 43% approve - 54% disapprove.]  \n\nWANT MORE HALFTIME REPORT? \n\nYou can join Chris and Brianna every day on Fox Nation. Go behind-the-scenes of your favorite political note as they go through the must-read headlines of the day right from their office – with plenty of personality. Click here to sign up and watch!\n\nGIULIANI’S WOES MOUNT\nABC News: “The business relationship between President Donald Trump's private lawyer Rudy Giuliani and the men charged Thursday in a campaign finance scheme is a subject of the ongoing criminal investigation being conducted by federal authorities in New York, according to two sources familiar with the matter. The investigation became public after the FBI had to quickly move to arrest Lev Parnas and Igor Fruman before they boarded a flight out of the country from Washington Dulles Airport with one-way tickets. They have been named as witnesses in the ongoing impeachment inquiry into President Trump. The investigation is being conducted by the FBI's New York field office and prosecutors in the Southern District of New York, the same U.S. Attorney's office Giuliani ran before he became mayor of New York.”\n\nFormer Ambassador to Ukraine cites Giuliani pressure campaign - AP: “Former U.S. Ambassador to Ukraine Marie Yovanovitch told lawmakers Friday that President Donald Trump pressured the State Department to oust her from her position. Yovanovitch said in an opening statement obtained by The Associated Press that she was ‘abruptly’ recalled in May and told the president had lost confidence in her. She said she was told by an official that there was a ‘concerted campaign against me’ and that Trump had pressured officials to remove her for almost a year. ‘Although I understand that I served at the pleasure of the president, I was nevertheless incredulous that the U.S. government chose to remove an ambassador based, as best as I can tell, on unfounded and false claims by people with clearly questionable motives,’ Yovanovitch wrote in the statement.”\n\nReport: Trump pushed Tillerson to help a Giuliani client - WaPo: “President Trump sought to enlist then-Secretary of State Rex Tillerson in the fall of 2017 to work with Rudolph W. Giuliani to help stop the prosecution of a Turkish Iranian gold trader represented by the former New York mayor, according to people with knowledge of the request. Trump urged Tillerson in an Oval Office meeting to try to craft a diplomatic ‘deal’ to stop the U.S. case against Reza Zarrab on corruption charges in exchange for concessions from Turkey. The request shocked the then-secretary of state, said the people, who spoke on the condition of anonymity to describe private conversations involving the president. At the time, Turkish President Recep Tayyip Erdogan was personally lobbying Trump to get the charges dropped. Trump, in turn, repeatedly raised the topic with Tillerson — including directly in the Oval Office meeting, according to people with knowledge of the episode.”\n\nPete Session’s political revival threatened by Ukraine role - NYT: “Former Representative Pete Sessions, a Texas Republican who is seeking a return to Congress, was caught in the fallout of the Ukraine scandal on Thursday when he was referred to in the indictment of two presidential allies accused of campaign finance allegations. Mr. Sessions, who served 11 terms in Congress until he was swept out last year, is described as ‘Congressman-1’ in the indictment of Lev Parnas and Igor Fruman, who were arrested and charged on Thursday with illegally funneling foreign money to American political candidates and campaigns. The two men are associates of Rudolph W. Giuliani… Mr. Sessions’s appearance in the indictment, which was filed just a week after he announced he would run for Congress in 2020, was an early and potentially damaging blow to his campaign. Mr. Sessions is not named in the indictment, nor is he accused of any wrongdoing. On Thursday, he issued a statement that denied any wrongdoing and said he had no knowledge of the scheme detailed by federal prosecutors.”\n\nContinetti: We are all Ukrainians - Free Beacon: “From Varsity Blues to Jeffrey Epstein, from China and the NBA to Ukraine and Hunter Biden, Americans are taking a crash course on the ways in which powerful people manipulate the system for personal advantage and globalization merges political cultures as well as economies. What has been uncovered as impeachment rolls on does nothing to spur confidence in the integrity of our system. America is exceptional, but our elites are not. Today we are all Ukrainians.”\n\nTRUMP LEGAL TEAM TRASHES GOWDY\nYahoo: “The president’s decision to bulk up his legal team with former South Carolina Rep. Trey Gowdy amid a widening impeachment inquiry is drawing criticism from one of his high-profile supporters. On Wednesday morning, the day after news leaked that Gowdy was set to serve as outside counsel to the president, Victoria Toensing, a veteran Washington lawyer who has been working with Trump’s personal attorney, Rudy Giuliani, expressed concern and disbelief that the onetime advocate for congressional oversight would be coming onboard. ‘Trey Gowdy doesn’t know s***,’ she said. … ‘He screwed up the Benghazi hearings, and he came out with the advice to Trump, ‘Well, if you’ve done nothing wrong, just talk to Bob Mueller.’’ Toensing and her husband, Joe diGenova, work with Giuliani though they are not officially on Trump’s legal team.”\n\nAnd he can’t even join until January - WashEx: “Former Republican Congressman Trey Gowdy cannot join President Trump's legal team until early next year, the president announced Thursday. Speaking to reporters on the South Lawn of the White House, Trump said, ‘Trey Gowdy is a terrific guy. I think there’s a problem with, he can’t start for another couple of months because of lobbying rules and regulations.’ It was only a day after Jay Sekulow, counsel to the president, announced Gowdy had joined the team to assist with the response to the House Democrats' impeachment inquiry. … Gowdy, 55, is a former federal prosecutor who retired from Congress on Jan. 3 after representing the 4th Congressional District of South Carolina for four terms. He then rejoined his old white-collar law firm, Nelson Mullins Riley & Scarborough. Despite his return to the legal profession, federal law prevents Gowdy from taking on Trump as a client in the impeachment fight until Jan. 3, 2020.” DEMS DIVIDED ON TIMING OF IMPEACHMENT VOTE\nPolitico: “House Democrats are grappling with whether to take more steps to formalize their impeachment inquiry and silence a chief Republican criticism of their efforts, with competing factions beginning to emerge. President Donald Trump and his allies on Capitol Hill have hammered Speaker Nancy Pelosi for not holding a vote authorizing the House’s impeachment proceedings — arguing that without a vote, the entire process is illegitimate. Pelosi has refused to cave, dismissing Trump’s demand last week and insisting it is not required under the Constitution or House rules. And allies close to the speaker say her position hasn’t changed, describing the idea as the latest ‘Republican canard’ in a series of stall tactics the GOP will employ to protect Trump. … Yet some Democratic lawmakers and aides have begun to say privately — and, to a lesser extent, publicly — that the House should just vote to formalize the inquiry, robbing the GOP of its main talking point. The debate is threatening to cleave Democrats’ unified front as the White House makes the arcane procedural arguments the centerpiece of its impeachment defense.”\n\nHouse members get an earful from voters back home - Politico: “The ‘Make America Great Again’ hats were in the front row Thursday night at freshman Rep. Anthony Brindisi’s first town hall event since Speaker Nancy Pelosi blessed an impeachment inquiry against President Donald Trump. But for all the criticism the centrist Democrat faced from pro-Trump voters, the sharper questions came from his own supporters about why he is one of just seven in his caucus who has refused to endorse the impeachment push. … Swing-district Democrats doggedly avoided the impeachment debate when they first got to Washington. Now they can’t avoid it. … But at dozens of town halls over the two-week recess, Brindisi and other vulnerable freshmen had to fend for themselves — serving as the party’s on-the-ground voices on impeachment. Whether they can deliver a message that resonates could determine Democrats’ chances of winning over the public and holding on to their seats and the House majority in 2020.”\n\nIndependents’ support for impeachment jumps 10 points - NPR: “A slim majority of Americans now approve of the Democratic House-led impeachment inquiry into President Trump, a new NPR/PBS NewsHour/Marist poll finds. Fifty-two percent say they approve of the inquiry, while 43% disapprove. That's a slight increase in support from two weeks ago, when 49% approved and 46% disapproved. The numbers are in line with other polls that have been released this week also showing majority support or an increase in support for the inquiry. The uptick in support in the NPR poll comes mostly from a swing among independents. In late September, more independents disapproved of the inquiry than approved, by a 50-44% margin. Now, in a reversal, more independents approve of the inquiry than disapprove, by a 54-41% margin, a net change of 19 points. On the questions of whether Trump should be impeached or removed from office, Americans are split — 49-47% in favor of impeachment and 48-48% on whether the Senate should vote to remove him.”\n\nROMNEY STEPS UP HIS ROLE FOR GOP\nPolitico: “President Donald Trump wants to sideline Mitt Romney — but the Utah senator isn’t having it. Even as he faces a barrage of attacks from the president and his allies, Romney is mapping out plans to play a central role in 2020 — headlining party events, shelling out cash from his campaign war chest, and hitting up his donor network for vulnerable senators on the ballot next year.Later this month, Romney will take his most aggressive step yet to insert himself into the 2020 campaign when he hosts a New York City fundraiser for Maine Sen. Susan Collins, Colorado Sen. Cory Gardner and Michigan Senate hopeful John James. All are establishment-aligned figures confronting tough races in swing states. Behind the scenes, Romney’s team has also begun directing his donors to help GOP candidates in Senate battlegrounds. Romney aides say he's always intended to help in competitive Senate races and that his desire to do so has never been influenced by Trump’s efforts to ostracize him.”\n\nDems eye Chelsea Clinton for New York House seat - NYT: “Ms. [Nita] Lowey’s announcement set off a wave of speculation about other potential contenders, including Chelsea Clinton, the daughter of former President Bill Clinton and Hillary Clinton, as well as a state assemblyman, David Buchwald. Last year, when asked if she envisioned running for elected office, Chelsea Clinton told The Journal News, which covers the Hudson Valley, that ‘if someone were to step down or retire,’ she would ‘have to think if it’s the right choice for me.’ Ms. Clinton did not mention any particular office, although she is clearly familiar with Ms. Lowey’s district: Her parents’ house in Chappaqua, N.Y., is in the district. Ms. Clinton herself does not live in Westchester, but congressional candidates are not required to live in the district they represent. A representative for Ms. Clinton did not return a request for comment. Mr. Buchwald said he would make an announcement within a few days.”\n\nOcasio-Cortez draws credible primary challenger - Fox News: “A prominent New York City Democrat filed with the Federal Election Commission (FEC) Thursday to launch a primary challenge for the House of Representatives seat currently held by Rep. Alexandria Ocasio-Cortez, D.-N.Y. City Council member Fernando Cabrera said he believes a moderate Democrat such as himself could beat the socialist Ocasio-Cortez. He plans to target her far-left views and highlight his belief that she is a ‘no show’ in the district. ‘Only a Democrat is going to be able to defeat her, and it’s going to be a moderate Democrat,’ Cabrera, who represents a Bronx City Council district, told Politico. ‘She’s a no-show in the district. She hasn’t brought about anything except division within the party.’ ‘Socialism doesn’t work,’ Cabrera added.”\n\nPompeo ally steps aside in Kansas Senate race - The Wichita [Kan.] Eagle: “A Kansas business leader with longtime ties to Mike Pompeo will not run for U.S. Senate after weighing a bid for months — renewing speculation about whether the secretary of state will enter the race. Alan Cobb, the president and CEO of the Kansas Chamber of Commerce, in the past has said he would defer to Pompeo if the chief diplomat decided to mount a campaign. Cobb, a former Koch Industries lobbyist, advised Pompeo in 2014 during a congressional primary battle against former Rep. Todd Tiahrt. He made no mention of Pompeo in a lengthy statement Thursday announcing his decision. Cobb said that ‘after months of serious deliberation, analysis, and careful and prayerful consideration with friends, colleagues and my family, I have decided that the best place for me to pursue my passion is to remain as the President and CEO of the Kansas Chamber.’”\n\nPLAY-BY-PLAY\nIt was the foreign policy he promised, but Trump still pays price - NYT\n\nLocations and dates for 2020 general election debates announced Friday - CPD Judges rule in favor of House Dems seeking Trump’s tax returns - NYT\n\nRead this: The pen pal who changed a president - Narratively\n\nReese’s dominates Halloween candy favorites poll- Monmouth University\n\nAUDIBLE: YOU DO YOU\n\n“Well, I’m going to assume it’s a guy who said that… And I’m going to say, then just marry one woman. I’m cool with that. If you can find one.” – Sen. Elizabeth Warren’s answer during CNN’s Equality Town Hall on Thursday night, when asked what she would say to a supporter who believes marriage is between one man and one woman.\n\nANY GIVEN SUNDAY\n\nThis weekend Mr. Sunday will sit down with Sen. Chris Van Hollen, D-Md. Watch “Fox News Sunday with Chris Wallace.” Check local listings for broadcast times in your area.\n\n#mediabuzz - Host Howard Kurtz has the latest take on the week’s media coverage. Watch #mediabuzz Sundays at 11 a.m. ET. \n\nFROM THE BLEACHERS\n\n“I need your help. I don’t get what is going on with the Syria/Turkey situation. I understand the following: Trump has proclaimed that he is pulling troops from Syria after what has been a long involvement (partnering) with the Kurds. But, that doesn’t happen overnight, right? Once Trump announced the pulling of troops, Turkey is waiting on the sideline frothing at the chance to attack. They then attack, even with threats from Trump that they better not or there will once again be sanctions. Now the number of Kurds killed are rolling in, but are our troops still there? If they are, what are they doing? Is there something that Trump picked up on that is going on with the Kurds? The conspiracist side of me thinks he sniffed something out. My husband is an Iowa farmer and I work in crop insurance. We don’t have many ties to the military but sure understand how government a lot of the time just doesn’t make sense. Any insight would be appreciated.” – E’Lise Bracker, Underwood, Iowa\n\n\n[Ed. note: No conspiracy here, Ms. Bracker. The number of U.S. troops in the disputed area was very small – measured in dozens. They were not a credible threat in terms of actually combating Turkey’s forces but rather something of a marker. By having the troops there, we were telling the Turks to stay out and leave our Kurdish allies alone. It was a small-scale version of the U.S. forces in South Korea: To fight, the Turks would have had to kill Americans, thereby bring our military down on their heads. Upon the president’s order, the U.S. troops were quickly out of the Turks’ zone of aggression. The Americans went to Iraq and other U.S. spots in the region, clearing the way for the Turks to start pummeling their ancient Kurdish enemies.] \n\n\n“I am a huge fan of the Halftime Report and never miss it! Your struggle to remain fairly balanced is appreciated, especially by this reader who also struggles mightily to find truth and facts amid the bias and innuendo currently being passed off as ‘news.’  But I am confused by most of the polls' questions (especially the polls you quote) that seem to ask a compound question: Do you favor impeachment and removal of President Trump? I was under the impression that these are two distinct question.  That impeachment is like a grand jury investigation, i.e. a procedure (in the House) designed to decide whether there are grounds for a trial (by the Senate) to decide if removal is warranted or not. Am I wrong?  Please explain!  And keep up the good work!!!” – Tom Scherer, Udon Thani, Thailand\n\n\n[Ed. note: This is an excellent question, Mr. Scherer! Different pollsters do indeed ask these questions in different ways. The complexity of the situation is partly to blame. An “impeachment inquiry” is not a thing. It’s like a couple being “pre-engaged.” But some pollsters have been asking about it, which tends to screw things up. Getting respondents to differentiate between an “impeachment inquiry” and “impeachment” is quite a lot of hair-splitting for civilians. Our poll does it the right way (obvi) and asks whether voters support impeachment, impeachment and removal or no impeachment. Those are the three constitutional possibilities. In our poll, 4 percent of respondents said they wanted the president impeached but not removed. That adds up to 55 percent favoring impeachment and 51 percent favoring removal.]\n\n\n“All my teams have long gone home for the winter. So now we have your traditional Nine in the form of the quite surprising Cardinals playing your hometown Nationals (who should be the Senators and in the American League with Walter Johnson throwing flames, but oh, well). Where do your loyalties lie?” – Mary Carol Miller, Greenwood, Miss.\n\n\n[Ed. note: Hometown!? Washington, D.C.!? My place of residence, certainly. And I do love living here. But c’mon, Doc! My hometown is Wheeling, W.Va. and the Cardinals, whose order I lustily joined as a boy when my family moved to St. Louis for four years, are my baseball team. I admire the Nats’ pluck and am grateful for the chance they are affording me to watch the National League Championship Series in person. But I love the Cardinals and am absolutely over the moon with this year’s squad. What a bunch! The infield alone may be the greatest since my glory days of fandom in the mid-1980s. Matt Carpenter is an absolute rock for the team and the personification of professionalism, Paul DeJong is a clutch player (whoever heard of a slugger shortstop?) who seems like he was born to be a Cardinal, Kolten Wong surfs second base like the pros ride waves at Honoli’i in his hometown and Paul Goldschmidt has shown in his tenacity, play and quality of his character that he is truly in the right uniform. And Yadi is nothing less than a national treasure. So suffice it to say: Viva el Birdos!]        \n\n\n“How ‘bout them Redbirds! We miss you on Twitter where we could delight in the pure joy emanating from Cardinals gifs, memes, and tweets after a playoff series win…but the mailbag will have to do!” – Jack Whiteman, St. Louis\n\n\n[Ed. note: *fredbird waving giant flag gif*]\n\nShare your color commentary: Email us at HALFTIMEREPORT@FOXNEWS.COM and please make sure to include your name and hometown.\n\n‘THIS IS A NUDGE TO PICK UP THE FUDGE’\nAP: “Officials in a southwest Missouri city are planting small flags in piles of abandoned dog poop as part of a campaign to get residents to clean up after their pets downtown. The Police Department in Springfield, Mo., posted photos of the flags in use on its Facebook page Wednesday. The flags contain messages such as, ‘Is this your turd? ‘Cuz that's absurd’ and ‘This is a nudge to pick up the fudge.’ The campaign started this week and the department noted on Facebook that leaving behind a pet's mess in many cases violates a city ordinance. The city's Environmental Services said the flags are made of bamboo and recycled paper and downtown crews will pick them up if they have to clean up pet waste.”\n\nAND NOW, A WORD FROM CHARLES…\n\n“The whole debate arouses dismay, and not just because of the overreaching claims of both sides. One has an instinctive feeling that religion has a place in American public life, and that both sides misunderstand it—that between sectarianism and secularism lies something else.” – Charles Krauthammer (1950-2018) writing in the New Republic on April 9, 1984.  \n\nChris Stirewalt is the politics editor for Fox News. Brianna McClelland contributed to this report. Want FOX News Halftime Report in your inbox every day? Sign up here.",
      "date": "October 11",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Why the media are convinced Joe Biden will implode",
      "url": "https://www.foxnews.com/politics/why-the-media-are-convinced-joe-biden-will-implode",
      "subtitle": "Why the media are convinced Joe Biden will implode",
      "author": "Howard Kurtz",
      "content": " Well, Joe Biden didn't exactly clear the field. I don't think it matters much that Biden waited until Thursday to become the 20th Democrat vying for the nomination, even though it exposed him to weeks of attacks while he seemed to be dithering on the sidelines. A much greater warning sign, in my view, is the largely negative tone surrounding his debut. He is, after all, a former vice president, highly praised by Barack Obama, who has consistently led in the early primary polls, and is beating President Trump in head-to-head matchups. Yet much of the press is acting like he's an old codger and it's just a matter of time before he keels over politically. This is all the more remarkable in light of the fact that the vast majority of journalists and pundits know and like Joe Biden and his gregarious personality. The reason is that Biden, after a half-century in politics, lacks excitement, and the press is magnetically attracted to novel and unorthodox types like Beto and Mayor Pete. You don't see Biden on the cover of Vanity Fair, and a grind-it-out win by a conventional warrior doesn't set journalistic hearts racing. JOE BIDEN ANNOUNCES 2020 PRESIDENTIAL BID: 3 THINGS TO KNOW ABOUT THE FORMER VICE PRESIDENT For many in the media, Biden isn't liberal enough, at least not for the post-Obama era. He doesn't promise free college and free health care and has a history of working with Republicans, such as John McCain (whose daughter Meghan loves him and will host him on \"The View\" Friday.) What's more, Biden's campaign style — speak at rallies, rack up union endorsements — seems hopelessly old-fashioned when we measure popularity by Instagram followers. News outlets are predicting he'll have trouble getting in the online fundraising game, leaving him reliant on big donors, which used to be standard practice. And then there's the age thing. Biden would be the oldest president to be inaugurated, at 78, and he looked a step slow in encounters with reporters Thursday and a few weeks ago. But what if the journalists are in something of a Twitter bubble, and the actual Democratic Party is much more moderate? We saw that with the spate of allegations by women of unwanted touching, which dominated news coverage until polls showed that most Dem voters weren't concerned. In that wider world, the Scranton guy's connection to white, working-class voters could help him against Trump in the industrial Midwest. SUBSCRIBE TO HOWIE'S MEDIA BUZZMETER PODCAST, A RIFF OF THE DAY'S HOTTEST STORIES Biden denounced the president's term as an \"aberrant moment\" in his launch video, saying four more years would damage the country's character and \"I cannot stand by and watch that happen.\" But first, he'd have to win the nomination in the face of an unenthusiastic press corps. A New York Times news story said Biden would be \"marshaling his experience and global stature in a bid to lead a party increasingly defined by a younger generation that might be skeptical of his age and ideological moderation.\" The Washington Post quoted Democratic strategists as saying that Biden faces an \"uphill battle\" and \"isn't necessarily the heir apparent to Obama, despite being his No. 2 in the White House for eight years. They argue voters will judge Biden by the span of his decades-long career and are worried the veteran pol hasn't yet found a winning formula for his own candidacy.\" The liberal Slate said the ex-veep's rivals view him as a \"paper tiger\": \"Biden is something more like a 2016 Jeb Bush: a weak establishment favorite whose time might be past ... Biden's biggest challenge in the primary will be a compromised past spanning nearly 50 years.\" \"Compromised\" suggests a history of scandal, yet what Slate means is political baggage, such as his backing of a Clinton-era crime bill unpopular with black voters today. Yet I think the rank and file isn't as concerned about a vote back in 1994, or even the Anita Hill hearings, as the chattering classes. BIDEN'S SENATE RECORD, ADVOCACY OF 1994 CRIME BILL WILL BE USED AGAINST HIM, EX-SANDERS STAFFER SAYS One of the few left-leaning pundits to suggest the press is underestimating Biden is data guru Nate Silver at 538: \"Media coverage could nonetheless be a problem for Biden. Within the mainstream media, the story of Biden winning the nomination will be seen as boring and anticlimactic. That tends not to lead to favorable coverage. Meanwhile, some left-aligned media outlets may prefer candidates who are some combination of more leftist, more wonkish, more reflective of the party's diversity, and more adept on social media. \"If Biden is framed as being out of touch with today's Democratic Party and that narrative is repeated across a variety of outlets, it could begin to resonate with voters who don't buy it initially. If he's seen as a gaffe-prone candidate, then minor missteps on the campaign trail could be blown up into big fumbles.\" CLICK HERE TO GET THE FOX NEWS APP Look, it's entirely possible that Biden could stumble, get lapped in fundraising and just be outclassed by younger and savvier rivals. He was hardly a great candidate in 1987 and in 2008. But if the former vice president finds his footing and the field narrows, the press will be forced to change its tune, and we'll see a spate of stories about how Joe Biden has \"grown.\"",
      "date": "April 26",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Stirewalt: Joe Biden campaign rollout was 'quite successful'",
      "url": "https://www.foxnews.com/politics/stirewalt-joe-biden-campaign-roll-out-was-quite-successful",
      "subtitle": "Stirewalt: Joe Biden campaign rollout was 'quite successful'",
      "author": "Sam Dorman",
      "content": " Fox News digital politics editor Chris Stirewalt Tuesday praised the start of former Vice President Joe Biden's 2020 campaign, noting his high fundraising and polling numbers. \"He did what he needed to do. His rollout was quite successful,\" Stirewalt said during an appearance on \"America's Newsroom.\" Biden announced his candidacy on Thursday with a message blasting President Donald Trump for his conduct in office. Within the first 24 hours, Biden's campaign raised $6.3 million — outpacing his competitors Sen. Bernie Sanders, I-Vt., and former Rep. Beto O'Rourke, D-Texas — with 96,926 individuals who \"chipped in\" on the first day. \"He raised more money than anybody else had raised, which is saying something because Bernie Sanders can Hoover up small dollar donations like nobody in history,\" Stirewalt told Fox News host Sandra Smith. MIKA BRZEZINSKI DISMISSES JOE BIDEN ALLEGATIONS: 'I REFUSE TO GIVE IT ANY MORE TIME' Biden has repeatedly led other 2020 candidates in polling before he even announced. In a national poll released at the end of April, Biden got a 24-point lead over Sanders. The RealClearPolitics polling average also gave Biden a substantial lead for the Democratic nomination. Stirewalt remarked that Biden's rollout was successful even though some observers were skeptical. \"Biden, despite a lot of skepticism about how he was going to start out, Joe Biden hit his marks very nicely for the beginning of his campaign,\" he said, mentioning a \"very successful\" town hall event in Pittsburgh. NEW YORK POST: TRUMP WOULD PASS BIDEN'S 'MEASURE OF SUCCESS' WITH FLYING COLORS Before Biden's announcement, he encountered controversy over his conduct during the Anita Hill hearings in 1991, as well as several allegations that he inappropriately touched women. Biden said that in a private conversation with Hill, he expressed regret for the way her hearing was conducted. He did not, however, apologize for his own actions because, he said, he didn't treat her \"badly.\" CLICK HERE TO GET THE FOX NEWS APP In a video message posted to Twitter, Biden also said he didn't think he touched anyone in an inappropriate way but said he would \"listen respectfully\" to concerns. \"And not once — never — did I believe I acted inappropriately.  If it is suggested I did so, I will listen respectfully. But it was never my intention,\" he said.",
      "date": "April 30",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Carly Fiorina: Accusations against Joe Biden 'diminish' the 'real abuse'",
      "url": "https://www.foxnews.com/politics/carly-fiorina-joe-biden-accusations-diminish-real-abuse",
      "subtitle": "Carly Fiorina: Accusations against Joe Biden 'diminish' the 'real abuse'",
      "author": "Victor Garcia",
      "content": " Former presidential candidate Carly Fiorina defended former Vice President Joe Biden on Tuesday, saying accusations he engaged in inappropriate touching diminished “real abuse” unfolding in today's society. “Let's take it outside of politics for just one moment. There is real abuse that goes on. Matt Lauer, other people in this town, Harvey Weinstein, other people in Tinseltown, the gymnastics coach, there is real assault and real abuse. This kind of thing diminishes all of that,” Fiorina, a Republican, said on “The Story with Martha MacCallum.” Fiorina apparently was referencing Larry Nassar, the former team doctor at both USA Gymnastics and Michigan State University sentenced to decades in prison for molesting girls and young women, including dozens of elite gymnasts. Lauer, the longtime \"Today\" anchor, was fired by NBC News in 2017 over what the network called \"inappropriate sexual behavior,\" while Weinstein, a disgraced Hollywood mogul, is set to stand trial for sexual assault later this year. BIDEN ACCUSER SAYS SHE'D VOTE FOR HIM OVER TRUMP Biden continues to face scrutiny over inappropriate touching and his treatment of Anita Hill during the 1991 confirmation hearings of Clarence Thomas, then a nominee for the U.S. Supreme Court. Lucy Flores, a former candidate for lieutenant governor in Nevada, accused Biden, a fellow Democrat, of inappropriate touching and wrote an op-ed published in the New York Times on Monday about her experience since making the accusations. The former Hewlett-Packard CEO spoke out against “relitigating” the past and said clueless or careless behavior may make Biden “thoughtless” but not a “bad man.” “I'm sorry, relitigating Anita Hill, that was litigated. Clarence Thomas is a Supreme Court justice. Brett Kavanaugh was litigated and he's a Supreme Court justice. Putting someone's shoulders in a work environment -- honestly, it happens all the time. Things that may make women uncomfortable doesn't make a man bad. It maybe makes them thoughtless or clueless or careless but not a bad man,” Fiorina said. CLICK TO GET THE FOX NEWS APP Fiorina said the criticism was an example of the Democrats' shift toward the far left. “I do think it says that Joe Biden has to get through a primary in the Democratic Party, and the Democratic Party is moving further and further and further and further to the left,” Fiorina said. Fox News' Martha MacCallum and The Associated Press contributed to this report.",
      "date": "April 30",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Bernie Sanders slams Joe Biden campaign for accepting super PAC donations in effort to 'buy the election'",
      "url": "https://www.foxnews.com/politics/bernie-sanders-joe-biden-super-pac-big-donors-buy-election-2020",
      "subtitle": "Bernie Sanders slams Joe Biden campaign for accepting super PAC donations in effort to 'buy the election'",
      "author": "Danielle Wallace",
      "content": " Sen. Bernie Sanders’ campaign on Thursday accused Joe Biden of selling out to big donors in an effort to “buy the election” following reports that the former vice president and frontrunner for the Democratic Party’s 2020 presidential nomination would form a super PAC to accept unlimited donations from billionaires and corporate elites to cure his current fundraising woes. A spokesperson for Biden’s campaign responded Thursday evening, telling Fox News in a statement that, in the eyes of President Trump, “the general election has already begun,” and Democrats must use any means possible within the parameters of current federal elections laws to win back the presidency — even if that includes taking money from corporations and billionaires alike. TRUMP'S RECORD-BREAKING CASH HAUL REPORTEDLY RATTLING DEMOCRATS \"Joe Biden has spent his campaign promising elite donors that nothing will fundamentally change for them, and he has made clear to fossil fuel and pharmaceutical donors that he will be their ally,” Sanders’ campaign manager, Faiz Shakir, said in a statement. “As a result, he has had trouble generating significant grassroots support from Americans who are getting crushed by those same big donors — and so his supporters are suddenly begging for help from super PACs, even though they are vehicles for the kind of corporate corruption that Democrats should be fighting to stop.”\n\n\n\"Let’s be clear: super PACs exist for one reason and one reason only: to help billionaires and corporations bankroll a presidential campaign with unlimited amounts of money, in exchange for favors,” he continued. “Every Democratic candidate should forcefully reject any help from super PACs -- and they should tell their supporters and surrogates to stop engaging with super PACs that aim to buy elections and undermine our democracy.” Biden, who’s trailing his Democratic rivals in fundraising, said when he first announced his candidacy in April that he would not accept money from super PACs. The former U.S. senator from Delaware declared he was committed to driving perceived \"dark money\" from politics. Before entering the 2020 race, Biden told PBS NewsHour in January 2018 that he was the one who told Sanders not to accept super PAC money, arguing he would lose the trust of the middle class. TRUMP CAMPAIGN RESPONDS TO BIDEN’S ’60 MINUTES’ INTERVIEW, TAKES SWIPE AT HUNTER “My positions are a hell of a lot closer to Elizabeth Warren and Bernie Sanders on some of the economic positions,” Biden told PBS’s Judy Woodruff last year. “I mean, I sat with Bernie. I'm the guy that told him you shouldn't accept any money from a super PAC because people can't possibly trust you.” Within the third quarter, Biden’s campaign raised $15.2 million but was left with just $9 million after expenditures, Reuters reported. Meanwhile, the Trump campaign, which welcomes super PAC contributions, and the Republican Party together raised $125 million in that same time period for the president’s re-election, according to the Republican National Committee. Using these funds, Trump's campaign paid for attack ads targeting Biden amid an ongoing Democratic-led House impeachment inquiry against the president. While Biden’s campaign this week softened its stance on accepting super PAC donations, Sanders boasted his bid for the presidency is 100 percent grassroots funded. Biden’s campaign told Fox News on Thursday that he is still committed to eradicating private donations from federal elections — but until he becomes president, is open to big-donor contributions to defeat Trump. CLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM “As president, Joe Biden will push to remove private money from our federal elections. He will advocate for a constitutional amendment to overturn Citizens United [a 2010 Supreme Cout decision on campaign financing] and end the era of unbridled spending by Super PACs,” Kate Bedingfield, Biden’s deputy campaign manager, told Fox News. “Until we have these badly needed reforms, we will see more than a billion dollars in spending by Trump and his allies to re-elect this corrupt president,” she continued. “And let’s be clear: Donald Trump has decided the general election has already begun. In this time of crisis in our politics, it is not surprising that those who are dedicated to defeating Donald Trump are organizing in every way permitted by current law to bring an end to his disastrous presidency. Nothing changes until we defeat Donald Trump.”",
      "date": "October 25",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Trump debuts new nickname for Biden: ‘SleepyCreepy Joe'",
      "url": "https://www.foxnews.com/politics/trump-debuts-new-nickname-for-biden-sleepycreepy-joe",
      "subtitle": "Trump debuts new nickname for Biden: ‘SleepyCreepy Joe'",
      "author": "Adam Shaw",
      "content": " President Trump on Friday debuted a new nickname for 2020 Democratic presidential hopeful Joe Biden -- calling the former vice president “SleepyCreepy Joe.” “Looks to me like it’s going to be SleepyCreepy Joe over Crazy Bernie [Sanders],” Trump tweeted. \"Everyone else is fading fast!\" BIDEN LABELS TRUMP 'A CLOWN' DURING CAMPAIGN STOP IN SOUTH CAROLINE Trump's prior moniker for Biden was “Sleepy Joe,” but Trump has turned up the heat on the former veep as he dominates the polls in the race for the 2020 Democratic nomination. The new nickname appears to refer to accusations of inappropriate touching that dogged Biden before his campaign launch. Trump last month tweeted out a meme mock video of Biden touching, sniffing and groping himself. \"WELCOME BACK JOE!\" he tweeted. Trump regularly assigns nicknames to his political opponents, sometimes with devastating effectiveness. Republican primary rival Jeb Bush struggled to escape the shadow of “low-energy Jeb,” while Trump’s decision to brand election rival Hillary Clinton as “Crooked Hillary” zeroed in on the 2016 Democratic nominee’s difficulties shaking off her email scandal and other controversies. CLICK HERE TO GET THE FOX NEWS APP Biden was asked last week in South Carolina if he had a nickname for Trump, and said: \"You can just start with clown.\" Trump’s focus on Biden comes as the former vice president continues to build on a strong lead since announcing his long-awaited run last month. A new Monmouth University poll in the vital primary state of New Hampshire shows Biden with 36 percent support among registered Democrats, with Bernie Sanders trailing him at 18 percent. All other candidates are in single digits.",
      "date": "May 10",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Biden sailing, not sinking",
      "url": "https://www.foxnews.com/politics/biden-sailing-not-sinking",
      "subtitle": "Biden sailing, not sinking",
      "author": "Chris Stirewalt",
      "content": " **Want FOX News Halftime Report in your inbox every day? Sign up here.**\n\nOn the roster: Biden sailing, not sinking - The Rulebook: Never nude - Isakson resigning for health, sets up Senate battle - Did he have to buy a pack of 12 birthdays?\n\n\nBIDEN SAILING, NOT SINKING \nFox News: “Sen. Elizabeth Warren of Massachusetts is leading Democratic presidential nomination rival Sen. Bernie Sanders for second place in two new primary election polls, in the latest sign that the Vermont senator's standing may be slipping. But in good news for Joe Biden after a recent survey indicated a slide for the front-runner as well, the former vice president maintains large leads over the Democratic Party's progressive standard-bearers in both new national polls, which were released Wednesday morning. The surveys, by Suffolk University for USA Today and Quinnipiac University, boost the Biden campaign's argument that another national survey released Monday indicating he's locked in a three-way tie with Warren and Sanders was an ‘outlier.’ Biden – the front-runner in the 2020 Democratic nomination race since even before he declared his candidacy in late April – stood at 32 percent among likely Democratic primary and caucus voters nationwide in both of Wednesday’s surveys.”\n\nTrump struggles in head-to-head matchups - Quinnipiac University: “If the 2020 presidential election were held today, 54 percent of registered voters say that they would vote for former Vice President Joe Biden, while only 38 percent would vote for President Trump. Matchups against other top Democrats show: Vermont Sen. Bernie Sanders topping Trump 53 - 39 percent; Massachusetts Sen. Elizabeth Warren ahead of Trump 52 - 40 percent; California Sen. Kamala Harris beating Trump 51 - 40 percent; South Bend Mayor Pete Buttigieg leading with 49 percent to Trump's 40 percent. Looking at all of the matchups, President Trump is stuck between 38 and 40 percent of the vote. These low numbers may partly be explained by a lack of support among white women, a key voting bloc that voted for Trump in the 2016 election.”\n\nIncumbent underwater on economy for the first time - Quinnipiac University: “For the first time since President Trump was elected, more voters say that the national economy is getting worse than getting better, with 37 percent saying it is getting worse, 31 percent saying it is getting better, and 30 percent saying it is staying the same. … When asked to rate the state of the nation's economy, 61 percent of voters say that it is excellent or good, while 37 percent say that it is not so good or poor. … Voters also say that President Trump's policies are hurting the nation's economy at 41 percent, while 37 percent say that they are helping, and 20 percent say that his policies make no difference.”\n\nPoll finds Americans dread the 2020 election - USA Today: “Americans are facing the 2020 presidential election with a dominant feeling: Dread. … If the candidate they support loses, nearly four in 10 said they would have little or no confidence that the election had been conducted in a fair-and-square way, setting up what could be a debate over the legitimacy of the next president. … In the crowded Democratic contest, former Vice President Joe Biden retained a wide lead, at 32%, up 2 percentage points from the USA TODAY/Suffolk poll taken in June. But Massachusetts Sen. Elizabeth Warren moved up 4 points to second place, at 14%, and Vermont Sen. Bernie Sanders dropped 3 points, now at third place with 12%. … Only three other candidates received support above 2%: South Bend (Indiana) Mayor Pete Buttigieg and California Sen. Kamala Harris, each at 6%, and businessman Andrew Yang at 3%. At 2% were former Texas Congressman Beto O'Rourke and New Jersey Sen. Cory Booker.”\n\nWarren tries to crowd her way in - WaPo: “Elizabeth Warren does not like to talk about polls, or crowds, or ‘momentum.’ … Over the past week, Warren drew the largest crowds of her campaign. Seattle's audience dwarfed a 12,000-head-count crowd in Minneapolis; a more hastily planned event in Los Angeles drew around 4,000. Warren, once nearly counted out of the race, can now pull out crowds comparable to Barack Obama's in the summer of 2007 or Bernie Sanders's in the summer of 2015. … But Warren's crowds, never small but increasingly impressive, are complicating rival campaigns' views of their competition. Sanders, whose ability to fill arenas four summers ago fed into his 2015 surge, has never had to contend with a primary opponent like that. And Biden, whose crowds have been noticeably smaller than Sanders's or Warren's in early-voting states, bristles at the idea that his competitors are bigger draws.”\n\nTHE RULEBOOK: NEVER NUDE \n\n“If we should not be willing to be exposed, in a naked and defenseless condition, to [Britain and Spain’s] insults and encroachments, we should find it expedient to increase our frontier garrisons in some ratio to the force by which our Western settlements might be annoyed.” – Alexander Hamilton, Federalist No. 24\n\nTIME OUT: GREEK SYSTEM  \nNatGeo: “Childhood education in ancient Greece was highly dependent on one’s gender. … In the fifth century B.C., Greece’s greatest minds were preoccupied with the most effective ways to raise children. … The teaching that Isocrates praised was known by Greeks aspaideia, a term derived from pais, the Greek word for child. In ideal terms, paideia was intended to allow male children to purge the baser parts of human nature so they could achieve the highest moral state. On a pragmatic level, it also provided society with well-prepared men to take on the political and military burdens of citizenship as adults. Paideia, however, was not intended for female children. … In stark contrast to the traditional, family-centered childhood of Athens was Sparta’s rigid schooling system. Known as agoge, it was centrally organized by the state. … Whereas Athenian education imposed a strict segregation of the sexes, Spartan boys and girls trained and competed in athletics alongside one another.”\n\nFlag on the play? - Email us at HALFTIMEREPORT@FOXNEWS.COM with your tips, comments or questions.\n\nSCOREBOARD\n\nAverage approval: 41.4 percent\nAverage disapproval: 54.4 percent\nNet Score: -13 percent\nChange from one week ago: up 0.6 points\n\n[Average includes: Quinnipiac University: 38% approve - 56% disapprove; USA Today/Suffolk University: 44% approve - 54% disapprove; Monmouth University: 41% approve - 53% disapprove; CNN: 41% approve - 54% disapprove; NBC News/WSJ: 43% approve - 55% disapprove.]\n\nWANT MORE HALFTIME REPORT? \n\nYou can join Chris and Brianna every day on Fox Nation. Go behind-the-scenes of your favorite political note as they go through the must-read headlines of the day right from their office – with plenty of personality. Click here to sign up and watch!\n\nISAKSON RESIGNING FOR HEALTH, SETS UP SENATE BATTLE\nFox News: “Republican Sen. Johnny Isakson, the chairman of the Senate Veterans Affairs Committee and a longtime Georgia lawmaker, announced Wednesday that he will resign at the end of the year. In a statement, the 74-year-old Isakson cited his battle with Parkinson's disease. ‘I am leaving a job I love because my health challenges are taking their toll on me, my family and my staff,’ he said. … With his resignation, Georgia Gov. Brian Kemp, a Republican, will now have to appoint a replacement for Isakson until a special election can be held in 2020. The winner of that election will serve the remaining two years of Isakson's term, and the winner of the 2022 election will serve a full six-year term. Isakson's retirement also means that voters in Georgia will have to cast a ballot for both of the state's Senate seats next year as Sen. David Perdue, a Republican, is seeking a second term in office.” \n\nKansas Republicans seek primary challenger to one of their own - Kansas City Star: “Kansas Treasurer Jake LaTurner said Tuesday that he will consider dropping out the race for U.S. Senate to instead mount a primary challenge against freshman Republican Rep. Steve Watkins after encouragement by a former Kansas governor. Former Kansas Gov. Jeff Colyer took the highly unusual step Tuesday of calling for LaTurner, a Republican, to drop out of the race for an open Senate seat and challenge an incumbent Republican after Watkins has spent more than a week battling a whisper campaign. Colyer, a Johnson County Republican who served as Kansas governor for 11 months, did not refer to Watkins by name in a statement calling on LaTurner to seek the seat. He noted Watkins’ lackluster fundraising and made a vague reference to poor coalition-building.”\n\nGOP taking no chances on N.C. special House election - Politico: “[House Minority Leader Kevin] McCarthy has traveled to the state to help the Republican candidate, state Sen. Dan Bishop, and has pushed his rank-and-file lawmakers to lend a hand. And as he chatted up contributors, he warned that next month’s vote is critical: Following a devastating 2018 election that demolished the House GOP majority, a win in the nationally-watched race would give the party a badly-needed morale boost. Republicans are funneling resources into the southern North Carolina district as they try to stave off an embarrassing loss in a GOP-heavy seat that President Donald Trump won in 2016 by more than 11 percentage points. With private polling showing a close race between Bishop and Democrat Dan McCready, Trump will travel to the district on Sept. 9, the night before the special election, for a rally in Fayetteville, N.C. And the White House is also planning to deploy Vice President Mike Pence and the president’s son, Donald Trump Jr., before the election.”\n\nConstituents sweat vulnerable Democrats on impeachment - Politico: “Democrats hoping to avoid clashes over impeachment when they left Washington this summer are being confronted with a difficult reality at sometimes hostile town hall events. Voters across the country — from California to Pennsylvania to Massachusetts — grilled House Democrats on the potential impeachment of President Donald Trump at a series of events this month, regardless of whether they support or oppose the drastic measure. … Many progressive voters want Democratic leaders to move forward with impeachment immediately, the politics of it be damned, because ethics demand it; others are hammering their representatives over the possibility that impeachment would boost Trump’s reelection prospects because he would claim vindication after being acquitted by the GOP-controlled Senate. … Many of the pro-impeachment voters turning out at town halls didn’t appear to be part of organized efforts…”\n\nPLAY-BY-PLAY\nMississippi Lt. Gov. Tate Reeves wins Republican primary for governor - NYT Trump bank tells Congress it has some of his tax returns - NYT\n\nFacebook tries to clean up its act ahead of 2020 - Reuters\n\nDavid Ignatius: The Trump era keeps getting noisier. Are people tuning out? - WaPo\n\nPergram: Here’s why the House and Senate engage in a parliamentary dance during lengthy respites - Fox News    \n\nCherokee Nation to send delegate to Congress, citing 19th century treaties - NYT\n\nAUDIBLE: WOOF\n\n“Where’s the democratic process? Why is the 1 percent deciding for the 99 percent?” – Patty Martin, mother to a French bulldog named Louie, in response to noise complaints about a dog park in Chevy Chase, Md. The WaPo went on scene to cover the drama over the “excessive barking” in the park that has been occurring for over a year.\n\nFROM THE BLEACHERS\n\n“Chris, Excellent analysis of the Dem electoral chaos. However, I became distracted by the word ‘salvific,’ particularly just ahead of the idiomatic ‘glommed’ all in a beautifully constructed, paragraph-length sentence. While a charming break from reading and understanding the sentence itself, I can't help but wonder what other almost never encountered words we may look forward to in future reports. ‘Salvific,’ really?” – Eric Hutchins, Santa Barbara, Calif.\n\n\n[Ed. note: Now I may certainly be wrong, but I think of “salvific” as hardly a rarefied word. We take it from theology – “having the intent or power to save or redeem” – so maybe I have more familiarity from church/Sunday school than some others. Also, it seems like a word that hints at its own meaning, “salv” being a pretty strong directional arrow. All that said, I will endeavor… er, try to be careful about using fifty-cent words when unnecessary.]     \n\nShare your color commentary: Email us at HALFTIMEREPORT@FOXNEWS.COM and please make sure to include your name and hometown.\n\nDID HE HAVE TO BUY A PACK OF 12 BIRTHDAYS? \nKABC: “Costco Wholesales stores, and especially their food courts, have a certain charm that goes beyond those $1.50 hot dogs. That's why when little Armando Martinez wanted a party for his fourth birthday - he knew just the place for the celebration. ‘He is obsessed with Costco,’ said his aunt Miriam Zakaria, who shared photos and videos of the festivities with Eyewitness News. The Costco Warehouse in Norwalk [California] shut down the food court so that Armando could invite all of his friends to celebrate his birthday with him. He even had a Costco hat and badge for the special occasion! The party included all things Costco, from tasty samples to Costco ‘membership cards.’”\n\nAND NOW, A WORD FROM CHARLES…\n\n“‘Optimism’ is the perfect way to trivialize everything that Reagan was or did.” – Charles Krauthammer (1950-2018) writing in the Washington Post on June 11, 2004.  \n\nChris Stirewalt is the politics editor for Fox News. Brianna McClelland contributed to this report. Want FOX News Halftime Report in your inbox every day? Sign up here.",
      "date": "August 28",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Joe Biden claims he once told Vladimir Putin ‘I don’t think you have a soul’",
      "url": "https://www.foxnews.com/politics/biden-claims-putin-no-soul",
      "subtitle": "Joe Biden claims he once told Vladimir Putin ‘I don’t think you have a soul’",
      "author": "Alex Pappas",
      "content": " Democratic presidential candidate Joe Biden claims he once told Russian President Vladimir Putin he has no “soul.” During a fundraiser in New York on Thursday, Biden spoke of meeting with Putin while he was vice president during the Obama administration. FORMER STARBUCKS CEO HOWARD SCHULTZ ABANDONS 2020 PRESIDENTIAL AMBITIONS Recalling what he told Putin, Biden said, “I don’t think you have a soul and his response was, ‘Well, we understand each other.” HOUSE DEMS INVESTIGATE PENCE STAY AT TRUMP'S DOONBEG, IRELAND RESORT The comments evoke memories of former President George W. Bush’s comments in 2001 after meeting Putin, when he said, “I looked the man in the eye” and “I was able to get a sense of his soul.” (Bush has since said “Putin changed.”) During the fundraiser, Biden vowed to get tough with Putin if elected president. “You screw around with us, worse is coming your way,” Biden said. “They gotta understand there’s a price to pay.” CLICK HERE TO GET THE FOX NEWS APP Speaking of Russia’s attempts to interfere in U.S. elections, Biden called for new election security measures. “We have to get every state in the union to move toward having paper ballots. We need the backup,” he said.",
      "date": "September 6",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Joe Biden makes unfortunate ‘Freudian slip’ as he targets ‘Donald Hump’",
      "url": "https://www.foxnews.com/politics/biden-freudian-slip-donald-hump",
      "subtitle": "Joe Biden makes unfortunate ‘Freudian slip’ as he targets ‘Donald Hump’",
      "author": "Paul Steinhauser",
      "content": " MANCHESTER, NH – It’s a line former vice president Joe Biden uses repeatedly on the campaign trail as he jabs at the man he hopes to replace in the White House, President Trump. But as the front-runner in the Democratic nomination race addressed thousands of party activists at the New Hampshire Democratic Party’s annual convention, he had what he termed a ‘Freudian slip’ BIDEN CALLS ENVIRONMENTAL ACTIVIST 'KIDDO' AS HE DEFENDS FUNDRAISER WITH FOSSIL FUEL COMPANY CO-FOUNDER “We cannot and I will not let this man be re-elected president of the United States,” Biden said. of Trump. “Limited to four years, I believe history will look at the presidency as an aberrate moment in time.” “If Donald Hump, Donald Trump, Freudian slip,” he emphasized, to cheers. Biden corrected himself and delivered the line again, saying “if Donald Trump is re-elected, he will forever and fundamentally alter the character of this nation.” The former vice president has made a number of high profile gaffes the past couple of months which have gone viral and grabbed headlines. One came during his previous trip to the first-in-the-nation primary state, when Biden mistakenly said he was in neighboring Vermont. And the previous day, he mixed up numerous facts when telling the story of pinning a medal on a soldier during a trip to Afghanistan. ALEXROD CLAIMS BIDEN 'SERIALLY DISTORTING RECORD Biden’s campaign has dismissed the verbal slip-ups as part of a national press narrative but they appeared to have raised enough concerns that some allies of the former vice president reportedly suggested he scale back the number of events he did on the campaign trail. The former vice president – who’s made electability one of his top selling points as he battles for the Democratic nomination - spent much of his address to the audience in New Hampshire targeting Trump. CLICK HERE FOR THE FOX NEWS APP Repeating a line he uses often on the campaign trail, Biden said Trump “lacks the moral authority to lead…This president has more in common with George Wallace than George Washington.”",
      "date": "September 7",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Joe Biden slammed by editor of democratic socialist magazine: 'A Biden victory is not preordained'",
      "url": "https://www.foxnews.com/politics/editor-at-socialist-magazine-attack-biden-in-order-to-beat-trump-in-2020",
      "subtitle": "Joe Biden slammed by editor of democratic socialist magazine: 'A Biden victory is not preordained'",
      "author": "Sam Dorman",
      "content": " Democrats should continue attacking former Vice President Joe Biden in hopes that the party will adopt more progressive stances needed to beat President Trump in 2020, the founding editor of a democratic socialist magazine argued. Writing in The Guardian, Jacobin Magazine editor Bhaskar Sunkara called for a Democratic nominee that would push a \"real progressive agenda\" rather than just attacking the president. \"Simply pointing to the Trump administration and saying 'this is not normal' won’t be enough to rally people into the voting booth,\" he wrote in an op-ed published Wednesday. Sunkara's call came as some warned intraparty divisions could weaken Democrats' chances at beating Trump -- the one priority around which the party seemed to clearly coalesce. KARL ROVE: 2020 DEMOCRATIC HOPEFULS ENGAGED IN 'TWO-FRONT CIVIL WAR' Biden, the frontrunner since before he formally announced he was entering the race, took a decidedly anti-Trump tone from the outset but has received criticism for not being progressive enough on certain issues. According to Sunkara, attacking Biden would help \"break the myth of Biden's 'electability.'\" And, Sunkara argued, even if Biden beat out Sen. Bernie Sanders, I-Vt., and other progressives for the party's nomination, criticism could force the party to adopt a more progressive platform. \"Although he seems to believe so, a Biden victory is not preordained. He could conceivably get edged out by a candidate, like Sanders, bold enough to offer a genuinely alternative vision for America – not just shielding us from the nightmare of Trump, but providing us with aspirations for the future,\" Sunkara said. \"Even if Sanders loses the primary, this strong anti-Biden stance might force the Democratic party to adopt more progressive positions that would actually help its chances against Trump. 2020 DEM JOHN DELANEY WARNS OF PARTY'S 'INTOLERANCE' AMID AOC SPAT OVER 'MEDICARE-FOR-ALL' \"Not only is Medicare for All popular, but 60% of Americans support free college and a majority back a jobs guarantee. Big ideas to solve our social problems – and efforts to make the rich pay for them – are popular. Whoever challenges Trump will need to start adopting them.\" Biden, on Wednesday, released a costly climate change plan that seemed at least partially to be an attempt at warding off progressive criticism. After his staff indicated in May that Biden sought a middle way on the issue, Rep. Alexandria Ocasio-Cortez, D-N.Y., took a veiled shot at his moderation. She, along with others, has proposed a more aggressive \"Green New Deal\" which Biden's camp cited as a 'crucial framework\" for addressing climate change. But just as Biden pushed his climate plan, he faced even more friendly fire over his stance on abortion. His fellow 2020 Democratic candidates vehemently denounced the Hyde Amendment -- a decades-old law that blocks federal funding from going towards most abortions -- after Biden's campaign said he supported the measure. NEW 2020 POLLS: BIDEN TOPS TRUMP IN MICHIGAN, EDGES AHEAD IN TEXAS While it's unclear how that position will affect Biden in the polls, it seemed to represent the first major rift in a field focused on defeating the president. CLICK HERE TO GET THE FOX NEWS APP His stance also appeared to prompt both Sen. Kirsten Gillibrand, D-N.Y., and New York City Mayor Bill de Blasio to suggest he wasn't qualified to serve as the party's nominee. \"If you don't support repeal, you shouldn't be the Democratic nominee,\" De Blasio tweeted on Wednesday.",
      "date": "June 6",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Joe Biden builds massive lead among black voters",
      "url": "https://www.foxnews.com/politics/joe-biden-massive-black-voters",
      "subtitle": "Joe Biden builds massive lead among black voters",
      "author": "Paul Steinhauser",
      "content": " Joe Biden’s message was clear. “We’ve got Jim Crow sneaking back in,” the former vice president warned at a rally in Columbia, South Carolina, soon after launching his 2020 Democratic presidential campaign. JOE BIDEN UP BY DOUBLE DIGITS IN LATEST FOX NEWS 2020 POLL Biden, in equating new restrictions on voting eligibility with the heinous racial segregation laws of generations past, was at the same time courting black voters who predominate in the Democratic primary in South Carolina, the first southern state to vote in the race for the White House. The former veep's bond with that critical voting bloc has only strengthened in the weeks since. For now the clear front-runner in the Democratic nomination campaign, Biden is being boosted at this early stage by his immense popularity with black voters. For Biden's rivals, this is a daunting factor heading into primary season. The key question going forward, according to former Democratic National Committee leader and Fox News contributor Donna Brazile, is whether the 76-year old white male candidate in a field of young and diverse contenders can “solidify this support.” According to the latest Fox News poll, Biden stands at 33 percent support among white Democratic voters. But that support rises to 38 percent among non-white likely Democratic primary voters. Sen. Bernie Sanders of Vermont is a distant second among that group, at 14 percent. The two major Democratic contenders who are black -- Sens. Kamala Harris of California and Cory Booker of New Jersey -- stand at 6 percent and 5 percent in the survey, respectively. Every other candidate is also in single digits among non-white likely voters. Notably, Pete Buttigieg, who's risen from obscurity to the upper-middle tier in many polls, stood at just 1 percent among that group. The South Bend mayor acknowledged at a Fox News town hall on Sunday that he needs to do more to appeal to \"black and brown\" voters, suggesting that minority voters are \"skeptical of people who seem to come out of nowhere.\" It doesn't hurt Biden that he spent eight years as then-President Barack Obama’s right-hand man, a period that did more than just build his name recognition. Part cheerleader, part sage and part protector, Biden was always deferential to the nation’s first black president, who extended political affection in return. As they left office in January of 2017, Obama praised his trusted friend and adviser. “My family is so proud to call ourselves honorary Bidens,” the outgoing president said as he awarded Biden the Presidential Medal of Freedom at a White House ceremony. While Obama is staying neutral at this early point in the primaries, Biden is running in many ways as his successor. During his swing through South Carolina, as elsewhere, he was quick to compliment his former boss, calling Obama “one of the best presidents we’ve ever had.” His standing as Obama’s vice president and his longtime relationships with African-American Democratic leaders across the country are so far helping keep him far ahead of the rest of the field in courting the black vote. Mo Elleithee, the founding executive director of Georgetown University's Institute of Politics and Public Service and a Fox News contributor, pointed to Biden’s record on civil rights and his eight years serving with Obama, saying that black voters \"know Biden's track record\" and that \"he's been there for them time and time again.\" \"What you're seeing now is just a validation of a comfort level,\" said Elleithee, a senior spokesman for then-Sen. Hillary Clinton’s 2008 presidential campaign who later served as communications director for the Democratic National Committee. \"Biden is the guy who gives them a sense of security and comfort, and that he would be a champion for them probably more than anyone else right now,\" he added during an appearance Monday on Fox News' “The Daily Briefing.” Brazile said that Biden’s “a place holder because everyone knows him. You call up my nieces and nephews right now, they’ll say ‘Biden’ because they know Biden. They don’t know the other candidates that well.” But she pointed out that while Biden is a well-known commodity with the older black electorate, “African-American voters are trending young and he’s not as well known. Maybe they were in elementary school when Joe Biden was elected vice president. The question is will he be able to reach out and give them a hopefully optimistic message not only to win their support but broaden participation.” Elleithee warned that Biden's current standing atop the field doesn't mean that another candidate can't \"chip away\" at his lead with minority voters. And Biden can provide his rivals with plenty of ammunition – including his crafting of the now-controversial 1994 crime bill, his vote last decade in favor of the Iraq War, his now-criticized treatment of Anita Hill while Senate Judiciary Committee chairman during the Clarence Thomas Supreme Court nomination hearing, and his initial observation of Obama during the 2008 primaries as “clean and articulate.” HARRIS CRITICIZES BIDEN OVER CONTROVERSIAL 1994 CRIME BILL After Biden recently defended the crime bill, which has been criticized in recent years for a spike in incarcerations, especially among minorities, Harris shot back. “I have a great deal of respect for Vice President Joe Biden, but I disagree,” the senator said last week. “That 1994 crime bill, it did contribute to mass incarceration in our country. It encouraged and it was the first time we had a federal three strikes law. It funded the building of more prisons in the states.” The comment by Harris could just be an appetizer for things to come. Brazile noted: “It's early.” And pointing to Obama’s original White House win, she predicted “we could see a repeat of the 2008 cycle where one of the candidates catches fire in Iowa or New Hampshire or Nevada and all bets [are] off going into South Carolina and Super Tuesday. You will see once again black voters playing an oversized role in the major states on Super Tuesday.”",
      "date": "May 21",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Joe Biden says there's 'zero rationale' for GOP to call on son Hunter to testify in impeachment hearings",
      "url": "https://www.foxnews.com/politics/joe-biden-hunter-impeachment-hearings-testify-republicans",
      "subtitle": "Joe Biden says there's 'zero rationale' for GOP to call on son Hunter to testify in impeachment hearings",
      "author": "Joseph A. Wulfsohn",
      "content": " Former Vice President Joe Biden declared Monday there was \"zero rationale\" for Republican lawmakers to have his son Hunter testify before Congress as part of the ongoing impeachment inquiry. Hunter Biden's financial involvement in the Ukraine gas company Burisma -- while his father was in office -- has been under intense scrutiny in recent weeks since the House of Representatives formally launched the impeachment inquiry into President Trump over his conversation with the Ukrainian president about investigating the Bidens. With public impeachment hearings scheduled for this week, Republicans recently included Hunter Biden on a list of witnesses they wanted to hear under oath. Appearing on a televised town hall Monday, the 2020 frontrunner doubled down on his claim that no wrongdoing took place while he was vice president. \"Every single, solitary, serious investigator... looked at this and said there's absolutely zero basis to the accusation that I acted inappropriately or that my son did,\" Biden told the Iowa audience. \"This is all about Trump trying to create a diversion... There's not a scintilla of evidence pointing out that anything is wrong.\" After calling Trump's personal attorney Rudy Giuliani a \"chump,\" Biden dismissed Republicans' inclusion of his son on their testimony wish list. BIDEN EDGES RIVALS, BUTTIGIEG JOINS TOP TIER IN NEW HAMPSHIRE POLL CLICK HERE TO GET THE FOX NEWS APP \"There is zero rationale for that to happen,\" Biden told CNN anchor Erin Burnett. \"Nobody has suggested that anything was done that was inappropriate. This is all a diversion. This is classic Trump, classic Trump. Focus on the problems. We have a president who is one of the most corrupt people to serve in that office.\" The former vice president continued, \"I released 21 years of my tax returns in detail. Mr. President, you're worried about corruption? Release some of yours!\"",
      "date": "November 11",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Joe Biden accused of plagiarizing parts of new climate platform",
      "url": "https://www.foxnews.com/politics/biden-accused-of-plagiarizing-parts-of-new-climate-platform",
      "subtitle": "Joe Biden accused of plagiarizing parts of new climate platform",
      "author": "Alex Pappas",
      "content": " Democratic presidential candidate Joe Biden is facing claims that his campaign plagiarized at least five parts of the climate platform released on Tuesday. The apparent similarities were first flagged on Twitter by a progressive activist. By Tuesday afternoon, most of the examples in the Biden campaign platform had been updated online to include attribution to a third party. BIDEN UNVEILS CLIMATE CHANGE PLAN USING GREEN NEW DEAL AS FRAMEWORK, AFTER AOC CRITICISM “The paragraph in Joe Biden’s climate plan about carbon capture and sequestration includes language that is remarkably similar to items published previously by the Blue Green Alliance and the Carbon Capture Coalition,” Josh Nelson, the vice president of CREDOmobile, tweeted earlier in the day. Nelson posted two examples of the campaign borrowing language from left-wing groups. Biden's platform said, \"Carbon capture, use, and storage (CCUS) is a rapidly growing technology that has the potential to create economic benefits for multiple industries while significantly reducing carbon dioxide emissions.” But Nelson pointed out on Twitter that the Blue Green Alliance used that same language in a 2017 letter. In another example, the campaign’s platform said, “Biden’s goal is to make CCUS a widely available, cost-effective, and rapidly scalable solution to reduce carbon emissions to meet mid-century climate goals.” Nearly identical language appears on the website of the Carbon Capture Coalition, which said its \"goal is to make carbon capture, use and storage (CCUS) a widely available, cost-effective, and rapidly scalable solution to reduce carbon emissions to meet mid-century climate goals.” By Tuesday afternoon, attribution was apparently added to both parts to give credit to the Blue Green Alliance and Carbon Capture Coalition. The Biden campaign did not immediately return a request for comment from Fox News, but told Politico, \"Several citations, some from sources cited in other parts of the plan, were inadvertently left out of the final version of the 22 page document. As soon as we were made aware of it, we updated to include the proper citations.” Additional examples surfaced Tuesday, with The Daily Caller News Foundation identifying three other sections that raised questions. The Daily Caller flagged a part from Biden’s platform that said, “Aviation accounts for nearly 2 percent of global greenhouse gas emissions, and that portion is expected to increase. Unfortunately today, few low-carbon technologies or fuels have been developed to tackle this challenge.” The liberal website Vox in January used similar language in a story that said, “Aviation accounts for about 2 percent of global greenhouse gas emissions, and that share is poised to grow.” In another example, the campaign said the “average American sewage pipe is 33 years old, with many pipes dating back 50 or even 100 years.” The website American Rivers has previously posted online that the “average American sewage pipe is 33 years old, with many pipes dating back 50 or even 100 years.” By Tuesday afternoon, the Biden platform attributed the information to American Rivers. The Biden campaign platform on Tuesday also said, “40 percent of the 567 federally recognized tribes in the U.S. live in Alaska, where the rapid pace of rising temperatures and melting sea ice and glaciers threaten the critical infrastructure and traditional livelihoods in the state.” The Climate.gov website has strikingly similar language: “Of the 567 federally recognized tribes in the United States, 40 percent (229 tribes) live in Alaska Native communities. The rapid pace of rising temperatures, melting sea ice and glaciers, and thawing permafrost in Alaska is having a significant negative impact on critical infrastructure and traditional livelihoods in the state.” By Tuesday, the platform had attributed the information “to the U.S. federal government.” Republicans reacted Tuesday by accusing Biden of repeated plagiarism – an allegation that famously hampered his 1988 presidential campaign. “This is not Joe Biden's first brush with plagiarism,” said the Republican National Committee’s Steve Guest. “During his 1988 campaign, Biden plagiarized campaign speeches from British Labour Party leader Neil Kinnock as well as Robert Kennedy. During law school, Biden plagiarized, too.” In a statement earlier in the day, Biden announced his environmental plan, calling it “The Biden Plan for a Clean Energy Revolution and Environmental Justice.” “We must take drastic action now to address the climate disaster facing the nation and our world,” Biden said. Fox News’ Peter Doocy contributed to this report.",
      "date": "June 4",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Joe Biden promises to 'cure cancer' if elected president",
      "url": "https://www.foxnews.com/politics/joe-biden-cure-cancer-president",
      "subtitle": "Joe Biden promises to 'cure cancer' if elected president",
      "author": "Joseph A. Wulfsohn",
      "content": " Former Vice President Joe Biden made a bold promise on Tuesday to \"cure cancer\" if he is elected president in 2020. At a campaign event in Ottumwa, Iowa, Biden expressed the difficulty one faces with a \"loss\" of a family member and others attempt to comfort them saying, \"'I know how you feel'\" when in reality they have \"no idea how I feel,\" which is likely in reference to the loss of his son Beau Biden, who died in 2015 from brain cancer. \"That's why I've worked so hard in my career to make sure that... I promise you if I'm elected president, you're going to see the single most important thing that changes America, we're gonna cure cancer,\" Biden declared. His remarks were welcomed with applause. CLICK HERE TO GET THE FOX NEWS APP In 2016, Biden headed the \"Cancer Moonshot\" program during the Obama administration in a renewed effort to find a cure for cancer. He also launched the Biden Cancer Initiative after leaving office. The Democratic frontrunner took some shots at President Trump while campaigning in Iowa, calling him an “existential threat\" to the country.",
      "date": "June 11",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Joe Lieberman praises Trump's China strategy, says Biden flip-flops",
      "url": "https://www.foxnews.com/politics/lieberman-praises-trumps-china-biden",
      "subtitle": "Joe Lieberman praises Trump's China strategy, says Biden flip-flops",
      "author": "Nick Givas",
      "content": " Former Sen. Joe Lieberman praised President Trump's China strategy on \"America's Newsroom\" Wednesday, after saying 2020 Democratic presidential candidate Joe Biden may have flip-flopped on the issue. The former vice presidential candidate said America can't run the risk of getting into a cold war with China and must stand firm with regard to intellectual property rights. JOHN SUNUNU ON JOE BIDEN'S LEAD SLIPPING IN IOWA: HIS CAMPAIGN HAS BEEN 'A LITTLE BIT INEPT' \"Well, I've seen a lot of flip-flops in my day,\" said Lieberman, the former Independent senator from Connecticut. \"I'd say that one just is low down on the scale. Here's what I mean. In the earlier comment, [Biden] was kind of Mr. Pro American ... Yesterday he said [China's] a challenge but not a threat. So I think in a way he clarified what he was trying to say earlier which seemed to be almost like don't worry about it. Don't worry about China. But we do have to worry about China. It's a growing power. And we have to worry not only about the challenge it represents to us, but that we make sure if we possibly can, that we not get into some kind of cold war with China because that would hurt us as well as them.\" Lieberman said he has been assigned to work with the Chinese company GTE to assess why it's being viewed as a threat in the United States. He claimed it's safe for Americans to conduct business with China, but also warned against the country's history of stealing trade secrets. \"This telecom company ZTE, which, in a way, is a smaller version of what Huawei does [is] worried that there's still opposition to it doing business in the United States,\" he said. BIDEN LEAD SLIPS IN LATEST IOWA POLL; SANDERS, WARREN, BUTTIGIEG ARE NEAREST CONTENDERS \"So they asked me not to lobby for them, but to find out what's on people's minds and what can we do to reassure people in American government, American business, American consumers that it's safe to buy ZTE products. So there's a lot of concerns here. Some of it is about historic patterns of China where there is some evidence that it's happened. For instance, some Chinese companies have stolen trade secrets from American companies.\" Lieberman said Trump is taking the right approach with China by pushing for tariffs and publicly highlighting the rising conflict between the two superpowers. \"I do [agree with Trump] on the substance of [his China strategy] which is that these negotiations with the Chinese which are described as trade or tariff negotiations are really more than that,\" he said.\"If it was just tariffs I think we already would have had a deal.\" \"But the president is raising another kind of issue and it really is an important one to raise, which is the kind of structural differences between our two countries,\" Lieberman continued. \"It's time for China -- it's a great economy now. Stop, if they are still stealing our trade secrets -- stop forcing American companies when they do business in China to share their technology with Chinese companies and reassure us that if we buy Chinese products you're not going to use them in some day of conflict between our two countries to compromise America.\"",
      "date": "June 12",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Joe, Hunter Biden seen golfing with Ukraine gas company exec back in 2014, photo shows",
      "url": "https://www.foxnews.com/politics/joe-hunter-biden-seen-golfing-with-ukraine-gas-company-exec-back-in-2014-photo-shows",
      "subtitle": "Joe, Hunter Biden seen golfing with Ukraine gas company exec back in 2014, photo shows",
      "author": "Gregg Re",
      "content": " EXCLUSIVE: A photo obtained by Fox News' \"Tucker Carlson Tonight\" shows former Vice President Joe Biden and his son Hunter golfing in the Hamptons with Devon Archer, who served on the board of the Ukrainian natural gas company Burisma Holdings with Hunter. Earlier this month, Joe Biden told Fox News in Iowa that he never discussed his son’s foreign business dealings with him. “I have never spoken to my son about his overseas business dealings,” Biden said, pointing the finger at President Trump. “I know Trump deserves to be investigated. He is violating every basic norm of a president. You should be asking him why is he on the phone with a foreign leader, trying to intimidate a foreign leader. You should be looking at Trump.” Hunter Biden told The New Yorker previously that he and his father had spoken “just once\" about Hunter Biden's work in Ukraine. A source close to Archer told Fox News the photo was taken in August 2014. Contemporaneous news reports indicate the vice president was in the Hamptons at the time. Hunter Biden and Archer joined the Burisma Holdings board in April 2014. Earlier this month, Trump suggested that despite his claims, Joe Biden seemingly discussed Ukraine matters with his son. The White House has sought to point to possible corruption by the Bidens, amid the House Democrats' formal impeachment inquiry against the president. “And now, he made a lie when he said he never spoke to his son,” Trump said. “Of course you spoke to your son!” Biden has acknowledged on camera that in spring 2016, when he was vice president and spearheading the Obama administration's Ukraine policy, he successfully pressured Ukraine to fire top prosecutor Viktor Shokin. At the time, Shokin was investigating Burisma Holdings — where Hunter had a lucrative role on the board despite limited relevant expertise. The vice president threatened to withhold $1 billion in critical U.S. aid if Shokin was not fired. TRUMP SEEKS TO TURN TABLES ON BIDEN AMID IMPEACHMENT PROBE \"Well, son of a b---h, he got fired,\" Biden joked at a panel two years after leaving office. Shokin himself had already been widely accused of corruption. Critics alleged Hunter Biden might have been selling access to his father, who had pushed Ukraine to increase its natural gas production. \"Impossible to justify $50k/month for Hunter Biden serving on a Ukrainian energy board w zero expertise unless he promised to sell access,\" political scientist Ian Bremmer tweeted. Trump attorney Rudy Giuliani, on Sunday, suggested Shokin was the target of an international smear campaign to discredit his work. In a combative interview on ABC News' \"This Week\" on Sunday, Giuliani presented what he said was an affidavit signed by Shokin that confirmed Hunter Biden was being investigated when Shokin was fired. \"I have an affidavit here that's been online for six months that nobody bothered to read from the gentleman who was fired, Viktor Shokin, the so-called corrupt prosecutor,\" Giuliani said. \"The Biden people say that he wasn't investigating Hunter Biden at the time. He says under oath that he was.\" The Shokin affidavit purportedly said the U.S. had pressured him into resigning because he was unwilling to drop the case. REPUBLICANS WANT WHISTLEBLOWER’S SOURCES, AS INCONSISTENCIES IN COMPLAINT EMERGE Later, Giuliani added: \"I have another affidavit, this time from another Ukrainian prosecutor who says that the day after Biden strong-armed the president to remove Shokin, they show up in the prosecutor’s office -- lawyers for Hunter Biden show up in the prosecutor’s office and they give an apology for dissemination of false information.\" After anchor George Stephanopoulos expressed skepticism, Giuliani fired back: \"How about if I -- how about if I tell you over the next week four more of these will come out from four other prosecutors? ... No, no, no, George, they won’t be [investigated], because they’ve been online for six months, and the Washington press will not accept the fact that Joe Biden might have done something like this.\" Speaking separately to Fox News' \"Sunday Morning Futures,\" Giuliani brought up the affidavits and called the situation Clintonesque. “The pattern is a pattern of pay for play. It includes something very similar to what happened to the Clinton Foundation,\" Giuliani said, \"which goes to the very core of, what did Obama know and when did he know it?\" CLICK HERE TO GET THE FOX NEWS APP Giuliani referred to a December 2015 New York Times article about Hunter Biden, Burisma and a Ukrainian oligarch, and how the younger Biden's involvement with the Ukrainian company could undermine then-Vice President Biden's anti-corruption message. \"The question is,\" Giuliani asked, \"when Biden and Obama saw that article, about how the son was pulling down money from the most crooked oligarch in Russia, did Obama call Biden in and say, 'Joe, how could you be doing this?'\" “Tucker Carlson Tonight” producer Alex Pfeiffer contributed to this report.",
      "date": "September 30",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Former Democratic Sen. Joe Lieberman: Joe Biden had nothing 'to apologize for'",
      "url": "https://www.foxnews.com/politics/former-democrat-joe-lieberman-joe-biden-had-nothing-to-apologize-for",
      "subtitle": "Former Democratic Sen. Joe Lieberman: Joe Biden had nothing 'to apologize for'",
      "author": "David Montanaro",
      "content": " Former Democratic Sen. Joe Lieberman said Monday he doesn't believe Joe Biden had anything to apologize for after causing an outcry for touting his working relationships with segregationist senators. Biden delivered an apology Saturday to a mostly black audience of several hundred in Sumter, S.C. “Was I wrong a few weeks ago?” Biden asked during the first day of a weekend visit to South Carolina. “Yes, I was. I regret it, and I’m sorry for any of the pain of misconception that caused anybody.” Responding on \"Fox & Friends,\" Lieberman -- who left the Democratic Party in 2006, when he became an Independent -- said Biden was only trying to make the point that it's important to be able to work with people with whom you disagree. TRUMP SINGS PRAISES OF AMERICAN EXCEPTIONALISM IN ELABORATE JULY 4 SALUTE \"I don't think he said anything wrong. It would have been one thing if he voted as a segregationist, but he never did,\" said the 2000 vice presidential nominee. Lieberman, who continued to caucus with the Democrats, said Biden \"didn't respond as well as he could have and should have\" when forcefully challenged on the comment by Sen. Kamala Harris at a Democratic debate last month. He added that the Democratic Party must remain center-left to win back the White House, arguing that those types of candidates were successful last November. \"If the Democratic Party becomes – by the choice of a candidate for President or by the policies it follows in Congress – a far-left party or a revolutionary party, instead of a center-left party or just traditional liberal Democratic Party that gets things done, it’s not going to win,\" he told Steve Doocy, praising House Speaker Nancy Pelosi for taking on the \"three or four far-left members of the House Democratic Caucus.\" CNN’s FAREED ZAKARIA SAYS TRUMP WAS RIGHT ABOUT ASYLUM SYSTEM, 'PAINS ME TO SAY' CLICK HERE TO GET THE FOX NEWS APP Pelosi, D-Calif., dismissed the influence of freshmen lawmakers like Rep. Alexandria Ocasio-Cortez, D-N.Y., downplaying their power amid a flurry of media attention. “All these people have their public whatever and their Twitter world. But they didn’t have any following. They’re four people and that’s how many votes they got,” Pelosi said of Reps. Ocasio-Cortez, Ilhan Omar, D-Minn., Rashida Tlaib, D-Mich., and Ayanna Pressley, D-Mass. The four members voted against a House measure to fund humanitarian assistance at the border.",
      "date": "July 8",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Graham says he loves Joe Biden 'as a person,' but Hunter Biden's Burisma work 'doesn’t pass the smell test'",
      "url": "https://www.foxnews.com/politics/graham-says-he-loves-joe-biden-as-a-person-but-hunter-bidens-burisma-work-doesnt-pass-the-smell-test",
      "subtitle": "Graham says he loves Joe Biden 'as a person,' but Hunter Biden's Burisma work 'doesn’t pass the smell test'",
      "author": "Ronn Blitzer",
      "content": " Republican Sen. Lindsey Graham on Monday doubled down on his calls for former Vice President Joe Biden’s son, Hunter, to be investigated by Congress, signaling he is not moved by his friend and former Senate colleague's bitter allegations that the South Carolina lawmaker is being controlled by President Trump. BIDEN FUMES AT GRAHAM OVER REQUEST FOR DOCUMENTS ON SON “I love Joe Biden as a person but we are not going to give a pass to what is obviously a conflict of interest,” Graham said in a Monday morning tweet. “I believe Hunter Biden’s association on the Burisma board doesn’t pass the smell test. If a Republican was in the same position, they’d certainly be investigated!” The tweet appeared to be in response to comments made during a recent interview with CNN’s Don Lemon. During that interview, Biden said he was “disappointed and quite frankly … angered” because Graham “knows me, he knows my son, he knows there’s nothing to this.” Biden claimed Graham was acting out of fear of opposing Trump and risking reelection. \"Trump is now essentially holding power over him that even the Ukrainians wouldn’t yield to,\" Biden said, later adding, \"I’m just embarrassed by what you’re doing, for you. I mean, my Lord!” Graham had sent a letter to Secretary of State Mike Pompeo Thursday asking for documents related to contacts between both Bidens and former Ukrainian President Petro Poroshenko. Specifically, Graham asked for documents and transcripts of conversations from 2016 between then-Vice President Biden and Poroshenko in relation to an investigation into Ukrainian natural gas company Burisma Holdings, where Hunter Biden had served as a board member. It is Trump's request for Ukraine to investigate the Bidens that has led to the ongoing impeachment inquiry against the president. In his CNN interview, Biden claimed that his personal relationship with Graham should provide a basis for the senator not to go down that road. CLICK HERE TO GET THE FOX NEWS APP Speaking on Fox News’ “Hannity” on Wednesday night, Graham said the phone calls between Biden and Poroshenko coincided with the time frame in which Ukrainian prosecutor Viktor Shokin was fired. Shokin was investigating Burisma Holdings at a time when Hunter Biden sat on its board and while the vice president was leading the Obama administration's diplomatic dealings with Kiev. Though the timing raised concerns among anti-corruption advocates, many Western nations had supported Shokin’s firing. House Intelligence Committee ranking member Rep. Devin Nunes, R-Calif., along with Rep. Jim Jordan, R-Ohio, notified Intelligence Committee Chairman Rep. Adam Schiff, D-Calif., that they plan on subpoenaing Hunter Biden for a closed-door deposition. Fox News' Andrew O'Reilly and Charles Creitz contributed to this report.",
      "date": "4 days ago",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Elizabeth Warren hauls in $24.6M, topping Joe Biden in latest fundraising quarter",
      "url": "https://www.foxnews.com/politics/warrens-24-6-million-biden-fundraising",
      "subtitle": "Elizabeth Warren hauls in $24.6M, topping Joe Biden in latest fundraising quarter",
      "author": "Paul Steinhauser",
      "content": " Democratic presidential candidate Sen. Elizabeth Warren raked in $24.6 million during the July-September fundraising quarter, blowing past former Vice President Joe Biden and coming close to Sen. Bernie Sanders' field-leading haul. The figure affirms the momentum Warren has appeared to be gaining in recent weeks and months, as polls show her now battling Biden – once the unrivaled front-runner – for the primary lead. While Sanders remains in third position in many polls, his fundraising is unmatched, totaling $25.3 million in the third quarter. BIDEN RAISES $15.2 MILLION IN THIRD QUARTER, DOWN $6 MILLION FROM APRIL-JUNE HAUL But Warren's campaign cash number comes close — and is far ahead of the $15.2 million raised by Biden in the last quarter. Warren and Biden are essentially tied for the lead position in most recent national and early-voting-state Democratic nomination polls. The Massachusetts senator, who’s produced one progressive policy proposal after another, announced her fundraising figures on Twitter, saying, “I’m grateful down to my toes for every grassroots supporter who chipped in.” “Together, we’re building a movement that’s going to put power back in the hands of the people,” she pledged. THE LATEST FROM FOX NEWS ON THE 2020 PRESIDENTIAL CAMPAIGN Warren’s third-quarter haul is up nearly $6 million from what she raised during the April-June quarter. Her campaign announced that they received 943,000 contributions from more than a half-million individual donors, with 300,000 of those donors giving for the first time. And they reported that the average contribution to Warren was $26. South Bend, Indiana Mayor Pete Buttigieg reported raising $19.1 million this quarter. Sen. Kamala Harris of California reported bringing in $11.6 million in the third quarter, with tech entrepreneur Andrew Yang hauling in $10 million, triple what he raised in the second quarter. Sen. Cory Booker of New Jersey announced he raised over $6 million. Best-selling spiritual author Marianne Williamson said she raised over $3 million and Sen. Michael Bennet of Colorado reported raising $2.1 million. President Trump’s reelection team, meanwhile, blew past all of them. The campaign announced that it and the Republican National Committee combined had brought in a massive $125 million in the third quarter. Asked Thursday during a campaign stop in California how she could compete with Trump's massive war chest if she reaches the general election, Warren touted her \"grassroots movement\" and highlighted \"that's going to be our comparative advantage to win in November 2020.\" Tuesday was the first day campaigns could announce their third-quarter numbers, but they have until Oct. 15 to file their fundraising reports with the Federal Election Commission. Campaign cash is a crucial barometer of a candidate’s appeal and popularity and of his or her campaign’s strength. Fundraising dollars can be used by the candidates to pay for campaign staff and grassroots outreach efforts, travel and ads. Fox News' Tara Prindiville contributed to this report.",
      "date": "October 4",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Biden still slidin’",
      "url": "https://www.foxnews.com/politics/biden-still-slidin",
      "subtitle": "Biden still slidin’",
      "author": "Chris Stirewalt",
      "content": " **Want FOX News Halftime Report in your inbox every day? Sign up here.**\n\nOn the roster: Biden still slidin’ - Steyer sticking around - Pelosi rides to rescue - SupCo back in session - So fresh you can taste the squeak\n\nBIDEN STILL SLIDIN’ \nIBD: “Elizabeth Warren has taken a narrow lead over Joe Biden in the race for the Democratic presidential nomination, the October IBD/TIPP Poll found. Both candidates continue to lead in a head-to-head matchup against President Trump, though Biden had a more comfortable lead, outside the margin of error. Elizabeth Warren had the support of 27%, with Joe Biden backed by 26% and Bernie Sanders a distant third at 10%. Support for South Bend, Ind., Mayor Pete Buttigieg climbed to 7% from 5%. No other candidate polled more than 3%. The October IBD/TIPP Poll showed continued momentum for Warren. Last month's poll had shown support for Warren jumping to 24% from 17%. Meanwhile, Biden's support saw further erosion, after slipping to 28% in September from 30% in August. Sanders, whose nomination prospects could suffer after his heart attack last week, saw support fall after registering 12% the prior two months.”\n\nBiden expands lead in South Carolina - Fox News: “Joe Biden increases his lead in the Palmetto State, as a growing number of South Carolina Democratic primary voters want a candidate who can defeat President Trump. The former vice president is ahead by 29 points, according to a Fox News Poll. That’s up from a 21-point lead in July. Biden captures 41 percent support among Democratic primary voters (+6 points since July), Elizabeth Warren trails with 12 percent (+7), and Bernie Sanders gets 10 percent (-4). … Kamala Harris receives 4 percent, down from 12 percent. Tom Steyer, who entered the race in July, also gets 4 percent. Cory Booker (3 percent) and Pete Buttigieg (2 percent) held steady. All others receive 1 percent or less. South Carolina holds its Democratic primary February 29, 2020.  … Biden [has] large leads among blacks (+41 points), men (+31), and voters over age 45 (+38).”\n\nTrump trails Dems in Wisconsin - Fox News: “Wisconsin voters are unhappy with how things are going in the country, oppose the border wall, think tariffs hurt the economy, and disapprove of the job President Trump is doing. … Joe Biden bests Trump by 9 points (48-39 percent) and has the only lead outside the poll’s margin of error. Bernie Sanders is up by 5 over Trump (45-40) and Elizabeth Warren has a 4-point edge (45-41). In each case, the remaining 13-14 percent of undecided/third-party voters is enough to shift the race either way. Trump receives 41 percent support or less in each of the matchups -- well below the 47 percent he won the Badger State with in 2016. At the same time, none of the Democrats hit 50 percent.”\n\nHave you tried turning your campaign off, then turning it back on? - NYT: “At campaign events this past week, Ms. [Kamala] Harris debuted a fresh stump speech focused on the impeachment inquiry into Mr. Trump, an issue in which her campaign believes she is uniquely suited to lead as a former prosecutor. She began each of the rallies, titled ‘Dude Gotta Go,’ with a lengthy discussion of the president’s purported crimes, and concluded by talking directly about the idea of ‘electability,’ which she described as the ‘elephant’ in the 2020 race, and the fear that the country was not ready to elect a black woman as president. … In strategic terms, her campaign’s choice to pivot to Iowa is a concession that its initial theory of the presidential race was at least partially incorrect. From the start, her longtime advisers mapped out a national strategy that highlighted primaries with more diverse electorates … while conserving resources often used in early states for television advertisements in later ones.”\n\nSTEYER STICKING AROUND \nFox Business: “The wealthiest Democrat in the 2020 race, billionaire Tom Steyer, announced Sunday that he qualified for the November debate. Steyer is worth a whopping $1.6 billion. Former Maryland Rep. John Delaney is the runner-up with a net worth of roughly $200 million. ‘Tom is surging because he’s not part of the establishment and his message of ending the corporate takeover of our government is resonating,’ his campaign manager Heather Hargreaves said in a statement. ‘Tom is excited to continue getting out there and meeting with voters all across the country, hearing their stories, and connecting with them personally, and we are thrilled to see him on stage sharing his vision with the full country at the DNC debate in Ohio on October 15th and in November.’”\n\nSanders takes aim at DNC corporate donors in new plan - Politico: “Bernie Sanders, a longtime critic of the nation’s campaign finance system, is releasing a plan Monday aimed at ending the influence of corporate cash in politics, including at the 2020 Democratic National Convention. The Vermont senator pledges to put a stop to all corporate PAC contributions to the convention if he wins the Democratic Party’s presidential nomination. AT&T, Facebook, Independence Blue Cross and other companies each gave seven-figure donations to the event’s host committee in 2016. … His proposal also calls for a lifetime lobbying ban on Democratic National Committee chairs and co-chairs, as well as a prohibition on them working for companies that hold federal contracts or are trying to obtain government approval for mergers or other projects.”\n\nDem race becomes one of uncertainty - WaPo: “Interviews with more than two dozen Democratic leaders, top strategists and former elected officials revealed that most are still holding out judgment about how — or how much — the events will shift the race. But they point to several worrying factors [about Biden, Warren and Sanders]… Others expressed skepticism that any Democrat would be able to compete against Trump’s unmatched ability to shift the public’s focus. … The shifting dynamic has already altered campaign strategies, as some trailing candidates focus on early-voting states such as Iowa and New Hampshire… But for the front-running trio, the events of the last two weeks have served as a public test of how they would handle crises in a general election.”\n\nTHE RULEBOOK: KEEP IN MIND… \n\n“…it will be equally forgotten that the vigor of government is essential to the security of liberty; that, in the contemplation of a sound and well-informed judgment, their interest can never be separated…” – Alexander Hamilton, Federalist No. 1\n\nTIME OUT: THE COMEBACK OF ‘THE NATION’S RIVER’\nSmithsonian: “When George Washington chose to build his Mount Vernon estate along the Potomac River, he declared the then-pristine body of water ‘the nation’s river.’ At the time, even dolphins were a common sight. In fact, as Karin Bruillard at the Washington Post reports, the porpoises were seen as far upriver as Alexandria, Virginia, in the 1840s. But by the 1960s, the river that flows through the nation’s capital had lost its luster. … Now, after almost 50 years of pollution control, clean-up and restoration efforts, researchers have catalogued well over 1,000 bottlenose dolphins living, mating, and even giving birth in the lower reaches of the river. … Over the past four years, researchers from Georgetown University’s Potomac-Chesapeake Dolphin Project have been cataloguing dolphins in the lake-like area where the Potomac joins the Chesapeake Bay, reports Bruillard for the Post. … But the most exciting development came in August, when researchers witnessed a dolphin giving birth in the river.”\n\nFlag on the play? - Email us at HALFTIMEREPORT@FOXNEWS.COM with your tips, comments or questions.\n\nSCOREBOARD\nDEMOCRATIC 2020 POWER RANKING\nBiden: 27.2 points (↓ 0.4 points from last wk.)\nWarren: 24.6 points (↑ 3.8 points from last wk.)\nSanders: 14.6 points (↓ 1.4 points from last wk.)\nHarris: 4.6 points (↓ 2 points from last wk.)\nButtigieg: 6.2 points (↑ 0.8 points from last wk.)\n[Averages include: IBD, Monmouth University, Quinnipiac University, Fox News and NBC News/WSJ.]\n\nTRUMP JOB PERFORMANCE \nAverage approval: 40.8 percent\nAverage disapproval: 53.8 percent\nNet Score: -13 percent\nChange from one week ago: ↓ 2 points\n[Average includes: IBD: 43% approve - 54% disapprove; Quinnipiac University: 41% approve - 53% disapprove; Monmouth University: 43% approve - 53% disapprove; CNBC: 37% approve - 53% disapprove; Gallup: 40% approve - 56% disapprove.]   \n\nWANT MORE HALFTIME REPORT? \nYou can join Chris and Brianna every day on Fox Nation. Go behind-the-scenes of your favorite political note as they go through the must-read headlines of the day right from their office – with plenty of personality. Click here to sign up and watch!\n\nPELOSI RIDES TO RESCUE\nWaPo: “A Democratic group with close ties to House Speaker Nancy Pelosi is set to spend more than $1 million on ads set to begin airing this week aimed at bolstering a handful of vulnerable House Democrats as the impeachment probe unfolds. The ads from House Majority Forward, examples of which were reviewed by The Washington Post, do not mention the word ‘impeachment.’ Instead, they focus solely on the accomplishments of the 11 individual lawmakers targeted in the campaign. … The campaign represents the first tranche of television ads to be aired by a group with close ties to the party establishment. House Majority Forward is an affiliate of House Majority PAC, the largest Democratic super PAC focused solely on House races. The focus on non-impeachment issues is further evidence that Pelosi (D-Calif.) and other Democratic leaders are aiming to sell a ‘walk and chew gum’ image for the party — that they can investigate and possibly impeach President Trump while also working to make progress on jobs, health care and other concerns.”\n\nTeam Trump sends Pence impeachment Dems districts - Politico: “The White House wants to make vulnerable House Democrats pay for impeachment. Starting this week, Vice President Mike Pence will embark on a national tour of congressional districts represented by Democrats who’ve come out in support of the inquiry. … Each of the districts on Pence's itinerary were won by Trump in 2016, making them potent targets for Republicans. The vice president will travel Wednesday to the southwest Iowa district of Rep. Cindy Axne, and Thursday he’s slated to visit the suburban Twin Cities district of another freshman Democrat, Minnesota Rep. Angie Craig. The vice president is then scheduled to barnstorm an array of battleground districts, including those held by Michigan Rep. Elissa Slotkin and Virginia Rep. Abigail Spanberger.”\n\nMcConnell uses campaign ad to flex impeachment muscle - Louisville Courier Journal: “Earlier [last] week, Senate Majority Leader Mitch McConnell said his chamber would have ‘no choice’ but to hold a trial on whether to remove President Donald Trump from office if the House votes to impeach. But in a new campaign ad on Facebook, the Kentucky Republican makes clear that any impeachment attempt will fail as long as he remains in charge of the Senate. ‘Nancy Pelosi's in the clutches of a left wing mob. They finally convinced her to impeach the president,’ McConnell says directly to the camera in a 17-second video. ‘All of you know your Constitution. The way that impeachment stops is a Senate majority with me as majority leader.’ … The McConnell campaign, according to Facebook's ‘Ad Library,’ started running the digital ad last week…”\n\nSUPCO BACK IN SESSION\nFox News: “Now, as the U.S. Supreme Court prepares to launch its new term Monday, a 5-4 conservative majority could be poised to provide the White House with significant legal and political victories -- or setbacks. Such are the unusual dynamics now percolating from the nation's highest court. The justices' election-year agenda includes cases dealing with Trump's executive power over immigration, along with LGBTQ workplace discrimination, gun rights and abortion regulations. All are teed up to be argued this term, with religious liberty and health-care appeals good bets to be added to the docket. All will likely be decided in a presidential election year. ‘The court will be an issue in 2020 but that's perfectly normal. It was a huge issue in 2016, it helped get President Trump elected,’ said Paul Smith, a Georgetown University law professor who has argued 21 cases before the high court. ‘And it will be so again, precisely because it's become such an important part of our system.’”\n\nPLAY-BY-PLAY\nTrump pulls back troops from northern Syria ahead of Turkish assault, Pentagon officials ‘blindsided’ - Fox News\n\nTrump to rally for GOP candidates for governor in Louisiana Friday - KALB\n\nTrump granted reprieve on tax return case - Fox News\n\nMark Kelly outraises Martha McSally for third quarter - Arizona Republic\n\nWarren and Schumer’s 20 year history - National Journal\n\nPergram: Ever since impeachment inquiry was announced, it's been getting crazier out there - Fox News\n\nJimmy Carter recovering after fall at Georgia home - WAGA\n\nAUDIBLE: HABITUAL LINE STEPPER\n“We say, ‘Don’t cross this line.’ Okay, you crossed it. So, ‘Don’t cross this line.’ We’re finally at a point where patience is exhausted, reason is exhausted and, quite frankly, the voters are exhausted.” – Tom Rath, a longtime member of the GOP in New Hampshire, explaining the crossroads Republicans are at with the president right now, per the WaPo.\n\nFROM THE BLEACHERS\n\n“A week ago (give or take a few days), you ran a lead article to the effect that over the months ahead you were going to soberly and impartially report the facts at every turn in the very ‘wine-dy’ (meaning curve-y)  road to the 2020 election. Your lead article [Friday] entitled ‘Trump Offers No Off Ramps to Republicans’ strikes me (after the second reading) as anything but consistent with what I understood to be your sober and impartial mission. It seems that your article is strongly slanted against Trump from beginning to end. If I am wrong, can you explain what your ‘Off Ramp’ article would have to say in order to fail your criteria of impartiality, none-emotional, none-judgmental reporting and analysis? I'm genuinely baffled.” – Eric Hutchins, Santa Barbara, Calif.\n\n\n[Ed. note: I gather from your sentiments, Mr. Hutchins that you are a political supporter of the president. And I understand that for the president’s supporters these are trying, frustrating, exhausting days. If one agrees with the president that his conduct relating to Joe Biden and Ukraine has been “perfect” then what’s happening now must seem like madness. But to most observers, the president failed in his duty by entwining domestic politics with foreign policy. It’s proving to be quite damaging. Now, I don’t care who believes what. You may think Trump hung the moon or you may think Trump is Old Scratch himself. Not my problem. What I promised you on Sept. 26 was that we would not obsess over minutiae from the day to day battle between the two sides over impeachment: “You have plenty of other options for getting the latest details on what this unnamed source said or what that hearing may or may not have revealed. We’re going to stay focused on the political repercussions because that’s our job.” I’m not sure how I’m supposed to do that and not talk about what’s happening in the news. The president is getting absolutely smashed over his conduct vis-a-vis Biden. Support for impeachment has jumped hugely. Republicans are in a defensive crouch and every day one of the president’s team seems to make another blunder that makes the situation even worse. It’s a political catastrophe. It may end up actually working out for Trump and the GOP. Democrats are making plenty of errors of their own and this may all blow up in their faces. And if it does, we’ll certainly be talking about it. But right now, the president and his core supporters don’t seem to understand what a pickle he’s put them in — and the huge problems he’s creating for the GOP. Trump had just gotten out of the woods on the Mueller probe and the very next day needlessly put himself in this jackpot. The position that the president has taken — the “perfect” doctrine — does not reflect the political reality for many members of his party. They need to be able to say that they disapprove, like Democrats did a generation ago, but think America should now “move on” from a divisive distraction. It’s none of my business who wins this fight. That’s up to you. But if you’re interested in my abilities as a forecaster and analyst, it will mean hearing things that you don’t always agree with and certainly discussing matters that are bad news for your team. But it will also mean that I will tell it to you straight. That I will be fair-minded. That I will listen and admit when I’m wrong. That I will give you my thoughts without fear or favor. That we will always do our best.]\n\n\n“Chris, I’ll keep this short and sweet: 1. Where can I find the law that prohibits a candidate from getting ‘dirt’ on his political opponent from a foreign government? 2. Why is it against the law? Don’t I as a constituent have the right to know if a candidate has broken the law regardless of where the act was committed? 3. If you can never investigate a political opponent for deeds done in a foreign country, what’s to keep someone from simply committing all of their illegal acts in a foreign country?” – Meredith Shoemaker, Sugar Land, Texas\n\n\n[Ed. note: The president mustn’t do such things himself. And he especially mustn’t do them when he would be the direct beneficiary. We have a Justice Department and a Department of State. We have federal police at the FBI. We have all manner of means by which to combat corruption here and abroad. But when it’s about his political opponents, the president must do his best to stay out of it. Doing otherwise diminishes the confidence Americans have in our legal system to provide dispassionate justice. Presidents of both parties have failed this test in the past so we know how real the temptation is. But it’s not something Americans want to become normal. That’s how governments operate in places like Turkey, Russia and China: People in power use that power to stifle their rivals. I know Trump believes the system is rigged against him, but he is still the president and he must find some way to better honor that high vocation or voters will surely throw him out next year.]\n\n\n“Unforced errors are the worst kind of errors, in sports and everywhere else. I am reminded of Watergate back when President Richard Nixon was running for re-election. No benefit or advantage was gained from the break-in, and Nixon won re-election in a landslide anyway. Here now President Trump is trying to compromise Joe Biden as a candidate with actions that are expected to have substantial negative consequences for the incumbent – and for what? The race for the Democratic nominee is far from over, but Biden seems to be suffering from the ‘Curse of the Early Frontrunner’ and slipping in the polls for many other reasons than those that are being brought to light from any revelations out of The Ukraine. Hindsight, but also no small amount of foresight and experience, suggests that it would have been (and is) best to ‘keep your powder dry’ for whomever is the actual nominee and not waste time and resources going after those who will not be running against you. If Joe Biden is not the eventual Democratic nominee, this may well be one of those unforced errors that may even approach the impact and magnitude of the Watergate disaster. So much for learning from our past mistakes.” – Kent Haldorson, Beaverton, Ore.\n\n\n[Ed. note: That’s a very interesting take, Mr. Haldorson. I’m going to chew on it for a while. If I write on it, it will be with due credit to you, sir.]\n\nShare your color commentary: Email us at HALFTIMEREPORT@FOXNEWS.COM and please make sure to include your name and hometown.\n\nSO FRESH YOU CAN TASTE THE SQUEAK\nFox News: “And we thought mustard ice cream was a stretch. An ice cream vendor in Ecuador is reportedly seeing demand for her new — and arguably strangest — offering. It's made using the flesh of guinea pigs. Guinea pig meat, known as ‘cuy’ in Ecuador, is typically eaten as a savory dish there and in other South American countries, like Peru and Colombia, where it's often grilled and served whole, per NPR. But María del Carmen Pilapaña, who runs a small stall near the capital of Quito, has stumbled upon a completely new preparation — and it is a hit, she tells The Associated Press. … Pilapaña makes the ice cream by cooking down the guinea pig’s meat and making a pate of sorts before blending it with milk or cream, freezing it, and serving it just like she does with her other flavors.”\n\nAND NOW, A WORD FROM CHARLES…\n“As I became convinced of the practical and theoretical defects of the social-democratic tendencies of my youth, it was but a short distance to a philosophy of restrained, free-market governance that gave more space and place to the individual and to the civil society that stands between citizen and state.” – Charles Krauthammer (1950-2018) writing in the National Review on Oct. 25, 2013.\n\nChris Stirewalt is the politics editor for Fox News. Brianna McClelland contributed to this report. Want FOX News Halftime Report in your inbox every day? Sign up here.",
      "date": "October 7",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Joe Biden defends son Hunter's Ukraine work: 'My son did nothing wrong. I did nothing wrong'",
      "url": "https://www.foxnews.com/politics/biden-answers-question-on-hunter-biden-my-son-did-nothing-wrong-i-did-nothing-wrong",
      "subtitle": "Joe Biden defends son Hunter's Ukraine work: 'My son did nothing wrong. I did nothing wrong'",
      "author": "Brooke Singman",
      "content": " Former Vice President Joe Biden insisted during the 2020 Democratic presidential primary debate on Tuesday night that neither he nor his son Hunter did anything \"wrong\" when it comes to the younger Biden's past work in Ukraine. Biden was asked why his son was able to hold a lucrative role serving on the board of a Ukrainian natural gas firm, Burisma Holdings, while he was running U.S.-Ukraine policy as former President Barack Obama’s vice president. DEMS UNITE BEHIND IMPEACHING TRUMP AT DEBATE, EVEN AS PELOSI SAYS THERE WON'T BE A VOTE “My son did nothing wrong. I did nothing wrong,” Biden said. “I carried out the policy of the United States government, which was to root out corruption in Ukraine and that’s what we should be focusing on.” Hunter Biden, earlier Tuesday during an interview with ABC’s “Good Morning America,” likewise defended his role, claiming he did nothing improper, though he did acknowledge it was \"poor judgment\" to have joined the company's board. “I know I did nothing wrong at all. Was it poor judgment to be in the middle of something that is a swamp in many ways? Yeah,” the younger Biden said Tuesday morning. He also acknowledged in the interview that if he had a different last name, he would not have been appointed to the board of Burisma. During the debate, Biden continued to defend his son, saying that his “statement speaks for itself,” and that the focus should be on President Trump asking Ukraine to interfere in the 2020 elections. “Rudy Giuliani, the president and his thugs have already proven they are flat-out lying,” Biden said. The Ukraine controversy began when a whistleblower reported that the president had pushed Ukrainian President Volodymyr Zelensky to launch an investigation into the Biden family’s business dealings in Ukraine—specifically, why Biden pressured former Ukrainian President Petro Poroshenko to fire a top prosecutor, Viktor Shokin, who was investigating Burisma Holdings, where Hunter was on the board. The president's request came after millions in U.S. military aid to Ukraine had been frozen, something critics have cited as evidence of a quid pro quo arrangement. CLICK HERE TO GET THE FOX NEWS APP That whistleblower report and the fallout from the transcript of the highly controversial phone call between Trump and Zelensky this summer sparked a formal impeachment inquiry in the House of Representatives. House Speaker Nancy Pelosi, D-Calif., though, said Tuesday that the House would not vote, at this point in time, to formalize the impeachment proceedings. Biden maintained Tuesday that Trump’s efforts were simply because of his concerns surrounding his 2020 reelection chances, particularly against Biden. Several polls have shown Biden as Dems' presidential frontrunner throughout the primary season, and some have further suggested he would have an edge against Trump in a general election. “What we have to do now is focus on Donald Trump,” Biden continued, repeating a line he has used frequently on social media. “He doesn’t want me to be the candidate. He’s going after me because he knows if I get the nomination, I will beat him like a drum.”",
      "date": "October 15",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Jared Kushner slams Joe Biden, claims he's been cleaning up 'messes' ex-VP left behind",
      "url": "https://www.foxnews.com/politics/jared-kushner-joe-biden-mess-white-house-israel-impeachment",
      "subtitle": "Jared Kushner slams Joe Biden, claims he's been cleaning up 'messes' ex-VP left behind",
      "author": "Danielle Wallace",
      "content": " Jared Kushner, a senior adviser to President Trump, said Tuesday that most of his White House work involves \"cleaning up the messes\" left behind by former Vice President Joe Biden. Kushner, who married the president’s daughter Ivanka Trump a decade ago, made the remarks in an exclusive interview with News Israel 13. He was responding to comments Biden made over the weekend on CBS’s “60 Minutes,” in which the Democrat charged it was “improper” for Trump to appoint his son-in-law and daughter to senior positions in his administration. MORE QUESTIONS EMERGE ABOUT HUNTER BIDEN'S BUSINESS DEALINGS, EVEN AS TRUMP IMPEACHMENT INQUIRY INTENSIFIES “A lot of the work that the president’s had me doing over the last three years has actually been cleaning up the messes that Vice President Biden has left behind,” Kushner told News Israel 13. “I think President Trump is entitled to pick his team. We’ve worked with him for a long time and I think we’ve done a good job at trying to help him be successful.” Kushner also addressed the House Democrats' ongoing Trump impeachment inquiry, which has shed light on Biden’s son, Hunter Biden, who reportedly used his father’s name to gain a seven-figure job at one of Ukraine’s largest natural gas companies despite having no prior related worked experience. Hunter Biden worked for the company, Burisma Holdings, at the same time his father, while vice president, was seeking the ouster of a Ukrainian prosecutor who was investigating a top Burisma official. The impeachment probe stems from a whistleblower’s complaint that President Trump, during a July phone call, asked Ukrainian President Volodymyr Zelensky to investigate the Biden family’s business dealings in the country. Trump made the request while the U.S. was withholding military aid but maintains there was no quid quo pro. Kushner insisted that the president was clear of wrongdoing. “They’ve been trying to impeach the president for the past three years or get him out of office and they’ve been unsuccessful at that,” Kushner said. “The best thing going for the president is that he hasn’t done anything wrong, and at this point, they’ve investigated him over and over and over again, and I think the American people are sick and tired of it.” “The president’s record of accomplishments is unimpeachable, and he’s going to continue to do the things that the American people care about,” Kushner continued.  “If Congress wants to be a part of the work we do to try to make the country stronger and more prosperous, we welcome them to join us. If they want to play silly games, we’ll obviously deal with that in an appropriate manner, but we’re not going to let that distract us as an administration.” Kushner, who is Jewish, traveled to Israel on Monday where he met separately with Prime Minister Benjamin Netanyahu and former military chief Benny Gantz. The two rivals were deadlocked following last month's Israeli elections, with neither able to easily form a majority coalition, raising the possibility of an unprecedented third election in less than a year. Kushner urged Gantz and Netanyahu to form a government so Israel would be able to seize on the “tremendous opportunities” in the region, including military and business partnerships with Saudi Arabia and other Middle Eastern nations. “Benny was a great general in the IDF [Israeli Defense Forces] and he did a great job there and served Israel tremendously, and he seems to have a good intention to try and bring good to Israel, and hopefully he will be able to work with Prime Minister Netanyahu and find a way to move forward,\" Kushner told News Israel 13. He also responded to Israeli concerns after President Trump made the call to pull U.S. troops out of Syria, a decision some critics said left the Kurds, who are American allies, vulnerable to Turkey and other forces. CLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM “Anyone in Israel who thinks it has any implications for the U.S.-Israel relationship is badly mistaken,” Kushner said, “because under President Trump, the bond between America and Israel has been significantly strengthened and our intention is to continue to do more of the same.” Fox News' Brooke Singman, Brie Stimson and The Associated Press contributed to this report.",
      "date": "October 30",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Joe Biden officially launches 2020 presidential bid",
      "url": "https://www.foxnews.com/politics/biden-officially-launches-2020-presidential-bid",
      "subtitle": "Joe Biden officially launches 2020 presidential bid",
      "author": "Paul Steinhauser",
      "content": " Former Vice President Joe Biden, in an online video Thursday, officially declared his candidacy for president in 2020, capping off weeks of intrigue and media speculation. He enters a crowded field of Democratic contenders aiming to unseat President Trump -- nearly 32 years after he announced his first campaign for president. The campaign is Biden’s third for the White House, having also unsuccessfully run in 1988 and 2008. \"The core values of this nation, our standing in the world, our very democracy, everything that has made America -- America -- is at stake. That’s why today I’m announcing my candidacy for president of the United States,\" Biden tweeted early Thursday. With the announcement, which followed months of deliberations, Biden becomes a front-runner in an incredibly crowded field of Democratic presidential contenders all vying to face off next year against Trump. The president welcomed Biden into the race, warning him that the race will be \"nasty.\" \"Welcome to the race Sleepy Joe,\" Trump tweeted. \"I only hope you have the intelligence, long in doubt, to wage a successful primary campaign. It will be nasty - you will be dealing with people who truly have some very sick & demented ideas. But if you make it, I will see you at the Starting Gate!\" Biden, along with independent Sen. Bernie Sanders of Vermont -- who is making his second straight White House run -- have consistently topped the polls in the race for the Democratic nomination. In Thursday's video, the former vice president pointed to the violent clashes in Charlottesville, Virginia in August of 2017 at a large white nationalist rally, Biden took aim at Trump’s response that “there were some very fine people on both sides.” “With those words, the president of the United assigned a moral equivalence between those spreading hate and those with the courage to stand against it,\" Biden charged. \"And in that moment, I new the threat to this nation was unlike any I had seen in my lifetime. I wrote at the time that we’re in the battle for the soul of this nation. Well, that’s even more true today. We are in the battle for the soul of this nation.\" Biden argued that \"if we give Donald Trump eight years in the White House, he will forever and fundamentally alter the character of this nation, who we are, and I cannot stand by and watch that happen.\" Fox News reported last week that the theme of the announcement would be ‘the battle for the soul of America.’ Biden is expected to follow up the announcement with his first high-dollar fundraiser in the Philadelphia home of Comcast executive David Cohen Thursday evening and appear at a local union hall in Pittsburgh on Monday. The former Delaware senator has for weeks been rallying potential donors in an effort to gain momentum, noting that Sanders and former Rep. Beto O'Rourke of Texas managed to raise $6 million within 24 hours of launching their candidacy. The Biden campaign said that the former vice president will lay out his “vision for rebuilding America’s middle class” at the Pittsburgh event. Then he’s scheduled to travel to the four states that vote first in the primary and caucus nominating calendar. They add that Biden will hold a rally in Philadelphia on May 18, likely at the city’s Museum of Art – known nationally for the scene of the fictional Rocky Balboa’s training on the museum’s steps in the movie \"Rocky.” The start and finish of his initial campaign swing in Pennsylvania is no surprise. The state – long a crucial battleground in presidential elections – was one of the key states Trump flipped in the 2016 election to help him capture the White House. And while Biden has long lived in Delaware and represented that state for nearly four decades in the Senate, he was born and spent his early years in Scranton, Pennsylvania and the Keystone State has always remained special to him. Moments after his announcement, Biden was endorsed by Sen. Bob Casey of Pennsylvania. Biden’s long awaited and much anticipated presidential campaign launch comes after facing allegations in recent weeks from women that he had made them feel uncomfortable in the past with what was described as inappropriate touching. It instantly become a top story online and on the cable news networks, forcing the former vice president to play defense in the #MeToo era and defend his decades old brand of close up and personal politics \"Social norms are changing. I understand that, and I've heard what these women are saying,\" Biden explained in a video released during the height of the furor, which threatened his looming candidacy. \"Politics to me has always been about making connections, but I will be more mindful about respecting personal space in the future. That's my responsibility and I will meet it.\" While Biden didn’t apologize to those who raised the allegations, he did say that \"I’m sorry I didn’t understand more. I’m not sorry for any of my intentions. I’m not sorry for anything I’ve ever done. I’ve never been disrespectful intentionally to a man or a woman.” And referring to well-publicized past episodes of getting too close for comfort with fellow politicians, their family members and others, the former vice president explained that \"it is incumbent on me and everybody else to make sure that if you embrace someone, if you touch someone, it’s with their consent, regardless of your intentions.\" While the controversy was dominating headlines, Biden’s inner circle was continuing to reach out to Democratic operatives as they quietly mapped out a national campaign structure as well as staff in the early voting primary and caucus states. And in the days leading up to the launch, Biden picked up the pace on reaching out to top donors and supporters, with the acknowledgment that he’ll be judged by how much he fundraising dollars he hauls in in the first 24 hours after declaring his candidacy. Biden has long had his eyes on his presidency: In June of 1987, Biden first launched a bid for the 1988 Democratic nomination.The then-senator from Delaware was considered one of the stronger candidates in the emerging Democratic field. But three months into his campaign, he faced newspaper headlines that he had plagiarized a speech by British politician Neil Kinnock. The incident sparked a controversy, knocking Biden out of the race well before the start of the primaries and caucuses. Biden ran a second time for the Democratic nomination in the 2008 cycle, declaring his candidacy in January of 2007. Despite his long record, his campaign never caught lightning in a bottle. There were also some well-publicized gaffes, including his description of then-Sen. Barack Obama. \"I mean, you got the first mainstream African-American who is articulate and bright and clean and a nice-looking guy,\" Biden said at the time. \"I mean, that's a storybook, man.” The comments quickly spelled trouble for Biden, forcing him to apologize. Biden’s bid was also overshadowed by Obama and then-Sen. Hillary Clinton of New York, who ended up battling each other in an historic and marathon quest for the nomination. Biden dropped out of the race after coming in fifth in the Iowa caucus, grabbing less than one percent of the vote. But seven months later, Obama selected Biden as his running mate. The pair won the November 2008 election, and were re-elected in 2012. Biden seriously considered another run for the White House in 2016, but grappling with the death of his eldest son Beau, the Vice President announced in October of 2015 that he would not launch a campaign. Speaking from the podium at the Rose Garden, Biden explained that he had been emotionally drained by the death of his son and stressed that \"nobody has a right ... to seek that office unless they're willing to give it 110 percent of who they are.” But the decision not to run haunted him. He noted in early 2016 that he regretted not running “every day.” Trump’s upset victory over Clinton in the 2016 presidential election changed the dynamic for Biden. He soon became a vocal critic of the Republican in the White House, and speculation sprang up that Biden would consider a final presidential bid in 2020. Trips to New Hampshire in 2017 and to Iowa, South Carolina and Iowa in 2018 fueled the flames. Biden dropped a major hint of his pending 2020 campaign in early March. After walking to the podium at the at the annual convention of the International Association of Fire Fighters (IAFF) to chants of “run Joe, run,” by the union crowd, Biden said “I appreciate the energy you showed when I got up here. Save it a little longer. I may need it in a few weeks.” The comments brought a standing ovation from the mostly blue collar audience that Biden feels he can count on as he runs for president. SANDERS FACES HECKLERS In early April, Biden told reporters \"I am very close to making a decision to stand before you all relatively soon.\" Asked why the hold-up, Biden quickly answered, \"The hold-up is to put everything together.\" At the time, Biden also pushed back against the perception that he's a moderate in a party that's increasingly moving to the left. He defended himself, saying he'll stack his record against \"anybody who has run or who is running now or who will run.\" And highlighting his early public push for same-sex marriage during the Obama administration, he stressed \"I'm not sure when everybody else came out and said they're for gay marriage.\" Biden was born on November 20, 1942, and lived in Scranton, Pennsylvania for ten years until moving with his family to Delaware. He became an attorney in 1969 and was elected to the New Castle City Council in 1970. He won what was out the outset a long-shot election to the Senate two years later, becoming the sixth-youngest senator in the nation’s history. He was re-elected six times before resigning in 2009 to take on the duties as vice president. During his nearly four decades in the Senate, he was a longtime member and former chair of the Foreign Relations Committee. He also served as chairman of the Senate Judiciary Committee. But Biden’s role as Judiciary Committee chairman in 1991 during the confirmation hearings of Supreme Court nominee Clarence Thomas is arguably more controversial today than it was at the time nearly three decades ago. In March he lamented the impact of \"white man's culture\" and bemoaned his own role in the hearings that undermined witness Anita Hill's credibility. Biden said that Hill, who is black, should not have been forced to face a panel of \"a bunch of white guys\" about her sexual harassment allegations against Thomas, who was nominated by President George H.W. Bush. GET THE FOX NEWS APP \"To this day I regret I couldn't come up with a way to give her the kind of hearing she deserved,\" he said. \"I wish I could have done something.\" But his comments elicited derision by many women, who argued that as the chairman of the committee, he had the power to do something. Biden married his wife Neilia in 1966. In 1972, soon after his election to the Senate, his wife and their daughter Naomi were killed in an automobile accident. Sons Beau and Hunter Biden survived. He married his second and current wife Jill five years later. Fox News' Bradford Betz contributed to this report.",
      "date": "April 25",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Joe Biden heaps praise on GOP during Massachusetts fundraiser",
      "url": "https://www.foxnews.com/politics/joe-biden-theres-an-awful-lot-of-really-good-republicans",
      "subtitle": "Joe Biden heaps praise on GOP during Massachusetts fundraiser",
      "author": "Brie Stimson",
      "content": " Democratic 2020 presidential frontrunner Joe Biden praised Republicans as “decent people” at a Massachusetts fundraiser Saturday while touting his ability to work across the aisle, according to a report. “There’s an awful lot of really good Republicans out there,” the former vice president told the audience, according to The Hill. “I get in trouble for saying that with Democrats, but the truth of the matter is, every time we ever got in trouble with our administration, remember who got sent up to Capitol Hill to fix it? Me. Because they know I respect the other team.” BIDEN'S RESURFACED ADMISSION HE 'LIKES' CHENEY SPARKS DEM BACKLASH He said congressional Republicans ran because they “care about things,” but are afraid to be at odds with President Trump. \"They're intimidated right now,” he told the audience, The Hill reported. Biden took heat last fall when The New York Times published a story that said he “stunned Democrats and elated Republicans” three weeks before the midterms by lauding Republican House candidate Fred Upton, R-Mich. He has also frustrated Democrats in the past by praising former Vice President Dick Cheney and calling Vice President Mike Pence “a decent guy.” CLICK HERE TO GET THE FOX NEWS APP While Biden -- considered to be the most moderate of the top-ranked candidates -- is largely running on his ability to work with Republicans, more liberal candidates like Elizabeth Warren, Bernie Sanders and Kamala Harris are focused on promoting progressive plans like Medicare-for-All and the Green New Deal.",
      "date": "August 18",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Joe Biden slips in latest New Hampshire poll",
      "url": "https://www.foxnews.com/politics/biden-new-nh-poll",
      "subtitle": "Joe Biden slips in latest New Hampshire poll",
      "author": "Paul Steinhauser",
      "content": " DURHAM, N.H. – There’s a new warning sign for former Vice President Joe Biden in the state that holds the first primary in the race for the White House. Biden, once the unrivaled front-runner in the race for the Democratic presidential nomination in most national polling and many early primary and caucus state surveys, now stands at 15 percent support among likely Democratic primary voters in New Hampshire, according to a new University of New Hampshire poll conducted for CNN. That's a drop of 9 percentage points since the previous UNH/CNN survey, which was conducted in July. WARREN OPENS UP 7-POINT EDGE OVER BIDEN IN NATIONAL POLL Asked about the new poll, Biden told MSNBC on Tuesday that “polls, as you know, are up and down.” The former vice president stated that he still planned on performing well in New Hampshire and the other early-voting states of Iowa, Nevada and South Carolina. The survey indicates Sen. Bernie Sanders stands at 21 percent support, with progressive rival Elizabeth Warren at 18 percent. There’s no front-runner in the new poll, as Sanders’ 3 point edge over Warren is within the survey’s sampling error for likely Democratic primary voters. Both Sanders and Warren – who hail from the neighboring states of Vermont and Massachusetts, respectively – stood at 19 percent in the July survey, trailing Biden. South Bend, Ind., Mayor Pete Buttigieg – at 10 percent – is the only other candidate in the still-large field of Democratic White House hopefuls to crack double digits. His numbers are unchanged from the summer survey. The new poll was conducted Oct. 21-27, entirely after the fourth round Democratic presidential nomination debate. The survey indicates Sen. Amy Klobuchar of Minnesota, Rep. Tulsi Gabbard of Hawaii and tech entrepreneur Andrew Yang are tied at 5 percent support, with each gaining support from the summer survey. Sen. Kamala Harris of California and billionaire businessman and environmental and progressive advocate Tom Steyer are each at 3 percent. Sen. Cory Booker of New Jersey and former Rep. Beto O’Rourke of Texas register at 2 percent, with everyone else at 1 percent or less. New Hampshire presidential primary voters are traditionally late deciders, which is reflected in the survey. With three-and-a-half months to go until the February contest, only 23 percent said they’ve definitely decided on which candidate they’ll support. Just over one in five said they’re leaning toward a candidate, with a whopping 57 percent saying they remain undecided. Biden – who returns to New Hampshire at the end of next week to formally file to place his name on the primary ballot – still leads when it comes to electability. Thirty-six percent of those questioned say he has the best chance of any Democratic White House hopeful of beating President Trump in next year’s general election. But that’s down from 45 percent in July. And in the new survey, the former vice president grabs just 20 percent support among his core groups — voters 50 and older, and self-described moderates and conservatives. POLL SUGGESTS MICHELLE OBAMA WOULD BE FRONT-RUNNER IN NH IF SHE ENTERED THE WHITE HOUSE RACE Warren doubled her electability number, from 9 percent in July to 18 percent now. And Sanders widened his lead over Warren as the most progressive candidate in the field — from 40-23 percent in July to 47-18 percent now. Buttigieg saw his favorable rating rise from 48 percent in July to 55 percent now. Klobuchar saw her favorability soar from 24 percent in the summer to 40 percent now. And Yang’s favorable rating skyrocketed as well, from 17 percent to 36 percent. In the Republican presidential primary, Trump remains the overwhelming front-runner, with 86 percent support among likely GOP primary voters in New Hampshire. THE LATEST FROM FOX NEWS ON THE 2020 PRESIDENTIAL CAMPAIGN Even though he’s visited the Granite State nearly every week since launching his long-shot primary challenge in April, former Massachusetts Gov. Bill Weld stood at just 5 percent. But he’s ahead of the two other Republican presidential primary long shots. Both former South Carolina governor and congressman Mark Sanford and former conservative radio talk show host and one-term congressman from Illinois Joe Walsh are each at just 1 percent in the poll. The UNH/CNN poll was conducted using live telephone operators, who questioned 574 likely Democratic primary voters in New Hampshire. The margin of error for Democratic primary questions is plus or minus 4.1 percentage points. Four-hundred-and-sixty-one likely GOP primary voters were also questioned, with a sampling error of plus or minus 4.6 percentage points.",
      "date": "October 29",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Mayor of Pocahontas backs Joe Biden, not Elizabeth Warren",
      "url": "https://www.foxnews.com/politics/mayor-pocahontas-iowa-backs-joe-biden-elizabeth-warren",
      "subtitle": "Mayor of Pocahontas backs Joe Biden, not Elizabeth Warren",
      "author": "Adam Shaw",
      "content": " The mayor of Pocahontas, Iowa is not backing who you might think. Dick Gruber, mayor of the northwest city in Iowa, announced this week that he is backing former Vice President Joe Biden for the 2020, rather than closest rival Sen. Elizabeth Warren. The endorsement was reported by The Washington Examiner, and was announced in an email to reporters from the Biden campaign. WARREN SAYS SHE'S OPEN TO HALTING DEPORTATION OF ILLEGAL IMMIGRANTS “Iowans know that Joe Biden is the strongest candidate to beat Donald Trump next November, and that’s why leaders from across the state are coming forward to proudly show their support,” the campaign said in a statement. The nod is likely to raise some eyebrows from Trump supporters, who have delighted in President Trump’s frequent mocking of Warren as “Pocahontas” in reference to her past claims to have Native American ancestry. Warren apologized to Native groups this year after she touted a DNA test that her campaign said backed her claims to have Native American heritage. \"Like anyone who has been honest with themselves, I know I have made mistakes,\" Warren said. \"I am sorry for the harm I have caused.\" But it’s an issue that has continued to dog her, particularly as Trump has repeatedly used the “Pocahontas” moniker for years -- even though his opponents have alleged that it is a racist slur. “Who? Pocahontas?” Trump said when asked about Warren in 2016. When told by reporters that the term was “very offensive,” he responded: “Oh I’m sorry about that,” before immediately saying it again. JOE BIDEN PREDICTS REPUBLICANS WILL HAVE AN 'EPIPHANY' ONCE TRUMP LEAVES OFFICE In August this year, he said his only regret was that he may have attacked her too early, and said that more attacks could be coming down the pipeline.. “Like, Elizabeth Warren -- I did the Pocahontas thing,” Trump told supporters. “I hit her really hard and it looked like she was down and out but that was too long ago, I should’ve waited. But don’t worry, we will revive it.” Warren’s campaign, meanwhile, has a whole page on her website dedicated to Pocahontas after it says the owner of Pocahontas.com set up the website to redirect to her site. CLICK HERE FOR THE FOX NEWS APP “We do not know the owner’s identity – and we did not ask them to do this,” the campaign says, urging the owner to redirect to the National Indigenous Women’s Resource Center instead.",
      "date": "November 9",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Fox News Poll Joe Biden, November 10-13, 2019",
      "url": "https://www.foxnews.com/politics/fox-news-poll-joe-biden-november-10-13-2019",
      "subtitle": "Fox News Poll Joe Biden, November 10-13, 2019",
      "author": "",
      "content": "",
      "date": "November 14",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Councilman from Pete Buttigieg's hometown endorses Joe Biden",
      "url": "https://www.foxnews.com/politics/south-bend-davis-councilman-biden-buttigieg",
      "subtitle": "Councilman from Pete Buttigieg's hometown endorses Joe Biden",
      "author": "Sam Dorman",
      "content": " Former Vice President Joe Biden's presidential bid has been endorsed by a top official in South Bend, Ind., where Biden rival Pete Buttigieg serves as mayor. Biden's campaign announced on Friday that Dr. Oliver Davis, one of the South Bend Common Council's longest-serving African Americans, had endorsed the 2020 frontrunner. “In times like these, when the political winds are fiercely blowing across our country, it’s important for us to have an experienced leader who has been through the diverse storms of life to guide our country,\" Davis said. \"That’s why I am very pleased to support Vice President Joe Biden to be our next President of the United States of America.\" KAMALA HARRIS RESPONDS TO BUTTIGIEG'S 'BLACK AMERICA' PHOTO GAFFE DURING DEBATE: IT 'SPEAKS TO A LARGER ISSUE' Davis' endorsement came as polls show Buttigieg gaining traction and emerging as a younger potential alternative to Biden. Biden, long perceived as the moderate to beat in the race, has experienced a wave of negative press coverage due to his repeated verbal slip-ups on the campaign trail. Despite Buttigieg's national popularity, he's faced ardent opposition at the local level. For example, the South Bend mayor encountered criticism at a local town hall earlier this year after a shooting that involved a white police officer and ended with the death of 54-year-old Eric Logan, a black man. After Buttigieg said he would contact the Justice Department about the issue, South Bend's Fraternal Order of Police (FOP) accused him of political opportunism. “Mayor Buttigieg’s comments have already and will continue to have a detrimental effect on local law enforcement offices and law enforcement officers nationwide,\" the FOP said. \"Mayor Buttigieg’s comments and actions are driving a wedge between law enforcement officers and the community they took an oath to serve.” CLICK HERE TO GET THE FOX NEWS APP Buttigieg later sent pizza to the group in an apparent attempt to make peace. That didn't go over so well as the FOP released a video rebuffing Buttigieg's gift. \"If this was a lame attempt to apologize to South Bend police officers, it didn't go over very well,\" FOP President Harvey Mills said in a video posted in July. Buttigieg also faces low support among African Americans and came under fire during Wednesday's Democratic debate for using a stock photo of a black woman to promote his plan geared toward the \"empowerment of black America.\"",
      "date": "6 days ago",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    },
    {
      "title": "Joe Biden accuses Elizabeth Warren of 'elitism'",
      "url": "https://www.foxnews.com/politics/joe-biden-accuses-elizabeth-warren-of-elitism-and-being-condescending-to-democrats-who-have-a-different-point-of-view",
      "subtitle": "Joe Biden accuses Elizabeth Warren of 'elitism'",
      "author": "Brie Stimson",
      "content": " Former Vice President Joe Biden on Tuesday called Sen. Elizabeth Warren, D-Mass., “condescending” and elitist for comments she made last week suggesting he was running in the “wrong presidential primary.” Biden made the comments at a Pittsburgh fundraiser and in an op-ed published in Medium Tuesday. He did not mention her by name, but wrote in the op-ed that her attacks represent an “angry unyielding viewpoint” with a \"my way or the highway\" approach to politics. HILLARY CLINTON ADVISES DEMS TO CHOOSE 2020 NOMINEE WHO CAN WIN ELECTORAL COLLEGE “But it’s worse than that,\" he wrote. \"It’s condescending to the millions of Democrats who have a different view.” Biden wrote that her jabs are an “elitism” that working and middle-class Americans don’t appreciate. Warren also said he was “repeating Republican talking points” when he criticized her recently unveiled Medicare for All plan. Biden and the other Democratic presidential candidates have stepped up their attacks on Warren recently as she surges in the polls, jockeying with Biden for the top spot. Biden concluded in the op-ed that Democrats need to stop elitist attacks on each other in order to beat President Trump. CLICK HERE TO GET THE FOX NEWS APP It’s not the first time Warren has been called elitist. Republican Sen. Scott Brown mockingly referred to her as “Professor Warren” when he unsuccessfully ran against her in Massachusetts in 2012. The Warren campaign has yet to comment on Biden's remarks. The Associated Press contributed to this report.",
      "date": "November 6",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_Biden"
      }
    }
  ]
}