{
  "articles": [
    {
      "title": "Palin calls on Republicans to unify behind Trump candidacy at GOP dinner",
      "url": "https://www.foxnews.com/politics/palin-calls-on-republicans-to-unify-behind-trump-candidacy-at-gop-dinner",
      "subtitle": "Palin calls on Republicans to unify behind Trump candidacy at GOP dinner",
      "author": "",
      "content": "Former Alaska Gov. Sarah Palin went to bat for Republican presidential front-runner Donald Trump at the Milwaukee County GOP dinner Friday night. Palin called on Republicans to unify behind Trump’s candidacy. She said he’s the only candidate who understands that “common sense is an endangered species in Washington.” She also touted Trump as the only candidate who has created private-sector jobs, saying “He builds big things.” \"Donald Trump is the only one who really understands this reality. He's the only one who creates private sector jobs, balances budgets and builds things, he builds big things,\" she said. Trump didn’t attend the dinner. Palin also attacked the other Republican candidates on their immigration policies at the dinner. She accused Texas Sen. Ted Cruz and Ohio Gov. John Kasich of “seducing (illegal immigrants) with gift baskets.” There were also some chuckles in the crowd when Palin said Trump is the only one who \"talks rationally\" about foreign policy and national security. Cruz received high praise at the dinner from Wisconsin Gov. Scott Walker. He endorsed Cruz Monday and called the senator a “rock star” before Cruz took the stage. Walker is also planning to join Cruz on the campaign trail in Wisconsin Sunday. Cruz noted that Walker is one of five former Republican presidential candidates who are now backing his campaign. The others are Rick Perry, Carly Fiorina, Jeb Bush and Lindsey Graham. \"That is the very real manifestation of the unity we need across this country,\" he said. \"If we are divided, we will lose the primary and hand the general election to Hillary Clinton.\" Cruz said nominating Trump would be a \"train wreck.\" \"That's actually not fair to train wrecks,\" Cruz said. \"Nominating Donald Trump elects Hillary Clinton.\" In his speech at the same event, Kasich cast himself as an independent-minded Republican, saying he understands the frustration felt by Trump backers. \"The Republican Party has been my vehicle and not my master,\" Kasich said. \"I've never wanted to be a professional politician — in fact, I don't even like politics.\" Kasich, whose only primary victory has come in his home state of Ohio, is hoping to survive the primary season and win the nomination at the GOP convention in Cleveland in July. \"We are going to have a contested convention,\" said former four-term Wisconsin Gov. Tommy Thompson when he introduced Kasich, noting that Abraham Lincoln won the nomination 156 years ago going into the convention as the underdog. The anti-Trump forces have been working to stop the billionaire businessman in Wisconsin, a state that will help determine whether he can emerge from the primaries with enough delegates to avoid a contested convention. Wisconsin awards 18 delegates to the statewide winner, and divides 24 delegates among the winner in each eight congressional districts. If Cruz sweeps all the delegates in Wisconsin, Trump will need to win 57 percent of the remaining delegates in other states to collect the 1,237 he needs to clinch the nomination. So far, he has won 48 percent of all delegates awarded. In the latest Fox Business Poll, Cruz holds a 10-point lead over Trump in Wisconsin. The Associated Press contributed to this report.",
      "date": "April 2, 2016",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Palin teases about serving as Energy secretary if Trump wins",
      "url": "https://www.foxnews.com/politics/palin-teases-about-serving-as-energy-secretary-if-trump-wins",
      "subtitle": "Palin teases about serving as Energy secretary if Trump wins",
      "author": "",
      "content": "Sarah Palin might reach the White House yet -- albeit for a short stay. The 2008 Republican vice presidential candidate on Sunday gamely answered the question about how she might serve in a Donald Trump administration by saying she wants to be the Energy secretary. “I think a lot about the Department of Energy, because energy is my baby,” Palin, a former governor of Alaska, told CNN’s “State of the Union.” “Oil and gas and minerals, those (are) things that God has dumped on this part of the Earth for mankind's use, instead of us relying on unfriendly foreign nations, for us to import their resources.” However, Palin then pivoted to the familiar less-government, states-right position that the agency should be shuttered, which would end her Cabinet-level position. “If I were head of that (agency,) I'd get rid of it,” Palin said. “And I'd let the states start having more control over the lands that are within their boundaries and the people who are affected by the developments within their states.” To be sure, the oil and gas industry is the biggest part of Alaska's economy. And nearly 85 percent of Alaska’s budget is funded by oil revenues, according to the state. Palin and GOP presidential nominee Sen. John McCain lost the 2008 White House race to President Obama. Palin has already shown her support for Trump, the billionaire businessman and GOP presidential front-runner with whom she appears to share an anti-Washington sentiment. And Trump suggested as far back as June that he would consider appointing Palin to an Executive Branch post.",
      "date": "September 6, 2015",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin for president? Media debate whether she’ll make a political comeback",
      "url": "https://www.foxnews.com/politics/sarah-palin-for-president-media-debate-whether-shell-make-a-political-comeback",
      "subtitle": "Sarah Palin for president? Media debate whether she’ll make a political comeback",
      "author": "Howard Kurtz",
      "content": " We interrupt our continuing coverage of Chris Christie to examine which Republicans have a better shot at the presidency if Christie is damaged goods. Which is sheer speculation, of course. And that happens to be the media’s specialty. Bill Kristol stirred up a bit of a fuss yesterday by declaring that there’s no reason Sarah Palin shouldn’t run for president. Kristol, whose Weekly Standard was a major Palin booster in 2008, didn’t predict she would win, but he said she'd have a major impact on the race. Kristol, a former Fox News contributor, also forecast on “Morning Joe” that two other Fox contributors would run: Mike Huckabee and former U.N ambassador John Bolton. (Both have said they’re looking at the race.) I have no inside information here, but Palin certainly wouldn’t lack for media attention. Kristol, who worked in the Bush 41 White House, is a well-connected Republican, and if this was a trial balloon, it raises intriguing questions. On the MSNBC morning show, Chuck Todd pushed back, saying that if Palin ran it would be for “a financial reason, to get back into the spotlight. Get the speaking fees back up.” This annoyed Kristol, who said that the establishment takes seriously such candidates as Jon Huntsman (who flopped), but dismisses the likes of Palin and Huckabee as people who “just want to make money.” Host Joe Scarborough (also named by Kristol as a 2016 dark horse) said Palin’s populist message could resonate in the GOP primaries but that she hurt herself by resigning as Alaska governor. There are, of course, multiple reasons that folks jump into a White House race, from increased visibility to boosting career prospects to positioning for a VP slot. Just ask Herman Cain, Michele Bachmann, Dennis Kucinich, Al Sharpton and many others. Palin has a passionate following among Tea Party types, but she would also expose herself again to mockery from the mainstream media. She would have to decide whether the grueling nature of a campaign is worth giving up her television gigs. Much of this talk is being spurred by the Christie vacuum in the wake of the bridge scandal. Even Mitt Romney, who’s been on the TV circuit after that favorable Netflix documentary, is being asked whether he’d give it a third try. His answer is no way. There is chatter now about other governors, such as Scott Walker. Perhaps the most important name on Kristol’s list is Jeb Bush, who says he is looking at the race but won’t decide soon. The media would immediately treat Bush as a heavyweight and he would in effect become the establishment candidate. The dilemma for the former Florida governor is that he has openly questioned how far to the right his party has moved. He would be, fairly or not, saddled with defending his brother’s presidential record. And, by the way, Bush’s own mother doesn’t want him to run. In The Week, Damon Linker all but declares the primaries over: “It's beginning to dawn on me that Jeb Bush is probably going to be the Republican Party's nominee for president in 2016. \"Consider: With the ongoing implosion of Chris Christie's political career, the GOP establishment has lost its best hope for a candidate who could stop a libertarian-populist insurgency during the primaries. Rand Paul, Ted Cruz, Scott Walker — the list of viable fire-breathers is longer (and less dominated by incompetents, crazies, and one-note sideshow acts) than establishment types would like.” As for the last-name problem, he says: “Yes, Jeb would be freighted by bad memories of his brother's failed presidency. But he might be helped by warm memories of his father's presidency.” But American Conservative’s Daniel Larison strongly disagrees: “Like his brother when he ran for president, Jeb Bush has no foreign policy experience to speak of, and to the best of my knowledge he has never shown much interest in the subject. Given his brother’s disastrous record, I doubt that enough Republicans would want to take that kind of chance again. “Considering the state that the last Bush left the GOP in, there can’t be very many Republicans that want to turn to that family a third time for leadership.” Bottom line: The Republican Party is trying to find someone who can beat Hillary Clinton. A Palin-Hillary race would be absolute gold for the press. And a Bush-Clinton race would conjure memories of 1992, a clash between two royal political families that never seem to leave the scene. Assuming, that is, that one or both of them run. Click for more from Media Buzz.",
      "date": "February 7, 2014",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Hilarious Jimmy Fallon skit features Sarah Palin and a phone call with 'Vladimir Putin'",
      "url": "https://www.foxnews.com/politics/hilarious-jimmy-fallon-skit-features-sarah-palin-and-a-phone-call-with-vladimir-putin",
      "subtitle": "Hilarious Jimmy Fallon skit features Sarah Palin and a phone call with 'Vladimir Putin'",
      "author": "",
      "content": "Comedian Jimmy Fallon featured former Alaska Gov. Sarah Palin on the \"Tonight Show\" on Wednesday, airing a hilarious video skit of a phone call between her and Vladimir Putin. Fallon, who plays Putin, calls Palin to congratulate her for her 2008 prediction that he would invade Ukraine. \"Since you so great at guessing my next move, who do you think I should invade next? I’m thinking Finland, Sweden – I hear Jamaica is nice this time of year,\" Fallon's Putin explains, before asserting that he is the product of \"strong genes\" but \"Obama comes from mom jeans.\" Watch the video above which includes a joke about the National Security Agency and Palin's reaction after Putin suggests that he invade Alaska. Read more on WashingtonExaminer.com",
      "date": "April 3, 2014",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin seizes the media spotlight by playing the impeachment card",
      "url": "https://www.foxnews.com/politics/sarah-palin-seizes-the-media-spotlight-by-playing-the-impeachment-card",
      "subtitle": "Sarah Palin seizes the media spotlight by playing the impeachment card",
      "author": "Howard Kurtz",
      "content": " There is simply no downside for Sarah Palin in calling for Barack Obama’s impeachment. She grabs a nice bit of media attention. She rallies her conservative base. She gets to talk about it on Fox. And since she holds no elective office, she doesn’t have to worry about whether her rhetorical broadside has the slightest chance of succeeding. In fact, the chances that the House will impeach a second straight Democratic president are extremely remote. But so what? Palin gets the issue and positions herself on the leading edge of anti-Obamaism. The former Alaska governor and Fox News contributor launched her attack yesterday on the conservative Breitbart News website, and she came out swinging: “Enough is enough of the years of abuse from this president. His unsecured border crisis is the last straw that makes the battered wife say, ‘no mas.’… “It’s time to impeach; and on behalf of American workers and legal immigrants of all backgrounds, we should vehemently oppose any politician on the left or right who would hesitate in voting for articles of impeachment.” The 2008 VP nominee made the case last night on “Hannity” as well, guaranteeing a second bump. But while various GOP congressmen have openly mused about impeachment, the House leadership hasn’t given any indication that such proceedings would be seriously considered. With the Republicans appearing to be in a strong position in the 2014 midterms, why introduce an explosive new element that would divide the country and enable critics to turn the spotlight on their motivation? The impeachment of Bill Clinton didn’t work out so well from the GOP point of view, as the country turned against the effort and the Democrats actually picked up House seats in the 1998 midterms. I’m sure a chunk of the country would love to see Obama run out of office. But being a bad president isn’t grounds for impeachment. The Constitution requires evidence of “high crimes and misdemeanors”—say, like authorizing burglaries and orchestrating a coverup, as Richard Nixon did. The IRS scandal certainly carries a strong whiff of Watergate-style political retaliation. But with all those missing Lois Lerner emails, no one has tied the misconduct to the president or top White House aides. Interestingly, Palin’s Breitbart column doesn’t offer a legal bill of particulars for impeachment. It’s more of a laundry-list indictment of his conduct in office: “Opening our borders to a flood of illegal immigrants is deliberate. This is his fundamental transformation of America… “The federal government is trillions of dollars in debt, many cities are on the verge of insolvency, our overrun healthcare system, police forces, social services, schools, and our unsustainably generous welfare-state programs are stretched to the max. .. “President Obama’s rewarding of lawlessness, including his own, is the foundational problem here. It’s not going to get better, and in fact irreparable harm can be done in this lame-duck term as he continues to make up his own laws as he goes along.” Will this have a political impact? The Washington Post sees Palin putting her Capitol Hill colleagues on the spot: “If a significant pro-impeachment portion of the conservative base does materialize — and that's a big ‘if’ — it will put Republican lawmakers in the unenviable position of responding to questions about whether they, too, agree with the idea of impeachment… “It lends credence to Democrats' argument that Republicans are controlled by the extreme wing of their party. And to the extent that Democrats can make the 2014 election a referendum on the GOP's conduct in Congress (see: government shutdown), it's to their benefit.” On the right, Hot Air's Allahpundit suggests the effort isn’t worth it because the president would most likely be acquitted in the Senate: “Don’t be so sure there’d be a majority in favor of convicting Obama even if Republicans retake the Senate. The usual centrist suspects — Collins, Murkowski, Kirk, et al. — will be chilly to the idea. And now that Thad Cochran owes his reelection to black Democrats in Mississippi, it’s hard to believe he’d turn around and vote to remove the first black president. To even have a bare majority willing to convict, I suspect you’d need at least 57 or so seats in GOP hands next year, which is a tall order for November. “But again, this is mainly about constructing a true conservative/RINO litmus test, so if a bunch of RINOs end up voting to acquit, no biggie. That’ll simply be taken as proof of the underlying point that the Senate needs more tea partiers… “Does John McCain agree with his former running mate that the president should be impeached? Inquiring minds want to know!” (McCain said yesterday he doesn't support impeachment.) On the left, Salon laments the extreme polarization of such efforts: \"We’ve gotten into the habit of delegitimizing our presidents — not just contesting their election or pushing back against their policies, but denying their very claim to the White House. From the farcical (birthers) to the faux-serious ('anti-American socialist!'), we’ve moved beyond mere opposition and into a deeper civic sickness, where casting aspersions on the policies of an opposition president has given way to challenging his very right to implement those policies. \"It didn’t start with Barack Obama. This new kind of cynicism has been gaining ground for years.\" Sarah Palin was a powerful force in the 2010 elections, boosting some candidates to victory with her coveted endorsements and still being talked about as a presidential possibility. But with the rise of figures like Ted Cruz and Rand Paul, she hasn’t been talked about much in 2014 at all. That, at least for now, has suddenly changed. Click for more from Media Buzz.",
      "date": "July 9, 2014",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Palin links son's arrest to PTSD, Obama policies",
      "url": "https://www.foxnews.com/politics/palin-links-sons-arrest-to-ptsd-obama-policies",
      "subtitle": "Palin links son's arrest to PTSD, Obama policies",
      "author": "",
      "content": "Sarah Palin publicly addressed her son Track's arrest on domestic violence charges during her first post-endorsement appearance Wednesday on the campaign trail for Donald Trump, appearing to link his alleged behavior to post-traumatic stress disorder -- even using it to criticize President Obama’s veteran policies. Speaking to the pro-Trump crowd in Tulsa, Okla., Palin referred to her son’s case as the \"elephant in the room.\" After telling the crowd they deserved a commander-in-chief who “will let [military members] do their job and go kick ISIS’ ass” and not “leave our wounded warriors behind,” the former Alaska governor asked if she could “get a little bit personal.” “I guess it’s kind of the elephant in the room because my own family going through what we’re going through today, with my son, a combat vet having served in the striker brigade fighting for you all, America, in the war zone,” she said. “But my son, like so many others, they come back a bit different. They come back hardened. They come back wondering if there is that respect for what it is that their fellow soldiers and airmen and every other member of the military have sacrificially given to this country and that starts at the top.” Palin said military members look at Obama and question whether he knows the sacrifices they make to “secure America and to secure freedoms.” “So when my own son is going through what he is going through coming back, I can certainly relate with other families who kinda feel these ramifications of some PTSD,” she said. Track, a 26-year-old Iraq veteran, was arraigned Tuesday on charges of domestic violence assault, interfering with a report of domestic violence crime and possession of a firearm while intoxicated. According to the police affidavit posted by KTVA-TV, officers were called to the residence Monday night following two 911 calls – the first from Track’s girlfriend and the second from him. The woman claimed Track had “punched her in the face and that a firearm was involved,” according to police records. The charges against Track were filed the same day Palin appeared at an Ames, Iowa, rally to endorse Trump, the current GOP frontrunner. Palin, a Tea Party favorite and the 2008 Republican vice presidential nominee, told the crowd that “things will change under President Trump.” She went on to criticize the GOP establishment as well as Obama’s foreign policies.",
      "date": "January 20, 2016",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Palin: 'Barbaric' Planned Parenthood targets minorities",
      "url": "https://www.foxnews.com/politics/palin-barbaric-planned-parenthood-targets-minorities",
      "subtitle": "Palin: 'Barbaric' Planned Parenthood targets minorities",
      "author": "",
      "content": "Former Alaska Gov. Sarah Palin asserted Wednesday that Planned Parenthood is targeting minorities, and said some people are more worried about the Confederate flag than they are about the \"thousands and thousands of babies … being butchered\" by \"barbaric\" Planned Parenthood. \"Planned Parenthood is in the business of finding targets\" and they \"attract those who would be perhaps disadvantaged in some ways, and be made to believe that abortion is their only option,\" said Palin. \"That is why ... 80 percent of Planned Parenthood shops are set up in minority neighborhoods. It's tragic that they would make anybody, a minority even, feel that they're not capable enough\" to give their children life. \"For them to make ... women feel that they're not capable of [carrying a pregnancy to term] is absolutely atrocious,\" Palin told Fox News' Bill O'Reilly, her voice breaking. Although Palin continuously asserted that Planned Parenthood targets minorities she did not make the argument, common in pro-life circles, that Planned Parenthood's founder, Margaret Sanger, was a eugenicist. She seemed at a loss when O'Reilly pressed her on why Planned Parenthood targets minorities. Read more on WashingtonExaminer.com",
      "date": "July 30, 2015",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Palin says she'll work to unseat Ryan over Trump snub",
      "url": "https://www.foxnews.com/politics/palin-says-shell-work-to-unseat-ryan-over-trump-snub",
      "subtitle": "Palin says she'll work to unseat Ryan over Trump snub",
      "author": "",
      "content": "In a dustup between former GOP vice presidential candidates, Sarah Palin said Sunday she will work to unseat House Speaker Paul Ryan after Ryan refused last week to endorse Donald Trump, the presumptive Republican presidential nominee. Trump, asked about Palin's remarks on Monday, called her a \"free agent\" and said he had nothing to do with that push. Palin, who was on the 2008 Republican ticket, earlier said on “State of the Union” she “will do whatever I can” to support Ryan’s primary challenger in Wisconsin’s first district. Ryan’s snub of Trump was “not a wise decision of his,” Palin said. “His political career is over, but for a miracle, because he has so disrespected the will of the people,” said Palin, who was governor of Alaska from 2006 to 2009. She suggested that Ryan would be “Cantor-ed,” referencing ex-Republican Majority Leader Eric Cantor’s June 2014 Virginia primary loss to an upstart challenger and his ousting from GOP leadership. Both Palin and Trump were speaking on CNN. Ryan is facing businessman Paul Nehlen in the Aug. 9 Republican congressional primary. Palin said she has not yet spoken to Nehlen, but Nehlen had obviously heard the news Sunday morning, retweeting two links to the Palin interview from his personal account. Ryan's spokesperson declined to comment on the Palin remarks when contact by FoxNews.com. Ryan, who was a vice presidential candidate in 2012, was first elected to Congress in 1998 and was chosen as speaker of the house in 2015. Though he has been somewhat critical of several Trump statements in the past, Ryan still stunned many in the political world on Thursday when he declined to throw his weight behind his party’s likely November standard bearer. “I’m just not ready to do that at this point,” Ryan said on CNN. “I’m not there right now.” Palin told host Jake Tapper she believes Ryan’s own presidential ambitions are keeping him from supporting Trump. “You know, I think why Paul Ryan is doing this, Jake, it kind of screws his chances for the 2020 presidential bid that he’s gunning for,” she said. “If the GOP were to win now, that wouldn’t bode well for his chances in 2020 and that’s what he’s shooting for. So a lot of people with their ‘Never Trump’ or ‘Now Right Now Trump’ mantra going on, they have different reasons. I think that one is Paul Ryan’s reason.”",
      "date": "May 8, 2016",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "The Edge: Cruz booms, but Palin gets Trump mega media",
      "url": "https://www.foxnews.com/politics/the-edge-cruz-booms-but-palin-gets-trump-mega-media",
      "subtitle": "The Edge: Cruz booms, but Palin gets Trump mega media",
      "author": "Chris Stirewalt",
      "content": " **Want FOX News First in your inbox every day? Sign up here.** Buzz Cut:\n• The Edge: Cruz booms, but Palin gets Trump mega media\n• Conservatives raise alarm, but is it too late?\n• Power Play: Heading for a showdown\n• Hillary and Bernie fight heats up\n• Talk about wasting time THE EDGE: CRUZ BOOMS, BUT PALIN GETS TRUMP MEGA MEDIA\nTed Cruz is starting to horn in on GOP frontrunner Donald Trump’s media monopoly. But just as Cruz was cresting, Trump found a new way to get the press back to wall-to-wall coverage of his campaign. In this week’s installment of The Edge, a one-of-a-kind measurement of media mentions from the New Analytics Company, Cruz rocketed into second place with by far the biggest gains since last week. But lest he lose his stranglehold on political coverage, Trump rolled out the one endorsement guaranteed to put the mainstream press into a frenzy: former Alaska Gov. Sarah Palin. Despite the overwhelmingly negative tone of the coverage, as is often the case with Trump, the sheer volume drowned out other voices. A separate analysis from New Analytics shows that Trump and Palin dominated the discussion on Tuesday and Wednesday. The Edge “scrubs” television, radio, print, internet and social media for mentions of the 2016 candidates. The team at New Analytics has built unique tool to measure which candidates are being talked about the most and the data are compiled into a single score and provided to Fox News First.\n\n Here are their rankings for media mentions this week, with their gain or decline from last week in brackets. See the full results here.\n\nDonald Trump, 27.05 [+1.55]; Ted Cruz, 15.68 [+4.24]; Ben Carson, 13.97 [+1.32]; Marco Rubio, 12.12 [+1.68]; Jeb Bush, 9.32 [-2.79]; Chris Christie, 5.83 [-1.37]; Rand Paul, 5.04 [-.23]; Carly Fiorina, 4.69 [-1.88]; John Kasich, 4.38 [-.83]; Mike Huckabee, 3.95 [-1.17] CONSERVATIVES RAISE ALARM, BUT IS IT TOO LATE?\nAfter a 60-year struggle, the conservative movement seemed to be at the threshold of its long-sought aim of the final takeover of the Republican Party. And then along came Donald Trump. With increasing signs that the GOP establishment is lining up behind Trump for fear of right-wing favorite Ted Cruz, the conservative movement is belatedly moving to try to save itself. National Review lowered the boom on Trump Thursday night with an all-star collection of conservative thinkers denouncing Trump’s candidacy. The magazine is being joined by other luminaries of the movement, including a searing compilation from Matt Labash. \n\n The audience here includes those in the punditocracy and the world of politics who have been willing to either dismiss or enable Trump as a means to an ideological end, especially on immigration, or exploiting the vacuum he leaves to prop up dead candidacies. \n\n Ten days away from the Iowa caucuses is a little late for conservatives to come to the realization that they are on the brink of disaster. But there’s still enough time, if…. The conservative revolt against Trump only really matters if the two thirds of the Republican Party not supporting Trump can unite behind one or even two candidates.\n\n Most Republicans are quite conservative. But if they split their votes between three or even four other candidates, Trump can use his minority share of the party plus the many Democrats who support him for leveraged buyout of the GOP. \n\n This is where the lack of a functional establishment or party hierarchy is really damaging the GOP. There is no check on candidates like Jeb Bush or Chris Christie and no seeming way to divert them from their course. In a world of billionaire PAC men, there are no more power brokers to force rational action.\n\nTrump, Cruz ad war escalates - Donald Trump has unveiled his first attack ad of the cycle, a spot hammering rival Sen. Ted Cruz for what Trump says is weakness on the issue of illegal immigration. But Cruz was ready with an attack of his own. In a new ad, Cruz slams Trump for his use of government eminent domain powers to try to seize private property for his own benefit.\n\n[Daily Mail: “Republican presidential front-runner Donald Trump has never voted in a Republican presidential primary election in his home state of New York, voter records show.”] Power Play: Heading for a showdown - Iowa’s caucus-goers can be tough crowd for aspiring candidates, but Donald Trump and Sen. Ted Cruz are determined to take the top spot in the first presidential contest. Yahoo News’ Meredith Shiner and WashEx’s Sarah Westwood give their take to Chris Stirewalt. WATCH HERE. #mediabuzz - The two leading GOP candidates, Donald Trump and Ted Cruz, both sat down with host Howard Kurtz to talk about 2016, with a little over a week until the Iowa caucuses. Watch “#mediabuzz” Sunday at 11 a.m. ET, with a second airing at 5 p.m. Rubio shifts cash to South Carolina - Politico: “Marco Rubio had long planned an ambitious Iowa advertising assault in the weeks leading up to the caucuses, but his campaign has quietly scaled back its ad buys in the state by more than $860,000, according to a POLITICO analysis of advertising buys. The change appears due partly to a switch from offense to defense, but it also comes at a time when the Florida senator is focusing his hopes for an early state victory in South Carolina, where his campaign is increasing its advertising buys, according to the analysis, compiled for POLITICO by The Tracking Firm.” But keeps up in Iowa, N.H. air assault - Two new ads from Team Rubio are set to air today in Iowa and New Hampshire both focusing on supporters in their respective states titled “Marcomentum.” Fox News Sunday - Sen. Marco Rubio joins Chris Wallace ahead of the Iowa caucus, and Jeff Roe, campaign manager for Sen. Ted Cruz is this week’s “Power Player.” Watch “Fox News Sunday with Chris Wallace” at 2 p.m. and 6 p.m. ET on the Fox News Channel. Check local listings for broadcast times in your area.\n\nWITH YOUR SECOND CUP OF COFFEE…\nHistory.com: “In Russia, the revolution of 1905 begins when czarist troops open fire on a peaceful group of workers marching to the Winter Palace in St. Petersburg to petition their grievances to Czar Nicholas II. Some 500 protestors were massacred on ‘Bloody Sunday,’ setting off months of protest and disorder throughout Russia. By January 1905, discontent with the czar’s regime permeated nearly all classes in Russia, especially after the crushing January 2 defeat of the Russian navy at Port Arthur during the Russo-Japanese War. In October 1905, Nicholas, embattled on all sides, was forced to grant basic civil liberties and a representative national body, which would be elected by narrowly limited suffrage. However, this Parliament, known as the Duma, was dissolved after it opposed Nicholas’ authority, and the remnants of the revolutionary movement were brutally suppressed by czarist troops. A decade later, czarist Russia was bogged down in the mire of World War I, prompting the Bolshevik-led Russian Revolution of 1917, which crushed the czar’s opposition and proclaimed Russia the world’s first Marxist state.”\n\nGot a TIP from the RIGHT or the LEFT? Email FoxNewsFirst@FOXNEWS.COM\n\nPOLL CHECK\nReal Clear Politics Averages\n Republican Nomination – Trump 34.8 percent; Cruz 18.8 percent; Rubio 11.6 percent; Carson 8.8 percent\nGeneral Election: Clinton vs. Trump – Clinton +2.5 points\nGeneric Congressional Vote – Republicans +0.5 HILLARY AND BERNIE FIGHT HEATS UP\nThe Hill: “An aide to Democratic presidential candidate Bernie Sanders said Thursday evening that rival Hillary Clinton ‘should be ashamed’ of her association with longtime ally David Brock. Brock, who heads several groups supporting Clinton’s bid, slammed a new ad from Sanders on Thursday and accused the Vermont senator of not caring about black people.  Sanders spokesman Michael Briggs issued a scathing statement directed at Brock’s comments and stressing that Sanders has \"one of the strongest civil rights records in Congress.” Bernie’s Baby Boomer utopia - In his new ad, Bernie Sanders speaks to his core group of supporters with visions of farmlands and snowy little towns all the while Simon and Garfunkel’s “America” plays in the background. \n\nPower Play: Red menace - As Hillary Clinton sees her lead slipping into the hands of Sen. Bernie Sanders, her team has decided to hit Sanders hard on his self-professed socialist beliefs. Yahoo’s Meredith Shiner and WashEx’s Sarah Westwood give Chris Stirewalt their thoughts. WATCH HERE. Bernie keeps gigging Hillary on buckraking - NYT: “But the new attacks strike at what even some allies believe may be one of Mrs. Clinton’s biggest vulnerabilities: not her positions on financial regulation, but her personal relationships with Wall Street executives, along with the millions of dollars Mrs. Clinton, her husband, and their family foundation have accepted in speaking fees or charitable contributions from banks, hedge funds and asset managers. Unlike Mrs. Clinton, Mr. Obama has never earned speaking fees from Wall Street.” Hillary emails so secret that even members of Congress can’t see them - Fox News: “Some of Hillary Clinton’s emails on her private server contained information so secret that senior lawmakers who oversee the State Department cannot read them without fulfilling additional security requirements, Fox News has learned. The emails in question, as Fox News first reported earlier this week, contained intelligence classified at a level beyond ‘top secret.’ Because of this designation, not all the lawmakers on key committees reviewing the case have high enough clearances.”\n\n CARLY, HILLARY ON OPPOSITE SIDES ON ROE V. WADE ANNIVERSARY\nUSA Today: “[The March for Life event] which draws hundreds of thousands of participants, is scheduled to kick off shortly before noon on the grounds of the Washington Monument with a rally that will include an appearance by Republican presidential candidate Carly Fiorina and a dozen elected officials, artists and public figures.” Speaking to her base - Hillary Clinton celebrates today’s anniversary of the Roe v. Wade case with a dinner hosted by Naral Pro-Choice New Hampshire. The national organization endorsed the Democratic frontrunner earlier this month. [The CARLY for America PAC released a new ad in Iowa today focused on Carly Fiorina’s economic record. The ad buy will run through Feb. 1 for $140,000 in the Des Moines, Cedar Rapids, Council Bluffs, and Davenport markets, according to a release.] TALK ABOUT WASTING TIME \nWilton (Conn.) Bulletin: “A large group of emergency responders … conducted a missing-person search Tuesday evening, Jan. 19, only to find out later that the distress signal they were told about was actually the GPS beacon of a high-end watch. Headquartered in Wilton, Breitling USA is an international supplier of technical watches and chronographs. According to Lt. Stephen Brennan of the Wilton Police Department, it was a watch in the company’s 206 Danbury Road location that emitted the signal. … Four Wilton police cruisers and three Wilton fire department units were dispatched, along with 23 CERT members. An additional nine firefighters were called, among them the Wilton Fire Dive, who deployed their boat to search the reservoir. The New Canaan Police Department aided with seven police, including its K-9 unit. A New Canaan fire unit also responded.”\n\nAND NOW, A WORD FROM CHARLES…\n“I think we’re getting to a moment where there’s a scenario that one can see. Which is, you get Bob Dole, who represents the old establishment, if you like, essentially choosing Trump over Cruz. Now, if Cruz loses Iowa, Trump wins convincingly, I think all he will need at that point is to have a single current establishment figure. Meaning a sitting governor or a sitting Senator endorse him.” – Charles Krauthammer on “Special Report with Bret Baier.” Chris Stirewalt is digital politics editor for Fox News. Want FOX News First in your inbox every day? Sign up here.",
      "date": "January 22, 2016",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin set to return as Fox News contributor",
      "url": "https://www.foxnews.com/politics/sarah-palin-set-to-return-as-fox-news-contributor",
      "subtitle": "Sarah Palin set to return as Fox News contributor",
      "author": "",
      "content": "Sarah Palin, the former Alaska governor and self-professed 'Mama Grizzly,' is rejoining Fox News as a contributor. The return of the outspoken 2008 vice presidential candidate, who appeared on the fair and balanced network for three years ending in January, was announced by Fox News Chairman and CEO Roger Ailes. [pullquote] “I have great confidence in her and am pleased that she will once again add her commentary to our programming,\" Ailes said. \"I hope she continues to speak her mind.” Palin will make her latest debut on the morning show \"Fox & Friends,\" on Monday. In addition to providing political insight and commentary, Palin will contribute to Fox Business Network. \"The power of Fox News is unparalleled,\" Palin said. \"The role of Fox News in the important debates in our world is indispensable. I am pleased and proud to be rejoining Roger Ailes and the great people at Fox.\" Palin is the author of two New York Times best-selling books, and was named to Time magazine's “100 Most Influential People” list in 2010. Before becoming Sen. John McCain's 2008 running mate, Palin was the first woman to serve as governor of Alaska, taking the oath in 2006. Before that, she served two terms as mayor of Wasilla.",
      "date": "June 13, 2013",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin's oldest son arrested in domestic violence case",
      "url": "https://www.foxnews.com/politics/sarah-palins-oldest-son-arrested-in-domestic-violence-case",
      "subtitle": "Sarah Palin's oldest son arrested in domestic violence case",
      "author": "",
      "content": "ANCHORAGE, Alaska – The oldest son of former Alaska Gov. Sarah Palin was arrested in a domestic violence case in which his girlfriend was afraid he would shoot himself with an AR-15 assault rifle, according to court documents filed Tuesday. Track Palin, 26, is charged with assault, interfering with the report of a domestic violence crime and possessing a weapon while intoxicated in connection with the incident Monday night at the Wasilla home of his parents, where he lives, according to an affidavit by police. The girlfriend told authorities she was punched in the face by Palin, who is the oldest child of Sarah Palin, the 2008 Republican vice presidential nominee and conservative icon. The charges were filed Tuesday, the same day Sarah Palin endorsed Republican presidential front-runner Donald Trump before voting begins with the Iowa caucuses. There is no telephone listing for the girlfriend. The court documents say the woman, Track Palin's girlfriend of one year, had bruising and swelling around her left eye, and she said her right knee hurt after Palin kicked her there. Palin family attorney John Tiemessen declined to comment on the matter other than to say in an email that respect for the family's privacy is appreciated \"as Track receives the help that he and many of our returning veterans need.\" Palin's arraignment was held Tuesday, but Tiemessen was not sure if he entered a plea yet. According to the three-page affidavit, both Palin and his girlfriend called 911 that night. Police Officer Andrew Kappler wrote that he arrived at the Wasilla home and found Track Palin walking outside and talking on a phone. The officer said Palin had an injury to his right eye and surrounding area, smelled strongly of alcohol and acted with escalating hostility, prompting Kappler to put him in handcuffs. Police say a breath sample provided by Palin showed he had a blood alcohol level of 0.189. The affidavit says other officers found the girlfriend hiding under a bed inside the home and crying. The argument continued at the home, according to the affidavit, which says Palin struck the woman with his fist on the left side of her head near her eye. She curled up in the fetal position because she didn't know what else he would do, the woman told police. She said he then kicked her in the knee and threw her phone across the driveway, according to the court document. The woman said she went inside after getting her phone. Inside, Palin held the rifle, with the barrel just away from his face pointed to the side, the affidavit states. The affidavit adds that the woman told police Palin was yelling \"Do you think I won't do it?\" The girlfriend \"was concerned that he would shoot himself and ran outside and around the house,\" the affidavit says. \"She didn't see where Palin went, so she went inside and up the stairs, where she hid under a bed.\" It's not the first encounter with the law for Palin or other members of his family. In September 2014, he and other Palins were involved in a brawl that broke out at a party in Anchorage. No arrests were made in the melee, and no one wanted to press charges. But according to a police report, Palin had blood around his mouth and his hands. He was belligerent until his mother told him to talk to a police officer.",
      "date": "January 19, 2016",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Martin Bashir apologizes for dirty, disgusting slam at Sarah Palin",
      "url": "https://www.foxnews.com/politics/martin-bashir-apologizes-for-dirty-disgusting-slam-at-sarah-palin",
      "subtitle": "Martin Bashir apologizes for dirty, disgusting slam at Sarah Palin",
      "author": "Howard Kurtz",
      "content": " When I first saw a headline about what Martin Bashir said, I figured it must be exaggerated. No responsible cable news host would call for defecating on a public figure. That’s just beyond the pale, right? But that’s exactly what Bashir did on his MSNBC show, while spewing venom at Sarah Palin. He made an abject apology yesterday, and we’ll get to that in a moment. I’ve long been amazed by Bashir’s brand of name-calling. He despises Republicans, we get it. But the highly personal nature of his assaults, while delivered in an erudite British accent, stands out even by the loose standards of cable news. This guy was a co-anchor of “Nightline” when he was at ABC, but was apparently seething with liberal resentment that we now see displayed daily on his weekday show. MSNBC once suspended Ed Schultz for calling Laura Ingraham a “right-wing slut”; why on earth does it tolerate Bashir's brand of bile? Bashir once said that the NRA “deserves to be equated with Hitler,” so he’s practiced at incendiary comparisons. What happened last week is that Bashir used his hatred of Palin—calling her the country’s “resident dunce” and a “world-class idiot”—to descend deeper into the gutter than I ever thought he’d go. Now the issue on which he went after the former Alaska governor and Fox News contributor is fair game. Palin had spoken in Iowa of borrowing from China to pay for the national debt, saying: “This isn’t racist. But it’s going to be like slavery when that note is due.” Lots of people didn’t approve of Palin likening government borrowing to the awful legacy of buying and selling African-Americans. But Bashir chose to tell his audience of the diary of a plantation overseer in Jamaica named Thomas Thistlewood. “In 1756, he records that a slave named Darby ‘catched eating kanes had him well flogged and pickled, then made Hector, another slave, sh** in his mouth.’ “This became known as ‘Darby’s Dose,’ a punishment invented by Thistlewood that spoke only of inhumanity. And he mentions a similar incident in 1756, his time in relation to a man he refers to as Punch. ‘Flogged punch well, and then washed and rubbed salt pickle, lime juice and bird pepper, made Negro Joe piss in his eyes and mouth.’” And that brings Bashir to his disgusting denouement: “When Mrs. Palin invokes slavery, she doesn’t just prove her rank ignorance. She confirms if anyone truly qualified for a dose of discipline from Thomas Thistlewood, she would be the outstanding candidate.” That’s right. Wrapped in the language of literary allegory, Bashir is saying he’d like to see someone assault and abuse Sarah Palin in this horrifying fashion. And no one at MSNBC bats an eye? This is deemed acceptable discourse? What would MSNBC say if a conservative had talked about defecating on, say, Hillary Clinton? In his televised apology, directed to both Palin and to viewers, Bashir said his remarks were “unworthy” and “deeply offensive,” and that he is “deeply sorry.” He said he wished he had been “more thoughtful” and “more compassionate.” He said “the politics of vitriol and destruction is a miserable place to be and a miserable person to become,” and promised to learn a lesson. An abject apology is all well and good. But as Mediaite’s Joe Concha writes, invoking MSNBC President Phil Griffin: “Could you imagine if Neil Cavuto or Jake Tapper, who occupy the same timeslot on Fox and CNN, respectively, suggested anyone s*it in anyone’s mouth on national television, as Bashir did last week? “And it’s not as he’s killing it in the ratings. Day after day, Bashir easily owns the lowest-rated show in his timeslot among the big three. If Griffin were smart, he’d use this episode as an excuse to get rid of Bashir.” MSNBC rightfully suspended Alec Baldwin for two weeks for hurling an anti-gay slur at a photographer. But the corporate attitude is different because Palin is the target? This is nothing short of shameful, as even Martin Bashir now seems to recognize. All Ford All The Time You might think a mayor might lay low for awhile after admitting to smoking crack, getting too drunk, threatening to murder someone, and using a sexually explicit term on live television while denying that a female friend was a hooker. Not Rob Ford. Instead, Toronto’s hard-living chief executive gives interviews to Fox and CNN as he prepares to launch his own Canadian TV show. Oh, and he knocked over a female City Council member yesterday as he rushed to help his brother in an “altercation.” Oh, and he’s thinking of running for prime minister. \"I’m seeking professional help, I’m not an alcoholic, I’m not a drug addict,\" Ford told Fox’s John Roberts. \"Have I had my outbursts in the past? Absolutely I have John. But you know what I’m only human. I’ve made mistakes I’ve apologized. That’s all I can do.\" Ford also turned on CNN’s Bill Weir, saying: “I’m not an addict. You can spin it. You can tell me whatever you want. These people know that I’m not—have you ever got drunk before, Bill?” After Weir allowed that he had, Ford said: “I don’t look at myself as the mayor. I look at myself as just a normal, regular person.” “Normal” and “regular” are not the first words that come to mind. There’s a reason that “SNL” is lampooning Ford, who crashed a Toronto Argonauts Canadian football game despite a request by the league’s commissioner that he stay away. Why do we give Ford all this coverage? Most politicians are boring, and this one is a slow-motion train wreck. Every day he seems to top himself. And Canada, usually ignored by the American media, hasn’t gotten this much coverage since the War of 1812. Click for more from Media Buzz.",
      "date": "November 18, 2013",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin and Mitt Romney:  TV stars again",
      "url": "https://www.foxnews.com/politics/sarah-palin-and-mitt-romney-tv-stars-again",
      "subtitle": "Sarah Palin and Mitt Romney:  TV stars again",
      "author": "",
      "content": "Forget ObamaCare and the administration’s push to hype Medicaid expansion this week. It’s two high-profile, non-office-holding Republicans who are getting top Twitter billing. From Variety: “Netflix is ramping up its documentary business, Netflix has acquired theatrical and TV rights to the Mitt Romney documentary “Mitt” with plans to air it exclusively on Jan. 24. “Greg Whitely’s documentary, which provides a behind-the-scenes look at Romney’s campaign, will debut on Jan. 17 at Sundance.” New York Times’ Jonathan Martin tweeted that he and Politico’s Glenn Thrush reported in an e-book that the Romneys found the documentary, “too heavy on his faith,” and he “feared Mormon backlash.” Dan Zak, staff writer at the Washington Post, tried his hand at creating a cut line for the movie. Zak should probably stick to newspapering. *** Meanwhile Sarah Palin took to Twitter (reaching one million followers) announcing her new reality show deal with the Sportsman Channel: Palin beats Mitt by a mile on the Twitter snark-o-meter, and the name-calling was heavy-handed among those who thought her new deal was underwhelming. Fox News contributor Michelle Malkin calls the negativity “haterade,” and compiled the worst of the worst tweets on her blog, including one from a tweeter who hoped Palin would get shot in her trek through the nation’s wilderness. No matter what your politics, wishing someone dead on Twitter is pretty pathetic. The show debuts April 2014. *** This is what a coordinated Twitter roll-out strategy looks like. This strategy is exactly what Zeke Emanuel was talking about on \"Fox News Sunday\" when he lamented the lack of a coordinated PR effort around the ObamaCare rollout. *** And Speaker Boehner is getting an early Christmas Twitter card from Dems demanding he see things their way. Bet he’d rather just get a lump of coal. *** Watch Lauren every Sunday on #MediaBuzz at 11 a.m. and 5 p.m. ET. If you’d like to recommend your favorite political tweets, email laurenashburnFNC@yahoo.com or send her a tweet @laurenashburn with the hashtag #TwitterTalk.",
      "date": "December 10, 2013",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Palin suit against NY Times spotlights a flood of media mistakes",
      "url": "https://www.foxnews.com/politics/palin-suit-against-ny-times-spotlights-a-flood-of-media-mistakes",
      "subtitle": "Palin suit against NY Times spotlights a flood of media mistakes",
      "author": "Howard Kurtz",
      "content": " Sarah Palin’s decision to sue the New York Times over an utterly irresponsible editorial underscores an unfortunate reality: This has been a truly awful stretch for the mainstream media. The former governor’s lawsuit came shortly after CNN forced the resignation of three journalists over a story on the Russia investigation that prompted a retraction and apology to Trump adviser Anthony Scaramucci. And that followed erroneous reports by CNN and ABC that James Comey was going to testify that he never told President Trump he wasn’t under FBI investigation on the Russia matter—except that Comey actually backed up Trump on that point. CNN also got tarred, through no fault of its own, by Kathy Griffin holding up a severed “Trump” head and host Reza Aslan calling Trump a piece of excrement and an “embarrassment to humankind.” The network cut ties with both of them. Every mistake, misstep and overreach gives ammunition to a president who takes a very dim view of the media and has unleashed a torrent of “fake news” tweets in the last two days. And each blunder further convinces Trump supporters that the press has no interest in being fair to this president and his people. Trump seized on the CNN retraction on Twitter, and Sarah Huckabee Sanders teed off in responding to a question on the subject. “I think it’s the constant barrage of fake news directed at this president probably that has garnered a lot of his frustration,” she said. Sanders added that “we have gone to a place where if the media can’t be trusted to report the news, then that’s a dangerous place for America.” Her answer prompted a lengthy interruption from Brian Karem, executive editor of Maryland’s Sentinel newspapers, who declared: “We’re here to ask you questions, you’re here to provide the answers, and what you just did is inflammatory to people all over the country who look at it and say, see, once again, the president is right and everybody else out here is fake media.” Karem’s rant got him a bunch of cable bookings. He said on MSNBC: “We can’t take the bullying anymore. It’s undermining the Fourth Estate, the First Amendment, the reporters in the room, even Breitbart—those people are responsible.” Is it “bullying” when administration officials criticize the media, given that the media rip the administration every day? I don’t like many of the press briefings being moved off camera, but does that amount to bullying? One person who has refused to be bullied is Sarah Palin. Her lawsuit, filed yesterday, deals with a Times editorial that was utterly false and had to be corrected. That editorial was reprehensible, mean-spirited and utterly tone-deaf, coming as it did the same day that Steve Scalise was nearly killed and four other people wounded at a Virginia baseball field. It accused Palin of “incitement” in the 2011 wounding of Gabby Giffords, and the killing of six others, because her political committee circulated a map with crosshairs to mark 20 targeted Democratic districts--with no evidence the gunman ever saw the map. Palin has every right to be furious and every right to sue—but whether she can win is another question. The lawsuit says that the paper’s response “did not approach the degree of the retraction and apology necessary and warranted by the Times’s false assertion that Mrs. Palin incited murder.” The paper tweeted a “sorry” to its readers but did not apologize to Palin, which might have averted the lawsuit. A Times spokeswoman said in a statement, “We have not reviewed the claim yet but will defend against any claim vigorously.” Palin’s problem is that the Supreme Court sets a very high bar for suing public figures for libel, ironically set out in the 1964 case of New York Times v. Sullivan. A public figure, which the former VP nominee most assuredly is, must prove that something was published with actual malice or with reckless disregard for the truth. Having run a correction the next day, the Times might be able to mitigate the charge of malice. What’s sad is that the Times was trying to deflect attention from criticism of left-wing rhetoric, since the Virginia shooter two weeks ago was an avowed hater of Republicans, to right-wing rhetoric by resurrecting this false liberal charge from six years ago. But at the very least, Palin’s lawsuit casts a harsh spotlight on what the Times editorial board did. Journalists are entitled to push back against over-the-top attacks from the Trump administration. But perhaps they should engage in some reflection about all the unforced errors that are fueling the criticism.",
      "date": "June 29, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Todd Palin hospitalized after snowmobile accident",
      "url": "https://www.foxnews.com/politics/todd-palin-hospitalized-after-snowmobile-accident",
      "subtitle": "Todd Palin hospitalized after snowmobile accident",
      "author": "",
      "content": "Todd Palin, the husband of Sarah Palin, was hospitalized after a serious snowmobile accident Sunday night, temporarily taking the former Alaska governor off the campaign trail for Donald Trump. Sarah Palin, though, made a surprise appearance in Tampa, Fla., on behalf of Trump later Monday afternoon -- despite an initial statement from the Trump campaign saying she was returning to Alaska. In the appearance, Palin thanked the public for their prayers as her husband recovers. She went on to slam the media for their coverage of unrest at Trump rallies and urged voters to back the primary front-runner, calling him a “revolutionary” that the country needs. Palin later confirmed the snowmobile accident on her Facebook page calling her husband “the toughest guy I know.” “As any adventurous Alaskan knows, while you may be down, you’re never out,” she said. Todd Palin's father said late Monday that his son suffered eight fractured ribs and other injuries in the snowmobile accident. Jim Palin told The Associated Press in a phone interview that his son also had injuries to his collarbone and lungs, but he doesn't know the extent of those injuries. He added that Todd Palin is scheduled for surgery Monday at a hospital near the Palins' hometown of Wasilla. He says he expects his son to recover fully. The father called the crash Sunday night \"one of those freak accidents\" and says it happened around Petersville, about 70 miles north of Wasilla. Jim Palin, who splits his time between California and Alaska, says he plans to return to Alaska at the end of the month unless his son wants him there earlier. The Trump campaign confirmed earlier Monday afternoon that Todd Palin is currently hospitalized. “Governor Palin is returning to Alaska to be with her husband and looks forward to being back on the campaign trail soon. Mr. Trump’s thoughts and prayers are with the Palin family at this time,” the campaign said. The statement came shortly after the campaign abruptly announced that the Sarah Palin appearance originally scheduled for noon at The Villages in Florida had been cancelled. Just two days earlier, the former Alaska governor and 2008 GOP vice presidential nominee had posted on Facebook that she was heading out to the Sunshine State to stump for Trump, ahead of the state’s Tuesday primary. “Surrendering my ice fishing hole on our still-frozen solid lake to other anglers for the next few days, I'm humbled to be able to hit the campaign trail again for our next POTUS, Donald J. Trump,” she wrote. The details on her husband’s accident are unclear. NBC News reported that he is in intensive care, describing the accident as “very serious.” Nick-named during Palin’s term as governor as the state’s “first dude,” Todd Palin is also an avid snowmobile competitor. He has won the grueling Iron Dog snowmobile competition several times. Sarah Palin, meanwhile, has become one of Trump’s most vocal supporters since endorsing him in January. Before cancelling Monday’s noon event, she appeared on Trump's behalf at the Arcadia All-Florida Championship Rodeo and Florida Strawberry Festival on Sunday. The Associated Press contributed to this report.",
      "date": "March 14, 2016",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin endorses T.W. Shannon in Oklahoma Senate race",
      "url": "https://www.foxnews.com/politics/sarah-palin-endorses-t-w-shannon-in-oklahoma-senate-race",
      "subtitle": "Sarah Palin endorses T.W. Shannon in Oklahoma Senate race",
      "author": "",
      "content": "Former Alaska Gov. Sarah Palin lent her Tea Party credibility to former Oklahoma House Speaker T.W. Shannon, endorsing his effort to replace retiring Sen. Tom Coburn as the next Republican senator from the state. \"T.W.'s opponent has the backing of Beltway insiders, but T.W. has the passion and experience We the People need in Washington,\" Palin wrote in a Facebook post, referring to Rep. James Lankford, R-Okla. \"As the former Speaker he can stand proud on his record of fighting for conservative legislation that directly benefited the lives of Oklahomans by lowering taxes, cutting government waste, and breaking the cycle of poverty by encouraging entrepreneurial self-reliance as the proven path to prosperity.\" Lankford came to office in 2010, in part because of the strength of his grassroots support among Christians in his district. But some conservatives say he has gone native in Washington. Still, it's not clear that this campaign will turn into the same insider/outsider fight that has unfolded in other Republican primaries over the last few years. Sen. James Inhofe, R-Okla., predicted that Shannon wouldn't make it that kind of race. \"I know Shannon well enough to know that it's not going to be that way,\" he told the Washington Examiner on Tuesday. Read more on WashingtonExaminer.com",
      "date": "March 12, 2014",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Early Trump supporter Palin suggests Carrier deal is 'crony capitalism'",
      "url": "https://www.foxnews.com/politics/early-trump-supporter-palin-suggests-carrier-deal-is-crony-capitalism",
      "subtitle": "Early Trump supporter Palin suggests Carrier deal is 'crony capitalism'",
      "author": "",
      "content": "Sarah Palin -- an early Donald Trump supporter and possible administration hire -- is questioning whether the president-elect’s Carrier jobs deal is a case of “crony capitalism.” The former Alaska governor and 2008 GOP vice-presidential nominee says she’s “ecstatic” for Carrier employees. However, she also wonders whether Trump’s successful bid to keep the manufacturer from moving 1,000 jobs from Indiana to Mexico is in fact a case of political influence on the free market, while acknowledging that the specifics of the deal remain unclear. “When government steps in arbitrarily with individual subsidies, favoring one business over others, it sets inconsistent, unfair, illogical precedent,” Palin wrote in an op-ed for the Young Conservative website. The deal purportedly involves the furnace and air conditioning manufacturer getting $6 million in tax subsidies and $1 million in training grants over 10 years. Fiscal conservatives repeatedly criticized outgoing Democratic President Obama of “picking winners and losers” for providing tax credits and other incentives to so-called green energies like solar and wind power while introducing more federal regulations on coal-firing plants. “Republicans oppose this, remember?” Palin wrote. “We support competition on a level playing field, remember? Because we know special interest crony capitalism is one big fail.” Palin is purportedly being considered for the post of Veterans Affairs secretary. Trump vowed on the campaign trail to help military veterans receive better health care through the agency and to keep the Carrier jobs from going to Mexico, part of his overarching promise to stop U.S. companies from moving operation from Midwest manufacturing states to countries with lower costs. The Associated Press contributed to this report.",
      "date": "December 3, 2016",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Alabama Senate race: Palin and Gorka rip Trump-backed ‘establishment’ pick, rally for Roy Moore",
      "url": "https://www.foxnews.com/politics/alabama-senate-race-palin-and-gorka-rip-trump-backed-establishment-pick-rally-for-roy-moore",
      "subtitle": "Alabama Senate race: Palin and Gorka rip Trump-backed ‘establishment’ pick, rally for Roy Moore",
      "author": "Peter Doocy",
      "content": " MONTGOMERY, Ala. – Sarah Palin returned to the campaign trail Thursday night to rally support for Judge Roy Moore in the Alabama Senate race, armed with a pitch heavy on anti-GOP establishment criticism. “We’re sending Trump someone who has our back -- not Mitch McConnell’s,” Palin told a raucous crowd of hundreds. President Trump endorsed the other candidate in this race, Sen. Luther Strange, who was appointed in February to fill the seat left open by Jeff Sessions when he became attorney general. But Palin, the former 2008 Republican vice presidential nominee, insisted that backing Moore is not an act of defiance toward Trump. “A vote for Judge Moore isn’t a vote against the president, it is a vote for the people’s agenda that elected the president,” Palin said. And there are former Trump administration officials and current Republican members of Congress who agree. Sebastian Gorka, who served as a White House adviser until August, joined Palin on stage in Montgomery last night. “All you need to know is that Luther Strange is endorsed by Mitch McConnell,” Gorka told Fox News in an interview.  “He is a creature of the establishment, that’s why we can’t support him.” Gorka says Moore stands for the things that made Trump popular as a candidate, so he isn’t afraid to buck his former boss in this race. ALABAMA CANDIDATES SPAR OVER TRUMP ENDORSEMENT “This isn’t about endorsements, this is about the original agenda that got a billionaire real estate mogul from New York elected to the White House,” Gorka said. Rep. Louie Gohmert, R-Texas, was here for Moore as well, and suggested the president’s endorsement of Strange was a miscalculation. “Sometimes he gets bad advice,” Gohmert said on Trump, before insisting he wants him to win re-election in 2020. The president gets a chance to make his case Friday in Huntsville, where he plans to take Air Force One for an arena rally on behalf of Sen. Strange. On Friday morning, Trump posted the latest in a string of pro-Strange tweets: “Will be in Alabama tonight. Luther Strange has gained mightily since my endorsement, but will be very close. He loves Alabama, and so do I!”",
      "date": "September 22, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Steve King: Sarah Palin would have endorsed Ted Cruz had she gone hunting with him",
      "url": "https://www.foxnews.com/politics/steve-king-sarah-palin-would-have-endorsed-ted-cruz-had-she-gone-hunting-with-him",
      "subtitle": "Steve King: Sarah Palin would have endorsed Ted Cruz had she gone hunting with him",
      "author": "Elizabeth Llorente",
      "content": " DES MOINES, Iowa – Rep. Steve King thinks of his friend Sarah Palin’s endorsement of billionaire Donald Trump and laments what he depicts as a missed opportunity to have her back his choice for president, Sen. Ted Cruz. It was early this year, the congressman said Wednesday during an interview at an Iowa hotel with Fox News Latino, when King, Iowa’s conservative kingmaker, and the group  Citizens United hosted the Freedom Summit, dubbed on its website as an effort “to bring grassroots activists from across Iowa to hear directly from conservative leaders on how we can get America back on track by focusing on our core principles of pro-growth economics, social conservatism, and a strong national defense.” “I had Sarah Palin and Ted Cruz together at dinner then,” King said. “We were planning a pheasant hunt for the next day, and I just didn’t press hard enough to hold Sarah for the next day (hunt).” “If we had gone out to the field together with a shotgun, I think she would have endorsed Ted Cruz,” King said, smiling. “So I’m taking the blame.” Palin and Cruz and King are avid hunters, a chance, the congressman suggested partly in jest and partly seriously, for the firebrand former Alaska governor and the firebrand Texas senator to bond – especially in a way that city slicker Trump can’t with the former governor who boasts about liking the rough and tumble outdoors. Palin has defended hunting, saying: “I especially love moose and caribou. I always remind people from outside our state that there’s plenty of room for all Alaska’s animals – right next to the mashed potatoes.” Last November, amid the cornstalks of the Hawkeye State, Cruz and King, who every year hosts pheasant hunts, participated in one, posing at the end with photos of their dead prey. Palin, a Tea Party conservative who was Sen. John McCain’s running mate in 2008, and became known for her irreverent one-liners and bashing of establishment Washington politics, announced her endorsement of Trump on Tuesday. The endorsement came as Trump is locked in a dead heat with Cruz in Iowa, the first state to vote for the selection of the nominee of each party for the presidential race. King, one the House’s most conservative members and an influential figure in Iowa whose endorsement is pursued by Republicans running for president, says that in all seriousness, Palin shares more fundamental qualities and views with Cruz than with Trump. “I don’t think it will move Trump forward very much,” King said, referring to poll numbers or his standing in Iowa, where Cruz has for the most part enjoyed a lead over the other GOP candidates. “Sarah Palin’s endorsement does move the focus of the press on her and [Trump] while she’s in town. I wish her well, I’m glad she’s back in public life.”",
      "date": "January 21, 2016",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin says Jeb Bush, and immigrants, should 'speak American'",
      "url": "https://www.foxnews.com/politics/sarah-palin-says-jeb-bush-and-immigrants-should-speak-american",
      "subtitle": "Sarah Palin says Jeb Bush, and immigrants, should 'speak American'",
      "author": "",
      "content": "Just days after GOP presidential candidate Donald Trump criticized rival Jeb Bush for frequently speaking Spanish, former Alaska Gov. Sarah Palin picked up on the real estate mogul’s theme by saying that people should “speak American” if they live in the United States. In a CNN interview on Sunday, Palin said she agreed with Trump’s criticism of Bush’s frequent Spanish-speaking on the campaign trail, and the billionaire’s declaration that Bush should set an example for immigrants in the United States by speaking English. “I think that it's a benefit of Jeb Bush to be able to be so fluent in Spanish, because we have a large and wonderful Hispanic population that, you know, is helping to build America. And that's good,” Palin said on CNN's \"State of the Union\" when asked her opinion of Trump’s comments about Bush and language. “And that's a great relationship that he -- and connection that he has with them through his wife and through his family connections.” “On the other hand, you know, I think we can send a message and say, ‘You want to be in America? A, you'd better be here legally or you're out of here. B, when you're here, let's speak American,” Palin said. “I mean that's what's -- let's speak English and that's a kind of a unifying aspect of the nation is the language that is understood by all.” Trump recently hired Michael Glassner, who worked for Palin's vice presidential campaign, as his national political director. Last week, Trump told Breitbart News that Bush should \"set the example\" by speaking English on the campaign trail. \"I like Jeb,\" Trump told Breitbart News. \"He's a nice man. But he should really set the example by speaking English while in the United States.\" Bush is Trump's chief Republican contender. For his part, Bush said his first reaction was to laugh at Trump's criticism of him for speaking Spanish. Bush dismissed Trump’s criticism last week, telling ABC's \"Good Morning America\" Thursday, \"I laughed. I mean this is a joke.\" Bush said he had been responding to a reporter's question in Spanish this week when he replied in Spanish to criticize Trump. Bush called Trump's comments bizarre, adding that Trump is appealing to people's angst and fears rather than their higher hopes. The former Florida governor said that Trump is trying to \"insult his way to the presidency.\" He added that Trump doesn't believe in the country's set of shared values like diversity and tolerance. The Associated Press contributed to this report. Like us on Facebook Follow us on Twitter & Instagram",
      "date": "September 7, 2015",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin has a bit of advice for Carly Fiorina",
      "url": "https://www.foxnews.com/politics/sarah-palin-has-a-bit-of-advice-for-carly-fiorina",
      "subtitle": "Sarah Palin has a bit of advice for Carly Fiorina",
      "author": "",
      "content": "Former vice presidential candidate Sarah Palin offered Carly Fiorina, the only female Republican presidential hopeful, a bit of advice Friday: behave more like Donald Trump. Speaking to conservative activists at the Young America's Foundation's Reagan Ranch Center in Santa Barbara, Calif., the erstwhile governor of Alaska said she's been waiting for Fiorina to \"be candid and really tell [Americans] what she's thinking about a lot of these issues.\" \"For what it's worth, I would encourage her to not let any high-priced consultants who run your campaign mold you into something that's not politically correct and kind of middle-of-the-road on some issues,\" Palin said. \"We want candidates, and we need candidates, to tell us what [they] think,\" she added, noting that \"that's kind of lacking in [Fiorina's] campaign right now.\" Read more on WashingtonExaminer.com",
      "date": "December 4, 2015",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin, Kid Rock, Ted Nugent visit President Trump at the White House",
      "url": "https://www.foxnews.com/politics/sarah-palin-kid-rock-ted-nugent-visit-president-trump-at-the-white-house",
      "subtitle": "Sarah Palin, Kid Rock, Ted Nugent visit President Trump at the White House",
      "author": "Cody Derespina",
      "content": " To paraphrase a famous magazine cover: Break the Internet, President Trump. In a gathering of perhaps the most famous conservative personalities and entertainers in the country, former Alaska Gov. Sarah Palin and musicians Kid Rock and Ted Nugent dined at the White House with Trump on Wednesday night. Palin, Nugent and Kid Rock supported Trump during his underdog presidential candidacy, with Palin, the 2008 GOP vice presidential candidate, backing Trump early in the Republican primary process. \"A great night at the White House. Thank you to President Trump for the invite!\" Palin wrote on Twitter. \"Well well well looky looky here boogie chillin', I got your Shot Heard Round The World right here in big ol greazya-- Washington DC where your 1 & only MotorCity Madman Whackmaster StrapAssasin1 dined with President Donald J Trump at the WhiteHouse to Make America Great Again! Got that?\" Nugent wrote in a Facebook post, citing the 242nd anniversary of the Revolutionary War battles of Lexington and Concord. Nugent, an avid hunter and advocate of the Second Amendment, expanded on the encounter in a blog post for Deer & Deer Hunting Magazine. \"We discussed specifically the counterproductive follies of the Endangered Species Act and the Environmental Protection Agency, as well as the US Fish & Wildlife Service, [Bureau of Land Management] and other out of control bureaucracies,\" Nugent wrote. Kid Rock had yet to post a comment or pictures to his Twitter or Facebook accounts. His fiancee Audrey Berry and Nugent's wife, Shemane, were also at the dinner. White House counselor Kellyanne Conway was present, too, The Hill reported. Fox News' Lesa Jansen contributed to this report.",
      "date": "April 20, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin sues NY Times over editorial tying her to Giffords shooting",
      "url": "https://www.foxnews.com/politics/sarah-palin-sues-ny-times-over-editorial-tying-her-to-giffords-shooting",
      "subtitle": "Sarah Palin sues NY Times over editorial tying her to Giffords shooting",
      "author": "Samuel Chamberlain",
      "content": " Former Alaska Governor and vice presidential candidate Sarah Palin filed a lawsuit against the New York Times Tuesday over an editorial that tied her to the January 2011 shooting of an Arizona congresswoman. Palin's attorneys claim the paper defamed her in the June 14 editorial, published hours after House Majority Whip Steve Scalise, R-La., was shot and wounded by a deranged man while Scalise was practicing with the GOP's baseball team in Alexandria, Va. \"We have not reviewed the claim yet but will defend against any claim vigorously,\" New York Times spokeswoman Danielle Rhoades Ha told Fox News. Palin is being represented by Kenneth Turkel, Shane Vogt and S. Preston Ricardo in the suit. Turkel and Vogt were part of the team that secured Hulk Hogan a $115 million award at trial from Gawker Media Group. Gawker appealed, but the two sides eventually settled for $31 million and Gawker and its founder, Nick Denton, were forced to file for bankruptcy. The editorial, attributed to The Times' editorial board and titled \"America's Lethal Politics,\" initially linked Palin's rhetoric to the shooting that killed six people and wounded 13 others, including then-Rep. Gabrielle Giffords. The paper posted a correction the next day admitting that \"no such link was established.\" The editorial also claimed, incorrectly, that a now-infamous ad from Palin's political action committee put \"Giffords and 19 other Democrats under stylized cross hairs[sic].\" The Times also corrected that statement, admitting that the crosshairs on the map targeted \"electoral districts, not individual Democratic lawmakers.\" \"The Times used its false assertion about Mrs. Palin as an artifice to exploit the [Scalise] shooting,\" Palin's attorneys stated in the suit. \"The Times published and promoted its Editorial Board's column despite knowing ... the false assertion that Mrs. Palin incited [Tucson shooter Jared] Loughner to murder six people,\" the suit added. \"In doing so, the Times violated the law and its own policies.\" Palin is seeking damages in an amount to be determined by a jury.",
      "date": "June 28, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin to subpoena two dozen New York Times staffers in lawsuit",
      "url": "https://www.foxnews.com/politics/sarah-palin-to-subpoena-two-dozen-new-york-times-staffers-in-lawsuit",
      "subtitle": "Sarah Palin to subpoena two dozen New York Times staffers in lawsuit",
      "author": "",
      "content": "Sarah Palin is planning to subpoena almost two dozen New York Times staffers as part of her defamation lawsuit against the newspaper. In a motion arguing for the case to be dismissed, attorneys for The New York Times said that Palin’s lawyers had served notice that she plans to subpoena “23 non-party current and former Times reporters, editors and other employees -- most of whom had nothing to do with the editorial issue,” according to court documents the New York Post obtained Wednesday. Palin’s legal team also reportedly plans to ask the Times to produce “every internal communication it has had about her since 2011,” in an effort to obtain “documents that might reveal, among other things, their ‘negative feelings’ toward her,” the Times reportedly told the judge on Wednesday. The former Alaska governor and vice presidential candidate is suing the Times after the newspaper published an editorial on June 14, hours after House Majority Whip Steve Scalise, R-La., was shot and wounded at a Republican congressional baseball practice. Palin claims that the editorial tied her to the January 2011 shooting of Arizona Congresswoman Gabrielle Giffords. The editorial, attributed to the Times’ editorial board and titled “America’s Lethal Politics,” initially linked Palin’s rhetoric to the shooting that killed six people and wounded 13 others, including Giffords. The Times posted a correction the following day, admitting that “no such link was established.” The editorial also claimed, incorrectly, that a now-infamous ad from Palin’s political action committee put “Giffords and 19 other Democrats under stylized crosshairs.” The Times also corrected that statement, admitting that the crosshairs on the map targeted “electoral districts, not individual Democratic lawmakers.” “The Times used its false assertion about Mrs. Palin as an artifice to exploit the [Scalise] shooting,” Palin’s attorneys stated in the lawsuit. “The Times published and promoted its editorial board’s column despite knowing…the false assertion that Mrs. Palin incited [Tucson shooter Jared] Loughner to murder six people,” the suit added. “In doing so, the Times violated the law and its own policies.” The New York Times has reportedly claimed that Palin has no case because she cannot claim malice, which is the legal standard for claiming defamation. Asked for comment on Thursday, a New York Times spokesperson told Fox News: \"We raised our concern about the subpoenas in a section of the brief that quotes Judge Robert Bork as saying 'a freshening stream of libel actions, which often seem as much designed to punish writers and publications as to recover damages for real injuries, may threaten the public and constitutional interest in free, and frequently rough, discussion.'\" The representative then referred to an earlier response to the suit, saying: \"It is agonizing to get something wrong, but as soon as our editors become aware of the error, they corrected it. We are confident that the First Amendment protects publishers in these circumstances, and we intend to defend the action vigorously.\"",
      "date": "July 27, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin endorses Donald Trump's presidential bid",
      "url": "https://www.foxnews.com/politics/sarah-palin-endorses-donald-trumps-presidential-bid",
      "subtitle": "Sarah Palin endorses Donald Trump's presidential bid",
      "author": "",
      "content": "Former vice-presidential nominee and governor of Alaska Sarah Palin made her first foray into the 2016 presidential race Tuesday by announcing she is endorsing Donald Trump. \"I am proud to endorse Donald J. Trump for President of the United States of America,\" Palin said in a statement from the Trump campaign announcing the endorsement. She later appeared alongside Trump at a campaign event at Iowa State University in Ames, Iowa “You’re putting relationships on the line for this country because you’re willing to make America great again,” she said at the rally. “I am here because like you, I know it’s now or never.” “I’m in it to win it because we believe in America,” she added. Trump told supporters he was “greatly honored” to receive Palin’s support. “She’s the woman that from day one I said I needed to get her support,” he said. Palin, who became a symbol of the Tea Party movement following the 2008 presidential election, is the highest-profile backer for a Republican contender so far in the race. In her endorsement speech, Palin praised Trump for bringing up controversial issues to create “a good, heated primary,” while taking aim at what she called “establishment candidates” in the race. “They’ve been wearing political correctness kind of like a suicide vest,” she said. The endorsement comes less than two weeks ahead of the critical lead-off Iowa caucus, where Trump is locked in a dead heat with Texas Sen. Ted Cruz. In the statement announcing the endorsement, Trump's campaign described Palin as a conservative who \"helped launch the careers of several key future leaders of the Republican Party and conservative movement.\" The statement also quoted Cruz as once saying he \"would not be in the United States Senate were it not for Gov. Sarah Palin...She can pick winners.\" Campaigning in New Hampshire, Tuesday, Cruz responded to Palin's endorsement of Trump, saying \"regardless of what Sarah intends to do in 2016, I will remain a big, big fan of Sarah Palin.\" Trump's national political director Michael Glassner previously worked with Palin, who was a virtual newcomer to the national political arena when McCain named her as his running mate. Palin is expected to join Trump on Wednesday for campaign events in Norwalk, Iowa and Tulsa, Okla. “Even with a record number of candidates and internal calls to become more inclusive as a party, Donald Trump and Sarah Palin remain two of the GOP’s most influential leaders,\" Mark Paustenbach, Democratic National Committee Press secretary, said in a statement responding to the endorsement. \"Their divisive rhetoric is now peddled by everyone from Ted Cruz to Marco Rubio.  Americans deserve better than what Trump and Palin have to offer, but it seems like the other Republican candidates would rather follow in their footsteps,” the statement continued. Palin's endorsement was not the only one Trump received Tuesday. While campaigning at Iowa's John Wayne Birthplace Museum, he received an endorsement from the western film actor’s daughter, Aissa Wayne. Wayne said the country needs a strong and courageous leader like her father, and that he would be offering his endorsement if he were still alive. Trump said he was a big fan of Wayne and that the actor represented strength and power — which, he said, the American people are looking for. The Associated Press contributed to this report.",
      "date": "January 19, 2016",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin's oldest son, Track, arraigned on domestic violence charges",
      "url": "https://www.foxnews.com/politics/sarah-palins-oldest-son-track-arraigned-on-domestic-violence-charges",
      "subtitle": "Sarah Palin's oldest son, Track, arraigned on domestic violence charges",
      "author": "Nicole Darrah",
      "content": " Track Palin, the oldest son of former Alaska Gov. Sarah Palin, was arraigned Sunday after being arrested a day earlier on charges of domestic violence. Palin, 28, was charged with first-degree burglary, one charge of fourth-degree assault and one charge of fourth-degree criminal mischief, KTUU reported. The news station also reported Palin is in custody at the Mat-Su Pre-Trial Facility in Palmer, about 20 miles northeast of Wasilla. He was charged with misdemeanor mischief for allegedly causing up to $500 in property damage, according to the Los Angeles Times. SARAH PALIN'S OLDEST SON ARRESTED IN DOMESTIC VIOLENCE CASE Palin’s arrest on charges of domestic violence isn’t his first. In January 2016, he was charged with assault, interfering with the report of a domestic violence crime and possessing a weapon while intoxicated in connection with the incident. At the time, Palin’s girlfriend told law enforcement he punched her in the face, and said she was scared he would shoot himself with an AR-15. The girlfriend reportedly had bruising and swelling around her left eye, and she said her right knee hurt after Palin kicked her there. Sarah Palin, the vice presidential candidate alongside Sen. John McCain in 2008, took heat after the arrest for seemingly saying President Obama was at fault for her son’s issues following his service in the Iraq War. “My son, like so many others, they come back a bit different. They come back hardened,” Sarah Palin said. “They come back wondering if there is that respect for what it is that their fellow soldiers and airmen and every other member of the military have sacrificially given to this country and that starts at the top.” She added that military members look to Obama and question whether he knows the sacrifices they make to “secure America and to secure freedoms.” 'ELEPHANT IN THE ROOM': PALIN DEFENDS SON AFTER DOMESTIC VIOLENCE ARREST Track Palin served in Iraq for one year in 2008 as part of the Alaska-based 25th Infantry Division’s 1st Stryker Brigade, according to KTUU. He also made headlines in Sept. 2014 after reports circulated that the well-known family got into a brawl at a house party in Anchorage in which Track, who had blood near his hands and mouth, initially appeared “belligerent” when speaking to a police officer. The Associated Press contributed to this report.",
      "date": "December 17, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin 'seriously interested' in 2016 bid",
      "url": "https://www.foxnews.com/politics/sarah-palin-seriously-interested-in-2016-bid",
      "subtitle": "Sarah Palin 'seriously interested' in 2016 bid",
      "author": "",
      "content": "Former Alaska governor Sarah Palin expressed interest in entering the presidential fray hours before addressing conservative activists alongside a group of fellow White House hopefuls at the Iowa Freedom Summit Saturday. Palin, a former vice presidential candidate, told the Washington Post she is \"seriously interested\" in launching a campaign for the presidency in 2016. Her comments came days after telling ABC she would \"of course\" consider running because Americans have \"had enough of seeing that sign on the Oval Office door saying, 'No Girls Allowed.'\" “You can absolutely say that I am seriously interested,” Palin said Friday in Des Moines. \"As I said yesterday, I’m really interested in the opportunity to serve at some point.” Read more on WashingtonExaminer.com",
      "date": "January 24, 2015",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin knocks Elizabeth Warren for swiping her quote",
      "url": "https://www.foxnews.com/politics/sarah-palin-knocks-elizabeth-warren-for-swiping-her-quote",
      "subtitle": "Sarah Palin knocks Elizabeth Warren for swiping her quote",
      "author": "",
      "content": "Sen. Elizabeth Warren has long advocated redistribution. Apparently that principle goes for both wealth – and quotes. Sarah Palin is calling out the liberal Massachusetts senator after Warren tweeted the catch phrase \"fight like a girl\" on Tuesday, below a picture of her posing with the “Fearless Girl” statue in New York City. Problem is, the same quote has been used repeatedly over the years by the former Alaska governor. And the Republican firebrand says it doesn't have the same punch coming from Warren. “I don’t know. Coming from liberals who urge women to claim victimization, ‘Fight like a girl’ just doesn’t sound the same as when legit fighters for equality say it, mean it, live it, and will never give it up,” Palin told Breitbart News. Palin has been most associated with the phrase in recent years, and even used it as a Facebook caption on Jan. 15 – three months before Warren’s post.",
      "date": "April 19, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin backs Moore in Alabama Senate race",
      "url": "https://www.foxnews.com/politics/sarah-palin-backs-moore-in-alabama-senate-race",
      "subtitle": "Sarah Palin backs Moore in Alabama Senate race",
      "author": "",
      "content": "In a break from President Trump, former Alaska governor and 2008 Republican vice presidential candidate Sarah Palin has endorsed Roy Moore in Alabama’s U.S. Senate race. The president has endorsed Moore’s opponent, incumbent Luther Strange. Breitbart News broke the news of the Palin endorsement of Moore on Thursday. Moore and Strange will face off Sept. 26 in a runoff after they finished first and second in the Republican primary earlier this month. The winner will face Democratic nominee Doug Jones, a former U.S. attorney, in the Dec. 12 general election. Moore is leading most polls in Alabama, AL.com reported. Perhaps taking a jab at the president, Palin invoked his “make America great again” slogan in her endorsement statement about Moore: “Glad he’s running and am honored to endorse Judge Roy Moore for the US Senate. Judge Moore has shown he has what it takes to stand up to the out-of-touch political establishment. The Judge has proven he’s not afraid of a fight for what is right, and he’s ready to take on DC’s swamp monsters and help make America great again. We need more bold leaders like Judge Moore who will fight for all of us in the US Senate.” Strange was appointed to the Senate after former Sen. Jeff Sessions was named U.S. attorney general. Moore was Alabama's chief justice but was removed from office for defying a federal order related to same-sex marriage. In a statement, Moore thanked Palin for her support. \"Governor Palin has a strong record of speaking out for conservative causes and standing up to the Washington establishment. Having her support shows how conservatives across the country are uniting behind our campaign to send a message to Mitch McConnell and the Washington elites who are trying to buy this election,\" he said.",
      "date": "August 25, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin lawsuit against New York Times thrown out",
      "url": "https://www.foxnews.com/politics/sarah-palin-lawsuit-against-new-york-times-thrown-out",
      "subtitle": "Sarah Palin lawsuit against New York Times thrown out",
      "author": "",
      "content": "A federal judge on Tuesday tossed out a defamation lawsuit by Sarah Palin against The New York Times, saying the former Alaska governor failed to show the newspaper knew it was publishing false statements in an editorial before quickly correcting them. The written ruling by Judge Jed Rakoff in Manhattan said the lawsuit seeking unspecified damages \"fails on its face to adequately allege actual malice.\" The decision came weeks after the onetime Republican vice presidential nominee sued over an editorial titled \"America's Lethal Politics.\" It was published in June after a gunman opened fire on Republican lawmakers in Virginia, wounding U.S. Rep. Steve Scalise. The Times' editorial was corrected twice when readers complained that it appeared to blame a political action committee belonging to Palin, a former Republican vice presidential candidate, for \"political incitement\" after it distributed a map depicting Democratic lawmakers beneath crosshairs before the 2011 shooting of Democratic U.S. Rep. Gabby Giffords in Arizona. The newspaper issued corrections the next morning to remove those references and note the map showed electoral districts, not people, in crosshairs. \"What we have here is an editorial, written and rewritten rapidly in order to voice an opinion on an immediate event of importance, in which are included a few factual inaccuracies somewhat pertaining to Mrs. Palin that are very rapidly corrected. Negligence this may be; but defamation of a public figure it plainly is not,\" Rakoff said. Rakoff, known for philosophical asides, wrote: \"Nowhere is political journalism so free, so robust, or perhaps so rowdy as in the United States. In the exercise of that freedom, mistakes will be made, some of which will be hurtful to others.\" He said if political journalism is to achieve its constitutionally endorsed role of challenging the powerful, lawsuits by public figures must be limited to when there is a \"plausible factual basis for complaining that the mistake was made maliciously.\" Lawyers for Palin did not immediately comment. In a statement, the Times said it was delighted with the ruling and regretted the errors. \"Judge Rakoff's opinion is an important reminder of the country's deep commitment to a free press and the important role that journalism plays in our democracy,\" the newspaper said. Rakoff had previously heard testimony from James Bennet, the Times' editorial page editor, saying he thought the editorial was accurate when he approved its publication but later learned otherwise. The judge dismissed an argument by Palin's lawyers that the newspaper might have been trying to boost sales by attacking Palin. \"As to the alleged 'hostility,' it goes without saying that the Times editorial board is not a fan of Mrs. Palin. But neither the fact of that opposition, nor the supposition that a sharp attack on a disfavored political figure will increase a publication's readership, has ever been enough to prove actual malice,\" he wrote. Rakoff added: \"There is not a shred of factual support, either in the complaint or in the evidentiary hearing, for the supposition that considerations of attracting readership ever entered Mr. Bennet's mind when he was drafting this particular editorial. Indeed, if that were his goal, one would have expected him to mention Mrs. Palin's name more than once in the editorial or use her name in the social media promoting the editorial, neither of which was done.\"",
      "date": "August 29, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Appeals court gives new life to Sarah Palin's defamation lawsuit against New York Times",
      "url": "https://www.foxnews.com/politics/appeals-court-gives-new-life-to-sarah-palins-defamation-lawsuit-against-ny-times",
      "subtitle": "Appeals court gives new life to Sarah Palin's defamation lawsuit against New York Times",
      "author": "Ronn Blitzer",
      "content": " Sarah Palin’s defamation lawsuit against The New York Times over an editorial that linked her political action committee to the shooting of former Rep. Gabrielle Giffords, D-Ariz., has been revived, after a lower court judge previously had dismissed it. The Second Circuit Court of Appeals ruled on Tuesday that Judge Jed Rakoff of the Southern District of New York strayed from procedural norms before tossing out Palin’s libel complaint in August 2017. Rakoff held a hearing to learn more facts about the case before ruling on the Times’ motion to dismiss, when such decisions typically rely solely on what is alleged in court documents. PALIN SUIT AGAINST NY TIMES SPOTLIGHTS A FLOOD OF MEDIA MISTAKES “We find that the district court erred in relying on facts outside the pleadings to dismiss the complaint,” Second Circuit Judge John M. Walker Jr. wrote. The former vice presidential candidate sued the Times for libel after a June 2017 editorial about the shooting of GOP Rep. Steve Scalise and others mentioned a map put out years earlier by SarahPAC that had crosshairs over different Democratic congressional districts. While the map had been used in reference to ObamaCare, the editorial connected it to Jared Loughner’s 2011 shooting of Giffords, whose district was among the ones identified in the map. The editorial said that the SarahPAC map had Giffords and other Democrats under crosshairs (though the targets were over their districts). In discussing the Scalise shooting, the Times said, “Though there’s no sign of incitement as direct as in the Giffords attack, liberals should of course hold themselves to the same standard of decency that they ask of the right.” “No evidence ever emerged to establish that link; in fact, the criminal investigation of Loughner indicated that his animosity toward Representative Giffords had arisen before SarahPAC published the map,” Walker noted Tuesday. The Times published a correction after receiving backlash for the editorial, noting that there was no link between the map and the shooting. Rakoff had originally held the hearing in question in order to learn whether there was enough support for Palin’s claim that the editorial was published with “actual malice” – knowledge that a statement is false or reckless disregard for whether it is true – which is the standard for public figures to bring defamation claims. GREGG JARRETT: SARAH PALIN VS. THE NEW YORK TIMES -- FIVE REASONS WHY EX-GOVERNOR MIGHT JUST WIN HER CASE Rakoff brought in the author of the editorial, James Bennet, who answered questions about his knowledge that the Times had previously published articles that said there was no link between the map and the shooting. Bennet said he was unaware at the time he wrote the editorial. The information Rakoff learned from the hearing was enough for him to dismiss Palin’s claim with prejudice, meaning she was not permitted to file an amended complaint. The Second Circuit ruled that this was improper as it ran “headlong” into the Federal Rules of Civil Procedure. CLICK HERE TO GET THE FOX NEWS APP A Times spokesperson told The Associated Press that the newspaper is disappointed and will vigorously fight the lawsuit. The Second Circuit sent the case back down to the Southern District of New York, ordering it to move forward with discovery. The Associated Press contributed to this report.",
      "date": "August 6",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin responds to McCain's regrets revealed in new book",
      "url": "https://www.foxnews.com/politics/sarah-palin-responds-to-mccains-regrets-revealed-in-new-book",
      "subtitle": "Sarah Palin responds to McCain's regrets revealed in new book",
      "author": "Amy Lieu",
      "content": " Sarah Palin, the former Alaska governor and John McCain’s 2008 running mate, reportedly said she feels a “perpetual gut-punch” every time she hears about McCain’s regret in picking her for his team. “That’s not what Sen. McCain has told me all these years, as he’s apologized to me repeatedly for the people who ran his campaign,” Palin told The Daily Mail. She said over the years, \"I stop him all the time and say, 'Please don't apologize.'\" McCain wrote in his book, “The Restless Wave,” that he regretted not choosing his friend, Connecticut Senator Joseph Lieberman, as his running mate, calling it “another mistake that I made,” according to The New York Times. McCain reportedly wrote that his advisers warned him against picking a vice-presidential candidate who caucused with Democrats. His advisers picked Palin, the Alaska governor and Tea Party favorite. “I attribute a lot of what we're hearing and reading regarding McCain's statements to his ghostwriter or ghostwriters,” Palin said. “I don't know unless I heard it from Sen. McCain myself.”",
      "date": "May 11, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez compares Sarah Palin to 'grandpa emails' in Twitter feud",
      "url": "https://www.foxnews.com/politics/ocasio-cortez-targets-sarah-palin-in-tweet-after-former-alaska-gov-mocked-her",
      "subtitle": "Alexandria Ocasio-Cortez compares Sarah Palin to 'grandpa emails' in Twitter feud",
      "author": "Elizabeth Zwirz",
      "content": " Newly elected Rep. Alexandria Ocasio-Cortez and former Alaska Gov. Sarah Palin are trading barbs on Twitter. “Now that’s *TWO* fallen GOP Vice Pres candidates going after a freshman Congresswoman that’s not even sworn in yet,” Ocasio-Cortez tweeted. “Isn’t it a little early to be bringing out the big guns? Especially when they look like the FWD:RE:FWD:WATCH THIS grandpa emails from the ‘08 election they lost.” The spat began after Palin, running mate to Republican presidential candidate John McCain in 2008, tweeted on Monday: “YIKES: Ocasio-Cortez Fumbles Basic Civics TWICE In 1 Statement.” Palin’s tweet came alongside an article from governorpalin.org, which included a screenshot of a Twitter post from Ryan Saavedra, a reporter at The Daily Wire. The reporter on Sunday evening shared a video of Ocasio-Cortez making a mistake when talking about the government. “If we work our butts off to make sure that we take back all three chambers of Congress — uh, rather, all three chambers of government: the presidency, the Senate, and the House in 2020, we can’t start working in 2020,”’ Ocasio-Cortez is heard saying on the video. Ocasio-Cortez fired back, turning the conversation to health care. “Maybe instead of Republicans drooling over every minute of footage of me in slow-mo, waiting to chop up word slips that I correct in real-tomd (sic), they actually step up enough to make the argument they want to make: that they don’t believe people deserve a right to healthcare,” she tweeted. OCASIO-CORTEZ SAYS PEOPLE KEEP MISTAKING HER FOR A CAPITOL HILL INTERN She later tweeted a correction of the spelling of “real-time.” In a follow-up to her retort aimed at Palin, Ocasio-Cortez revealed on Twitter Tuesday that the other vice presidential candidate she had been referring to was “Lieberman,” seemingly referring to 2000 Democratic vice-presidential candidate Joe Lieberman. She later tweeted: “For those who need their jokes explained to them: surprise! This tweet thread is humorous! The emoji in the original tweet signals that humor is indicated in the statement. :) (You know, because Lieberman killed the public option for healthcare and endorses Republicans).” Ocasio-Cortez, the 29-year-old Democratic socialist from New York, defeated her Republican challenger earlier this month in the midterm elections, becoming the youngest female elected to Congress. Fox News’ Dom Calicchio contributed to this report.",
      "date": "November 20, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin not invited to McCain funeral: reports",
      "url": "https://www.foxnews.com/politics/sarah-palin-not-invited-to-mccain-funeral-reports",
      "subtitle": "Sarah Palin not invited to McCain funeral: reports",
      "author": "Dom Calicchio",
      "content": " In 2008, she was chosen to be his running mate – potentially just a heartbeat away from the presidency. But now former Alaska Gov. Sarah Palin, like President Trump, has been left off the list of invitees to the funeral of the late U.S. Sen. John McCain, according to multiple reports. “My guess is, it came from Cindy,” a source close to the McCain family told People magazine, referring to the late senator’s widow. “She is very protective of John’s memory and legacy. She’s also a grieving widow. I think she wants to get through this as best she can.” The message was sent through an intermediary, not directly from the McCain family, according to the report. An NBC reporter tweeted that a Palin \"family source\" said, “Out of respect to Senator McCain and his family we have nothing to add at this point. The Palin family will always cherish their friendship with the McCains and hold those memories dear.” Palin did not immediately respond to a Fox News email sent early Thursday. A decade ago, it was McCain’s selection of Palin to be his vice president that catapulted Palin to the national political spotlight from relative obscurity in Alaska. But their relationship quickly grew strained, amid accusations that Palin was often unprepared for media interviews, or had “gone rogue” by ignoring the advice of McCain campaign handlers. Some critics charged that Palin was more interested in advancing her own career – and popularity among conservative voters -- than assuring the success of the McCain-Palin ticket, led by the more moderate McCain. In May, McCain published a book titled “The Restless Wave,” in which he wrote that he regretted choosing Palin as his running mate instead of his close friend, former U.S. Sen. Joe Lieberman of Connecticut. McCain and Palin ultimately lost the White House in 2008 to Barack Obama and Joe Biden. Ironically, Biden is scheduled to speak Thursday at a McCain memorial service in the senator’s home state of Arizona, while Obama has been invited to deliver a eulogy Saturday at a McCain memorial service in Washington, D.C. Following McCain’s death from brain cancer last Saturday at age 81, Palin issued a pair of Twitter messages. “Today we lost an American original,” she wrote. “Sen. John McCain was a maverick and a fighter, never afraid to stand for his beliefs. John never took the easy path in life - and through sacrifice and suffering he inspired others to serve something greater than self.” Later, she wrote: “John McCain was my friend. I will remember the good times. My family and I send prayers for Cindy and the McCain family.”",
      "date": "August 30, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin says it was a 'gut punch' to be excluded from McCain funeral",
      "url": "https://www.foxnews.com/politics/sarah-palin-says-it-was-a-gut-punch-to-be-excluded-mccain-funeral",
      "subtitle": "Sarah Palin says it was a 'gut punch' to be excluded from McCain funeral",
      "author": "Brooke Singman",
      "content": " Sarah Palin says it was a “gut punch” not to be invited to the funeral of her 2008 running mate, the late Sen. John McCain, last year. Palin, who was tapped as McCain’s pick for vice president during the 2008 race, opened up about the funeral during an interview on “Good Morning Britain.” TRUMP RIPS INTO MCCAIN'S LEGACY, SUPPORT FOR IRAQ WAR DURING SPEECH TO OHIO PLANT WORKERS “I was kinda surprised to be publicly disinvited to the funeral. I think that was an unnecessary step,” Palin told Piers Morgan. “They didn’t have to embarrass me and embarrass others. That was all weird. I hope that doesn’t happen to other people. It’s kind of a gut punch.” McCain, who died last August from brain cancer, reportedly planned his own funeral. According to reports, Palin learned she was not invited to the services through an intermediary, not directly from the McCain family. A Palin family source, at the time, told NBC News that, “Out of respect to Senator McCain and his family we have nothing to add at this point. The Palin family will always cherish their friendship with the McCains and hold those memories dear.” But last May, McCain published a book titled “The Restless Wave,” in which he wrote that he regretted choosing Palin as his running mate instead of his close friend, former U.S. Sen. Joe Lieberman of Connecticut. DONALD TRUMP'S FEUD WITH MCCAIN FAMILY ESCALATES: 'I WAS NEVER A FAN' When he died, Palin posted a pair of tweets touting McCain and his record. “Today we lost an American original,” she wrote. “Sen. John McCain was a maverick and a fighter, never afraid to stand for his beliefs. John never took the easy path in life - and through sacrifice and suffering he inspired others to serve something greater than self.” Later, she wrote: “John McCain was my friend. I will remember the good times. My family and I send prayers for Cindy and the McCain family.” Meanwhile, McCain also reportedly requested that President Trump not attend his funeral, and instead, send Vice President Pence. Last month, Trump tore into McCain’s legacy and took credit for the late senator’s state funeral in Washington last year. “I endorsed him at his request, gave him the kind of funeral he wanted, which as president of the United States I had to approve,” Trump said. “I don’t care, but I didn’t get a thank you.” He added: “I never liked him much. I really probably never will.” Trump’s attacks on McCain drew a rebuke from Republicans, who defended the late senator and his accomplishments. Fox News’ Dom Calicchio and Andrew O’Reilly contributed to this report.",
      "date": "April 2",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin says her house is damaged from Alaska earthquake",
      "url": "https://www.foxnews.com/politics/sarah-palin-says-her-house-is-damaged-from-alaska-earthquake",
      "subtitle": "Sarah Palin says her house is damaged from Alaska earthquake",
      "author": "Alex Pappas",
      "content": " Former Alaska Gov. Sarah Palin said Friday her house suffered damage from the earthquake that rocked Alaska and expressed relief that her family is safe. “Our family is intact - house is not... I imagine that’s the case for many, many others,” Palin wrote in a tweet asking for prayers for Alaska. “So thankful to be safe; praying for our state following the earthquake.” Palin, the 2008 Republican vice presidential nominee who is from Wasilla, did not elaborate on the extent of the damage to the family’s home. In Anchorage, back-to-back earthquakes measuring 7.0 and 5.8 rocked buildings and buckled roads Friday morning, prompting people to run from their offices or take cover under desks and triggering a warning to residents in Kodiak to flee to higher ground for fear of a tsunami. LARGE ALASKA EARTHQUAKE JOLTS RESIDENTS, SHAKES BUILDINGS The U.S. Geological Survey said the first and more powerful quake was centered about seven miles north of Anchorage, Alaska's largest city. Cracks could be seen in a two-story downtown Anchorage building. It was unclear whether there were injuries. Photographs posted to social media sites showed damage that included collapsed ceiling tiles at an Anchorage high school and buckled roads. One image showed a car stranded on an island of pavement, surrounded by cavernous cracks where the earthquake split the road. The Associated Press contributed to this report.",
      "date": "November 30",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin and husband, Todd, apparently getting a divorce, court papers indicate",
      "url": "https://www.foxnews.com/politics/sarah-palin-and-husband-todd-apparently-getting-a-divorce-documents-show",
      "subtitle": "Sarah Palin and husband, Todd, apparently getting a divorce, court papers indicate",
      "author": "Andrew O'Reilly",
      "content": " After 31 years of marriage, former Alaska Gov. Sarah Palin and her husband, Todd, are apparently calling it quits. Court papers appear to show that Todd Palin filed for divorce Friday from his wife - and the 2008 Republican vice presidential nominee – Sarah Palin in the Anchorage Superior Court with the Anchorage Daily News reporting the reason being “incompatibility of temperament between the parties such that they find it impossible to live together as husband and wife.” MATT LAUER AND ANNETTE ROQUE OFFICIALLY DIVORCED The news of the divorce was first reported by Alaska blogger Craig Medred, who noticed that the court filing records only indicated a certain TMP was seeking a divorce from a certain SLP. The former governor’s full name is Sarah Louise Palin, while her husband’s name is Todd Mitchell Palin. The birthdays of the plaintiff and defendant in the court filing also align with those of Todd and Sarah Palin. The couple is reportedly seeking joint custody of their 11-year-old son,Trig, while their other four children — Bristol, Willow, Piper and Track — are all adults. The Palins, who surged to national prominence when the late Sen. John McCain, R-Ariz., selected the Alaska governor as his running mate in the 2008 presidential election against Barack Obama and Joe Biden, have faced rumors of a strained relationship. CLICK HERE TO GET THE FOX NEWS APP Rumors of a divorce once again began to swirl when Todd failed to show up alongside Sarah last month during an appearance at the famed Sturgis motorcycle rally in South Dakota. Sarah Palin said that her husband – a well-known motorsport enthusiast and Irondog snowmachine race winner – was flying around Alaska, according to reports. Since resigning as governor in 2009 amid controversies and ethics investigations, Palin has largely remained out of state politics, but has become a prominent figure in conservative politics – penning a number of books and making frequent appearance on television and during speaking engagements.",
      "date": "September 9",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    }
  ]
}