{
  "articles": [
    {
      "title": "Trump delivers statement after meeting with Mitch McConnell -- live blog",
      "url": "https://www.foxnews.com/politics/trump-delivers-statement-after-meeting-with-mitch-mcconnell-live-blog",
      "subtitle": "Trump delivers statement after meeting with Mitch McConnell -- live blog",
      "author": "",
      "content": "President Trump held sudden media availability after having lunch with Senate Majority Leader Mitch McConnell. Follow Fox News' live blog below. Mobile users click here.",
      "date": "October 16, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Sept. 11 first responders call sit-down with McConnell 'one of the best meetings we've had'",
      "url": "https://www.foxnews.com/politics/9-11-first-responders-say-sit-down-with-mcconnell-was-one-of-the-best-meetings-weve-had",
      "subtitle": "Sept. 11 first responders call sit-down with McConnell 'one of the best meetings we've had'",
      "author": "Vandana Rambaran",
      "content": " Senate Majority Leader Mitch McConnell, R-Ky., met with 9/11 first responders on Tuesday after comedian and advocate Jon Stewart accused McConnell of having used the victim's compensation fund as a \"political football.\" \"McConnell made a commitment he's going to help get a piece of legislation that's going to pass the House in July for a vote in August in the Senate. We wanted it as soon as possible, and to get the Senate Majority Leader's commitment means a lot,\" John Feal, a recovery worker at the World Trade Center site and a longtime activist, said Tuesday after the meeting with McConnell at the Capitol. 9/11 VICTIMS FUND BILL PASSES HOUSE JUDICIARY COMMITTEE, A DAY AFTER JON STEWART'S FIERY TESTIMONY \"They work for us. The chairs that they put their a--es in, the pens that they use, the pads that they write on, we pay for that sh--,\" Feal added. \"That’s us. They work for us. Mitch McConnell works for us. He works for all of you guys. Today Mitch McConnell promised to work for us. I’m going to take him for his word.\" McConnell has been criticized by advocates of the legislation to extend the $7.4 billion fund, which will run out of money in December 2020, claiming his inaction in the past has stalled the progress of legislation to replenish the fund. The Justice Department said in February the victims' compensation fund is being depleted and benefit payments are being cut by up to 70 percent, a source of deep frustration for advocates who want to see victims and families afforded financial security to cope with lingering diseases from the attacks. Joined by other first responders from the NYPD, Feal expressed that he is \"a ball of emotions,\" particularly in light of the impending death of his friend and colleague, retired NYPD Detective Luis Alvarez who gave his final interview to Fox News' Shepard Smith on Thursday as he suffers from liver failure after his battle with cancer, a result of his service after the September 11th attacks. \"We're going to leave here and Luis Alvarez is going to die,\" Feal said, choking up with emotion. \"In that meeting, we gave McConnell Alvarez's badge. We wanted the Senate Majority Leader to be reminded of people like Alvarez. He's got his badge now. If he strays from his commitment, then we'll go back into attack mode but for now, we'll put down our swords, pick up our rakes, we'll farm and be with our friends who are sick and dying.\" The House Judiciary Committee passed a reauthorization bill for the 9/11 Victims’ Compensation Fund on Wednesday, where it will now move to the full House and is expected to pass with bipartisan support. Advocates have rallied to keep the bill alive until 2090, the expected lifespan of first responders who developed illnesses from inhaling toxic fumes during recovery efforts and while clearing rubble at the World Trade Center, the Pentagon and Shanksville, Pa. following the terrorist attacks in 2001. More than 2,000 firefighters, police officers, federal agents and other first responders have died from 9/11-related diseases and that number is expected to climb over time, according to the Centers for Disease Control and Prevention's World Trade Center Health Program. CLICK HERE FOR THE FOX NEWS APP Critics have opposed making the bill open-ended, while advocates have cited the terminal illnesses that many first responders continue to face. More than 40,000 people have applied to the fund and over $5 billion in benefits have been awarded out of the $7.4 billion fund with about 21,000 claims still pending.",
      "date": "June 25",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Elaine Chao tells protesters to 'leave alone' husband Mitch McConnell when confronted on immigration",
      "url": "https://www.foxnews.com/politics/elaine-chao-tells-protesters-to-leave-alone-husband-mitch-mcconnell-when-confronted-on-immigration",
      "subtitle": "Elaine Chao tells protesters to 'leave alone' husband Mitch McConnell when confronted on immigration",
      "author": "Elizabeth Zwirz",
      "content": " Transportation Secretary Elaine Chao tried to intercede between protesters and her husband, Senate Majority Leader Mitch McConnell, as they continually asked McConnell why he was \"separating families,\" at an event in Washington, D.C. on Monday. The couple was departing an event held at Georgetown University, The Hill reported, when the individuals approached the building. Video of the moment was tweeted Tuesday by Hillary Clinton adviser Adam Parkhomenko, and seemed to originate from Twitter user Roberto, who identified himself as being amongst the group. “Why don't you leave my husband alone?” Chao said. Chao was later heard saying “He is not,” seemingly in response to the repeated questions about “separating families.” 17 STATES FILE LAWSUIT AGAINST TRUMP IMMIGRATION POLICIES OVER FAMILY SEPARATIONS Before she was ultimately escorted back to her waiting vehicle, another protester asked the cabinet official how she and her husband could sleep at night. McConnell’s office did not comment to Fox News. The encounter comes amid a controversial “zero tolerance” immigration policy that’s led to migrant children getting split up from their parents after coming across the U.S. border. Following backlash, President Trump last week signed an executive order allowing children to remain with their families. Along with the video, Roberto tweeted “We confronted @SenateMajLdr and @SecElaineChao with @ProPublica audio of children separated from their families at the border while leaving a @Georgetown event. We must #AbolishICE & #AbolishCBP! #FreedomforImmigrants.” Describing himself as “a rising senior” at the university, he explained that he learned about the officials’ visit to campus from a friend after returning from his “internship at United We Dream.” LAWYER VISITING ‘DEVASTATED’ PARENTS SEPARATED FROM KIDS SAYS MOST DON’T KNOW WHERE THEIR CHILD IS “My parents are Mexican immigrants, and I was infuriated that a man who blocked the Dream Act and a Trump cabinet official were invited to my campus,” Roberto tweeted. “As a result, my friends quickly mobilized and went to the event that was held inside Copley Formal.” He referenced the exchange between Chao and the protesters, adding, “My question is why they won’t leave our families, friends and communities alone? As my friend said, ‘how do you sleep at night?’ #FreedomForImmigrants.” “And to be honest, I cannot fathom how these movers of racism, discrimination and hate sleep at night,” he tweeted. “Cabinet officials like Elaine Chao might not like to hear it but she and her husband bear responsibility and we won’t stop telling that truth everywhere they go. #AbolishICE.” Fox News’ Charles Creitz, Chad Pergram, John Roberts and Andrew O’Reilly contributed to this report.",
      "date": "June 26, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "McConnell condemns 'modern-day McCarthyism,' 'feckless' Obama policies, after pundits call him 'Russian asset'",
      "url": "https://www.foxnews.com/politics/mcconnell-modern-day-mccarthyisim-feckless-obama-policies-washington-post-russian-asset",
      "subtitle": "McConnell condemns 'modern-day McCarthyism,' 'feckless' Obama policies, after pundits call him 'Russian asset'",
      "author": "Gregg Re",
      "content": " In unusually forceful, angry, and personal terms, Senate Majority Leader Mitch McConnell on Monday countered what he called \"baseless smears\" from left-wing media and vowed not to be \"intimidated,\" in the wake of a Washington Post op-ed that declared McConnell a \"Russian asset.\" That op-ed was written by columnist Dana Milbank, whom McConnell bluntly suggested was one of several \"hyperventilating hacks\" who conveniently had ignored former President Obama's \"feckless\" Russia policies. Milbank had argued that McConnell's opposition to several election-security bills proposed by Democrats effectively made him an unwitting Russian agent, and other pundits quickly echoed Milbank's argument. On MSNBC's \"Morning Joe\" on Friday, host Joe Scarborough repeatedly called McConnell \"Moscow Mitch,\" saying he was \"aiding and abetting\" Russian President Vladimir Putin's efforts to \"subvert\" American elections -- and even alleging a Russia-linked investment in Kentucky could be playing a part. \"I don't normally take the time to respond to critics in the media when they have no clue what they're talking about,\" McConnell said. \"But, this modern-day McCarthyism is toxic, and damaging, because of the way it warps our entire public discourse. \"Facts matter,\" McConnell said sternly. \"Details matter. History matters, and if our nation is losing our ability to debate public policy without screaming about treason, that really matters. In the middle of the 20th century, the original McCarthyism hurt America's strength and diminished our standing in the Cold War by dividing us against ourselves.\" MSNBC PANIC: ANALYST SAYS THIS COULD BE THE LAST FREE AND FAIR ELECTION IN AMERICAN HISTORY In response, Fred Hiatt, editorial page editor at The Washington Post, told Fox News: “Dana Milbank’s column was a legitimate exercise in commentary, making the argument that Sen. McConnell’s blocking of elections-security legislation will harm the United States and work to Russia’s advantage. Of course it’s equally legitimate for Mr. McConnell to express a contrary view, but the Milbank argument has nothing to do with McCarthyism.” McConnell, however, said the \"outrage-industrial complex\" had ignored his legitimate and principled objections to Democrats' proposed election-security bills. For example, McConnell noted that the New York Times editorial board this weekend wrote that he \"has long opposed federal involvement in election management\" and as far back as 2002, \"repeatedly spoke out against a one-size-fits-all approach in favor of leaving election matters up to the states.\" One of the Democrats' proposals would have federally mandated the use of paper ballots as well as voting machines that do not directly connect to the Internet, and included funding for the federal Election Assistance Commission. The bill passed the House 225-184, with only one Republican vote, and McConnell then killed Democrats' bid to pass it in the Senate via unanimous consent. On Monday, McConnell chastised Democrats for the \"partisan\" maneuver, saying they knew the bill never had a chance of passing by unanimous consent, which can be blocked by a single senator. Republicans have also said Democrats are playing politics by seeking election-security funding that has already been allocated for that purpose. Last year, Republicans allocated $380 million to the states for election security in a funding bill, although the move attracted little attention. States still have available grant money to spend from that allocation. First Amendment concerns have also been raised about another bill proposed by Democrats, which would require campaigns to disclose all contacts with foreign individuals to the FBI. That, too, would be an unprecedented federal overreach into state-level elections, McConnell said. SCARBOROUGH CALLS MCCONNELL 'MOSCOW MITCH,' ESCALATING TREASON ACCUSATIONS Still, he made clear he didn't think Democrats actually cared about his reasoning. \"This modern-day McCarthyism was pushed by big-time outlets,\" McConnell said. \"The smear that I am 'a Russian asset' ran in the opinion pages of the Washington Post. The accusation that I am 'un-American' was broadcast on MSNBC. This is the state of left-wing politics in 2019.\" He added: \"These people have worn out the volume knobs so badly that they have nothing left but the most unhinged smears,\" McConnell said. \"Welcome to modern-day McCarthyism. McCarthy-like tactics out in the open for everyone to see.\" Speaking after McConnell, Senate Minority Leader Chuck Schumer, D-N.Y., indicated he was perplexed by Republicans' opposition to the bills. \"I still don't have a really good idea why Leader McConnell won't do something on election security,\" Schumer said. He added that it would be a \"mistake to elevate\" a \"partisan warrior\" to be the director of national intelligence (DNI), in a jab at Texas Rep. John Ratcliffe, whom Trump named to replace outgoing DNI Dan Coats. Schumer said if administration officials give the president information he doesn’t want to hear, \"you’re either fired, or you’re frozen out and you quit.\" But, McConnell, who entered the Senate in 1985, said he has distinguished himself as staunchly loyal to the United States and deeply skeptical of the Soviet Union and, later, Russia. \"I'm proud of my record, I'm proud that it's right there in black and white, and liars cannot gaslight it away,\"  McConnell said. TREY GOWDY: SECRET FBI TRANSCRIPTS FROM RUSSIA PROBE COULD BE 'GAME-CHANGER' The majority leader noted that in the 1980s he stood with then-President Ronald Reagan on missile defense and his Soviet policy. He also said he was \"honored\" to \"watch Communism crumble,\" before later \"sounding the alarm\" when then-President Bill Clinton was \"too soft on Russia.\" \"I used hearings to grill Democratic officials who were soft on President [Boris] Yeltsin and optimistic about President-elect Putin,\" McConnell said, noting that many Democrats were less skeptical about Putin. \"And, of course, I helped lead the charge against the Obama administration's completely feckless Russia policies. President Obama mocked his 2012 opponent for taking Russia too seriously. His administration sought a naive reset with the Kremlin and for eight years I helped lead the charge against that weakness. \"In 2010, I stood with [Arizona GOP Sens.] John McCain and John Kyl to oppose the new START treaty, a watered-down placeholder for the sort of tough stance we knew was necessary,\" McConnell added, after mentioning Putin's aggression in Crimea under Obama. \"As Vladimir Putin was building up his nuclear arsenal, we even had to push President Obama to commit to deploying capable missile defenses to Europe.\" TRUMP AIDE TO HEAD TO GREECE TO RETRIEVE MYSTERIOUS $10G PAYMENT HE SAYS WAS FROM FBI OR CIA \"In 2012, I firmly supported sweeping legislation to authorize heavy sanctions following the killing of Sergei Magnitsky in a Russian prison. The Obama administration flinched and tried to tiptoe around our legislation to avoid messing up their charm offensive, but we backed them into a corner and the president signed the bill into law.\" McConnell concluded: \"Let me make this crystal clear for the hyperventilating hacks who haven’t actually followed this issue. Every single member of the Senate agrees that Russia meddling was real and is real. We all agree that the federal government, state government and the private sector all have obligations to take this threat seriously and bolster our defenses. Claims to the contrary-- that anybody here denies what Russians did on President Obama’s watch -- are just lies, not partisan distortion, not clever spin, just total fabrications.\" Last week, the Senate Intelligence Committee released the first volume of its long-awaited report into Russian election interference efforts, providing new details on how Russian government hackers \"directed extensive activity against U.S. election infrastructure\" -- and potentially identified vulnerabilities that they can exploit in upcoming elections. CLICK TO GET THE FOX NEWS APP However, the committee said a major purpose of Russia's involvement may have been to cause hysteria and affect America's confidence in democracy. In fact, the panel said, Russia may have wanted their activities to be discovered. \"While the Committee does not know with confidence what Moscow's intentions were, Russia may have been probing vulnerabilities in voting systems to exploit later,\" the report stated. \"Alternatively, Moscow may have sought to undermine confidence in the 2016 U.S. elections simply through the discovery of their activity.\" Fox News' Brian Flood contributed to this report.",
      "date": "July 29",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "McConnell says he'll bring up 'freestanding' bill to address humanitarian crisis at border: 'What's the objection?'",
      "url": "https://www.foxnews.com/politics/mitch-mcconnell-border-crisis-bill-fox-friends",
      "subtitle": "McConnell says he'll bring up 'freestanding' bill to address humanitarian crisis at border: 'What's the objection?'",
      "author": "David Montanaro",
      "content": " Senate Majority Leader Mitch McConnell said on \"Fox & Friends\" Monday that Democrats have been less helpful than Mexico when it comes to addressing the border crisis. In response, he said he will bring up a \"freestanding\" bill next week to commit roughly $5 billion to address the humanitarian part of the crisis. McConnell, R-Ky., said the money was supposed to be included in a recent bill to provide emergency funds to areas hit by storms, but the Democrats insisted the funds be removed. PELOSI ACCUSES REPUBLICANS OF TOLERATING TRUMP'S UNETHICAL BEHAVIOR FOR 'MONEY' \"I'm going to bring it up freestanding next week and see if they really aren't interested in dealing with this mass of humanity that we have to take care of at the border. What's the objection? he asked. He stressed that the bill would focus on the humanitarian issues, not President Trump's border wall, which is vigorously opposed by Democrats. \"I think it's safe to say the president is getting more cooperation out of Mexico than he is out of congressional Democrats,\" said McConnell. CLICK TO GET THE FOX NEWS APP He said Democrats are \"suffering from Trump Derangement Syndrome\" and whatever he supports, they will \"reflexively\" oppose. \"We want to build a wall. We think the president has made a good case for that. That's not what this is about. This is just the humanitarian part of the problem on our side of the border,\" he said. McConnell also responded to comedian Jon Stewart, who accused him on \"Fox News Sunday\" of failing to prioritize the continued funding of the 9/11 Victims Compensation Fund. McConnell responded to the clip by stressing that the Senate has \"never failed\" to address the issue, adding \"I'm not sure why he's all bent out of shape.\"",
      "date": "June 17",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Ocasio-Cortez demands McConnell stop 'giving bogus excuses' and pass gun background check bill",
      "url": "https://www.foxnews.com/politics/ocasio-cortez-demands-mcconnell-stop-giving-bogus-excuses-and-pass-gun-background-check-bill",
      "subtitle": "Ocasio-Cortez demands McConnell stop 'giving bogus excuses' and pass gun background check bill",
      "author": "Andrew O'Reilly",
      "content": " In the wake of the mass shootings in El Paso, Texas, and Dayton, Ohio, Rep. Alexandria Ocasio-Cortez, D-N.Y., slammed Senate Majority Leader Mitch McConnell, R-Ky., for failing to call a vote on a gun reform bill that the Democratically-controlled House of Representatives passed in February. McConnell tweeted on Saturday that he and the country were \"horrified\" by the \"senseless violence\" in El Paso, where a lone gunman opened fire inside a Walmart and left at least 20 people dead and dozens more wounded. Following McConnell’s tweet, another gunman attacked a popular nightlife district in Dayton in the early hours of Sunday morning. Ocasio-Cortez called out McConnell in a tweet on Sunday for “giving bogus excuses” as to why the Senate hasn’t taken up the measure passed in the House that would tighten background checks for people seeking to purchase a firearm. POLITICIANS RESPOND TO SHOOTING AT WALMART IN EL PASO \"The House passed HR8, a Bipartisan Background Checks Act, *5 months ago* and the Senate has yet to vote on it,\" Ocasio-Cortez tweeted in response to McConnell’s own tweet. \"It was one of our 1st major priorities after ending the gov shutdown. You’ve been sitting on it since February giving bogus excuses. Care to explain the people why?\" The measure, HR 8, was passed back in February with overwhelming support from the newly elected Democratic majority and some Republican support. Ocasio-Cortez wasn’t the only lawmaker to call on McConnell to bring the resolution to a vote in the Senate. CLICK HERE TO GET THE FOX NEWS APP Sen. Bernie Sanders of Vermont, a leading candidate in the 2020 Democratic presidential primary, and Sen. Sherrod Brown, D-Ohio, also demanded that McConnell call the Senate back into session and take up a vote of the resolution. “Mitch McConnell should bring the Senate back into session immediately to pass HR 8, the gun safety bill that has already passed the House,” Sanders tweeted. “That's a first step to addressing our serious gun violence epidemic.”",
      "date": "August 4",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell says protesters who confronted him 'waited' until wife Elaine Chao was gone",
      "url": "https://www.foxnews.com/politics/mitch-mcconnell-says-protesters-who-confronted-him-waited-until-wife-elaine-chao-was-gone",
      "subtitle": "Mitch McConnell says protesters who confronted him 'waited' until wife Elaine Chao was gone",
      "author": "Paulina Dedaj",
      "content": " Senate Majority Leader Mitch McConnell took to Twitter Monday to poke fun at protesters who confronted him over the weekend, saying “they waited until” his wife -- Transportation Secretary Elaine Chao -- “wasn’t around.” McConnell’s “Team Mitch” Twitter account retweeted an article by The Hill that showed a group of protesters shouting at the Kentucky lawmaker as he left the Bristol Bar & Grille in Louisville on Saturday. Demonstrators were heard yelling “abolish ICE” and “no justice, no peace.” McConnell could be seen in the video walking to his car unfazed. “I see what they did here. They waited until Elaine wasn’t around,” the tweet that accompanied the article read. The tweet was signed “-MM.” He also included the hashtag “#dontleavehomewithouther.” McConnell seemed to be referencing an incident last month outside an event at Georgetown University where protesters confronted McConnell and Chao. “How do you sleep at night?” one protester shouted. “You leave my husband alone!,” Chao responded. McConnell has been heckled a number of times since, including Sunday night when he abruptly left an Italian restaurant in Kentucky after demonstrators played Public Enemy’s “Fight the Power” and chanted “no justice, no peace,” the Courier Journal reported.",
      "date": "July 10, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "McConnell willing to consider ‘bipartisan’ gun violence solutions, opposes 'infringing' on rights",
      "url": "https://www.foxnews.com/politics/mcconnell-willing-to-consider-bipartisan-gun-violence-solutions-opposes-infringing-on-constitutional-rights",
      "subtitle": "McConnell willing to consider ‘bipartisan’ gun violence solutions, opposes 'infringing' on rights",
      "author": "Alex Pappas",
      "content": " Senate Majority Leader Mitch McConnell – a Republican who has been lambasted by Democrats for refusing to allow votes on gun control legislation – said Monday he is willing to consider “bipartisan” solutions in the wake of the mass shootings in El Paso, Texas, and Dayton, Ohio, but made clear his opposition to gun control policies that infringe “on Americans’ constitutional rights.” “Today, the president called on Congress to work in a bipartisan, bicameral way to address the recent mass murders which have shaken our nation,” McConnell said in a statement. “Senate Republicans are prepared to do our part.” 2020 DEMS UNLEASH PROFANE ATTACKS ON TRUMP, REPUBLICANS OVER MASS SHOOTINGS He did not specifically detail the type of legislation he would support. But McConnell’s comments come amid a bipartisan effort from GOP Sen. Lindsey Graham of South Carolina and Democratic Sen. Richard Blumenthal of Connecticut for a bill that would create a federal grant program to assist states in adopting so-called “Red Flag” laws. In his statement, McConnell said he has spoken with Senate committee leaders and “asked them to reflect on the subjects the president raised within their jurisdictions and encouraged them to engage in bipartisan discussions of potential solutions to help protect our communities without infringing on Americans’ constitutional rights.” “Only serious, bipartisan, bicameral efforts will enable us to continue this important work and produce further legislation that can pass the Senate, pass the House, and earn the president’s signature,\" McConnell said. \"Partisan theatrics and campaign-trail rhetoric will only take us farther away from the progress all Americans deserve.” The back-to-back mass shootings this weekend have left at least 31 dead and more injured. The Graham-Blumenthal bill would “assist and encourage” states to adopt Red Flag laws to “timely intervene in situations where there is an imminent threat of violence.” “These grants will be given to law enforcement so they can hire and consult with mental health professionals to better determine which cases need to be acted upon,” Graham said Monday. “This grant program also requires robust due process and judicial review. It does allow for quick action.” Blumenthal in a statement Monday said that he and Graham have been working on developing an “Emergency Risk Protection Order” statute since the last Congress. “We will be finalizing details for this bill and reaching out to colleagues on both sides of the aisle in the coming days and weeks,” Blumenthal said. “I look forward to introducing final legislation with Senator Graham in the very near future.” GRAHAM, BLUMENTHAL ANNOUNCE BIPARTISAN BILL ON 'RED FLAG' LAWS IN WAKE OF EL PASO, DAYTON SHOOTINGS Graham said that he spoke with President Trump about the legislation on Monday morning and said “he seems very supportive.” Graham and Blumenthal’s announcement came after Trump called for reforms Monday from the White House on mental health and gun laws. Some Democrats have directed their ire at McConnell – who has refused votes on Democrat-supported gun control language that has passed in the House. \"Mitch McConnell needs to get off his a-- and do something,” Democratic Rep. Tim Ryan of Ohio, a longshot candidate for president, said in an interview on CNN. CLICK HERE TO GET THE FOX NEWS APP Democratic leaders in Congress on Monday called on McConnell to allow a vote in the GOP-controlled Senate on Democratic legislation, and some have additionally called for cutting the summer recess short to address gun violence. “In February, the new Democratic House majority promptly did its duty and passed the Bipartisan Background Checks Act of 2019, which is supported by more than 90 percent of the American people and proven to save lives,” House Speaker Nancy Pelosi, D-Calif., and Senate Democratic Leader Chuck Schumer, D-N.Y., said in a joint statement after Trump’s speech. “However, Senate Republican Leader Mitch McConnell has called himself the ‘grim reaper’ and refuses to act on this bipartisan legislation.” They added: “It is incumbent upon the Senate to come back into session to pass this legislation immediately.” Brooke Singman contributed to this report.",
      "date": "August 5",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "McConnell campaign accuses AOC of ‘trying to dox some underage kids’ after cardboard cutout photo",
      "url": "https://www.foxnews.com/politics/mcconnell-campaign-alerts-law-enforcement-after-aoc-calls-out-underage-supporters-on-twitter",
      "subtitle": "McConnell campaign accuses AOC of ‘trying to dox some underage kids’ after cardboard cutout photo",
      "author": "Sam Dorman",
      "content": " Senate Majority Leader Mitch McConnell's campaign on Tuesday accused New York Democratic Rep. Alexandria Ocasio-Cortez of encouraging threats against the senator and \"trying to dox some underage kids\" after she blasted a group of McConnell-supporting boys who took a controversial photo with a cardboard cutout of her during a recent Kentucky political event. \"Rep. Alexandria Ocasio-Cortez and liberal Twitter personalities are trying to dox some underage kids for taking a photo with a cutout at the Fancy Farm political picnic and are cheering on thousands of accounts calling for Senator McConnell to 'break his neck,’\" Team Mitch, the Kentucky Republican's campaign account, tweeted on Tuesday. AOC SLAMS MCCONNELL AFTER PHOTO OF YOUNG MEN IN 'TEAM MITCH' T-SHIRTS 'GROPING' CUTOUT SURFACES Doxxing is a term used to describe the practice of revealing personal information, like addresses or phone numbers, about a private individual online. McConnell's campaign did not elaborate when Fox News requested details about the allegation against Ocasio-Cortez. In a tweet Monday, Ocasio-Cortez did not explicitly call for harassment or threats but she prompted a wave of negative reactions to the boys when she suggested that their gestures -- \"groping\" and \"choking\" the cut-out, as she alleged -- represented the \"culture\" of McConnell's campaign. \"Hey @senatemajldr - these young men look like they work for you,\" Ocasio-Cortez tweeted at McConnell on Monday. \"Just wanted to clarify: are you paying for young men to practice groping & choking members of Congress w/ your payroll, or is this just the standard culture of #TeamMitch?\" The photo was reportedly posted on Facebook alongside the caption \"break me off a piece of that.\" After Ocasio-Cortez's tweet, McConnell's campaign responded by distancing itself from the photo, clarifying that the boys weren't employees of the campaign. “Team Mitch in no way condones any aggressive, suggestive, or demeaning act toward life-sized cardboard cutouts of any gender,” campaign spokesman Kevin Golden said, according to the New York Post. OCASIO-CORTEZ DEMANDS MCCONNELL STOP 'GIVING BOGUS EXCUSES' AND PASS GUN BACKGROUND CHECK BILL Golden added: “These young men are not campaign staff, they’re high schoolers and it’s incredible that the national media has sought to once again paint a target on their backs rather than report real, and significant news in our country.\" McConnell's campaign appeared to downplay the photo by comparing it to one that a former aide to President Obama took after his election in 2008. The photo, posted at the end of 2008, showed Obama speechwriter Jon Favreau appearing to grope a cardboard cut-out of Hillary Clinton, then Obama's choice for secretary of state. \"Team Mitch in no way condones any aggressive, suggestive, or demeaning act toward life-sized cardboard cut outs of any gender in a manner similar to what we saw from President Obama’s speechwriting staff several years ago,” Golden told The Washington Post. Also Tuesday, McConnell's campaign appeared to tie Ocasio-Cortez's tweet to another incident in which supporters of McConnell's opponent, Amy McGrath, allegedly \"stormed\" McConnell's home in Louisville. \"Last night, an angry left-wing mob of Amy McGrath supporters stormed Senator McConnell’s Louisville home screaming obscenities and hoping someone would ‘just stab the motherf---r in the heart,'\" the campaign tweeted. McConnell's campaign also said they have been in touch with law enforcement in response to recent threats made against the senator. The campaign accused Ocasio-Cortez and other liberals on Twitter of “cheering on” these threats. “These threats go far beyond a political cartoon or a broken shoulder,” McConnell’s campaign said, referencing the Kentucky senator’s recent injury, “they are serious calls to physical violence and we’ve alerted law enforcement.” CLICK HERE TO GET THE FOX NEWS APP Fox News has reached out to Ocasio-Cortez's office for comment. The Twitter exchange is the latest example of the tension between Ocasio-Cortez and McConnell. The freshman congresswoman has repeatedly criticized McConnell over his refusal to allow votes on Democratic-supported bills on gun control and elections security.",
      "date": "August 6",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "GOP goes to war with Twitter over McConnell campaign account freeze",
      "url": "https://www.foxnews.com/politics/white-house-mulls-action-on-anti-conservative-bias-as-twitter-locks-out-mcconnell-campaign",
      "subtitle": "GOP goes to war with Twitter over McConnell campaign account freeze",
      "author": "Ronn Blitzer",
      "content": " Republicans are going to war with Twitter after the platform froze the Mitch McConnell re-election account this week because the campaign posted a video of threats directed at the Senate majority leader, just as President Trump is planning a separate crackdown on left-wing social media bias. The National Republican Senatorial Committee on Thursday said it won't spend money on Twitter until the situation is \"adequately addressed.\" A top official with the Republican National Committee also said the RNC and the Trump campaign would not spend money with Twitter \"until they address this disgusting bias.\" Meanwhile, the White House for weeks has been hinting at possible action in relation to how social media outlets treat conservatives. A White House official told Fox News the administration is \"exploring all policy solutions.\" The administration has circulated drafts of a possible executive order from Trump, following a summit last month where he met with conservative social media influencers, according to Politico. TWITTER LOCKS OUT MCCONNELL'S CAMPAIGN FOR POSTING VIDEO OF CALLS FOR VIOLENCE AT HIS HOME “If the internet is going to be presented as this egalitarian platform and most of Twitter is liberal cesspools of venom, then at least the president wants some fairness in the system,” a White House official told the outlet. It is unclear what the order will entail or how it would aim to curb social media bias but it reportedly deals with other issues as well. The latest example of conservative outrage at social media: Twitter froze the McConnell campaign’s \"Team Mitch\" account this week after the campaign posted videos of protesters outside McConnell’s home, which included violent threats against the Kentucky senator. The episode prompted the McConnell campaign to slam Twitter for political bias, saying the social media platform had effectively blamed the victim. Meanwhile, Republicans noted, Democratic Rep. Joaquin Castro remains active on Twitter, even after he posted the names of San Antonio residents who donated to Trump. MORE TRUMP DONORS WHO ALSO GAVE TO CASTRO BROTHERS SAY THEY'RE IRKED BY DEM'S TWEET “Twitter locked our account for posting the video of real-world, violent threats made against Mitch McConnell,\" McConnell campaign manager Kevin Golden said in a statement on Wednesday. \"This is the problem with the speech police in America today.\" Golden said that the campaign appealed the suspension and Twitter upheld it, saying Team Mitch will remain suspended until the take down the video. CLICK HERE TO GET THE FOX NEWS APP \"The users were temporarily locked out of their accounts for a Tweet that violated our violent threats policy, specifically threats involving physical safety,\" a Twitter spokesperson told Fox News. The website's policy states that users cannot share content that includes threats against an individual or group of people, regardless of context. In addition to a potential executive order, the White House is planning a summit with technology companies on Friday aimed at combatting extremism online. This comes after President Trump discussed the dangers on the internet during an address following last weekend’s shootings in El Paso and Dayton. The El Paso suspect had been linked to an online manifesto that expressed hatred toward Hispanic immigrants. Fox News' Alex Pappas, Blake Burman, Mark Meredith and Gregg Re contributed to this report.",
      "date": "August 8",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "McConnell blasts 'Medicare for All' as 'far-left social experiment'",
      "url": "https://www.foxnews.com/politics/mcconnell-blasts-medicare-for-all-as-far-left-social-experiment",
      "subtitle": "McConnell blasts 'Medicare for All' as 'far-left social experiment'",
      "author": "",
      "content": "WASHINGTON – McConnell called the proposal, backed by the Democrats' progressive wing, a “radical, one-size-fits-all attempt to remake the health sector.” He described it as a scheme and told hospital industry leaders that it would be serious bad news for them. “You should not be the guinea pigs in some far-left social experiment,” he said. One of the most outspoken lawmakers in support of the policy, Sen. Bernie Sanders, I-Vt., used Medicare for All as part of his platform in his 2016 presidential campaign, and is expected to use an updated version of the proposal for his 2020 run. According to a 2018 poll conducted by Reuters, 70 percent of Americans, in additional to 52 percent of Republican voters, supported the proposal. WHAT IS 'DEMOCRATIC SOCIALISM'? BERNIE SANDERS' POLITICAL IDEOLOGY EXPLAINED Since then, however, the numbers have declined. According to polling by the Kaiser Family Foundation, support for the policy has dropped as concerns arise that it could lead to higher taxes and longer waits for health care. McConnell reiterated sentiments from his AHA conference speech in a tweet, referring to the policy as “Medicare for None” and claiming that it would “slap a $32 trillion tab on Americans.” CLICK HERE TO GET THE FOX NEWS APP “Democrats’ 'Medicare for None' would slap a $32 trillion tab on Americans, and that’s just a rough estimate for the first decade. And competing private insurance policies -- like the ones that 180 million Americans currently use -- would be banned outright,” the tweet read. At the close of McConnell’s remarks, he encouraged hospital and health care system leaders in the room to rally together and make their way to Capitol Hill to speak out against this proposal to Democrats in Congress.",
      "date": "April 9",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "McConnell vows to be 'grim reaper' of socialist Dem proposals",
      "url": "https://www.foxnews.com/politics/mcconnell-vows-to-be-grim-reaper-of-socialist-dem-proposals",
      "subtitle": "McConnell vows to be 'grim reaper' of socialist Dem proposals",
      "author": "Gregg Re",
      "content": " Senate Majority Leader Mitch McConnell, known for years by the hardboiled moniker \"Cocaine Mitch,\" told community leaders in his hometown Kentucky on Monday that he wants a new nickname to reflect what he plans to do to a slew of far-left progressive policy proposals: \"grim reaper.\" McConnell has long framed the upcoming 2020 elections as a referendum on what he has called the \"full socialism on display\" from prominent Democrat Party members, including New York Rep. Alexandria Ocasio-Cortez and presidential contenders Bernie Sanders, Elizabeth Warren, Cory Booker, Kirsten Gillibrand, and Kamala Harris. On Monday, the longtime incumbent was positioning the Senate as a bulwark to defend capitalism, even in the event President Trump doesn't win re-election in 2020. \"You pass the Green New Deal and Medicare for All, you have fundamentally changed this country, fundamentally changed it into an unproductive place with significant unemployment and huge problems,\" McConnell told supporters in Owensboro, Kentucky. \"I don't want you to think this is just a couple of nutcases running around on the fringe. This is pervasive policy view on the other side.\" NYC MAYOR SAYS GREEN NEW DEAL WILL GET RID OF PESKY GLASS SKYSCRAPERS McConnell added, according to multiple reports: \"If I'm still the majority leader of the Senate after next year, none of those things are going to pass the Senate. They won't even be voted on. So think of me as the grim reaper. None of that stuff is going to pass. None of it.\" McConnell brought Ocasio-Cortez's Green New Deal resolution to a vote in the Senate in March, and it did not secure a single affirmative vote from Democrats, who charged that the the move was a stunt. McConnell later admitted in an interview with Fox News' \"Special Report with Bret Baier\" that the vote was indeed \"for show.\" But it would be a grave mistake, McConnell warned Monday, to underestimate the threat posted by the \"pervasive\" rise of socialism. \"We are having a legitimate debate about the virtues of socialism, and I don't want you to think it's just a 28-year-old congresswoman from New York,\" McConnell said. \"This is much broader than that. I've got five colleagues in the Senate, five colleagues running for president, who have signed on to the Green New Deal and Medicare For All.\" McConnell has also cautioned that Amy Klobuchar, a relative moderate 2020 Democratic contender who has called for a public option instead of universal Medicare, would similarly destroy the private insurance industry and cause major problems for the health care system. McConnell, who first became a senator in 1985, is up for reelection in 2020, and he formally launched his campaign last week by emphasizing his work on tax cuts and federal judicial confirmations. CLICK TO GET THE FOX NEWS APP But Democrats, including Senate Minority Leader Chuck Schumer, D-N.Y., have reportedly sought to recruit a challenger, despite apparent long odds. Earlier this year, Matt Jones, a Kentucky sports radio personality who has weighed a bid against McConnell, told reporters that he wanted to see a new face in office. “Somebody in Kentucky has got to step up and do this,\" Jones said. \"And it will be a huge challenge, this guy is almost impossible to beat, but it’s possible.\" Last month, a campaign to enlist former figher pilot Amy McGrath to run against McConnell began fundraising. “There is incredible grassroots energy for Amy McGrath to run against Mitch McConnell,” Ryan Aquilina, who runs the Ditch Mitch project, said at the time. “We had one of our best days ever in terms of fundraising, and that proves in no uncertain terms just how much appetite there is for Amy to run and to defeat Mitch McConnell.\"",
      "date": "April 22",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Sen. McConnell’s reelection campaign is selling ‘Cocaine Mitch’ t-shirts",
      "url": "https://www.foxnews.com/politics/mitch-mcconnells-campaign-selling-cocaine-mitch-t-shirts",
      "subtitle": "Sen. McConnell’s reelection campaign is selling ‘Cocaine Mitch’ t-shirts",
      "author": "Kathleen Joyce",
      "content": " Senate Majority Leader Mitch McConnell’s reelection campaign team decided to market on the senator’s nickname and make it into a t-shirt. Last year, Don Blankenship gave McConnell the nickname “Cocaine Mitch” during his ill-fated bid for a West Virginia Senate seat. Blankenship gave him the nickname in relation to a reported drug bust tied to his father-in-law’s company. SCHUMER BRANDS MCCONNELL'S FIERY SPEECH TO MOVE ON FROM RUSSIA INVESTIGATION AS 'DESPICABLE' McConnell’s team then photoshopped an image of the Kentucky senator on a poster for the Netflix series “Narcos” after Blankenship lost the race to incumbent Sen. Joe Manchin, D-W.Va. A year on, McConnell seems to have embraced the nickname. On Wednesday, the Team Mitch Twitter account announced voters can buy their own “Cocaine Mitch” t-shirt. The red shirt, that says “MITCH” in white lettering, also contains the image of man's silhouette. The back of the shirt reads: “TEAM MITCH CARTEL MEMBER.” The official “Cocaine Mitch” t-shirt is available for $35. CLICK HERE TO GET THE FOX NEWS APP McConnell is up for re-election in 2020. He launched his re-election campaign in April. Fox News’ Joseph A. Wulfsohn contributed to this report.",
      "date": "May 8",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "GOP leaders decry Kavanaugh attacks as McConnell says 'this is not normal political behavior'",
      "url": "https://www.foxnews.com/politics/brett-kavanaugh-mitch-mcconnell-lindsey-graham-impeachment-calls",
      "subtitle": "GOP leaders decry Kavanaugh attacks as McConnell says 'this is not normal political behavior'",
      "author": "Alex Pappas",
      "content": " Senate Republican leaders on Monday unloaded on Democrats over their revived efforts to push college-era allegations of sexual misconduct against Supreme Court Associate Justice Brett Kavanaugh, with Senate Majority Leader Mitch McConnell accusing them of engaging in “not normal political behavior.” McConnell, R-Ky., took to the Senate floor Monday afternoon to decry what he described as a familiar “pattern” involving Kavanaugh allegations: “Shoot first, correct the facts later.” He accused Democrats of “rushing to exploit” the new accusations and “hysterically” demanding his impeachment, but maintained that a majority of senators were right to confirm him last year. He also accused Democrats of deploying the “politics of personal destruction” in their handling of both sets of allegations. 2020 DEMOCRATS IGNORE KAVANAUGH STORY CORRECTION AFTER DEMANDING IMPEACHMENT “It’s just as transparent and self-serving today,” McConnell said. In his blistering floor speech, he went on to rebuke several Senate Democrats for a recent brief that urged the Supreme Court to “heal itself” or face restructuring – which was widely seen as a threat of court-packing.\n\n\n“This is not normal political behavior,” McConnell said. South Carolina Republican Sen. Lindsey Graham, the Judiciary Committee chairman who mounted one of the most passionate defenses of Kavanaugh during his confirmation hearing, called the attacks “beyond the pale.” “My heart goes out to Justice Kavanaugh’s family for being forced to endure this ridiculous treatment once again,” he tweeted. Many of the Democrats seeking to unseat President Trump in 2020 over the weekend released statements calling for Congress to impeach Kavanaugh, citing The New York Times' reporting of a disputed allegation of sexual misconduct. But Graham insisted that wouldn't happen. “As chairman of the Senate Judiciary Committee, I promise you Justice Kavanaugh will not be impeached over these scurrilous accusations,” Graham tweeted. Iowa GOP Sen. Chuck Grassley, who led the Judiciary Committee during the Kavanaugh hearings, said his office never \"received an allegation against Kavanaugh like the one referenced in the report over the weekend.\" \"We now have an uncorroborated accusation, rooted only in unnamed sources, with no direct knowledge of the event, and that the alleged victim doesn’t even remember,\" Grassley said. \"Since when did that become something 'fit to print' by the supposed American paper of record?\" By late Sunday, the paper had revised its portrayed blockbuster story to include the fact that several friends of the alleged victim said she told them she did not recall the reported sexual assault in question. President Trump repeatedly ripped the paper on Monday. \"The New York Times should close its doors and throw away the keys,\" he tweeted Monday afternoon, reacting to quotes from Fox News' Greg Gutfeld. \"The women mentioned in the Kavanaugh story said she didn’t even remember the event.\" As for Democrats, California Sen. Kamala Harris, who said over the weekend that Kavanaugh “must be impeached,” did not back down in a new tweet Monday, writing: “The reality of Kavanaugh's confirmation process is that it lacked any integrity — there has never been a meaningful investigation into these allegations. We need the truth.” The Times piece by Robin Pogrebin and Kate Kelly, adapted from their forthcoming book, asserted that a Kavanaugh classmate, Clinton-connected nonprofit CEO Max Stier, “saw Mr. Kavanaugh with his pants down at a different drunken dorm party, where friends pushed his penis into the hand of a female student.” Former Housing and Urban Development Secretary Julian Castro tweeted in response: “It’s more clear than ever that Brett Kavanaugh lied under oath. He should be impeached. And Congress should review the failure of the Department of Justice to properly investigate the matter.” Massachusetts Sen. Elizabeth Warren wrote: “Last year the Kavanaugh nomination was rammed through the Senate without a thorough examination of the allegations against him. Confirmation is not exoneration, and these newest revelations are disturbing. Like the man who appointed him, Kavanaugh should be impeached.” NYT UPDATES KAVANAUGH 'BOMBSHELL' TO NOTE ACCUSER DOESN'T RECALL ALLEGED ASSAULT While 2020 Democrats did not back down from their impeachment calls, despite the Times revision, top Democrats in Congress appeared less eager. House Judiciary Committee Chairman Jerry Nadler, D-N.Y., seemed to brush off his party's calls to launch impeachment proceedings against Kavanaugh, saying on a radio show Monday: “We have our hands full with impeaching the president right now.” Meanwhile, Senate Minority Leader Chuck Schumer, D-N.Y., told reporters: “I am saying nothing on Kavanaugh right now.” Fox News’ Judson Berger, Chad Pergram and Gregory Re contributed to this report.",
      "date": "September 16",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "McConnell trolls Dem rep who challenged him to five debates -- by accepting",
      "url": "https://www.foxnews.com/politics/mcconnell-trolls-dem-rep-who-challenged-him-to-five-debates-by-accepting",
      "subtitle": "McConnell trolls Dem rep who challenged him to five debates -- by accepting",
      "author": "Ronn Blitzer",
      "content": " A Democratic congressman from Kentucky backed down Tuesday from his threat to run against Mitch McConnell – and admitted he was just joking -- after the Senate majority leader called his bluff and agreed to his demand for five debates. On Monday, Rep. John Yarmuth, D-Ky., was asked by a local news reporter from WHAS-TV if he planned on running against the Republican leader in 2020. Yarmuth initially said he had “no desire” to do so, but then smiled and said: “I will say this: If Mitch McConnell would agree to debate me five times in public, I’d do it.” Yarmuth may not have expected the response. MITCH MCCONNELL RECOVERING FROM SHOULDER SURGERY IN LOUISVILLE “Accepted. When is the announcement? - MM,” McConnell said Tuesday morning through his campaign’s Team Mitch Twitter account. The post retweeted a local news article that included Yarmuth’s suggestion. Yarmuth’s office, though, responded by making it clear that the congressman has no intention of running against McConnell. “Obviously the congressman was making a joke about Senator McConnell’s long record of refusing to meet with anyone except donors and special interests writing him checks,” Yarmuth’s communications director Christopher Schuler told Fox News. Schuler added: “He does hope that the senator is serious about debating his opponent next year though. Kentuckians deserve to hear him defend his actions, and lack thereof, that have been so destructive to our commonwealth and country.” CLICK HERE TO GET THE FOX NEWS APP There are already multiple Democrats vying for the opportunity to challenge McConnell. Retired Marine combat aviator Amy McGrath announced her candidacy in July, claiming, “Everything that’s wrong with Washington” started with McConnell. Kentucky sports talk radio host Matt Jones has also reportedly formed an exploratory committee for a possible campaign. Meanwhile, McConnell is also facing a Republican primary challenge from former state representative Wesley Morgan.",
      "date": "September 3",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Diners confront Mitch McConnell at restaurant, get told to ‘leave him alone’ by others",
      "url": "https://www.foxnews.com/politics/diners-confront-mitch-mcconnell-at-restaurant-get-told-to-leave-him-alone-by-others",
      "subtitle": "Diners confront Mitch McConnell at restaurant, get told to ‘leave him alone’ by others",
      "author": "Adam Shaw",
      "content": " A small group of angry diners confronted Senate Majority Leader Mitch McConnell at a restaurant Friday night, but were met with calls from other customers to leave the Kentucky Republican alone. Video obtained by TMZ shows at least one diner berating McConnell on issues such as Social Security at a restaurant in Louisville. The video starts with him yelling at McConnell and arguing with Transportation Secretary Elaine Chao -- to whom McConnell is married. The outlet reported that four men first confronted McConnell. “Oh yeh, why don’t you get out of here? Why don’t you leave our entire country,” the protester tells the couple. As Chao argues with the protester, McConnell appears unperturbed and sips on a drink. But other diners begin yelling at the protester, telling him to “leave him alone” and making shoo-ing gestures. “They’re going to come for Social Security,” he told the other diners, before appearing to be approached by staff. CRUZ CONFRONTED BY 2 PROTESTERS OVER HIS VOTE TO CONFIRM KAVANAUGH: REPORT According to TMZ, the woman who recorded the incident said the protester slammed his fists on McConnell’s table and threw food out of the restaurant after accusing McConnell of killing people with his views. McConnell reportedly later thanked some of the supporters and shook their hands. \"The Leader and Sec. Chao enjoyed their meal in Louisville last night and they appreciate those who spoke up against incivility,\" McConnell spokesman David Popp said in a statement. \"They hope other patrons weren't too inconvenienced by left-wing tantrums. As the Leader often says, the Senate will not be intimidated by the antics of far-left protestors.\" The incident marks the latest hounding of a Republican or Trump administration official from a restaurant. Last month Sen. Ted Cruz, R-Texas, was forced out of a restaurant by protesters angry at his support of the confirmation of now-Justice Brett Kavanaugh. McConnell and Chao were confronted by protesters earlier in the year as they left an event at Georgetown University. Chao stood up to the protesters and told them to “leave my husband alone.” MCCONNELL SAYS PROTESTERS WHO CONFRONTED HIM 'WAITED' UNTIL WIFE ELAINE CHAO WAS GONE In July, McConnell was confronted by more protesters as he left a restaurant in Louisville, Kentucky. Protesters reportedly yelled “abolish ICE” and “no justice, no peace.” “I see what they did here. They waited until Elaine wasn’t around,” McConnell subsequently tweeted. Fox News’ Paulina Dedaj contributed to this report.",
      "date": "October 20, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "McConnell challenger Amy McGrath mocked for interview flub",
      "url": "https://www.foxnews.com/politics/mcconnell-challenger-mocked-for-interview-flub",
      "subtitle": "McConnell challenger Amy McGrath mocked for interview flub",
      "author": "Ronn Blitzer",
      "content": " Amy McGrath, the Marine aviator who just announced her campaign against Sen. Mitch McConnell, R-Ky., is getting razzed for an awkward moment at the end of a TV interview Tuesday where she sought to explain a controversial statement comparing President Trump's 2016 victory to the 9/11 attacks. In the CNN interview, the Democratic candidate was asked to explain her statement that, “The only feeling I can describe that’s any close to it was the feeling I had after 9/11.” TLAIB TO PELOSI: 'FOCUS' ON MCCONNELL INSTEAD OF BASHING PROGRESSIVES McGrath told host Jake Tapper that she was comparing how she “took stock” of the state of the country after the 2016 election with how she reacted to the Sept. 11 attacks. “You know many of us were spurred into action by what happened in 2016, the labeling of each other as they’re all communists, or they’re all this, or they’re all that, and the fake news. The divisiveness of our country was something I had never seen before,” McGrath said. Looking back, McGrath admitted she “can see why, you know, folks might be upset about that.” But then just as the interview was wrapping up, McGrath awkwardly signed off by telling Tapper, “Great to have you” -- a line typically used by news anchors, not their guests. McConnell's campaign eagerly circulated the clip on Twitter, simply saying, “This is embarrassing.” Trump campaign spokesman Matt Wolking drew attention to the ending, saying: \"Stick around for the very end.\" MITCH MCCONNELL TELLS NIKE HE'LL BUY FIRST ORDER OF 'BETSY ROSS' SNEAKERS IF THEY RELEASE AFTER KAEPERNICK CONTROVERSY President Trump has already commented on McGrath's push to unseat the Senate majority leader, noting her 9/11 comparison. Trump questioned why voters in Kentucky would want their state to give up the majority leader position by electing \"a freshman Senator with little power in what will hopefully be the minority party.\"",
      "date": "July 10",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "McConnell ad telegraphs plan to protect Trump against Pelosi in impeachment fight",
      "url": "https://www.foxnews.com/politics/mcconnell-ad-telegraphs-plan-to-protect-trump-against-pelosi-in-impeachment-fight",
      "subtitle": "McConnell ad telegraphs plan to protect Trump against Pelosi in impeachment fight",
      "author": "Ronn Blitzer",
      "content": " While Senate Majority Leader Mitch McConnell has pledged to take up the impeachment fight in the Senate should the House move against President Trump, a new campaign ad from the Kentucky Republican makes clear he's not wavering on his support for the president. In the brief video, McConnell accuses House Speaker Nancy Pelosi of being “in the clutches of a left-wing mob” pushing her toward impeaching the president, while promising to stand in her way. NANCY PELOSI LEADS CHARGE ON IMPEACHMENT “All of you know your Constitution. The way that impeachment stops is with a Senate majority with me as Majority Leader,” he declares. He closes by saying, “But I need your help,” as he requests campaign donations. Marine veterans Amy McGrath and Mike Broihier are among the Democrats currently vying for the chance to face McConnell in 2020. While the primary is far from settled, McConnell’s ad indicates that in the current fight over impeachment, he intends to protect Trump from Democrats’ efforts to remove him, even before articles of impeachment have been drafted. McConnell's support was not necessarily in question, but a few GOP senators in recent days have spoken out against the president, over his now-public request for Ukraine to \"look into\" Democratic presidential primary candidate Joe Biden and his son Hunter's dealings in the country. The criticism escalated after Trump made a similar request, during a session with reporters, to China. Sen. Mitt Romney, R-Utah, said Trump displayed \"appalling\" behavior by asking a foreign government to investigate a political rival. Sen. Susan Collins, R-Maine, said it was \"completely inappropriate\" for Trump to ask China to investigate the Bidens. Should the House vote to impeach Trump, the matter would go to trial before the Senate — where Republicans could easily brush back the impeachment effort if they largely hold together. In a CNBC interview last week, McConnell acknowledged that he “would have no choice but to take it up” if the House approves impeachment articles. But he added the caveat, “How long you’re on it is a whole different matter.” The odds of McConnell being put in that position seemingly increased over the weekend, as a senior member of the House Democratic Caucus told Fox News they believe there are enough Democrats currently supporting impeachment to get the required House majority to pass articles of impeachment. The senior member based this belief on the 227 Democrats in the House who have expressed support for an impeachment inquiry. Democrats investigating Trump had earlier been focusing their efforts on suspicion that he obstructed justice by trying to impede the investigation of Russian election interference. Pelosi had been holding off impeachment efforts for months — but was eventually swayed after a whistleblower complaint accused Trump of pressuring Ukrainian President Volodymyr Zelensky over a potential Biden probe. On Sunday, attorneys for the whistleblower confirmed they also are representing a second whistleblower with information backing up the initial complaint. CLICK HERE TO GET THE FOX NEWS APP Trump has denied wrongdoing, while turning up criticism of the Bidens. \"The Biden family was PAID OFF, pure and simple! The fake news must stop making excuses for something that is totally inexcusable,\" he tweeted over the weekend. Fox News'  Leland Vittert and Melissa Leon contributed to this report.",
      "date": "October 7",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "McConnell throws shade at Nike with 'Betsy Ross' flag tweet",
      "url": "https://www.foxnews.com/politics/mcconnell-throws-shade-at-nike-with-betsy-ross-flag-tweet",
      "subtitle": "McConnell throws shade at Nike with 'Betsy Ross' flag tweet",
      "author": "Andrew O'Reilly",
      "content": " Senate Majority Leader Mitch McConnell, R-Ky., took to social media on Thursday to wish Americans a happy Independence Day – and to take a thinly veiled shot at Nike and former NFL quarterback Colin Kaepernick. \"Happy Fourth of July!,\" McConnell tweeted alongside an image of the Betsy Ross flag. Nike pulled the Air Max 1 USA shoe, which included a Revolutionary-era U.S. flag with 13 white stars in a circle on the heel. Kaepernick reached out to Nike after learning they planned to release the sneaker to explain that the flag recalls an era when black people were enslaved and that it has been appropriated by white nationalist groups, a person familiar with the conversation told The Associated Press. Nike decided to recall the shoe after it had been already sent to retailers to go on sale this week for the July Fourth holiday, according to the Wall Street Journal. COLIN KAEPERNICK MAY NOT TOTALLY UNDERSTAND WHO BETSY ROSS IS, DR. ALVEDA KING SAYS The decision caused an instant backlash among conservatives who accused Nike of denigrating U.S. history. \"If we’re in a political environment where the American flag has become controversial to Americans, I think we've got a problem,\" McConnell said on Tuesday, according to the Lexington Herald-Leader. \"I hope Nike either releases these shoes or some other shoe maker picks up the flag, puts it on a pair of shoes and starts selling it. I’ll make the first order,\" he added. COLIN KAEPERNICK AND NIKE: A TIMELINE OF EX-NFL QB'S RELATIONSHIP WITH BRAND Others expressed surprise that the symbol known as the \"Betsy Ross\" flag, so named after the beloved Philadelphia woman credited with designing it, could be considered offensive. Although some extremist groups appear to have appropriated the flag, it is not widely viewed as a symbol of hate, and is used in museums that focus on 18th century U.S. history. The Anti-Defamation League does not include it in its database of hate symbols. Mark Pitcavage, a senior research fellow for the ADL's Center on Extremism, said extremist groups have occasionally used it, but the flag is most commonly used by people for patriotic purposes. \"We view it as essentially an innocuous historical flag,\" Pitcavage said. \"It's not a thing in the white supremacist movement.\" CLICK HERE TO GET THE FOX NEWS APP Nike said in statement that \"it pulled the shoe based on concerns that it could unintentionally offend and detract from the nation's patriotic holiday.\" The company pushed back against criticism that the decision was being \"anti-American.\" \"Nike is a company proud of its American heritage and our continuing engagement supporting thousands of American athletes including the U.S. Olympic team and U.S. Soccer teams,\" Nike said. The Associated Press contributed to this report.",
      "date": "July 4",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Tlaib to Pelosi: 'Focus' on McConnell instead of bashing progressives",
      "url": "https://www.foxnews.com/politics/tlaib-to-pelosi-focus-on-mcconnell-instead-of-bashing-progressives",
      "subtitle": "Tlaib to Pelosi: 'Focus' on McConnell instead of bashing progressives",
      "author": "Ronn Blitzer",
      "content": " Rep. Rashida Tlaib, D-Mich., had a message for Nancy Pelosi, after the House speaker dismissed her and other progressives in a recent New York Times interview: Go after Mitch McConnell instead. Pelosi had snide remarks for Tlaib, Rep. Ilhan Omar, D-Minn., Alexandria Ocasio-Cortez, D-N.Y., and Ayanna Pressley, D-Mass., after the four progressives were the only Democrats to vote against a bill to deliver billions of dollars to help the ongoing border crisis. Tlaib said her attention should be directed across the aisle at the Senate majority leader. AOC FIRES BACK AFTER PELOSI BLASTS FAR-LEFT DEMS' 'TWITTER WORLD' \"Focus on him, uplift the women, especially the women of color within your caucus that are out there,\" Tlaib said Sunday on ABC News' \"This Week,\" adding, \"It is very disappointing that the speaker would ever try to diminish our voices in so many ways.\" In an interview with the New York Times, Pelosi called out Tlaib, Omar, Pressley and Ocasio-Cortez, claiming that they are more influential on social media than they are in Congress. \"All these people have their public whatever and their Twitter world,\" Pelosi said. \"But they didn't have any following. They're four people and that's how many votes they got.\" Tlaib defended her position, saying that she will not support \"something that is broken,\" and that the bill McConnell's Senate came up with was \"even worse\" than the House bill that Tlaib, Omar, Pressley and Ocasio-Cortez had opposed. Pelosi had agreed to support McConnell's bill, so that something could be done to help the situation at the border. PELOSI WON'T SAY IF SHE AGREES WITH AOC'S 'CONCENTRATION CAMP' REMARK Host Martha Raddatz challenged Tlaib's decision to vote against aid, asking, \"Isn't opposing aid contributing to the crisis?\" Tlaib said that she spoke with Customs and Border Protection agents who told her, \"More money is not going to fix this.\"",
      "date": "July 7",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "McConnell says he'd have 'no choice' but to take up impeachment articles if House approves them",
      "url": "https://www.foxnews.com/politics/mcconnell-says-he-has-no-choice-but-to-take-up-impeachment-articles-if-house-approves-them",
      "subtitle": "McConnell says he'd have 'no choice' but to take up impeachment articles if House approves them",
      "author": "Brooke Singman",
      "content": " Senate Majority Leader Mitch McConnell said Monday that he would have “no choice” but to take up articles of impeachment against President Trump should the House of Representatives approve them following their formal impeachment inquiry. In an interview with CNBC, McConnell, R-Ky., was asked whether he would bring articles of impeachment for a vote should they reach the Senate. IMPEACHMENT PROBE RAPIDLY WIDENS AS DEMS FIRE OFF SUBPOENAS, SET TESTIMONY “I would have no choice but to take it up,” he said. “How long you’re on it is a whole different matter, but I would have no choice but to take it up based on [the] Senate rule on impeachment.” The comments affirm that McConnell, even as he blasts Democratic tactics from the floor, would not let impeachment articles languish. Depending on how the House proceeds, this raises the possibility of a Senate trial just as the Democratic presidential primaries and caucuses are set to begin in early 2020 -- though Trump still enjoys broad support among Senate Republicans and would have to suffer enormous party defections to actually be ousted from office. Earlier this year, McConnell gave a similar assessment to NPR, saying that if impeachment “were to happen, the Senate has no choice. If the House were to act, the Senate immediately goes to trial.” But last week, before House Speaker Nancy Pelosi, D-Calif., announced the formal impeachment inquiry in the House, McConnell said he was “not going to address all of these…hypotheticals.” “I think all of that is premature,” he said. THE IMPEACHMENT INQUIRY: HOW DOES REMOVING A PRESIDENT WORK? McConnell has now cleared the air on the heels of Pelosi's launch of an impeachment inquiry. The timetable for House action remains unclear, though Democrat-led committees are moving quickly to investigate allegations, first raised in a whistleblower complaint, that Trump improperly pressured the president of Ukraine to investigate the Bidens. A transcript of that call shows Trump sought an investigation, but he denies wrongdoing and denies tying the request to U.S. aid. House Democrats, including Intelligence Committee Chairman Adam Schiff, D-Calif., have vowed to work expeditiously on the inquiry, with some reports indicating that Democrats could even be prepared to introduce formal articles of impeachment against Trump later this fall. Should the House introduce articles of impeachment, all that is needed to impeach Trump is a simple majority vote by those lawmakers present and voting. But at that point, removal from the Oval Office is hardly a certainty. The Senate, as McConnell indicated, would have to hold a \"trial.\" During such a trial, House lawmakers serve as so-called “managers,” who basically fill the role that prosecutors would in a criminal trial and present evidence against the president. The president would be represented by his own counsel. The chief justice of the Supreme Court presides over the trial and the Senate acts as the jury – listening to the arguments from both sides before deliberating and voting on whether to remove the president from office. But it takes a two-thirds vote to convict a president and remove him from office. While some Senate Republicans have voiced concerns about Trump's actions, impeachment does not at this stage appear to have enough support in the Senate to threaten Trump in the long run. Most GOP senators have stopped short of condemning the president for his controversial phone call, while others have outright defended him. “This seems to me like a political setup,” Sen. Lindsey Graham, R-S.C., told CBS’ “Face the Nation” Sunday. “It’s all hearsay. You can’t get a parking ticket conviction based on hearsay. The whistleblower didn’t hear the phone call.” The whistleblower acknowledged that the complaint was based on second-hand information. CLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM Last week, acting Director of National Intelligence Joseph Maguire called the accusations in the complaint “hearsay.” Fox News' Andrew O'Reilly contributed to this report.",
      "date": "September 30",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell makes history as longest serving Senate Republican leader",
      "url": "https://www.foxnews.com/politics/mitch-mcconnell-makes-history-as-longest-serving-senate-republican-leader",
      "subtitle": "Mitch McConnell makes history as longest serving Senate Republican leader",
      "author": "Peter Doocy",
      "content": " Eleven years, five months and 10 days into his tenure as Senate Republican leader, Sen. Mitch McConnell has now had the party’s top spot longer than anyone. “He understands the Senate better than anybody else here,” Sen. John Cornyn, R-Texas, said Tuesday. Up until today, Former Sen. Bob Dole, R-Kan., was the longest serving Senate Republican leader. Former Sen. Trent Lott, R-Miss., had the job for five years, and believes it comes with challenges others in Washington never face. “I think it’s the toughest leadership job, political job, in this city,” Lott said in an interview. “When the president makes a decision the government moves, in the House when the Speaker makes a decision the rules committee takes care of it, in the Senate…you lead and govern by the strength of your personality and respect for the rules.” Lott believes McConnell’s longevity sprouted from a style that stands out from previous party leaders. “He plays his cards very close to his chest, he is an interminable listener,” Lott said. “He may not say much but he’ll just sit there and listen and listen and listen.” McConnell’s majorities have successfully passed tax reform, but failed to achieve another top legislative goal: full repeal of Obamacare.  And in 2010, he took heat for outlining a different priority. “The single most important thing we want to achieve is for President Obama to be a one-term president,” McConnell told the National Journal. Obama was re-elected, but stymied by McConnell six years later when the outgoing president nominated Merrick Garland to the Supreme Court, and the GOP-lead Senate refused to consider it on the floor until after the 2016 election. “We think the most important principle in the middle of this presidential election, which is raging, is that the American people need to weigh and decide who is going to make this decision – not this lame duck president on the way out the door, but the next president next year,” McConnell said in 2016. At the time, the Obama administration complained McConnell was breaking longstanding Senate tradition. “We’re setting an incredibly dangerous precedent in the institution that I love,” former Vice President Joe Biden said. But waiting worked in McConnell’s favor, as Garland’s nomination expired and the Senate later confirmed President Trump’s Supreme Court nominee, Neil Gorsuch. Tensions with Democrats seem to have cooled after the long-running high court conflict, and some are even offering kind words about McConnell’s milestone. “He’s reasonably able to control his people,” Sen. Dianne Feinstein, D-Calif., said. “That in and of itself is something to be credited with.” But sometimes Republicans break ranks, like Senator Ted Cruz, R-Texas, who once called McConnell out about the Export-Import Bank, from the floor of the Senate. “I cannot believe he would tell a flat-out lie,” Cruz said in 2015. Then, there are the GOP candidates who try to capitalize on anti-McConnell sentiment in their home states. “One of my goals as U.S. senator will be to ditch ‘Cocaine Mitch,” Don Blankenship, third-place finisher in West Virginia’s recent Republican Senate primary, said in a campaign advertisement. Ultimately in D.C., there’s not much of an appetite to remove the Republican leader. “He’s been right so many times,” Sen. Chuck Grassley, R-Iowa, said. “It builds confidence among his colleagues.”",
      "date": "June 12, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez rips Mitch McConnell for Green New Deal vote: 'He doesn't want to save our planet'",
      "url": "https://www.foxnews.com/politics/rep-alexandria-ocasio-cortez-mitch-green-new-deal",
      "subtitle": "Alexandria Ocasio-Cortez rips Mitch McConnell for Green New Deal vote: 'He doesn't want to save our planet'",
      "author": "Anna Hopkins",
      "content": " Senate Majority Leader Mitch McConnell doesn't want to save the planet and thinks \"we can all drink oil in 30 years.\" Or at least that's the charge delivered by Rep. Alexandria Ocasio-Cortez ahead of the Senate vote on her Green New Deal. Speaking to Vox reporter Ella Nilsen, Ocasio-Cortez accused McConnell of rushing a vote and not wanting to take action against climate change \"because he thinks we can drink oil in 30 years when all our water is poisoned. “What McConnell’s doing is that he’s trying to rush this bill to the floor without a hearing... without working through committee -- because he doesn’t want to save our planet. Because he thinks we can drink oil in 30 years when all our water is poisoned,” she reportedly said. OCASIO-CORTEZ BLASTS GOP'S UPCOMING 'BLUFF-VOTE' ON GREEN NEW DEAL MCCONNELL TO PUT GREEN NEW DEAL TO VOTE, FORCING DEMOCRATS TO GO ON RECORD A Senate test vote on the Green New Dea is set to take place Tuesday afternoon. Many Senate Democrats have slammed the vote as a \"sham\" and an attempt by the Republican leader to divide Democratic politicians on legislation that has not had the opportunity yet to be debated in Congress. Democratic Sen. Edward Markey, who co-sponsored the proposed legislation with Ocasio-Cortez, said that the Green New Deal was intended to spur debate throughout the 2020 presidential election about how best to tackle the delicate issue of climate change -- not to be put to a quick vote on the Senate floor. In a tweet on Monday, McConnell seemingly addressed accusations that he was manipulating the vote to divide Democrats. “I could not be more glad that the American people will have the opportunity to learn precisely where each one of their senators stand on the ‘Green New Deal’: a radical, top-down, socialist makeover of the entire U.S. economy,\" he wrote. CLICK HERE TO GET THE FOX NEWS APP Many Democrats plan to vote \"present.\"",
      "date": "March 26",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Kentucky sports radio host who may challenge McConnell taken off air after state GOP complaint",
      "url": "https://www.foxnews.com/politics/mcconnell-kentucky-gop-radio-sports",
      "subtitle": "Kentucky sports radio host who may challenge McConnell taken off air after state GOP complaint",
      "author": "Louis Casiano",
      "content": " A Kentucky radio host toying with the idea of running for Senate Majority Leader Mitch McConnell's seat next year announced that he has been taken off the air following a complaint to the Federal Elections Commission by the state's Republican Party. \"Due to the Mitch McConnell complaint filed this morning with the FEC against me, iHeart Radio has asked that I not be on the show in the upcoming days,\" Matt Jones wrote on the Kentucky Sports Radio website late Wednesday. The state GOP has accused Jones of \"serious violations\" of campaign regulations and using his show to promote himself, the Louisville Courier-Journal reported. Jones is also accused of accepting corporate contributions toward his campaign and failing to report expenditures to the FEC. HILLARY CLINTON PRAISES TWITTER AD BAN WHILE MITCH MCCONNELL DEFENDS FREE SPEECH The complaint, filed by Republican Party of Kentucky Chairman J. McCauley, further alleges that Simon & Schuster, the publisher of Jones' upcoming book, \"Mitch, Please,\" is paying for his campaign. \"Matt Jones must be held accountable immediately for misusing multiple platforms paid for by his corporate sponsors to unlawfully promote his US Senate candidacy,\" the complaint reads. \"RPK's complaint is an important first step in stopping Jones' flagrant failure to comply with federal regulations, and we urge the FEC to deliver a swift a strong penalty.\" The complaint also alleges iHeartMedia, the distributor of Jones' show, made \"in-kind\" contributions by letting Jones give his opinions over the airwaves. In his statement, Jones called the complaint \"absolute nonsense\" and disappointing from \"someone as powerful as McConnell.\" MCCONNELL: IF TRUMP IMPEACHMENT TRIAL WERE HELD TODAY, 'IT WOULD NOT LEAD TO A REMOVAL' \"One would think that a man who has at his disposal all the media outlets in America, an unending supply of corporate donations and all the platforms a person could ever need would not be frightened of a sports radio show in Kentucky,\" Jones wrote. \"I have said repeatedly in public and in filings with the FEC that I am not yet a candidate and I haven't used the show to raise money or talk about my exploratory Committee in any way,\" he added. \"Nevertheless, Senator McConnell has complained that having me on air is unfair and the man who speaks about the importance of free speech and the exchange of ideas has decided to cut off mine.\" Jones has formed an exploratory committee to run as a Democrat against McConnell, WLKY-TV reported.  Another Democrat, Amy McGrath, has already filed to run. McConnell's office did not immediately respond to a Fox News request for comment Thursday. Jones said over Twitter he does not blame iHeart Radio for being taken off the air. He said he hopes to work with the company and KSR in the future should he decide not to run. CLICK HERE TO GET THE FOX NEWS APP \"For the time being however, I won’t be on the show,\" his statement said. \"I had hoped to do the show for a couple more weeks, make my decision and then take time off to finish my book and regroup after a long process. Thanks to Senator McConnell that time will apparently start now.\" On Thursday, #FreeMattJones was trending on Twitter after news of the complaint got out. Several users accused McConnell and the GOP of suppressing free speech and hypocrisy.",
      "date": "November 7",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Twitter unlocks Mitch McConnell’s campaign account after GOP fury",
      "url": "https://www.foxnews.com/politics/twitter-unlocks-mitch-mcconnells-campaign-account-after-gop-fury",
      "subtitle": "Twitter unlocks Mitch McConnell’s campaign account after GOP fury",
      "author": "Alex Pappas",
      "content": " Mitch McConnell’s campaign is back on Twitter. Days after the social media platform froze the “Team Mitch” account over a video it posted of leftwing threats against the Republican Senate leader, the situation appeared to be resolved Friday as the campaign celebrated having Twitter access again. GOP GOES TO WAR WITH TWITTER OVER MCCONNELL CAMPAIGN ACCOUNT FREEZE “Victory!!!” the “Team Mitch” account tweeted Friday afternoon. “Thank you to EVERYONE for helping #FreeMitch.” Twitter officials confirmed that it restored access, saying it decided to allow the controversial video posted by McConnell to be displayed in certain cases. \"After multiple appeals from affected users and Leader McConnell’s team confirming their intent to highlight the threats for public discussion, we have reviewed this case more closely,\" Twitter said. It added: \"Going forward, the video will be visible on the service with a sensitive media interstitial and only in cases where the Tweet content does not otherwise violate the Twitter Rules.\" The drama -- which included threats from Republicans to stop spending ad dollars on the platform -- began Wednesday when Twitter froze the \"Team Mitch\" account after the campaign posted videos of protesters outside McConnell’s home, which included violent threats against the Kentucky senator. TWITTER LOCKS OUT MCCONNELL'S CAMPAIGN FOR POSTING VIDEO OF CALLS FOR VIOLENCE AT HIS HOME The episode prompted the McConnell campaign to slam Twitter for political bias, saying the social media platform had effectively blamed the victim. The situation escalated Thursday with top Republican organizations, including the National Republican Senatorial Committee, the RNC and the Trump campaign saying they would not spend money on Twitter until the freeze-out was resolved. Earlier this week, a Twitter spokesman said of the situation: \"The users were temporarily locked out of their accounts for a Tweet that violated our violent threats policy, specifically threats involving physical safety.” The website's policy states that users cannot share content that includes threats against an individual or group of people, regardless of context. Fox News' Ronn Blitzer and Gregg Re contributed to this report.",
      "date": "August 9",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "McConnell: If Trump impeachment trial were held today, 'it would not lead to a removal'",
      "url": "https://www.foxnews.com/politics/mcconnell-if-trump-impeachment-trial-were-held-today-it-would-not-lead-to-a-removal",
      "subtitle": "McConnell: If Trump impeachment trial were held today, 'it would not lead to a removal'",
      "author": "Andrew O'Reilly",
      "content": " Senate Majority Leader Mitch McConnell, R-Ky., said on Tuesday that it is unlikely that President Trump would be convicted and removed from office is he were to face a Senate impeachment trial today. McConnell appeared confident given the knowledge he has that if the Democrat-controlled House votes to impeach Trump, the president will not be found guilty in his trial before the Senate. “I will say I’m pretty sure how it’s likely to end,” McConnell told reporters in Washington. “If it were today, I don’t think there’s any question it would not lead to a removal.” NEW DEPOSITION TRANSCRIPTS RELEASED It takes two-thirds of the Senate to convict a president and remove him from office. That means at least 20 Republicans would have to vote to convict Trump if he is impeached by the Democrat-controlled House. McConnell also questioned whether the six Democratic senators currently running for president in 2020 would want to take time off from campaigning to attend what could be a lengthy trial in the Senate. “The question is how long the Senate wants to take,” he said. “How long do the presidential candidates want to be here on the floor of the Senate instead of Iowa and New Hampshire?” McConnell added: “It’s very difficult to ascertain how long this takes. I’d be surprised if it didn’t end the way the two previous ones did, with the president not being removed from office,” Neither of the last two presidents to face impeachment – Richard Nixon and Bill Clinton – were removed from office. Nixon resigned from office before he could face impeachment, while Clinton was impeached by the House but was acquitted by the Senate. McConnell’s comments came as House Democrats released hundreds of pages of testimony from two top diplomats: Kurt Volker, the former special envoy to Ukraine, and Gordon Sondland, the U.S. ambassador to the European Union. CLICK HERE TO GET THE FOX NEWS APP Both testified for hours behind closed doors about Trump's interest in having Ukraine pursue investigations of Joe Biden and Democrats. The push came as the White House was holding onto millions of dollars in military aid to the East European ally. Democrats claim that's an improper quid pro quo, while Trump and his GOP allies insist the president did nothing wrong. The two diplomats were part of a pivotal May meeting with Trump at the White House that raised red flags. They also engaged in a text message chain about the administration's actions toward Ukraine. Fox News Doug McKelway and The Associated Press contributed to this report.",
      "date": "November 5",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Dems divided on Green New Deal after Mitch McConnell ramps up pressure",
      "url": "https://www.foxnews.com/politics/dems-remain-divided-on-green-new-deal-after-mitch-mcconnell-ramps-up-pressure",
      "subtitle": "Dems divided on Green New Deal after Mitch McConnell ramps up pressure",
      "author": "Liam Quinn",
      "content": " The Green New Deal remains a divisive issue for Democrats, after Senate Majority Leader Mitch McConnell, R-Ky. ramped up pressure on the party by announcing he is bringing the resolution to a vote. The proposal, introduced by Rep. Alexandria Ocasio-Cortez, D-N.Y., and Sen. Ed Markey, D-Mass, aims to transform the U.S. economy in a bid to combat climate change. It came under intense criticism for an FAQ document that promised a job to “all people of the United States” – including those “unwilling to work” – and suggested air travel could be made obsolete. Despite critics attacking some of the more headline-grabbing goals of the proposal, 2020 hopefuls have been quick to get behind the ambitious plan. SEN. JOE MANCHIN SLAMS GREEN NEW DEAL: IT'S NOT A DEAL, 'IT'S A DREAM' Sen. Kamala Harris called the Green New Deal “a bold plan”, Sen. Kirsten Gillibrand told supporters she is “committed to the entire framework” of the proposal, Sen. Elizabeth Warren co-sponsored the guidelines along with Bernie Sanders, and Sen. Cory Booker said he is “excited to support” the “bold action on climate change.” Other Democrats who have voiced support for the plan include: Sen. Chris Murphy, Sen. Richard Blumenthal, Sen. Ron Wyden, Sen. Debbie Stabenow, and Sen. Jeff Merkley. However, there is a growing number of Dems willing to speak out against the wide-ranging proposal, including Sen. Joe Manchin. The West Virginia Democrat blasted the deal as a “dream” during a CNN interview Wednesday night. RUSH LIMBAUGH CHEERS McCONNEL 'TRYING TO KILL' GREEN NEW DEAL “The Green New Deal is a dream, it’s not a deal. It’s a dream. And that’s fine. People should have dreams in the perfect world what they’d like to see. I’ve got to work in realities and I’ve got to work in the practical, what I have in front of me,” Manchin told anchor Chris Cuomo. “And you have to understand also that climate -- we talk about global climate, it’s the globe. It’s not North American climate, it’s not the United States’ climate. It’s the globe. “How do we bring on China and India and everybody else who are great users of carbon right now and polluters of carbon to be carbon-free also?” ALEXANDRIA OCASIO-CORTEZ CALLS GREEN NEW DEAL A 'LIFE AND DEATH' ISSUE, ATTACKS GOP ON CLIMATE CHANGE Some of the other Democrats who have opposed, or remained noncommittal, on the plan, include: Sen. Dianne Feinstein, Sen. Doug Jones, Sen. Amy Klobuchar (who downplayed the deal as “aspirational” in a Fox News interview) and Sen. Tammy Baldwin. House Speaker Nancy Pelosi also threw shade on the Green New Deal earlier this month. CLICK HERE FOR THE FOX NEWS APP “It will be one of several or maybe many suggestions that we receive,” Pelosi said in an interview with Politico. “The green dream or whatever they call it, nobody knows what it is, but they’re for it right?”",
      "date": "February 14",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell cancels Senate's traditional August recess",
      "url": "https://www.foxnews.com/politics/mitch-mcconnell-cancels-senates-traditional-august-recess",
      "subtitle": "Mitch McConnell cancels Senate's traditional August recess",
      "author": "Judson Berger",
      "content": " Senate Majority Leader Mitch McConnell announced Tuesday that he’s canceled most of the chamber's traditional August recess, citing Democrats' \"obstruction\" and the need to pass spending bills. In a brief written statement, he said: “Senators should expect to remain in session in August to pass legislation, including appropriations bills, and to make additional progress on the president’s nominees.” McConnell's announcement had been expected, as he's faced pressure for weeks from fellow Republicans to keep members in session over the hot summer stretch. Their appeal focused on the need to wrap up spending bills and confirm President Trump’s nominees to various positions. McConnell cited exactly that in his statement Tuesday. \"Due to the historic obstruction by Senate Democrats of the president’s nominees, and the goal of passing appropriations bills prior to the end of the fiscal year, the August recess has been canceled,\" McConnell said. But the decision also keeps lawmakers in Washington during a critical period in the runup to November's midterm elections -- a controversial move. On one hand, the recess cancellation allows senators of both parties to show they're working hard. But Democrats may suggest there’s an ulterior motive -- as it keeps several endangered members of their party off the campaign trail. Republicans hold a narrow, 51-49 seat edge in the Senate. In a strange electoral alignment, however, the overwhelming majority of seats up for election this year are held by Democrats -- many in states President Trump won. Sens. Sherrod Brown, D-Ohio; Joe Donnelly, D-Ind.; Jon Tester, D-Mont.; Claire McCaskill, D-Mo. and others are considered vulnerable this election cycle, and could suffer from time off the campaign trail. At the same time, Congress is facing very real deadlines. Congress and the president must come to terms with the next round of spending before Sept. 30. Democrats and Republicans are working feverishly behind the scenes to reach an accord before then. But another factor could scramble the appropriations process. Republicans recently cobbled together a “rescissions” bill, which cancels spending Congress already allocated. The administration recently sent an updated version of that plan to Capitol Hill. Senate Minority Leader Chuck Schumer, D-N.Y., has warned that the rescissions effort “is going to make it harder to get the appropriations process moving forward in a bipartisan way.” Schumer said Tuesday, though, that Democrats welcome the additional time to work on urgent matters in Washington – and called on Trump to stay in D.C. along with Congress. Not all is lost for senators, aides and other Capitol denizens hoping to relax. McConnell's office said senators will likely be on a break for the first full week of August before returning for the rest of the month. Fox News' Chad Pergram and The Associated Press contributed to this report.",
      "date": "June 5, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell tells Nike he'll buy first order of 'Betsy Ross' sneakers if they released after Kaepernick controversy",
      "url": "https://www.foxnews.com/politics/mitch-mcconnell-nike-colin-kaepernick-sneakers",
      "subtitle": "Mitch McConnell tells Nike he'll buy first order of 'Betsy Ross' sneakers if they released after Kaepernick controversy",
      "author": "Joseph A. Wulfsohn",
      "content": " Senate Majority Leader Mitch McConnell, R-KY, expressed his support for the Betsy Ross flag shoes that Nike pulled from the shelves, saying he'd \"make the first order\" if they were on sale again. Nike stirred up controversy when it was reported Monday night that it was no longer selling shoes featuring the American flag designed by Betsy Ross after former NFL quarterback and Nike endorser Colin Kaepernick urged the sportswear company not to sell them, insisting the symbol invokes slavery. While speaking to reporters in Lexington, McConnell weighed in on the controversy. JESSE WATERS: FLAG PROTESTERS  LIKE KAEPERNICK WANT TO 'DIVIDE THE COUNTRY' \"If we’re in a political environment where the American flag has become controversial to Americans, I think we've got a problem,\" McConnell said, according to the Lexington Herald Leader. The top lawmaker urged Nike to reconsider its decision and suggested that perhaps another manufacturer can make them instead. \"I hope Nike either releases these shoes or some other shoemaker picks up the flag, puts it on a pair of shoes and starts selling it,\" McConnell continued. \"I’ll make the first order.\" CLICK HERE TO GET THE FOX NEWS APP Nike has received plenty of backlash of pulling the shoe just days before the Fourth of July. Arizona Governor Doug Ducey announced earlier on Tuesday that it would withdraw its planned incentive for the company to build a plant in his state. \"Nike has made its decision, and now we’re making ours. I’ve ordered the Arizona Commerce Authority to withdraw all financial incentive dollars under their discretion that the State was providing for the company to locate here,\" Ducey tweeted. \"Arizona’s economy is doing just fine without Nike. We don’t need to suck up to companies that consciously denigrate our nation’s history.\"",
      "date": "July 2",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "McConnell chides Trump for calling impeachment inquiry a 'lynching'",
      "url": "https://www.foxnews.com/politics/mcconnell-chides-trump-for-calling-impeachment-inquiry-a-lynching",
      "subtitle": "McConnell chides Trump for calling impeachment inquiry a 'lynching'",
      "author": "Gregg Re",
      "content": " Senate Majority Leader Mitch McConnell on Tuesday called President Trump's use of the word \"lynching\" to describe the House impeachment investigation \"unfortunate,\" even as some Republicans have accused their Democratic colleagues of flagrant hypocrisy on the issue. In a tweet Tuesday, Trump compared the House impeachment inquiry into his dealings with Ukraine to \"a lynching,\" essentially likening the horrors of a deadly and racist chapter in U.S. history to a process laid out in the Constitution. The president added: \"All Republicans must remember what they are witnessing here - a lynching.\" His words have brought bipartisan condemnation. McConnell, speaking to reporters, said \"that was an unfortunate choice of words.\" McConnell added: \"Given the history in our country, I would not compare this to a lynching.\" But, some Republicans pointed to video showing prominent Democrats, including Reps. Gregory Meeks and Danny Davis, calling Bill Clinton's impeachment proceedings a de facto \"lynching\" in 1998. GOP Rapid Response Director Steve Guest also pointed to an October 2008 comment from now-Judiciary Committee Chairman Jerry Nadler, D-N.Y, that was published in an Associated Press article. The quote from Nadler read: \"I am the president’s defender in the sense that I haven’t seen anything yet that would rise, in my opinion, to the level of impeachable offense. … I wish we could get this over with quickly. … In pushing the process, in pushing the arguments of fairness and due process the Republicans so far have been running a lynch mob.\" This time around, however, Democrats have sounded a sterner tone. \"That is one word no president ought to apply to himself,\" said South Carolina Democratic Rep. James Clyburn, the highest-ranking African American in Congress. \"That is a word that we ought to be very, very careful about using.\" Rep. Bobby Rush, D-Ill., who is also black, called on Trump to delete his tweet. \"Do you know how many people who look like me have been lynched, since the inception of this country, by people who look like you. Delete this tweet,\" Rush wrote. Sen. Doug Jones, D-Ala., tweeted to Trump: \"No sir! No, @realDonaldTrump: this is NOT a lynching, and shame on you for invoking such a horrific act that was used as a weapon to terrorize and murder African Americans.\" The New York Times, in a tweet, condemned Trump for \"using a term that invokes the decades-long racist history of white mob murders of black people to describe a legal process laid out in the Constitution.\" Meanwhile, Republican legislators largely tried to put the focus on what they said was the unfair way in which Democrats are conducting the inquiry. Sen. Lindsey Graham, R-S.C., said Trump's description was \"pretty well accurate.\" He called the impeachment effort a \"sham\" and a \"joke\" because the president does not know the identity of his accuser, and the process is playing out in private. \"This is a lynching in every sense,\" said Graham, who is close to Trump. CLICK HERE TO GET THE FOX NEWS APP South Carolina GOP Sen. Tim Scott, the Senate's only black Republican, agreed with Trump's sentiment but not his word choice. \"There's no question that the impeachment process is the closest thing (to) a political death row trial, so I get his absolute rejection of the process,\" Scott said. He added, \"I wouldn't use the word lynching.\" The Associated Press contributed to this report.",
      "date": "October 22",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Trump prods McConnell on sentencing bill: 'Go for it Mitch!'",
      "url": "https://www.foxnews.com/politics/trump-prods-mcconnell-on-sentencing-bill-go-for-it-mitch",
      "subtitle": "Trump prods McConnell on sentencing bill: 'Go for it Mitch!'",
      "author": "",
      "content": "WASHINGTON – Senate Majority Leader Mitch McConnell's reluctance to hold a vote on a popular criminal justice bill has angered top Republican senators and created an unusual rift with a longtime GOP ally, Sen. Chuck Grassley of Iowa. And on Friday, it also brought on a tweet from President Donald Trump. \"Hopefully Mitch McConnell will ask for a VOTE on Criminal Justice Reform,\" Trump tweeted. \"It is extremely popular and has strong bipartisan support. It will also help a lot of people, save taxpayer dollars, and keep our communities safe. Go for it Mitch!\" Minutes later Grassley tweeted that he and the president had spoken about \"the growing support\" for the legislation. \"Pres Trump told me he wants it done THIS CONGRESS,\" Grassley tweeted. Grassley has spent years working to build a coalition around the bill and is pushing for a year-end vote. Grassley says more than two-thirds of the Senate supports it. But McConnell is refusing to bring the legislation forward in a standoff that's dividing the Republican majority and putting President Donald Trump on the spot. \"We've done what needs to be done,\" Grassley said about the overwhelming support for the bill. \"So what's holding it up?\" For the 85-year-old chairman of the Judiciary Committee, this is not the way the Senate is supposed to operate. Grassley was expecting some deference from McConnell after delivering on Trump's judicial nominees — including two now on the Supreme Court. Despite Trump's support for the measure, McConnell says it's divisive. His reluctance to take up Grassley's priority shows the limits of the Senate's old-fashioned customs in an era of heightened partisan politics. \"What's so irritating about this is, first of all, he and I have been hand-in-glove working to get the judiciary vacancies filled,\" Grassley told Iowa reporters. \"I think I ought to have some consideration for delivering on tough Supreme Court nominees, and a lot of tough circuit court nominees and maybe even once in a while you get a tough district court nominee,\" Grassley went on. Sen. Lindsey Graham, R-S.C., intervened Friday, talking directly to Trump about attaching the criminal justice legislation to the must-pass year-end spending bill, which is already tangled in a separate fight over funds for the border wall with Mexico. \"Just talked with President,\" Graham tweeted. \"He strongly believes criminal justice reform bill must pass now. He also indicated he supports putting criminal justice reform bill on year-end spending bill which must include MORE wall funding.\" Trump has called senators about the bill and spoke briefly about it Friday at an event on safe neighborhoods in Kansas City. The bill is a project of Trump's son-in-law, White House adviser Jared Kushner, and would be the biggest sentencing overhaul in decades. It would reduce mandatory prison terms for certain drug crimes and give judges in some cases more discretion on punishments. It would allow about 2,600 federal prisoners sentenced for crack cocaine offenses before August 2010 the opportunity to petition for a reduced penalty. It also includes provisions to encourage education and workforce training in prisons. Roughly 90 percent of prison inmates are held in state facilities and would not be affected by the legislation. While Kushner has been meeting with senators on Capitol Hill, Trump is also hearing from allies who are against the legislation. Chief among them is Sen. Tom Cotton, R-Ark., who is warning senators that Republicans will be blamed if criminals are released and commit new crimes. \"Only thing worse than early release from prison of thousands of serious, violent, & repeat felons is to do that in a spending bill with no debate or amendments, forcing senators to either shut down government or let felons out of prison,\" Cotton tweeted Friday. The spending bill will need approval by Dec. 21 to avoid a funding lapse days before Christmas. Cotton and others, including Sen. John Cornyn of Texas, No. 2 Senate Republican, insist there is not as much support for the bill as Grassley claims. Cotton says senators may tell the chairman they're in favor of it when actually they're not. The bill has support from several conservative and liberal advocacy groups, uniting such disparate partners as the influential Koch network and the American Civil Liberty Union, but it splits law enforcement groups. It is backed by the Fraternal Order of Police and the International Association of Chiefs of Police but opposed by the National Sheriff's Association. Amid this divide, McConnell has been choosing caution, saying there's just not enough time to push the bill forward in the remaining days of the Congress. \"The question is, can you shoe-horn something that's extremely controversial into the remaining time?\" he said Monday in an interview at a Wall Street Journal forum. Criminal justice reform has traditionally been a Democratic priority, as Republicans prefer a more tough-on-crime approach. And McConnell acknowledges it's \"extremely divisive\" among Senate Republicans. Leaders tend to protect senators from taking tough votes that could have political blowback. Sen. Rand Paul, R-Ky., said Thursday that bill backers are making a last-push to attach it to the spending measure and picking up new supporters. But he acknowledged the package's chances are slipping with each passing day. \"We're still lobbying Sen. McConnell — he has all the power to allow it or not allow it,\" said Paul. McConnell and Grassley have worked side by side for decades. When then-President Barack Obama nominated Merrick Garland to the Supreme Court in early 2016, Grassley stood by McConnell's decision to keep the seat open during the election year for the new president to decide. He's ushered in 84 Trump judicial nominees, including a record number of circuit court judges. But their split over criminal justice reform is testing not just their partnership but also the longstanding norms of the Senate. \"What's holding it up is our leader, the majority leader,\" Grassley said. \"There's no reason it shouldn't come up.\"",
      "date": "December 7",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "From ‘Cocaine Mitch’ to ‘Grim Reaper,’ McConnell nicknames become political weapons",
      "url": "https://www.foxnews.com/politics/from-cocaine-mitch-to-grim-reaper-mcconnell-nicknames-become-political-weapons",
      "subtitle": "From ‘Cocaine Mitch’ to ‘Grim Reaper,’ McConnell nicknames become political weapons",
      "author": "Chad Pergram",
      "content": " Congressional Democrats can’t seem to make up their minds about Senate Majority Leader Mitch McConnell, R-Ky. It’s unclear if they think he’s affiliated with a British heavy metal band from the 1980s, is a drug kingpin or could be in league with Superman archenemy Lex Luthor. WHY THE US-CHINA TRADE WAR COULD SETTLE THE 2020 ELECTION IN 2019 Democrats are pillorying McConnell for equating himself with the Grim Reaper when it comes to killing left-wing legislation or ideas which emanate from the Democratically-controlled House of Representatives. There’s the “Cocaine Mitch” nickname floating around. And, Sen. Chris Murphy, D-Conn., thinks political Kryptonite is afflicting McConnell and other Senate Republicans, immobilizing them from legislating. “Sen. McConnell, as I said to you last week, describes himself as the Grim Reaper,” said House Speaker Nancy Pelosi, D-Calif. “The Senate is the graveyard where bills that pass in the Congress, that have bipartisan support in the country, go to die.” “Grim Reaper” was a moderately successful heavy metal band from three decades ago. Their album covers depicted a cloaked visage of Death mounted on a horse. Death clutched a bloody scythe in his hand, two illuminated eyes shining from beneath a cloak. For the record (or, cassette tape, as it were), Grim Reaper put out three albums in the 1980s: “See You in Hell” in 1983. “Fear No Evil” in 1985 and “Rock You to Hell.” VH1 ranked the title track “See You In Hell” as the 38th worst metal song of all-time. McConnell generated his own Grim Reaper moniker. In an interview on Fox News, the Kentucky Republican declared he was “the Grim Reaper when it comes to the Green New Deal.” McConnell has long embraced gallows equivalencies with his post as Senate Majority Leader. “It’s a little bit like being the groundskeeper in a cemetery,” said McConnell. “Everybody’s under you. But nobody’s listening.” This is a far cry from how former Senate Majority Leader Trent Lott, R-Miss., used to describe the role. Lott characterized the job as “herding cats.” At least that had a warm and fuzzy connotation. Of course, McConnell has some choices, too. It’s unclear if he prefers the Grim Reaper sobriquet or “Cocaine Mitch.” Former Republican West Virginia Senate candidate Don Blankenship christened McConnell with the “Cocaine Mitch” handle after 90 pounds of coke were found aboard a shipping vessel owned by his wife’s family. McConnell likes the byname. You can purchase a “Cocaine Mitch” t-shirt from McConnell’s website for $35. The shirts are emblazoned with the words “Cartel Member.” There are questions as to whether it’s appropriate for McConnell to brazenly adopt “Cocaine Mitch,” considering the nation’s drug problem. That’s to say nothing of the issues involving drug smuggling at the border. So Democrats will hammer McConnell over his nickname(s) in an effort to craft a narrative about the Senate. The Senate has mostly focused this year on confirming nominees. Senators have voted on just a few bills all year long. At a press conference, Chris Murphy gave Senate Republicans an earful the other day. He blasted them about health care and other pieces of legislation. “Most days, Senate Republicans are pretending that they aren't actually members of Congress. They pretend as if Donald Trump is Kryptonite, having robbed their powers to legislate,” said Murphy. “They can legislate. They can pass legislation. They could use their voices.” Democrats are flummoxed about the problem. “What's the antidote to Kryptonite?” Senate Minority Leader Chuck Schumer, D-N.Y., asked Murphy. Someone in the crowd hollered “the sun!” Schumer ran with it. “We are the sun antidote to Kryptonite!” thundered the New York Democrat. Well, not exactly. In the DC Comics canon, Superman is blessed with an array of powers. Herculean strength. X-ray vision. Heat vision. Freezing cold breath (really?). Speed. The ability of fly. You know the mantra. “Faster than a speeding bullet! More powerful than a locomotive! Able to leap tall buildings in a single bound!” Superman came to Earth from the planet Krypton, which exploded. But just before Krypton’s demise, Superman’s parents sent their son (then, Kal-El) to Earth in a space-basinet. Superman derives his powers from the sun in this universe. Kryptonite, pieces of the doomed planet Krypton, are lethal to Superman here. Superman’s only protected from Kryptonite if it’s encased in lead. The Man of Steel’s arch villains - ranging from Lex Luthor to Brainiac to General Zod – have all tried to debilitate Superman with Kryptonite at one point or another. But back at the press conference, Schumer wondered if there was another way to neutralize Kryptonite. “I thought it was saying that guy's name backwards. Mr. Mxyzptlk. But that's something else. Remember him?” said Schumer. Schumer’s referring to the impish villain who periodically surfaces from the Fifth Dimension. Mr. Mxyzptlk torments Superman and the rest of Metropolis in bizarre ways. You pronounce his surname “mix-yezz-PITT-uh-lik.” But to remand Mr. Mxyzptlk to the Fifth Dimension for 90 days, you must con him to utter the last name backwards. That’s pronounced “kell-tipp-ZIXX-um.” And you thought immigration policy was hard? Perhaps nicknames are de rigueur in politics these days. After all, President Trump has deployed Crooked Hillary, Lyin’ Ted, Little Marco, Alfred E. Newman, Jeff Flakey, Pocahontas, Mr. Magoo, Low-IQ Maxine Waters, Mr. Kurd, Tim Apple, Horseface to describe various political figures and adversaries. One can bet the president will christen a few new nicknames more before the 2020 campaign is complete. But the Democrats motive to take on McConnell here is clear. Democrats now control the House. Pelosi thinks Democrats have already retained control of the House heading into 2020. Republicans hold the Senate with 53 GOPers compared to 47 senators who caucus with the Democrats. Democrats believe they have a shot at defeating Sens. Martha McSally, R-Ariz., Cory Gardner, R-Colo., Thom Tillis, R-N.C., David Perdue, R-Ga., and Joni Ernst, R-Iowa, next year. That said, Democrats also have to defend Sen. Doug Jones, D-Ala., Gary Peters, D-Mich., and Tina Smith, D-Minn. For years, Republicans toxified Pelosi during her first tour as speaker. The gambit worked. Pelosi’s approval ratings plummeted and GOPers made Pelosi the central figure in their 2010 campaign to retake the House. Democrats think the nicknames about McConnell could double as Kryptonite and undermine vulnerable Senate Republicans. It’s unclear if the maneuver will work. But Republicans lack a lead box in which to hide the Kryptonite. And Republicans wish they could just say Mr. Mxyzptlk’s name backwards to dispatch Democratic attacks to the Fifth Dimension.",
      "date": "May 17",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell: 'For the first time in my memory, I agree with Nancy Pelosi'",
      "url": "https://www.foxnews.com/politics/mitch-mcconnell-for-the-first-time-in-my-memory-i-agree-with-nancy-pelosi",
      "subtitle": "Mitch McConnell: 'For the first time in my memory, I agree with Nancy Pelosi'",
      "author": "Charles Creitz",
      "content": " Senate Majority Leader Mitch McConnell, R-Ky., told Fox News' Laura Ingraham on Thursday that he has found himself in rare agreement with House Speaker Nancy Pelosi,  D-Calif. Earlier in the day, Pelosi unveiled a \"McConnell's Graveyard\" poster, listing several legislative items, written on tombstones, suggesting that the GOP leader was happy to stall the measures in Congress, McConnell explained on \"The Ingraham Angle.\" The list included the For the People Act, the Equality Act, the Paycheck Fairness Act and Gun Violence Prevention. \"She's got it right,\" McConnell said, referring to Pelosi. \"She's got it absolutely right. For the first time in my memory, I agree with Nancy Pelosi.\" PELOSI ACCUSES REPUBLICANS OF TOLERATING TRUMP'S UNETHICAL BEHAVIOR FOR 'MONEY' \"I am indeed the 'Grim Reaper' when it comes to the socialist agenda that they have been ginning up over the House with overwhelming Democratic support, and sending it over to America,\" he added. \"Things that would turn us into a country we have never been.\" Pelosi's poster included a quote from McConnell, in which he called himself the \"Grim Reaper\" in regard to keeping some of the Democrats' legislative priorities from reaching President Trump's desk. \"None of those things are going to pass the Senate. they won't even be voted on. So think of me as the Grim Reaper,\" McConnell had said. Pelosi commented: \"Leader McConnell seems to take great pride in calling himself the ‘Grim Reaper,’ it’s part of his political campaign.\" McConnell told Ingraham he does not plan to approve any items that would move the country in a left-wing direction. \"This is full-bore socialism on the march in the House. As long as I'm the majority leader of the Senate, none of that stuff is going anywhere,\" he said. The Republican mentioned several items he opposes that he claimed some Democrats support, including the addition of a new state to the Union. CLICK TO GET THE FOX NEWS APP \"They plan to make the District of Columbia a state. That would give them two new Democratic senators,\" he said. \"They are on the way to doing some additional things ... the Green New Deal, Medicare-for-all,\" he added.",
      "date": "June 13",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell slammed by author Ta-Nehisi Coates over slavery reparations",
      "url": "https://www.foxnews.com/politics/mitch-mcconnell-slammed-by-ta-nehisi-coates-repreations",
      "subtitle": "Mitch McConnell slammed by author Ta-Nehisi Coates over slavery reparations",
      "author": "Nick Givas",
      "content": " Bestselling author Ta-Nehisi Coates singled out Senate Minority Leader Mitch McConnell, R-Ky., in testimony to Congress Wednesday that took issue with McConnell's stance on reparations for slavery. \"Yesterday when I asked about reparations, Senate Majority Leader Mitch McConnell offered a familiar reply: America should not be held liable for something that happened 150 years ago since none of us currently alive are responsible,\" Coates said. Coates cited pensions for family members of Civil War veterans as a precedent for reparations and said America must function as a collective entity, even when citing the distant past. HECKLING, DRAMA MARK HOUSE HEARING ON SLAVERY REPARATIONS AS TOP DEM ASKS, 'WHY NOT NOW?' \"This rebuttal proffers a strange theory of governance that American accounts are somehow bound by the lifetime of its generations. But well into this century, the United States was still paying out pensions to the heirs of Civil War soldiers,\" Coates said. \"We honor treaties that date back some 200 years despite no one being alive who signed those treaties. Many of us would love to be taxed for the things we are solely and individually responsible for. But we are American citizens and thus bound to a collective enterprise that extends beyond our individual and personal reach.\" Coates also claimed slavery is what made America an economic giant on the world stage, and accused McConnell of shirking his duties as a government leader. \"When [slavery] ended this country could have extended its hollow principles -- life, liberty and the pursuit of happiness to all, regardless of color. But America had other principles in mind. And so for a century after the Civil War, black people were subjected to a relentless campaign of terror,\" he said. \"A campaign that extended well into the lifetime of Majority Leader McConnell.\" \"It is tempting to divorce this modern campaign of terror, of plunder -- from enslavement. But the logic of enslavement, of white supremacy, respects no such borders. And the guard of bondage was lustful and begat many heirs,\" said Coates, who noted that McConnell was born during the Jim Crow era and should be more understanding and empathetic to the plight of African-Americans. BETO O’ROURKE SAYS WHITE AMERICANS DON’T KNOW THE FULL STORY OF SLAVERY, CONTINUES TO SUPPORT REPARATIONS \"[McConnell] was alive to witness cleptocracy in his native Alabama and a regime premised on electoral theft. Majority Leader McConnell cited civil rights legislation yesterday, as well he should -- because he was alive to witness the harassment, jailing, and betrayal of those responsible for that legislation by a government sworn to protect them,\" Coates said. \"He was alive for the redlining of Chicago and the looting of black homeowners of some $4 billion. Victims of their plunder are very much alive today. I am sure they'd love a word with the majority leader. What they know, what this committee must know, is that while emancipation dead-bolted the door against the bandits of America, Jim Crow wedged the windows wide-open.\" Coates closed by saying Americans should be tied to the entirety of their history and remain at the mercy of the past. CLICK HERE TO GET THE FOX NEWS APP \"That is the thing about Sen. McConnell’s 'something.' It was 150 years ago. And it was right now. The typical black family in this country has one-tenth the wealth of the typical white family. Black women die in childbirth at four times the rate of white women,\" he declared. CNN'S DON LEMON: MCCONNELL'S ARGUMENT AGAINST REPARATIONS COMES FROM 'POSITION OF PRIVILEGE AND BIGOTRY' \"The matter of reparations is one of making amends and direct redress but it is also a question of citizenship. In HR-40 this body has a chance to both make good on its 2009 apology for enslavement and reject fair weather patriotism -- to so say that nation is both its credits and its debits. That if Thomas Jefferson matters, so does Sally Hemmings. If D-Day matters so does black Wall Street. That if Valley Forge matters so does Fort Pillow. Because the question really is not whether we will be tied to the somethings of our past, but whether we are courageous enough to be tied to the whole of them.\" Fox News reached out to McConnell's office for further comment and was directed to the Senate Minority Leader's Tuesday press conference, where he laid out his issues with reparations. \"I don’t think reparations for something that happened 150 years ago for whom none of us currently living are responsible is a good idea,\" he said.",
      "date": "June 19",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Marine combat aviator Amy McGrath announces Senate campaign against Mitch McConnell",
      "url": "https://www.foxnews.com/politics/marine-combat-aviator-amy-mcgrath-announces-senate-campaign-against-mitch-mcconnell-after-narrow-house-defeat",
      "subtitle": "Marine combat aviator Amy McGrath announces Senate campaign against Mitch McConnell",
      "author": "Ronn Blitzer",
      "content": " Senate Majority Leader Mitch McConnell’s latest challenge is not from Democrats in the Senate or even House Speaker Nancy Pelosi, but a Marine combat aviator who announced Tuesday she is running against him in 2020. Amy McGrath, a Democrat who lost a close House race in 2018, sees McConnell’s close ties to President Trump as a possible weakness for the incumbent GOP leader and Kentucky senator. MCCONNELL THROWS SHADE AT NIKE WITH 'BETSY ROSS' FLAG TWEET \"Everything that’s wrong with Washington had to start somewhere—it started with him,\" McGrath said in a Tuesday morning tweet. McConnell has been in office since 1985. History is not on McGrath’s side, as Kentucky has not elected a Democratic senator since 1992. Trump’s popularity in the state may also be a hurdle, as McConnell successfully helped the president achieve a number of goals, including the confirmation of Supreme Court Justices Neil Gorsuch and Brett Kavanaugh. Despite this, McGrath remains undaunted. “I've been always somebody who stepped up to the plate when asked, when I felt like my country needed me, and this is one of those times,\" she said in an interview with The Associated Press. McGrath believes that people in her state voted for Trump due to promises to “drain the swamp” and lower prices of prescription drugs; promises she does not believe the president has fulfilled. “Those things haven’t happened because of guys like Senator McConnell,” she said. Trump is expected to back McConnell, as he did for Rep. Andy Barr, the lawmaker who defeated McGrath last year by just three percentage points. MCCONNELL VOWS TO BE 'GRIM REAPER' OF SOCIALIST DEM PROPOSALS On Tuesday morning, McConnell’s campaign responded to McGrath’s announcement with a tweet that included a video montage of her supporting liberal positions on issues including universal health care, abortion, and illegal immigration, as well as a clip of her comparing her reaction to Trump’s election to how she felt on 9/11. The tweet included a brief message: “Welcome to the race, Amy.” McConnell campaign manager Kevin Golden also responded to McGrath's announcement by calling her \"an extreme liberal who is far out of touch with Kentuckians.\" In a statement, he said, \"Comparing President Trump’s election to 9/11, endorsing a government takeover of healthcare, and calling the wall “stupid” is a heckuva platform that we will be delighted to discuss over the next sixteen months The Associated Press contributed to this report.",
      "date": "July 9",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Ocasio-Cortez turns attention to Mitch McConnell amid ongoing feud with Trump over controversial comments",
      "url": "https://www.foxnews.com/politics/ocasio-cortez-mcconnell-trump-tweets",
      "subtitle": "Ocasio-Cortez turns attention to Mitch McConnell amid ongoing feud with Trump over controversial comments",
      "author": "Sam Dorman",
      "content": " Rep. Alexandria Ocasio-Cortez, D-N.Y., turned her attention to Senate Majority Leader Mitch McConnell, R-Ky., amid her ongoing feud with President Trump over his recent controversial comments. In the broadside, the freshman Democrat said McConnell is \"complicit in advancing racism\" in the wake of the president's remarks about four Democratic congresswomen -- including Ocasio-Cortez -- needing to \"go back\" where they came from. Three of the four women were born in America. \"The majority leader is complicit in advancing racism in America if he doesn't even have the backbone to speak out,\" Ocasio-Cortez told ABC on Tuesday. Her comments followed days of controversy surrounding Trump's tweets, provoking responses from politicians in both chambers of Congress. McConnell, on Tuesday, called on \"everybody\" to \"tone down their rhetoric.\" PELOSI'S COMMENTS ON TRUMP'S 'RACIST' TWEETS RULED OUT OF ORDER, AFTER FLOOR FIGHT ERUPTS House Minority Leader Kevin McCarthy, R-Calif., similarly dismissed Ocasio-Cortez's and others' outrage surrounding Trump's tweets as \"all about politics.\" But according to Ocasio-Cortez, Trump's words constituted a \"classic line of white supremacy.\" Trump's comments appeared to unify, at least temporarily, Democrats and prompted House Speaker Nancy Pelosi, D-Calif., to adamantly condemn Trump's comments on the House floor. Before her comments, Trump attempted to tie the Speaker to Ocasio-Cortez and other freshmen in an apparent attempt to make the party seem more left-leaning before the 2020 elections. BRET BAIER: CENSURE VOTE AGAINST TRUMP A 'CAMPAIGN COMMERCIAL IN THE MAKING' FOR HOUSE DEMOCRATS Ocasio-Cortez similarly predicted the controversy could bode well for her party in the upcoming elections. \"Honestly, if these members go on the record condoning the president telling women of color to go back to their own country, I invite them to because we will win the 2020 election and we will take this country back.\" CLICK HERE TO GET THE FOX NEWS APP Not everyone Republican refrained from condemning Trump's remarks. Sens. Susan Collins, R-Maine, and Lisa Murkowski, R-Alaska, both denounced Trump's comments on Monday. “There is no excuse for the president’s spiteful comments –they were absolutely unacceptable and this needs to stop,” Murkowski tweeted.",
      "date": "July 16",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell fractures shoulder after fall in Kentucky home, spokesman says",
      "url": "https://www.foxnews.com/politics/mitch-mcconnell-fractures-shoulder-after-fall-in-kentucky-home",
      "subtitle": "Mitch McConnell fractures shoulder after fall in Kentucky home, spokesman says",
      "author": "Louis Casiano",
      "content": " Senate Majority Leader Mitch McConnell, R-Ky., suffered a fractured shoulder after a fall Sunday morning at his home. McConnell injured his shoulder after he tripped and fell while on the outside patio of his Louisville home. The specifics of his injury, such as which shoulder was injured, was not revealed. \"This morning, Leader McConnell tripped at home on his outside patio and suffered a fractured shoulder,\" David Popp, McConnell's communications director, said in a statement. The 77-year-old was treated and released and is working from his home, Popp said. McConnell returned to Kentucky after the Senate began a five-week recess Thursday, hailing the chamber for a hard-won budget deal that staves off a possible government shutdown. The statement said the senator had expressed his sympathies to the people of El Paso, Texas, and Dayton, Ohio, following the recent mass shootings in those communities and that he had been in touch with Republican Sens. John Cornyn of Texas and Rob Portman of Ohio to \"express his deepest sympathies for the people of El Paso and Dayton and discuss the senseless tragedies of this weekend.\" CLICK HERE TO GET THE FOX NEWS APP Mass shootings within hours of each other in both cities killed a combined 29 people and injured dozens more. Several Democrats including Senate Minority Leader Chuck Schumer, D-N.Y., called on McConnell to call the Senate back Capitol Hill for an emergency session to debate and vote on universal background checks legislation.",
      "date": "August 4",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell campaign criticized for photos of tombstones with Dem names",
      "url": "https://www.foxnews.com/politics/mitch-mcconnell-campaign-criticized-for-photos-of-tombstones-with-democratic-opponetts-name",
      "subtitle": "Mitch McConnell campaign criticized for photos of tombstones with Dem names",
      "author": "Louis Casiano",
      "content": " Senate Majority Leader Mitch McConnell, R-Ky., is facing criticism from his Democratic challenger after his campaign tweeted a photo Saturday of tombstone-shaped signs displaying her name and those of other Democrats with a death date listed as the 2020 election. The photo was taken at a campaign event in Fancy Farm, Ky and was accompanied by the caption: \"The Grim Reaper of Socialism at #FancyFarm today. #FancyFarm139.\" MITCH MCCONNELL FRACTURES SHOULDER AFTER FALL IN KENTUCKY HOME, SPOKESMAN SAYS Among the five tombstones shown were one featuring the name of McConnell's Democratic opponent, Amy McGrath, that read \"R.I.P. Amy McGrath November 3, 2020.\" Another displayed the name of Merrick Garland, the Supreme Court nominee of former President Barack Obama. His nomination was blocked by McConnell, leaving the seat open for President Trump to nominate a conservative justice. Others display the words \"Socialism\" and the \"Green New Deal,\" the ambitious climate change plan put forth by Rep. Alexandria Ocasio-Cortez of New York. McGrath, a former Marine combat aviator, found the photo troubling, considering it came hours after a gunman killed at least 22 people at a Walmart in El Paso, Texas. \"Hours after the El Paso shooting, Mitch McConnell proudly tweeted this photo. I find it so troubling that our politics have become so nasty and personal that the Senate Majority Leader thinks it's appropriate to use imagery of the death of a political opponent (me) as messaging,\" she tweeted in response. \"It's symptomatic of what is wrong with our system. I'm fine with the ordinary rough and tumble of politics, but this strikes me as beyond the pale,\" McGrath said in a follow-up tweet. A few hours after the El Paso mass shooting, a gunman killed nine people in Dayton, Ohio. Kevin Golden, McConnell's campaign manager, told Fox News the photo was based on a political cartoon in the Louisville Courier-Journal that McGrath has tweeted several times. CLICK HERE TO GET THE FOX NEWS APP \"Our supporters built an homage to the Courier Journal cartoon at Fancy Farm and we posted their work,\" Golden said in an emailed statement. \"Amy McGrath has tweeted this very cartoon several times and it’s shameful that she’s pretending not to know exactly what it is referencing in order to politicize a tragedy.\" Last month, McGrath tweeted the newspaper cartoon to criticize McConnell's reaction to coal miner deaths and their exposure to deadly toxins.",
      "date": "August 5",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "AOC slams McConnell after photo of young men in 'Team Mitch' T-shirts 'groping' cutout surfaces",
      "url": "https://www.foxnews.com/politics/ocasio-cortez-mcconnell-photo-team-mitch-shirts-groping-cutout",
      "subtitle": "AOC slams McConnell after photo of young men in 'Team Mitch' T-shirts 'groping' cutout surfaces",
      "author": "Lukas Mikelionis",
      "content": " Rep. Alexandria Ocasio-Cortez blasted Senate Majority Leader Mitch McConnell on Monday over a picture of men – wearing “team Mitch” T-shirts – appeared “groping and choking” a cardboard cutout of her. The New York Democrat took to Twitter to slam the picture after it surfaced on social media. There’s no additional information about when the picture taken or whether or not the men are affiliated with McConnell’s campaign. MITCH MCCONNELL CAMPAIGN CRITICIZED FOR PHOTOS OF TOMBSTONES WITH DEM NAMES “Hey @senatemajldr – these young men look like they work for you,” Ocasio-Cortez tweeted. “Just wanted to clarify: are you paying for young men to practice groping & choking members of Congress w/ your payroll,” she asked, “or is this just the standard culture of #TeamMitch?” The photograph was first surfaced by a Twitter user named @emrazz and the initial caption read, “Break me off a piece of that.” The freshman congresswoman has pressured McConnell for declining to bring a Senate vote on a gun control bill in the wake of shootings in El Paso, Texas, and Dayton, Ohio. MCCONNELL WILLING TO CONSIDER ‘BIPARTISAN’ GUN VIOLENCE SOLUTIONS, OPPOSES 'INFRINGING' ON RIGHTS “The House passed HR8, a Bipartisan Background Checks Act, *5 months ago* and the Senate has yet to vote on it,” she tweeted. “It was one of our 1st major priorities after ending the gov shutdown. You’ve been sitting on it since February giving bogus excuses. Care to explain the people why?” Her call to bring the vote also was in response to McConnell’s tweet offering condolences to the families. “The entire nation is horrified by today’s senseless violence,” tweeted the top Senate Republican. “Elaine’s and my prayers go out to the victims of this terrible violence, their families and friends, and the brave first responders who charged into harm’s way.” Other prominent Democrats such as Sen. Bernie Sanders and Senate Minority Leader Chuck Schumer also reportedly called for the bill passed by House Democrats to be brought to a vote. CLICK HERE TO GET THE FOX NEWS APP McConnell said Monday that he’s willing to consider “bipartisan” solutions in the wake of the mass shootings in El Paso, Texas, and Dayton, Ohio, but made clear his opposition to gun control policies that infringe “on Americans’ constitutional rights.” “Today, the president called on Congress to work in a bipartisan, bicameral way to address the recent mass murders which have shaken our nation,” McConnell said in a statement. “Senate Republicans are prepared to do our part.”",
      "date": "August 6",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Reporter's Notebook: What Mitch McConnell said and did not say about guns",
      "url": "https://www.foxnews.com/politics/mcconnell-guns-what-he-didnt-say-reporters-notebook",
      "subtitle": "Reporter's Notebook: What Mitch McConnell said and did not say about guns",
      "author": "Chad Pergram",
      "content": " I learned a long time ago to pay close attention to the precise verbiage of Senate Majority Leader Mitch McConnell. McConnell usually says what he means. It’s others who divine meaning and interpretation onto the language of the Kentucky Republican. But, without fail, McConnell says exactly what he means. Consider what McConnell said during a recent appearance on WHAS Radio in Louisville about guns. REP. PRESSLEY CALLS MCCONNELL 'THE COMMON ENEMY' AFTER MASS SHOOTINGS “We’re going to begin these discussions over the August break and when we get back  [Sept. 9], hopefully, we’ll be in a position to agree on things on a bipartisan basis and go forward and make law.” So, let’s parse what McConnell didn't say. The majority leader didn’t say the Senate would have a formal “debate” on the Senate floor about firearms, as at least a couple of news outlets reported. McConnell didn’t say the Senate would even consider a bill. “I want to make a law,” McConnell said. Such a proposition would entail the Senate debating actual legislation. But McConnell didn’t commit to that. The majority leader was vague about what bill or bills could be candidates to become law. He also indicated prospective legislation would have to score 60 yeas to overcome not one but two rounds of filibusters. And  McConnell gave himself a potential exit ramp from the whole enterprise. “It has to pass the House,” McConnell told WHAS, adding it “has to be signed by President Trump.” There's no special code in McConnell's locution. Any bill requires passage by the House and Senate, plus the signature of the president, to become law. But, McConnell is simultaneously, and overtly suggesting, something else. There may be no way the House, Senate, and president can come together on anything. It’s hard enough to get all three on the same page with garden-variety legislation. TWITTER UNLOCKS MCCONNELL'S CAMPAIGN ACCOUNT AFTER GOP FURY So, you understand the difficulty of the task in the twilight of this month's shootings in El Paso, Texas, and Dayton, Ohio. Policymakers never have been able to come together and make federal law on firearms after any other mass shooting. So why, oh why, would the aftermath of El Paso and Dayton be any different? That’s not to say that McConnell isn’t open to trying to tackle a bill. McConnell told WHAS that “what’s happened after every one of these shootings is there’s been a temptation to just engage in political discourse rather than passing something.” Some analysts may view such a remark as a fig leaf for McConnell to avoid actually doing something on guns. Possibly. But McConnell certainly can then accuse people of trying to politicize the shootings if lawmakers stumble. Things which pass the House don’t always fare well in the Senate. One could easily imagine a scenario in which the Senate is stymied at advancing anything due to the 60-vote requirement to overcome filibusters. In fact, as McConnell pointed out, the Senate likely would have to marshal 60 yeas not once but twice on gun-related legislation. This is why it’s not a stretch to see no Senate action at all when lawmakers return in September – or a scenario similar to the one which played out in the spring of 2013. HARMEET DHILLON: MCCONNELL CAMPAIGN TWITTER BAN IS LATEST SHOT IN BEG TECH'S WAR ON CONSERVATIVES The Senate didn’t get around to addressing firearms after the December 2012 attack at Sandy Hook Elementary School in Newtown, Conn., until April 2013, and when the Senate did vote, senators cast their ballots with the understanding that nothing would pass. In 2013, McConnell forged an agreement with then-Senate Majority Leader Harry Reid, D-Nev., to take a series of gun-related votes. It was a devil’s bargain. The Reid-McConnell pact required not a simple majority to adopt any amendments related to guns – but 60 votes. There was a conservative amendment, drafted by Sens. Chuck Grassley, R-Iowa, Ted Cruz, R-Texas, Lindsey Graham, R-S.C., and then-Sen. Dan Coats, R-Ind. That proposal scored 52 \"yea\" votes, but that’s a far cry from 60. Reid obviously didn’t want the Senate to pass the conservative plan – especially in a Senate controlled by the Democrats. President Obama (remember, this was 2013), certainly wouldn’t sign such a plan. But, Reid knew that bill could score a simple majority and it did. So, by requiring 60 \"yea\" votes, Reid made sure the Senate euthanized the GOP plan. Sens. Joe Manchin, D-W.Va., and Pat Toomey, R-Pa., developed a bipartisan compromise on background checks. The Senate had sufficient votes to adopt the Manchin-Toomey legislation. Still, many Republican senators opposed that proposal. McConnell may have been the minority leader at the time, but he certainly wasn’t going to allow Manchin-Toomey to pass. That’s why Reid and McConnell forged their devil’s bargain. Both sides played defense. Various gun proposals could record 51 \"yea\" votes in the Senate, but none could secure 60 yeas to overcome a filibuster. So, Reid and McConnell decided to set up a vote sequence to kill all proposals. That would entail subjecting each amendment to a 60-vote requirement for adoption. SENATE DEMS DELIVER STUNNING WARNING TO SUPREME COURT: 'HEAL' OR FACE RESTRUCTURING Among the amendments which withered on the 60-vote vine: a plan by Sen. Dianne Feinstein, D-Calif., to resuscitate the assault-weapons ban which expired in 2004. Naturally, defenders of the Second Amendment abhorred that proposal. Feinstein’s amendment failed 60-40 – not even coming close to 51 \"yea\" votes. So, the sides pre-baked the gun vote series in such a way that it was a fait accompli the Senate wouldn’t approve anything on firearms. Some of the ideas scored more than a majority in the Senate, but the 60-vote threshold doomed all plans to failure. There’s a reason why Reid - as he wrote this week in The New York Times - has wanted to eliminate the filibuster. Such a maneuver would discard the ever-present requirement of coughing up 60 votes to halt filibusters. And, in the present gun debate, McConnell and many others know it’s a challenge to vault the 60-vote hurdle. It may be impossible for the Senate to pass something on guns, let alone finesse legislation into law. One never knows if lawmakers could come up with something which commands 60 votes in the Senate and is also endorsed by the House and President Trump. There’s a chance McConnell may not like such legislation. But, if McConnell sticks to the parameters he laid out, he might not have much of a reason to explain why he won’t allow a measure to advance through the Senate. CLICK HERE TO GET THE FOX NEWS APP Still, we’re a long way from that scenario. So, for now, senators will have “discussions,” as McConnell suggested, and unless there’s a major breakthrough, discussions could be the only postscript to the massacres in El Paso and Dayton.",
      "date": "August 13",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Hillary Clinton praises Twitter ad ban while Mitch McConnell defends free speech",
      "url": "https://www.foxnews.com/politics/hillary-clinton-twitter-political-ad-ban-mitch-mcconnell-free-speech",
      "subtitle": "Hillary Clinton praises Twitter ad ban while Mitch McConnell defends free speech",
      "author": "Danielle Wallace",
      "content": " Hillary Clinton and Senate Majority Leader Mitch McConnell shared opposing views Wednesday regarding Twitter's recent call to ban all political advertisements while gearing up for the 2020 presidential election. Clinton praised the Twitter move and urged Facebook to follow suit, saying such moves would prevent a repeat of the spread of false information that occurred during the last presidential election. TWITTER TO BAN POLITICAL ADS WORLDWIDE, CEO JACK DORSEY ANNOUNCES \"Twitter made the right decision to say, 'Look, we don’t want to get into the judging game,'” Clinton said at The New York Times DealBook Conference in New York City. “I think that should be the decision that Facebook makes as well.” But McConnell, speaking on the Senate floor in Washington, slammed the new Twitter policy as an effort to undermine the First Amendment right to free speech. McConnell said a ban on paid candidate and issue ads would only hurt “fledgling speakers who are not already famous.” Clinton also encouraged Facebook to ban political ads given its track record during the 2016 presidential election, when Russian operatives spread misinformation on American politics prior to the vote. “We know unfortunately that Facebook has a history of allowing all kinds of disinformation on its platform,” Clinton said. “During the 2016 campaign, they were taking ads from a number of sources and later revealing that actually ads paid for in rubles were part of what they were putting out.” Clinton also rejected arguments that by allowing paid political ads, Facebook was protecting free speech. She instead accused the platform of prioritizing its revenue stream instead of fulfilling its duty to American people to stop the spread of misinformation given that “more than 50 percent of people in this country use Facebook as their only source of news.” “If you were to say to your expert engineers, out algorithms really favor the explosive, the inflammatory, the blatantly false and we love to hook people into them and they seek more of it and then they get absolutely barraged by all of this information, we need to tweak the algorithms,” she said. She also admitted that the Democratic Party partially to blame given decades-long ties to Silicon Valley. On Wednesday, McConnell said Twitter’s new policy on paid political advertising “would just amplify the already privileged speakers who already possess multimillion-dollar platforms. It would just help clear the field for those elites by denying the same tools to fledgling speakers who are not already famous.” It does “not bolster our democracy. It would degrade democracy. It would amplify the advantage of media companies, celebrities and certain other established elites while denying an important tool to the Americans who disagree with them,” he continued, according to The Hill. CLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM \"Twitter's leadership has tried to produce a rationale for banishing paid political speech, but the argument boils down to the same misunderstanding that has been used to undermine free speech for decades,” McConnell continued. Twitter CEO Jack Dorsey announced last week that the platform will stop all political advertising — including candidate ads and issue ads — globally starting next month.",
      "date": "November 7",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Mitch McConnell recovering from shoulder surgery in Louisville",
      "url": "https://www.foxnews.com/politics/mitch-mcconnell-recovering-from-shoulder-surgery-in-louisville",
      "subtitle": "Mitch McConnell recovering from shoulder surgery in Louisville",
      "author": "Brie Stimson",
      "content": " Senate Majority Leader Mitch McConnell is reportedly recovering after undergoing shoulder surgery on Thursday. McConnell fractured his shoulder earlier this month when he tripped on the patio of his Louisville, Ky., home, Politico reported. \"The surgery was performed without incident, and the Leader is grateful to the surgical team for their skill,\" McConnell’s communication director said in a statement. PELOSI USES MSNBC HOST'S DERISIVE MONIKER FOR DESCRIBING MITCH MCCONNELL A photo tweeted by McConnell on Aug. 5 appeared to show that it was his left shoulder that had been injured. In the tweet, McConnell holds a busted sneaker and compares the mishap to a sneaker incident that happened to basketball star Zion Williamson. CLICK HERE TO GET THE FOX NEWS APP Since injuring his shoulder, the 77-year-old senator has maintained his schedule but his recovery will keep him from attending a Kentucky Republican dinner this weekend,\" Politico reported. He is up for reelection in 2020. The Associated Press contributed to this report.",
      "date": "August 17",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    },
    {
      "title": "Tight Kentucky gubernatorial race could be bellwether for Mitch McConnell",
      "url": "https://www.foxnews.com/politics/kentucky-governors-race-mitch-mcconnells-litmus-test",
      "subtitle": "Tight Kentucky gubernatorial race could be bellwether for Mitch McConnell",
      "author": "Mitti Hicks",
      "content": " LOUISVILLE, Ky. – As voters head to the polls in Kentucky's gubernatorial contest on Tuesday, Democrats say the results could be a bellwether for what's shaping up to be a closely watched race in 2020: Senate Majority Leader Mitch McConnell reelection campaign. Kentucky is one of only three states electing a governor this year. Polls indicate a tight contest between Republican incumbent Matt Bevin and Democratic challenger Andy Beshear: the latest Mason Dixon Poll in Kentucky shows Bevin and Beshear tied at 46 percent. Some Democrats, though, are looking ahead to the state's Senate race in 2020 -- where they dream of ousting the longtime Kentucky senator and Republican Senate leader -- despite his history of beating back Democratic challengers. TRUMP IS NOT ON THE BALLOT, BUT HE'S FRONT-AND-CENTER IN THIS MONTH’S KEY GUBERNATORIAL ELECTIONS A tight race to Democratic voters like Susan Jarl translates into a competitive race against McConnell, who, like President Trump, will be on the ballot next year. “We have to first get past this step in the state because it’s so important what happens at the state and local level,\" Jarl told Fox News. \"Then come back and get Mitch McConnell and Trump out next year. It would be a miracle and such a blessing.” A spokesman for McConnell did not immediately return a request for comment. McConnell is the longest-serving Republican Senate leader in history and has been reelected six times. A well-funded challenge by Democrat Alison Lundergan Grimes garnered national attention in 2014, but McConnell handily defeated her by 15 points that year. McConnell’s history, however, hasn’t stopped Democratic opponents from emerging, including retired Marine pilot Amy McGrath. She raised $10 million in just 24 hours of announcing she would run against the Senate majority leader. But politics professor Dewey Clayton at the University of Louisville said that it’s ambitious for Democrats to equate Kentucky’s close gubernatorial race to the Senate race in 2020. REPUBLICAN GOV. MATT BEVIN AIMS TO MAKE KENTUCKY HISTORY WITH THIS YEAR’S RE-ELECTION BID “McConnell is a seasoned politician and even though he's considered to be unpopular, he has deep roots here,” Clayton said. “He knows how to win elections, he knows how to help others winning an election, and he's been in office so long, he helped turn this state from being basically a blue state into being a red state.” And Republican voters agree. “I think we’re seeing a trend in our country where we are getting tired of some of the old politicians and I think a lot of us are looking for a change but I support Mitch McConnell,” Kentucky voter Eric Titus said. His campaign manager Kevin Golden, however, told Roll Call: “Leader McConnell and our campaign have been focused on making sure that Governor Bevin, [state attorney general nominee] Daniel Cameron and the rest of the Republican ticket are successful on election night.” It's clear McConnell is preparing for a fight: so far he has about $9 million cash on hand for his re-election bid in 2020.",
      "date": "November 4",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Mitch_Mcconnell"
      }
    }
  ]
}