{
  "articles": [
    {
      "title": "Jesse Watters: Obama administration most 'corrupt' since Nixon",
      "url": "https://www.foxnews.com/politics/jesse-watters-obama-administration-most-corrupt-since-nixon",
      "subtitle": "Jesse Watters: Obama administration most 'corrupt' since Nixon",
      "author": "Victor Garcia",
      "content": " “The Five” co-host Jesse Watters called the Obama administration the most “corrupt” since Richard Nixon's presidency, following the Mueller report’s findings of Russian meddling during Barack Obama's presidency and after revealing comments from his former CIA chief John Brennan. “Barack Obama likes to say he had the most scandal-free administration,” Watters said Monday.  “I think that’s out the window now, it looks like he had the most corrupt administration since Richard Nixon.” Watters chastised the media for not asking Obama’s office for comment on the recent revelations of attempts from Russia to interfere in the 2016 presidential election. BRIT HUME SLAMS MAINSTREAM MEDIA'S MUELLER COVERAGE “I don’t know why the media isn’t calling Barack Obama’s office and asking him for a comment after this entire charade has been exposed,” Watters said. Brennan, who led the CIA from 2013-2017, appeared on MSNBC’s “Morning Joe” on Monday and lamented he may have received “bad information” that led him to predict the president or members of his staff would be indicted. “I don’t know if I received bad information but I think I suspected there was more than there actually was,” Brennan said. “I am relieved that it’s been determined there was not a criminal conspiracy with the Russian government over our election.” Brennan, one of President Trump’s loudest critics, wrote in the New York Times last year that the president colluded with Russia and his claims stating otherwise were “hogwash.” Brennan earlier this month appeared on MSNBC’s “The Last Word” and admitted that a “criminal conspiracy involving the Russians” was developing during his tenure as CIA director. “It was in terms of looking at what was going on with the Russians and whether or not U.S. persons were actively collaborating, colluding, cooperating and involved in a conspiracy with them or not, but also if there is going to be any member of the Trump family...” Brennan said to host Lawrence O’Donnell.\n\n\n“Did you see enough at that stage to believe that there would now, that that would result in indictments once investigated?” O’Donnell interjected. “I thought at the time there was going to be individuals who were going to have issues with the Department of Justice. Yes. And I think we’ve already seen a number of individuals who have been indicted, either have pled guilty or have been convicted now. So again, I don’t have any inside knowledge. I’m not talking with anybody in the special counsel’s office,” Brennan answered. WATCH FOX NEWS' LIVE COVERAGE Watters accused Brennan of trying to hold onto his job and preserve Obama’s legacy by helping former Secretary of State Hillary Clinton get elected to the White House. “John Brennan the CIA director ran point on the whole thing and they wanted Hillary in there. He wanted to keep his job as CIA director and Obama wanted a third term, it was about legacy for him,” Watters said.",
      "date": "March 25",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Sanders campaign co-chair says Biden 'regretted' Obama assassination comment",
      "url": "https://www.foxnews.com/politics/sanders-campaign-biden-regretted-obama-assassination-comment",
      "subtitle": "Sanders campaign co-chair says Biden 'regretted' Obama assassination comment",
      "author": "Andrew O'Reilly",
      "content": " The co-chair of Bernie Sanders’ election campaign dodged a question on Sunday about former Vice President Joe Biden’s recent gaffes while on the stump by praising him for his long career as an elected official -- but saying that voters deciding among the 2020 Democrats don’t want the “status quo” anymore. “The vice president has had a distinguished career in public service,” Rep. Ro Khanna, a California Democrat and Sanders’ national campaign co-chair, said on Fox News’ “Sunday Morning Futures.” “But, I think at the end of the day, the Democratic Party is going to vote for change.” Khanna added: “They're going to say we don't want to go back to the status quo, we want to elect someone who understands that a lot of people have been left behind and has a new vision for how we're going to address that.” RECALLING MLK AND RFK DEATHS, BIDEN ASKS CAMPAIGN CROWD, WHAT IF OBAMA 'HAD BEEN ASSASSINATED' IN 2008? Khanna also said he believed Biden “regretted” making a comment over the weekend about what would have happened had former President Barack Obama been assassinated while on the campaign trail in 2008. “My two political heroes were Martin Luther King [Jr.] and Bobby Kennedy. My senior semester, they were both shot and killed,” Biden said while stumping in New Hampshire. “Imagine what would have happened if, God forbid, Barack Obama had been assassinated after becoming the de facto nominee. What would have happened in America?” CLICK HERE TO GET THE FOX NEWS APP The comment stirred up controversy, but a Biden aide said the candidate has used the analogy before when speaking to younger generations who were not alive during the turbulent 1960s. Biden asserted the assassinations of King and Kennedy raised his political awareness and propelled him to run for office. He first ran – and won – a Senate seat in 1972 at the age of 29. Fox Business Network's Maria Bartiromo contributed to this report.",
      "date": "August 25",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Former Obama top official defends migrant detention centers, says 'cages' not invented when Trump took office",
      "url": "https://www.foxnews.com/politics/jeh-johnson-obama-trump-migrant-detention",
      "subtitle": "Former Obama top official defends migrant detention centers, says 'cages' not invented when Trump took office",
      "author": "Sam Dorman",
      "content": " Jeh Johnson, a Homeland Security secretary under former President Barack Obama, defended the use of holding facilities on Friday, indicating that immigration law put both President Trump and his predecessor in a tough situation for housing immigrants. Johnson said that chain link fences or \"cages\" weren't ideal but were one of the ways authorities dealt with a mass immigrants that had to be transferred to Health and Human Services (HHS) within 72 hours. \"During that 72 hour period, when you have something that is a multiple -- like four times of what you're accustomed to in the existing infrastructure, you've got to find places quickly to put kids,\" he said before suggesting the alternative was putting them on \"the streets.\" Johnson made those comments at the Aspen Ideas Festival on Friday after Congress passed a massive spending package designed to help improve conditions at migrant holding facilities. DHS, CBP OFFICIALS PUSH BACK ON DEMOCRATIC DELEGATION'S CLAIMS OF GRIM CONDITIONS AT MIGRANT DETENTION CENTERS Trump's administration has received intense criticism for the way it treated migrant children -- including putting kids in \"cages\" -- but some have noted that migrants faced similar facilities under Obama. \"Chain link barriers, partitions, fences, cages -- whatever you want to call them -- were not invented on January 2017,\" Johnson said, referring to the month of Trump's inauguration. Numerous reports surfaced in June, claiming that migrants faced inhumane conditions under the president's administration. The issue came to a head after Rep. Alexandria Ocasio-Cortez, D-N.Y., visited a facility and claimed that migrants were forced to drink toilet water. Current and former officials have since pushed back on her claims. House Judiciary Chairman Jerrold Nadler, D-N.Y., also called for federal authorities to face child abuse charges for the way they treated migrants. CLICK HERE TO GET THE FOX NEWS APP \"There ought to be criminal prosecutions of some of the agency heads and some of the people for child abuse. This is clearly child abuse. It violates probably half a dozen laws,\" he said. Republicans, however, have pointed out that their party pushed an aid package for migrants -- something Ocasio-Cortez and other Democrats seemed reluctant to approve. \"How many migrant women did [Ocasio-Cortez] help by voting AGAINST the $4.6 billion bipartisan humanitarian aid that is FOR THEM?\" White House adviser Kellyanne Conway tweeted on Tuesday.",
      "date": "July 2",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Obama worries that progressives risk creating ‘circular firing squad’",
      "url": "https://www.foxnews.com/politics/obama-warns-democrats-against-creating-circular-firing-squad",
      "subtitle": "Obama worries that progressives risk creating ‘circular firing squad’",
      "author": "Adam Shaw",
      "content": " Former President Barack Obama said on Saturday that he is worried that progressives are creating a “circular firing squad” as prospective Democratic presidential candidates race to the left on a number of hot topic issues ahead of the 2020 election. “The way we structure democracy requires you to take into account people who don’t agree with you,” he said at an Obama Foundation town hall event in Berlin, according to The New York Post. “And that by definition means you’re not going to get 100 percent of what you want.” BARACK OBAMA STILL BELIEVES BIDEN WOULD BE 'AN EXCELLENT PRESIDENT' AMID INAPPROPRIATE TOUCHING ALLEGATIONS: REPORT “One of the things I do worry about sometimes among progressives … we start sometimes creating what’s called a ‘circular firing squad’ where you start shooting at your allies because one of them has strayed from purity on the issues,” he said. Obama’s remarks come as freshman House Democrats such as Rep. Alexandria Ocasio-Cortez, D-N.Y., have pushed once-fringe positions on Medicare-for-all, the Green New Deal and reparations for slavery. In turn, 2020 presidential hopefuls have also taken some of those positions. In that climate, candidates have come under criticism for their past stances from activists. South Bend Mayor Pete Buttigieg was forced this week to address remarks he made in 2015 when he said that “all lives matter” -- which some activists say is a counterslogan to the “black lives matter” slogan Sen. Kamala Harris, D-Calif., meanwhile has been hit by controversy over her past as a prosecutor. A scathing op-ed published in January in The New York Times, written by law professor Lara Bazelon, has kickstarted renewed scrutiny. Bazelon says Harris previously \"fought tooth and nail to uphold wrongful convictions that had been secured through official misconduct that included evidence tampering, false testimony and the suppression of crucial information by prosecutors.\" Bazelon further suggested that Harris should \"apologize to the wrongfully convicted people she has fought to keep in prison and to do what she can to make sure they get justice\" or otherwise make clear she has \"radically broken from her past.\" Former vice president under Obama, Joe Biden, meanwhile has faced criticism for inappropriate past physical contact with women, as well a a 1993 speech on crime in which he warned of “predators on our streets” \"They are beyond the pale many of those people, beyond the pale,\" Biden continued. \"And it's a sad commentary on society. We have no choice but to take them out of society.\" The latter was reminiscent of heat 2016 presidential nominee Hillary Clinton took from activists for her description of some gang members as “superpredators” in 1996. Obama himself may not escape criticism in the election cycle. His signature health care legislation, the Affordable Care Act, is quickly being eclipsed by calls from Democrats for single-payer and Medicare-for-all plans. Meanwhile, a number of Democrats have said they are open to reparations for black Americans for slavery -- something that Obama opposed when he was in office. Fox News’ Gregg Re contributed to this report.",
      "date": "April 6",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Obama calls for stricter gun control in wake of mass shootings: 'We are not helpless here'",
      "url": "https://www.foxnews.com/politics/barack-obama-calls-for-stricter-gun-controls-in-wake-of-weekends-mass-shootings-we-are-not-helpless-here",
      "subtitle": "Obama calls for stricter gun control in wake of mass shootings: 'We are not helpless here'",
      "author": "Liam Quinn",
      "content": " Former President Barack Obama on Monday called for new gun control measures in the wake of the two shooting massacres in El Paso and Dayton over the weekend, arguing \"these tragedies will keep happening\" until laws are changed. In a rare statement posted online, the former president said, “No other developed nation tolerates the levels of gun violence that we do. Every time this happens, we’re told that tougher gun laws won’t stop all murders; that they won’t stop every deranged individual grom getting a weapon and shooting innocent people in public places.\" Continuing, Obama wrote: \"But the evidence shows that they can stop some killings. They can save some families from heartbreak. We are not helpless here. And until all of us stand up and insist on holding public officials accountable for changing our gun laws, these tragedies will keep happening.” DEM REP FOR EL PASO: TRUMP 'NOT WELCOME HERE' AS CITY MOURNS MASSACRE Obama also referenced the El Paso suspected gunman’s alleged motives, saying: “While the motivations behind these shooting may not yet be fully known, there are indications that the El Paso shooting follows a dangerous trend: troubled individuals who embrace racist ideologies and see themselves obligated to act violently to preserve white supremacy.” The former president closed the statement with a call for tolerance and diversity, saying both “should be the hallmark of our democracy,” before he also seemingly critiqued President Trump. “We should soundly reject language coming out of the mouths of any of our leaders that feeds a climate of fear and hatred or normalizes racist sentiments; leaders who demonize those who don’t look like us, or suggest that other people, including immigrants, threaten our way of life, or refer to other people as sub-human, or imply that America belongs to just one certain type of people,\" Obama said. 2020 DEMS UNLEASH PROFANE ATTACKS ON TRUMP, REPUBLICANS OVER MASS SHOOTINGS “Such language isn’t new -- it’s been at the root of most human tragedy throughout history, here in America and around the world,\" he said. \"It has no place in our politics and our public life. And it’s time for the overwhelming majority of Americans of goodwill, of every race and faith and political party, to say as much -- clearly and unequivocally.” Obama has rarely commented on political matters, or Trump, since leaving office. His comments came after Sens. Lindsey Graham, R-S.C., and Richard Blumenthal, D.-Conn., pushed a bipartisan bill Monday that would create a federal grant program to assist states in adopting “Red Flag” laws in response to the mass shootings. Graham, who also serves as the chairman of the Senate Judiciary Committee, announced the plan for legislation, which would “assist and encourage” states to adopt \"Red Flag\" laws to “timely intervene in situations where there is an imminent threat of violence.” TRUMP CONDEMNS ‘WHITE SUPREMACY,’ CALLS FOR MENTAL HEALTH AND GUN REFORMS AFTER DOUBLE MASS SHOOTINGS “These grants will be given to law enforcement so they can hire and consult with mental health professionals to better determine which cases need to be acted upon,” Graham said in a statement. “This grant program also requires robust due process and judicial review. It does allow for quick action.” Blumenthal n a statement Monday said that he and Graham have been working on developing an “Emergency Risk Protection Order” statute since the last Congress. “We will be finalizing details for this bill and reaching out to colleagues on both sides of the aisle in the coming days and weeks,” Blumenthal said. “I look forward to introducing final legislation with Senator Graham in the very near future.” On Saturday in El Paso, the gunman, whom Trump described Monday as a \"wicked man,\" killed at least 22 people and injured 24 others after he opened fire at a Walmart in El Paso. CLICK HERE TO GET THE FOX NEWS APP In Dayton, a  24-year-old man, whom Trump described Monday as a \"twisted monster,\" opened fire outside a bar around 1 a.m. Sunday, killing his adult sister and eight others. Police say he was fatally shot by officers within 30 seconds, and was wearing a mask, bulletproof vest and earplugs and had at least 100 rounds. He injured more than two dozen people, leaving one in critical condition, police said Sunday.",
      "date": "August 5",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Recalling MLK and RFK deaths, Biden asks campaign crowd, What if Obama 'had been assassinated' in 2008?",
      "url": "https://www.foxnews.com/politics/biden-targets-trump-jabs-at-2020-rivals-over-medicare-for-all",
      "subtitle": "Recalling MLK and RFK deaths, Biden asks campaign crowd, What if Obama 'had been assassinated' in 2008?",
      "author": "Paul Steinhauser",
      "content": " HANOVER, NH – Joe Biden often touts his relationship with former President Barack Obama. But at a campaign event Friday night in New Hampshire, the former vice president took a very unusual turn. The former vice president asked the audience what would have happened if his former boss had been assassinated. Toward the end of the town hall at Dartmouth College, Biden - as he often does on the campiagn trail - spotlighted two of his political heroes, Martin Luther King Jr. and Sen. Robert F. Kennedy – who were both murdered five decades ago. Biden hypothetically asked “Imagine what would have happened if, God forbid, Barack Obama had been assassinated after becoming the de facto nominee? What would have happened in America?\" TRUMP UPS THE ANTE IN CHINA TRADE WAR The event was held on the 11th anniversary of Obama choosing then-Sen. Biden of Delaware as his running mate in the 2008 election. Senior Biden adviser Symone Sanders quickly took to Twitter to explain the former vice president's unusual comment. \"He was putting into perspective, for young folks in the room, about how traumatic the assassinations of RFK and MLK were for the country,\" she wrote. Biden kicked off the event in Hanover criticizing the current president, not his predecessor. He took aim at the Republican president, speaking as President Trump prepared to head off to the G-7 summit of the world’s top economic powers. “As long as this man is president, and this is no hyperbole, we are in trouble,” Biden said. Reacting to Trump’s comments during a news conference this week – when he said “I am the chosen one” – Biden imitated the president, saying, “I am the savior.” The front-runner in the race for the Democratic presidential nomination then said, “If anybody took this administration so far and made a movie about it – it would never happen – do you think anybody would believe it?” At a later campaign stop in Croydon, N.H., Biden accused the president of continuing “his irrational and self-defeating campaign to make America less respected around the world.” “We wake up wondering what tweet the president is going to unleash. He’s insulted and denigrated Denmark, a culture that has repeatedly fought side-by-side with us, sacrificing men and women along with our troops including in Afghanistan and he calls the Danish prime minister in a misogynistic way ‘nasty woman.’” Biden's comments came as he spoke and took questions for over an hour at a town hall focused on health care, a top issue among Democratic presidential primary voters. He once again highlighted the Affordable Care Act, better known as ObamaCare, the signature domestic achievement during Biden’s eight years in the Obama administration. \"We made significant progress. We have to finish the job,” he argued. Biden, the only top-tier candidate in the Democratic field who doesn’t support a government-run, single-payer \"Medicare-for-all\" plan, noted that for him, \"building on ObamaCare with a public option is the way to go. We should not walk away.” “There’s a lot of people running in our party, good people, who want to get rid of ObamaCare, starting over with something new. I’m not for that,\" he said. \"My health care plan sets out in detail how we can protect and build on ObamaCare to make sure every American has affordable, quality, health care options, while at lowest possible health care costs.” BIDEN JABS AT SANDERS AND WARREN OVER MEDICARE-FOR-ALL Taking an indirect jab at one of his top rivals for the nomination – Sen. Bernie Sanders of Vermont – Biden said his plan “costs a lot of money – almost $740 billion to do what I want to do over 10 years. It’s not $30 trillion. It’s not $30 trillion.” That’s the price tag – at a minimum – that Sanders has acknowledged his \"Medicare-for-all\" plan would cost. Biden has used the line since last month’s second round of Democratic primary debates. Pushing his public option, Biden explained, “We’ll build a new public health option like Medicare within the Affordable Care Act. Only everyone will have a chance to buy in if they wish to. If you have plans already working, if you have a generous union-backed insurance plan and you’re giving up wages to get it, you are in fact entitled to keep it as long as it exists.” Earlier in the week, Sanders campaign made a tweak to its \"Medicare-for-all\" plan to address concerns from unions that under a single-payer system they would be giving up their hard-fought health care benefits and getting nothing in return. THE LATEST FROM FOX NEWS ON THE 2020 PRESIDENTIAL CAMPAIGN Biden also vowed to take on the pharmaceutical giants over the high costs of prescription drugs, saying “We’re going to throw the book quite frankly at the pharmaceutical companies that have abused the power to make outrageous profits off the backs of Americans.” Biden’s stop in Hanover, the first in a two-day swing in the first-in-the-nation presidential primary state, comes as his campaign touted their candidate’s standing as the Democratic White House hopeful with the best chance of beating Trump in next year’s general election. In Biden’s first TV commercial of his 2020 campaign – which started running on Iowa airwaves Tuesday – the announcer in the ad says, “We have to beat Donald Trump and all the polls agree Joe Biden is the strongest Democrat to do the job. No one is more qualified.” As the announcer speaks, graphics pop up on the screen showing a series of polls where Biden’s beating the Republican president in hypothetical 2020 matchups. The ad started playing on Iowa a day after another obvious appeal to electability by the Biden campaign. On Monday the candidate’s wife, Jill Biden, said at a Granite State campaign event in Manchester: “I want you to think about your candidate, his or her electability, and who's going to win this race.\" “Your candidate might be better on, I don't know, health care, than Joe is, but you've got to look at who's going to win this election. And maybe you have to swallow a little bit and say, 'OK, I personally like so-and-so better,' but your bottom line has to be that we have to beat Trump,” she stressed. Democratic voter Karen Summer said as she entered the event on Friday that beating Trump’s “not all that matters but that’s the number one [issue]. Absolutely without a question.” CLICK HERE TO GET THE FOX NEWS APP She added  she came to see Biden to gauge whether he has the fire in his belly to defeat Trump in next year’s election. “One of the reasons I’m here is I want to see if he actually has any kind of spark or vigor,” she said. Dartmouth business school student Hailey Durno – who like Summer is undecided on who she’ll support in the primaries – explained that for her \"it’s a little bit of both.\" \"I think you need someone who’s not only going to beat Trump but someone who’s also going to be the right candidate for the job,\" Durno said. \"You don’t want to select someone out of default because you think that they have the potential to win.” Fox News' Rob DiRienza contributed to this story",
      "date": "August 23",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Biden faces protestors at NH campaign event over Obama-era deportations",
      "url": "https://www.foxnews.com/politics/biden-faces-protestors-at-nh-campaign-event-over-obama-era-deportations",
      "subtitle": "Biden faces protestors at NH campaign event over Obama-era deportations",
      "author": "Paul Steinhauser",
      "content": " DOVER, NH – Former Vice President Joe Biden faced a protest Friday during a campaign event by a small group of demonstrators angry over the stepped-up deportation of undocumented immigrants during President Barack Obama’s administration. The disturbance came at the end of a campaign event in the first-in-the-nation presidential primary state of New Hampshire, where Biden -- the current front-runner in the race for the Democratic presidential nomination  -- chided some of his 2020 rivals for forming “a circular firing squad” and lamented that he’s “getting skewered by the new Democratic Party.” BIDEN HOLDS LARGE LEAD IN NEW FOX NEWS SOUTH CAROLINA POLL As the former vice president was shaking hands and taking selfies with supporters after delivering a 30-minute speech, he was briefly confronted by protesters holding signs reading “Biden we haven’t forgotten 3 million deportations.” They also chanted “apologize now.” Biden briefly attempted to talk with one of the demonstrators. A spokesperson for the protesters said they belonged to the New Hampshire Youth Movement and added that they were allied with Movimiento Cosecha, which describes itself as a “nonviolent movement fighting for permanent protection, dignity, and respect for all immigrants.” The spokesperson, who said her name was Quincy, explained that “we’re here because we do not find many of Joe Biden’s actions acceptable, in terms of his record on immigration under the Obama administration.” ANTI-DEPORTATION ACTIVISTS 'OCCUPY' BIDEN HQ IN PHILADELPHIA, 6 ARRESTED She added that “we need a person who’s going to champion issues like Medicare for all, free college for all, and the Green New Deal, that are going to save my generation’s life and we don’t believe Joe Biden is the person to do that.” While the Obama administration – with Biden as vice president – is praised by many Democrats for implementing the Deferred Action for Childhood Arrivals program in 2014, it’s criticized by many immigration advocates for the increase in deportations. Later, Biden told reporters \"I think the policy of the boarding felons makes sense.\" He explained that the Obama administration was under orders that required the deportations but that the president made sure \"to only deport people who were, in fact, committing a felony.\" Biden remains the front-runner in the Democratic nomination race, but he’s seen his big lead in the national and early primary and caucus voting state polls slip in the wake of last month’s first round of primary debates when he was cold-cocked by Sen. Kamala Harris. The California Democrat’s breakthrough debate moment came as she criticized recent comments by Biden spotlighting his ability to find common ground during the 1970s with segregationist senators with whom he disagreed, and over his opposition decades ago to federally mandated school busing. THE LATEST FROM FOX NEWS ON THE 2020 PRESIDENTIAL CAMPAIGN Biden told the crowd in Dover that “the good news about being a front runner is that you’re a front runner. The bad news about being a front runner is everyone’s behind you, they’re looking. You know what I mean.” And he warned his rivals that the last thing the Democratic White House hopefuls need to do is “fall in a circular firing squad here.” “I’m getting skewered by the new Democrat party and I respect them, by the way,” he emphasized. And he said he was getting attacked by some of his rivals for preaching about his ability to work with Republicans across the aisle to get things accomplished. “Somehow the idea we are able to cooperate with the other side is considered naïve,” he lamented. Biden also repeatedly took aim at Republican President Donald Trump, saying he’s “embracing these oligarchs, embracing these thugs, poking his finger in the eye of NATO, the single most consequential alliance we’ve ever had. Folks, it is incredibly dangerous.” And he emphasized that “we’ve got to stop this guy. We’ve got to keep him from having a second term.” SOUTH BEND POLICE CALL OUT BUTTIGIEG FOR SENDING PIZZA RATHER THAN APOLOGY OVER RACE COMMENTS The former vice president told the audience “I hope you’ll vote for me,” but also highlighted that if he doesn’t win the nomination, “whoever our nominee is, I’m going to break my neck to make sure they get elected.” Biden arrived in the Granite State a few days after he released his tax returns, which showed he made $15 million in the two years after leaving office. Asked by Fox News' Peter Doocy if he can still call himself \"Middle-Class Joe,\" Biden touted he was raised with \"middle-class values.\" \"The fact of the matter is that the money that I made I made because I got hired as a full professor at the University of Pennsylvania. And I wrote a book that was number one on the best sellers for a long long time,\" he noted. The stop in Dover kicked off a two-day swing by the Biden as he makes his third trip to New Hampshire since launching his campaign in late April. Hours earlier, rival Pete Buttigieg held a large rally a few blocks away. City officials estimated that more than 800 people attended the South Bend, Indiana mayor's event. That crowd was significantly larger than the one gathered for Biden. CLICK HERE TO GET THE FOX NEWS APP But New Hampshire attorney and former ambassador Terry Shumaker, a top Granite State supporter and surrogate for Biden, dismissed talk of a lack of enthusiasm for the former vice president. \"People are coming up to me on the street and self-identifying themselves as Biden supporter,\" he noted. Shumaker explained the most people are \"interested in some of the newer names and what the excitement is and they want to go see them. But literally everybody I know is still shopping. Nobody’s buying yet.\"",
      "date": "July 12",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Washington Post columnist urges Obama to condemn Trump, 'reclaim legacy': ‘Your country needs you’",
      "url": "https://www.foxnews.com/politics/washington-post-obama-condemn-trump-legacy",
      "subtitle": "Washington Post columnist urges Obama to condemn Trump, 'reclaim legacy': ‘Your country needs you’",
      "author": "Brian Flood",
      "content": " The Washington Post published an open letter from one of its columnist urging former President Barack Obama to speak out against President Trump to “lift the country’s sights again.” Columnist Karen Tumulty penned the piece, headlined “We need someone who can lift us up again. Enter President Obama,” which essentially begs the former president to take action against his successor. “Mr. President, it is time. You must speak. Your country needs you,” Tumulty wrote before referencing controversial tweets the current president recently sent in which he told four congresswomen to “go back” to where they came from. Three of the four women were born in America. MSNBC GUEST BIZARRELY DECLARES PRESIDENT TRUMP IS 'MORE RACIST’ THAN NEO-NAZIS “Trump’s tweets over the weekend were the basest kind of bigotry, the oldest of racist tropes. And they were a reminder that in the eyes of some, who apparently include our current president, people of color will never be seen as fully American, regardless of how many generations their families have been part of this nation’s story or how much they achieve as individuals,” the Post columnist wrote. Tumulty then said she understands Obama’s “reluctance to weigh in on Trump’s latest transgression” but feels “silence now is unacceptable” and declared it’s time for the former president to speak up -- and speak out. “For Trump, racism is not a moral failing; it is a political tactic. None of us can really claim to understand what is in his heart, but the cynicism of his actions is apparent, and it must be exposed for what it is,” Tumulty wrote. “No one knows that better than you do.” THIS IS CNN? NETWORK APPARENTLY RECENTLY GLORIFIED ICE DETENTION CENTER ATTACKER Tumulty then lists a variety of Trump’s actions that have been criticized by the left, such as “spreading a blatantly racist lie” that Obama was not born in the United States, referring to some Mexican immigrants as rapists and calling for ban on Muslim’s entering the country. “There was a political calculation behind every one of those vile statements, and as repulsed as we are with his latest racist rant, it is possible to see the calculation that is at work here as well,” she wrote. “President Obama, what we need more than anything else right now is someone who can lift the country’s sights again.” CLICK HERE TO GET THE FOX NEWS APP The Post’s column concluded with an appeal to Obama: “Find your voice again. Reclaim your legacy. Do it now. It won’t wait until your memoirs.”",
      "date": "July 16",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Obama warns Dem freshmen on cost of their proposals",
      "url": "https://www.foxnews.com/politics/obama-warns-dem-freshmen-on-cost-of-their-proposals",
      "subtitle": "Obama warns Dem freshmen on cost of their proposals",
      "author": "Brooke Singman",
      "content": " Former President Barack Obama reportedly warned freshman Democrats this week on the cost of their sweeping proposals, urging them to figure out how to pay for them. Obama, who has largely stayed out of the public eye since leaving office, encouraged a group of freshman Democrats to continue to pursue “bold” ideas, according to The Washington Post, but also to home in on the details of funding them. FROM REPARATIONS TO GREEN NEW DEAL, LIBERAL LITMUS TESTS PUT 2020 DEMS IN RISKY TERRITORY “He said we [as Democrats] shouldn’t be afraid of big, bold ideas – but also need to think in the nitty-gritty about how those big, bold ideas will work and how you pay for them,” one person familiar with Obama’s remarks told The Post. While the former president did not call out any specific proposals by name, some reportedly took his advice as a note for those new lawmakers pushing \"Medicare-for-all\" and the Green New Deal—both liberal policies popularized by House freshmen, including Rep. Alexandria Ocasio-Cortez, D-N.Y. The Green New Deal is a massive overhaul of the nation’s economy and energy use, with an estimated cost that could reach well into the tens of trillions of dollars. The resolution, which is nonbinding, is co-sponsored by nearly all major 2020 Democrats in Congress and was introduced in the House last month. The rollout of the proposal caused headaches for Democrats, as it included FAQs from Ocasio-Cortez containing promises of economic security for those “unwilling to work” and talk of abolishing air travel in favor of high-speed rail. But Ocasio-Cortez has not yet explained a plan for how to fund the program. Meanwhile, Senate Majority Leader Mitch McConnell on Tuesday will put the Green New Deal to a test vote, in a move that will force Democrats to take an official stand on the measure and pit the party’s moderate members against its progressive wing. MCCONNEL TO PUT GREEN NEW DEAL TO VOTE, FORCING DEMOCRATS TO GO ON RECORD Obama, later, reportedly encouraged the freshman lawmakers to find a policy and fight for it. The Post said Obama said that The Affordable Care Act, or ObamaCare, was the policy that Obama said he was willing to lose his office over. Obama also reportedly talked about the importance of working with constituents and “staying in touch” with them. But while Obama is typically a unifying voice in the Democratic Party, freshman Rep. Ilhan Omar, D-Minn., has criticized the former president in recent weeks, reportedly suggesting in an interview his message of “hope and change” is a “mirage.” “Recalling the ‘caging of kids’ at the U.S.-Mexico border and the ‘droning of countries around the world’ on Obama’s watch,\" Omar charged that Obama \"operated within the same fundamentally broken framework as his Republican successor,” the recent article in Politico said. Omar later claimed she was misquoted by Politico, tweeting that she is a fan of Obama. But the move immediately backfired as the recording of her interview confirmed the comments she made to the news outlet. She later deleted her tweet. Fox News' Adam Shaw and Lukas Mikelionis contributed to this report.",
      "date": "March 26",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Trump hammers Biden, questions if 'big secret' is behind why Obama hasn't endorsed his ex-VP",
      "url": "https://www.foxnews.com/politics/trump-biden-big-secret-obama-endorsement",
      "subtitle": "Trump hammers Biden, questions if 'big secret' is behind why Obama hasn't endorsed his ex-VP",
      "author": "Liam Quinn",
      "content": " President Trump has renewed his attacks on Joe Biden, this time questioning why former President Barack Obama hasn't endorsed his former vice president. In a new interview, Trump wondered if there was a “big secret” as to why Obama has not backed Biden. “How he doesn’t get President Obama to endorse him, there has to be some reason why he’s not endorsing him,” Trump told The Hill. “He was the vice president. They seemed to have gotten along. President Obama not endorsing him is rather… a big secret.” FLASHBACK: BIDEN ENTERS WHITE HOUSE RACE WITHOUT OBAMA'S ENDORSEMENT After the ponderance, the president accused Biden of lying when he previously stated he asked Obama not to endorse him. “Then he goes and lies and says, 'I asked the president not to endorse me'… give me a break,” Trump told The Hill. “He’s embarrassed that Obama’s not endorsing him, so he goes out and says, 'I asked President Obama not to endorse me.' “So, it could be that President Obama knows something because there is something going on in that brain of his.” LARA TRUMP: JOE BIDEN TANKING EARLIER THAN EXPECTED, 'MAYBE HE REGRETS NOW EVEN DECIDING TO RUN' In April, shortly after he officially announced his long-expected 2020 run, Biden told Fox News he had asked his former boss not to support him publicly. \"I asked President Obama not to endorse,” Biden said at the time outside an Amtrak station in Delaware, adding that “whoever wins this nomination should win it on their own merits.” Obama's team released a statement praising Biden; the statement stopped short of endorsing him. “President Obama has long said that selecting Joe Biden as his running mate in 2008 was one of the best decisions he ever made,” Obama spokeswoman Katie Hill said. TRUMP: 'SLEEPY JOE BIDEN' HASN'T 'APOLOGIZED' FOR INVOLVEMENT IN 1994 CRIME LAW “He relied on the Vice President’s knowledge, insight, and judgment throughout both campaigns and the entire presidency. The two forged a special bond over the last 10 years and remain close today.” Trump and Biden repeatedly have traded blows since the former vice president entered the 2020 race, with the president frequently dismissing his potential opponent as “sleepy”. Trump even said he would prefer to run against Biden rather than face another campaign against former Secretary of State Hillary Clinton. CLICK HERE TO GET THE FOX NEWS APP Trump, who has continued to launch criticisms at Clinton even after he defeated her in the 2016 presidential race, recently offered rare praise of the former secretary of state while once again labeling Biden as “sleepy.” “I actually think that Hillary Clinton was a great candidate. She was very smart. She was very tough. She was ruthless and vicious,” Trump said during an interview that aired this past Sunday on NBC News’ “Meet The Press.” “[Biden’s] sleepy. She was not sleepy.”",
      "date": "June 24",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Mattis slams Obama, Biden for 'ignoring reality' in Iraq, leading to rise of ISIS",
      "url": "https://www.foxnews.com/politics/mattis-slams-obama-biden-for-ignoring-reality-in-iraq-leading-to-rise-of-isis",
      "subtitle": "Mattis slams Obama, Biden for 'ignoring reality' in Iraq, leading to rise of ISIS",
      "author": "Gregg Re",
      "content": " Former Defense Secretary James Mattis, in stark terms, lambasts Barack Obama and Joe Biden for faulty leadership in his new book, and suggests their naivete and ignorance of reality contributed to the rise of ISIS in Iraq, according to excerpts reviewed by The Washington Examiner. The book, \"Call Sign Chaos: Learning to Lead,\" co-written with Bing West, does not delve into Mattis' discussions with President Trump. Mattis, speaking to \"Fox & Friends\" on Tuesday, said only that he did not have a \"tense\" relationship with the president. \"I try not to talk, having parted ways with the administration over matters of policy,\" Mattis said. \"I don't want to talk from the cheap seats now and make their job more difficult.\" Mattis resigned from the Trump administration last December after clashing with the president over the abrupt withdrawal of U.S. troops from Syria and after two years of deep disagreements over America's role in the world. But Mattis, in his book, did open up about his tenure as head of U.S. Central Command from 2010 to 2013, and zeroed in on the Obama administration's desire to wind down the U.S. troop presence in Iraq, no matter the cost. Mattis wrote that Obama's tenure \"was to be a time when I would witness duty and deceit, courage and cowardice, and, ultimately, strategic frustration.\" ISIS USING BOOBY-TRAPPED BOVINES, DONKEY-BORNE EXPLOSIVES TO TARGET ENEMIES IN IRAQ “In Washington, the debate swirled throughout 2011 about how many, if any, U.S. troops should remain in Iraq,” Mattis recounted. “Central Command, the chairman of the Joint Chiefs and the new defense secretary, Leon Panetta, who had replaced Bob Gates, continued to recommend to the White House retaining a residual force, as did Secretary of State Hillary Clinton.\" All of them, Mattis asserted, were \"talking to the wind,\" as Obama was singularly focused on living up to his public promises to end the war in Iraq. In late 2011, Obama said confidently in a speech to the nation that some 40,000 servicemen and women still in Iraq \"will definitely be home for the holidays.\" The administration's faith in Iraqi Prime Minister Nouri al-Maliki, Mattis said, was also misplaced. “Prime Minister Maliki is highly untrustworthy, Mr. Vice President,” Mattis said he warned Biden. “He’s devious when he talks to us. ... He looks at our ambassadors and military advisers as impediments to his anti-Sunni agenda. He wants to purge or marginalize Sunnis and Kurds from the government.\" Mattis wrote that “Vice President Biden and his assistants listened politely. But as we spoke, I sensed I was making no headway in convincing the administration officials not to support Maliki. It was like talking to people who lived in wooden houses but saw no need for a fire department. ...  I found him an admirable and amiable man. But he was past the point where he was willing to entertain a ‘good idea.’ He didn’t want to hear more; he wanted our forces out of Iraq. Whatever path led there fastest, he favored. WATCH: MATTIS SAYS HE DIDN'T HAVE 'TENSE' RELATIONSHIP WITH TRUMP \"He exuded the confidence of a man whose mind was made up, perhaps even indifferent to considering the consequences were he judging the situation incorrectly,\" Mattis concluded. According to Mattis, Biden countered that “Maliki wants us to stick around, because he does not see a future in Iraq otherwise. I’ll bet you my vice presidency.” Afterward, Mattis said, \"Iraq slipped back into escalating violence. It was like watching a car wreck in slow motion. ... All of this was predicted — and preventable.” In 2016, faced with the rise of the Islamic State (ISIS) in the Iraq power vacuum that he had once dismissed as a \"junior varsity\" effort, Obama sent 5,000 troops back to Iraq. ISIS' major strongholds fell under the Trump administration, although experts warn that the group remains dangerous. Nevertheless, Biden -- who was nominally in charge of overseeing troop withdrawals from Iraq under the Obama administration -- has touted his efforts in that capacity as he runs for president. “I made sure the president turned to me and said, ‘Joe, get our combat troops out of Iraq,'\" Biden said in Miami in June. \"I was responsible for getting 150,000 combat troops out of Iraq, and my son was one of them.” In July, Biden claimed, “When I was vice president, the president gave me all the easy jobs, like ‘take care of getting all our troops out of Iraq,’ which we did.” TRUMP SLAMS OBAMA FOR NOT ENFORCING 'RED LINE' AFTER 'ANIMAL' ASSAD APPARENTLY USES CHEMICAL WEAPONS The Washington Post's fact-checker has noted that Biden has preferred not to mention on the campaign trail the troops' eventual return to Iraq under his watch. In his book, Mattis also faulted Obama's failure to enforce his own self-imposed \"red line\" upon the use of chemical weapons in Syria had weakend the U.S. globally. “Old friends in NATO and in the Pacific registered dismay and incredulity that America’s reputation had been seriously weakened as a credible security partner,” Mattis wrote. “Within 36 hours, I received a phone call from a friendly Pacific-nation diplomat. ‘Well, Jim,’ he said, ‘I guess we’re on our own with China.'” He continued: “Over the next several years, Syria totally disintegrated into hell on earth. The consequences included an accelerated refugee flow that changed the political culture of Europe, punctuated by repeated terrorist attacks. And America today lives with the consequences of emboldened adversaries and shaken allies.” Mattis separately recounted his own ignominious firing by Obama, after months of disagreement over military policy. “In December 2012, I received an unauthorized phone call telling me that in an hour, the Pentagon would be announcing my relief,” Mattis said. \"I was leaving a region aflame and in disarray. The lack of an integrated regional strategy had left us adrift, and our friends confused. We were offering no leadership or direction. I left my post deeply disturbed that we had shaken our friends’ confidence and created vacuums that our adversaries would exploit.” CLICK TO GET THE FOX NEWS APP Speaking to \"Fox & Friends,\" Mattis emphasized that his book was not entirely about disagreements over geopolitics and strategy. \"It's about leadership,\" Mattis said. \"It's about allies, it's about how do you set the vision as a leader so that all your young people, right down to the youngest 18-year-olds, feel a sense of ownership?\"",
      "date": "September 3",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Both sides make closing arguments in trial of ex-Obama White House lawyer Greg Craig",
      "url": "https://www.foxnews.com/politics/greg-craig-obama-trial-closing-arguments-ukraine",
      "subtitle": "Both sides make closing arguments in trial of ex-Obama White House lawyer Greg Craig",
      "author": "Jake Gibson",
      "content": "  Federal prosecutors said Tuesday that Greg Craig, a prominent Washington lawyer and former White House counsel under President Barack Obama, misled his then-law firm and the Justice Department about his work for the pro-Russian government of Ukraine in 2012. Craig, 74, faces one count of lying to the DOJ's Foreign Agents Registration Act (FARA) Unit when it approached the firm -- Skadden, Arps, Slate, Meagher & Flom -- with concerns that it should have registered as a foreign agent for its Ukraine work. Defense attorney William Murphy, in closing arguments that lasted about two hours, maintained that Craig \"did not knowingly and willfully act to deceive\" the FARA Unit and allegations that his legal services crossed a line into foreign lobbying were untrue. \"Did he really have a motive to lie and impugn his own reputation?\" Murphy asked. \"He had no motive to lie and he didn't lie.\" Craig took the stand in his own defense last in a case that emerged as an offshoot of former Special Counsel Robert Mueller’s Russia investigation and that has spotlighted the lucrative universe of foreign lobbying in Washington. The case has centered on a report commissioned by the government of Ukraine's then-leader Viktor Yankovych that reviewed the criminal prosecution of opposition leader, Yulia Tymoshenko. Craig said the report identified significant flaws with the handling of Tymoshenko’s case. That conclusion went against the interests of the Ukrainian government, which clearly wanted the trial to be depicted as fair in order to counter international criticism of the proceedings. Craig said he discussed the report’s findings with Western journalists, including from The New York Times, only because he was concerned the media would portray it in Ukraine’s favor. He testified that because his position was contrary to that of the Ukrainian government, he did not view himself as a foreign agent and did not think it necessary to register as one with the Justice Department. WHITE HOUSE SLAMS CHINA'S 'HIGHLY DUBIOUS' INFRASTRUCTURE PROJECT AS BOLTON WARNS UKRAINE Prosecutors have argued that Craig lied about his interactions with New York Times reporter David Sanger, claiming that Crag told his partners at Skadden and officials at the FARA Unit that he did not reach out to Sanger. However, emails between the two men revealed at trial show that Craig did contact Sanger about the report, even hand-delivering the report to Sanger's home before publication. \"He chose to conceal the facts and that was the crime,\" prosecutor Fernando Campoamor-Sanchez said of Craig during closing arguments.\"When the FARA Unit asked him questions, he concealed because at the end of the day, his reputation would have been tarnished.\" \"It's not a crime to work on a report, or even to get $4 million out of a bank account in Cyprus,\" Campoamor-Sanchez added. \"It is a crime to conceal. It is a crime to craft your answers so they don't even make sense. That is a crime.\" CLICK HERE TO GET THE FOX NEWS APP \"Mr. Craig schemed to deceive his law firm and then the FARA Unit about what had actually happened... He wanted a result that he thought he was entitled to,\" prosecutor Jason McCullough said during the rebuttal. \"Hold him accountable ... Find him guilty.\" The jury is set to receive instructions from U.S. District Judge Amy Berman Jackson Wednesday morning and will begin deliberations immediately after. The Associated Press contributed to this report.",
      "date": "September 3",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Greg Craig, former Obama White House counsel, found not guilty of false statements over Ukraine work",
      "url": "https://www.foxnews.com/politics/greg-craig-former-obama-white-house-counsel-found-not-guilty-of-false-statements-over-ukraine-work",
      "subtitle": "Greg Craig, former Obama White House counsel, found not guilty of false statements over Ukraine work",
      "author": "Gregg Re",
      "content": " Greg Craig, a prominent Washington lawyer and former White House counsel under President Barack Obama, was found not guilty by a jury Wednesday of false statements to the Justice Department about his work for the pro-Russian government of Ukraine in 2012. The verdict, which came after approximately four hours of deliberations in a Washington, D.C. federal courthouse, was a major setback for the DOJ's recently redoubled efforts to scrutinize unregistered overseas lobbying work. Craig, 74, hugged his attorneys after the verdict was read. One juror remarked after the verdict: \"What infuriates me, is that the special counsel wasted so much time on an issue like this one, while the republic itself is under assault.\" Other jurors said they found Craig to be credible if not entirely forthright in some of his communications, and that it was difficult to find Craig had specifically committed a crime within the \"narrow\" period prescribed by the applicable statute of limitations. Jurors would have needed to find criminal conduct after October 3, 2013 -- although some said they had concerns about Craig's conduct before that cutoff date. \"He walked up to the line and may very well have crossed it,\" another juror said. Craig attorney William Taylor told reporters after the verdict that it was a \"tragedy\" and a \"disgrace\" that the DOJ had decided to \"hound\" Craig even after the Southern District of New York passed on prosecuting him. But for his part, Craig struck an upbeat tone. \"I have a few things to say,\" Craig said. \"One is, I first want to thank the jury for your service, and for doing justice in this case, I am thankful for them in so many ways. I want to thank my family and my friends who were with me throughout all of this, and I want to thank my lawyers who made it all possible. and that's all. Thank you.\" In April, Craig became the first prominent Democrat to be indicted in a case arising from Special Counsel Robert Mueller's now-completed probe into Russian election interference. Mueller referred the Craig case to prosecutors in New York last year after uncovering possible wrongdoing while he investigated former Trump campaign manager Paul Manafort's Ukraine lobbying. The grand jury indicted Craig on two counts of making false and misleading statements to investigators -- including Mueller's team and the DOJ National Security Division's FARA Unit -- in connection with his work on behalf of Russia-backed former President of Ukraine Viktor Yanukovych. One of those counts was dismissed before trial. The work that drew the Justice Department's attention occurred in 2012, when Craig and his law firm at the time — Skadden, Arps, Slate, Meagher & Flom — were engaged by the government of Ukraine to review the prosecution of Yulia Tymoshenko, a former Ukrainian prime minister, and produce a report on whether the trial met Western standards of justice. Tymoshenko was a political opponent of Yanukovych, a longtime Manafort patron and a political figure whom Manafort associate Rick Gates said he and Manafort had helped get elected. The report was billed as independent, but critics have said it whitewashed a politically motivated prosecution, and Gates acknowledged on the witness stand that the document was conceived as a way to counter international criticism that Tymoshenko had been denied a fair trial. WHY DID MICHAEL FLYNN FIRE ALL HIS LAWYERS? Craig did not register his work with a Justice Department unit tasked with enforcing FARA. Prosecutors said he resisted registering because he feared it would prevent him or others at the firm from getting federal jobs in the future, and because he believed doing so would have meant disclosing that a third party had paid more than $4 million for the report. Though prosecutors did not charge Craig with failing to register, they had said he gave misleading information when the Justice Department's FARA unit contacted the firm about the work and whether it required registration. In February 2012, prosecutors said, Craig emailed the co-author of the report, writing, \"I don't want to register as a foreign agent under FARA. I think we don't have to with this assignment, yes?\" Two months later, Craig emailed, \"I don't really care who you ask [about the FARA requirements] but we need an answer from someone who we can rely on with a straight face.\" On December 15, 2012, after the report's release, a lobbyist wrote to Craig that media coverage on the report was glowing: \"You are back in the headlines internationally. ... People in Kiev are very happy. You are 'THE MAN.'\" Prosecutors have argued that Craig lied about his interactions with New York Times reporter David Sanger, claiming that Crag told his partners at Skadden and officials at the FARA Unit that he did not reach out to Sanger. However, emails between the two men revealed at trial showed that Craig did contact Sanger about the report, even hand-delivering the report to Sanger's home before publication. \"He chose to conceal the facts and that was the crime,\" prosecutor Fernando Campoamor-Sanchez said of Craig during closing arguments.\"When the FARA Unit asked him questions, he concealed because at the end of the day, his reputation would have been tarnished.\" \"It's not a crime to work on a report, or even to get $4 million out of a bank account in Cyprus,\" Campoamor-Sanchez added. \"It is a crime to conceal. It is a crime to craft your answers so they don't even make sense. That is a crime.\" During the trial, Craig took the stand in his own defense, and said the report identified significant flaws with the handling of Tymoshenko’s case. That conclusion went against the interests of the Ukrainian government, which clearly wanted the trial to be depicted as fair in order to counter international criticism of the proceedings. Craig said he discussed the report’s findings with Western journalists, including from The New York Times, only because he was concerned the media would portray it in Ukraine’s favor. He testified that because his position was contrary to that of the Ukrainian government, he did not view himself as a foreign agent and did not think it necessary to register as one with the Justice Department. Defense attorney William Murphy, in closing arguments that lasted about two hours, maintained that Craig \"did not knowingly and willfully act to deceive\" the FARA Unit and allegations that his legal services crossed a line into foreign lobbying were untrue. \"Did he really have a motive to lie and impugn his own reputation?\" Murphy asked. \"He had no motive to lie and he didn't lie.\" Alex van der Zwaan, a former Craig associate at Skadden, pleaded guilty to lying to authorities and served a 30-day prison sentence last year. Craig also likely would have faced little prison time had he been convicted. CLICK TO GET THE FOX NEWS APP The Craig prosecution came amid an ongoing Justice Department crackdown on unregistered lobbying in the U.S. on behalf of foreign governments and other entities. The Mueller team relied on FARA to pursue top former Trump aides, including Michael Flynn and Manafort, even though FARA had rarely been enforced in the past. The FARA law, enacted in 1938 to unmask Nazi propaganda in the United States, requires people to disclose to the Justice Department when they advocate, lobby or perform public relations work in the U.S. on behalf of a foreign government or political entity. Craig, who is now retired, has represented a litany of powerful political figures in his decades-long legal career. He worked on President Bill Clinton's defense during impeachment proceedings, and also represented former U.N. Secretary General Kofi Annan, former North Carolina Sen. John Edwards and James Cartwright, a retired general and former vice chairman of the Joint Chiefs of Staff. Craig also served as an adviser to the late Sen. Edward Kennedy of Massachusetts and former Secretary of State Madeleine Albright. Fox News' Jake Gibson and The Associated Press contributed to this report.",
      "date": "September 4",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Barack Obama, Insurance Salesman",
      "url": "https://www.foxnews.com/politics/barack-obama-insurance-salesman",
      "subtitle": "Barack Obama, Insurance Salesman",
      "author": "Chris Stirewalt",
      "content": " President Obama wants you to buy health insurance. Like, a lot. The president has undertaken a months-long effort to convince people, particularly the Millennials who populate his political base, to give their business to America’s largest insurance companies. This sounds odd for a guy who used a populist pitchforking of “big insurance” to goose his health law over the finish line in 2010. But it’s not as odd as you might think. Obama built his law in private in conjunction with the same companies he was skewering in public. The same goes for the drug companies that were the preferred targets of Democrats for most of the pre-ObamaCare era. Why? Unable to unite his party behind his vision for a government-run insurance program open to all Americans, Obama outsourced the sales job to insurance and drug companies to get the deal done. His pitchfork routine was in part about gaining an upper hand in negotiations with his insurance and PhRMA  partners, but mostly about appeasing liberal lawmakers who were unhappy that Obama’s more liberal vision had vanished. They got Hillary Clinton’s health law even though they elected Obama. But it was insurance and drug lobbyists who did the hard work of squeezing moderates into the already unpopular plan. They sold what Obama could not. Now, it’s his turn. Polifact’s latest scorecard found that Obama has kept 45 percent of his campaign promises. But one promise on which he absolutely needs to deliver is the one to insurance and drug companies to send millions of young, healthy customers through their doors. Even with lots of free stuff to give away, it’s proving difficult. Republicans once worried a great deal about ObamaCare’s mandates, and perhaps one day the penalties under the law will be so great that people will be dragged into coverage. But for now, the problem with the law is more about people blowing off the mandate. [pullquote] This is understandable since the law actually provides a perverse discouragement from people buying insurance. The president, who sounds like their parents, is telling young people to take precautions and buy insurance, just in case. But his law has eliminated the “in case” part. Starting Tuesday, insurance companies can no longer deny anyone coverage. If you go your whole life without a policy and get diagnosed with a terrible ailment, you will still be able to purchase insurance, which kind of defeats the whole idea of insurance. What had been an exercise in risk tolerance now includes no risk at all. The solution was supposed to be that the federal government would force people to buy insurance, thereby evening out the waves in the risk pool. But, again, because the president couldn’t build a coalition for his law among Democrats, he ended up with a half-hearted mandate. The result is that people who didn’t want to buy insurance before have lost the risk formerly attendant to not buying coverage and it will only cost them $95 next year. And since every day brings some new, unhappy headline about the law – the IRS losing track of tens of millions of dollars in funds, more employers dumping workers or coverage, more unions demanding fixes, more worries about data security, more confusion about costs and coverage and always more news about higher and higher premiums – it may sound like a good idea to wait, enjoy the new mandatory coverage rules, pay the small fine out of your 2015 tax refund and see what happens. So, Obama is hitting the sales circuit, knocking on the doors of his supporters to ask that they check out the latest offerings from his partners at big insurance. And by the way, try some of these delicious new full-price pharmaceuticals. Guaranteed non-imported. It’s not as if Obama likely feels some deep desire to make good on his word to insurance companies and drug makers. There’s no commission arrangement. But what he does know is that if he can’t get enough of his supporters through the doors for his partners, premiums are going to rise even more than expected. And that means broad-based resistance to the law will grow and that means the chances for it eventually being entirely or substantially replaced grow, too. Like Ashton Kutcher and other early-adopting celebrities on Twitter, Obama has turned his onetime grassroots network into a sales platform for product placement and for steering fans into the grasp of marketers. Chris Stirewalt is digital politics editor for Fox News.  His Power Play column appears Tuesdays and Thursdays at FoxNews.com. Catch Chris live online weekdays at 11:30 am ET.  Read his “Fox News First” newsletter published each weekday morning. Sign up here.",
      "date": "September 26, 2013",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Book: Barack Obama asked woman to marry him before meeting Michelle",
      "url": "https://www.foxnews.com/politics/book-barack-obama-asked-woman-to-marry-him-before-meeting-michelle",
      "subtitle": "Book: Barack Obama asked woman to marry him before meeting Michelle",
      "author": "",
      "content": "Before Barack Obama ever met his wife, Michelle, at her Chicago law firm, the future 44th president of the United States asked another woman to marry him in 1986—while the two were visiting her parents' home, a new biography claims. “Rising Star,” which is written by David J. Garrow, was reviewed Tuesday in The Washington Post. The review said, \"Garrow portrays Obama as a man who ruthlessly compartmentalized his existence; who believed early on that he was fated for greatness; and who made emotional sacrifices in the pursuit of a goal that must have seemed unlikely to everyone but him.\" According to the review, Sheila Miyoshii Jager, his love interest, refused his advances at the time because her mother said she was too young. She was 23 and Obama was 25. The two continued to see each other, but Jager told Garrow that shortly after the proposal, Obama became more ambitious. “I remember very specifically that by 1987, about a year into our relationship, he already had his sights on becoming president,” she said, according to the book. She told Garrow that Obama’s “resolution of his black identity was directly linked to his decision to pursue a political career,” according to the review. Jager is of Dutch and Japanese ancestry. The review pointed out that Obama-- who was a community organizer at the time-- was eyeing a political run for mayor of Chicago or a U.S. Senator. The review pointed out another book that said at the time, it could be seen as a political liablity for a black politican in the area to have a wife that was not African-American. The review pointed out that Jager, now a professor at Oberlin College, was all but written out of Obama’s famous book “Dreams From My Father.” Obama went off to Harvard Law School and met Michelle Robinson at the Chicago law firm where she was employed, wrote Garrow, who received the Pulizter Prize for his biography of Martin Luther King, Jr. “Barack and Sheila had continued to see each other irregularly throughout the 1990-91 academic year, notwithstanding the deepening of Barack’s relationship with Michelle Robinson,” Garrow wrote, according to the review. “I always felt bad about it,” Jager reportedly said. Click for more from The Washington Post",
      "date": "May 3, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Obama appears to swipe at Trump during Mandela event",
      "url": "https://www.foxnews.com/politics/barack-obama-criticism-donald-trump",
      "subtitle": "Obama appears to swipe at Trump during Mandela event",
      "author": "Liam Quinn",
      "content": " Barack Obama appeared to critique his successor during a panel discussion marking the late Nelson Mandela’s birthday at Washington's Museum of African American History and Culture. In videos posted online of the discussion, Obama said: “Leaders who feed fear typically are also ones who avoid facts.” The comment was interpreted by many as a criticism of the current president, though Obama did not name Trump specifically. OBAMA STAYING ON THE SIDELINES AS BIDEN GETS READY TO LAUNCH 2020 CAMPAIGN “There is always a struggle between hope and fear -- between the world as it is, and how we’d like it to be,” Obama continued. “During times of tumult and disruption -- whether it’s technological, economic, information, migration -- the danger of us resorting to fear, to organize ourselves by falling back on tribe, race, ethnicity, sectarian lines, that always becomes stronger. “That’s been true in this country, you can actually track that when the economy is doing better, typically our politics is less divided. It gets more divided when people are feeling insecure and anxious. It’s true in South Africa, it’s true everywhere. The good news is that fear is typically the province of the old. And hope is the province of the young.” OBAMA TEAM DIDN'T DO 'ENOUGH' TO COMBAT RUSSIAN MEDDLING: DEMOCRATIC STRATEGIST Obama has avoided openly criticizing Trump since leaving office, with his most direct attack coming ahead of the 2018 midterms when he accused Trump of “capitalizing on resentment that politicians have been fanning for years.” \"It did not start with Donald Trump, he is a symptom, not the cause,” Obama told a group of students in Illinois, according to CNN. CLICK HERE TO GET THE FOX NEWS APP “He is just capitalizing on resentment that politicians have been fanning for years. A fear, an anger that is rooted in our past but is also borne in our enormous upheavals that have taken place in your brief lifetimes.”",
      "date": "April 29",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Clinton, Obama silent on Ed Buck donations after Dem megadonor's arrest",
      "url": "https://www.foxnews.com/politics/clinton-obama-silent-on-ed-buck-donations-after-dem-megadonors-sudden-arrest",
      "subtitle": "Clinton, Obama silent on Ed Buck donations after Dem megadonor's arrest",
      "author": "Gregg Re",
      "content": " Hillary Clinton and Barack Obama still aren't saying what they will do with money they received from Democratic megadonor Ed Buck, even after he was charged Tuesday with running a drug house where two men died of overdoses -- and months after other top Democrats have tossed aside Buck's contributions. Buck, 65, has donated more than $500,000 to a range of Democratic groups and politicians, including tens of thousands of dollars to California candidates such as Gov. Gavin Newsom. Buck is also well known in LGBTQ political circles. He came under investigation in January after 55-year-old Timothy Dean was found dead of an accidental methamphetamine overdose in his apartment. It was the second such death in two years, following the July 2017 death of Gemmel Moore, 26. The January episode prompted many Democrats to cut ties with Buck. The Democratic Congressional Campaign Committee (DCCC) told Fox News at the time it was \"deeply disturbed\" by Buck's alleged conduct, and quickly donated his thousands of dollars of contributions to the NALEO Education Fund. Other politicians also distanced themselves from Buck, and vowed to get rid of his campaign contributions. “I am deeply disturbed by the latest revelations of a second death by overdose at the home of Ed Buck,” California Democratic Rep. Ted Lieu said in January, announcing plans to donate more than $18,000 in contributions to civil rights charities. “I received a campaign contribution from Ed Buck and have donated the amount I received to a local charity, the Kenneth Young Center, to combat drug addiction,” Rep. Raja Krishnamoorthi of Illinois also said earlier this year. But former Secretary of State Hillary Clinton and former President Barack Obama remained quiet on the subject in January -- and their spokespeople on Wednesday didn't respond to Fox News' request for comment on what they would do with their donations from Buck. Buck donated at least $1,500 to Obama and $2,950 to Clinton, according to federal records. Obama has recently waded into the 2020 presidential race, and met this week with youth climate activist Greta Thunberg. 'DEEPLY DISTURBED': DEMS CUT TIES WITH BUCK AFTER BODIES KEEP PILING UP Even as Clinton and Obama stayed silent, The Los Angeles County Democratic Party praised Buck's arrest on Wednesday and said progressive activists deserved credit. \"For our community, a predator with a Jekyll and Hyde personality is now off the streets,\" the LACDP said. \"And it is due to the ongoing support and pressure from many activists and community groups including Black Lives Matter, Jasmyne Cannick and more.\" The LACDP told Fox News that they had not received money from Buck, and urged other Democrats to \"be conscientious\" on the matter. \"The LA Dems have not received money from Ed Buck in my tenure,\" LACPD Chair Mark J. González said in an email. \"Outside our County party, I would strongly encourage Democrats to be conscientious of the contributions they receive.\" Meanwhile, a black member of Congress on Wednesday called it \"incomprehensible\" that the wealthy gay activist has skirted punishment for so long. Rep. Karen Bass, D-Calif., on Wednesday specifically called Buck a predator and said authorities let him roam free even after two people died at his house. Prosecutors say Buck used his position of power to manipulate male victims into participating in sexual fetishes that involved injecting them with meth. In a motion Wednesday, prosecutors said Buck should be held on $4 million bail because he is a \"violent, dangerous sexual predator\" who offered drugs, money and shelter to mainly addicted and homeless men in exchange for participating in sexual fetishes, including a fetish that involved administering dangerous doses of drugs. Buck \"has no regard for human life,\" the motion said. Messages to Buck's attorney, Seymour Amster, were not returned. Buck's attorney had said Dean came to Buck's home under the influence and didn't ingest any drugs while there. In their bail motion, however, prosecutors specifically blamed Buck's actions for the two deaths and they alleged he personally gave a dangerous dose of methamphetamine to a man who survived an overdose earlier this month. On Sept. 11, the man returned and Buck injected him with two more dangerous doses, refused to help him and \"thwarted\" his efforts to get help until the man fled the apartment and called 911 from a gas station, prosecutors alleged. \"His deadly behavior has not stopped,\" prosecutors contended. CLICK HERE TO GET THE FOX NEWS APP Buck's \"predatory acts and willful disregard for human life must be stopped before another life is lost,\" their motion read. Fox News' Alex Pappas and The Associated Press contributed to this report.",
      "date": "September 18",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "2020 hopefuls defend their Obama-era criticisms",
      "url": "https://www.foxnews.com/politics/2020-hopefuls-defend-their-obama-era-criticisms",
      "subtitle": "2020 hopefuls defend their Obama-era criticisms",
      "author": "Fox News Staff",
      "content": " **Want FOX News Halftime Report in your inbox every day? Sign up here.**\n\nOn the roster: 2020 hopefuls defend their Obama-era criticisms - I’ll Tell You What: Massachusetts is one place I’ve seen - Senate passes bipartisan spending bill, avoids shutdown - Dems, DOJ reach agreement for Mueller evidence - Wanted: Eno the emu\n\n2020 HOPEFULS DEFEND THEIR OBAMA-ERA CRITICISMS \nPolitico: “Sens. Cory Booker and Kamala Harris on Thursday defended their criticisms of former Vice President Joe Biden at Wednesday night's Democratic primary debate, arguing that the presidency of former President Barack Obama, who remains wildly popular among Democrats, is not above criticism. … While there was virtually no criticism of Obama by name, attacks on his record were directed regularly at Biden… Booker argued that no politician, no matter how well-liked, should be above reproach. Asked in an interview on MSNBC’s ‘Morning Joe’ whether it ‘made sense’ for Democrats to be carping about Obama’s tenure instead of President Donald Trump, Booker insisted that the intra-party criticism should not be out of bounds. … [Harris’] criticisms of Obama were rooted more in her desire to replace the Affordable Care Act with a transition to a Medicare for All-style health care plan… [In] an interview on CNN’s ‘New Day,’ Booker framed his critiques as mere tough love, and had even more praise for the former president…”\n\nKraushaar: Democrats rebuke Obama’s legacy at their own peril - National Journal: “Any Democrat watching the last two nights of presidential debates would be struck by the absence of praise for the party’s most popular president in memory: Barack Obama. Aside from Joe Biden, none of the 20 candidates on the debate stage had many fond memories of the legacy of the man that no Democrats dared criticize during his eight years in office. That’s political malpractice. When President Obama has become too conservative for the Democratic Party is the day the Democratic Party has lost touch with mainstream America. And it’s why Biden, one of the few candidates to proudly tout his associations with the former president, came out on top Wednesday night. As former Obama Attorney General Eric Holder warned after the two-day debate extravaganza: ‘To my fellow Democrats. Be wary of attacking the Obama record.’ … That this needs to be explained is incredible.”\n\nEdward-Isaac Dovere: The Democratic primary is right back where it started - Atlantic: “There’s an elevated train [in Detroit], in the city’s downtown, called the People Mover. … It’s a lot like the Democratic primary, after two rounds of formal debate and seven months of campaigning. There have been flashes of dynamism in the campaign so far, candidates who’ve popped for a news cycle or two. But take a step back, and the race has barely changed since before the weather grew warm. Former Vice President Joe Biden is the front-runner in every poll, but he’s a weak front-runner… Senator Bernie Sanders of Vermont is holding on to his core voters, but he doesn’t seem to be expanding their ranks. Senator Elizabeth Warren of Massachusetts; Senator Kamala Harris of California; and South Bend, Indiana, Mayor Pete Buttigieg are always in the mix in third or fourth place. And then there’s everyone else… The only major change is that former Representative Beto O’Rourke of Texas, a onetime front-runner, is now firmly a part of the latter tier.”\n\nOn to the next debate - NYT: “The Democratic National Committee has set stricter criteria for the third set of debates, which will be held on Sept. 12 and Sept. 13 in Houston. If 10 or fewer candidates qualify, the debate will take place on only one night. Candidates will need to have 130,000 unique donors and register at least 2 percent support in four polls. They have until Aug. 28 to reach those benchmarks. These criteria could easily halve the field: The first two sets of debates included 20 of the 24 candidates, but a New York Times analysis of polls and donor numbers shows that only 10 to 12 candidates are likely to make the third round. Seven candidates have already met both qualification thresholds and are guaranteed a spot on stage. They are: Former Vice President Joseph R. Biden Jr., Senator Cory Booker … Mayor Pete Buttigieg … Senator Kamala Harris … Beto O’Rourke … Senator Bernie Sanders [and] Senator Elizabeth Warren…”\n\nTHE RULEBOOK: PREPAREDNESS IS KEY\n“No form of government can always either avoid or control [mortal feuds]. It is in vain to hope to guard against events too mighty for human foresight or precaution, and it would be idle to object to a government because it could not perform impossibilities.” – Alexander Hamilton, Federalist No. 16\n\nTIME OUT: LET THE MUSIC PLAY\nHistory: “On this day in 1981, MTV: Music Television goes on the air for the first time ever, with the words (spoken by one of MTV’s creators, John Lack): ‘Ladies and gentlemen, rock and roll.’ The Buggles’ ‘Video Killed the Radio Star’ was the first music video to air on the new cable television channel, which initially was available only to households in parts of New Jersey. MTV went on to revolutionize the music industry and become an influential source of pop culture and entertainment in the United States and other parts of the world, including Europe, Asia and Latin America, which all have MTV-branded channels. In MTV’s early days, its programming consisted of basic music videos that were introduced by VJs (video jockeys) and provided for free by record companies. As the record industry recognized MTV’s value as a promotional vehicle, money was invested in making creative, cutting-edge videos.”\n\nFlag on the play? - Email us at HALFTIMEREPORT@FOXNEWS.COM with your tips, comments or questions.\n\nSCOREBOARD\n\nTrump job performance\n\nAverage approval: 43.8 percent\nAverage disapproval: 52.2 percent\nNet Score: -8.4 points\nChange from one week ago: down 2.2 points \n[Average includes: Quinnipiac University: 40% approve - 54% disapprove; Fox News: 46% approve - 51% disapprove; NPR/PBS/Marist: 44% approve - 53% disapprove; NBC News/WSJ: 45% approve - 52% disapprove; Gallup: 44% approve - 51% disapprove.]\n\nWANT MORE HALFTIME REPORT? \nYou can join Chris and Brianna every day on Fox Nation. Go behind-the-scenes of your favorite political note as they go through the must-read headlines of the day right from their office – with plenty of personality. Click here to sign up and watch!\n\nI’LL TELL YOU WHAT: MASSACHUSETTS IS ONE PLACE I’VE SEEN\n\nWhile Chris Stirewalt is on vacation, Dana Perino is joined by a duo of Bay Staters, Mary Anne Marsh, former adviser to John Kerry and Colin Reed, former campaign manager for Senator Scott Brown and spokesperson for New Jersey Governor Chris Christie. They recap night one of the Democratic primary debates and preview what's to come in night two. Plus, some Massachusetts-centric trivia for Mary Anne and Colin. LISTEN AND SUBSCRIBE\n\nSENATE PASSES BIPARTISAN SPENDING BILL, AVOIDS SHUTDOWN\nFox News: “The Senate passed a budget and debt limit deal on Thursday that the Trump administration and leaders from both parties agreed to, but left hardline fiscal conservatives worried for the future. The legislation increases spending caps and suspends the debt ceiling, allowing for more government borrowing until July 31, 2021 – after the next presidential election. The measure, once signed by the president, would permit the government to resume borrowing to pay all its bills and would set an overall $1.37 trillion limit on agency budgets approved by Congress annually. It also would remove the prospect of a government shutdown in October and automatic spending cuts. … Many conservatives were torn between supporting the president and risking their political brand with an unpopular vote to add such a tremendous sum to the government’s credit card. Senate Majority Leader Mitch McConnell, R-Ky, supported the deal, along with other establishment leaders including Senate Minority Leader Chuck Schumer, D-N.Y., and House Minority Leader Rep. Kevin McCarthy, R-Calif.”\n\nSenate confirms 13 Trump judges before recess - The Hill: “The Senate confirmed 13 of President Trump's judicial picks this week, helping clear the deck ahead of the five-week August recess. The nominees were split up throughout the week with four confirmation votes taking place on Tuesday and nine on Wednesday, three of which were by voice votes. … Republicans have placed a premium on confirming Trump's judicial picks, arguing that they are the best shot at having a long-term impact on the direction of the country. … The confirmation of 13 nominees is down from the 19 judges Senate Republicans had planned to confirm before leaving Washington until September. The other judges are expected to get a vote once the Senate returns in September.”\n\nDEMS, DOJ REACH AGREEMENT FOR MUELLER EVIDENCE  \nPolitico: “House Democrats weighing the impeachment of President Donald Trump have agreed to a two-month schedule of court filings with the Justice Department in an effort to obtain special counsel Robert Mueller’s grand jury material. Democrats on the House Judiciary Committee, who say accessing Mueller’s files is necessary to determine whether they will ultimately recommend articles of impeachment against Trump, agreed to the timetable, which would likely result in an October ruling. Though that’s a reasonable pace for legal argumentation, it’s sure to frustrate Democrats agitating for Trump’s impeachment, who have argued that the closer their effort gets to presidential primary season, the more impractical it becomes. … Under the schedule, jointly proposed by the committee and Justice Department, department lawyers would file their first brief in the matter by Sept. 13 and the Judiciary Committee would reply by Sept. 30. Justice Department officials said they expected no oral argument would be necessary in the case, but it’s up to the judge — Chief U.S. District Court of the District of Columbia Judge Beryl Howell — to decide.”\n\nPLAY-BY-PLAY\nDOJ will not prosecute Comey for leaking memos after IG referral - Fox News\n\nKelly Craft confirmed to become next US ambassador to UN - AP\n\nCorey Lewandowski strongly considering run for Senate in New Hampshire - Fox News\n\nWhite House scrambling to find health care wins for Trump campaign - WaPo\n\nAUDIBLE: HOMEWARD BOUND \n“All of us want to get back to where there’s a lot of sanity. And that’s back home.” – Sen. Mike Rounds, R-S.D., talking about the upcoming August recess per Politico. \n\nShare your color commentary: Email us at HALFTIMEREPORT@FOXNEWS.COM and please make sure to include your name and hometown.\n\nWANTED: ENO THE EMU\nAP: “Officials in North Carolina are looking for an emu on the loose that was last spotted jumping on the hood of a car before running away. News outlets report that officials say the emu, nicknamed ‘Eno,’ was sighted over the weekend. Orange County Animal Services spokesperson Tenille Fox says it’s believed to be in the Hillsborough area. An Orange County government Twitter account posted an emu’s mugshot Friday with the word ‘wanted’ in red letters. Officials say it’s been on the run for about five weeks. They don’t know where the flightless bird escaped from. Fox says people shouldn’t try to catch it, but instead call animal services. Fox says owning emus is legal in Orange County. She says they’re often kept on farms and don’t usually run away.”\n\nAND NOW, A WORD FROM CHARLES…\n“Jews are news. It is an axiom of journalism. An indispensable axiom, too, because it is otherwise impossible to explain why the deeds and misdeeds of dot-on-the-map Israel get an absurdly disproportionate amount of news coverage around the world.” – Charles Krauthammer (1950-2018) writing for Time magazine on Feb. 26, 1990.\n\nBrianna McClelland contributed to this report. Want FOX News Halftime Report in your inbox every day? Sign up here.",
      "date": "August 1",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Julián Castro: Obama had 'compassion' for immigrants, Trump does not",
      "url": "https://www.foxnews.com/politics/julian-castro-obama-trump-immigrants",
      "subtitle": "Julián Castro: Obama had 'compassion' for immigrants, Trump does not",
      "author": "Sam Dorman",
      "content": " Julián Castro,  the Housing and Urban Development Secretary under former President Barack Obama, claimed on Thursday that the previous administration was compassionate toward immigrants -- unlike President Trump's White House. \"I will say the big difference, number one, I believe that Barack Obama actually had a concern and a compassion for these immigrants,\" Castro, a 2020 Democratic presidential candidate, told Fox News during a town hall event. He was responding to Fox News anchor Bret Baier's question about whether former Rep. Beto O'Rourke, D-Texas, a fellow 2020 hopeful, was right in criticizing Obama for deporting too many people during his administration. Castro responded by saying that while he was critical of some of Obama's actions, he saw big differences between that administration and Trump's. 2020 DEM JULIAN CASTRO CALLS FOR ILLEGAL IMMIGRATION TO BE TREATED AS CIVIL, NOT CRIMINAL, OFFENSE His comments came as the administration labeled the crisis at the border a \"full-blown emergency\" at the border. While Castro recognized there were problems at the border, he seemed to back away from the idea that the U.S. was facing a \"crisis.\" \"I think it's a crisis of leadership,\" Castro said when Baier asked about that description. \"I think the crisis that exists is driven by the conditions in countries like El Salvador, Honduras, and Guatemala -- and instead of making it better, this president is actually making it worse. CLICK HERE TO GET THE FOX NEWS APP Castro told Baier and Fox News host Martha MacCallum that he wanted to see Trump implement Obama's \"family case management program\" which he suggested would get more immigrants to return for asylum hearings. \"So I say, instead of treating people cruelly, instead of wasting money, instead of wondering where people are at, why don't we implement a smart, effective, and humane program like that family case management program?\" he asked.",
      "date": "June 13",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Trump says Obama 'hiding' from questions about Bidens and Ukraine: 'I think he knows all about it'",
      "url": "https://www.foxnews.com/politics/trump-judge-jeanine-impeachment-ukraine-obama",
      "subtitle": "Trump says Obama 'hiding' from questions about Bidens and Ukraine: 'I think he knows all about it'",
      "author": "Melissa Leon",
      "content": " Former President Barack Obama has been hiding from questions about former Vice President Joe Biden, his son Hunter and Hunter's work for a gas company in Ukraine, President Trump insisted Saturday night. \"I think he knows all about it,\" Trump said of Obama during an exclusive interview on Fox News' \"Justice with Judge Jeanine.\" Trump once against defended his July 25 phone call with Ukrainian President Volodymyr Zelensky, which has served as the catalyst for an impeachment inquiry led by House Democrats, notably House Intelligence Committee Chairman Adam Schiff, D-Calif. \"If you take a look at it, Adam Schiff made up a phony, fraudulent statement,\" Trump told host Jeanine Pirro, referring to Schiff's self-described \"parody\" account of the phone call during a hearing last month. \"My phone call was a perfect call -- congenial, friendly, no pressure, no blackmail, as he [Zelensky] said.\" TRUMP BELITTLES BIDENS WITH GRAPHIC LANGUAGE AT MINNEAPOLIS RALLY, AS CHAOS UNFOLDS OUTSIDE ARENA What Schiff did was \"horrible,\" and he \"made it up out of thin air,\" the president continued. \"Very strong action should be taken against this guy.\" Trump also called \"Shifty Schiff\" a \"failed screenwriter\" for producing a \"phony, fraudulent statement.\" Democrats have subpoenaed several Trump administration officials and diplomats for documents as lawmakers probe issues surrounding the phone call. House Democrats have accused Trump of violating his oath of office by asked him to investigate Ukraine's involvement in the 2016 presidential election and the activities of Biden, a top contender for the 2020 Democratic presidential nomination, and his son Hunter, a former board member of gas company Burisma Holdings. They have also accused Trump of withholding military aid from Ukraine until Zelensky's government could launch the investigations. The impeachment probe was launched last month after an intelligence community whistleblower's complaint raised concerns about the call. On Saturday, Trump again referred to the impeachment inquiry as a \"hoax\" and \"so bad for our country,\" adding that he released a memorandum of the conversation with Zelensky to show it was a \"perfectly fine call.\" When Pirro asked why House Speaker Nancy Pelosi, D-Calif., wasn't calling for a formal vote to open an impeachment inquiry, Trump said it was because she \"can't get the votes because we're [the GOP] doing so well right now.\" Trump held two rallies in as many days this week, and both drew such large crowds that they could have sold both out many times over, he said. \"We're winning and we're winning big,\" Trump said. \"That's why I think they want to stay away. If you look at what's happening, the electricity for the Republican Party, they're so angry at what's taken place.\" Trump also expressed confidence in his attorney, Rudy Giuliani, despite the arrest this week of two associates of the former New York City mayor on campaign finance charges. CLICK HERE FOR THE FOX NEWS APP \"He's a great gentleman. He was a great mayor, one of the greatest, maybe the greatest mayor in the history of New York,\" the president said. \"He was a fantastic prosecutor. I know nothing about him being under investigation ... I can't imagine it.\" \"He's a man that looks for corruption and whatever he does I really believe he's a totally, I mean, I know he's an honorable man,\" Trump added.",
      "date": "October 12",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Rev. Jesse Lee Peterson:  'Black Americans got worse under Barack Obama'",
      "url": "https://www.foxnews.com/politics/rev-jesse-lee-peterson-black-americans-got-worse-under-barack-obama",
      "subtitle": "Rev. Jesse Lee Peterson:  'Black Americans got worse under Barack Obama'",
      "author": "",
      "content": "Author and activist Jesse Lee Peterson told Fox News' \"Tucker Carlson Tonight\" Monday that black Americans were hurt the most by former President Barack Obama's policies. \"Black Americans got worse under Barack Obama than any other time in the history of America,\" Peterson, an author and founder of the BOND organization, told host Tucker Carlson. \"If it was a race issue, why didn’t they get better [when] we had a black president?\" MSNBC CONRIBUTOR SAYS 'FEARS OF BROWN PEOPLE' MOTIVATED TRUMP VOTERS Peterson was responding to comments by MSNBC contributor Joan Walsh, who claimed over the weekend that Trump voters were driven by \"fears of brown people, fears of losing the majority.\" Peterson claimed that \"most black Americans are not suffering due to racism, but the destruction of the family, and the lack of moral character. \"If we dealt with the family issue and the lack of moral character, black Americans’ lives would change overnight,\" Peterson added. \"And they don't want that.\"",
      "date": "July 3, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Obama reportedly told Biden he didn't have to run in 2020",
      "url": "https://www.foxnews.com/politics/obama-biden-warned-2020-run-dont-do-this",
      "subtitle": "Obama reportedly told Biden he didn't have to run in 2020",
      "author": "Sam Dorman",
      "content": " Former President Barack Obama, discussing Joe Biden's run for the high office in 2020, reportedly told his vice president that he didn't \"have to do this.\" “You don’t have to do this, Joe, you really don’t,” Obama told Biden early in 2019, according to The New York Times. The Times reported that Obama \"took pains to cast his doubts about the campaign in personal terms.\" Biden, who leads President Trump in several polls on 2020 matchups, said he couldn't forgive himself if he passed up the opportunity to beat Trump. He initially thought he could beat Trump in 2016, but Obama reportedly pushed back because, in part, he thought former Secretary of State Hillary Clinton would be more effective in continuing his legacy, according to the report. Speculation has swirled over the decision by Obama to so far refrain from endorsing Biden formally. Still, despite Obama's early hesitation, he has taken a much more involved role in Biden's campaign than in that of other candidates', The Times reported. GAFFE-PRONE BIDEN SHOULDN'T BE CLOISTERED, OBAMA AIDE SAYS: 'HE EITHER CAN CUT IT OR HE CAN'T' Biden has also invoked Obama, America's first black president, while defending himself against racism accusations on the campaign trail. But he has for years faced scrutiny over his views on race. In January of 2007, he famously said that Obama was “the first mainstream African-American who is articulate and bright and clean and a nice-looking guy.” Obama laughed the remark off, according to The Times. Despite Obama's widespread popularity among Democrats, the former president appeared to become somewhat of a liability for his friend. CLICK HERE TO GET THE FOX NEWS APP During the second round of primary debates, Biden faced criticism over the number of deportations under the Obama administration. The Affordable Care Act, Obama's signature legislative achievement, also came under fire from candidates who said it had fallen short. While Obama has stayed relatively quiet during the 2020 race, some of his former officials have cautioned against using the former administration to attack Biden during the primaries.",
      "date": "August 16",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Trump blames Obama administration for bad White House air conditioning",
      "url": "https://www.foxnews.com/politics/trump-blames-obama-administration-white-house-air-conditioning",
      "subtitle": "Trump blames Obama administration for bad White House air conditioning",
      "author": "Adam Shaw",
      "content": " President Trump has blamed predecessor Barack Obama for a litany of issues, from the Iran nuclear deal to the crisis at the border, and on Friday he added the alleged poor state of air conditioning in the White House to that list. Trump made the remarks to reporters in the Oval Office, when discussing how he was going to his residence in Bedminster, N.J. in August. He said that such trips aren’t a vacation and that presidential away days are often used for maintenance on the White House. TRUMP SLAMS 'BRUTAL BULLY' ELIJAH CUMMINGS, CLAIMS BALTIMORE DISTRICT IS 'MORE DANGEROUS' THAN BORDER “I'd rather be right here,” he said, before adding that “a lot of times you go and they do a lot of work in the White House.” “For instance, the Obama administration worked out a brand new air conditioning system for the West Wing and it was so good before they did the system,” he said. “Now that they did this system it's freezing or hot in here,” he complained It’s common for presidents to blame their predecessors for problems plaguing the country, but this might be the first time the climate in the White House has been brought up by a presidential successor. Trump mentioned Obama a few times during the lengthy back-and-forth with reporters. He said that now the U.S. has “a much better economy than in his wildest dreams.” CLICK HERE TO GET THE FOX NEWS APP In relation to the Russia investigation and this week’s hearing involving former FBI Special Counsel Robert Mueller, he mentioned Obama’s book deal as something investigators should look into in response to what he called Democrats’ “fishing.” “It's a disgrace. We want to find out what happened with the last Democrat president. Let's look into Obama the way they've looked at me from day one,” he said. “They've looked into everything that we've done.” “They could look into the book deal that President Obama made. Let's subpoena all of his records,” he said. The Associated Press contributed to this report.",
      "date": "July 27",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Dems who praised Obama for troop withdrawal now highly critical of Trump",
      "url": "https://www.foxnews.com/politics/dems-who-praised-obama-for-troop-withdrawal-now-highly-critical-of-trump",
      "subtitle": "Dems who praised Obama for troop withdrawal now highly critical of Trump",
      "author": "Ronn Blitzer",
      "content": " President Trump has met resistance from both parties after his decision to withdraw troops from northern Syria, but some of the rhetoric coming from Democrats is almost the opposite of what came from party members when President Barack Obama pulled forces out of Iraq. California Democrats Rep. Maxine Waters and House Speaker Nancy Pelosi, for example, have been vocal opponents of Trump's troop withdrawal, after supporting Obama's efforts almost exactly eight years later. ERDOGAN THREW TRUMP'S 'DON'T BE A FOOL' LETTER IN THE TRASH, SOURCES CLAIM “As the war in Iraq draws to a close, it is my hope that this conflict will serve as a solemn reminder of the costs of war,” Waters said in a statement issued Oct. 21, 2011. “We must carefully reexamine our approach to national security and how we view the United States' role in promoting international peace and security.  If we are to remain leaders in the world, we must always use our best judgment to determine when and how we engage other nations and other actors – particularly if we are considering the use of military force.” Waters’ approach to the United States’ role in world affairs is similar to Trump’s recent warnings against “fighting other people’s wars.” Cut to Oct. 7, 2019, and Waters blasted Trump for leaving Kurdish forces to fend for themselves against Turkish attacks. “If the United States abandons the Kurds, these courageous allies will never trust us again,” Waters said in a statement, adding that “Trump’s betrayal of the Kurds is a gift to Russia, Iran and ISIS.” That same day, Pelosi came out against Trump, warning that leaving northern Syria could lead to an ISIS resurgence. DEMS STORM OUT OF SYRIA MEETING WITH TRUMP: 'WE HAVE TO PRAY FOR HIS HEALTH' “This reckless, misguided decision undermines the efforts by our brave servicemembers and our allies to end ISIS’s tyranny,” she said. But while Republicans had similar concerns about withdrawing from Iraq in 2011, Pelosi praised Obama “for a promise made and a promise kept, honoring the U.S.-Iraq Security Agreement and the wishes of the American people to bring all our troops home by the end this year.” Pelosi stormed out of a meeting with Trump Wednesday after what she said was a \"meltdown\" by the president. One of the Democratic frontrunners for the 2020 presidential nomination, Sen. Bernie Sanders, I-Vt., was also critical of Trump, despite being historically anti-war. “You don’t turn your back on an ally that lost 11,000 troops fighting against terrorism through a tweet and a discussion with Erdogan,” Sanders told ABC’s George Stephanopoulos. This criticism came despite Sanders acknowledgment that “I am a strong opponent of endless wars.” That position was made evident in 2011 when Sanders backed Obama’s Iraq withdrawal. “I applaud the president's decision and have been advocating that position for quite a while,” adding, “Now is the time to bring our troops home, lower our military budget, and use those funds to create jobs by rebuilding our infrastructure and lowering our national debt.\" On Thursday, Trump vented about Democratic criticism. \"I am the only person who can fight for the safety of our troops & bring them home from the ridiculous & costly Endless Wars, and be scorned. Democrats always liked that position, until I took it,\" he said. Republicans have been equally critical of Trump, with 129 GOP members voting for a resolution in opposition to the withdrawal, joining a unanimous Democratic contingent. Sen. Lindsey Graham has been particularly vocal, leading Trump to accuse the senator of wanting to “stay in the Middle East for the next 1,000 years.” CLICK HERE TO GET THE FOX NEWS APP Graham, however, was no supporter of Obama, and lumped Trump and his predecessor together in making what he believes to be critical foreign policy errors. “President Trump is being told EXACTLY what President Obama was told before he withdrew from Iraq,” Graham tweeted Wednesday. “He appears to be hell-bent on making the same mistakes in Syria as President Obama made in Iraq.”",
      "date": "October 17",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Jan Brewer slams media ‘hypocrites’ for praising Pelosi finger-pointing, scolding her for pointing at Obama",
      "url": "https://www.foxnews.com/politics/jan-brewer-slams-media-hypocrites-for-praising-pelosi-finger-pointing-after-scolding-her-for-doing-the-same-to-obama",
      "subtitle": "Jan Brewer slams media ‘hypocrites’ for praising Pelosi finger-pointing, scolding her for pointing at Obama",
      "author": "Adam Shaw",
      "content": " Former Arizona Gov. Jan Brewer on Thursday took aim at “hypocrites” in the media who she says have branded House Speaker Nancy Pelosi a hero for pointing her finger at President Trump -- despite calling Brewer a racist for doing something similar to former President Obama. \"The news media hails @SpeakerPelosi as a hero for pointing her finger at @POTUS @realDonaldTrump but when I stood up to @BarackObama I was vilified as rude and racist,\" she tweeted. Trump on Wednesday tweeted a picture of the contentious White House meeting on Syria, showing Pelosi, D-Calif., pointing her finger at him as they argued back-and-forth. Democrats eventually stormed out of the meeting, accusing Trump of having called the speaker a “third-rate politician.” “Nervous Nancy’s unhinged meltdown!” he tweeted with the photo. But Pelosi soon made it her Twitter banner, and it was quickly hailed by some in the media as a win for the speaker. “Trump’s Nancy Pelosi ‘meltdown’ tweet was the perfect self-own. Here’s why,” declared one NBC News opinion piece. “The White House’s photo clearly shows that the last man standing in that room is, in fact, Nancy Pelosi,” it gushed. Brewer contrasted it with the media’s treatment of her when she “stood up to [Obama.]” She was referring to a tense 2012 tarmac meeting between her and the then-president. According to Brewer, the president had objected to her portrayal of him as dismissive and patronizing in her book, \"Scorpions for Breakfast.\" The cameras caught her waving her finger at Obama, something for which she received a flood of criticism. A New York Times op-ed, for instance, accused Brewer of treating the president “as if he were some errand boy and not the commander-in-chief.” The Washington Free Beacon on Friday published a video called \"A Tale of Two Fingers,\" contrasting the treatment of Brewer and Pelosi, showing anchors and commentating praising the \"iconic\" photo of Pelosi \"standing in a room full of men,\" before contrasting that with media voices complaining about Brewer's \"incredibly disrespectful\" treatment of Obama. “I was vilified as rude and racist. Such Hypocrites!” Brewer said.",
      "date": "October 18",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Biden defends son, downplays lack of Obama endorsement in tough ’60 Minutes’ interview",
      "url": "https://www.foxnews.com/politics/in-tough-60-minutes-interview-biden-defends-son-downplays-lack-of-obama-endorsement",
      "subtitle": "Biden defends son, downplays lack of Obama endorsement in tough ’60 Minutes’ interview",
      "author": "Paul Steinhauser",
      "content": " Joe Biden insisted he’s still the front-runner in the Democratic presidential nomination race, downplayed the lack of an endorsement by former President Barack Obama, defended his son’s actions in Ukraine, and called President Trump an “idiot,” as he faced tough questions during an interview broadcast Sunday night on \"60 Minutes.\" The former vice president – who was the unrivaled front-runner from even before he announced his candidacy in late April – is now tied with Sen. Elizabeth Warren of Massachusetts at the top of many national and early voting state polls. BIDEN SUPER PAC REVERSAL COMES AMID FUNDRAISING STRUGGLE Biden said he still considers himself the leader in the race for the nomination, emphasizing, “I know I'm the front-runner. Find me a national poll with a notable — a couple exceptions (sic). But look, this is a marathon.\" Yet Biden has been underperforming when it comes to another key metric — fundraising. He raised just $15.2 million during the July-September quarter, far behind top-tier rivals Warren and Sen. Bernie Sanders of Vermont. And as of Oct. 1, he had just $9 million cash-on-hand, far behind Sanders – who had nearly $34 million in the bank – and Warren, who had $26 million in her campaign coffers. Asked by CBS' Nora O’Donnell how he can compete against that, the former vice president answered, \"I just flat beat them,” as he laughed. “We're on a course to do extremely well,” he insisted. “I’m not worried about being able to fund this campaign. I really am not, truly.\" Biden was also pressed on the lack of endorsement from Obama, his boss for eight years in the White House. \"I want to earn this on my own,\" he stressed. But asked if the former president offered to back him, Biden said, “No, we didn't even get there. I asked him not to. He said, ‘OK.’” Biden added: “I think it's better — I think he thinks it's better for me. I have no doubt when I'm the nominee he'll be out on the campaign trail for me.\" THE LATEST FROM FOX NEWS ON THE 2020 PRESIDENTIAL CAMPAIGN The former vice president took aim at Trump over the president’s repeated comments that Russian interference in U.S. elections is a hoax. \"He's an idiot, in terms of sayin' that. Everybody knows this. Everybody knows it. Nobody doubts it,” Biden highlighted. And asked how he would respond to Trump’s accusation that “Joe Biden and his son are stone-cold corrupt,” Biden said, “Let's see how straight you are, OK old buddy? I put out 21 years of mine. So show us your tax returns ... what are you hidin'? You want to deal with corruption? Start to act like it. Release your tax returns or shut up.\" As the president faces an impeachment inquiry in the House of Representatives and as support for impeaching and removing the president increases, Trump and his allies have repeatedly tried to put the spotlight on the Bidens. Hunter Biden served on the board of a Ukrainian energy company while his father was vice president. Trump and fellow Republicans have questioned how Biden pushed in 2016 for the dismissal of a Ukrainian prosecutor who was looking into corruption at the company. The prosecutor – who had been widely accused by both Democrats and Republicans of overlooking corruption in his own office – was later dismissed. Pressed by O’Donnell on whether he considered the optics of his son working for the Ukrainian company during his years in the White House, Biden contended that Hunter was already on the board when he took office. Biden has said repeatedly that the only thing he asked his son about regarding sitting on the board of the company was, \"I hope you know what you're doing.\" Asked what he meant by that, Biden answered, “What I meant by that is I hope you've thought this through.” \"I hope you know exactly what you're doing here. That's all I meant. Nothing more than that, because I've never discussed my business or their business, my sons' or daughter's. And I've never discussed them because they know where I have to do my job and that's it and they have to make their own judgments,” he explained. And Biden took aim at Trump’s daughter Ivanka and son-in-law Jared Kushner,  who serve as top advisers in the administration. Biden vowed that he if gets “elected president, my children are not going to have offices in the White House. My children are not going to sit in on Cabinet meetings. ... It's just simply improper because you should make it clear to the American public that everything you're doing is for them. For them. And the idea that you’re going to have his children his — son-in-law, etcetera, engaged in the day-to-day operation of things they know nothing about.” TRUMP CAMPAIGN RETURNS FIRE AFTER BIDEN '60 MINUTES' INTERVIEW Trump’s reelection campaign defended Ivanka and Jared and took aim at Hunter Biden, saying, “Hunter Biden would never have an office in the White House because he’s proven that his only qualification is being the son of Joe Biden.”",
      "date": "October 28",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Obama takes veiled shot at Warren and Sanders, warns 2020 Dems Americans don’t want to ‘tear down the system’",
      "url": "https://www.foxnews.com/politics/obama-warns-2020-democrats-warren-sanders",
      "subtitle": "Obama takes veiled shot at Warren and Sanders, warns 2020 Dems Americans don’t want to ‘tear down the system’",
      "author": "Adam Shaw",
      "content": " Former President Barack Obama on Friday warned 2020 Democratic presidential hopefuls to pay attention to what voters actually think -- warning that most of them don’t want to “tear down the system.” “The average American doesn't think we have to completely tear down the system and remake it. And I think it's important for us not to lose sight of that,” Obama said. OBAMA SOUNDS OFF ON CANCEL CULTURE, 'WOKE' PURITY: 'THAT'S NOT ACTIVISM' “There are a lot of persuadable voters and there are a lot of Democrats out there who just want to see things make sense. They just don't want to see crazy stuff,\" he said. \"They want to see things a little more fair, they want to see things a little more just. And how we approach that I think will be important.” The two-term Democratic president made the remarks at a gathering of the Democracy Alliance, a group of wealthy Democratic donors. He was interviewed by Stacey Abrams, who lost Georgia’s gubernatorial race last year. Obama has largely stayed on the sidelines on the 2020 Democratic primary, and has not yet backed a candidate -- even as former Vice President Joe Biden has invoked his name on numerous occasions. But Obama has made remarks indicating he is nervous about the drift to the extreme left on a number of issues by parts of the Democratic Party. On Friday, he did not mention any candidates by name, but did cite immigration and health care reform as examples of where Democrats may be out of sync with the broader electorate. Sens. Bernie Sanders, I-Vt., and Elizabeth Warren, D-Mass., who have both released plans on immigration and “Medicare-for-all” respectively in recent weeks. Warren’s government-led overhaul of the health care system would eventually abolish private insurance and cost $52 trillion, while Sanders’ immigration plan includes radical policies including welfare for illegal immigrants and a moratorium on all deportations. SANDERS' IMMIGRATION PLAN: HALT DEPORTATIONS, ABOLISH ICE, WELCOME 50K 'CLIMATE MIGRANTS,' GIVE WELFARE TO ALL “Even as we push the envelope and we are bold in our vision, we also have to be rooted in reality and the fact that voters, including the Democratic voters and certainly persuadable independents or even moderate Republicans, are not driven by the same views that are reflected on certain, you know, left-leaning Twitter feeds,” Obama said. The comment about Twitter feeds echoes remarks he made last month, when the former president took a swipe at “woke” virtue signalling and cancel culture, telling a Chicago audience to “get over” their obsessions with ideological purity tests. CLICK HERE FOR THE FOX NEWS APP “This idea of purity and you're never compromised and you're always politically woke, and all that stuff, you should get over that quickly,\" Obama said. “The world is messy. There are ambiguities. People who do really good stuff have flaws. People who you are fighting may love their kids, and share certain things with you.” Fox News' Ronn Blitzer and The Associated Press contributed to this report.",
      "date": "November 16",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Illinois governor signs law to honor Barack Obama's birthday",
      "url": "https://www.foxnews.com/politics/illinois-governor-signs-law-to-honor-barack-obamas-birthday",
      "subtitle": "Illinois governor signs law to honor Barack Obama's birthday",
      "author": "",
      "content": "CHICAGO  – The home state of former President Barack Obama will commemorate his birthday under a new law. Illinois Gov. Bruce Rauner has signed a plan honoring the 44th president's birthday on Aug. 4. It won't be an official state holiday, rather a day to honor Obama. The law notes Obama's efforts to protect Americans' rights and build \"bridges across communities.\" Obama began his political career in the Illinois Senate in 1997. He served there until his election to the U.S. Senate in 2004. The measure takes effect next year. It received overwhelming support in the Democrat-led Legislature. The Republican governor signed it Friday. The proposal came after the Illinois House narrowly rejected a plan to make Obama's birthday a state holiday amid concerns of giving state employees in cash-strapped Illinois another paid day off.",
      "date": "August 7, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Ex-Obama campaign staffer mounts second primary challenge to Rep. Carolyn Maloney",
      "url": "https://www.foxnews.com/politics/suraj-patel-carolyn-maloney-primary-2020-house-races-democrat",
      "subtitle": "Ex-Obama campaign staffer mounts second primary challenge to Rep. Carolyn Maloney",
      "author": "Vandana Rambaran",
      "content": " A former campaign staffer for Barack Obama announced Wednesday that he will mount a second primary challenge to long-serving New York Democratic congresswoman Carolyn Maloney in 2020. Suraj Patel, a 35-year-old attorney and business ethics professor at New York University, unveiled his bid to represent New York's 12th Congressional District with a focus on progressive ideals such as the Green New Deal, affordable housing, \"Medicare-for-all,\" ending mass incarceration and legalizing marijuana. MALONEY: OUR SYSTEM OF GOVERNMENT WAS FOUNDED ON CHECKS AND BALANCES AND HOLDING EVERYONE ACCOUNTABLE Patel, who received 40 percent of the vote when he ran against Maloney in 2018, released a campaign video in three different languages in which he promised to tackle New York City's woes, including the deteriorating subway system and homelessness. “When I was 5 years old, I can remember my dad coming home after working the night shift fixing these tracks,” Patel says in the opening of the ad. “And he jokes to me, ‘They’re pretty much in the same condition.’” Maloney was first elected to Congress in 1992. She has represented the 12th District, which covers parts of Manhattan, Brooklyn and Queens as well as Roosevelt Island, since 2013 following a redistricting. \"Simply holding a job doesn't entitle you to keep it,\" Patel says in the ad. \"You've got to deliver.\" CLICK HERE FOR THE FOX NEWS APP Patel is the fourth candidate to announce a 2020 primary bid against Maloney. The other candidates include stand-up comedian Lauren Ashcraft, attorney Erica Vladimer, and housing advocate Peter Harrison. Unseating Maloney would bear a striking resemblance to the upset primary victory pulled off by Rep. Alexandria Ocasio-Cortez, who defeated ten-term incumbent Joe Crowley in June 2018.",
      "date": "September 18",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Ex-President Barack Obama shows up in Chicago for jury duty",
      "url": "https://www.foxnews.com/politics/ex-president-barack-obama-shows-up-in-chicago-for-jury-duty",
      "subtitle": "Ex-President Barack Obama shows up in Chicago for jury duty",
      "author": "",
      "content": "CHICAGO— Former President Barack Obama, free of a job that forced him to move to Washington for eight years, showed up to a downtown Chicago courthouse for jury duty on Wednesday morning. The 44th president’s motorcade — considerably shorter than the one he had when he lived in the White House — left his home in the Kenwood neighborhood on the city’s South Side and arrived at the Richard J. Daley Center shortly after 10 a.m. Obama — wearing a dark sport coat, dress shirt, but without a tie — waved to people who gathered outside after hearing reports that he would be reporting for jury duty. Whether he will be selected to sit on a jury, and presumably be selected jury foreman, was not known. But if he is like other would-be jurors, Obama will have to watch a decades-old video in which a much younger Lester Holt, who was a local news anchor before he became a national news anchor, explains the ins-and-outs of jury duty. Obama is also in line to receive the $17.20 a day that jurors are paid for performing their civic duty. Obama is the highest-ranking former public official to be called to jury duty in Chicago, and almost certainly the only one who ever arrived with a Secret Service detail. But he is not the first former president to be called to jury duty. In 2015, former President George W. Bush answered the jury duty call in Dallas. He was not selected to sit on a jury. And in 2003, former President Bill Clinton reported for jury duty in federal court in New York City. He also was not selected. Nor is he the first famous Chicagoan to be called to jury duty. In 2004, Oprah Winfrey was on a Chicago jury that convicted a man of murder. A decade later, Lawrence Tureaud, better known as Mr. T, showed up to a suburban Chicago courthouse for jury duty, sporting his usual Mohawk, but without the gold chains for which he is known. But despite the more subdued outfit, Mr. T was not chosen to sit on a jury.",
      "date": "November 8, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Left turns on Obama for challenging calls to ‘tear down the system’",
      "url": "https://www.foxnews.com/politics/left-turns-on-obama-for-challenging-calls-to-tear-down-the-system",
      "subtitle": "Left turns on Obama for challenging calls to ‘tear down the system’",
      "author": "Ronn Blitzer",
      "content": " Former President Barack Obama is facing a new wave of criticism from the Democratic Party's left flank after cautioning Democrats about going too radical with their policy proposals — in the latest sign of a growing rift between the popular 44th president and the party's activist base. Obama on Friday warned 2020 Democratic presidential hopefuls to pay attention to what voters actually think, claiming at a gathering of Democratic donors that most of them don’t want to “tear down the system” and that many Democrats “just don’t want to see crazy stuff.” Members of his party soon turned on him, using the hashtag #TooFarLeft. OBAMA SOUNDS OFF ON CANCEL CULTURE, ‘WOKE’ PURITY: ‘THAT’S NOT ACTIVISM’ “I’m #TooFarLeft because I want kids to be safe in school. I’m #TooFarLeft because I want people to live in dignity. I’m #TooFarLeft because I seek justice and equality. I’m #TooFarLeft because I think healthcare and housing are human rights,” tweeted former Hillary Clinton adviser Peter Daou, who started the hashtag. Daou clarified Sunday evening that the slogan \"isn't primarily about Obama for me, though he was the catalyst for the tag.\" It quickly went viral, used by other liberal Democrats such as Minnesota Rep. Ilhan Omar. Celebrities weighed in as well. Former “Two and a Half Men” star Jon Cryer claimed a \"far left\" position is necessary to counter an existential threat to humanity. “I am #TooFarLeft because I believe that we cannot let greed cause the collapse of the ecosystem that supports all human life on earth,” he tweeted. This is not the first time Obama has taken a stance against the leftward drift of the party or been on the receiving end of criticism for allegedly being too moderate. During a discussion at the Obama Foundation Summit held at the Illinois Institute of Technology in October, Obama explained that the world is more complicated than people realize and urged politically active Americans to be practical if they want to be effective. “This idea of purity and you're never compromised and you're always politically woke, and all that stuff, you should get over that quickly,\" Obama said. CLICK HERE TO GET THE FOX NEWS APP Several Democratic presidential candidates have taken veiled shots at Obama’s administration this year while targeting his former vice president, Joe Biden — especially regarding health care and immigration. Over the summer, before he dropped out of the race, New York City Mayor Bill De Blasio said Biden should “absolutely” answer for the Obama administration’s deportation record. Fox News' Adam Shaw contributed to this report.",
      "date": "November 18",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Obama sounds off on cancel culture, 'woke' purity: 'That's not activism'",
      "url": "https://www.foxnews.com/politics/obama-sounds-off-on-cancel-culture-woke-purity-thats-not-activism",
      "subtitle": "Obama sounds off on cancel culture, 'woke' purity: 'That's not activism'",
      "author": "Ronn Blitzer",
      "content": " Former President Barack Obama took aim Tuesday at “woke” virtue signaling and cancel culture, telling an audience in Chicago that activists “should get over” their obsession with ideological purity tests. During a discussion at the Obama Foundation Summit held at the Illinois Institute of Technology, the 44th president explained that the world is more complicated than people realize and urged politically active Americans to be practical if they want to be effective. MICHELLE OBAMA SAYS THERE'S 'ZERO CHANCE' SHE'LL RUN FOR PRESIDENT: 'IT'S JUST NOT FOR ME' “This idea of purity and you're never compromised and you're always politically woke, and all that stuff, you should get over that quickly,\" Obama said. “The world is messy. There are ambiguities. People who do really good stuff have flaws. People who you are fighting may love their kids, and share certain things with you.” The blunt remarks were essentially an expanded version of a saying Obama often employed while in office -- don't let the perfect be the enemy of the good. The comments Tuesday show the ex-president embracing the image of a practical elder statesman at a time when his party is drifting ever-leftward -- essentially urging young party activists to reconsider a culture of calling out those who run afoul of their worldview, whether in the language they use or the policies they espouse. Obama specifically noted that a trend he sees on college campuses could do more harm than good, suggesting young people are focusing more on casting judgment on others than advancing positive change. “One danger I see among young people, particularly on college campuses,” he continued, “I do get a sense sometimes now among certain young people -- and this is accelerated by social media – there is this sense sometimes of the way of me making change is to be as judgmental as possible about other people, and that’s enough. Like, if I tweet or hashtag about how you didn’t do something right or use the wrong verb, then I can feel pretty good about myself, ‘cause man did you see how woke I was? I called you out.' “That’s not activism. That’s not bringing about change. If all you’re doing is casting stones, you’re probably not going to get that far. That’s easy to do.” Former first lady Michelle Obama also spoke at the event, discussing racism and discrimination. CLICK HERE TO GET THE FOX NEWS APP “I can’t make people not afraid of black people,” she said, according to The Hill. “I don’t know what’s going on. I can’t explain what’s happening in your head. “But maybe if I show up every day as a human, a good human, doing wonderful things, loving my family, loving our kids, taking care of things that I care about — maybe, just maybe that work will pick away at the scabs of our discrimination. Maybe that will slowly unravel it.” Fox News’ Dom Calicchio contributed to this report.",
      "date": "October 30",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Obama warned he would intervene to stop Bernie, had cutting words for Biden: report",
      "url": "https://www.foxnews.com/politics/obama-warned-he-would-intervene-to-stop-bernie-from-winning-nomination-report",
      "subtitle": "Obama warned he would intervene to stop Bernie, had cutting words for Biden: report",
      "author": "Ronn Blitzer",
      "content": " Former President Barack Obama once warned he would intervene to stop Sen. Bernie Sanders, I-Vt., from winning the Democratic presidential nomination, according to a new report that sheds light on Obama's personal views of the jam-packed primary field with no clear front-runner. Obama has largely stayed on the sidelines to date, refraining from any endorsements though he has issued general warnings to the party to avoid calls for radical upheaval in their policy pitches. These warnings were seen as a swipe at candidates like Sens. Elizabeth Warren, D-Mass., and Sanders. But a new Politico Magazine report gives a clearer picture of what Obama is worried about -- claiming he has said in private he'd speak out against Sanders if it looked like he could actually win. OBAMA TAKES VEILED SHOT AT WARREN AND SANDERS, WARNS 2020 DEMS AMERICANS DON'T WANT TO 'TEAR DOWN THE SYSTEM' \"Back when Sanders seemed like more of a threat than he does now, Obama said privately that if Bernie were running away with the nomination, Obama would speak up to stop him,\" the report says. An Obama spokesperson, however, reportedly noted that the former president has stated that he would get behind the Democratic nominee regardless of who it is. One adviser said that while they personally had no knowledge of this, the threat of a Sanders nomination would likely be cause for action. \"I can't really confirm that,\" the adviser said, regarding the possibility of Obama trying to stop Sanders. \"He hasn't said that directly to me. The only reason I'm hesitating at all is because, yeah, if Bernie were running away with it, I think maybe we would all have to say something. But I don't think that's likely. It's not happening.\" This aversion to Sanders would be in line with Obama's recent comments. At an Obama Foundation Summit event in October, Obama took aim at political \"wokeness\" and cancel culture. \"This idea of purity and you're never compromised and you're always politically woke, and all that stuff, you should get over that quickly,\" Obama said. CLICK HERE TO GET THE FOX NEWS APP Weeks later, at a gathering of the Democracy Alliance, Obama warned 2020 Democratic presidential hopefuls that most voters do not want to “tear down the system.” Obama dismissed far-left positions as not being popular among average Americans, even if they make waves on social media. “Even as we push the envelope and we are bold in our vision, we also have to be rooted in reality and the fact that voters, including the Democratic voters and certainly persuadable independents or even moderate Republicans, are not driven by the same views that are reflected on certain, you know, left-leaning Twitter feeds,” Obama said. The same Politico report, meanwhile, addressed Obama's relationship with Biden, whom he has not yet endorsed, despite Biden serving as vice president in his administration -- and routinely touting their relationship on the stump. The Politico piece said Obama recalled to one candidate who came to him for advice how he himself had a bond with the voters that has since faded. He reportedly added, “And you know who really doesn’t have it? Joe Biden.” Biden says he never sought Obama's endorsement. Fox News' Adam Shaw and The Associated Press contributed to this report.",
      "date": "3 days ago",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Obama gets political again, launches initiative to fight gerrymandering",
      "url": "https://www.foxnews.com/politics/obama-gets-political-again-launches-initiative-to-fight-gerrymandering",
      "subtitle": "Obama gets political again, launches initiative to fight gerrymandering",
      "author": "Ronn Blitzer",
      "content": " Former President Barack Obama is back in the political arena, announcing a new initiative to combat partisan gerrymandering — though Republicans say the efforts are really about helping Democrats. The \"Redistricting U\" program, which is part of the \"All on the Line\" campaign, aims to recruit and train individuals to take up the fight against drawing congressional districts based on partisan interests. SUPREME COURT SAYS FEDERAL JUDGES HAVE NO ROLE IN POLICING GERRYMANDERING, LEAVING POLITICAL MAPS IN PLACE “Training is at the heart of organizing. It’s why I’ve always made it a priority — from my 2008 campaign until now,\" Obama tweeted Monday. \"And it’s why I’m proud to announce @allontheline’s in-person training initiative, Redistricting U.\" Republicans, though, have accused Democrats of making it sound like they want fairness — when in reality they are hoping to place their party in a better position. “If anyone tells you that @EricHolder is ‘fighting against gerrymandering’ and for ‘fair maps,’ just look at the form his organization filed with the IRS,” former Wisconsin Gov. Scott Walker tweeted last week. “The truth: their mission is to ‘FAVORABLY POSITION DEMOCRATS FOR THE REDISTRICTING PROCESS.’” \"Redistricting U\" was created in February after Obama merged his Organizing for Action group with former Attorney General Eric Holder’s National Redistricting Action Fund. According to \"All on the Line's\" website, \"Redistricting U\" will be “sending dedicated trainers to cities across the country to train volunteers, give them the tools to impact the redistricting process in their state, hear from them on how to best make change in their communities, and empower them to be leaders in the movement for fair maps.” 2020 HOPEFULS DEFEND THEIR OBAMA-ERA CRITICISMS The organization is focused on impacting the redrawing of congressional districts, which will take place in 2021 following the collection of data in the 2020 census. They warn against “rigged electoral maps drawn with surgical precision by politicians to preserve their party’s political power and silence the will of the people.” Partisan gerrymandering was a hot topic in the spring, when the Supreme Court declined to weigh in on the issue, determining in a ruling in two cases that the judiciary should not get involved because it is a political issue best left to lawmakers. One of the Supreme Court cases, Benisek v. Lamone, involved North Carolina, where Republicans had benefited from gerrymandering. \"All on the Line\" identified North Carolina as one of 10 “priority states,” along with Arizona, Colorado, Florida, Georgia, Michigan, Ohio, Pennsylvania, Texas, and Wisconsin. OBAMAS PLACED AN OFFER ON 'MEGA-EXPENSIVE' ESTATE IN MARTHA'S VINEYARD Not on that list is Maryland, where Democrats had been accused of unfairly drawing district maps at the expense of Republicans in the Supreme Court’s other partisan gerrymandering case, Rucho v. Common Cause. Since leaving office in January 2017, Obama has largely stayed out of the political limelight, though he has occasionally weighed in on political issues, like gun control. He has been known to enjoy the perks of his post-presidency: it was reported last week that the Obamas placed an offer on a 29-acre estate in Martha's Vineyard that had been listed at nearly $15 million. CLICK HERE TO GET THE FOX NEWS APP The 44th president also recently made headlines in relation to the 2020 Democratic race in a recent New York Times report that revealed he may have tried to talk former Vice President Joe Biden out of seeking the presidency. Obama has not endorsed Biden in the race. \"You don’t have to do this, Joe, you really don’t,\" Obama reportedly told Biden in early 2019. Biden had been leading the Democratic pack in primary polls, but lately has been sharing the lead with Sens. Elizabeth Warren, D-Mass., and Bernie Sanders, I-Vt.",
      "date": "August 27",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Trump reverses Obama-era policy against faith-based adoption agencies",
      "url": "https://www.foxnews.com/politics/trump-reverses-obama-era-policy-against-faith-based-adoption-agencies",
      "subtitle": "Trump reverses Obama-era policy against faith-based adoption agencies",
      "author": "Caleb Parke",
      "content": " Rolling back a last-minute regulation put in place under former President Obama, the President Trump administration is being praised by Christian conservatives for defending religious freedom with a newly proposed rule from the Department of Health and Human Services (HHS) that would allow faith-based foster care and adoption services to receive federal funding even if they turn away couples because of their religious beliefs. The new rule, proposed Thursday, reverses regulations under the Obama administration that required religious organizations to get a waiver in order to apply for an HHS grant, unless they include sexual orientation as a protected trait under anti-discrimination protections. EVANGELICAL LEADERS GATHER TO PRAY FOR TRUMP AT WHITE HOUSE, BLASTING IMPEACHMENT EFFORT The move angered LGBTQ activists and progressives, who argue it will decrease the number of available homes — something that actually happened as local government and states enacted the Obama-era rule largely targeting Roman Catholic and evangelical Protestant organizations, according to The Wall Street Journal. In an op-ed for WSJ Monday, Russell Moore said the Trump administration \"took a major step toward addressing the problem\" of religious organizations that hold a biblical definition of marriage between a man and a woman being punished in \"proxy culture wars\" that don't focus on the \"welfare of children.\" FEDERAL JUDGE RULES IN FAVOR OF CATHOLIC ADOPTION AGENCY IN RELIGIOUS LIBERTY CASE AGAINST MICHIGAN Moore points to the city of Philadelphia barring Catholic Social Services from placing children in homes in March 2018 because of the Catholic Church's teaching on marriage, and Michigan's Attorney General Dana Nessel citing the rule when attempting to cancel a state-approved foster care and adoption services contract with St. Vincent Catholic Charities. \"Charities shouldn't have to choose between their religious views and beliefs, in putting that before helping the needy,\" Stephanie Hamill, Daily Caller video columnist, told Shannon Bream on \"Fox News @ Night.\" Family Research Council president Tony Perkins said the \"need for this action is unfortunately evident as various state and local governments have trampled upon religious freedom protections and the First Amendment, forcing the shutdown of faith-based adoption providers that decline to leave their faith at the door.\" The Catholic Association told Fox News the rollback helps \"free\" religious organizations to help \"needy kids\" without having to violate their belief that children do best in a home with a married mom and dad. PAULA WHITE ON HOW SHE BECAME TRUMP'S SPIRITUAL ADVISER AND WHY HE'LL CARRY EVANGELICAL VOTE IN 2020 \"Agencies that find loving foster and adoptive homes shouldn’t be subject to ideological shakedowns by the government,” said Andrea Picciotti-Bayer, a legal adviser for The Catholic Association Foundation. Left-wing activists, however, argue the administration's plan will reduce the number of qualified parents who want to adopt or foster a child. CLICK HERE FOR THE FOX NEWS APP \"You really need to be the needs of needy in front of religious beliefs when it comes to these issues,\" Cathy Areu, Catalina Magazine founder, a Catholic herself, told Bream. \"Religious liberty is not a license to discriminate,\" the American Civil Liberties Union (ACLU) said in a tweet. \"The needs of children in our foster care system must come first.\" The Associated Press contributed to this report.",
      "date": "November 4",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Michelle Obama calls Barack the 'good parent,' slams Trump supporters for going 'fun' route",
      "url": "https://www.foxnews.com/politics/michelle-obama-calls-barack-the-good-parent-slams-trump-supporters-for-going-fun-route",
      "subtitle": "Michelle Obama calls Barack the 'good parent,' slams Trump supporters for going 'fun' route",
      "author": "Jennifer Earl",
      "content": " Former first lady Michelle Obama got political during a chat at a women's leadership conference Thursday, likening her husband's presidency to having \"the good parent at home\" opposed to what she called the \"other parent,\" referring to President Trump. Barack was like the \"responsible parent -- the one who told you to eat your carrots and go to bed on time,\" the former first lady said at the Simmons Leadership Conference in Boston, clearing her throat. \"And now perhaps we have the other parent in the house.\" Obama suggested those who voted for Trump did so because they thought it'd be \"fun.\" “We thought it’d feel fun -- maybe it feels fun for now because we can eat candy all day and stay up late and not follow the rules,\" she continued. \"And we're going to at that point in time look at those two experiences and see how we feel.\" Earlier, the 54-year-old said her husband was \"born\" with patience and applauded his temperament. \"We're at a point in time where we have to figure out who we want to be as a nation, and we've had two stark examples of what we can be,\" Obama said. \"I certainly know what direction I want to go.\" The former first lady then went on to praise Hillary Clinton, who she deemed \"the best qualified candidate\" in the 2016 presidential race. She blamed poor voter turnout for Clinton's loss, urging young voters to turn out and vote their \"interests\" in upcoming elections. \"The question is: What's your interest now, young people?\" Obama said. \"And we've got some clear choices to make.\" Clinton \"wasn't perfect,\" Obama admitted. \"But she was way more perfect...\" Obama said, pausing with a grin as some audience members laughed and applauded \"...than many of the alternatives.\" Some applauded Obama's \"refreshing\" comments, calling her a \"truly amazing woman\" and someone who is \"deeply missed.\" Others, however, dismissed the former first lady's remarks and called the parenting metaphor \"rude.\" \"Literally why should a former First Lady trash talk in such a way and get attention for it?\" one Twitter user asked. \"She is sadly mistaken,\" another added. This isn't the first time Obama's comments have sparked controversy. Obama critcized women who voted for Trump, suggesting they voted against their own interests, in September 2017. “Any woman who voted against Hillary Clinton voted against their own voice,” Obama told the audience during a talk at a marketing conference in Boston, according to Boston.com. The former first lady insinuated female Trump supporters were just following suit. \"What does this mean for us as women?” she asked, according to the Washington Times. “That we look at those two candidates, as women, and many of us said, ‘He’s better for me. His voice is more true to me.’ To me that just says, you don’t like your voice. You just like the thing you’re told to like.” While Obama does not shy away from offering her political views, the former first lady did confirm -- once again -- that she does not plan on running for office in 2020, The Hill reported Thursday.",
      "date": "April 6, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Obama endorses Justin Trudeau for reelection in Canada",
      "url": "https://www.foxnews.com/politics/fmr-pres-obama-endorses-justin-trudeau-for-reelection",
      "subtitle": "Obama endorses Justin Trudeau for reelection in Canada",
      "author": "",
      "content": "Former President Barack Obama endorsed Canadian Prime Minister Justin Trudeau in his reelection effort Wednesday, part of an attempt to boost the embattled leader's chances of staying in office. Obama and Trudeau maintained a friendly relationship while they were both heads of the neighboring countries -- Obama honored Trudeau with the first state dinner for a Canadian since 1997 soon after the young leader was elected. The progressive politicians also met for a beer at a Canadian brewery earlier this year. \"I was proud to work with Justin Trudeau as President,\" Obama said. \"He's a hard-working, effective leader who takes on big issues like climate change. The world needs his progressive leadership now, and I hope our neighbors to the north support him for another term.\" JESSE WATTERS BLASTS CANADIAN PM TRUDEAU, PRIVILEGE NOT AN EXCUSE FOR BLACKFACE IN 2001 Trudeau's Liberal Party is in a very close race with Canada's conservative party, according to a Canadian Broadcasting Corporation's average of polls. This is as Trudeau is still recovering from recently exposed photos of him wearing blackface in 2001, a scandal that forced him to make a public apology. \"I am wary of being definitive about this because the recent pictures that came out, I had not remembered,\" he said in September. \"And, the question is, how can you not remember that? The fact is, I didn't understand how hurtful this is to people who live with discrimination every single day.\" An endorsement from Obama, who was highly popular in Canada during his time in office, might boost the Liberal Party in its effort to nab a victory during Monday's election. CLICK HERE TO GET THE FOX NEWS APP In American elections, Obama has chosen to avoid endorsing a contender in the Democratic presidential primary thus far, although his vice president, Joe Biden, is considered one of the frontrunners.",
      "date": "October 16",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Colorado's 'Barack Obama Highway' bill could face rocky road to passage",
      "url": "https://www.foxnews.com/politics/colorados-barack-obama-highway-bill-could-face-rocky-road-to-passage",
      "subtitle": "Colorado's 'Barack Obama Highway' bill could face rocky road to passage",
      "author": "Ryan Gaydos",
      "content": " Colorado Democrats hope to convince their fellow state lawmakers to rename a stretch of Interstate 25 the “Barack Obama Highway.” The measure passed a House panel by a 12-1 vote Thursday, but could eventually face opposition in the Republican-controlled Senate -- where lawmakers have railed against former president over Medicaid expansion, ObamaCare and climate change. The bill would apply to the portion of the interstate that runs through Denver in recognition of the 2008 Democratic National Convention, which the city hosted. It was there that Obama accepted the party's nomination for president. Obama gave his nomination acceptance speech at Sports Authority Field, home of the NFL's Denver Broncos, which sits near Insterstate 25, according to the Colorado Springs Gazette. State Rep. Dan Pabon, D-Denver, presented the bill to the House Transportation and Energy Committee on Thursday. Democrats likely hope the bill will follow the same path that similar Republican proposals have taken. A portion of Interstate 25 that runs through El Paso County is now named for Ronald Reagan and a portion of Interstate 70 in Eagle County is named for Gerald Ford. Several states have renamed stretches of roads after the 44th president, including California, Illinois, Indiana, Florida and Missouri. Florida leads the way with five roads named after Obama.",
      "date": "April 20, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Texas woman who mailed Obama explosive gets 10-year sentence",
      "url": "https://www.foxnews.com/politics/barack-obama-greg-abbott-explosive-devices-mailed",
      "subtitle": "Texas woman who mailed Obama explosive gets 10-year sentence",
      "author": "Jack Durschlag",
      "content": " Just moments after her sobbing denial for her involvement in mailing explosives to former President Barack Obama, Texas Gov. Greg Abbott and the acting director of the Social Security agency, a Texas woman was sentenced to 10 years in federal prison Monday, a report said. Julia Poff, 47, who pleaded guilty to the charges in July, told District Judge Vanessa Gilmore, she and her family have helped dozens in need over the years and began citing Bible verses she and her husband, a co-defendant in the case, live by, The Houston Chronicle reported. WOMAN ACCUSED OF TRESPASSING AT CIA HQ, ALLEGEDLY BREAKS COURT ORDER, SHOWS UP AT OBAMA'S HOUSE “My problem is that I have a huge heart and I’m too trusting of people,” she told the judge. After Poff began citing the Biblical verses, Gilmore shut down Poff, asking her to explain her actions, the report said. “Talk to me, don’t be reading me Bible verses,” Gilmore said. “I need to understand why you’re saying you’ve done good for so many people and how that squares with the fact that you made bombs and sent them ... with the intent to kill.” At that point, Poff denied committing the crimes, The Chronicle reported. “I don’t know what we’re doing here. We had nothing to do with this. We did not do this,” she said through tears. After conferring with her attorney, Poff apologized. “All I can say is I’m sorry,” said Poff. “I’m sorry to the people I’ve hurt.” TEXAS KIDS PLAYING 'HIDE AND SEEK' FIND A BODY Prosecutors said in October 2016 Poff mailed a package addressed to Obama containing a “booby trapped” homemade explosive device. The package was intercepted at a White House handling facility at Bolling Air Force Base in Washington D.C. The handling facility was evacuated and an FBI explosives expert confirmed it was a bomb, the report said. Investigators were able to link the box to Poff and her husband using a stray cat hair they found taped under the box’s address label. Tests found the hair was consistent with hair taken from Poff’s cat, according to prosecutors. Poff’s daughter identified a cell phone found in the box as her old device. In addition, authorities found a transaction on Poff’s debit card for a micro-USB box with the same barcode as the one found in the package, the report said. Two similar packages were mailed by Poff to Abbott and the acting Social Security Administration director. The package sent to Abbott, which contained explosives stuffed into a cigarette pack, was mailed in September 2016. The device did not explode because it was not opened in a way designed to set off the explosion. The Governor’s Mansion was evacuated because of the incident, prosecutors said. Poff was angry with Abbott because she had not received child support from her ex-husband, court filings say. Her frustration with the governor stemmed from a legal battle with the Texas Attorney General’s Office, which began when Abbott led the agency. One month later, an explosive package was sent to the Social Security Administration, after Poff was denied Social Security disability benefits for a third time, court documents say. Poff worked at a fireworks stand for nine years, according to prosecutors, and “knew what she was doing.” This past July, Poff admitted she was solely responsible for sending the bombs, pleading guilty to transportation of explosives with intent to kill. She received the highest possible sentence for the conviction on Monday, the Chronicle reported. CLICK HERE FOR THE FOX NEWS APP Gilmore chastised Poff in court, saying her actions put many in danger - including mail carriers and sorters. “The court finds the defendant’s actions were calculated, pervasive and continuous over an extended period of time,” said Gilmore.",
      "date": "November 19",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Ingraham: Is Team Obama behind Harris' surge?",
      "url": "https://www.foxnews.com/politics/ingraham-is-team-obama-behind-sen-harris-surge",
      "subtitle": "Ingraham: Is Team Obama behind Harris' surge?",
      "author": "Victor Garcia",
      "content": " Is former President Barack Obama behind Sen. Kamala Harris' recent surge? Fox News' Laura Ingraham believes so and she made her case Monday night on \"The Ingraham Angle.\" It has been widely reported that the former president made it a point not to come out and support any of the Democratic candidates during the primaries. His former vice president, Joe Biden, has said he requested that his former boss not endorse him to be fair to other candidates. Ingraham said there's already evidence that Obama is at least on the periphery playing a role in the Harris campaign. Some of his administration's alums are already working for Harris' campaign. SOME 2020 DEMS TURN ON KAMALA HARRIS FOR ATTACKING BIDEN, THEN BACKTRACKING \"And who doubts, come on, that Kamala and her team are in contact with the Obamas,\" Ingraham said. Ingraham said that Harris will do anything to be president including unfairly smearing Biden. \"She'll say and do anything to win including bloodying up Biden with a vicious racial smear,\" Ingraham said. The Fox News host said Harris needs to defeat Biden and win over black voters. \"He's the only real challenge standing in the way of her claiming the Obama mantle because what could be more historic following the first male African-American president than four years later the first female African-American president and to beat him she has to win over black voters,\" Ingraham said. CLICK TO GET THE FOX NEWS APP Ingraham blasted Harris' $100 billion housing plan that will fund down payments and closing costs African-Americans calling it \"racial pandering\" and asking about the wealth gap for Hispanics and Native Americans. \"Well this is clearly racial pandering of the worst sort but it's designed to appeal voters away from Joe Biden,\" Ingraham said.",
      "date": "July 9",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Barack and Michelle Obama have book deals",
      "url": "https://www.foxnews.com/politics/barack-and-michelle-obama-have-book-deals",
      "subtitle": "Barack and Michelle Obama have book deals",
      "author": "",
      "content": "WASHINGTON – Barack and Michelle Obama have book deals. The former president and first lady have signed with Penguin Random House, the publisher announced Tuesday. Financial terms were not disclosed, although the deals are likely in the tens of millions of dollars. Both Obamas have published books through Crown, a Penguin Random House imprint. \"We are absolutely thrilled to continue our publishing partnership with President and Mrs. Obama,\" Penguin Random House CEO Markus Dohle said in a statement. \"With their words and their leadership, they changed the world, and every day, with the books we publish at Penguin Random House, we strive to do the same.  Now, we are very much looking forward to working together with President and Mrs. Obama to make each of their books global publishing events of unprecedented scope and significance.\" The unique dual arrangement is for books that are among the most anticipated in memory from a former president and first lady. Barack Obama is widely regarded as the one of the finest prose stylists among recent presidents, and his written the million-selling \"Dreams from My Father\" and \"The Audacity of Hope.\" Michelle Obama has given few details about her time as first lady: Her only book is about food and gardening, \"American Grown,\" released in 2012. Both Obamas are widely popular with the public in the U.S. and abroad. The publisher did not immediately say which imprint the books would be released through. Titles, publishing dates and other details about the books also were not immediately available.",
      "date": "February 28, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Rep. Ilhan Omar slams Barack Obama's message of 'hope and change' as a 'mirage'",
      "url": "https://www.foxnews.com/politics/rep-ilhan-omar-slams-barack-obamas-message-of-hope-and-change-as-a-mirage",
      "subtitle": "Rep. Ilhan Omar slams Barack Obama's message of 'hope and change' as a 'mirage'",
      "author": "Liam Quinn",
      "content": " Rookie Democratic Rep. Ilhan Omar, fresh off igniting an intra-party uproar with comments widely viewed as anti-Semitic, took a swipe at former President Barack Obama, saying in an explosive interview the 44th president's message of \"hope and change\" was a \"mirage\" and blasting his administration's drone and border detention policies. Omar, D-Minn., took aim at the president's famed slogan, while further criticizing the Democratic Party for “perpetuating the status quo,” in the interview with Politico. “Recalling the ‘caging of kids’ at the U.S.-Mexico border and the ‘droning of countries around the world’ on Obama’s watch,\" Omar charged that Obama \"operated within the same fundamentally broken framework as his Republican successor,” the piece reads. TRUMP SLAMS DEMS AFTER VIRAL PHOTO OF CHILDREN IN CAGES, FROM OBAMA'S TERM, 'BACKFIRES' Omar is then quoted as saying: “We can’t be only upset with Trump… His policies are bad, but many of the people who came before him also had really bad policies. They just were more polished than he was. “And that’s not what we should be looking for anymore. We don’t want anybody to get away with murder because they are polished. We want to recognize the actual policies that are behind the pretty face and the smile.” The comments came after the passage Thursday of a broad anti-bigotry resolution prompted by Omar's prior comments about Israel. The resolution and the drama surrounding its passage exposed chasms in the Democratic caucus regarding Israel and marked a coup of sorts for a tight-knit band of House freshmen who – in a matter of hours – were able to shift the spotlight away from Omar’s allegedly anti-Semitic remarks and refocus on issues like Islamophobia and pro-Israel lobby AIPAC. “The week was supposed to start off with a rebuke of Omar's anti-Semitic comments and it ended up turning into a long list of other hateful actions,” House Republican Whip Steve Scalise, R-La., told Fox News on Friday, saying the final product “fell short of addressing the real problem.” But the broadside delivered at Obama is highly unusual for any Democrat, especially one who has been in the House for two months and has already ticked off party elders with her outspokenness. DEM FROSH TURN TABLES ON ANTI-SEMITISM REBUKE, SHIFT SPOTLIGHT TO ISLAMOPHOBIA AND AIPAC POWER The House resolution, following a week of Democratic infighting over the language, was approved on a 407-23 vote. The measure originally was drafted in response to Omar, a freshman Democrat from Minnesota, suggesting last week that Israel supporters want U.S. lawmakers to pledge “allegiance” to the Jewish state – which was widely condemned as echoing the age-old “dual loyalties” smear against Jewish politicians. Yet after Speaker Nancy Pelosi faced a rebellion in the ranks amid concerns the resolution would unfairly single out Omar, a Muslim, and increase security threats against her (she was recently the subject of an inflammatory poster at the West Virginia capitol falsely tying her to the 9/11 attacks), the resolution was overhauled. The result was a broad rebuke of bigotry, including anti-Semitism as well as “anti-Muslim discrimination and bigotry against minorities” perpetrated by white supremacists and others. The resolution condemned “dual loyalty” accusations, but did not mention Omar by name. The fight exposed deep divisions in the party. But on the 2020 campaign trail, heavyweights came to Omar's side. Vermont independent Sen. Bernie Sanders, who was raised Jewish, defended Omar, arguing that “we must not, however, equate anti-Semitism with legitimate criticism of the right-wing, Netanyahu government in Israel. MEGHAN McCAIN SLAMS REP. ILHAN OMAR'S 'BLATANTLY ANTI-SEMITIC RHETORIC' AMID BITTER TWITTER SPAT “What I fear is going on in the House now is an effort to target Congresswoman Omar as a way of stifling that debate,\" the senator added. “That's wrong.” Sen. Elizabeth Warren of Massachusetts also slammed anti-Semitism but defended Omar. “Branding criticism of Israel as automatically anti-Semitic has a chilling effect on our public discourse and makes it harder to achieve a peaceful solution between Israelis and Palestinians,” she wrote in a statement obtained by Fox News. Many Democrats, while strong supporters of Israel, have concerns with the country’s long-time prime minister, Benjamin Netanyahu, and his government’s treatment of Palestinians. 2020 DEMOCRATIC PRESIDENTIAL HOPEFULS CIRCLE THE WAGONS AROUND OMAR There was a similar response from Sen. Kamala Harris of California, who called out all instances of bigotry and worried about possible violence directed at Omar. “You can both support Israel and be loyal to our country,” she said. “I also believe there is a difference between criticism of policy or political leaders, and anti-Semitism.\" Harris spotlighted that “like some of my colleagues in the Congressional Black Caucus, I am concerned that the spotlight being put on Congresswoman Omar may put her at risk.” CLICK HERE TO GET THE FOX NEWS APP Meanwhile, Sen. Kirsten Gillibrand, D-N.Y., was more critical of Omar in response to the controversy, while also accusing the GOP of \"hypocrisy.\" Fox News contacted President Obama’s office for comment. Fox News' Judson Berger contributed to this report.",
      "date": "March 8",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Barack Obama post-presidency",
      "url": "https://www.foxnews.com/politics/barack-obama-post-presidency",
      "subtitle": "Barack Obama post-presidency",
      "author": "",
      "content": "",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Barack Obama still believes Biden would be 'an excellent president' amid inappropriate touching allegations: report",
      "url": "https://www.foxnews.com/politics/barack-obama-still-believes-biden-would-be-an-excellent-president-amid-inappropriate-touching-allegations-report",
      "subtitle": "Barack Obama still believes Biden would be 'an excellent president' amid inappropriate touching allegations: report",
      "author": "Liam Quinn",
      "content": " Former President Barack Obama is staying silent on allegations surrounding Joe Biden, but he still has his ex-VP’s back, a new report claims. Obama hasn’t commented publicly on allegations from a number of women that the former vice president touched them inappropriately. But someone close to Obama said the former president still views Biden as someone who could be an “excellent” commander-in-chief, according to a new report. “He's spent an infinite amount of time talking about his character, and they remain in touch and good friends,” a source close to the former president said, The Hill reported. STACEY ABRAMS DEFENDS BIDEN AMID ALLEGATIONS, SAYS 'PERFECTION' CAN'T BE 'LITMUS TEST,' PEOPLE SHOULD 'FORGIVE' “President Obama thinks the world of him and thinks he'd be an excellent president.” The source reportedly continued: “President Obama is not going to be weighing in on the primary and the day-to-day stories around it. “And Joe Biden would be the first to tell you that he'll have to earn the nomination on his own.” The report comes as Biden prepares to make his first public appearance since a number of women came forward this week accusing him of inappropriate touching. DEM STRATEGIST: REPUBLICANS FOCUS ON JOE BIDEN ALLEGATIONS BECAUSE HE'S THE POTENTIAL CANDIDATE 'DONALD TRUMP FEARS THE MOST' Biden, who is expected to formally announce his candidacy for president after Easter, is scheduled to speak at the International Brotherhood of Electrical Workers. The first woman to accuse Biden of inappropriate behavior was Nevada politician Lucy Flores, who said he came up behind her at a 2014 campaign event and kissed her on the back of the head. CLICK HERE TO GET THE FOX NEWS APP Another accuser told the Washington Post that, when she was a White House intern in 2013, Biden put his head against hers and called her a \"pretty girl.\" Another accuser, writer D.J. Hill, said Biden put his hand on her shoulder and dropped it down her back in a way that made her “very uncomfortable” at a 2012 fundraiser. In a video tweeted Thursday, Biden said, “Social norms are changing. I understand that, and I’ve heard what these women are saying. Politics to me has always been about making connections, but I will be more mindful about respecting personal space in the future. That’s my responsibility and I will meet it.”",
      "date": "April 5",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    },
    {
      "title": "Illinois celebrates first official 'Barack Obama Day'",
      "url": "https://www.foxnews.com/politics/illinois-celebrates-first-official-barack-obama-day",
      "subtitle": "Illinois celebrates first official 'Barack Obama Day'",
      "author": "Robert Gearty",
      "content": " Illinois government offices remained open Saturday as the home state of former President Barack Obama commemorated his birthday under a new state law. The bill marking Aug. 4 as “Barack Obama Day” throughout the state was enacted without making the date a full-scale holiday. The Illinois House narrowly rejected a plan to make Obama’s birthday a state holiday amid worries that the cash-strapped state could not afford to give state state employees another paid day off. Obama turned 57. The law hailed Obama’s efforts to protect the rights of Americans and build “bridges across communities.” \"It's incredibly proud for Illinois that the president came from Illinois. I think it's awesome, and I think we should celebrate it,\" Gov. Bruce Rauner said in signing the measure into law, according to TheHill. \"I don't think it should be a formal holiday with paid, forced time off, but I think it should be a day of acknowledgment and celebration.\" Chicago Mayor Rahm Emanuel, Obama’s former chief of staff, wished Obama a happy birthday on Twitter, saying “57 never looked so good,” according to the publication. Former first lady Michelle Obama also wished her husband a happy birthday on Twitter, saying, “The view is always better with you.” Illinois, California and Wisconsin celebrate Ronald Reagan Day every Feb. 6 in honor of the late Republican president’s birthday, USA Today reported. An Obama spokeswoman said Obama plans to celebrate his birthday with a family dinner in Washington on Saturday night, according to the paper. The Associated Press contributed to this report.",
      "date": "August 4, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barack_Obama"
      }
    }
  ]
}