{
  "articles": [
    {
      "title": "Trump challenger Bill Weld envisions McCain-style path to primary win",
      "url": "https://www.foxnews.com/politics/trump-challenger-bill-weld-envisions-mccain-style-path-to-primary-win",
      "subtitle": "Trump challenger Bill Weld envisions McCain-style path to primary win",
      "author": "Paul Steinhauser",
      "content": " MANCHESTER, N.H. – Bill Weld acknowledges that he’s the longest of long-shot candidates as he prepares to challenge President Trump for the GOP primary nod. But the former two-term Massachusetts governor points to another one-time GOP long shot who twice won New Hampshire’s first-in-the-nation presidential primary – the late Sen John McCain, R-Ariz. WELD MAKES IT OFFICIAL, LAUNCHING A LONGSHOT PRIMARY CHALLENGE AGAINST TRUMP In an interview with Fox News on Tuesday – the day after he formally launched his campaign to be the GOP's 2020 standard bearer – Weld pointed to McCain’s tireless style of politics, which fueled his primary victories in New Hampshire in 2000 and again in 2008, when he captured the nomination. “John McCain made that work here twice. Not once but twice. He was the underdog both times,” Weld pointed out. Weld – he's so far the lone GOP politician to announce a primary challenge to Trump's re-election campaign -- faces a sharp uphill climb to defeat the president, who remains popular with Republican voters in New Hampshire and across the country. Still, Weld said he can beat Trump, emphasizing that he’s used to being the underdog, as he was in his state's gubernatorial election some 30 years back. “When I ran for governor of Massachusetts, I was less than an asterisk,” Weld said. “And I went out to every event all summer long and into the fall and I was often all by myself. And little by little, people said, ‘This kid keeps showing up.’ And the same thing would be the plan here” in New Hampshire Minutes before he sat down with Fox News, Weld was implementing his plan, going table to table to talk with voters at Manchester’s Airport Diner, seen by many as a must-stop for White House hopefuls. He had just come from the fabled Red Arrow Diner in downtown Manchester, his first stop in a two-day swing through the Granite State. TRUMP'S UNPRECEDENTED 2020 CAMPAIGN WAR CHEST Weld was in New Hampshire just two days after Trump’s re-election campaign announced it had raised $30 million in the first three months of this year -- it now boasts a war chest of more than $40 million. Asked how he can compete, Weld said that “my calls have been going well. I’m been making some finance calls. I’m calling some people who were supporters of Mitt Romney, people who were supporters of Jeb Bush, and they’re supportive.” He added, “I don’t think New Hampshire is a primary you can buy.” Weld has made visits to the state almost every week since announcing in February that he was setting up a presidential exploratory committee. And he said that’ll continue. “I could be in New Hampshire all day, every day and still sleep in my own bed in Massachusetts every night,” he said. Independents – some 40 percent of the state’s electorate – are allowed to vote in either the Democratic or Republican presidential primaries, which could help Weld as he tries to pull the ultimate upset in the GOP nomination race. “I’ll probably be here part of every week between now and next February,” he said. But Weld also insisted that his message could also resonate on the West Coast and in some of the Rocky Mountain states. Weld, who’s been a very vocal critic of the president, told Fox News: “I think I can do a better job than he can. I can cut spending. I have the political will to do it. I did that in Massachusetts. ... Mr. Trump, whatever his other virtues might, he is not an economic conservative.” What's more, Weld said he \"wouldn’t turn my back on climate change and global warming the way Mr. Trump has. ... The Republican Party should not put its head in the sand on climate change.” The president's re-election campaign adviser and daughter-in-law, Lara Trump, said the president’s 2020 team hasn’t been worried at all about a Republican primary challenge. “I don’t know why someone would be dumb enough to challenge Donald Trump,” she told Fox News recently when asked about Weld. “I don’t know why anybody would waste their time and money on the Republican end trying to challenge the president. We’re not worried about that at all.” Weld also isn’t making any friends with the New Hampshire GOP. State party chairman Steve Stepanek points to Weld’s insistence that he wouldn’t support Trump in the 2020 election, and to Weld’s time in 2016 as the Libertarian Party vice presidential nominee (Weld re-registered as a Republican earlier this year), and asked, “How can he call himself a Republican.” But Stepanek – he was New Hampshire co-chairman of Trump’s 2016 campaign -- said Weld would get a fair shake, adding that “essentially I am neutral in the primary as far as Governor Weld is concerned.” Former Ohio Gov. John Kasich, another vocal Trump critic, has also been mulling a GOP primary challenge against Trump. So has Maryland Gov. Larry Hogan, who heads to New Hampshire next week to headline “Politics and Eggs,” another important event for White House hopefuls. “I spoke to both of them in the last few days. Very pleasant conversations,” Weld shared. Asked if he would exit the race if either Kasich or Hogan jumped in, he quickly answered: “I wouldn’t get out. I’d compete, but it would be an honorable competition.” He said multiple primary challengers “could be good for President Trump, sharpening him up a little bit so that he wouldn’t take everything for granted. ... It might be harder for President Trump to duck debates if there were three other candidates here.\"",
      "date": "April 16",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Sarah Palin not invited to McCain funeral: reports",
      "url": "https://www.foxnews.com/politics/sarah-palin-not-invited-to-mccain-funeral-reports",
      "subtitle": "Sarah Palin not invited to McCain funeral: reports",
      "author": "Dom Calicchio",
      "content": " In 2008, she was chosen to be his running mate – potentially just a heartbeat away from the presidency. But now former Alaska Gov. Sarah Palin, like President Trump, has been left off the list of invitees to the funeral of the late U.S. Sen. John McCain, according to multiple reports. “My guess is, it came from Cindy,” a source close to the McCain family told People magazine, referring to the late senator’s widow. “She is very protective of John’s memory and legacy. She’s also a grieving widow. I think she wants to get through this as best she can.” The message was sent through an intermediary, not directly from the McCain family, according to the report. An NBC reporter tweeted that a Palin \"family source\" said, “Out of respect to Senator McCain and his family we have nothing to add at this point. The Palin family will always cherish their friendship with the McCains and hold those memories dear.” Palin did not immediately respond to a Fox News email sent early Thursday. A decade ago, it was McCain’s selection of Palin to be his vice president that catapulted Palin to the national political spotlight from relative obscurity in Alaska. But their relationship quickly grew strained, amid accusations that Palin was often unprepared for media interviews, or had “gone rogue” by ignoring the advice of McCain campaign handlers. Some critics charged that Palin was more interested in advancing her own career – and popularity among conservative voters -- than assuring the success of the McCain-Palin ticket, led by the more moderate McCain. In May, McCain published a book titled “The Restless Wave,” in which he wrote that he regretted choosing Palin as his running mate instead of his close friend, former U.S. Sen. Joe Lieberman of Connecticut. McCain and Palin ultimately lost the White House in 2008 to Barack Obama and Joe Biden. Ironically, Biden is scheduled to speak Thursday at a McCain memorial service in the senator’s home state of Arizona, while Obama has been invited to deliver a eulogy Saturday at a McCain memorial service in Washington, D.C. Following McCain’s death from brain cancer last Saturday at age 81, Palin issued a pair of Twitter messages. “Today we lost an American original,” she wrote. “Sen. John McCain was a maverick and a fighter, never afraid to stand for his beliefs. John never took the easy path in life - and through sacrifice and suffering he inspired others to serve something greater than self.” Later, she wrote: “John McCain was my friend. I will remember the good times. My family and I send prayers for Cindy and the McCain family.”",
      "date": "August 30, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Trump decided against White House statement praising McCain",
      "url": "https://www.foxnews.com/politics/trump-decided-against-white-house-statement-praising-mccain",
      "subtitle": "Trump decided against White House statement praising McCain",
      "author": "Serafin Gómez",
      "content": "  President Trump initially decided against releasing an official White House statement on Sen. John McCain following his death, two administration sources confirmed to Fox News. The statement would have praised him for his decades of service and his heroism as a Vietnam War POW. White House Chief of Staff John Kelly, Press Secretary Sarah Sanders and other senior aides all had pushed for such a statement, which would have called McCain a “hero.” The president, however, rejected the statement and instead issued a brief tweet Saturday night following the legendary Arizona Republican senator’s death. The tweet said, “My deepest sympathies and respect go out to the family of Senator John McCain. Our hearts and prayers are with you!” The decision on the statement was first reported by The Washington Post. The president eventually issued a statement late Monday afternoon announcing top officials will attend McCain's service, Vice President Pence will speak at a Capitol ceremony on Friday and U.S. flags will fly at half-staff until his internment. \"Despite our differences on policy and politics, I respect Senator John McCain’s service to our country and, in his honor, have signed a proclamation to fly the flag of the United States at half-staff until the day of his interment,\" Trump said, in a statement largely focused on the services of the coming days. Trump’s decision to nix the earlier statement speaks to the longstanding feud between the two men, dating back to when Trump, as a candidate, said McCain was not a war hero and seemed to fault him for being captured during the Vietnam War. McCain endured five years in captivity, an experience that later shaped his views, as a senator, on interrogation techniques. Known as the Senate’s “maverick,” McCain often bucked party ideology, earning him praise on Democratic side of the aisle and sometimes criticism from his own party – but he remained an influential voice even through his battle with brain cancer. He twice ran for president and was the Republican Party’s presidential nominee in 2008. Tributes to McCain, meanwhile, poured in from other world leaders and statesmen including former presidents Barack Obama and George W. Bush. “Few of us have been tested the way John once was, or required to show the kind of courage that he did. But all of us can aspire to the courage to put the greater good above our own,” Barack and Michelle Obama said in their statement. “In an era filled with cynicism about national unity and public service, John McCain’s life shone as a bright example. He showed us that boundless patriotism and self-sacrifice are not outdated concepts or clichés, but the building blocks of an extraordinary American life,” Senate Majority Leader Mitch McConnell, R-Ky., said in a statement. McConnell also announced that McCain will lie in State at the U.S. Capitol Rotunda.",
      "date": "August 27, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Ilhan Omar mocks Meghan McCain after fiery criticism: 'Oh, bless her heart!'",
      "url": "https://www.foxnews.com/politics/ilhan-omar-meghan-mccain-criticism",
      "subtitle": "Ilhan Omar mocks Meghan McCain after fiery criticism: 'Oh, bless her heart!'",
      "author": "Liam Quinn",
      "content": " Ilhan Omar has made her view on Meghan McCain crystal clear. Rep. Omar, D-Minn., the controversial freshman congresswoman, mocked McCain’s attempt to call her out during a discussion on anti-Semitism in the wake of the California synagogue shooting. “When we’re having conversations about anti-Semitism, we should be looking at the most extreme on both sides. I would bring up Congresswoman Ilhan Omar and some of her comments that got so much attention,” “The View” co-host said on ABC’s “This Week with George Stephanopoulos.” “In my opinion, Nancy Pelosi wasn’t hard enough in response to her trafficking in anti-Semitic language.” TWITTER CEO PERSONALLY CALLED OMAR TO EXPLAIN POLICY AFTER TRUMP TWEET: REPORT Hours later, in response to a tweet criticizing McCain for referencing Omar and Saturday's deadly shooting at a synagogue in Poway, the Minnesota Democrat weighed in. “Oh, bless her heart!” Omar tweeted. The Twitter spat came after police said 19-year-old John Earnest opened fire inside the synagogue near San Diego as worshippers celebrated the last day of Passover, killing one woman and wounding the synagogue's rabbi and two others Saturday, authorities said. Trump and other elected officials decried what they called an anti-Semitic attack six months to the day after 11 people were killed at a Pittsburgh synagogue in the deadliest assault on Jews in U.S. history. ILHAN OMAR CLAIMS US FORCES KILLED 'THOUSANDS' OF SOMALIS DURING 'BLACK HAWK DOWN' MISSION, RESURFACED TWEET SHOWS Trump offered his sympathies Saturday, saying the shooting \"looked like a hate crime.\" \"Our entire nation mourns the loss of life, prays for the wounded and stands in solidarity with the Jewish community,\" Trump said later at a rally in Wisconsin. \"We forcefully condemn the evils of anti-Semitism and hate, which must be defeated.\" California Gov. Gavin Newsom said he joins the community in grief. CLICK HERE TO GET THE FOX NEWS APP \"No one should have to fear going to their place of worship, and no one should be targeted for practicing the tenets of their faith,\" he said. Fox News’ Andrew O’Reilly contributed to this report.",
      "date": "April 29",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Cindy McCain apologizes after police refute her story of stopping human trafficking at airport",
      "url": "https://www.foxnews.com/politics/cindy-mccain-apologizes-after-police-refutes-her-story-of-stopping-human-trafficking-at-airport",
      "subtitle": "Cindy McCain apologizes after police refute her story of stopping human trafficking at airport",
      "author": "Lukas Mikelionis",
      "content": " Cindy McCain, the widow of the late Arizona Sen. John McCain, apologized Wednesday after Phoenix police disputed her claim that she stopped a human trafficking attempt at an airport. “I commend the police officers for their diligence. I apologize if anything else I have said on this matter distracts from ‘if you see something, say something,’” McCain wrote on Twitter. Her apology came after city’s authorities refuted McCain’s claim on Monday that she saw a child being trafficked at the Sky Harbor International Airport last week. FBI SEX-TRAFFICKING STING BEFORE SUPER BOWL NETS 169 “I came in from a trip I’d been on and I spotted — it looked odd — it was a woman of a different ethnicity than the child, this little toddler she had, and something didn’t click with me,” McCain told KTAR News 92.3 FM. “I went over to the police and told them what I saw, and they went over and questioned her, and, by God, she was trafficking that kid,” she added, noting that the woman was “waiting for the guy who bought the child to get off an airplane.” I'VE FOUGHT SEX TRAFFICKING AS A DHS SPECIAL AGENT – WE NEED TO BUILD THE WALL FOR THE CHILDREN But police said on Wednesday that McCain’s claims weren’t correct and there was no attempt at human trafficking. Sgt. Armando Carbajal told KTAR that after officers investigated the matter promptly at the request of McCain, including running a welfare check on a child, they found “no evidence of criminal conduct or child endangerment.” CLICK HERE TO GET THE FOX NEWS APP McCain has become an advocate against human trafficking and is the co-chair of the governor’s Arizona Human Trafficking Council in addition to the McCain Institute’s Human Trafficking Advisory Council.",
      "date": "February 7",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Meghan McCain reacts after Senator John McCain diagnosed with brain tumor",
      "url": "https://www.foxnews.com/politics/meghan-mccain-reacts-after-senator-john-mccain-diagnosed-with-brain-tumor",
      "subtitle": "Meghan McCain reacts after Senator John McCain diagnosed with brain tumor",
      "author": "",
      "content": "Meghan McCain, daughter of Sen. John McCain, R-Ariz., and co-host of \"Outnumbered\" on Fox News Channel, released this statement after her father was diagnosed with a brain tumor. \"The news of my father’s illness has affected every one of us in the McCain family. My grandmother, mother, brothers, sister, and I have all endured the shock of the news, and now we live with the anxiety about what comes next. It is an experience familiar to us, given my father’s previous battle with cancer – and it is familiar to the countless American families whose loved ones are also stricken with the tragedy of disease and the inevitability of age. If we could ask anything of anyone now it would be the prayers of those of you who understand this all too well. We would be so grateful for them. \"It won’t surprise you to learn that in all this, the one of us who is most confident and calm is my father. He is the toughest person I know. The cruelest enemy could not break him. The aggressions of political life could not bend him. So he is meeting this challenge as he has had every other. Cancer may afflict him in many ways: but it will not make him surrender. Nothing ever has. \"My love for my father is boundless, and like any daughter I cannot and do not wish to be in a world without him. I have faith that those days remain far away. Yet even in this moment, my fears for him are overwhelmed by one thing above all: gratitude for our years together, and the years still to come. He is a warrior at dusk, one of the greatest Americans of our age, and the worthy heir to his father’s and grandfather’s name. But to me he is something more. He is my strength, my example, my refuge, my confidante, my teacher, my rock, my hero – my dad. -MMM\"",
      "date": "July 19, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Politicians react to John McCain brain tumor diagnosis",
      "url": "https://www.foxnews.com/politics/politicians-react-to-john-mccain-brain-tumor-diagnosis",
      "subtitle": "Politicians react to John McCain brain tumor diagnosis",
      "author": "",
      "content": "Politicians reacted on Wednesday night to the brain tumor diagnosis of Arizona Sen. John McCain.",
      "date": "July 20, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Retired astronaut Mark Kelly announces 2020 Senate bid for McCain seat",
      "url": "https://www.foxnews.com/politics/retired-astronaut-mark-kelly-announces-2020-senate-bid-to-fill-mccain-seat",
      "subtitle": "Retired astronaut Mark Kelly announces 2020 Senate bid for McCain seat",
      "author": "Brooke Singman",
      "content": " Retired astronaut Mark Kelly announced Tuesday that he will run for the late Sen. John McCain’s Arizona Senate seat in 2020 to finish the term. Kelly, who came into the national spotlight when his wife, former Rep. Gabrielle Giffords, was shot in a failed assassination attempt, will seek to take on Sen. Martha McSally, R-Ariz., who was appointed to McCain’s seat last year after she was narrowly defeated by now-Sen. Kyrsten Sinema for former Sen. Jeff Flake’s seat. 2020 SENATE RACES “My next mission… #FullSpeedAhead #ForArizona,” Kelly tweeted, sharing a campaign video. “I care about people. I care about the state of Arizona. I care about this nation,” Kelly said in the video posted to his Twitter account Tuesday. “So because of that, I’ve decided I’m launching a campaign for the United States Senate.” The video, which runs more than four minutes, gives a detailed account of Kelly’s experience as a former Navy pilot, an astronaut, and being Giffords' husband. “The thing I have to do for my wife is to be able to think clearly and make good decisions…You gotta move ahead and try to make a difference in the world,” Kelly said. “What I learned from my wife is how you use policy to improve people’s lives.” Kelly listed “affordable health care,” job growth, the economy, and climate change as major issues that Arizonans will face in the coming years. REP. MARTHA MCSALLY APPOINTED BY ARIZONA GOVERNOR TO SENATE SEAT HELD BY JOHN MCCAIN “Solving some of the hardest problems requires one thing — and that’s teamwork,” he said. “Partisanship and polarization and gerrymandering and corporate money have ruined our politics and it’s divided us.” He added: “We’ve seen this retreat from science and data and facts and if we don’t take these issues seriously, we can’t solve these problems.” The video concludes with Kelly and Giffords on the couch, speaking together. “So please join us. Damn the torpedoes. Full speed ahead,” they say. Kelly and Giffords have for years pushed Congress to enact gun control measures with little success. They shifted their focus to state legislatures in recent years, helping to strengthen background checks and domestic violence protections, among other modest protections. If Kelly becomes the Democratic nominee, he will be up against McSally — also a veteran, having served in the Air Force as a pilot. The 2020 election will decide who finishes the last two years of McCain's term. The winner would have to run again for a full six-year term in 2022. CLICK HERE TO GET THE FOX NEWS APP Rep. Ruben Gallego of Phoenix is also considering a Senate run, which would likely set up a tough fight for the Democratic nomination. Former Arizona Attorney General Grant Woods, a lifelong Republican who became a Democrat and a fierce critic of Trump, announced last week that he won't run, saying he didn't want to fight in a contested Democratic primary. The Associated Press contributed to this report.",
      "date": "February 12",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Cindy and Meghan McCain respond after CPAC speaker's swipe at late Arizona senator",
      "url": "https://www.foxnews.com/politics/mccain-family-goes-after-conservative-commentator-after-she-take-swipe-at-late-senator-on-immigration",
      "subtitle": "Cindy and Meghan McCain respond after CPAC speaker's swipe at late Arizona senator",
      "author": "Lukas Mikelionis",
      "content": " Two survivors of the late U.S. Sen. John McCain, R-Ariz., responded Friday after conservative commentator Michelle Malkin criticized the senator's legacy on immigration issues during a speech at the Conservative Political Action Conference (CPAC). In her remarks, Malkin took aim at both Democrats and moderate Republicans regarding immigration, arguing that both parties have failed to address the issue adequately, with many GOP lawmakers adopting left-wing views. GOP SENATOR SUBPOENAED AT CPAC WAS TARGET OF 'POLITICAL STUNT,' HIS SPOKESWOMAN SAYS “It's the GOP sell-outs, not just the radical, open-borders left, that is in bed with immigration saboteurs,” Malkin said. “Like the ones who hijacked the tea party movement to shill for amnesty. Those are the real grifters cashing in and practicing deceit at the expense of their base and at the expense of our country. “Sanctuary cities have metastasized and both parties are to blame,” Malkin continued. “And yes, I'm looking at you, retired Paul Ryan, and yes, I'm looking at you, Mitch McConnell.” “And yes, I'm looking at you, Bush family, and yes, I'm looking at you, the ghost of John McCain,” she added -- with the McCain reference receiving cheers and applause from many in the crowd. McCain served in the U.S. Senate from 1987 until his death from brain cancer last August at age 81. He was the Republican nominee for president in 2008 and was also known for his service in the U.S. Navy, including more than five years as a prisoner of war in Vietnam. PENCE, AT CPAC, SLAMS DEMS OVER GREEN NEW DEAL: 'THAT SYSTEM IS SOCIALISM' Malkin's remark prompted Cindy McCain, the senator's widow, to defend her husband on social media. \"You never knew @SenJohnMcCain,\" she wrote in a tweet directed to Malkin. \"You should be so lucky.\" Meghan McCain, the late senator’s daughter and a co-host of ABC's \"The View,\" didn’t directly address Malkin, but retweeted a post made by CNN’s S.E. Cupp, who criticized the conservative commentator. CLICK HERE FOR THE FOX NEWS APP “CPAC was once a place to exchange conservative ideas. Now it’s just a place for agitprop and mean-spirited garbage,” Cupp wrote.",
      "date": "March 2",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Paul Ryan, John McCain break with Trump on Arpaio pardon",
      "url": "https://www.foxnews.com/politics/paul-ryan-john-mccain-break-with-trump-on-arpaio-pardon",
      "subtitle": "Paul Ryan, John McCain break with Trump on Arpaio pardon",
      "author": "",
      "content": "Speaker of the House Paul Ryan opposes President Trump's pardoning of former Sheriff Joe Arpaio, an aide said Saturday, joining Arizona GOP Sen. John McCain in criticizing the decision. \"The speaker does not agree with this decision,” said Doug Andres, a spokesman for Ryan. “Law enforcement officials have a special responsibility to respect the rights of everyone in the United States. We should not allow anyone to believe that responsibility is diminished by this pardon.\" Trump on Friday spared Arpaio, from the Phoenix area, the prospect of serving jail time in granting the first presidential pardon of his turbulent tenure, wiping away the lawman's recent federal conviction stemming from his immigration patrols that focused on Latinos. “The president has the authority to make this pardon, but doing so at this time undermines his claim for the respect of rule of law as Mr. Arpaio has shown no remorse for his actions,” McCain said after the Friday pardon announcement. The pardon has received support from other Arizona Republicans, including Rep. Trent Franks, who said the ex-lawman is a “patriot.” “In his last days, (President) Obama commuted the prison sentence of Chelsea Manning -- a treasonous intelligence analyst who shared a trove of intelligence with the infamous Wikileaks,” Franks, R-Ariz., said Saturday in a statement to Fox News. “While no one can dispute Manning acted to undermine our country's national security, Joe Arpaio has spent a lifetime trying to maintain it. … It is easy to discern that Arpaio is a patriot, while Manning is a traitor.” Beyond McCain and Ryan, top congressional Republicans -- including frequent Trump target Senate Majority Leader Mitch McConnell, of Kentucky -- have yet to issue public statements on the pardoning. However, top congressional Democrats seized on the pardoning in their continuing efforts to throttle Trump’s presidency and lay ground work for the 2018 congressional races and the 2020 White House contest. \"We’re sick to our stomach. Donald Trump just pardoned Joe Arpaio,” House Minority Leader Nancy Pelosi, D-Calif., said in a fundraising letter Saturday. Anne Kirkpatrick, a former prosecutor trying to unseat Arizona GOP Rep. Martha McSally, late Friday night said Arpaio instituted “racist” police policies and attacked Republicans for not opposing the pardon. “Those who remain silent are complicit,” the Arizona Democrat said in a fundraising letter. The White House said Friday that the 85-year-old Arpaio was a \"worthy candidate\" for the pardon, citing his \"life's work of protecting the public from the scourges of crime and illegal immigration.\" Trump granted the pardon less than a month after a judge found Arpaio -- the sheriff of Arizona’s Maricopa County until losing re-election last year -- guilty of a misdemeanor contempt-of-court charge in a trial that was prosecuted by the president's own Justice Department. \"Pardoning Joe Arpaio is a slap in the face to the people of Maricopa County, especially the Latino community and those he victimized as he systematically and illegally violated their civil rights,\" said Phoenix Mayor Greg Stanton, a Democrat. Republican Gov. Doug Ducey said Arpaio should be given credit for his crime-fighting efforts and allowed to \"move on\" and enjoy his retirement. Arpaio earned a national reputation by taking aggressive action to arrest immigrants in the country illegally. But years of legal issues and related costs took a toll on his political power at home, and he was handily defeated by a Democrat in the 2016 election. Arpaio defied court orders that he stop the patrols. Trump issued the pardon seven months after taking office, though it is not unprecedented for a president to issue a pardon in their first year in office. George H. W. Bush granted clemency after seven months in office, said Jeffrey Crouch, a professor of politics at American University who wrote a book on presidential pardons. President Bill Clinton ignited a major controversy on his final day in office with a last-minute pardon for fugitive financier Marc Rich, the ex-husband of a major Democratic fundraiser. Fox News’ Mike Emanuel and The Associated Press contributed to this report.",
      "date": "August 26, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Court files reveal role of McCain, associate in spreading anti-Trump dossier",
      "url": "https://www.foxnews.com/politics/court-files-reveal-role-of-mccain-aide-in-spreading-anti-trump-dossier",
      "subtitle": "Court files reveal role of McCain, associate in spreading anti-Trump dossier",
      "author": "Adam Shaw",
      "content": " Newly unsealed court filings show how the late Sen. John McCain, R-Ariz., and an associate shared with the FBI and a host of media outlets the unverified dossier that alleged the Russians had compromising information on now-President Trump. McCain had denied being the source for BuzzFeed after it published the dossier, which was funded by the Democratic National Committee (DNC) and Hillary Clinton's presidential campaign, but had acknowledged giving it to the FBI. RUSSIAN TECH FIRM USED IN HACKING OF DEMOCRATS, MCCAIN'S ASSOCIATE DISSEMINATED STEELE DOSSIER, UNSEALED DOCUMENTS In a newly unsealed declaration from September, former senior counterintelligence FBI agent Bill Priestap confirmed that the FBI received a copy of the first 33 pages of the dossier in December 2016 from McCain. In another filing, David Kramer -- a former State Department official and McCain associate -- said in a Dec. 13, 2017, deposition that the dossier was given to him by author and former British spy Christopher Steele, which he then provided to multiple journalists at outlets including CNN, BuzzFeed and The Washington Post. The details were first reported by The Daily Caller. The report was also shared with State Department official Victoria Nuland, Obama National Security Council official Celeste Wallander and Rep. Adam Kinzinger, R-Ill. The filings were unsealed as part of a libel case against BuzzFeed by a Russian businessman. In his deposition, Kramer said that McCain gave a copy of the dossier to then-FBI Director James Comey on Dec. 9. Kramer told investigators that it was the sense from Fusion GPS founder Glenn Simpson that “having Senator McCain provide it to the FBI would give it a little more oomph than it had had up until that point.” MCCAIN ASSOCIATED SHARED UNVERIFIED STEELE DOSSIER WITH BUZZFEED, COURT FILING SAYS “I think they felt a senior Republican was better to be the recipient of this rather than a Democrat because if it were a Democrat, I think that the view was that it would have been dismissed as a political attack,” he said. Kramer also described how BuzzFeed News reporter Ken Bensinger came to get hold of the dossier, before the outlet became the first to publish it in its entirety. INSIDE THE TRUMP DOSSIER HANDOFF He said that he showed Bensinger the dossier in December at the McCain Institute, but did not allow him to take pictures of it. But Kramer said he left Bensinger alone to read the memos and, in that time, Bensinger took photos of the dossier. Kramer said he panicked when he saw that BuzzFeed News had published the document in its entirety online on Jan. 10, and immediately sought to have it taken down. CLICK HERE TO GET THE FOX NEWS APP “I called Mr. Bensinger, and my first words out of my mouth were ‘you are gonna get people killed,’” he said. U.S. District Judge Ursula Ungaro recognized in a December 2018 opinion on the libel case that there had been a dispute whether Kramer gave Bensinger a copy of the dossier, or if Bensinger took photos when Kramer was not looking. However, in a later declaration, \"Kramer stated that he had no objection to Bensinger taking a hard copy and had provided hard copies to other journalists,\" Ungaro wrote. The FBI extensively relied on the dossier in its warrant applications to the Foreign Intelligence Surveillance Act (FISA) court in seeking to surveil Trump aide Carter Page -- even though some of the dossier’s claims have been called into question, including a claim that former Trump lawyer Michael Cohen traveled to Prague to pay off Russian hackers and other more salacious claims about Trump himself. Fox News' Catherine Herridge, Lukas Mikelionis and Gregg Re contributed to this report.",
      "date": "March 15",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Senators rally around McCain legacy after fresh barrage of Trump attacks",
      "url": "https://www.foxnews.com/politics/senators-rally-around-mccain-after-fresh-barrage-of-trump-attacks",
      "subtitle": "Senators rally around McCain legacy after fresh barrage of Trump attacks",
      "author": "Adam Shaw",
      "content": " Senators on both sides of the aisle rallied to the defense of the late Sen. John McCain, R-Ariz., on Wednesday, after President Trump launched a fresh round of attacks against the senator’s legacy this week. “Today and every day I miss my good friend John McCain,” Senate Majority Leader Mitch McConnell, R-Ky., tweeted. “It was a blessing to serve alongside a rare patriot and genuine American hero in the Senate. His memory continues to remind me every day that our nation is sustained by the sacrifices of heroes.” ROMNEY 'CAN'T UNDERSTAND' WHY TRUMP WOULD BASH MCCAIN McCain was highly regarded by lawmakers on both sides of the aisle for both his bipartisan approach to negotiation, his six-term service in Congress and his military service -- where he served in Vietnam and was held prisoner and tortured for more than five years. But Trump and McCain repeatedly sparred with one another. In 2015, after McCain had said Trump's platform had \"fired up the crazies,\" Trump had mocked McCain's imprisonment in the Vietnam War, saying: \"I like people that weren't captured.\" But since McCain’s death last year of brain cancer, Trump has not abandoned the feud. DONALD TRUMP'S FEUD WITH MCCAIN FAMILY ESCALATES: 'I WAS NEVER A FAN' “I was never a fan of John McCain, and I never will be,” Trump told reporters in the Oval Office on Tuesday, citing in particular McCain’s vote against the repeal of ObamaCare in 2017. “He campaigned on repealing and replacing ObamaCare for years and then it got to a vote and he said thumbs down,” Trump said. Over the weekend, he blasted McCain for giving to the FBI an uncorroborated dossier alleging that Moscow held compromising information on Trump. He quoted former Independent Counsel Ken Starr as saying this was \"unfortunately a very dark stain against John McCain.\" \"He had far worse 'stains' than this, including thumbs down on repeal and replace after years of campaigning to repeal and replace!\" he tweeted. That caused Sen. Mitt Romney, R-Utah, to say he “can’t understand” why Trump would go after McCain, whom he called “heroic, courageous, patriotic, honorable, self-effacing, self-sacrificing, empathetic, and driven by duty to family, country, and God.” On Tuesday, Sen. Johnny Isakson, R-Ga., told conservative outlet The Bulwark that \"America deserves better\" and that nobody \"is above common decency and respect for people that risk their life for your life.\" CLICK HERE TO GET THE FOX NEWS APP “I just want to lay it on the line, that the country deserves better, the McCain family deserves better, I don’t care if he’s president of United States, owns all the real estate in New York, or is building the greatest immigration system in the world. Nothing is more important than the integrity of the country and those who fought and risked their lives for all of us,” he said. Meanwhile, Democrats joined in pushing back against Trump’s comments, with Senate Minority Leader Chuck Schumer, D-N.Y. announcing Wednesday that he intends to introduce a resolution re-naming the Russell Senate Building after McCain -- calling him an \"American hero.\" Fox News' Liam Quinn and The Associated Press contributed to this report.",
      "date": "March 20",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "John McCain wants to buried next to Navy pal Chuck Larson, not in Arlington",
      "url": "https://www.foxnews.com/politics/john-mccain-wants-to-buried-next-to-navy-pal-chuck-larson-not-in-arlington",
      "subtitle": "John McCain wants to buried next to Navy pal Chuck Larson, not in Arlington",
      "author": "Benjamin Brown",
      "content": " Sen. John McCain, R-Ariz., will be buried \"back where it began,\" next to his old Navy buddy Chuck Larson--not at Arlington National Cemetery where his father and grandfather are buried. The Arizona senator, who has been battling an aggressive form of brain cancer for more than a year, wrote in his upcoming memoir: “The Restless Wave” that he wants to be laid to rest “in the cemetery on the Severn (River) in Maryland, back where it began,” according to azcentral.com. \"I want to smell the rose-scented breeze and feel the sun on my shoulders,\" McCain wrote. \"I want to watch the hawks hunt from the sycamore, and then take my leave bound for a place near my old friend Chuck Larson, in the cemetery on the Severn (River), back where it began.\" A Naval Academy Spokesman confirmed to the paper this week that the 81-year-old senator has a dedicated plot at the cemetery that is close to Larson. McCain and Larson developed a lifelong friendship during their time in the Naval Academy. Larson died in 2014 at the age of 77. The war hero and 2008 presidential nominee wrote in his memoir that Larson was someone he “looked up to since we were boys,” and called it a “privilege and an honor, as a young man and an old one, to serve in Chuck's shadow,” in a statement at the time of his Navy pal’s death, according to the paper.",
      "date": "May 17, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Trump's Jack Johnson pardon praised by John McCain, George Foreman, others",
      "url": "https://www.foxnews.com/politics/trumps-jack-johnson-pardon-praised-by-john-mccain-george-foreman-others",
      "subtitle": "Trump's Jack Johnson pardon praised by John McCain, George Foreman, others",
      "author": "Matt Richardson",
      "content": " President Trump’s posthumous pardon of former heavyweight boxing champion Jack Johnson sparked support from both politicians and the boxing community on Thursday. Johnson, the sport’s first black heavyweight champ, was convicted in 1913 by an all-white jury of violating the Mann Act, which made it illegal to transport a woman across state lines for “immoral” purposes. Johnson fled the country after his conviction, but he agreed years later to return and serve a 10-month jail sentence. He died in 1946. In recent years, Sen. John McCain, R-Ariz. and former Senate Majority Leader Harry Reid, D-Nev., have called for Jackson to be pardoned. But it wasn’t until Thursday when Trump, who was intimately involved with the promotions of Mike Tyson fights in Atlantic City in the 1980s, issued the pardon. McCain said he applauded Trump’s decision. “This action finally rights a historical wrong, restores a great athlete's legacy & closes a shameful chapter in our history,” he wrote. “Jack Johnson! It’s about time,” former heavyweight champion George Foreman tweeted. “2 things he loved Boxing and America. Now he will be rewarded by both.” “Thank you one and all,” actor Sylvester Stallone, who attended the White House ceremony and urged Trump to consider the pardon, said on Instagram. “Justice has been done! Keep punching.” Current WBC heavyweight champion Deontay Wilder, who joined Stallone and former champion Lennox Lewis at the White House Thursday, labeled Johnson “a pioneer, not just in this sport, but for African-Americans throughout the country. “The things that he had to endure, made it possible for me and my family to live the lives we lead today,\" Wilder said in a statement provided to Fox News. “Everything we do in this sport is in honor of the legacy that he left behind. In many ways, we’re still fighting that same fight that Johnson fought a century ago. We have to continue to try to speak truth to power and keep pushing towards a better tomorrow despite rhetoric that’s meant to split us apart. Hopefully this pardon is something symbolic that can help unify, but the most important thing we can do is stay engaged every day and live our values so that our culture doesn’t repeat these mistakes.” Documentary filmmaker Ken Burns, who made a much lauded film about the former champion, said the “pardon reminds us of a racist past and how even today racist remarks and coded words are used to imperil African Americans and to advance an Un-American agenda.” Former two-division title-holder Paulie Malignaggi criticized Trump’s predecessors for not issuing the pardon sooner. “remember when Obama was being petitioned to do this and passed on it?  I do, so don't pretend yous don't.”",
      "date": "May 24, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Trump only ‘hurting himself’ with McCain attacks because they distract from strong economy: Marc Thiessen",
      "url": "https://www.foxnews.com/politics/trump-only-hurting-himself-with-mccain-attacks-because-they-distract-from-strong-economy-marc-thiessen",
      "subtitle": "Trump only ‘hurting himself’ with McCain attacks because they distract from strong economy: Marc Thiessen",
      "author": "Joseph A. Wulfsohn",
      "content": " President Trump’s approval ratings would be much higher if he didn’t go after respected Americans like the late Sen. John McCain, Washington Post columnist Marc Thiessen argued Wednesday. Earlier in the day, at an event in Ohio, Trump continued his attacks against McCain, the longtime senator and former prisoner of war who died of brain cancer last August at age 81. Trump lamented that no one said “thank you” to him for approving Washington-area funeral arrangements for McCain. During Wednesday's \"Special Report\" All-Star” panel, Thiessen -- along with former Democratic National Committee Chairwoman Donna Brazile and Washington Examiner chief congressional correspondent Susan Ferrechio -- weighed in on Trump’s handling of his constant attacks against the late senator. CLICK HERE TO VIEW THE FULL SHOW Thiessen began by expressing he understands why Trump disliked McCain and there are “legitimate grievances,” but the president isn’t “hurting” the senator since he’s dead and that he’s only “hurting himself” because he’s “stepping on his own story” regarding the strong economy. “There are millions of people in this country who are benefiting from the Trump economy who have jobs and opportunity and better lives because of this and they like Trump’s policies but they don’t like him because of things like this,” Thiessen said. “The reason why he’s in the low 40s approval instead of above 50 is persuadable voters look at this and say, ‘I don’t want to support a guy that goes after a dead war hero.’” Ferrechio noted the “big back story” has shown that Trump and McCain have “not liked each other for a long time,” highlighting traded jabs during the 2016 election and McCain’s involvement in the Steele dossier that helped catapult the Russia investigation. She agreed with Thiessen, adding that because of the “complicated” back story, the general public just sees Trump going after a war hero. CLICK HERE TO GET THE FOX NEWS APP Meanwhile, Brazile slammed Trump’s “tirade” against McCain, telling the panel that she learned as a child to “not speak ill of the dead.” “John McCain leaves a legacy, a legacy of service, he leaves a legacy of sacrifice,” Brazile said. “John McCain should be honored for his service, but the criticism ... That’s beneath the office of the presidency.”",
      "date": "March 21",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "McCain replacement Sen. Jon Kyl resigning at end of year",
      "url": "https://www.foxnews.com/politics/mccain-replacement-sen-jon-kyl-resigning-at-end-of-year",
      "subtitle": "McCain replacement Sen. Jon Kyl resigning at end of year",
      "author": "",
      "content": "Sen. Jon Kyl is resigning from the seat he was appointed to less than four months ago following the death of John McCain, Arizona Gov. Doug Ducey announced Friday. Kyl's decision means the Republican governor will need to appoint another replacement lawmaker. The decision by Kyl, 76, was not unexpected. He had retired from the Senate in 2012 and said when he took the appointment in September that he only committed to serving until the end of the year. His resignation is effective Dec. 31. Ducey sidestepped selecting a longer-term replacement after McCain died on Aug. 25, saying he picked Kyl because he was \"the best possible person, regardless of politics\" for the job. But Kyl made it clear he only agreed to the appointment out of a sense of duty and had no plans to stay in the job for long. The choice of the well-respected former senator to fill McCain's seat allowed the Republican governor to avoid controversy in the midst of his re-election bid, but also nearly assured that another vacancy would come soon. Now all attention is on Ducey's pick, who will serve until a special election in 2020 allows voters to select the person who fills the final two years of McCain's six-year term. Ducey said he will pick a replacement \"in the near future.\" Speculation has centered on Ducey's former chief of staff, Kirk Adams, a former state lawmaker who recently resigned from the governor's office; Rep. Martha McSally, who narrowly lost the race for the state's other U.S. Senate seat in November; and Arizona State Treasurer Eileen Klein. Excited about McSally's defeat and the election of Kyrsten Sinema as Arizona's first Democratic senator since the 1990s, several Democrats are already thought to be testing the waters to run in 2020 for the seat. The list includes U.S. Rep. Ruben Gallego, former astronaut Mark Kelly and former Arizona Attorney General Grant Woods, who left the GOP and became a Democrat this year. Kyl's brief resignation letter said he decided to resign at the end of 2018 so that Ducey's new appointee \"can begin the new term with all other senators in January 2019 and can serve a full two (potentially four) years.\" Kyl noted that when he accepted Ducey's appointment that he agreed to serve through December and then re-evaluate whether to serve longer. \"Senator Kyl didn't need to return to the Senate,\" Ducey said in a statement. \"His legacy as one of Arizona's most influential and important political figures was already without question. But he did return, and I remain deeply grateful for his willingness to step up and serve again when Arizona needed him. I wish him and his family all the best.\" McCain died at age 81 at his ranch near Sedona, Arizona just over a year after he announced he had glioblastoma, an aggressive brain cancer that came with a dire diagnosis.",
      "date": "December 14",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Rubio on Trump's attack on McCain legacy: 'I don't get it'",
      "url": "https://www.foxnews.com/politics/rubio-on-trumps-attack-on-mccain-legacy-i-dont-get-it",
      "subtitle": "Rubio on Trump's attack on McCain legacy: 'I don't get it'",
      "author": "Andrew O'Reilly",
      "content": " Sen. Marco Rubio, R-Fla., said Sunday that he doesn’t understand why President Trump has revived his criticism of the late Arizona Sen. John McCain. While admitting that he didn’t always see eye to eye with McCain, Rubio said he respected the longtime lawmaker and Vietnam veteran for his service to the country and was confused as to why Trump continued to attack McCain and his legacy months after the seantor’s death. “I don’t get it, I don’t understand it,” Rubio said on NBC’s “Meet The Press.” “I didn’t agree with John McCain on everything but so what? I honored and I respected his service to the country and his time in the Senate. I always felt he did things he felt passionate about.” DONALD TRUMP'S FEUD WITH MCCAIN FAMILY ESCALATES: 'I WAS NEVER A FAN' Trump last week slammed McCain during a speech to workers at an Army tank plant in Ohio – criticizing the deceased lawmaker for his support of the United States’ wars in the Middle East and his infamous vote against repealing and replacing the Affordable Care Act. Trump tore into McCain’s legacy and in an unusual remark, and took credit for the late senator’s state funeral in Washington late last year. “I endorsed him at his request, gave him the kind of funeral he wanted, which as president of the United States I had to approve,” Trump said. “I don’t care, but I didn’t get a thank you.” “I never liked him much,” Trump said. “I really probably never will.” The president’s recent criticism of McCain and his legacy has rankled many members of his own Republican party – with many GOP lawmakers speaking out in defense of the late Arizona senator. “Today and every day I miss my good friend John McCain,” Senate Majority Leader Mitch McConnell, R-Ky., tweeted. “It was a blessing to serve alongside a rare patriot and genuine American hero in the Senate. His memory continues to remind me every day that our nation is sustained by the sacrifices of heroes.” Trump’s feud with McCain dates back to well before he was elected president. In 2015, after McCain had said Trump's platform had \"fired up the crazies,\" Trump mocked McCain's imprisonment in the Vietnam War, saying: \"I like people that weren't captured.\" The two continued to be at odds until McCain’s death from brain cancer last year. While Trump had remained quiet about his dislike of McCain since the senator’s death, over the weekend the president renewed his attacks on McCain and blasted giving the FBI the uncorroborated Steele dossier alleging that Moscow held compromising information on Trump. CLICK HERE TO GET THE FOX NEWS APP “Spreading the fake and totally discredited dossier ‘is unfortunately a very dark stain against John McCain.’ Ken Starr, Former Independent Counsel,” Trump tweeted. “He had far worse “stains” than this, including thumbs down on repeal and replace after years of campaigning to repeal and replace!” https://twitter.com/realDonaldTrump/status/1107020360803909632 Megan McCain, the late senator’s daughter and a co-host on ABC’s “The View,” tweeted early Wednesday: “As my father always used to say to me - Illegitimi non carborundum” – a mock-Latin aphorism loosely translated as \"Don't let the bastards grind you down.” She followed up on “The View” by saying her father “would think it was so hilarious that our president was so jealous of him that he was dominating the news cycle in death.”",
      "date": "March 24",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Meghan McCain calls Tulsi Gabbard 'the most composed and authentic' in first Dem debate",
      "url": "https://www.foxnews.com/politics/meghan-mccain-tulsi-gabbard-the-most-composed-and-authentic-first-democratic-presidential-debate",
      "subtitle": "Meghan McCain calls Tulsi Gabbard 'the most composed and authentic' in first Dem debate",
      "author": "Danielle Wallace",
      "content": " Meghan McCain complimented 2020 presidential hopeful Tulsi Gabbard’s performance in the first Democratic debate Wednesday night in Miami, describing the congresswoman from Hawaii as “the most composed and authentic” of the evening's 10 candidates. McCain, a co-host of “The View” who is known for her Republican and conservative outlooks, praised Gabbard on Twitter but the tweet was initially removed from her account. TULSI GABBARD CLASHES WITH TIM RYAN OVER AFGHANISTAN, SAYS STAYING INVOLVED IN COUNTRY IS ‘UNACCEPTABLE’ “Tulsi and I literally couldn’t disagree on more (and she fundraised off of my name for calling her out on her relationship with Assad) BUT so far she’s coming across the most composed and authentic,” McCain wrote. Gabbard’s sister, Vrindavan, who was running the candidate’s Twitter page during the debate, posted a screenshot of McCain’s tweet. Vrindavan said McCain, “displayed a moment of courage to tweet this out before deleting it. Tulsi's lived a lifetime of courage - and she won't cave to establishment pressure.” “Didn’t mean to delete,” McCain responded. “We disagree on everything but you did well in the debate.” She then reposted the original tweet to her official page. During Wednesday’s debate, Gabbard spoke of her time serving in Iraq as a member of the Hawaii Army National Guard and said President Trump’s “chickenhawk” Cabinet has drawn the U.S. “to the brink of war with Iran.” She also called U.S. Rep. Tim Ryan's comments on Afghanistan \"unacceptable\" after the Ohio Democrat said the U.S. military needs to be more “engaged” in the war effort there. “Is that what you will tell the parents of those two soldiers who were just killed in Afghanistan?” she said. “‘Well, we just have to be engaged.’ As a soldier, I will tell you, that answer is unacceptable. We have to bring our troops home from Afghanistan. We are in a place in Afghanistan where we have lost so many lives. We've spent so much money.” CLICK HERE TO GET THE FOX NEWS APP Other candidates participating Wednesday were Bill de Blasio,  Julián Castro, Cory Booker, Elizabeth Warren, Beto O'Rourke, Amy Klobuchar, Jay Inslee and John Delaney. Ten more candidates -- including frontrunner Joe Biden -- are set to debate Thursday night. Four candidates were not invited.",
      "date": "June 27",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "John McCain hospitalized for Achilles injury, reaction to cancer therapy",
      "url": "https://www.foxnews.com/politics/john-mccain-hospitalized-for-achilles-injury-reaction-to-cancer-therapy",
      "subtitle": "John McCain hospitalized for Achilles injury, reaction to cancer therapy",
      "author": "",
      "content": "Sen. John McCain was hospitalized over the weekend after he suffered a “minor tear” of his Achilles tendon and side effects from his cancer therapy, his office said in a statement. \"Senator McCain was treated at Walter Reed Medical Center over the weekend for a minor tear in his right Achilles tendon, as well as for other normal and non-life-threatening side effects of cancer therapy,” his office said in a statement on Monday. “Senator McCain has returned to work in the Senate and will be wearing a walking boot until his injured tendon is fully healed,” it added. RAND PAUL RECOVERING FROM 5 BROKEN RIBS AFTER ATTACK AT KENTUCKY HOME McCain tweeted out a photo of him with a walking boot on and the caption: \"I can't tell you how much I hate wearing this boot!\" The Arizona Republican is undergoing treatment for brain cancer. McCain, a 2008 presidential nominee, revealed in July he was diagnosed with glioblastoma, a particularly aggressive type of tumor. More than 12,000 people are diagnosed with glioblastoma, the American Brain Tumor Association reported. “The prognosis is very, very serious,” McCain said on CBS’ “60 Minutes” in late September. He recalled his doctor calling him in July and saying he had to return to the Mayo Clinic in Phoenix while he was driving home to his ranch just outside of Sedona, Ariz. MCCAIN RECALLS HOW HE LEARNED ABOUT BRAIN CANCER “Some say 3 percent, some say 14 percent. It’s a very poor prognosis. So, I just said, ‘I understand, now we’re going to do what we can, get the best doctors we can find, and do the best we can.’ And, at the same time, celebrate with gratitude a life well-lived,” McCain said. He continued, \"I am more energetic and more engaged as a result of this because I know I’ve got to do everything I can to serve this country while I can.\"",
      "date": "November 6, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Sarah Palin says it was a 'gut punch' to be excluded from McCain funeral",
      "url": "https://www.foxnews.com/politics/sarah-palin-says-it-was-a-gut-punch-to-be-excluded-mccain-funeral",
      "subtitle": "Sarah Palin says it was a 'gut punch' to be excluded from McCain funeral",
      "author": "Brooke Singman",
      "content": " Sarah Palin says it was a “gut punch” not to be invited to the funeral of her 2008 running mate, the late Sen. John McCain, last year. Palin, who was tapped as McCain’s pick for vice president during the 2008 race, opened up about the funeral during an interview on “Good Morning Britain.” TRUMP RIPS INTO MCCAIN'S LEGACY, SUPPORT FOR IRAQ WAR DURING SPEECH TO OHIO PLANT WORKERS “I was kinda surprised to be publicly disinvited to the funeral. I think that was an unnecessary step,” Palin told Piers Morgan. “They didn’t have to embarrass me and embarrass others. That was all weird. I hope that doesn’t happen to other people. It’s kind of a gut punch.” McCain, who died last August from brain cancer, reportedly planned his own funeral. According to reports, Palin learned she was not invited to the services through an intermediary, not directly from the McCain family. A Palin family source, at the time, told NBC News that, “Out of respect to Senator McCain and his family we have nothing to add at this point. The Palin family will always cherish their friendship with the McCains and hold those memories dear.” But last May, McCain published a book titled “The Restless Wave,” in which he wrote that he regretted choosing Palin as his running mate instead of his close friend, former U.S. Sen. Joe Lieberman of Connecticut. DONALD TRUMP'S FEUD WITH MCCAIN FAMILY ESCALATES: 'I WAS NEVER A FAN' When he died, Palin posted a pair of tweets touting McCain and his record. “Today we lost an American original,” she wrote. “Sen. John McCain was a maverick and a fighter, never afraid to stand for his beliefs. John never took the easy path in life - and through sacrifice and suffering he inspired others to serve something greater than self.” Later, she wrote: “John McCain was my friend. I will remember the good times. My family and I send prayers for Cindy and the McCain family.” Meanwhile, McCain also reportedly requested that President Trump not attend his funeral, and instead, send Vice President Pence. Last month, Trump tore into McCain’s legacy and took credit for the late senator’s state funeral in Washington last year. “I endorsed him at his request, gave him the kind of funeral he wanted, which as president of the United States I had to approve,” Trump said. “I don’t care, but I didn’t get a thank you.” He added: “I never liked him much. I really probably never will.” Trump’s attacks on McCain drew a rebuke from Republicans, who defended the late senator and his accomplishments. Fox News’ Dom Calicchio and Andrew O’Reilly contributed to this report.",
      "date": "April 2",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Cindy McCain responds to reports that her family will endorse Joe Biden in 2020 race",
      "url": "https://www.foxnews.com/politics/cindy-mccain-responds-to-reports-that-her-family-will-endorse-joe-biden-in-2020-race",
      "subtitle": "Cindy McCain responds to reports that her family will endorse Joe Biden in 2020 race",
      "author": "Kathleen Joyce",
      "content": " Cindy McCain, the widow of late Sen. John McCain, R-Ariz., responded to the reports that her family will endorse former Vice President Joe Biden in the 2020 presidential election. McCain tweeted Wednesday: “Joe Biden is a wonderful man and dear friend of the McCain Family. However, I have no intention of getting involved in presidential politics.” Her daughter, “The View” host Meghan McCain retweeted the remarks. JOE BIDEN OFFICIALLY LAUNCHES 2020 PRESIDENTIAL BID Biden officially announced his candidacy for president Thursday in a video message, capping off weeks of reports that he will join the crowded Democratic field. Biden unsuccessfully ran for president in 1988 and 2008. McCain’s comment comes after a report in the Washington Examiner that said the McCain family would support Biden. The report cited sources close to the family. “The source said they expected Meghan McCain to speak out in favor of Biden should he get the nomination, but a Cindy McCain endorsement could come sooner,” according to the Washington Examiner. CLICK HERE TO GET THE FOX NEWS APP During the 2016 presidential election, Sen. John McCain withdrew his support for then-candidate Donald Trump following the “Access Hollywood” tape. Trump recently criticized McCain by saying he was not “a fan” of the late senator. McCain died in August 2018 after a battle with cancer. Trump has made a habit of attacking McCain, even after his death. Fox News’ Liam Quinn contributed to this report.",
      "date": "April 25",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "McCain successor speculation mounts, amid partisan divide",
      "url": "https://www.foxnews.com/politics/mccain-successor-speculation-mounts-amid-partisan-divide",
      "subtitle": "McCain successor speculation mounts, amid partisan divide",
      "author": "Andrew O'Reilly",
      "content": " Arizona’s Republican governor is navigating a political minefield as he weighs whom to appoint to the late Sen. John McCain's seat. Required by state law to name a replacement to fill the seat until the 2020 election, Gov. Doug Ducey will have to balance the demands of state conservatives – some of whom have soured toward McCain’s criticisms of President Trump and his immigration stance – with the desire to respect the legendary GOP senator's legacy and family by appointing a successor in his image. And he has to do this while the state is in the middle of a heated midterm race to fill the seat being vacated by Republican Sen. Jeff Flake. Primaries for both parties are being held Tuesday. “Ducey’s job is both simple and complex at the same time,” Jason Rose, a political consultant and founder of Rose + Moser + Allyn Public Relations in Scottsdale, told Fox News. “It needs to be someone who can step into McCain’s very big shoes, and that won’t be easy.” While talk of McCain’s replacement has been churning since he was diagnosed with brain cancer more than a year ago, Ducey has refused to discuss possible successors out of respect for McCain and his family. Ducey’s office also noted on Sunday that he will make no announcement of a replacement until after McCain’s burial at his alma mater, the U.S. Naval Academy, later this week. “Out of respect for the life and legacy of Senator John McCain and his family, Governor Ducey will not be making any announcements about an appointment until after the Senator is laid to rest,” Daniel Ruiz II, a senior adviser to Ducey, told PBS. “Now is a time for remembering and honoring a consequential life well lived.” Ducey’s silence on the matter, however, has not stopped analysts from weighing in on who could make the shortlist to replace McCain in the Senate, with everyone from former U.S. Senate Republican whip Jon Kyl to former Rep. Matt Salmon to former ambassador to Finland Barbara Barrett to McCain’s widow, Cindy, being floated. Other names being mentioned: Maj. Gen. Michael McGuire, who heads the Arizona Department of Emergency and Military Affairs and is the adjutant general of the state's Army and Air National Guards; Karrin Taylor Robson, whom Ducey appointed to the state Board of Regents in 2017; and Kirk Adams, the former state House speaker who now serves as Ducey's chief of staff. Some analysts say the choice by Ducey boils down to whether he wants to appoint someone for the long-term or a caretaker who would step aside during the next general election in 2020, in case Ducey himself decides to run for the seat. \"Do I appoint a caretaker or do I appoint someone who will stand for election?\" asked Doug Cole, a former McCain staffer and veteran Arizona strategist. \"Does he choose from the family?\" Some observers predict the governor will be solicitous to the McCain family's wishes. That's led to widespread speculation that Cindy McCain could be selected, likely under the assumption that she would not run for the seat in 2020. But Cindy McCain's politics are largely unknown. Despite his role shepherding the nomination of Brett Kavanaugh into the Supreme Court and Republican reticence to upend that process, another caretaker option would be Kyl, now a Washington lobbyist viewed as a safe, uncontroversial choice. “McCain was an exception to the rule is so many ways,” Rose said. “You can’t really fill his shoes so you have to get someone as close to him as possible. And that would be Jon Kyl. You can’t go wrong with Kyl.” Arizona operatives speculate that one of two former congressmen from the state, John Shadegg and Matt Salmon, also have a chance to fill the seat. They're both GOP stalwarts who don't have a history of feuding with the base. State Treasurer Eileen Klein could also be a strong candidate in 2020 if Ducey wants to pick someone who'd run for election rather than a caretaker, according to Republican operatives. “If Ducey decides to appoint a moderate senator, that could help him in the long-term,” Rose said, adding that the governor faces a weak primary challenge from his right in the state's primary elections Tuesday. The person who previously was seen as McCain's most likely successor is Arizona Rep. Martha McSally. Like the late senator, she's a former fighter pilot — one of the first women to fly in combat and an air force colonel. But she is running for the Senate seat vacated by Flake, who, like McCain, riled the state's conservative base by bucking Trump on immigration and other issues. Like Ducey, McSally faces a primary on Tuesday, but her challenge from the right has been stiffer than the governor's. It's also illustrated how fraught the McCain issue is for Arizona Republicans. One of her rivals, former state senator Kelli Ward, ran against McCain in the 2016 GOP primary. On Saturday, hours before McCain died, Ward speculated on Facebook that the McCain family announced the senator was ending medical treatment on Friday to distract from her final push in the primary. Earlier this month, McSally even avoided mentioning McCain's name while boasting that she'd been with Trump at the signing of the defense bill named in McCain's honor. McCain supporters and the senator's daughter Meghan lacerated McSally for following the president's lead in not mentioning McCain. Whomever gets the nod from Ducey will be in office until the next general election in November 2020. The interim senator would not be obligated to run in that election. The candidate who is then elected to the Senate seat in November 2020 would complete McCain's term, which expires in January 2023. If Ducey chooses one of the state’s current congressional members to fill the seat, then a special election would need to be held to fill that empty spot. According to the Arizona State Legislature, that election would have to be held “not less than 120 nor more than 133 days” after the vacancy occurs. The Associated Press contributed to this report.",
      "date": "August 27, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Klobuchar isn't apologizing to Meghan McCain for invoking father on campaign trail",
      "url": "https://www.foxnews.com/politics/klobuchar-meghan-mccain-president-trump",
      "subtitle": "Klobuchar isn't apologizing to Meghan McCain for invoking father on campaign trail",
      "author": "Joseph A. Wulfsohn",
      "content": " Minnesota senator and 2020 Democratic presidential candidate Amy Klobuchar is not apologizing for invoking the late-Sen. John McCain in an attack aimed at President Trump despite the wishes of his daughter, Meghan McCain. The feud began on Saturday during a campaign event in Des Moines, Iowa, where Klobuchar echoed her late colleague's remarks he told her during Trump's inauguration. “I sat on that stage between Bernie [Sanders] and John McCain, and John McCain kept reciting to me names of dictators during that speech because he knew more than any of us what we were facing as a nation,” Klobuchar told the crowd. \"He understood it. He knew because he knew this man more than any of us did.\" That sparked a response from \"The View\" co-host, who took to Twitter on Monday and urged Klobuchar to not invoker her father during the 2020 election. \"On behalf of the entire McCain family - @AmyKlobuchar please be respectful to all of us and leave my fathers legacy and memory out of presidential politics,\" McCain tweeted. CLICK HERE TO GET THE FOX NEWS APP In a statement made to CNN, the Klobuchar campaign, however, did not offer any apology to the McCain family. “Senator Klobuchar had a long time friendship with Senator McCain, she has defended him against President Trump’s attacks in the past, and she has deep respect for his family,” Klobuchar Campaign Communications Director Tim Hogan stated. “While she was simply sharing a memory, she continues to believe that the best stories about Senator McCain are not about the views he had about President Trump: they’re about McCain’s own valor and heroism.”",
      "date": "May 28",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "USS McCain flap prompts acting defense chief Shanahan to have aide 'look into' matter",
      "url": "https://www.foxnews.com/politics/shanahan-look-into-reports-uss-mccain-trump",
      "subtitle": "USS McCain flap prompts acting defense chief Shanahan to have aide 'look into' matter",
      "author": "Nicole Darrah",
      "content": " Acting Defense Secretary Patrick Shanahan says his chief of staff will look into reports that the White House requested the USS John McCain be hidden from view during President Trump's visit to U.S. troops stationed in Japan. Speaking to reporters in Singapore on Thursday, Shanahan said that he first learned about the mystery surrounding the ship after the Wall Street Journal reported that a U.S. Indo-Pacific Command official told Navy and Air Force officials: \"USS John McCain needs to be out of sight.\" NAVY CHIEF OF INFO ATTEMPTS DAMAGE CONTROL OVER USS MCCAIN ON TWITTER AFTER FIVE YEARS OF INACTIVITY \"I never authorized, I never approved any action around the movement or activity regarding that ship,\" the acting secretary said. \"I would never dishonor the memory of a great American patriot like Sen. John McCain.\" Shanahan added he would never disrespect the young men and women in the crew of the ship. He also said the military \"needs to do their job\" and stay out of politics. The White House, according to the Journal, allegedly sent U.S. Navy and Air Force officials an email requesting that the ship be moved ahead of Trump's visit with the military on the USS Wasp. Trump denied the report on Twitter, writing that he was \"not informed about anything having to do with the Navy Ship USS John S. McCain during my recent visit to Japan.\" Photos reviewed by the news outlet reportedly showed that a tarp was placed over the ship's name before Trump's arrival. But Navy Cmdr. Clay Doss, spokesman for the Navy's 7th Fleet, said in a statement that the photo of the tarp \"is from Friday and it was taken down on Saturday.\" \"Paint barge was also removed ahead of the visit,\" Doss added. \"All ships remained in normal configuration during the President's visit.\" MEGHAN MCCAIN BASHES 'CHILD' TRUMP AFTER REPORT WH WANTED USS MCCAIN MOVED; PRESIDENT SAYS HE WAS UNAWARE Additionally, Rear Adm. Charlie Brown, Navy public affairs officer, tweeted Wednesday night that McCain's name on the ship \"was not obscured during the POTUS visit to Yokosuka on Memorial Day. The Navy is proud of that ship, its crew, its namesake and its heritage.\" The Journal reported, based on people familiar with the matter, that sailors on the USS John S. McCain, who usually wear hats with the ship's name on it, were given the day off when Trump visited. CLICK HERE TO GET THE FOX NEWS APP Trump and McCain had a notably contentious relationship before — and after — the senator died in August 2018 of brain cancer. McCain's daughter, Meghan, tweeted Wednesday that Trump is \"a child who will always be deeply threatened by the greatness of my dads incredible life. There is a lot of criticism of how much I speak about my dad, but nine months since he passed, Trump won't let him RIP.\" Fox News' Lucas Tomlinson and Joseph A. Wulfsohn and the Associated Press contributed to this report.",
      "date": "May 30",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Tributes pour in for Sen. John McCain, remembered as a 'true American hero'",
      "url": "https://www.foxnews.com/politics/tributes-pour-in-for-sen-john-mccain-remembered-as-a-true-american-hero",
      "subtitle": "Tributes pour in for Sen. John McCain, remembered as a 'true American hero'",
      "author": "Paulina Dedaj",
      "content": "  Following the death of Sen. John McCain on Saturday, tributes poured in from both Republicans and Democrats as well as family for the war hero who survived five years as a prisoner of war but finally succumbed to brain cancer. The wife of Sen. McCain, Cindy McCain, said on Twitter “My heart is broken.” “I am so lucky to have lived the adventure of loving this incredible man for 38 years.” She said that he died at home, in the way that he lived his life, “on his own terms, surrounded by the people he loved.” JOHN MCCAIN DEAD AT 81 McCain’s daughter, Meghan, said in a statement that now that her father had passed,“the task of my lifetime is to live up to his example, his expectations, and his love.” President Trump, who had a tumultuous relationship with the Republican senator, shared his “deepest sympathies” for the McCain family over Twitter, adding that his “hearts and prayers are with you.” Vice President Mike Pence tweeted that his family is sending condolences to the McCain family, and said, \"We honor [McCain's] lifetime of service to this nation in our military and in public life.\" Sen. Lindsey Graham, R-S.C., recalled the loss of “one of my dearest friends and mentor.” “America and Freedom have lost one of her greatest Champions,” he said. Graham said that he would “need time to absorb this” but that the McCain family “are in my prayers.” Another close friend of McCain, former U.S. Sen. Joe Lieberman of Connecticut, issued a statement late Saturday. “Although it was clear that John McCain’s life was ending, his death today hurts,\" Lieberman said. \"America has lost one of the greatest patriots and public servants in our history. And I have lost a dear friend.\" \"Words cannot express the sorrow I feel at John McCain's passing,\" wrote Republican Sen. Jeff Flake, of Arizona. \"The world lost a hero and a statesman. Cindy and the McCain family have lost a loving husband and father. I have lost a wonderful friend.\" President Barack Obama, who ran against McCain for the presidency in 2008, said that Americans remain in the former senator’s debt because of all that he did for the country. “John McCain and I were members of different generations, came from completely different backgrounds, and competed at the highest level of politics,” Obama said. “But we shared, for all our differences, a fidelity to something higher – the ideals for which generations of Americans and immigrants, alike have fought, marched, and sacrificed.” “Few of us have been tested the way John once was, or required to show the kind of courage that he did,” Obama stated. “But all of us can aspire to the courage to put the greater good above our own. At John’s best he showed us what that means.” Former President George W. Bush called McCain a friend that he would “deeply miss.” “John McCain was a man of deep conviction and a patriot of the highest order. He was a public servant in the finest traditions of our country.” Former President Bill Clinton also issued a statement: \"John McCain believed that every citizen has a responsibility to make something of the freedoms given by our Constitution, and from his heroic service in the Navy to his 35 years in Congress, he lived by his creed every day,\" Clinton wrote. Former President George H.W. Bush wrote that McCain \"was a patriot of the highest order.\" \"Few sacrificed more for, or contributed more to, the welfare of his fellow citizens — and indeed freedom-loving peoples around the world,\" Bush wrote. Former President Jimmy Carter also released a statement calling McCain “a true patriot.” “Americans will be forever grateful for his heroic military service and for his steadfast integrity as a member o the United States Senate.” McCain, according to Senate Majority Leader Mitch McConnell, \"showed us that boundless patriotism and self-sacifice are not outdated concepts or clichés, but the building blocks of an extraordinary American life.\" \"It's an understatement to say the Senate will not be the same without our friend John,\" McConnell said. \"I will treasure the many memories we've shared together through the years.\" House Speaker Paul Ryan called it “a sad day for the United States.” “Our country has lost a decorated war hero and statesman … he was one of the most courageous men of the century,” he said in a statement. House Minority Leader Nancy Pelosi, D-Calif., remembered McCain as an “undaunted spirit” who \"dedicated his life to defending both America and the American idea.” “He never forgot the great duty he felt to care for our nation’s heroes, dedicating his spirit and energy to ensuring that no man or woman in uniform was left behind on the battlefield or once they returned home,” she said both of his military career and political career. Senate Minority Leader Chuck Schumer, D-N.Y., called McCain one of “few truly great people” you encounter in life. He announced that he would be introducing a resolution to rename the Russell Senate Office Building after the late McCain. Defense Secretary James Mattis said that McCain, as a U.S. Naval officer and a “defiant prisoner of war,” was a man “who steadfastly represented the best ideals of our country” and was “passionately committed” to the U.S. HERE'S A LOOK AT JOHN MCCAIN'S POLITICAL ACCOMPLISHMENTS Mattis said the Department of Defense “will remain forever grateful for the life, the passion, and the example of Senator John McCain.” Arizona Gov. Doug Ducey called McCain \"a giant. An icon. An American hero.\" \"As we mourn his passing and celebrate his truly phenomenal life,\" Ducey added, \"we're also faced with the void John McCain's absence leaves in the heart and soul of our nation.\" Former Arizona Gov. Jan Brewer wrote that McCain's death was \"heartbreaking news.\" She called McCain \"a warrior who fought for his country and for his beloved state of Arizona.\" Former Alaska Gov. Sarah Palin, who was McCain's running mate in 2008, said that on Saturday, the world “lost an American original.” Palin said McCain “was a maverick and a fighter, never afraid to stand for his beliefs … and through sacrifice and suffering he inspired others to serve something greater than self.” “I will remember the good times,” Palin added.",
      "date": "August 26, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Sen. Lindsey Graham pays tribute to John McCain on Senate floor",
      "url": "https://www.foxnews.com/politics/sen-lindsey-graham-pays-tribute-to-john-mccain-on-senate-floor",
      "subtitle": "Sen. Lindsey Graham pays tribute to John McCain on Senate floor",
      "author": "Robert Gearty",
      "content": " Sen. Lindsey Graham, R-S.C., paid an emotional tribute to the life and legacy of his close friend Sen. John McCain on the Senate floor Tuesday. \"He could be tough but the joy that you received from being with him will sustain you for a lifetime,”  Graham said. “And I am so lucky to have been in his presence. McCain and Graham’s friendship dates back to the 1990s. The Arizona senator died at 81 Saturday, following a year-long battle with brain cancer. \"I do not cry for a perfect man,\" Graham said during his remarks. \"I cry for a man who had honor and always was willing to admit to his imperfection.\" He said McCain teased him all the time. SEN. LINDSEY GRAHAM OPENS UP ON DEATH OF FRIEND MCCAIN, PROMISES 'THE SEND-OFF HE DESERVES' \"Humiliation and affection were constant companions,” Graham said. \"The more he humiliated you, the more he liked you,\" the South Carolina senator said on the Senate floor— adding that he had plenty of humiliation. \"I am going to miss these dumb jokes,\" he said. Graham said he remembers above all else the concession speech McCain gave the night he lost the presidency to Barrack Obama in 2008. “John taught us how to lose,\" he said. “When you go throughout the world people remember his concession speech as much as anything else. There are so many countries where you can't afford to lose, 'cause they kill you.\" He continued: “And John said that night ‘President Obama is now my president.’ So he healed the naton at a time he was hurt.” Graham said he had fashioned his speech in the guise of a military “after action” report with the code name “Operation Maverick.” FAREWELL STATEMENT FROM JOHN MCCAIN On \"Hannity\" Monday night, Graham said his pal was not perfect. \"But good, decent, honorable is John McCain,\" he said. And McCain loved his country, Graham said, adding, \"he had a romantic view of the nation that never died.\"",
      "date": "August 28, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "John McCain honored at US Capitol, lawmakers pay tribute to 'generational leader'",
      "url": "https://www.foxnews.com/politics/john-mccain-honored-at-us-capitol-lawmakers-pay-tribute-to-generational-leader",
      "subtitle": "John McCain honored at US Capitol, lawmakers pay tribute to 'generational leader'",
      "author": "Adam Shaw",
      "content": " Washington D.C. gathered Friday to pay its respects to “generational leader” John McCain as the veteran senator’s casket arrived to lie in state under the Capitol rotunda -- with political leaders paying tribute to McCain’s service to the country in both the military and in Congress. McCain, who died Saturday at 81 after a fight with brain cancer, was honored by House Speaker Paul Ryan, R-Wis., Senate Majority Leader Mitch McConnell, R-Ky., and Vice President Mike Pence. With members of McCain’s family in attendance, Pence said Americans “marveled at the iron will of John McCain” and praised him for holding fast “to his faith in America through six decades of service.” JOHN MCCAIN'S FUNERAL EVENTS: EVERYTHING YOU NEED TO KNOW “On behalf of a grateful nation, we will ever remember that John McCain served his country and John McCain served his country honorably.’ “Generations of Americans will continue to marvel at the man who lies before us, the cocky, handsome naval aviator who barely scraped through school, and then fought for freedom in the skies; who witnessed to our highest values, even through terrible torture; and who became a generational leader in the United States Senate, where our nation airs its great debates,” McConnell said. Ryan said that \"though the highest office eluded him, he attained what is far more enduring, the abiding affection of his fellow citizens and an example for future generations.\" McCain will lie in state throughout the day under the rotunda, where a public visitation will also be held. MCCAIN'S FUNERAL WILL BE ATTENDED BY OBAMA, BUSH AND OTHERS: A LIST OF NOTABLE PEOPLE PAYING THEIR RESPECTS On Saturday, McCain’s casket will move to Washington National Cathedral for a funeral service. Presidents Barack Obama and George W. Bush will speak. President Trump, who had publicly feuded with McCain, is not expected to attend. Tributes have poured in from both sides of the aisle for the Republican senator and 2008 presidential nominee. On Thursday, former Vice President Joe Biden remembered McCain as a brother, and said the two were “cockeyed optimists” in a memorial service for McCain at a church in Phoenix. Biden, a Democrat, declared that McCain’s “legacy is going to continue to inspire generations.” “John McCain’s impact on America is not over,” Biden said. “It is not hyperbole. It is not over. I don’t think it’s even close.” Fox News’ Brooke Singman and The Associated Press contributed to this report.",
      "date": "August 31, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "John McCain has brain tumor, hospital says",
      "url": "https://www.foxnews.com/politics/john-mccain-has-brain-tumor-hospital-says",
      "subtitle": "John McCain has brain tumor, hospital says",
      "author": "",
      "content": "Sen. John McCain was diagnosed with a brain tumor following an earlier craniotomy to remove a blood clot from above his left eye, the Mayo Clinic Hospital in Phoenix said on Wednesday. The hospital's examination of the tissue revealed that a primary brain tumor, know as a glioblastoma, was associated with the blood clot. McCain and his family are reviewing further treatment options, which may include a combination of chemotherapy and radiation. \"Further consultations with Senator McCain's Mayo Clinic care team will indicate when he will return to the United States Senate,\" his office said in a statement. The announcement follows a procedure that McCain, 80, had on July 14. MCCONNELL DELAYS ACTION ON HEALTH CARE AFTER MCCAIN SURGERY According to his office, McCain is \"in good spirits as he continues to recover at home with his family in Arizona.\" McCain ran for president twice. He lost the GOP nomination to George W. Bush in 2000 and was the Republican nominee in 2008 before losing to Barack Obama in the general election. McCain was a prisoner of war in Vietnam for more than five years. Injuries from being tortured left the veteran Arizona senator unable to lift his arms above his head. MCCAIN: NO 'PARTICIPATION TROPHIES' FOR GOP AFTER HEALTH CARE FAILURE \"Senator John McCain has always been a fighter,\" President Donald Trump said in a statement. \"Melania and I send our thoughts and prayers to Senator McCain, Cindy and their entire family. Get well soon.\" McConnell said, “We all look forward to seeing this American hero again soon.” McCain's daughter, Meghan, is a co-host of Fox News Channel's \"Outnumbered.\" \"It won't surprise you to learn that in all this, the one of us who is most confident and calm is my father,\" Meghan wrote on Twitter. \"He is the toughest person I know. The cruelest enemy could not break him. The aggressions of political life could not bend him. So he is meeting this challenge as he has every other. Cancer may afflict him in many ways: but it will not make him surrender. Nothing ever has.\"",
      "date": "July 19, 2017",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "John McCain: From POW to politician",
      "url": "https://www.foxnews.com/politics/john-mccain-from-pow-to-politician",
      "subtitle": "John McCain: From POW to politician",
      "author": "",
      "content": "",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Meghan McCain, Obama knock Trump at John McCain's funeral service: 'America was always great'",
      "url": "https://www.foxnews.com/politics/meghan-mccain-obama-knock-trump-at-john-mccains-funeral-service-america-was-always-great",
      "subtitle": "Meghan McCain, Obama knock Trump at John McCain's funeral service: 'America was always great'",
      "author": "Adam Shaw",
      "content": " Meghan McCain and President Barack Obama took apparent swipes at President Trump on Saturday in a eulogy for John McCain -- who sparred with Trump on a number of occasions before his death last week of brain cancer. \"The America of John McCain has no need to be made great again because America was always great,' McCain's daughter said, in what appeared to be a reference to Trump's presidential campaign slogan: \"Make America Great Again.\" The remarks were made during a funeral service at Washington National Cathedral for the Arizona Republican, who died last week of brain cancer. Obama's jabs were more subtle but still appeared to be directed at the current occupant of the White House. He derided those in politics who traffic in \"bombast and insult and phony controversies and manufactured outrage.\" He also attacked \"a politics that pretends to be brave and tough but in fact is born of fear.\" \"John called on us to be bigger than that. He called on us to be better than that,” he said. It was Meghan McCain who had the most searing swipes at the president however. Notably she said that her father's passing represented the passing of \"American greatness. The real thing, not cheap rhetoric from men who will never come near the sacrifice he gave so willingly, nor the opportunistic appropriation of those who lived lives of comfort and privilege while he suffered and served.\" Former President George W. Bush also paid tribute to McCain. \"John – as he was the first to tell you – was not a perfect man. But he dedicated his life to national ideals that are as perfect as men and women have yet conceived,\" he said. \"He was motivated by a vision of America carried ever forward, ever upward, on the strength of its principles.\" The funeral service notably did not feature President Trump, who had feuded with McCain, particularly during the presidential campaign. In 2015, after McCain had said Trump's platform had \"fired up the crazies,\" Trump had mocked McCain's imprisonment in the Vietnam War, saying: \"I like people that weren't captured.\" Trump has also fumed about McCain's vote last year to kill off a bill to reform ObamaCare. Both Trump's daughter Ivanka and son-in-law Jared Kushner were in attendance. Trump, meanwhile, went to the Trump National Golf Club in Virginia. He also tweeted about subjects including the North American Free Trade Agreement (NAFTA) and the Russian investigation. A six-term senator and a Vietnam veteran who was held as a prisoner of war for more than five years, McCain pushed for bipartisanship on the Hill. He ran against Bush for the Republican presidential nomination in 2000. He clinched the nomination in 2008 but was defeated in the presidential election by Obama. FAREWELL STATEMENT FROM JOHN MCCAIN Other notable speakers included former Secretary of State Henry Kissinger and former Connecticut Sen. Joe Lieberman. \"His death seems to have reminded the American people that these values are what makes us a great nation, not the tribal partisanship and personal attack politics that have recently characterized our life, \" Lieberman, who McCain considered for his vice-presidential nominee, said. McCain’s pallbearers included actor Warren Beatty and Russian dissident Vladimir Kara-Murza, as well as former Vice President Joe Biden and former New York City Mayor Michael Bloomberg. Earlier Saturday, his casket traveled to the cathedral after stopping at the Vietnam Veterans Memorial, where McCain’s wife Cindy laid a wreath. Defense Secretary James Mattis and White House Chief of Staff John Kelly accompanied her. On Friday colleagues, family and friends paid tribute to his service both in the military and the Congress as he lay in state underneath the Capitol rotunda. JOHN MCCAIN HONORED AT US CAPITOL, LAWMAKERS PAY TRIBUTE TO 'GENERATIONAL LEADER' With members of McCain’s family in attendance, Vice President Mike Pence said Americans “marveled at the iron will of John McCain” and praised him for holding fast “to his faith in America through six decades of service.” “Generations of Americans will continue to marvel at the man who lies before us, the cocky, handsome naval aviator who barely scraped through school, and then fought for freedom in the skies; who witnessed to our highest values, even through terrible torture; and who became a generational leader in the United States Senate, where our nation airs its great debates,” Senate Majority Leader Mitch McConnell, R-Ky., said. Tributes have poured in from both sides of the aisle for the Republican senator and 2008 presidential nominee. On Thursday, former Vice President Joe Biden remembered McCain as a brother, and said the two were “cockeyed optimists” in a memorial service for McCain at a church in Phoenix. Biden, a Democrat, declared that McCain’s “legacy is going to continue to inspire generations.” McCain is to be buried Sunday at his alma mater, the U.S. Naval Academy, next to his best friend from the Class of 1958, Adm. Chuck Larson. The Associated Press contributed to this report.",
      "date": "September 1, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Jon Kyl to replace John McCain: 3 things to know about the former Arizona senator",
      "url": "https://www.foxnews.com/politics/jon-kyl-to-replace-john-mccain-3-things-to-know-about-the-former-arizona-senator",
      "subtitle": "Jon Kyl to replace John McCain: 3 things to know about the former Arizona senator",
      "author": "Madeline Farber",
      "content": " Former Arizona senator Jon Kyl was tapped to replace Sen. John McCain, who recently lost his battle to an aggressive form of brain cancer. Arizona Gov. Doug Ducey announced the news Tuesday, writing on Twitter that he is “deeply grateful to Senator Kyl for agreeing to succeed his friend and colleague of so many years.” Kyl will serve as a placeholder and is not expected to run in 2020 — the year voters will decide who will fill McCain’s seat for the following two years. After that, the seat will be open for a full six-year term. McCain's widow, Cindy, tweeted: \"Jon Kyl is a dear friend of mine and John's. It's a great tribute to John that he is prepared to go back into public service to help the state of Arizona.\" ARIZONA PRIMARIES FOCUS ON EDUCATION, IMMIGRATION: RACES TO WATCH Kyl was a longtime Republican senator in Arizona, serving from 1995 to 2012 before retiring from Congress in 2013. He left as the second highest-ranking Republican senator. Kyl, a longtime friend and colleague of McCain, wrote in The Weekly Standard following McCain’s death that the former Vietnam war hero “faced his inevitable end with courage and grace.” In light of the news, here are three things to know about Kyl. After retiring from Congress in 2013, Kyl, 76, joined the law firm Covington & Burling as part of its “expansion of its public policy and government affairs practice,” Politico reported that same year. According to his biography on the firm’s website, Kyl “advises companies on domestic and international policies that influence U.S. and multinational businesses and assists corporate clients on tax, health care, defense, national security and intellectual property matters among others.” The same year he joined the firm, he told Politico he received “several offers” but “had [his] eye on Covington from day one.” “I had a serious law practice, and with the experience I gained in Congress, I think I have acquired the knowledge and judgment to help clients that reflects my legal training and experience in Congress,” he told the publication. Rather recently, in March, Kyl was one of the leading attorneys from the firm who helped scrap Broadcom Limited’s hostile takeover of Qualcomm, Inc. The firm secured the deal after Trump blocked the proposed acquisition, citing national security reasons, the firm said in a statement. Unlike McCain — who opposed a partial repeal of former President Obama’s health care law before he died, for example — Republicans are hopeful Kyl will be a “reliable partisan vote,” The Associated Press reported. \"I think McCain would be very happy with the pick. Honors his legacy while putting some major horsepower for Arizona in the seat, at least for now,\" Doug Cole, a longtime Republican consultant and former McCain aide, told The Associated Press. In July, the former senator agreed to serve as President Trump’s Supreme Court nominee Brett Kavanaugh’s “sherpa” during his confirmation process. TRUMP'S SUPREME COURT PICK NEEDS SENATE APPROVAL: A LOOK AT THE CONFIRMATION PROCESS As “sherpa,” or escort, Kyl “will be tasked with shepherding Trump’s pick through the Senate, much in the same way former New Hampshire Sen. Kelly Ayotte helped to pave a path for Justice Neil Gorsuch last year,” The National Law Journal previously reported. This isn’t the first time Kyl has served in this role. The National Law Journal also reported the former senator, who has a “deep knowledge of the Senate Judiciary Committee,” previously served on the committee during “four of the last five Supreme Court justices’ confirmation hearings.” In fact, The Arizona Republic reported Kyl also served as Attorney General Jeff Sessions’ sherpa ahead of his confirmation hearing. The Associated Press contributed to this report.",
      "date": "September 4, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Meghan McCain to Amy Klobuchar: Leave my father's legacy out of politics",
      "url": "https://www.foxnews.com/politics/meghan-mccain-amy-klobuchar-tweet-trump-dictators",
      "subtitle": "Meghan McCain to Amy Klobuchar: Leave my father's legacy out of politics",
      "author": "Charles Creitz",
      "content": " Meghan McCain responded to Sen. Amy Klobuchar's claim the late Sen. John McCain \"kept reciting to me names of dictators\" during President Trump's inaugural address. McCain took to Twitter Monday to criticize Klobuchar, D-Minn., a 2020 presidential candidate, for invoking her father's \"legacy and memory\" during a campaign event. \"On behalf of the entire McCain family, [Amy Klobuchar], please be respectful to all of us and leave my father's legacy and memory out of presidential politics,\" McCain, a co-host on \"The View,\" wrote. At a Saturday event in Iowa, Klobuchar claimed Sen. McCain, R-Ariz., \"kept reciting to me names of dictators during that speech because he knew more than any of us what we were facing as a nation.\" ARNOLD SCHWARZENEGGER CALLS DONALD TRUMP'S ATTACKS ON JOHN MCCAIN 'UNACCEPTABLE,' MOCKS PRESIDENT'S PHYSIQUE \"He understood it. He knew because he knew [Trump] more than any of us did,\" Klobuchar said in her speech, as The Hill reported. Klobuchar called Trump's inauguration \"dark\" and claimed the \"arch that we are on - this arch of justice - started the day after\" the president formally took office, according to the St. Louis Post-Dispatch. CLICK TO GET THE FOX NEWS APP Trump and the Arizona senator had a tense relationship, with then-candidate Trump claiming at a 2015 event that the Vietnam War veteran \"was a war hero because he was captured.\" After Trump held a joint news conference in 2018 with Russian President Vladimir Putin, McCain responded in a statement claiming \"the damage inflicted by President Trump’s naiveté, egotism, false equivalence, and sympathy for autocrats is difficult to calculate.\" Tim Hogan, a spokesman for Amy for America responded to the controversy, saying in a statement that Klobuchar had a \"long-term friendship\" with McCain and has defended him against Trump's criticisms. \"She has deep respect for his family. While she was simply sharing a memory, she continues to believe that the best stories about Senator McCain are not about the views he had about President Trump: they are about McCain’s own valor and heroism,\" Hogan said. Fox News' James Rogers contributed to this report.",
      "date": "May 27",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "John McCain undergoes surgery for intestinal infection, listed as stable",
      "url": "https://www.foxnews.com/politics/john-mccain-undergoes-surgery-for-intestinal-infection-listed-as-stable",
      "subtitle": "John McCain undergoes surgery for intestinal infection, listed as stable",
      "author": "Matt Richardson",
      "content": " Arizona Sen. John McCain underwent surgery during the weekend to “treat an intestinal infection related to diverticulitis,” his office said on Monday. McCain, 81, who is also battling brain cancer, is said to be in “stable condition” after he was admitted to the Mayo Clinic in Phoenix. “Over the last few months, Senator McCain has been participating in physical therapy at his home in Cornville, Arizona, as he recovers from the side effects of cancer treatment,” McCain’s office said in a statement. “He has remained engaged on his work as Chairman of the Senate Armed Services Committee, and has enjoyed frequent visits from his family, friends, staff and Senate colleagues. “Senator McCain and his family are grateful to the senator’s excellent care team, and appreciate the support and prayers they continue to receive from people all over the country,” his office said. Meghan McCain, the senator's daughter and current co-host of \"The View,\" noted her father's \"intense grit and determination\" in a Monday evening tweet. \"Thank you to the doctors at Mayo Clinic in Phoenix and to everyone who is praying for him,\" she wrote. McCain, the long-time Republican Arizona senator and 2008 GOP presidential nominee, was diagnosed in July with brain cancer. “The prognosis is very, very serious,” McCain said at the time. “Some say three percent, some say 14 percent. It’s a very poor prognosis. So, I just said, ‘I understand, now we’re going to do what we can, get the best doctors we can find, and do the best we can.’ And, at the same time, celebrate with gratitude a life well-lived.” According to the American Brain Tumor Association, more than 12,000 people a year are diagnosed with glioblastoma, a particularly aggressive type of brain tumor. The American Cancer Society puts the five-year survival rate for patients over 55 at about 4 percent. Fox News' Chad Pergram contributed to this report.",
      "date": "April 16, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Meghan McCain bashes 'child' Trump after report WH wanted USS McCain moved; president says he was unaware",
      "url": "https://www.foxnews.com/politics/meghan-mccain-donald-trump-feud",
      "subtitle": "Meghan McCain bashes 'child' Trump after report WH wanted USS McCain moved; president says he was unaware",
      "author": "Joseph A. Wulfsohn",
      "content": " Meghan McCain has opened fire on President Trump, as the ongoing family feud heated up again. McCain took aim at the president after the Wall Street Journal reported on Wednesday night that an email sent to U.S. Navy and Air Force officials requested that the “USS John McCain needs to be out of sight\" ahead of Trump's recent visit to Japan. \"Please confirm #3 will be satisfied,\" an official reportedly wrote, according to the Journal. Trump denied knowing the White House ordered the naval vessel named to honor his political nemesis, tweeting that he was \"not informed about anything having to do with the Navy Ship USS John S. McCain during my recent visit to Japan.\" But before the president had been able to send his tweet, McCain had fired off one of her own. \"Trump is a child who will always be deeply threatened by the greatness of my dads incredible life,\" the co-host of \"The View\" tweeted. \"There is a lot of criticism of how much I speak about my dad, but nine months since he passed, Trump won't let him RIP. So I have to stand up for him. It makes my grief unbearable.\" Fox News contacted the White House for comment on the report. The Journal reported, citing a photo, that a tarp had covered the ship's name before the president's trip. The paper also reported that after the tarp came down, a barge moved nearby, obscuring the name. However, the U.S. Navy's Seventh Fleet, Cmdr. Clay Doss, said: \"The picture of the Tarp is from Friday and it was taken down on Saturday. Paint barge was also removed ahead of the visit. All ships remained in normal configuration during the President's visit.\" Defense Secretary Patrick Shanahan \"was not aware of the directive to move the USS John S McCain nor was he aware of the concern precipitating the directive,\" his spokesman, Joe Buccino, said. CLICK HERE TO GET THE FOX NEWS APP The president repeatedly has bashed the late-McCain long after his passing in August 2018, continuing to place blame on his \"thumbs down\" vote that derailed efforts to pass the \"skinny repeal\" of Obamacare. Trump has also declared he was \"was never a fan\" of the late-Senator. Meghan McCain has frequently defender her father on Twitter and on \"The View.\" Fox News' Lucas Tomlinson in Jakarta, Indonesia, contributed to this report.",
      "date": "May 29",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Romney 'can’t understand' why Trump would bash McCain",
      "url": "https://www.foxnews.com/politics/romney-cant-understand-why-trump-would-bash-mccain",
      "subtitle": "Romney 'can’t understand' why Trump would bash McCain",
      "author": "Paulina Dedaj",
      "content": " Utah Republican Sen. Mitt Romney came to the defense of his late friend, Sen. John McCain, on Tuesday and criticized President Trump for what he called disparaging remarks. Romney took to Twitter to write that he couldn’t “understand why” Trump would go after McCain “once again,” referencing a comment Trump made about not being “a fan” of the Arizona Republican after tweeting over the weekend about the “stains” on his career. MCCAIN HAS SHARP RESPONSE TO TRUMP’S JOHN MCCAIN DOSSIER TWEET “I can’t understand why the President would, once again, disparage a man as exemplary as my friend John McCain: heroic, courageous, patriotic, honorable, self-effacing, self-sacrificing, empathetic, and driven by duty to family, country, and God,” Romney’s tweet read. McCain died last August after a battle with cancer. Trump tweeted on Saturday about new reports involving McCain that said the senator and an associate had shared with the FBI and various media outlets the unverified dossier alleging that Moscow held compromising information on Trump. “He had far worse ‘stains’ than this, including thumbs down on repeal and replace [of the Obama-era Affordable Care Act] after years of campaigning to repeal and replace!” Trump tweeted Saturday. DONALD TRUMP’S FEUD WITH MCCAIN FAMILY ESCALATES: ‘I WAS NEVER A FAN’ McCain’s daughter, Meghan, fired back with a tweet of her own and continued the personal feud during an emotional segment on “The View” on Monday. “He spends his weekend obsessing over great men because he knows it, I know it, and all of you know it, he will never be a great man,” she said. ROMNEY, ANSWERING CRITICS, SAYS COUNTRY ‘IS AS DIVIDED AS EVER’ SINCE TRUMP PRESIDENCY “My father was his kryptonite in life and he was kryptonite in death.” Trump then told reporters on Tuesday that he was “never a fan” of McCain and that he “never will be.” Trump and Romney have an ongoing feud of their own. CLICK HERE TO GET THE FOX NEWS APP Early this year, Romney wrote a scathing op-ed in The Washington Post in which he wrote that Trump “has not risen to the mantle of the office.” He later said the country was as “divided as I've ever seen it.” Fox News' Liam Quinn contributed to this report.",
      "date": "March 19",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "John McCain's political accomplishments",
      "url": "https://www.foxnews.com/politics/john-mccains-political-accomplishments",
      "subtitle": "John McCain's political accomplishments",
      "author": "Kaitlyn Schallhorn",
      "content": " John McCain was a U.S. senator for more than three decades. Before that, he was a congressman. And during his tenure in the Senate, he became the Republican nominee for president. McCain died Saturday at age 81 after suffering from glioblastoma, an aggressive brain tumor. Before McCain was a politican, he served in the U.S. Navy in the Vietnam War. He was a prisoner of war for more than five years and suffered lasting injuries, including to his arms and right leg. Here's a look at some things McCain accomplished throughout his lengthy political career. While McCain's job as a liaison to the Senate was supposedly more of a \"glorified valet,\" according to the Los Angeles Times, the Navy veteran turned the position into what the newspaper called \"an apprenticeship\" that would help launch his political career. The Arizonan won his first campaign in November 1982 when he was elected to the U.S. House of Representatives. McCain had moved to Arizona in 1982. He was re-elected to the House in 1984. McCain replaced longtime Republican Sen. Barry Goldwater in the Senate in a 1986 election. He would continuously be re-elected to the Senate until his death. The Keating Five scandal refers to a group of senators who were accused of meeting with federal banking regulators on behalf of financier Charles Keating Jr. Aside from McCain, the Keating Five included: Sens. Alan Cranston, D-Calif., Dennis DeConcini, D-Ariz., John Glenn, D-Ohio, and Donald Riegle, D-Mich. The five senators allegedly attempted to pressure federal regulators on behalf of Keating – who was a massive campaign contributor to the five and would eventually spend time in prison for fraud related to his Lincoln Savings and Loan Association. The FBI and Senate Ethics Committee investigated. McCain was given a mild rebuke for his involvement in the scandal. At the time of his death, McCain was the only one of the five still serving in the U.S. Senate. McCain is credited with being instrumental in helping to revive a diplomatic relationship between the U.S. and Vietnam. He also praised former President Bill Clinton for restoring that tie in 1995. “Human rights progress in Vietnam should also be better served by restoring relations with that country,” McCain said in a 1995 statement. “The Vietnamese have already developed complex relations with the rest of the free world. Instead of vainly trying to isolate Vietnam, the United States should test the proposition that greater exposure to Americans will render Vietnam more susceptible to the influence of our values.” McCain sponsored the Veterans Hospice Benefit Act in 1991 that, in part, created a pilot program that provided hospice care for terminally ill veterans. McCain co-sponsored the Agent Orange Act in 1991 – legislation that affirmed certain diseases suffered by veterans could be the result of harmful chemical exposure related to their service. That recognition would make those veterans eligible for specific benefits. Following McCain’s brain cancer diagnosis, there was speculation his illness could be related to chemicals he came into contact with while in Vietnam. McCain would serve as chairman of the Senate Committee on Commerce, Science & Transportation from 1997 until 2001. He would also resume the role from 2003 to 2005. The committee handles issues such as: aviation, communications, transportation security, fisheries, disasters, space, tourism, consumer issues and product safety, among many other things. TIME magazine named McCain one of the “25 Most Influential People in America” in 1997. In Nashua, N.H., McCain officially announced his candidacy for the Republican nomination for president on Sept. 27, 1999. “I don’t begin this mission with any sense of entitlement. America doesn’t owe me anything,” McCain said. “I am the son and grandson of Navy admirals, and I was born into America’s service. It wasn’t until I was deprived of her company that I fell in love with America, and it has been my honor to serve her and her great cause of freedom.” “It is because I owe America more than she has ever owed me that I am a candidate for president of the United States,” he said. McCain would eventually endorse eventual President George W. Bush, but the two didn’t see eye-to-eye on issues, according to reports at the time. Bush said McCain as his primary opponent made him “a better candidate.” Along with then-Sen. Russ Feingold, D-Wis., McCain introduced the Bipartisan Campaign Reform Act – or the McCain-Feingold Act. The legislation enacted regulations of political campaign financing, particularly with soft money contributions. McCain served as the chairman of the Indian Affairs Committee from 2005 to 2006. McCain was part of the so-called “Gang of 14” – a group of senators who worked together to end a kerfuffle over judicial nominations. Aside from McCain, the group included: Sens. Robert Byrd, D-W.Va.; Lincoln Chaffee R-R.I.; Susan Collins, R-Maine; Mike DeWine, R-Ohio; Lindsey Graham, R-S.C.; Daniel Inouye, D-Hawaii; Mary Landrieu, D-La.; Joe Lieberman, D-Conn.; Ben Nelson, D-Neb.; Mark Pryor, D-Ark.; Ken Salazar, D-Colo.; Olympia Snowe, R-Maine; and John Warner, R-Va. Only Graham and Collins remain in the Senate today. Along with the late Sen. Ted Kennedy, D-Mass., McCain pushed for immigration reform that would include, among other things, a pathway to citizenship for some undocumented immigrants. The bill also called for Mexico to crack down on its own border security and take steps to combat immigrant smugglers, the Washington Times reported then. In 2006, McCain and Kennedy signed onto another immigration reform bill that would make it out of the Senate. This bill, too, would call for a strengthening of the U.S. border with Mexico and provide a pathway to citizenship for certain undocumented immigrants. After teasing his announcement on news programs, McCain officially announced – again from New Hampshire – that he was putting his hat in the ring for the presidency. Surprising many, McCain picked then-Alaska Gov. Sarah Palin as his running mate. “She’s not from these parts, and she’s not from Washington, but when you get to know her, you’re going to be as impressed as I am,” McCain said then. McCain lost the presidency to Barack Obama, a senator from Illinois. Joe Biden – who is a friend of McCain’s – was Obama’s running mate. McCain was part of the bipartisan so-called “Gang of Eight” senators who came up with a comprehensive immigration reform bill in 2013. Aside from McCain, the group included: Sens. Michael Bennet, D-Colo.; Dick Durbin, D-Ill.; Jeff Flake, R-Ariz.; Lindsey Graham, R-S.C.; Bob Menendez, D-N.J.; Marco Rubio, R-Fla.; and Chuck Schumer, D-N.Y. Their bill passed the Senate but would die in the House of Representatives. It would also become a point of contention for Republicans in the future. McCain traveled to Syria in 2013 to meet with rebels in the conflicted country – becoming the highest ranking U.S. official to do so at the time. McCain also traveled to Egypt in 2013 and said the ousting of former President Mohamed Morsi was a “coup.” Along with longtime colleague and friend Sen. Lindsey Graham, R-S.C., McCain pushed for the U.S. to “suspend assistance to Egypt” after the military removed Morsi from office. McCain traveled to Ukraine in 2013 and talked to anti-government protesters who wanted the country's government to align more with Europe than Russia. \"We are here to support your just cause, the sovereign right of Ukraine to determine its own destiny freely and independently. And the destiny you seek lies in Europe,\" McCain said during his address. McCain served as the chairman of the Senate’s Armed Services Committee since 2015. At the time, the New York Times described the opportunity as McCain’s “dream job” and the “the only job in Washington, other than being president, that he ever wanted.” McCain made a secret trip to Syria in February 2017 to “visit U.S. forces deployed there and to discuss counter-ISIL campaign and ongoing operations,” his spokesperson later said. McCain came back to the Senate following his brain cancer diagnosis to deliver crucial votes on Republicans’ efforts to dismantle Obama’s health care law. He first voted to move ahead the debate on the law and was warmly received by lawmakers on both sides of the aisle. But when push came to shove, McCain voted no on the effort to repeal and replace ObamaCare. “I believe we could do better working together, Republicans and Democrats, and have not yet really tried,” McCain said at the time. “Nor could I support it without knowing how much it would cost, how it will affect insurance premiums and how many people would be helped or hurt by it.” McCain received the annual Liberty Medal award in Philadelphia for his “lifetime of sacrifice and service.” The award is “given to men and women of courage and conviction who have strived to secure the blessings of liberty to people the world over,” the Constitution Center said. Biden presented the award to McCain.",
      "date": "August 25, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "On the Buttigieg bus: 2020 Dem employs McCain-style approach in freewheeling Iowa tour",
      "url": "https://www.foxnews.com/politics/on-the-buttigieg-bus-2020-dem-compares-politics-to-football",
      "subtitle": "On the Buttigieg bus: 2020 Dem employs McCain-style approach in freewheeling Iowa tour",
      "author": "Mitti Hicks",
      "content": " DAVENPORT, Iowa -- Aboard his campaign bus, Democratic presidential candidate Pete Buttigieg is reminiscing about his six months in Afghanistan as an intelligence officer with the U.S. Navy Reserve. At the time of his deployment in 2014, Buttigieg said, the men and women he served with didn’t know he was mayor of South Bend, Ind. IN CROWDED DEMOCRATIC 2020 FIELD, CANDIDATES ARE MEETING WITH GROUPS WHO HOLD CLOUT “My roommate didn’t know that I was anything besides an active-duty lieutenant,\" the candidate recalled as his bus made its way to Boone, Iowa during a four-day tour of central and eastern Iowa. But once his fellow service members found out, he said, \"they would start calling me the honorable lieutenant.\" Five years ago, Buttigieg was among the rank and file of the United States military. Now he’s on a bus in Iowa trying to win over voters and distinguish himself in a crowded field of Democrats running for president. “I think of a lot of them think it’s funny that someone they know is running for president,” Buttigieg said of those he served with in Afghanistan. “They’ve been encouraging.\" He added: \"I mean a lot of them are more politically conservative than I am, but they are supportive.” Buttigieg decided to take a page from former Republican presidential candidate John McCain’s playbook by emulating the Arizona senator's famous “Straight Talk Express” bus tours -- in which he traveled with members of the media and opened himself up to questions on any topic. It was Buttigieg’s first cup of coffee Sunday morning when he began comparing politics to football. “I think football provides the most analogies for politics, he said. \"You’re protecting the quarterback but it’s not all about the quarterback -- because if you forget the importance of the line ,you’re in trouble.\" The campaign and reporters traveled to nine cities in four days on the Premiere Transportation coach that former President Barack Obama, legendary director Steven Spielberg, Sen. Mitt Romney, and entertainers Steve Harvey and Justin Timberlake have used. President Trump also rode on the bus at one point, according to Premiere Transportation staff. It wasn’t typical bus seating. The furniture allowed Buttigieg to look reporters in the eye. The bus was equipped with Wi-Fi for the press to file stories, and a flat-screen television, which allowed Buttigieg to keep an eye on football and the news. Also installed: a counter full of snacks, including chocolate chip cookies, protein bars, chips, gummy bears and coffee. “I like sliced pickles, but other than that, my snack choices are pretty basic. I like beef jerky,” he said. When he wasn't talking to reporters, Buttigieg was trying to make contact with Iowa voters. “I looked at all the presidential [candidates] and I put a chart out,\" Amani Latimer, a Wisconsin voter and founder of Mamas 4 Pete, said after Buttigieg’s meet-and-greet in Dubuque. “I was, like, all over analytics, and I said this guy gets it.” “I think he would make a great president, I mean he so’s smart,” Iowa caucusgoer Lindra Bicksler said after a campaign rally in Clinton. “He speaks seven languages and would be able to talk to leaders of other countries himself.” While the yellow and blue bus rolled through rural Iowa, Buttigieg took a moment from talking with reporters to pull out his phone and look at the latest polls from The Des Moines Register and CNN. They put him fourth behind Massachusetts Sen. Elizabeth Warren, former Vice President Joe Biden and Vermont Sen. Bernie Sanders. “Oh, it’s a four-way race,” Buttigieg said. Buttigieg said the bus tour is just one part of his strategy of connecting with voters in smaller communities, who he says are key to the Dem nomination. CLICK HERE TO GET THE FOX NEWS APP “I’m not too worried about a variation like that, especially in a moment when only one in five people say they’ve made up their mind,” he said. “I think the important thing is that people know you, know what you’re about, do they like what they see -- and we’re seeing a lot of encouragement on that front.” As voters prepare for the first-in-the-nation caucus and the first primary in New Hampshire, Buttigieg said his campaign has plans to step up outreach to voters. The bus may next head for the Granite State.",
      "date": "September 27",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Volker steps down from McCain Institute post as impeachment cloud causes 'distraction'",
      "url": "https://www.foxnews.com/politics/volker-steps-down-from-mccain-institute-citing-media-attention-as-distraction",
      "subtitle": "Volker steps down from McCain Institute post as impeachment cloud causes 'distraction'",
      "author": "",
      "content": "Former U.S. envoy to Ukraine Kurt Volker resigned Monday from his post as the executive director of Arizona State University's McCain Institute for International Leadership, citing distractions stemming from media scrutiny of the impeachment inquiry into President Trump as the reason for his departure. Volker stepped down from his post in the State Department late last month after his name appeared in a whistleblower complaint related to alleged efforts by Trump to pressure Ukraine into investigating the family of 2020 rival Joe Biden. His resignation came three days after House Speaker Rep. Nancy Pelosi, D-Calif., announced the House would begin a full-fledged impeachment investigation. \"Today, I informed ASU President Crow and Mrs. McCain that I believe the recent media focus on my work as the U.S. special representative for Ukraine negotiations risks becoming a distraction from the accomplishments and continued growth of the Institute, and therefore, I am stepping down as executive director of the McCain Institute for International Leadership,\" Volker said in a statement. \"I know the Institute is well equipped with a first rate team of staff and trustees to continue its progress in the future. \" ENGEL SAYS POMPEO FAILING TO COMPLY WITH HOUSE INQUIRY Cindy McCain, chair of the McCain Institute's board of trustees and the widow of the late Sen. John McCain, R-Ariz., announced that Nick Rasmussen, a former director of the National Counterterrorism Center and professor at the ASU Sandra Day O'Connor College of Law, would serve as the acting executive director in Volker's absence. She also expressed gratitude for Volker's work with the institute. \"I want to thank Kurt Volker for his dedication and hard work in helping to build the McCain Institute into the results-driven, action-oriented institution that it is today,\" she said. \"We are proud of these accomplishments, and I especially appreciate his dedication to my husband and the entire McCain family.\" The McCain Institute's website says it works to train leaders of strong character who will address issues from rule of law to international security to human rights. CLICK HERE TO GET THE FOX NEWS APP Volker spent last Thursday in a transcribed interview with multiple House committees as the body gathers evidence for its impeachment inquiry. In the testimony, Volker said Ukraine never raised concerns about pressure from Trump for an investigation into Biden's son Hunter's business dealings with Burisma Holdings, even as Trump had put a hold on $400 million in military aid to the country. Burisma is a Ukrainian gas company that was under investigation at one point while the younger Biden was on its board and the elder Biden was Barack Obama's Vice President.",
      "date": "October 7",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Rep. Martha McSally appointed by Arizona governor to Senate seat held by John McCain",
      "url": "https://www.foxnews.com/politics/rep-martha-mcsally-appointed-to-open-arizona-senate-seat",
      "subtitle": "Rep. Martha McSally appointed by Arizona governor to Senate seat held by John McCain",
      "author": "Alex Pappas",
      "content": " Republican Rep. Martha McSally, just weeks after losing one of the midterms' tightest and most contentious Senate races, was appointed by Arizona Gov. Doug Ducey on Tuesday to fill the state’s other U.S. Senate seat. McSally will serve for at least the next two years in the seat that was held by longtime Arizona Sen. John McCain until his death in August. “With her experience and long record of service, Martha is uniquely qualified to step up and fight for Arizona’s interests in the U.S. Senate,” Ducey said in a statement. Ducey had appointed former Sen. Jon Kyl to the seat in September, but Kyl, after serving for several months, announced plans to resign at the end of the year. According to Ducey’s office, Kyl’s resignation will be effective Dec. 31. McSally was defeated by Democratic Rep. Kyrsten Sinema in this year’s midterm election for the seat held by retiring GOP Sen. Jeff Flake. Her appointment means she will now serve alongside her opponent, something Ducey noted in his statement. “I thank her for taking on this significant responsibility and look forward to working with her and Senator-Elect Sinema to get positive things done,” Ducey said. McSally will serve until the 2020 election, when voters will elect someone to serve the final two years of McCain's term. Democrats hope that the state swings again in 2020 and are expected to target it both in the presidential race and the contest for McCain's seat. U.S. Rep. Ruben Gallego, former astronaut and current gun control advocate Mark Kelly and former Arizona Attorney General Grant Woods, who left the GOP this year, have all considered running as Democrats for the post. The intense interest in the seat was a factor in Ducey's convoluted decisions. He initially appointed Kyl while the governor himself was campaigning for re-election. By picking Kyl, Ducey dodged tough political decisions that could have complicated his own re-election bid. McSally is a two-term congresswoman who was long considered for the Senate by the state's GOP establishment. The first female combat pilot, McSally rose to the rank of colonel in the Air Force before entering politics. The Associated Press contributed to this report.",
      "date": "December 18",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Trump signs defense bill named for John McCain",
      "url": "https://www.foxnews.com/politics/trump-signs-defense-bill-named-for-john-mccain",
      "subtitle": "Trump signs defense bill named for John McCain",
      "author": "",
      "content": "President Trump on Monday signed a $716 billion defense policy bill named for ailing Arizona GOP Sen. John McCain. The measure signed by Trump will boost military pay by 2.6 percent, the largest hike in nine years. “For the new authorization, we will increase the size and strength of our military by adding thousands of new recruits to active duty, reserve and National Guard units, including 4,000 new active duty soldiers,” Trump said. “And we will replace aging tanks, aging planes and ships with the most advanced and lethal technology ever developed, and hopefully we'll be so strong that we'll never have to use it.” The bill is titled the “John S. McCain National Defense Authorization Act for Fiscal Year 2019.” While Trump praised the military during his remarks at New York's Fort Drum, the president did not address McCain. In a statement, McCain, who is battling brain cancer, said he was “humbled that my colleagues in Congress chose to designate this bill in my name.” “Serving as Chairman of the Senate Armed Services Committee and working on behalf of America's brave service members has been one of the greatest honors of my life,” he said. The bill weakens a bid to clamp down on Chinese telecom company ZTE. It allows Trump to waive sanctions against countries that bought Russian weapons and now want to buy U.S. military equipment. The bill provides no money for Trump's requested Space Force but authorizes the military parade he wants in Washington in November. The measure also addresses child-on-child sexual assault at U.S. military bases worldwide. Fox News’ Alex Pappas, Tamara Gitt and The Associated Press contributed to this report.",
      "date": "August 13, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "John McCain to discontinue medical treatment for brain cancer",
      "url": "https://www.foxnews.com/politics/john-mccain-to-discontinue-medical-treatment-for-brain-cancer",
      "subtitle": "John McCain to discontinue medical treatment for brain cancer",
      "author": "Brooke Singman",
      "content": " Arizona Republican Sen. John McCain, the self-styled \"maverick\" of the Senate who has served three decades in Congress, will discontinue medical treatment for brain cancer, his family said in a statement Friday. The Vietnam War veteran, who survived five years as a prisoner of war and went on to become his party's presidential nominee in 2008, was diagnosed last July with a brain tumor following a procedure earlier in the year to remove a blood clot from above his left eye. He has not voted since last December. In Friday's statement, his family revealed how the disease has worsened: “Last summer, Senator John McCain shared with Americans the news our family already knew: he had been diagnosed with an aggressive glioblastoma, and the prognosis was serious. In the year since, John has surpassed expectations for his survival. But the progress of disease and the inexorable advance of age render their verdict.\" They said, \"With his usual strength of will, he has now chosen to discontinue medical treatment.\" Reaction poured in after the family's announcement. \"The entire McCain clan is doing exactly what the McCains have done through generations — rise to the meet the challenge,\" said South Carolina Republican Sen. Lindsey Graham, a close McCain friend. \"John McCain is an American hero, always putting country before self. From Vietnam to the halls of the U.S. Senate, the spirit of service and civility that has guided Senator McCain's life stands as a model for all Americans, regardless of political affiliation,\" Arizona Gov. Doug Ducey said in a statement. Senate Majority Leader Mitch McConnell, R-Ky., tweeted: \"Very sad to hear this morning’s update from the family of our dear friend @SenJohnMcCain. We are so fortunate to call him our friend and colleague. John, Cindy, and the entire McCain family are in our prayers at this incredibly difficult hour.\" The Mayo Clinic Hospital in Phoenix last summer said that the original blood clot was associated with a primary brain tumor, known as a glioblastoma. McCain, 81, has served in the U.S. Senate for more than two decades and ran for president twice. He lost the GOP nomination to George W. Bush in 2000 and was the Republican nominee in 2008 before losing to Barack Obama in the general election. McCain was a prisoner of war in Vietnam for more than five years. Injuries from being tortured left him unable to lift his arms above his head. Last December, McCain returned to the Senate for the first time since his brain cancer diagnosis. He delivered powerful remarks on the Senate floor addressing the need for bipartisanship amid gridlock in the chamber. “Make no mistake, my service here is the most important job I have had in my life. And I am so grateful to the people of Arizona for the privilege—for the honor—of serving here and the opportunities it gives me to play a small role in the history of the country I love,” McCain said, acknowledging senators he’s “known and admired.” “But they knew that however sharp and heartfelt their disputes, however keen their ambitions, they had an obligation to work collaboratively to ensure the Senate discharged its constitutional responsibilities effectively.” McCain has criticized the Senate’s deliberations in the last year, calling them “more partisan, more tribal” than any time he remembered. McCain blamed “both sides” for the lack of cooperation. Earlier this year, McCain penned a memoir titled “The Restless Wave: Good Times, Just Causes, Great Fights, and Other Appreciations,” written by himself, and Mark Salter, who had collaborated with McCain on all seven of his other books. \"I don't know how much longer I'll be here. Maybe I'll have another five years. Maybe, with the advances in oncology, they'll find new treatments for my cancer that will extend my life. Maybe I'll be gone before you read this. My predicament is, well, rather unpredictable,\" he wrote. \"But I'm prepared for either contingency, or at least I'm getting prepared. I have some things I'd like to take care of first, some work that needs finishing, and some people I need to see. And I want to talk to my fellow Americans a little more if I may.\" McCain, who has repeatedly been at odds with President Trump and criticized his rhetoric and leadership, said this year that he doesn’t want the president to attend his funeral, and prefers that Vice President Pence be there instead. Last week, Trump signed a $716 billion defense policy bill, titled “John S. McCain National Defense Authorization Act for Fiscal Year 2019,” though did not mention the senator. The Associated Press contributed to this report.",
      "date": "August 24, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Meghan McCain surprised to see Ivanka Trump, Jared Kushner at John McCain's funeral: report",
      "url": "https://www.foxnews.com/politics/meghan-mccain-surprised-to-see-ivanka-trump-jared-kushner-during-eulogy-at-john-mccains-funeral",
      "subtitle": "Meghan McCain surprised to see Ivanka Trump, Jared Kushner at John McCain's funeral: report",
      "author": "Nicole Darrah",
      "content": " The View co-host Meghan McCain revealed that she didn't know Ivanka Trump and Jared Kushner would attend her late father Sen. John McCain's funeral, in which she criticized President Trump during her emotional eulogy. McCain, 34, said she was surprised to see Trump and Kushner at the Washington National Cathedral in September for her dad, who died on Aug. 25 from brain cancer. MEGHAN MCCAIN CALLS TRUMP 'PATHETIC' OVER HIS REPORTED DIG AT LATE FATHER \"I didn’t know they were coming, I didn’t know until I saw them there,\" McCain said in an interview with People magazine. \"I looked over and saw them and well… they got to listen to what I had to say.\" President Trump did not attend the funeral service for the war hero, with whom he had a contentious relationship. Ahead of his second State of the Union address on Tuesday night, The New York Times reported that Trump again recalled that McCain in 2017 voted \"no\" on an Obamacare repeal. Trump also reportedly claimed that McCain's final book, which was published in April 2018 and made the Times' bestseller list, \"bombed.\" McCain, in reply to the report, tweeted that Trump's \"obsession\" with her father, almost six months after his death, is \"pathetic and telling — even at a time when he should be focusing on his message to the American public and the state of our union — the greatness of my father’s life and legacy haunts you.\" During her father's funeral, McCain did not mention Trump's name, but she knocked the president with an apparent reference to his campaign slogan, saying: \"The America of John McCain has no need to be made great again because America was always great.\" CLICK HERE TO GET THE FOX NEWS APP McCain added, in another apparent swipe at Trump, that her father's passing represented the passing of \"American greatness. The real thing, not cheap rhetoric from men who will never come near the sacrifice he gave so willingly, nor the opportunistic appropriation of those who lived lives of comfort and privilege while he suffered and served.\" Fox News' Adam Shaw contributed to this report.",
      "date": "February 6",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "John McCain buried at Naval Academy next to lifelong friend",
      "url": "https://www.foxnews.com/politics/john-mccain-buried-at-naval-academy-next-to-lifelong-friend",
      "subtitle": "John McCain buried at Naval Academy next to lifelong friend",
      "author": "Frank Miles",
      "content": " Sen. John McCain was laid to rest Sunday — on a grassy hill at the U.S. Naval Academy within view of the Severn River and earshot of midshipmen present and future, and alongside a lifelong friend. McCain picked the historic site, not Arlington National Cemetery, where his father and grandfather, both admirals, were buried. Years ago, Chuck Larson, an admiral himself and an ally throughout McCain’s life, reserved four plots at the cemetery — two for McCain and himself, and two for their wives, now widows. Larson died in 2014, and McCain wrote in a recent memoir that he wanted to be buried next to his friend, “near where it began.” A horse-drawn caisson carrying the senator’s casket led a procession of mourners from the academy’s chapel to its cemetery following a private service. The senator’s widow, Cindy, and his children were among those who walked behind the caisson. Joining them were family and friends as well as members of McCain’s Class of 1958, military leaders and academy midshipmen. Around 4 p.m., a flyover of military aircraft honored the Navy pilot who was shot down over Vietnam, and held more than five years as a prisoner of war. The burial was private as per the wishes of McCain, the Arizona Republican and 2008 presidential nominee who died Aug. 25 from brain cancer at age 81. Vehicles that had carried mourners began leaving the area between 4:30 and 5 p.m. One scheduled speaker at the service, Sen. Lindsey Graham, said before the service that he would tell the audience that “nobody loved a soldier more than John McCain, that I bear witness to his commitment to have their back, travel where they go, never let them be forgotten.” Other scheduled speakers included David Petraeus, the retired general and former CIA director, and McCain’s son Jack. As the hearse carrying McCain passed through a gate and into the academy, loud applause rang out from the several hundred people lining the street outside on the hot and muggy summer day. Many held their hands over their hearts and waved American flags. Some shouted, “God bless you.” People in the crowd held signs that read: “Senator John McCain Thanks For Serving! Godspeed” and “Rest In Peace Maverick.” Among the pallbearers on a list provided by McCain’s office were Frank Gamboa, his academy roommate; Defense Secretary Jim Mattis; and two men who were POWs with McCain in Vietnam, John Fer and Everett Alvarez Jr. Tributes to McCain began Wednesday in Arizona and continued for the remainder of the week. On Saturday, speeches by his daughter Meghan and two former presidents — Republican George W. Bush and Democrat Barack Obama — remembered McCain as a patriot who could bridge painful rivalries. While their remarks made clear their admiration for him, they also represented a repudiation of President Trump’s brand of tough-talking, divisive politics. Trump and McCain were at odds during the 2016 campaign, and for much of Trump’s presidency. “There’s a lesson to be learned this week about John McCain,” said Graham, R-S.C. “No. 1, Americans appreciate military service. ... If you work hard and do your homework and know what you’re talking about, people will listen to you. That if you pick big causes bigger than yourself, you’ll be remembered,” he told “Fox News Sunday.” “He tried to drain the swamp before it was cool, that you can fight hard and still be respected. If you forgive, people appreciate it, and if you admit to mistakes, you look good as a stronger man. That’s the formula, John McCain. This was a civics lesson for anybody who wanted to listen. Why do we remember this man? Because of the way he conducted his public life.” The Associated Press contributed to this report.",
      "date": "September 2, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Jon Kyl named to succeed John McCain in the Senate",
      "url": "https://www.foxnews.com/politics/jon-kyl-named-to-succeed-john-mccain-in-the-senate",
      "subtitle": "Jon Kyl named to succeed John McCain in the Senate",
      "author": "Travis Fedschun",
      "content": " Former Republican senator Jon Kyl was named Tuesday to succeed the late Sen. John McCain, with the announcement coming at the start of confirmation hearings for Supreme Court nominee Brett Kavanaugh -- which could be the new senator's first big vote. Arizona GOP Gov. Doug Ducey announced the selection via Twitter, while saying during a subsequent news conference that Arizonans needed a person who would be able to \"hit the ground running.\" \"I am deeply grateful to Senator Kyl for agreeing to succeed his friend and colleague of so many years. Every single day that Jon Kyl represents #Arizona in the U.S. Senate is a day our state is well-served,\" he tweeted. Kyl, 76, may be a short-term pick. He only committed Tuesday to fill the Senate seat until early next year out of a \"sense of duty.\" \"I haven't been able to get that assurance from Kyl yet, what I have gotten is a commitment to serve Arizona through at least this session of Congress,\" Ducey told reporters, adding that he hoped that Kyl \"serves longer.\" Kyl told reporters he did not want to commit for a longer period because when he left his Senate seat previously he had no intention of returning. \"In that spirit I am certainly willing to serve through the end of this session,\" he said. Voters in 2020 will get to decide who fills the remainder of McCain's term through 2022. Then the seat will be up again for a full six-year term. McCain's widow Cindy McCain had revealed the choice in an earlier tweet, saying, \"Jon Kyl is a dear friend of mine and John’s. It’s a great tribute to John that he is prepared to go back into public service to help the state of Arizona.\" Kyl was the GOP whip for a number of years, and also served as Supreme Court nominee Brett Kavanaugh’s escort or “sherpa,” as the Senate sometimes calls it, taking Kavanaugh around to meet with senators. He was absent at Kavanaugh's confirmation hearing on Tuesday, but Ducey told reporters that Kyl is ready to cast a vote after working with the White House for months on the Kavanaugh nomination. The political stakes are high since Kyl could participate in the vote on whether to confirm Kavanaugh to the U.S. Supreme Court, and will be rejoining the Senate at a time when Democrats are eager to take control of the chamber in this year's midterms. A representative for Ducey told the Arizona Republic that if Kyl opted to step down at the end of the session, the Republican governor would have to appoint another replacement. JOHN MCCAIN BURIED AT NAVAL ACADEMY NEXT TO LIFELONG FRIEND Kyl retired in 2013 after becoming the No. 2 ranking Republican senator, and served alongside McCain during his 18 years in the Senate. Filling McCain's seat marks a turning point in Arizona political history. That seat in particular has been held by two men who were heralded as giants of the Senate: McCain took the seat once held by Sen. Barry Goldwater after he had served in the House of Representatives. Outgoing Sen. Jeff Flake, R-Ariz., called Kyl a \"great pick\" as McCain's replacement, and that it was Ducey's selection entirely. “They worked together for eighteen years they served together so you know I think he’ll fit right in and he obviously shared Senator McCain’s view on most things and [is the] perfect, perfect guy to succeed him,\" Flake told Fox News. McCain was buried on Sunday at the U.S. Naval Academy in a private ceremony, as per the wishes the Arizona Republican and 2008 presidential nominee who died Aug. 25 from brain cancer at age 81. Fox News' Chad Pergram, Jason Donner, and The Associated Press contributed to this report.",
      "date": "September 4, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "It wasn't McCain joke, but subsequent response, that cost Sadler her WH job",
      "url": "https://www.foxnews.com/politics/it-wasnt-mccain-joke-but-subsequent-response-that-cost-sadler-her-wh-job",
      "subtitle": "It wasn't McCain joke, but subsequent response, that cost Sadler her WH job",
      "author": "Paulina Dedaj",
      "content": "  White House communications aide Kelly Sadler was asked to leave not based on her initial comment about Sen. John McCain, but because of her decision to remain quiet thereafter, officials confirmed to Fox News on Wednesday. Sources told Fox News that the plan was have Sadler make a public apology to the gravely ill Republican senator and his family after news spread that she was overheard saying, “He’s dying anyway,” when talking about McCain’s opposition to President Trump’s pick to lead the CIA. Sadler strayed away from the public apology and instead stayed quiet. Meghan McCain, daughter of the cancer-stricken Arizona senator, said that Sadler had apologized to her privately but that she never made a public apology as promised -- details that seem to confirm what officials said was the initial plan after the McCain remark. WHITE HOUSE OFFICIAL MOCKED ‘DYING’ MCCAIN AFTER HASPEL CRITICISM, SOURCES SAY Sadler’s departure may also have been connected to a clash with senior White House aide Mercedes Schlapp in front of President Trump. Fox News learned that during a meeting last month to address leaks coming from the White House, Sadler reportedly told Trump that Schlapp “was one of the worst leakers.” The decision was eventually made that Sadler had to go. WATCH: WHITE HOUSE FACES BACKLASH AFTER MCCAIN COMMENT LEAKS Schlapp reportedly held the meeting to inform Sadler, who was then offered a number of positons elsewhere in the administration, including communications director for the Peace Corps and deputy communications director at the Commerce Department. Sources say that Sadler was upset over the news and made the abrupt decision to leave. Now, she's out of the White House and the administration, but sources say there’s a possibility Sadler could make a return. Fox News Gregg Re contributed to this report.",
      "date": "June 6, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Trump grounds Boeing plane, but can't move on from John McCain",
      "url": "https://www.foxnews.com/politics/trump-grounds-boeing-plane-but-cant-move-on-from-john-mccain",
      "subtitle": "Trump grounds Boeing plane, but can't move on from John McCain",
      "author": "Howard Kurtz",
      "content": " President Trump is picking a whole lot of fights in recent days, including one with a dead senator. Some of these are battles he should be engaging in, despite what much of the media say. And some are the kind he would be better off avoiding. Take, for instance, Trump’s involvement in the decision to ground the Boeing plane that has been involved in two fatal crashes, the 737 Max 8. The Washington Post says \"it was extraordinary for a president to intervene in matters typically left to the FAA or the Department of Transportation.\" And the story quotes a former DOT secretary as saying Barack Obama was never involved in such safety decisions. Rather than simply being briefed by the FAA, the Post reports, \"Trump played an active role, participating in phone calls with Boeing chief executive Dennis Muilenburg and other stakeholders, and offering his thoughts about the aviation industry.\" I don't know about you, but that's what I would want a president doing — not substituting his judgment for that of the experts but taking a hands-on role in crisis management. Aviation safety is a crucial issue. And if a Max 8 had crashed in the U.S., Trump would have shouldered enormous political blame. Now there's an argument to be made that the president waited too long to ground the planes, acting after other major industrialized countries. Maybe he was too solicitous toward Boeing. And maybe the FAA should have more tightly regulated the airline giant. Recent reports about Boeing dragging its feet on pilot training for the planes' new software — and a sensor that may have been sending the wrong signals to prevent stalling — suggest that the two crashes may have been avoidable. But I'd argue Trump's personal involvement is a good thing. LORDSTOWN, OHIO PONDERS LIFE AFTER GENERAL MOTORS' DEPARTURE I also have no problem with Trump doing what used to be called jawboning to keep auto jobs in America. But he's taking some flak for blaming the latest plant closure on the United Auto Workers. After GM shut down a factory in Lordstown, Ohio, Trump tweeted: \"Democrat UAW Local 1112 President David Green ought to get his act together and produce. G.M. let our Country down, but other much better car companies are coming into the U.S. in droves. I want action on Lordstown fast. Stop complaining and get the job done! 3.8% Unemployment!\" Trump said he also called GM's CEO, Mary Barra: \"I am not happy that it is closed when everything else in our Country is BOOMING. I asked her to sell it or do something quickly. She blamed the UAW Union — I don't care, I just want it open!\" But ultimately this was a business decision (though not final) by the automaker, which is moving away from small sedans like the Chevrolet Cruze, made at that plant, in favor of bigger cars. The Lordstown plant workers agreed more than a decade ago that newly hired workers would be paid $20 an hour, not the standard $30. So the president's criticism seems like deflection. And then there is John McCain. He and Trump couldn't stand each other. But Trump unloaded on him over the weekend, despite the fact that McCain died last August. First, he lambasted the late Arizona senator for giving the uncorroborated Steele dossier to the FBI. Trump quoted Ken Starr as saying this was \"unfortunately a very dark stain against John McCain.\" Trump added: \"He had far worse 'stains' than this, including thumbs down on repeal and replace after years of campaigning to repeal and replace!\" And there was another shot against \"'last in his class' (Annapolis) John McCain.\" CLICK HERE TO GET THE FOX NEWS APP Those tweets prompted stinging personal criticism from McCain's former aides and from his daughter Meghan. McCain, who often joked about being a poor student at the Naval Academy, was a controversial figure in the GOP. The onetime nominee was a maverick who often took on his own party, starting with George W. Bush. He did cast that late-night thumbs-down against abolishing ObamaCare, but that was the third repeal attempt that, if not for divisions among Republicans, would never have come down to one vote. But whether Trump's grievances against McCain are justified is beside the point. He was a war hero who served his country for decades. He is no longer with us. Perhaps it's time for the president to let it go.",
      "date": "March 19",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Trump says John McCain 'was horrible, what he did with repeal and replace'",
      "url": "https://www.foxnews.com/politics/trump-says-john-mccain-was-horrible-what-he-did-with-repeal-and-replace",
      "subtitle": "Trump says John McCain 'was horrible, what he did with repeal and replace'",
      "author": "Samuel Chamberlain",
      "content": " President Trump returned to his ongoing, one-sided feud with the late Sen. John McCain Thursday, telling Fox Business Network's \"Mornings with Maria,\"  \"I'm not a fan of John McCain, and that's fine.\" Trump again blamed McCain, who died last August, for giving a dossier of Trump's alleged ties to Russia to the FBI and triggering the ongoing Russia investigation that is currently being helmed by Special Counsel Robert Mueller. The president described the dossier as \"fake news,\" \"a fraud ... paid for by Hillary Clinton and the Democrats. That's not good.\" WATCH MARIA BARTIROMO'S FULL INTERVIEW WITH PRESIDENT TRUMP ON 'MORNINGS WITH MARIA' AT 6 AM ET ON FOX BUSINESS NETWORK The president also took issue with McCain's now-famous \"thumbs down\" vote against a measure to repeal and replace ObamaCare in July 2017. \"He was horrible, what he did with repeal and replace,\" Trump told Bartiromo. \"What he did to the Republican Party and to the nation and to sick people that could have had great healthcare was not good.\" SENATORS RALLY AROUND MCCAIN LEGACY AFTER FRESH BARRAGE OF TRUMP ATTACKS Trump has stepped up his attacks on McCain in recent days after the revelation about the dossier, which came in a newly unsealed declaration by former senior counterintelligence FBI agent Bill Priestap as part of an ongoing libel case against BuzzFeed by a Russian businessman. Priestap confirmed that McCain gave the bureau a copy of the first 33 pages of the dossier in December 2016. During a speech to workers at an Army tank plant in Ohio Wednesday, Trump ripped into McCain again. \"I endorsed him at his request, gave him the kind of funeral he wanted, which as president of the United States I had to approve,” Trump said at one point. “I don’t care, but I didn’t get a thank you.\" CLICK HERE TO GET THE FOX NEWS APP Trump told Bartiromo that his McCain criticism took up \"a very small portion\" of his time and blamed the media for bringing up the issue. \"When I went out [Wednesday] to the scrum, they asked me the question,\" he said. \"When they ask me the question, I answer the question. But you people bring it up, I don't bring it up.\" Fox News' Andrew O'Reilly and Paulina Dedaj contributed to this report.",
      "date": "March 21",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "The Departed: History will likely remember invective President Trump has lobbed at John McCain",
      "url": "https://www.foxnews.com/politics/the-departed-history-will-likely-remember-invective-president-trump-has-lobbed-at-john-mccain",
      "subtitle": "The Departed: History will likely remember invective President Trump has lobbed at John McCain",
      "author": "Chad Pergram",
      "content": " We hear from the dead all the time in Congress. Those who have passed are part of the daily lingo on Capitol Hill. The senator’s office is over in Hart. Republicans are meeting in the Mansfield Room. Cannon Rotunda? I thought you said the live shot was in the Russell Rotunda. Are you going to the hearing in Longworth? Here’s a key to decode the references: The Hart Senate Office Building is named for the late Sen. Phil Hart (D-MI). The Mansfield Room is a formal space in the Capitol, named after the late Senate Majority Leader Mike Mansfield (D-MT). The Cannon Rotunda is in the Cannon House Office Building, named after the late House Speaker Joe Cannon (R-IL). The Russell Rotunda is in the Russell Senate Office Building, the namesake of Sen. Richard Russell (D-GA). TV news crews often do live hits and interviews from both rotundas. And the Longworth House Office Building is named after the late Speaker Nicholas Longworth (R-OH). JOHN MCCAIN'S YOUNGEST DAUGHTER SLAMS TRUMP IN RARE PUBLIC STATEMENT Statues of late Congressional figures, American presidents and other persons of historical importance saturate the Capitol complex. President Ronald Reagan and Martin Luther King Jr. in the Capitol Rotunda. Rosa Parks and Thomas Edison in Statuary Hall. Sakakawea and Helen Keller in the Capitol Visitor’s Center. I recently unearthed two dusty CD’s of public radio stories I did about Congress between 2004 and 2006. What struck me about these aural time capsules was how many lawmakers spoke from the grave in the reports: Sens. Ted Stevens (R-AK), George Voinovich (R-OH), Daniel Akaka (D-HI), Craig Thomas (R-WY), Ted Kennedy (D-MA) and Pete Domenici (R-NM), along with Reps. John Dingell (D-MI), Steven LaTourette (R-OH), Vern Ehlers (R-MI), Leonard Boswell (D-IA) and Julia Carson (D-IN). We talk about the departed all the time. Senators invoke the “Byrd Rule” when discussing the complex, budget reconciliation process, named after the late Senate Majority Leader Robert Byrd (D-WV). The “Byrd Rule” bars provisions attached a budget reconciliation measure which would add significantly to the deficit. Joe Cannon has come up a lot of late. Cannon faced a rebellion from lawmakers after he ran the House with an iron fist. The creation of the “motion to recommit” or “MTR” grew out of that uprising. An MTR is the last chance for the minority party to kill or alter legislation on the floor. Some Democrats want to change the MTR as Republicans have recently prevailed on two MTR’s on the floor, against the wishes of most Democrats. DIRECTOR JUDD APATOW SLAMS DONALD TRUMP'S 'CULT-LIKE' FOLLOWERS OVER JOHN MCCAIN JABS We bring this all up because President Trump is again railing about the late Sen. John McCain (R-AZ). McCain has seemingly crept under the President’s skin. And so Mr. Trump is unloading broadsides against the late senator and 2008 GOP presidential nominee. President Trump has said he “never liked McCain,” rekindling an old feud with the Arizona Republican. The President lashed out at McCain for not supporting a Republican effort to repeal and replace Obamacare. As a result, a host of lawmakers from both sides are now rallying to the defense of McCain, who laid in state in the Capitol Rotunda late last summer. Senate Minority Leader Chuck Schumer (D-NY) wants to rename the Russell Senate Office Building after McCain. Sen. Lindsey Graham (R-SC) is one of President Trump’s biggest backers and perhaps McCain’s most loyal colleague. But Graham says he doesn’t “like it” when the President attacks his late friend. TRUMP SAYS JOHN MCCAIN 'WAS HORRIBLE, WHAT HE DID WITH REPEAL AND REPLACE' In an interview with Georgia Public Broadcasting, Sen. Johnny Isakson (R-GA) called Mr. Trump’s onslaught about McCain “deplorable” and “damaging.” Senate Majority Leader Mitch McConnell (R-KY) called McCain “a rare patriot and genuine American hero” via Twitter. Yet some criticized McConnell for only defending McCain and not denouncing Mr. Trump’s disparagements. The President’s aggressive condemnations of McCain even compelled the McCain Institute for International Leadership, associated with Arizona State University, to publish a news release titled “The Facts About John McCain.” The missive talked about McCain’s military service, time as a prisoner of war and included a lengthy justification about the senator’s position on health care. “John McCain opposed Obamacare and fully supported ‘repeal and replace,’” punched back the release. “John McCain voted against the bill presented to the U.S. Senate – his famous ‘thumbs down’ – because it was ‘repeal,’ without ‘replace.’” In an interview with Maria Bartiromo on Fox Business, President Trump reiterated that he is “not a fan” of McCain, even suggesting that the furor over McCain is the press’s fault. “You people bring it up,” said the President. Yet it was President Trump who again began tearing into McCain after a period of dormancy. “What he did to the Republican party and to the nation, the sick people who could have had great health care… Not good,” said Mr. Trump. It’s not strange to hear about deceased lawmakers in Washington. So many of them are etched into the day-to-day patter of Capitol Hill that most who utter their names probably don’t even know much about the name of a room or a building they’re talking about. Rayburn. Dirksen. LBJ. And it may not be long until something in the Senate is named after John McCain. It’s as though these figures are kind of still living, influencing events. There’s a thing in Star Wars about the dead. On multiple occasions, those who have passed on sometimes return as a “Force ghost.” They speak to the living and stage-manage events from the grave. After Darth Vader cut down Obi-Wan Kenobi in a lightsaber duel, the latter returned via metempsychosis as a Force Ghost. Kenobi periodically re-emerges, instructing Luke Skywalker from the great beyond. Death in Congress is a little bit like what happens in Star Wars. People still talk about “Sarbanes-Oxley,” a major piece of consumer and financial regulation legislation. It’s named after former Sen. Paul Sarbanes (D-MD) and the late Rep. Mike Oxley (R-OH) who crafted the measure. Every college student in the country knows about “Pell Grants,” named after the late Sen. Claiborne Pell (D-RI). Americans have long held tax-free “Roth IRA’s,” engineered by the late Sen. William Roth (R-DE). The “Hyde Amendment” is a provision sponsored by the late Rep. Henry Hyde (R-IL) prohibiting the use of federal dollars for abortions. There is even “McCain-Feingold.” McCain teamed up with former Sen. Russ Feingold (D-WI) to regulate campaign financing. Legislation and Congressional infrastructure are usually where we continue to hear from former leaders, impacting the daily lives of Americans, long after they died. President Trump’s fixation with McCain is different. Mr. Trump routinely changes the ground rules in politics. CLICK HERE FOR THE FOX NEWS APP No one can recall if other Presidents lobbed opprobrium toward late Senate Majority Leader Everett Dirksen (R-IL) or late House Speaker Sam Rayburn (D-TX). But it’s likely historians will remember the invective President Trump lobbed at McCain.",
      "date": "March 23",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Defeated GOP lawmaker blames John McCain for Dem House takeover",
      "url": "https://www.foxnews.com/politics/defeated-gop-lawmaker-blames-john-mccain-for-dem-house-takeover",
      "subtitle": "Defeated GOP lawmaker blames John McCain for Dem House takeover",
      "author": "Samuel Chamberlain",
      "content": " A Republican congressman who lost his bid for re-election last week took to the op-ed pages of The Wall Street Journal last weekend to blame the Democratic takeover of the House of Representatives on the late Sen. John McCain. \"The Republican Party lost its House majority on July 28, 2017, when Sen. John McCain ended the party’s seven-year quest to repeal ObamaCare,\" Rep. Jason Lewis, R-Minn., wrote to open his piece, which went on to describe McCain's vote as \"inscrutable.\" He added that McCain's vote \"prompted a 'green wave' of liberal special-interest money, which was used to propagate false claims that the House plan 'gutted coverage for people with pre-existing conditions.' \"That line was the Democrats’ most potent attack in the midterms,\" Lewis said. McCain, who died this past August at the age of 81, joined fellow Republican Sens. Susan Collins of Maine and Lisa Murkowski of Alaska to vote against the repeal legislation in the Senate, which was defeated 51-49. Democrats regained control of the House after hammering Republicans on pre-existing conditions, citing the GOP's repeal efforts and an ongoing lawsuit from 20-plus Republican attorneys general to repeal former President Barack Obama's health care law. Lewis, who was elected in 2016 to represent Minnesota's 2nd District, was among the Republicans unseated last week, losing to Democratic challenger Angie Craig in a rematch of his contest from two years ago. Lewis is no stranger to controversy. His past career as a conservative talk show radio host was a campaign issue in his 2016 election and resurfaced again during this year's campaign. In July, CNN reported on years-old remarks in which he wondered aloud why he couldn't call a woman \"a slut\" and said it's not the federal government's place to ban slavery. McCain's daughter, Meghan McCain, called Lewis's remarks \"abhorrent\" on Twitter. Julie Tarallo, John McCain's former communications director, was more effusive, tweeting: \"Things that contributed to Lewis losing his seat by 6 points: calling women \"sluts\" & shaming sexual assault survivors Things that DIDN'T contribute: John McCain\". The Associated Press contributed to this report.",
      "date": "November 12, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Trump takes shot at John McCain over Affordable Care Act repeal attempt at rally",
      "url": "https://www.foxnews.com/politics/trump-john-mccain-criticism-obamacare",
      "subtitle": "Trump takes shot at John McCain over Affordable Care Act repeal attempt at rally",
      "author": "Victor Garcia",
      "content": " President Trump once again took a shot at John McCain during a rally in Pennsylvania on Monday night. During a discussion on healthcare, Trump brought up his failed attempt to repeal and replace the Affordable Care Act, also referred to Obamacare, before renewing his ongoing criticism of the late former Senator. \"The fake news doesn't want to say it. We will always protect pre-existing conditions, very important. By the way, we got rid of the individual mandate, the worst part of Obamacare and we almost had it repealed and replaced but we had one man that after campaigning for eight years, he decided to go thumbs down at two o'clock in the morning,\" Trump said. DONALD TRUMP'S FEUD WITH MCCAIN FAMILY ESCALATES: 'I WAS NEVER A FAN' \"That's all right, but we'll end up, we'll end up with even better because we have plans that are even better than that.\" The comment was seemingly in reference to former Sen. McCain, R-Ariz., who famously voted against the repeal in 2017 giving it a thumbs down. This isn't the first time Trump has been critical of McCain after his death. During a speech in Ohio this past March Trump tore into McCain’s legacy and in an unusual remark, took credit for the late senator’s state funeral in Washington last year. “I endorsed him at his request, gave him the kind of funeral he wanted, which as president of the United States I had to approve,” Trump said. “I don’t care, but I didn’t get a thank you.” “I never liked him much,” Trump said. “I really probably never will.” TRUMP INVITES SUPPORTER WEARING WALL SUIT TO PENNSYLVANIA RALLY STAGE Trump’s feud with McCain dates back to well before he was elected president. In 2015, after McCain had said Trump's platform had \"fired up the crazies,\" Trump mocked McCain's imprisonment in the Vietnam War, saying: \"I like people that weren't captured.\" The two continued to be at odds until McCain’s death from brain cancer last August. Fox News' Andrew O'Reilly contributed to this report.",
      "date": "May 20",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Trump, Defense boss Shanahan both deny link to USS John S. McCain ‘out of sight’ directive",
      "url": "https://www.foxnews.com/politics/trump-defense-boss-shanahan-both-deny-link-to-uss-john-s-mccain-out-of-sight-directive",
      "subtitle": "Trump, Defense boss Shanahan both deny link to USS John S. McCain ‘out of sight’ directive",
      "author": "Dom Calicchio",
      "content": " A mystery continues to surround a reported U.S. military email that called for the USS John S. McCain to be “out of sight” during President Trump’s recent visit to U.S. troops stationed in Japan, where the ship was docked. On Wednesday, both President Trump and acting Defense Secretary Patrick Shanahan denied any knowledge of the order, which led to the ship’s name first being covered with a tarp and then being obscured by a paint barge prior to Trump’s visit over Memorial Day weekend. “I was not informed about anything having to do with the Navy Ship USS John S. McCain during my recent visit to Japan,” President Trump wrote on Twitter late Wednesday. “Nevertheless, @FLOTUS and I loved being with our great Military Men and Women - what a spectacular job they do!” USS JOHN S MCCAIN LEAVES DRY DOCK MORE THAN YEAR AFTER FATAL COLLISION A spokesman for Secretary Shanahan later issued the following statement: “Secretary Shanahan was not aware of the directive to move the USS John S McCain nor was he aware of the concern precipitating the directive.” That statement appeared to contradict a Wall Street Journal story, which cited an unnamed U.S. official as saying that Shanahan was “aware of the concern about the presence of the USS John McCain in Japan and approved measures to ensure it didn’t interfere with the president’s visit.” The existence of the email – sent by an unnamed U.S. Indo-Pacific Command official to U.S. Navy and Air Force officials – was first reported by the Journal. The newspaper’s story claimed that orders referring to the USS John S. McCain originated from “the White House,” but named no specific official. The ship is named for the father and grandfather of the late U.S. Sen. John S. McCain III, with whom President Trump had feuded prior to the Arizona Republican’s death from cancer last year at age 81. The emergence of the Journal story apparently infuriated Meghan McCain, daughter of the late senator and a co-host of ABC’s “The View” – who, like her late father, is a frequent Trump critic. MEGHAN MCCAIN DISMISSES 'VIEW' CONVERSATION: 'I'M NOT CHANGING YOUR MINDS THIS MORNING' In a tweet Wednesday that preceded the president’s message, Meghan McCain appeared to insinuate that the order to obscure the ship's name had come from the president. Meghan McCain retweeted the Journal story, adding the following comment: “Trump is a child who will always be deeply threatened by the greatness of my dads [sic] incredible life. There is a lot of criticism of how much I speak about my dad, but nine months since he passed, Trump won't let him RIP. So I have to stand up for him. It makes my grief unbearable.\" Since McCain’s death, the late senator’s 34-year-old daughter has been quick to defend his legacy. Just two days earlier, Meghan McCain aimed her ire at Sen. Amy Klobuchar, D-Minn., a candidate for the 2020 Democratic Party presidential nomination. Klobuchar recently claimed that the late senator “kept reciting to me names of dictators” during President Trump’s inaugural address in 2017, suggesting that the elder McCain dreaded the thought of a Trump presidency. But Meghan McCain said she and her family would prefer if the late senator’s name not be invoked at all during the 2020 election season. CLICK HERE TO GET THE FOX NEWS APP \"On behalf of the entire McCain family, [Amy Klobuchar], please be respectful to all of us and leave my father's legacy and memory out of presidential politics,” the late senator’s daughter wrote. Ultimately, the Journal reported, the tarp that covered the name of the USS John S. McCain was removed Saturday and the paint barge that obscured the name was removed as well – both ahead of Trump’s visit, Cmdr. Clayton Doss, a spokesman for the Navy’s Seventh Fleet, told the newspaper. President Trump spoke to the Japan-based U.S. troops Tuesday while aboard the USS Wasp, which was docked at the same naval base as the USS John S. McCain.",
      "date": "May 30",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Navy confirms request to ‘minimize’ USS John McCain during Trump visit to Japan",
      "url": "https://www.foxnews.com/politics/navy-confirms-request-to-minimize-uss-john-mccain-during-trump-visit-to-japan",
      "subtitle": "Navy confirms request to ‘minimize’ USS John McCain during Trump visit to Japan",
      "author": "Adam Shaw",
      "content": " The Navy on Saturday confirmed that a request was made to “minimize the visibility” of the U.S.S. John McCain during President Trump’s recent visit to Japan -- but that it remained in a “normal configuration” during the visit. \"A request was made to the U.S. Navy to minimize the visibility of USS John S. McCain, however, all ships remained in their normal configuration during the President's visit,\" Rear Adm. Charlie Brown, chief of Navy information, said in a statement to Politico. TRUMP, DEFENSE BOSS SHANAHAN BOTH DENY LINK TO USS JOHN S MCCAIN 'OUT OF SIGHT' DIRECTIVE The statement said that there were “no intentional efforts to explicitly exclude Sailors assigned to USS John S. McCain.” The Wall Street Journal reported Wednesday that the White House had requested the Navy move the warship “out of sight” ahead of Trump’s state visit. The outlet cited a May 15 email from a U.S. Indo-Pacific Command official to U.S. Navy and Air Force officials that said: “USS John McCain needs to be out of sight.” After the officials expressed surprise, the official said he would talk to the White House Military Office to get more information about the order. The Journal also reported that a tarp was hung over the ship’s name ahead of the visit and sailors were directed to remove any coverings from the ship with its name on it. McCain, a former Arizona senator and military veteran, had a years-long feud with Trump before his death from brain cancer last year. But Trump has kept that feud going even since McCain’s death, particularly his anger at McCain casting the decisive vote against Republican efforts to repeal and replace ObamaCare in 2017. In March Trump complained at a rally that he \"endorsed him at his request, gave him the kind of funeral he wanted...but I didn’t get a thank you.” “I never liked him much,” Trump said. “I really probably never will.” The warship was commissioned in 1994 and originally named for the senator's father and grandfather, both Navy admirals named John Sidney McCain. Last year, the Navy rededicated the ship to honor Sen. McCain. According to the Journal, sailors on the ship were given the day off and a barge was moved closer to the ship, obscuring its name. But a spokesman told the Journal that the tarp was taken down and the barge removed before the presidential visit. TRUMP SAYS NOT INVOLVED WITH KEEPING MCCAIN SHIP OUT OF VIEW Both Trump and Acting Defense Secretary Patrick Shanahan have denied knowing anything about any such orders. Trump told reporters Thursday that while he was not “a big fan” of McCain, “I would never do a thing like that.” \"Now, somebody did it because they thought I didn't like him, OK? And they were well-meaning, I will say,\" he said. CLICK HERE TO GET THE FOX NEWS APP “Secretary Shanahan was not aware of the directive to move the USS John S McCain nor was he aware of the concern precipitating the directive,” a spokesman for Shanahan said in a statement. In his statement Saturday, Brown said the Navy is “fully cooperating” with a review fo the matter tasked by the Pentagon. Fox News' Dom Callichio and The Associated Press contributed to this report.",
      "date": "June 1",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "John McCain dead at 81",
      "url": "https://www.foxnews.com/politics/john-mccain-dead-at-81",
      "subtitle": "John McCain dead at 81",
      "author": "Alex Pappas",
      "content": " U.S. Sen. John McCain, a war hero who survived five years as a prisoner of war in Vietnam, served three decades in Congress and went on to become the Republican Party’s nominee for president in 2008, died Saturday. He was 81 years old. In his last hours, the Arizona Republican turned down further medical treatment, his family announced in a statement. McCain was diagnosed with brain cancer in July 2017. Doctors discovered the tumor during a medical procedure to remove a blood clot from above his left eye. He remained upbeat after the diagnosis, flying back to Washington days after surgery with a large scar visible above his eye to partake in the Senate’s health care debate. “I greatly appreciate the outpouring of support - unfortunately for my sparring partners in Congress, I'll be back soon, so stand-by!” McCain tweeted on July 20 after his diagnosis. On Friday, his family issued a statement saying,“Last summer, Senator John McCain shared with Americans the news our family already knew: he had been diagnosed with an aggressive glioblastoma, and the prognosis was serious. In the year since, John has surpassed expectations for his survival. But the progress of disease and the inexorable advance of age render their verdict.\" They added, \"With his usual strength of will, he has now chosen to discontinue medical treatment.\" McCain's wife, Cindy, tweeted that her \"heart is broken\" following her husband's death. \"I am so lucky to have lived the adventure of loving this incredible man for 38 years,\" she said. \"He passed the way he lived, on his own terms, surrounded by the people he loved, in the the place he loved best.\" The senator's daughter, Meghan, posted a heartfelt note online, in which she said the \"task of [her] lifetime is to live up to [McCain's] example, his expectations, and his love.\" \"My father is gone, and I miss him as only an adoring daughter can,\" she wrote. \"He was a great fire who burned bright, and we lives in his light and warmth for so very long. We know that his flame lives on, in each of us. The days and years to come will not be the same without my dad — but they will be good days, filled with life and love, because of the example he lived for us.\" McCain was born in 1936 in the Panama Canal Zone, where his father was stationed in the Navy. After graduating from the Naval Academy in 1958, McCain went to Vietnam. In 1967, his A4 Skyhawk was hit by a surface-to-air missile over Hanoi. McCain was captured by the North Vietnamese, who tortured and beat him for more than five years. He was in solitary confinement for several of those years. “My room was fairly decent-sized - I’d say about 10 by 10,” McCain would later write. “The door was solid. There were no windows. The only ventilation came from two small holes at the top in the ceiling, about 6 inches by 4 inches. The roof was tin, and it got hot as hell in there.” His captors offered him early release after learning his father was a notable naval officer. But McCain refused to leave before the other prisoners. He was released in 1973. McCain’s injuries from his imprisonment were visible the rest of his life, most noticeably the restricted movement of his arms. McCain got a taste of politics in 1976, when he served as the Navy’s liaison to the Senate. In 1982, McCain was elected to the House of Representatives. Only a few years later, in 1986, he won the race to replace Arizona’s conservative Sen. Barry Goldwater. He was implicated in what became known as the Keating Five Scandal in 1989, accused with several other lawmakers of helping the owner of the Lincoln Savings and Loan, who had donated to his campaign. McCain ran twice for president. In 2000, he ran for the Republican nomination for president, winning New Hampshire’s primary but losing the nomination to George W. Bush. In 2008, he defeated a host of Republican candidates to win the GOP nomination for president. He was responsible for introducing then-Alaska Gov. Sarah Palin to a national audience by tapping her as his running mate. The McCain-Palin ticket went on to lose the general election to Barack Obama, who became the country’s first black president. For years, McCain declined to call his choice of Palin a mistake. But in his upcoming book, “The Restless Wave,” McCain reportedly writes that he regrets not choosing his friend, then-U.S. Sen. Joseph Lieberman, D-Conn., as his running mate, calling it “another mistake that I made.” Lieberman, the 2000 Democratic nominee for vice president, was an independent who caucused with Democrats. After the 2008 loss, McCain returned to the Senate, embracing his role as chairman of the Senate Armed Services Committee. During his last years in politics, he had a complicated relationship with President Trump, who infamously attacked McCain during the GOP primary. In May, the McCain family was offended when it was reported that Trump aide Kelly Sadler dismissed McCain's opposition to the president’s choice for CIA director by quipping during a private meeting, \"It doesn't matter, he's dying anyway.\" According to the New York Times, McCain has made clear to the White House he doesn’t want Trump to attend his funeral, and would instead prefer Vice President Mike Pence at a service. McCain is survived by his wife Cindy, seven children and five grandchildren.",
      "date": "August 25, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "Farewell statement from John McCain",
      "url": "https://www.foxnews.com/politics/farewell-statement-from-john-mccain",
      "subtitle": "Farewell statement from John McCain",
      "author": "",
      "content": "The following farewell statement from the late Sen. John McCain was read aloud Monday at a press conference in Phoenix, by his former campaign manager Rick Davis: “My fellow Americans, whom I have gratefully served for sixty years, and especially my fellow Arizonans, “Thank you for the privilege of serving you and for the rewarding life that service in uniform and in public office has allowed me to lead. I have tried to serve our country honorably. I have made mistakes, but I hope my love for America will be weighed favorably against them. “I have often observed that I am the luckiest person on earth. I feel that way even now as I prepare for the end of my life. I have loved my life, all of it. I have had experiences, adventures and friendships enough for ten satisfying lives, and I am so thankful. Like most people, I have regrets. But I would not trade a day of my life, in good or bad times, for the best day of anyone else’s. “I owe that satisfaction to the love of my family. No man ever had a more loving wife or children he was prouder of than I am of mine. And I owe it to America. To be connected to America’s causes – liberty, equal justice, respect for the dignity of all people – brings happiness more sublime than life’s fleeting pleasures. Our identities and sense of worth are not circumscribed but enlarged by serving good causes bigger than ourselves. “‘Fellow Americans’ – that association has meant more to me than any other. I lived and died a proud American. We are citizens of the world’s greatest republic, a nation of ideals, not blood and soil. We are blessed and are a blessing to humanity when we uphold and advance those ideals at home and in the world. We have helped liberate more people from tyranny and poverty than ever before in history. We have acquired great wealth and power in the process. “We weaken our greatness when we confuse our patriotism with tribal rivalries that have sown resentment and hatred and violence in all the corners of the globe. We weaken it when we hide behind walls, rather than tear them down, when we doubt the power of our ideals, rather than trust them to be the great force for change they have always been. “We are three-hundred-and-twenty-five million opinionated, vociferous individuals. We argue and compete and sometimes even vilify each other in our raucous public debates. But we have always had so much more in common with each other than in disagreement. If only we remember that and give each other the benefit of the presumption that we all love our country we will get through these challenging times. We will come through them stronger than before. We always do. “Ten years ago, I had the privilege to concede defeat in the election for president. I want to end my farewell to you with the heartfelt faith in Americans that I felt so powerfully that evening. I feel it powerfully still. “Do not despair of our present difficulties but believe always in the promise and greatness of America, because nothing is inevitable here. Americans never quit. We never surrender. We never hide from history. We make history. “Farewell, fellow Americans. God bless you, and God bless America.”",
      "date": "August 27, 2018",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    },
    {
      "title": "McCain has sharp response to Trump's John McCain dossier tweet",
      "url": "https://www.foxnews.com/politics/mccain-has-sharp-response-to-trumps-john-mccain-dossier-tweet",
      "subtitle": "McCain has sharp response to Trump's John McCain dossier tweet",
      "author": "Paulina Dedaj",
      "content": " Meghan McCain had a sharp response for President Trump on Saturday after he posted an unflattering tweet about her late father, saying that late Sen. John McCain had “far worse ‘stains’” against him than reports that he'd helped share the infamous Russia dossier. Quoting former Independent Counsel Ken Starr, the president got the ball rolling when he tweeted about new reports involving Senator McCain. Those reports said that the senator and an associate had shared with the FBI and various media outlets the unverified dossier alleging that Moscow held compromising information on Trump. COURT FILES REVEAL ROLE OF MCCAIN, ASSOCIATE IN SPREADING ANTI-TRUMP DOSSIER “Spreading the fake and totally discredited Dossier ‘is unfortunately a very dark stain against John McCain.’ Ken Starr, Former Independent Counsel,” Trump wrote. “He had far worse ‘stains’ than this, including thumbs down on repeal and replace [of the Obama-era Affordable Care Act] after years of campaigning to repeal and replace!” Meghan McCain, bristling at the remark, fired back with her own Twitter post, in which she said that “no one will ever love you the way they loved my father.” MEGHAN MCCAIN DECRIES TRUMP’S INFLUENCE ON REPUBLICAN PARTY, PREFERS TO CALL HERSELF A CONSERVATIVE She continued: “I wish I had been given more Saturday’s with him. Maybe spend yours with your family instead of on twitter obsessing over mine?” In a newly unsealed declaration from September, former senior counterintelligence FBI agent Bill Priestap confirmed that the FBI received a copy of the first 33 pages of the dossier in December 2016 from Senator McCain. McCain had denied being the source for BuzzFeed after it published the dossier, but acknowledged giving it to the FBI. CLICK HERE TO GET THE FOX NEWS APP The filings were unsealed as part of an ongoing libel case against BuzzFeed by a Russian businessman.",
      "date": "March 16",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "John_Mccain"
      }
    }
  ]
}