{
  "articles": [
    {
      "title": "Sarah Huckabee Sanders Is Still Going To Bat For Trump, Attacks Alexandria Ocasio-Cortez",
      "url": "https://search.huffpost.com/click/_ylt=Awr9Ikovq6td7tUAGzRsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560367/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fsarah-sanders-trump-aoc_n_5d1a46dfe4b082e5536daf2d/RK=2/RS=FUjUGmFZTWN.s1SW.ljv7Bq1eo0-",
      "subtitle": "The former White House press secretary left her job last week, but her defense of the president continues.",
      "author": "Julian Shen-Berro",
      "content": " Sarah Huckabee Sanders left her position as White House press secretary last week, but you wouldn’t know it from her most recent tweet. Huckabee Sanders attacked Rep. Alexandria Ocasio-Cortez (D-N.Y.) on Twitter Sunday, continuing the fierce defense of President Donald Trump that defined her tenure as press secretary. “[Ocasio-Cortez] is wasting your time on Twitter while destroying jobs in NY,” Huckabee Sanders wrote. “Thank you for reminding Americans everyday why they elected Trump.” Her tweet came in response to Ocasio-Cortez’s criticism of the president’s decision to bring his daughter, Ivanka Trump, to the G20 Summit in Osaka, Japan, which brought together leaders from across the globe. “It may be shocking to some, but being someone’s daughter actually isn’t a career qualification,” Ocasio-Cortez said after a video surfaced showing an awkward interaction between Trump’s eldest daughter and a number of world leaders. “The US needs our President working the G20. Bringing a qualified diplomat couldn’t hurt either.” Huckabee Sanders’ time at the White House was defined by verbal attacks on journalists and a defense of the president that often meant standing by his lies. Special counsel Robert Mueller’s report revealed that Huckabee Sanders lied to reporters in 2017 about former FBI director James Comey’s firing. She falsely told the public that the FBI had “lost confidence” in Comey, later admitting that the claim had been fabricated. On another occasion, Huckabee Sanders tweeted a doctored video from the far-right conspiracy website InfoWars to justify a White House ban on CNN reporter Jim Acosta. Since stepping down from her position, Huckabee Sanders is considering a run for governor in her home state of Arkansas — a move which Trump has openly supported. If she launches a campaign, she will likely work closely with the president once again.",
      "date": "07/01/2019 03:17 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Megan Rapinoe Accepts Invitation From Ocasio-Cortez To Tour The U.S. House",
      "url": "https://search.huffpost.com/click/_ylt=Awr9Ikovq6td7tUAGTRsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560367/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fmegan-rapinoe-ocasio-cortez-soccer-white-house_n_5d16cf5ae4b082e5536968b8/RK=2/RS=yP2oSXiu01a47ryQNDut3_vxsM0-",
      "subtitle": "“Consider it done!” in-your-face star midfielder responds after U.S. soccer team beats  France in Women’s World Cup quarterfinals.",
      "author": "Mary Papenfuss",
      "content": " While there’s no way Megan Rapinoe, co-captain of the U.S. women’s national soccer team, will visit the “fucking White House,” she accepted an invitation Friday from Rep. Alexandria Ocasio-Cortez (D-NY.) to tour the House of Representatives. The invitation for the team was issued via Twitter by the congresswoman. The star midfielder responded: “Consider it done!” Rapinoe added a party-face emoji blowing a noise-maker. AOC’s invitation was linked to an ESPN story about the team’s 2-1 victory over France in the quarterfinals of the Women’s World Cup. Rapinoe scored both goals. The team will now meet England in the semifinals. That’s bound to infuriate President Donald Trump, who found out last week that Rapinoe would not accept a team invitation to the White House to meet Trump, whom she has called a racist and a misogynist. Trump answered by taunting her on Twitter, saying she should “WIN” before talking about an invitation (she was responding to a reporter’s question). He also scolded: “Megan should never disrespect our Country, the White House, or our Flag.” Rapinoe, who is gay, has refused to sing the national anthem and doesn’t put her hand over her heart at the World Cup games as her protests of Trump’s policies. Rapinoe stood by her comments at a news conference in Paris (though she said she’s shouldn’t have used the expletive, which upset her mom). Rapinoe said the Trump administration “doesn’t fight for the same things we fight for.” The team hasn’t been invited to the White House, but Trump tweeted that he planned to invite the team whether they win the cup or not. Twitter fans celebrated the big win — and the connection between Ocasio-Cortez and Rapinoe. pic.twitter.com/7PUUWASyG4",
      "date": "06/28/2019 11:42 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Rep. Alexandria Ocasio-Cortez Points To Double Standard In Domestic Terrorism",
      "url": "https://search.huffpost.com/click/_ylt=Awr9Ikovq6td7tUAFzRsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560367/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2frep-alexandria-ocasio-cortez-points-to-double-standard-in-domestic-terrorism_n_5ce44096e4b06f64624be7f0/RK=2/RS=rWczanwCgUccEm5.btT1.Ju3z6M-",
      "subtitle": "null",
      "author": "",
      "content": "",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez Turns Newt Gingrich’s ‘Dishonest’ Smear Back On Him",
      "url": "https://search.huffpost.com/click/_ylt=Awr9Ikovq6td7tUAFTRsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560367/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2falexandria-ocasio-cortez-newt-gingrich-liar-response_n_5d206a5be4b01b8347372ba8/RK=2/RS=8qESpZ7AsKdbc3fKxDgiA.9Q8ec-",
      "subtitle": "The Democratic lawmaker fired back after the Republican former House speaker penned a scathing op-ed about her for Fox News.",
      "author": "Lee Moran",
      "content": " Rep. Alexandria Ocasio-Cortez (D-N.Y.) isn’t fazed about being called “dishonest” by former House Speaker Newt Gingrich (R). In fact, the congresswoman on Friday tweeted she would “take it as a compliment” because of all the other people that Gingrich and his fellow Republicans have also previously called liars: Ocasio-Cortez fired back at Gingrich after he penned a scathing op-ed about her for Fox News’ website published Friday. It was in response to Ocasio-Cortez’s report of her Monday visit with other Democratic lawmakers to a Customs and Border Protection detention facility in Texas, where she described witnessing “systemic cruelty.” The Department of Homeland Security’s own Office of the Inspector General also this week released a report detailing “dangerous overcrowding” and warned of health risks to migrants being held at multiple facilities. But Gingrich claimed in his article that Ocasio-Cortez’s comments had helped him “to understand how profoundly vicious, cruel and dishonest she is.” He also alleged that Ocasio-Cortez “is eager and determined to undermine and destroy America as we have known it.” Gingrich has gone after Ocasio-Cortez before. In March, he claimed her views were based “on whatever random thought comes in that morning and her proposals are beyond silly.”",
      "date": "07/06/2019 06:49 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Top House Progressive Says Pelosi Comments On Ocasio-Cortez And Allies Were Not ‘Helpful’",
      "url": "https://search.huffpost.com/click/_ylt=Awr9Ikovq6td7tUAEzRsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560367/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fpramila-jayapal-nancy-pelosi-squad-comments-not-helpful_n_5d290c4ee4b0bd7d1e1c6cfa/RK=2/RS=09t3xYeK.4moImL9U7XmM86O970-",
      "subtitle": "But Rep. Pramila Jayapal (D-Wash.) defended the House speaker’s governing philosophy and ruled out any questions about her racial sensitivity.",
      "author": "Daniel Marans",
      "content": " PHILADELPHIA ― Rep. Pramila Jayapal (D-Wash.), a co-chair of the Congressional Progressive Caucus, offered some qualified criticism Friday of House Speaker Nancy Pelosi’s disparaging comments about some of Jayapal’s progressive colleagues, even as she defended Pelosi’s overall leadership style. “I don’t think those comments were helpful to a broader picture of how we build progressive power in the House and what it looks like relative to overall Democratic power,” she said during a panel discussion at the liberal Netroots Nations conference in Philadelphia. Jayapal was being asked to respond to a public spat between Pelosi and four newly elected progressive congresswomen nicknamed “the Squad”: Reps. Alexandria Ocasio-Cortez of New York, Ilhan Omar of Minnesota, Rashida Tlaib of Michigan and Ayanna Pressley of Massachusetts. In an interview with New York Times op-ed columnist Maureen Dowd last Saturday, Pelosi made light of the Squad’s influence. “All these people have their public whatever and their Twitter world,” she said of the Squad. “But they didn’t have any following. They’re four people and that’s how many votes they got.” The four congresswomen were the only Democrats to vote against a House emergency border funding bill, which contained new conditions designed to ensure humane treatment of the asylum seekers surging across the border. The Squad thought that the conditions on how the money would be spent were insufficient and wanted to block additional funding for Immigration and Customs Enforcement entirely. In the end, the GOP-controlled Senate passed a bipartisan border funding bill by a margin of 84 to 8 that contained far fewer humanitarian regulations aimed at improving conditions in the detention facilities holding the asylum seekers. When the bill came back to the House, moderate Democrats forced a vote on the Senate version without amending it to include the more-liberal House provisions, defying Pelosi’s wishes and saddling her with a rare legislative loss. That Pelosi subsequently lashed out at the Squad for the first dissenting vote, rather than the centrists who foiled her plans when the Senate bill came back to the House, irked many progressive activists. It is also only the latest of many times when Pelosi has spoken dismissively about Ocasio-Cortez or her colleagues. In response, Ocasio-Cortez has gone so far as suggesting the four women are targets because they are not white. In an interview with The Washington Post, she criticized Pelosi for persistent “singling out of newly elected women of color,” which she called “outright disrespectful.” Jayapal, whose agenda largely depends on Pelosi’s cooperation, couched her modest criticism of the remarks with a far lengthier defense of the governing philosophy she believes Pelosi intended to articulate. “I believe that it all comes down to votes,” Jayapal said. “Whether you’re on the outside or the inside, you’ve got to be able to leverage the votes.” Thus, according to Jayapal, Pelosi, an expert vote counter, was merely pointing out that because the Squad does not command the support of a larger bloc of votes, they lack the power to dictate House Democrats’ agenda. “I think what Pelosi was talking about is if you only have four votes in the House that you can’t get what you want done,” she said. Jayapal, who is an immigrant from India, added a subtle repudiation of Ocasio-Cortez’s comments questioning Pelosi’s racial sensitivity. “I don’t typically find Pelosi to be someone who disrespects members,” she said. “I’ve never felt disrespected as a woman of color by Nancy Pelosi.” Sen. Jeff Merkley (D-Ore.) spoke alongside Jayapal on the panel at Netroots Nation, which was about how to enact ambitious progressive legislation. Jayapal arrived late from Washington because she had to vote on a defense spending bill, so initially Merkley had the panel to himself. He blamed House Democratic leaders for the passage of the unamended Senate bill, which he had voted against in the Senate. He argued that many Senate Democrats voted for the border security legislation on the assumption that House Democrats would pass their more ambitious version again and force the two legislative chambers into a conference committee that would produce a compromise. As a result of the House’s failure to force the bills into a conference committee, Merkley said, “We lost all the leverage that the progressives like Rep. Jayapal had worked so hard to get. It just went down the tube.” “The House has to carry its weight to restore the values of America,” he added. “It failed on this occasion.” When Jayapal arrived, she blamed Senate Democrats for passing the more conservative legislation by such a wide margin. That created a situation, she said, in which moderate House Democrats wondered why they could not just vote for such a consensus-driven bill. “We cannot have the Senate passing these big bipartisan votes because it affects what happens in the House,” she said.",
      "date": "07/12/2019 10:57 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Amazon Slams Alexandria Ocasio-Cortez’s ‘Starvation Wages’ Accusation As ‘Absurd’",
      "url": "https://search.huffpost.com/click/_ylt=Awr9Ikovq6td7tUAETRsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560367/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2falexandria-ocasio-cortez-amazon-starvation-wages_n_5d088ecfe4b0ea7c4a4ece6c/RK=2/RS=1NvAAXRfmP3R9NkyhroM_VtuKrQ-",
      "subtitle": "But the New York congresswoman stands by her criticism, pointing out the tech giant’s history of not paying employees a “living wage.”",
      "author": "Dominique Mosbergen",
      "content": " After Rep. Alexandria Ocasio-Cortez (D-N.Y.) accused Amazon of paying its employees “starvation wages” while its CEO Jeff Bezos enjoys the billionaire life, the tech giant pushed back, calling the congresswoman’s remarks “absurd” and “just wrong.” Speaking with ABC News’ “This Week” on Sunday, Ocasio-Cortez suggested Amazon was not fairly compensating its employees while Bezos, who has a net worth of roughly $118 billion, continues to fatten his coffers. The freshman congresswoman clarified that she doesn’t care if Bezos is a billionaire as long as Amazon pays its workers a “living wage” and provides them with adequate benefits. But, she said, if Bezos’ wealth is “predicated on paying people starvation wages and stripping them of the ability to access health care,” then that’s a major problem. Amazon hit back on Monday, saying in a tweet that it was “a leader on pay at $15 min wage + full benefits from day one.” Jay Carney, Amazon’s senior vice president of global corporate affairs, accused Ocasio-Cortez of “making stuff up about Amazon.” The company told CNN in a statement that the congresswoman’s allegations were “absurd.” But Ocasio-Cortez, a frequent critic of Amazon, had a rebuttal of her own. She took issue with the company’s use of the term “from day one,” sharing a link on Twitter on Monday night to a Daily Beast story from September about Amazon employees living “paycheck to paycheck” and some relying on public assistance programs to make ends meet. “If a person is working 40h/week & is paid so little that they need gov help to make ends meet, it’s not the person that’s a weight on our system ― it’s the company,” Ocasio-Cortez said. Amazon raised its minimum wage to $15 per hour last year after facing public pressure to do so. The company said at the time that its public policy team would also begin lobbying for an increase in the federal minimum wage. “We listened to our critics, thought hard about what we wanted to do, and decided we want to lead,” Bezos said in a statement of the wage increase. “We’re excited about this change and encourage our competitors and other large employers to join us.”",
      "date": "06/18/2019 06:00 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez Gives Mitch McConnell A Semantics Lesson After His McCarthyism Gripe",
      "url": "https://search.huffpost.com/click/_ylt=Awr9Ikovq6td7tUADzRsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560367/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2falexandria-ocasio-cortez-mitch-mcconnell_n_5d412b95e4b01d8c97834e5f/RK=2/RS=FPo51hENYpV7K0HD7v42DRBno8c-",
      "subtitle": "The freshman lawmaker has a few words about McConnell’s leadership skills.",
      "author": "Ed Mazza",
      "content": " Senate Majority Leader Mitch McConnell (R-Ky.) claims he was a victim of “McCarthyism” after critics dubbed him “Moscow Mitch” for blocking a bill to protect U.S. elections from Russian meddling. McConnell wrote on Twitter on Monday: On Tuesday, Rep. Alexandria Ocasio-Cortez (D-N.Y.) offered up a correction: Last week, McConnell blocked a bill passed by the House that would have authorized $775 million to help protect state election systems from Russian hacking and other threats. That action prompted critics to dub him “Moscow Mitch.” McConnell defended himself on the Senate floor by calling two of his critics “hyperventilating hacks.”",
      "date": "07/31/2019 03:42 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez Speaks Directly To White Supremacists In Surprise Appeal",
      "url": "https://search.huffpost.com/click/_ylt=Awr9Ikovq6td7tUADTRsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560367/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2falexandria-ocasio-cortez-white-supremacists_n_5d4a680ee4b01e44e47266b0/RK=2/RS=LaHj75FiEK8wIBNtTQ.bLBbdRuA-",
      "subtitle": "Freshman lawmaker has a message — and a promise — for anyone involved in hate groups.",
      "author": "Ed Mazza",
      "content": " Rep. Alexandria Ocasio-Cortez (D-N.Y.) says it’s time to stop debating if President Donald Trump is a racist. “He is,” she said on Monday at a Brooklyn vigil for the victims of mass shootings in El Paso, Texas and Dayton, Ohio. But then Ocasio-Cortez made a direct appeal to racists and white supremacists ― and her message was simple: “Come back.” She also called on those “radicalized in a funnel of vitriol” to turn away from hate, promising that they would be welcomed with love in return: “There is a mother waiting for you, I know it. I know there’s a teacher waiting for you, saying, ‘What happened to my kid? What happened to my friend?’ And we will always be here and hold space for you to come back. We will love you back. You are not too far gone.” Ocasio-Cortez shared that message on Twitter as well:",
      "date": "08/07/2019 05:10 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez Fires Back At Trump On Impeachment: ‘I’ll Call Your Bluff Any Day’",
      "url": "https://search.huffpost.com/click/_ylt=Awr9Ikovq6td7tUACzRsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560367/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2falexandria-ocasio-cortez-donald-trump-impeachment_n_5d06efd9e4b0985c419fca11/RK=2/RS=zjc5YcZPg5XDhsK6OrCnhgiKXW0-",
      "subtitle": "The president trades barbs with the freshman lawmaker on Twitter.",
      "author": "Ed Mazza",
      "content": " President Donald Trump claimed on Sunday that legally he can’t be impeached, which led to a correction on Twitter, courtesy of Rep. Alexandria Ocasio-Cortez (D-N.Y.). The spat began with a tweet from Trump, who quoted the freshman lawmaker’s warning to her fellow Democrats on their 2020 candidate. On ABC’s “This Week,” she said: I think that we have a very real risk of losing the presidency to Donald Trump if we do not have a presidential candidate that is fighting for true transformational change in the lives of working people in the United States. Trump agreed that Democrats have “a very real risk of losing” and said that’s why they want to impeach him. Then, he insisted that “the impeach card,” as he called it, “cannot be legally used.” The freshman lawmaker shot back:",
      "date": "06/17/2019 03:49 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez Has Donald Trump Twitter Block Ruling Turned Against Her",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DutGq6tde9kAtm9sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560390/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2falexandria-ocasio-cortez-lawsuit-twitter_n_5d25856ee4b0cfb595fdc753/RK=2/RS=FNu7MjfK09PUwJ8dez2_ecRHJMY-",
      "subtitle": "A Democrat and a Republican have filed lawsuits against the New York congresswoman which call for her to unblock them on Twitter.",
      "author": "Lee Moran",
      "content": " Rep. Alexandria Ocasio-Cortez (D-N.Y.) faces two legal challenges over her blocking of people from viewing her @AOC Twitter profile, which has more than 4.6 million followers. Democratic former New York state Assemblyman Dov Hikind and GOP congressional candidate Joseph Saladino (aka controversial YouTuber Joey Salads) on Tuesday announced separate lawsuits against Ocasio-Cortez, on the same day the 2nd U.S. Circuit Court of Appeals in Manhattan ruled that President Donald Trump cannot block critics from viewing his Twitter feed. They both want Ocasio-Cortez to unblock them and other people who she has banned from viewing her posts. Ocasio-Cortez’s office did not immediately respond to HuffPost’s request for comment. “This very practice has been litigated with regard to President Donald Trump blocking individuals on Twitter, and has recently been found unconstitutional,” Hikind wrote in the suit filed in the Eastern District of New York, that was shared online by Fox News: “See ya in court,” tweeted Hikind, who Ocasio-Cortez reportedly blocked for criticizing her description of migrant detention centers on the U.S.-Mexico border as “concentration camps.” Saladino, who is running in a GOP primary for the New York’s 11th Congressional District seat that is currently held by Rep. Max Rose (D-N.Y.), filed his suit in the Southern District of New York. “Trump is not allowed to block people, will the standards apply equally?” he tweeted. “Stay tuned to find out!”",
      "date": "07/10/2019 05:31 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez Calls Out Steve King’s Tweet About Visiting Auschwitz",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DutGq6tde9kAtG9sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560390/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2falexandria-ocasio-cortez-steve-king-concentration-camp-tweet_n_5d0ffe8ae4b07ae90d9f4a5b/RK=2/RS=1Q61Y9TvSZRR5Zm2g78Ebl38Ys4-",
      "subtitle": "The GOP congressman reportedly met with neo-Nazis when he was in Europe to visit the concentration camp site.",
      "author": "Mary Papenfuss",
      "content": " Rep. Alexandria Ocasio-Cortez (D-N.Y.) slammed white supremacist Rep. Steve King (R-Iowa) on Sunday after he snidely went after her for calling detention facilities for immigrant children in the U.S. “concentration camps.” King piously counseled her to accept an open invitation from a Holocaust remembrance group to visit Auschwitz, as he said he had. “I went with a deep understanding of the Shoah and had a profound personal experience,” he tweeted to Ocasio-Cortez. One problem, the congresswoman snapped back: “The last time you went on this trip it was reported that you also met [with] fringe Austrian neo-Nazi groups to talk shop.” King reportedly met with a group founded by a former Nazi SS officer last year while visiting Europe on a trip paid for by From the Depths, the same group that has invited Ocasio-Cortez to tour Auschwitz. The Anti-Defamation League demanded afterward that GOP leadership condemn King and remove him from his chairmanship of the House Judiciary Committee. He was finally stripped of his positions on the judiciary and the agriculture committees earlier this year, after he asked during a New York Times interview what was offensive about white supremacy. Ocasio-Cortez added that she has “absolutely zero patience for completely certified, card-carrying and flag-waving racists. ... They can take their little tiki torches somewhere else.” Rep. Liz Cheney (R-Wyo.) also got caught in Ocasio-Cortez’s takedown. “Perhaps you should come collect your colleague before more members of your caucus start saying the quiet parts loud,” she wrote. King has not replied to Ocasio-Cortez’s tweets. But several Twitter users joined the congresswoman in attacking him, and they supported her view that child detention sites are comparable to concentration camps. “These mattresses are perfectly comfortable.”",
      "date": "06/23/2019 09:44 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez Calls For Donald Trump’s Impeachment",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DutGq6tde9kAsm9sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560390/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2falexandria-ocasio-cortez-donald-trump-impeachment_n_5d0d5379e4b0aa375f4c948b/RK=2/RS=qa3f0HS0Lz4HzeveZx9U0d229bY-",
      "subtitle": "The New York congresswoman made it official on Friday after telling the president last Sunday via Twitter why he should be worried.",
      "author": "David Moye",
      "content": " Alexandria Ocasio-Cortez joined the growing chorus of politicians calling for Donald Trump’s impeachment. The freshman congresswoman from New York made her thoughts known in a very brief tweet on Friday. It’s not exactly a surprise, especially after their harsh Twitter exchange last Sunday night. It started when Trump tweeted out a truncated quote from Ocasio-Cortez that warned how Democrats could lose the 2020 election. Ocasio-Cortez said: “I think that we have a very real risk of losing the presidency to Donald Trump if we do not have a presidential candidate that is fighting for true transformational change in the lives of working people in the United States.” Trump cut off the last part of her argument, tweeting: The New York Democrat fired back a few hours later and told the president that impeachment was a very real possibility. In April, Ocasio-Cortez said she’d support a resolution introduced in March by Rep. Rashida Tlaib (D-Mich.) that would look into whether the House should impeach the president. Currently, nearly 70 members of the House, overwhelmingly Democrats, have called for an impeachment inquiry of Trump. This story has been updated to note that Ocasio-Cortez said she would support an impeachment resolution in April.",
      "date": "06/21/2019 06:40 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Louisiana Police Officer Suggests Alexandria Ocasio-Cortez Be Shot In Facebook Post",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DutGq6tde9kAsG9sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560390/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2flousiana-police-officer-suggests-alexandria-ocasio-cortez-be-shot-in-facebook-post_n_5d34a5fce4b0419fd32e7a27/RK=2/RS=dzDTMBr76Xi7hw6bykY1OoU_NWU-",
      "subtitle": "The violent remark comes amid heightened concern for lawmakers’ safety following Trump’s attacks on congresswomen of color.",
      "author": "Amy Russo",
      "content": " A Louisiana police officer suggested in a Facebook post last week that Rep. Alexandria Ocasio-Cortez (D-N.Y.) should be shot, mocking her as a “vile idiot.” On Thursday, Gretna officer Charlie Rispoli wrote that the congresswoman “needs a round, and I don’t mean the kind she used to serve,” according to NOLA.com, which first reported the remarks. The comment was written in response to a phony news article Rispoli shared that falsely accused Ocasio-Cortez of saying, “We pay soldiers too much.” On Wednesday, fact-checking site Snopes.com debunked that story as a fake. Asked by NOLA.com for a reaction to Rispoli’s now-deleted post, Chief Arthur Lawson called it “disturbing,” but did not see it as a threat. “I will tell you this: This will not go unchecked,” he told the outlet. “I’m not going to take this lightly and this will be dealt with on our end. It’s not something we want someone that’s affiliated with our department to make these types of statements. That’s not going to happen.” Neither Ocasio-Cortez’s office nor the police department immediately responded to HuffPost’s request for comment. The violent statement comes amid President Donald Trump’s repeated attacks against Ocasio-Cortez and three other progressive Democrats ― Reps. Ilhan Omar of Minnesota, Ayanna Pressley of Massachusetts and Rashida Tlaib of Michigan. In a slew of tweets last week, Trump appeared to urge the lawmakers ― all of whom are women of color ― to “go back” to “the totally broken and crime infested places from which they came.” Omar is the only member of the group who was not born in the U.S. She emigrated from Somalia as a refugee when she was a child. In May, Ocasio-Cortez revealed in a Twitter thread that she has faced a “flood of death threats,” sometimes inspired by coverage on Fox News. “I‘ve had mornings where I wake up & the 1st thing I do w/ my coffee is review photos of the men (it’s always men) who want to kill me,” she wrote, noting that she doesn’t even see them all ― only “the ones that have been flagged as particularly troubling.” Last week, House Homeland Security Committee Chairman Bennie Thompson (D-Miss.) sent a letter to Senate Sergeant-at-Arms Michael Stenger, calling for the Capitol Police Board to “re-examine” its evaluation of security threats against Congress, citing Trump’s remarks about Ocasio-Cortez and her colleagues as the reason for his concern. “As you are familiar, inflammatory remarks targeting individuals on social media and in public arena were a central feature of the presidential campaign and now, presidency of Donald J. Trump,” Thompson wrote. “The President’s rhetoric may insinuate more attacks on Members of Congress.” At a House Administration Committee hearing on Tuesday, Capitol Police Chief Steven Sund said there were 4,894 cases of threats made against congressional lawmakers last year. “So far, for this year, we have 2,502 cases,” he added. “So we’re on par to probably break last year’s record.”",
      "date": "07/21/2019 05:14 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Writer Whose Ancestor Opened First Japanese American Camp: Ocasio-Cortez Is Right",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DutGq6tde9kArm9sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560390/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fwriter-whose-ancestor-opened-first-japanese-american-incarceration-camp-aoc-is-right_n_5d1bb24ce4b03d6116439857/RK=2/RS=DHT4QNYORugQkEopRq0x8IXv.9M-",
      "subtitle": "Mary Catherine Ford’s ancestor Clayton Triggs opened the Manzanar War Relocation Center. She agrees detained migrants are in “concentration camps.”",
      "author": "Kimberly Yam",
      "content": " A writer whose great-great uncle served as director of a Japanese American concentration camp during World War II just wrote a column in support of Rep. Alexandria Ocasio-Cortez (D-N.Y.). While the freshman representative’s description of the U.S. detention centers at the southern border as “concentration camps” drew criticism from conservatives, Mary Catherine Ford, whose ancestor Clayton Triggs helped open the Manzanar War Relocation Center, said Ocasio-Cortez is “right to call out what’s happening in our southern border camps.” “I would know — because someone in my family opened the first Japanese American concentration camp in the United States,” she wrote. In her piece, Ford brought up the Trump administration lawyer, Sarah Fabian, who made headlines last week for arguing in court that basic toiletries wouldn’t fall under the law requiring “safe and sanitary” conditions for children in detention facilities. The writer noted that Fabian’s argument draws a parallel to “a speech my relative, Clayton Triggs, gave to Japanese Americans.” “He promised them the camp would afford them a ‘great latitude of freedom and self-governance,’ as if his words could erase their incarceration behind barbed wire,” she said. Ford further explained that Triggs had built the “Children’s Village” at Manzanar, the most closely guarded Japanese American incarceration camp. He had also requested permission to erect the concentration camp’s barbed wire and eight guard towers “from which soldiers would sit and point searchlights and live munitions down at these children.” Upon hearing the news that the Trump administration planned to detain undocumented immigrant children apprehended at the border at Fort Sill, site of a former Japanese American concentration camp, Ford realized that “the past has returned.” ″‘Safe and sanitary’ and ‘Children’s Village,’ ‘summer camp’ and ‘freedom’: then and now, the government uses language to hide and distort the truth,” she wrote. “Like a family that hides its shame, too many Americans accept the administration’s distortions rather than face that truth.” Ford wrote that the definition and function of concentration camps have remained consistent throughout history ― they detain “civilians because of who they are, not what they have done.” “This was true in 1942 when my family member opened the first concentration camp for Japanese Americans and it is true in 2019 as Trump continues his ‘zero tolerance’ policy of separating brown children from their loved ones and locking them in cages,” she wrote. She concluded with a sentiment inspired by author Viet Thanh Nguyen, urging people to “fight Trump’s tale of an invasion, of ‘animals’ on our southern border by telling a more powerful story.” Nina Wallace, a communications coordinator for Densho, an organization that works to preserve Japanese American history, previously told HuffPost that Manzanar was “absolutely” a U.S. concentration camp. “A concentration camp is a place where civilians are confined for military or political purposes based on their identity,” she explained. “These were compounds of barracks surrounded by barbed wire fences and patrolled by armed guards, which Japanese Americans could not leave without permission.” Wallace told HuffPost that by failing to describe these detention facilities as concentration camps, the Trump administration is continuing to use euphemisms as a “deliberate tool to obscure harsh realities and prevent us from recognizing historical patterns.” Read Mary Catherine Ford’s full article here.",
      "date": "07/02/2019 10:56 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Ocasio-Cortez Confronts Acting DHS Chief Over Secret Facebook Group For Border Agents",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DutGq6tde9kArG9sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560390/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2focasio-cortez-dhs-kevin-mcaleenan_n_5d315ecfe4b020cd99415156/RK=2/RS=OkGutL.18iV1KBDkFybyQDszgJU-",
      "subtitle": "Freshman lawmaker Alexandria Ocasio-Cortez asked acting DHS Secretary Kevin McAleenan if Trump’s policies had contributed to a “dehumanizing culture.”",
      "author": "Nick Visser",
      "content": " Rep. Alexandria Ocasio-Cortez (D-N.Y.) confronted the acting secretary of homeland security, Kevin McAleenan, on Thursday amid a report this month that DHS employees belonged to a secret Facebook group that shared violent, racist images among its members, including a photoshopped meme of the congresswomen being assaulted. McAleenan was grilled by the freshman lawmaker during a hearing before the House Oversight Committee about the Trump administration’s policy of separating migrant children from their parents. Ocasio-Cortez used her time to point to a July ProPublica report that uncovered the secret group, where around 9,500 members, some who belonged to Border Patrol, joked about migrant deaths and posted the violent memes. During her questioning, she asked if the acting secretary had seen photoshopped images of herself shared in the group, and asked if any members of Border Patrol affiliated with them were still responsible for working with migrant women and children. “Did you see the images of officers circulating photoshopped images of my violent rape?” the lawmaker asked. “Do you think that the policy of child separation could have contributed to a dehumanizing culture within CBP that contributes and kind of spills over into other areas of conduct?” McAleenan replied that he had, but demurred about any potential Border Patrol officers that had been reprimanded to for their involvement, saying simply that some had been placed on “administrative duties.” An investigation by Customs and Border Patrol said this week it determined at least 62 current border agents were in the offensive group. “We do not have a dehumanizing culture at CBP. This is an agency that rescues 4,000 people a year. It’s absolutely committed to the well-being of everyone that they interact with,” McAleenan replied. He went on to note that the posts were “unacceptable” and said he had ordered an ongoing investigation “within minutes” of learning about the group. Ocasio-Cortez stood by her line of questioning on Twitter later that day, noting that in her estimation, Trump administration policies were “gravely dehumanizing” and had stripped “all involved of human decency.” President Donald Trump and his immigration officials have faced a nonstop whirlwind of criticism over their hard-line border policies, including the short-lived but devastating “zero tolerance” policy that saw thousands of migrant children separated from their parents. Recently, border officials have been operating under the White House’s “Remain in Mexico” policy, which has seen thousands of asylum-seekers sent back across the southern border while they wait for their cases to be heard. Lawmakers also fired blistering criticism at McAleenan amid ongoing reports of filthy, overcrowded conditions at migrant detention centers along the southern border. “What does that mean when a child is sitting in their own feces? Can’t take a shower?” Rep. Elijah Cummings (D-Md.), the chairman of the oversight committee, said during the hearing. “What’s that about? None of us would have our children in that position. They are human beings.”",
      "date": "07/19/2019 05:48 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez Compared To Kim Jong Un In Pro Baseball Team Video",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DutGq6tde9kAqm9sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560390/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2falexandria-ocasio-cortez-kim-jong-un-fresno-grizzlies_n_5ced5b24e4b00e0365756cbe/RK=2/RS=ivNdv2VyPn5Scb2ly5ZI3n4aInc-",
      "subtitle": "The Fresno Grizzlies apologized for not properly vetting the clip shown between games of a Memorial Day doubleheader.",
      "author": "Ron Dicker",
      "content": " A minor-league baseball team apologized Monday for its bush-league video depicting Rep. Alexandria Ocasio-Cortez (D-New York) as an “enemy of freedom.” An image of Ocasio-Cortez, a progressive often targeted by conservatives, appeared between North Korean leader Kim Jong Un and the late Cuban strongman Fidel Castro in a Memorial Day tribute clip that aired during a Fresno Grizzlies doubleheader at Chukchansi Park, according to outlets. “As for the enemies of freedom, those who are potential adversaries, they will be reminded that peace is the highest aspiration of the American people,” the late President Ronald Reagan said in the clip, accompanied by the pictures of the congresswoman and the two dictators, plus images of the Antifa movement. See the segment at the 3:00 mark. The Grizzlies, an AAA affiliate of the Washington Nationals, apologized for not properly vetting the outside pre-produced video, and called it misleading and offensive in its editing. “We unconditionally apologize to Rep. Ocasio-Cortez,” the club wrote in another tweet. A Grizzlies rep told USA Today that the employee responsible for showing the video is “remorseful” and is no longer permitted to operate in that capacity. Ocasio-Cortez’s office did not immediately respond to a request for comment.",
      "date": "05/28/2019 01:32 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez Highlights ‘The Headline’ Of John Bolton’s Exit",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DutGq6tde9kAqG9sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560390/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2falexandria-ocasio-cortez-headline-donald-trump-john-bolton_n_5d79ffb4e4b06028fd376656/RK=2/RS=Pl5vZOQgOE90MoRzg7RAQIgTyNU-",
      "subtitle": "“That’s it,” the New York lawmaker captioned a TV news chyron about President Donald Trump and North Korean dictator Kim Jong Un.",
      "author": "Lee Moran",
      "content": " Rep. Alexandria Ocasio-Cortez (D-N.Y.) on Wednesday tweeted what she believed should be “the headline” on John Bolton’s departure as White House national security adviser. “That’s it. That’s the headline,” she captioned a screenshot of a TV news chyron that read in part: “Trump sides with Kim Jong Un.” “Obviously Bolton leaving is good ― it was an enormous mistake to appoint him in the first place,” Ocasio-Cortez wrote in a second tweet about Bolton, who took a hawkish stance on foreign policy matters. “One doesn’t need to boost authoritarians to make the point,” she added. Trump on Wednesday appeared to side with the North Korean dictator when explaining Bolton’s exit. Trump and Bolton have told contradictory stories of whether Bolton was fired or resigned. Bolton “made some very big mistakes when he talked about the Libyan model for Kim Jong Un,” Trump said. “That was not a good statement to make. You just take a look at what happened with [Muammar] Gaddafi. That was not a good statement to make. And it set us back.” “I don’t blame Kim Jong Un for what he said after that,” Trump added, in reference to insulting comments the North Korean regime made about his adviser. “And he wanted nothing to do with John Bolton. And that’s not a question of being tough. That’s a question of being not smart to say something like that.”",
      "date": "09/12/2019 04:49 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Ocasio-Cortez Tells Off Kevin McCarthy: Blame White Supremacy, Not Video Games",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DutGq6tde9kApm9sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560390/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2falexandria-ocasio-cortez-kevin-mccarthy_n_5d47928ae4b0acb57fce8a54/RK=2/RS=avDtiTt_oAfNPhjkyB1fpfUTyCM-",
      "subtitle": "The freshman lawmaker called out the House minority leader for blaming video games after two mass shootings.",
      "author": "Ed Mazza",
      "content": " House Minority Leader Kevin McCarthy (R-Calif.) on Sunday suggested that video games are to blame for mass shootings. And Rep. Alexandria Ocasio-Cortez (D-N.Y.) wasn’t having it. Video games “dehumanize individuals to have a game of shooting individuals and others,” McCarthy said on Fox News shortly after mass shootings in El Paso, Texas, and Dayton, Ohio, left a combined total of at least 31 people dead. “When you look at these photos of how [the El Paso shooting] took place, you can see the actions within video games and others,” McCarthy said. But Ocasio-Cortez said the real problem is white supremacy, and argued that it’s an issue Republicans won’t address because that would mean taking on part of their base: The suspected gunman in El Paso is a white man who reportedly shared a white supremacist manifesto online before the shooting. The hate-filled document attacked immigrants, claiming there is a “Hispanic invasion of Texas.” President Donald Trump has also called immigration an “invasion,” including in his campaign ads on Facebook. Ocasio-Cortez shared a tweet showing some of those ads:",
      "date": "08/05/2019 12:15 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez Questions Lack Of Domestic Terrorism Law",
      "url": "https://search.huffpost.com/click/_ylt=Awr9Dstfq6tdNlgASwJsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560415/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2faoc-questions-lack-of-domestic-terrorism-law_n_5cf8140ae4b091478aaf895c/RK=2/RS=9YH6xNQABKEHUuL4QDc7HBpOkCg-",
      "subtitle": "null",
      "author": "",
      "content": "",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Ocasio-Cortez Has A Brutal Reality Check For Bret Stephens After Bedbug Meltdown",
      "url": "https://search.huffpost.com/click/_ylt=Awr9Dstfq6tdNlgASQJsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560415/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2focasio-cortez-bret-stephens-bedbug_n_5d65d8dbe4b022fbceb2bc0a/RK=2/RS=gmcakpuMeTSYU3T7o03bQXBirjE-",
      "subtitle": "The first-term congresswoman roasts the conservative New York Times columnist after he flipped out on a critic.",
      "author": "Ed Mazza",
      "content": " Rep. Alexandria Ocasio-Cortez (D-N.Y.) torched conservative New York Times columnist Bret Stephens for losing it after a critic called him a “bedbug.” The lawmaker wrote on Twitter: Stephens, who has in the past claimed to be a free speech advocate and urged college students to leave their “safe spaces,” sent a terse message to George Washington University associate professor David Karpf over this tweet: Not only did he send the message to Karpf, but he also copied it to the university’s provost. “He not only thinks I should be ashamed of what I wrote, he thinks that I should also get in trouble for it,” Karpf told The Washington Post. “That’s an abuse of his power.” Stephens got scorched on Twitter for his overreaction to the criticism ― and eventually shut down his account completely. “Twitter is a sewer. It brings out the worst in humanity,” he wrote. “I sincerely apologize for any part I’ve played in making it worse, and to anyone I’ve ever hurt. The Times has not commented.",
      "date": "08/28/2019 12:12 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Smiling ‘Team Mitch’ Supporters Pose While Choking Cutout Of Alexandria Ocasio-Cortez",
      "url": "https://search.huffpost.com/click/_ylt=Awr9Dstfq6tdNlgARwJsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560415/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2faoc-choking-team-mitch-kentucky-picnic_n_5d48b3a5e4b01ae816c7416c/RK=2/RS=Bs0FxT7lbinutYIfO4nr2qmBvmo-",
      "subtitle": "Instagram post follows “Team Mitch” tweet of cardboard gravestones, including one with the name of McConnell’s Democratic opponent, Amy McGrath.",
      "author": "Mary Papenfuss",
      "content": " A group of young men in “Team Mitch” campaign shirts supporting Senate Majority Leader Mitch McConnell at an annual political picnic in Kentucky were captured in a photo smiling as one of them pretended to strangle a cardboard cutout of Rep. Alexandria Ocasio-Cortez (D-N.Y.). Social media accounts of some of the men identified by Twitter users were taken down — or shut down by Twitter for inappropriate postings — by Monday. But at least one Instagram account of a local Republican backer who also attended the picnic had it up late in the day. It was also later removed. Ocasio-Cortez slammed back at the Senate majority leader after seeing the post, asking if McConnell is “paying for young men to practice groping & choking members of Congress w/ your payroll, or is this just the standard culture of #TeamMitch?” McConnell campaign spokesman Kevin Golden told HuffPost in an email that Team Mitch “in no way condones any aggressive, suggestive, or demeaning act toward life-sized cardboard cutouts of any gender.” He said the men are “not campaign staff; they’re high schoolers, and it’s incredible that the national media has sought to once again paint a target on their backs rather than report real, and significant news in our country.” Some of the same men also appeared in a photo on the official “Team Mitch” Instagram account for the Fancy Farm picnic, holding aloft cutout faces of Supreme Court Justices Brett Kavanaugh and Neil Gorsuch. The photo was the second controversial image to come out of Team Mitch’s participation at the Fancy Farm picnic. Another photo showed cardboard gravestones, including one with the name of the Kentucky senator’s Democratic challenger in 2020, Amy McGrath. The campaign tweeted the image under the headline: “The Grim Reaper of Socialism.” McConnell’s campaign manager, Kevin Golden, insisted the gravestones were a homage to a cartoon in the Louisville Courrier-Journal that featured gravestones, also including one of McGrath. Both images linking killing and death to political targets come at a particularly fraught time, after a weekend that saw two mass murders — including the apparently hate-fueled attack in El Paso, Texas, that has left 22 people dead. Critics are linking the violence to political leaders’ hate speech and racist attacks. Ocasio-Cortez and three other freshman congresswomen of color — along with African American Rep. Elijah Cummings (D-Md.) — have been viciously attacked in recent weeks in public statements by President Donald Trump.",
      "date": "08/05/2019 10:11 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "‘The View’ Women Back Nancy Pelosi In Feud With Alexandria Ocasio-Cortez",
      "url": "https://search.huffpost.com/click/_ylt=Awr9Dstfq6tdNlgARQJsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560415/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fthe-view-women-nancy-pelosi-alexandria-ocasio-cortez_n_5d27d6cae4b0060b11e9da79/RK=2/RS=hcCjCvJ3uSShN5TahXCCw9Cai1E-",
      "subtitle": "But the real “enemy is the guy tweeting in his toilet,” co-host Joy Behar reminds the audience.",
      "author": "Mary Papenfuss",
      "content": " The women of “The View” joined forces Thursday to back House Speaker Nancy Pelosi (D-Calif.) against the latest attack from Rep. Alexandria Ocasio-Cortez. Co-host Joy Behar, however, told the audience that the real “enemy is the guy tweeting in his toilet” — meaning President Donald Trump. Ocasio-Cortez called out Pelosi for her “outright disrespectful” attacks “singling out newly elected women of color” in a Washington Post interview published Wednesday. That followed Pelosi’s slam in a New York Times interview Saturday that Ocasio-Cortez and other members of the so-called “Squad” of first-term Democratic congresswomen ― Ilhan Omar (Minn.), Rashida Tlaib (Mich.) and Ayanna Pressley (Mass.) — that, although the women had their “public whatever and Twitter world,” they had little support in Congress. Behar said the feud was “disheartening.” She added: “We have to get rid of this guy” in the White House, and “this type of infighting is not helping.” Behar decried “going to race right away,” calling it a “bit much.” Whoopi Goldberg noted: “I have a problem with how all these young women started out when they were accusing older Democrats like myself of not getting what needed to be done in the country” and failing to consider veteran Democrats’ past activism. “You’re on the shoulders of a whole bunch of people who came before you. You have to stop discounting that,” she added. “It’s annoying to people,” Goldberg said. “I don’t think this had to do with color. I think this is more, I don’t know, B.S.” She said later that if these women can’t deliver a vote on a bill they back, “you’re not allowed to bitch about this.” Co-host Meghan McCain also supported Pelosi’s position in the feud, noting that the Democratic leader was the one who helped deliver the 2018 midterms for the party. But she also sniped that it was “Democrat-on-Democrat crime,” adding that Republicans “see the bigger picture” and generally stay united. Though Sunny Hostin was critical, she also emphasized that the younger women are energizing a disaffected segment of the Democrats, which shouldn’t be discounted. “I think you’re seeing a generational clash ... it’s unfortunate because I would hope that they could work together and that Pelosi would harness this sort of fervor that they have brought into the party,” Hostin said. “There can be power if the two generations get together.” The latest fissure erupted after Pelosi ended up ditching a House measure to instead back the Senate version of a border security bill last month, even though it offered no guarantees for humanitarian aid for detained immigrant children. Goldberg indicated at the start of the segment that the four first-term congresswomen were the only Democrats to vote against the Senate version, but, in fact, 95 Democrats in the House voted against it. Check out the rest of what “The View” panelists had to say in the video up top.",
      "date": "07/12/2019 12:36 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Cops Fired For Facebook Post Suggesting Alexandria Ocasio-Cortez Should Be Shot",
      "url": "https://search.huffpost.com/click/_ylt=Awr9Dstfq6tdNlgAQwJsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560415/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2flouisiana-police-officers-fired-for-facebook-post-suggesting-alexandria-ocasio-cortez-be-shot_n_5d361bcde4b0419fd3315ffe/RK=2/RS=A0Jkl.oMbIfz8YMMpEi08dpI0PM-",
      "subtitle": "The Gretna, Louisiana, police chief said he did not feel the Facebook post represented a legitimate threat.",
      "author": "Amy Russo",
      "content": " Two Louisiana policemen have been fired over a Facebook post that suggested Rep. Alexandria Ocasio-Cortez (D-N.Y.) should be shot ― one of the officers wrote the menacing message and the other “liked” it. On Saturday, NOLA.com reported on the post that officer Charlie Rispoli wrote Thursday, calling the congresswoman a “vile idiot” who “needs a round, and I don’t mean the kind she used to serve.” According to NOLA, officer Angelo Varisco then hit the “like” button. In a Monday press conference, Gretna Police Chief Arthur Lawson announced that both had lost their jobs that day for violating the department’s social media policy. “This incident we feel has been an embarrassment to our department that these officers have certainly acted in a manner which was unprofessional, alluding to a violent act to be conducted against a sitting U.S. congress[woman], a member of our government,” Lawson said. “We’re not going to tolerate that.” Though it is a felony crime to threaten a sitting member of Congress, Lawson told NOLA he did not feel the Facebook post represented a legitimate threat. The Gretna Police Department did not immediately respond to HuffPost’s request for comment. Rispoli wrote the comment while sharing a fake news article that falsely claimed Ocasio-Cortez said, “We pay soldiers too much.” Fact-checking site Snopes.com debunked that story on Wednesday. On Monday afternoon, the congresswoman responded to news of the threatening remark on Twitter, blaming President Donald Trump for “sowing violence” and “creating an environment where people can get hurt & he claims plausible deniability.” “This is Trump’s goal when he uses targeted language & threatens elected officials who don’t agree w/ his political agenda,” she said. “It’s authoritarian behavior.” Last week, the president began attacking Ocasio-Cortez along with three other lawmakers of color ― Reps. Ilhan Omar (D-Minn.), Ayanna Pressley (D-Mass.) and Rashida Tlaib (D-Mich.). The president wrote a series of tweets in which he urged ”‘Progressive’ Democratic Congresswomen” to “go back” to “the totally broken and crime infested places from which they came.” All were born in the U.S. with the exception of Omar who emigrated from Somalia as a child. Trump’s remarks have since drawn widespread condemnations for their blatant racism, though he has repeatedly doubled down on the comments. And he is now targeting the women by name, including in tweets and in statements made at his Wednesday North Carolina rally, as well as in media interviews. In May, Ocasio-Cortez opened up on Twitter about the security risks of her job, stating that she has received a “flood of death threats.” “I‘ve had mornings where I wake up & the 1st thing I do w/ my coffee is review photos of the men (it’s always men) who want to kill me,” she wrote. During a House Administration Committee hearing on Tuesday, Capitol Police Chief Steven Sund confirmed that lawmakers will likely be at higher risk this fiscal year compared to the last. So far, this year 2,502 cases of threats have been seen, Sund said, noting that “we’re on par to probably break” last year’s record total of 4,894 cases.",
      "date": "07/22/2019 06:53 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "All The Problems With This Anonymous Poll About Alexandria Ocasio-Cortez",
      "url": "https://search.huffpost.com/click/_ylt=Awr9Dstfq6tdNlgAQQJsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560415/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2faxios-alexandria-ocasio-cortez-poll_n_5d2cdb78e4b0a5833c5d4bce/RK=2/RS=kYcnkQevWFzE7.iJ4EZbgFFMaOo-",
      "subtitle": "Be smart: Don’t bother with unsourced data.",
      "author": "Ariel Edwards-Levy",
      "content": " The 2020 general election is still more than a year away, but it’s never too early for some truly unhelpful polling coverage. As part of the latest salvo of Democratic infighting, Axios published Sunday what they called an “exclusive poll” from May of white likely voters without college degrees. The results, Axios’ Mike Allen wrote, have been circulated by top Democrats to show “that one of the House’s most progressive members — Rep. Alexandria Ocasio-Cortez — has become a definitional face for the party with a crucial group of swing voters.” Just don’t ask where it came from. “The group that took the poll shared the results with Axios on the condition that it not be named because the group has to work with all parts of the party,” Allen wrote. Why it matters: With public trust in polling frayed, and pollsters adopting an increasingly diverse array of methods to keep up with the times, transparency has become more crucial than ever both for the firms conducting surveys and the outlets reporting on them ― making the idea of reporting on an “anonymous poll” an unfortunate outlier. Here are some of the Associated Press’s guidance for survey reporting: “Reputable poll sponsors and public opinion researchers will disclose the methodology used to conduct the survey, including the questions asked and the results to each, so that their survey may be subject to independent examination and analysis by others…. Polls paid for by candidates or interest groups may be designed to produce results that are beneficial to that candidate or group, and they may be released selectively as a campaign tactic or publicity ploy.” Here’s an excerpt from CNN’s new standards for writing about polls: “Evaluating the validity of a poll is only possible if pollsters are transparent about what they are doing. Transparency has become a critical part of how those in the survey research world assess the validity of other research ... A poll’s existence alone does not make it news, and journalists shouldn’t be any more credulous about numbers than they are about words.” In this case, readers have no way of knowing who commissioned the poll, who conducted it, how they identified the voters they surveyed, what methodology they used to interview them or what exactly respondents were asked. That makes it basically impossible to evaluate the survey in any meaningful way. Go deeper: Beyond the questionable sourcing, the polling data provided doesn’t make a clear case that white voters who aren’t college graduates see Ocasio-Cortez as the face of the party. The numbers included ― name recognition and favorability for Ocasio-Cortez and Rep. Ilhan Omar (D-Minn.), as well as opinions on capitalism and socialism ― suggest that both congresswomen have unusually high national profiles for freshman representatives and that neither is popular among the subgroup surveyed. But those numbers don’t establish whether they’re seen as defining all Democrats. That’s an eminently pollable question: A 2017 CNN survey, for instance, asked, “Thinking about Democratic leaders today―which one person best reflects the core values of the Democratic Party?” It also doesn’t establish whether they’re actually less popular than Democrats in general. The bloc polled ― white voters who aren’t college graduates― is Republican-leaning in general. And in one publicly available poll, a February Economist/YouGov survey, Ocasio-Cortez’s net favorability rating (that is, the share who rated her favorably minus the share who rated her unfavorably) among white voters without degrees was roughly in line with ratings for House Speaker Nancy Pelosi and for Democrats as a whole. That’s obviously one datapoint, and a dated one at that. But it suggests that these voters tend to be consistent either in liking the Democratic Party and its politicians or in disliking them. There are a few additional hazy details in the Axios story. The headline implies that its findings reflect “swing states,” but the article doesn’t make it clear whether the poll was conducted nationally or only in battleground states. And although the article provides exact percentages on how few of the voters polled viewed Ocasio-Cortez and Omar favorably, it doesn’t include numbers on how many viewed them outright unfavorably, rather than having no opinion. The bottom line: Basing a story on unsourced, thinly contextualized polling data isn’t savvy; it’s deeply credulous.",
      "date": "07/15/2019 05:57 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez’s Top 2 Staffers Leave Her Congressional Office",
      "url": "https://search.huffpost.com/click/_ylt=Awr9Dstfq6tdNlgAPwJsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560415/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2falexandria-ocasio-cortez-chief-of-staff-communications-director-leave_n_5d45dc9ae4b0ca604e32ee08/RK=2/RS=dqfO0JPulGTFLNpNeI7TBQa.w00-",
      "subtitle": "Chief of Staff Saikat Chakrabarti will join efforts to develop the Green New Deal, and Communications Director Corbin Trent will work on the congresswoman’s 2020 campaign.",
      "author": "Amy Russo",
      "content": " Saikat Chakrabarti, the chief of staff to Rep. Alexandria Ocasio-Cortez (D-N.Y.) who sparked controversy earlier this summer by comparing House Democrats to Southern segregationists, is leaving her office, HuffPost confirmed Saturday. Communications Director Corbin Trent will also step down from his role. According to a statement from Ocasio-Cortez, Chakrabarti will join climate change-focused nonprofit New Consensus to help further develop the Green New Deal, an ambitious economic and environmental initiative promoted by Ocasio-Cortez and other progressive Democrats. “I am extraordinarily grateful for his service to advance a bold agenda and improve the lives of the people in NY-14,” the congresswoman said. “From his co-founding of Justice Democrats to his work on the campaign and in the official office, Saikat’s goal has always been to do whatever he can to help the larger progressive movement, and I look forward to continuing working with him to do just that.” Trent will return to Ocasio-Cortez’s campaign where he will direct communications for her 2020 reelection bid. “With the Ocasio2020 campaign beginning to ramp up, I’ve asked Corbin to transition to the campaign full-time and he has agreed to do so,” Ocasio-Cortez said. “I’m looking forward to growing the movement with him in Queens and the Bronx and across the country.” Chakrabarti, an alum of Sen. Bernie Sanders’ (I-Vt.) 2016 presidential campaign, co-founded Justice Democrats in 2017, a progressive political group that jump-started Ocasio-Cortez’s congressional run, leading to the defeat of incumbent Rep. Joe Crowley (D), who hadn’t faced a primary challenger since 2004. In June, Chakrabarti appeared to inflame existing tensions between Ocasio-Cortez and moderate Democrats, writing in a now-deleted tweet that the New Democrats and the Blue Dog Caucus should instead be called the “New Southern Democrats,” a reference to pro-segregationists. “They certainly seem hell bent to do to black and brown people today what the old Southern Democrats did the 40s,” he wrote. House Speaker Nancy Pelosi (D-Calif.), who had feuded publicly with Ocasio-Cortez in the past over her progressive views, spoke out, calling the tweet “offensive,” according to Politico. In July, Pelosi privately warned her colleagues to stop airing their political grievances on Twitter, telling them to come to her instead, NBC News reported. Shortly after Pelosi delivered the word of caution, the House Democrats’ Twitter account took aim at Chakrabarti online for a critique of Rep. Sharice Davids (D-Kan.), who voted to pass an emergency federal appropriations bill for humanitarian aid and security at the southern border, such as President Donald Trump’s wall. Frustrated by Davids’ decision, which the bills’ opponents said gave into Trump’s demands, Chakrabarti said she was one of a horde of Democrats voting “as a block to criminalize immigrants.” “I don’t believe Sharice is a racist person, but her votes are showing her to enable a racist system,” he clarified. In response, the House Democratic Caucus account tweeted back, “keep her name out of your mouth.” According to The Intercept, which first reported the news, Chakrabarti’s last day was Friday.",
      "date": "08/03/2019 05:56 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez, Rashida Tlaib Blast Trump Over Border In Emotional Testimony",
      "url": "https://search.huffpost.com/click/_ylt=Awr9Dstfq6tdNlgAPQJsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560415/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2falexandria-ocasio-cortez-rashida-tlaib-blast-trump-border_n_5d28d5f2e4b0060b11ec0942/RK=2/RS=TeCpbyVS5sozh0wvH.DDsaC.fZQ-",
      "subtitle": "Tlaib said the administration is “dead set on sending a hate-filled message, that those seeking refuge are not welcome in America.”",
      "author": "Alexis Arnold",
      "content": " The worst thing about touring immigrant detention facilities at the border was seeing cruelty occur under the American flags hung everywhere, Rep. Alexandria Ocasio-Cortez (D-N.Y.) said Friday while testifying on family separations and the treatment of migrants. “Children are being separated from their families in front of an American flag,” the congresswoman told the House Oversight Committee as she fought back tears. “We cannot allow for this.” Ocasio-Cortez, a fierce critic of the Trump administration, was among four Democratic members of Congress to testify before fellow lawmakers about what they saw during visits to the border. They described seeing migrants covered in filth from an inability to shower or change, with canker sores from unhealthy food, and only thin blankets for sleeping on concrete. They called on Congress to act as migrants report overcrowded facilities and little access to care or medication. The Trump administration has blamed the number of undocumented immigrants arriving at the border ― which dipped last month but hit record numbers earlier this year ― on loose immigration laws, demanding more funding, a border wall and legal changes to restrict access to asylum. But the Democrats argued the administration has exacerbated the crisis through its policies, including the family separations it carried out last year. Rep. Veronica Escobar (D-Texas), who represents a district on the border with Mexico, also testified at the hearing. “This is not a matter of resources, but a matter of will,” she said. “We have the power to change this. Do we have the will?” She called her city, El Paso, “a modern day Ellis Island.” Volunteers there have helped migrants for years. Over the last year, they have ramped up efforts to feed, shelter and care for the thousands of migrant families released weekly by the Department of Homeland Security. “My community, with a fraction of the resources available to the federal government, has responded more strategically, thoughtfully and compassionately than the federal government has,” Escobar said. During testimony from Rep. Rashida Tlaib (D-Mich.), she displayed a drawing by a detained child showing people being held in a cell and asked the audience not to look away. Wiping away tears, Tlaib went on to tell the stories of the people she met at various border facilities, including one about a pregnant woman who has since been released. She also noted that 100 Border Patrol agents died by suicide from 2007 to 2018. Family separations were hard on agents as well as migrants, she said. “The dehumanization is not only with those families, but it’s also with the agents that we’ve told to do this to these families,” Tlaib said. Describing the Trump administration’s current strategy as cruel and intentional, she said it’s “dead set on sending a hate-filled message, that those seeking refuge are not welcome in America. In our America.” CORRECTION: An earlier version of this article said 100 Border Patrol agents had died by suicide between 2017 and 2018. The time period was 2007 to 2018.",
      "date": "07/12/2019 05:43 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Bernie Sanders Suggests Nancy Pelosi Should Lay Off Alexandria Ocasio-Cortez",
      "url": "https://search.huffpost.com/click/_ylt=Awr9Dstfq6tdNlgAOwJsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560415/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fbernie-sanders-nancy-pelosi-alexandria-ocasio-cortez_n_5d2b2b33e4b0060b11ee0199/RK=2/RS=BLhT982lcaaZUY3M6_HxQBGoWi8-",
      "subtitle": "Asked whether Pelosi was being too tough on the freshman congresswoman, Sanders said, “I think a little bit.”",
      "author": "Igor Bobic",
      "content": " Sen. Bernie Sanders (I-Vt.) on Sunday sided with Rep. Alexandria Ocasio-Cortez (D-N.Y.) and her fellow progressive freshman congresswomen amid an ongoing spat over tactics and policy with House Speaker Nancy Pelosi (D-Calif.). Asked during an interview on NBC’s “Meet the Press” whether Pelosi was being too tough on the freshman New York congresswoman, Sanders said, “I think a little bit.” The intraparty fight spilled into the open when, in an interview with The New York Times, Pelosi dismissed the power of Ocasio-Cortez and her fellow progressive freshmen in the House: Ilhan Omar (Minn.), Ayanna Pressley (Mass.) and Rashida Tlaib (Mich.). The four lawmakers had opposed a House funding bill aiming to address the migrant crisis at the border because it didn’t provide sufficient restrictions on how the Trump administration could spend the money. They also vocally protested when the House later passed a weaker Senate version with even fewer restrictions after moderates in the lower chamber signaled their support for the bill. “All these people have their public whatever and their Twitter world. But they didn’t have any following. They’re four people and that’s how many votes they got,” Pelosi said when asked about the freshman congresswomen, who have a large following online. Ocasio-Cortez responded by calling Pelosi’s “singling out” of Democratic women of color “disrespectful.” The spat continued late Friday night, after the official Twitter account for House Democrats ― managed by Rep. Hakeem Jeffries (D-N.Y.), a member of party leadership — fired off a critical tweet about Ocasio-Cortez’s chief of staff. House Democrats were reportedly incensed when the aide, Saikat Chakrabarti, compared current moderate Democrats to the Southern Democrats who enabled segregationist policies in the 1940s. During his interview on Sunday, Sanders, who is running for the Democratic presidential nomination in 2020, seemed to echo concerns about Pelosi singling out the four women. “You cannot ignore the young people of this country who are passionate about economic and racial and social and environmental justice. You gotta bring them in, not alienate them,” he said. The discord among Democrats may end up being short-lived. President Donald Trump’s racist tweet Sunday morning telling the four Democratic congresswomen to “go back” to their native countries — when all are U.S. citizens, and only one was born abroad — will likely only unify the House Democratic Caucus.",
      "date": "07/14/2019 11:28 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez Embraces Her Maverick Role In First Town Hall Since High-Profile Spat",
      "url": "https://search.huffpost.com/click/_ylt=Awr9CKt6q6tdRSgALe5sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560442/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2falexandria-ocasio-cortez-immigration-town-hall-maverick-defiant-progressive-corona-queens_n_5d33b7c8e4b020cd99446eaa/RK=2/RS=WWiYmHGqxth.XJ1WOSqL2nIi0o0-",
      "subtitle": "The diverse and progressive crowd that greeted the New York congresswoman showed a more idealistic side of the party than the one that holds sway in Washington.",
      "author": "Daniel Marans",
      "content": " QUEENS, N.Y. ― Less than a week after President Donald Trump told her to “go back” to her country, Rep. Alexandria Ocasio-Cortez (D-N.Y.) returned to her home — New York City. She held a town hall in Corona, Queens — her first since the end of June. The topic of the forum, held in the auditorium of a public school, was immigration ― the same issue that had landed her in the crosshairs of both House Speaker Nancy Pelosi (D-Calif.) and Trump. But facing hundreds of her diverse and adoring constituents, some of whom held homemade signs welcoming her, the freshman congresswoman defended her progressive vision of immigration reform against attacks from both Republicans and her fellow Democrats. “We’re here. They sent me back to Queens ― and I’m happy to be here,” she began with a chuckle, drawing sustained applause and shouts of “welcome home” from the crowd. Ocasio-Cortez trained her fire first on Trump, arguing that his remarks revealed his racist character. “All you need to do is hear what the president did this week to know that this is not about immigration at all. Because once you start telling American citizens to quote ‘go back to their countries,’ this tells you that this president’s policies are not about immigration, it’s about ethnicity and race,” she said. “His biggest mistake was that he said the quiet part loud.” But without naming names, the New York congresswoman also acknowledged that she has been taking flak for her positions from fellow Democrats. “I’ll keep it real with you all, even within our party it’s a difficult issue. ... One of the reasons I get in trouble is because I talk about immigration too much. It’s because I try to protect our community quote-unquote too much. It’s because I say that there are some things that should not be up to politics and putting kids in cages is one of them,” she said, prompting loud applause. Ocasio-Cortez called for the creation of a commission — modeled after the storied commission that analyzed the causes of the Sept. 11 attacks — to look into the causes and impact of the Trump administration’s policy of separating immigrant children from their parents. “That kind of study is what’s going to be required in order to reunify as many children with their parents as possible,” she said. In her remarks, Ocasio-Cortez also proposed a similar commission to study the damage and aftermath of Hurricane Maria in Puerto Rico. In a subsequent tweet, she added an appeal for a panel to study reparations for the descendants of slaves. Rarely, if ever, has Ocasio-Cortez felt more pressure from her party leadership than in the past few weeks. At the end of June, Ocasio-Cortez and the three Democratic colleagues ― Reps. Rashida Tlaib (Mich.), Ayanna Pressley (Mass.) and Ilhan Omar (Minn.) ― who are together known as “the Squad,” were the only House Democrats to vote against a border funding bill backed by Speaker Pelosi and House leadership that sought to provide greater resources for federal authorities to deal with a surge of asylum-seekers at the Southern border. The congresswomen cast their votes as a matter of conscience, arguing that there were inadequate humanitarian strings attached to the new money and that border funding should be conditional on an end to practices like the detention of children. The bill passed easily, despite their opposition. The Republican Senate passed a border funding bill with none of the conditions the House approved. But rather than pass their bill again in the House and force a conference committee to draw up a compromise between the two chambers, moderate Democrats in the House led a revolt against Pelosi that forced the passage of the unamended Senate bill. Rather than publicly chide the moderates, Pelosi targeted the Squad, telling a New York Times columnist on July 6, “These people have their public whatever and their Twitter world. But they didn’t have any following. They’re four people and that’s how many votes they got.” A war of words ensued between members of the Squad, who felt unfairly singled out, and Democratic leadership and its staffers, who are wary of the progressive primary challenges that propelled Ocasio-Cortez and Pressley to power. The tiff came to a head on July 12 when the House Democratic Caucus’ official Twitter account insulted Ocasio-Cortez’s chief of staff and Pelosi’s deputy chief of staff retweeted it. Ocasio-Cortez defended her vote against the original House vote again on Saturday, even as she avoided reviving the now-dormant feud with Pelosi and her allies. She argued that it lacked the key humanitarian provisions, like the addition of doctors to facilities run by the Customs and Border Protection agency. “I got heat from my own party for ... making that point,” she said of the vote. “But if we really want to pass a humanitarian bill, then let’s pass a humanitarian bill. If it’s not a humanitarian bill, don’t call it a humanitarian bill.” The event, which was translated into Spanish, Mandarin, Bangla, Tibetan, Nepali and American Sign Language in real time, felt like a window into an alternative progressive universe where the heavily populated, diverse and more liberal communities in coastal cities actually drove the policy agenda on Capitol Hill. Ocasio-Cortez even indulged the audience with her vision of a proactive immigration policy that does not merely react to Trump, but tears down barriers that preceded him. She called for making immigration enforcement a civil, rather than a criminal, matter once again. Her appeal echoes the message of former Housing Secretary Julián Castro, the only Latino presidential candidate, who has made turning unauthorized border crossing into a civil, rather than criminal, offense a cornerstone of his campaign. “Especially when it comes to immigration ... it feels like we’re always coming from a defensive place. We’re just trying to protect what we have,” she said. “We have to talk about the world that we want and are fighting for.” Thanks to the existence of the Senate, partisan gerrymandering in the House and exaggerated fears of a mythical conservative swing voter, Democratic leaders in Congress are often cautious to the point of inaction. They are constantly seeking a balance between policies that curb Trump’s worst excesses and more milquetoast maneuvers designed not to turn off the moderate voters they believe they need to win elections. It’s a reality Ocasio-Cortez acknowledged, noting that her Democratic colleagues shot down an amendment to the defense budget she proposed that would have banned U.S. troops at the Southern border. House Armed Services Committee Chairman Adam Smith (D-Wash.) told HuffPost on Wednesday that the committee did not issue any recommendation to members on whether to vote for the amendment because of the objections of more moderate Democrats on the Homeland Security Committee. Even if Democrats have unified control of the federal government, Ocasio-Cortez said, “that doesn’t mean that immigration policy is going to change. Because if we elect a party that thinks creating a humane border is going to lose them the election, they’re not going to create that humane border.” “A lot of the work we need to do is cultural, because we need to make immigration policy a commonsense, non-radical thing,” Ocasio-Cortez added. Perhaps in an attempt to move that cultural needle, Ocasio-Cortez did not repeat her characterization of the border detention centers as “concentration camps.” She also sought to give historical context to another town hall speaker’s call to dismantle the Department of Homeland Security, or DHS, noting that its creation in 2003 combined many federal agencies with different functions that could easily be spun off once more. “Reorganizing and getting rid of DHS is not as radical as George Bush’s implementation and creation of DHS,” she said. Whether Ocasio-Cortez will succeed in building more support for her policy agenda inside Congress with such arguments remains to be seen. But she has a powerful campaign war chest at her disposal and ― as the ecstatic throngs of supporters who came to see her on a steamy Saturday attest ― she enjoys a grassroots following that is likely unparalleled in the House. To the extent that her supporters were aware of Ocasio-Cortez’s feud with Pelosi, they appeared to side with their congresswoman. “Pelosi needs to go. Her day has come and gone,” said Rhoda Dunn, a real estate broker from Jackson Heights who brought a homemade “Welcome Home AOC” sign. Some of those in attendance were not even from the district, but had instead come from other parts of New York City to see the rockstar congresswoman in person. One such Ocasio-Cortez fan, Michael Howard, traveled from Far Rockaway, a neighborhood in southeast Queens represented by Rep. Gregory Meeks. Meeks succeeded Joe Crowley, whom Ocasio-Cortez ousted in June 2018, as chairman of the Queens County Democratic Party, and is a political adversary of Ocasio-Cortez’s in borough politics. “Her and these three other congresswomen who are trying to save this country more than anyone else in Washington, D.C. ― they’re like the Ninja Turtles,” Howard said, referencing a popular culture franchise. “And Bernie Sanders is Splinter,” he added referencing the ninja turtles’ fictional teacher.",
      "date": "07/20/2019 10:24 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez Explains Why Interns Should Be Paid With More Than Experience",
      "url": "https://search.huffpost.com/click/_ylt=Awr9CKt6q6tdRSgAK.5sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560442/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2falexandria-ocasio-cortez-paid-interns_n_5d3a061fe4b004b6adbd0edd/RK=2/RS=g2A2nVTwrKKxL8EqkDVxOygvJuA-",
      "subtitle": "The New York Democrat only needed five words to answer in a video she shared on National Intern Day.",
      "author": "Sanjana Karanth",
      "content": " On National Intern Day, three of the four progressive congresswomen known as “the Squad” explained why it’s so important to pay interns. “Today I was asked why we should bother paying interns if they’re ‘getting experience for their résumé,’” Rep. Alexandria Ocasio-Cortez (D-N.Y.) tweeted on Thursday. To respond, she attached a NowThis video of her with Reps. Rashida Tlaib (D-Mich.) and Ayanna Pressley (D-Mass.) shouting, “Experience doesn’t pay the bills!” The video was filmed for Pay Our Interns, a nonprofit group that advocates for more paid internships in the government, for-profit and nonprofit sectors. In September, Congress approved a spending package for the 2019 fiscal year that set aside about $14 million to pay congressional interns, the first time that the Hill allocated funds for paid internships. The House received about $8.8 million to distribute across lawmakers’ offices, and the Senate got $5 million. The appropriations bill added an average of $20,000 for each House member and $50,000 for each senator to pay interns. Last month, Pay Our Interns released the results of its House internship audit and found that only 9% of congressional offices advertise paid internships, while 61% advertise that they don’t offer paid internships. “Many believe our work on Capitol Hill is done because Congress appropriated the funds, but these numbers prove that our work is only beginning,” Pay Our Interns co-founder Guillermo Creamer said in a June 25 statement. “It is astonishing to see that so many offices have decided not to use any of the $20,000 allocated for intern pay. What is even more alarming is the percentage of offices that provide no information about intern salaries whatsoever.” Ocasio-Cortez has pointedly advocated for a living wage for congressional interns. She said in December that all interns in her office would be paid $15 an hour with benefits, and announced in February that she would pay her staff no less than $52,000 a year. The amount, first reported by Roll Call, was almost unheard of for many congressional staff members in their 20s who work long hours with little to no pay.",
      "date": "07/25/2019 05:19 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez Has A Blunt Correction For Trump’s Puerto Rico Boast",
      "url": "https://search.huffpost.com/click/_ylt=Awr9CKt6q6tdRSgAKe5sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560442/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2falexandria-ocasio-cortez-trump-puerto-rico_n_5d673db2e4b063c341fa8ad6/RK=2/RS=CAExTkOH8dUAOZ945AgRlNNNa18-",
      "subtitle": "The freshman lawmaker joins others in slamming Trump’s claim that he’s the “best thing that’s ever happened to Puerto Rico.”",
      "author": "Ed Mazza",
      "content": " President Donald Trump claims he’s the “best thing that’s ever happened to Puerto Rico,” the island he has repeatedly trashed during his presidency. But critics beg to differ, including Rep. Alexandria Ocasio-Cortez (D-N.Y.). As Hurricane Dorian barreled down on Puerto Rico on Wednesday, Trump tweeted a series of attacks against its officials and called it “one of the most corrupt places on earth.” In 2017, some 3,000 people died when Hurricane Maria hit Puerto Rico. The devastating storm was worsened by FEMA’s multiple failures, as the agency itself concluded last year. Yet, Trump has repeatedly defended his administration’s response and attacked the island, and on Wednesday, Ocasio-Cortez had had enough: Others also slammed Trump over the bizarre claim: ",
      "date": "08/29/2019 12:34 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez Doesn’t Think Joe Biden Is The ‘Pragmatic Choice’ For Democrats",
      "url": "https://search.huffpost.com/click/_ylt=Awr9CKt6q6tdRSgAJ.5sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560442/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2faoc-doesnt-think-joe-biden-is-the-pragmatic-choice-for-democrats_n_5d137a8fe4b04f059e4d8134/RK=2/RS=PtSoyYZvep18qDlgLqFvQFr_hvI-",
      "subtitle": "The congresswoman suggested in an interview with Vogue that Biden, like Hillary Clinton, wouldn’t “inspire the turnout that we needed.”",
      "author": "Andy Campbell",
      "content": " Alexandria Ocasio-Cortez doesn’t think former Vice President Joe Biden is the right fit for the Democratic nomination for president. In an interview with Vogue, Ocasio-Cortez (D-N.Y.) said she was wary about making an endorsement prior to the Democratic primary debates this week. But she did add Biden wasn’t the “pragmatic choice,” especially given his recent comments fondly recalling his work with segregationists. “I think that he’s not a pragmatic choice,” she said. She told Vogue: “That’s my frustration with politics today, that they’re willing to give up every single person in America just for that dude in a diner. . .Just so that you can get this very specific slice of Trump voters? If you pick the perfect candidate like Joe Biden to win that guy in the diner, the cost will make you lose because you will depress turnout as well. And that’s exactly what happened to 2016. We picked the logically fitting candidate, but that candidate did not inspire the turnout that we needed.” Even without his controversial comments, Biden has been steadily slipping in the polls since he announced his presidential bid, though he still holds a lead over a sea of other Democratic candidates. Sens. Bernie Sanders (I-Vt.) and Elizabeth Warren (D-Mass.) remain his strongest competitors leading into the primary debates. The favor of Ocasio-Cortez, meanwhile, appears to have some political weight to it. Her pick for a progressive district attorney in Queens, New York, Tiffany Caban, declared victory in her contested race on Tuesday night, though officials say the race remains too close to call. Read the full Vogue interview here.",
      "date": "06/26/2019 10:55 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Ocasio-Cortez Defends Blocking People On Twitter: ‘Harassment Is Not A Viewpoint’",
      "url": "https://search.huffpost.com/click/_ylt=Awr9CKt6q6tdRSgAJe5sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560442/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2falexandria-ocasio-cortez-twitter-block_n_5d69443ae4b02bc6bb38d9f2/RK=2/RS=lieMW1Kqg4OUDroxAOfdfzeM1.s-",
      "subtitle": "The Knight First Amendment Institute sent a letter urging the lawmaker not to block users for their “views.”",
      "author": "Kimberley Richards",
      "content": " Rep. Alexandria Ocasio-Cortez (D-N.Y.) defended her decision to block certain Twitter users after the Knight First Amendment Institute at Columbia University urged her not to block people based on their “viewpoints.” The progressive lawmaker argued on Twitter on Thursday that among her some 5.2 million followers on the social media platform, she has fewer than 20 users blocked due to reported harassment. She added that none of the blocked users are her constituents. “Harassment is not a viewpoint,” Ocasio-Cortez wrote. “Some accounts, like the Daily Caller, posted fake nude photos of me & abused my comments to spread it. No one is entitled to abuse.” In January, the Caller, a right-wing news site, published an explicit photo of a woman who was not Ocasio-Cortez, along with a misleading headline that did not clearly state it was not the lawmaker in the photo. The publication later said it regretted the headline and changed it. The Knight First Amendment Institute, which works to defend freedom of speech in the digital age, issued a letter to Ocasio-Cortez in hopes of “dissuading” her from blocking Twitter users due to their “views.” The institute argued that Ocasio-Cortez uses her personal account as “an extension” of her formal office. Ocasio-Cortez’s office did not immediately respond to a request for comment. In July, New York state Assemblyman Dov Hikind (D) and GOP congressional candidate Joseph Saladino (a controversial YouTuber known as Joey Salads), filed separate lawsuits against Ocasio-Cortez, claiming the representative had blocked them on Twitter. Hikind’s lawsuit cited a July ruling by the 2nd U.S. Circuit Court of Appeals in Manhattan, in a legal challenge by the institute, which found that the First Amendment forbids President Donald Trump from blocking his critics from viewing his Twitter account. The decision upheld a May 2018 ruling. “The First Amendment does not permit a public official who utilizes a social media account for all manner of official purposes to exclude persons from an otherwise-open online dialog because they expressed views with which the official disagrees,” Circuit Judge Barrington Parker wrote in the July ruling. Ocasio-Cortez, who represents New York’s 14th Congressional District, addressed the institute’s letter in another tweet from her personal account on Thursday. “People are free to speak whatever classist, racist, false, misogynistic, bigoted comments they’d like,” she wrote. “They do not have the right to force others to endure their harassment and abuse.” The Knight First Amendment Institute acknowledged in its letter that Ocasio-Cortez “may wish to block users for reasons that are both reasonable and constitutionally legitimate ― for example, because their speech is threatening.” The institute also noted the persistent threats and abuse that women of color often face on social media, and wrote that those attacks “can deter speech and political participation that are crucial to our democracy.” “We would welcome the chance to work with you to develop a social media policy that both complies with the First Amendment and helps you address threats, abuse, and harassment,” the institute’s letter read. CORRECTION: A prior version of this article stated that the Knight First Amendment Institute represented Hikind and Saladino in their July lawsuits. It did not.",
      "date": "08/30/2019 05:24 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez Explains How Donald Trump’s Racism Works ‘As Cover For The Con’",
      "url": "https://search.huffpost.com/click/_ylt=Awr9CKt6q6tdRSgAI.5sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560442/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2falexandria-ocasio-cortez-donald-trump-racism-con_n_5d6f5f83e4b09bbc9ef6abd0/RK=2/RS=RGnDTwzusSELu4wxJl.O7yfOEUY-",
      "subtitle": "The New York lawmaker broke down in a viral Twitter thread why “it’s always about the con” with the president.",
      "author": "Lee Moran",
      "content": " Rep. Alexandria Ocasio-Cortez (D-N.Y.) explained why she believes “virtually every policy” that President Donald Trump pursues is actually a ruse to “personally enrich himself & his friends” ― and how racism works “as the cover for the con” because “corruption isn’t popular policy.” “It’s always about the con,” she wrote Tuesday on Twitter in a thread that’s now going viral. “That’s why addressing racism isn’t a ‘distraction,’” Ocasio-Cortez explained. “It’s key to understanding the hustle against working people.” Check out the full thread here: Ocasio-Cortez had earlier used a separate thread to call out the Trump administration for “grinding legal, documented immigration to a halt.”",
      "date": "09/04/2019 03:39 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Laura Ingraham Tries To Troll Alexandria Ocasio-Cortez For Grammar. It Backfires.",
      "url": "https://search.huffpost.com/click/_ylt=Awr9CKt6q6tdRSgAIe5sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560442/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2falexandria-ocasio-cortez-laura-ingraham-twitter-exchange_n_5d6901b5e4b06beb649ccfa0/RK=2/RS=FogsAZbnfRTCubS6pqEQT3qtdEs-",
      "subtitle": "Ocasio-Cortez ended the Twitter exchange by calling the Fox News host “a neo-Nazi fan favorite.”",
      "author": "Lee Moran",
      "content": " Laura Ingraham attempted to make fun of Rep. Alexandria Ocasio-Cortez (D-N.Y.) on Twitter for her grammar, but it didn’t end well for the Fox News personality. The exchange culminated with Ocasio-Cortez calling the widely watched conservative network’s prime-time host, who has a history of peddling white nationalist talking points on her show, “a neo-Nazi fan favorite.” It began when Ocasio-Cortez explained why she blocks some accounts on Twitter: Ingraham fired back with a grammatical correction: Ocasio-Cortez explained in reply how Ingraham had proved her point. “See?” she wrote. “You’re a neo-Nazi fan favorite and I don’t block you for defending white supremacist viewpoints and mocking gun violence survivors.” Ingraham sparked widespread anger and lost advertisers in 2018 after she mocked David Hogg, a teenage survivor of the mass shooting in Parkland, Florida. She also has a long past of demonizing immigrants, as this March supercut from progressive watchdog group Media Matters shows:",
      "date": "08/30/2019 07:59 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez Says She Loves ‘Everything About This GOP Attack Ad’",
      "url": "https://search.huffpost.com/click/_ylt=Awr9CKt6q6tdRSgAH.5sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560442/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2falexandria-ocasio-cortez-loves-gop-attack-ad_n_5d68917ae4b06beb649bbf66/RK=2/RS=35L6x4Xtac0piOEcg1aywplyC.s-",
      "subtitle": "The New York congresswoman says Republicans are doing her a favor with the video.",
      "author": "Josephine Harvey",
      "content": " Rep. Alexandria Ocasio-Cortez (D-N.Y.) isn’t bothered by a recent attack video produced by the right-wing group Media Research Center (MRC) ― in fact, she thinks they’re doing her a favor. The MRC TV video is framed as a spoof of Jack Handey’s “Deep Thoughts” skit from “Saturday Night Live.” Dubbed “Shallow Thoughts,” it features footage of Ocasio-Cortez discussing climate change that had originally appeared on her Instagram. In the story, Ocasio-Cortez said that fighting climate change may be expensive, but ignoring it could have much more costly effects. “You think overhauling our economy to decarbonize and save the planet is going to be expensive? Try not decarbonizing our economy and allowing sea levels to rise, every coastal city to go underwater,” she said. MRC responded to Ocasio-Cortez’s response with a blog post that mocked her intelligence for mistaking the conservative organization as an official Republican group. They said the video was not an ad and was not paid for by the GOP. Numerous Twitter users responded to MRC’s comments with a few observations of their own: So y’all spent money spreading her message even further? pic.twitter.com/3Hje3EUO8L",
      "date": "08/30/2019 03:29 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    },
    {
      "title": "‘I Am back,’ Bernie Sanders Tells Supporters At NYC Rally",
      "url": "https://search.huffpost.com/click/_ylt=Awr9CKt6q6tdRSgAHe5sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560442/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fbernie-sanders-welcome-back-queens-heart-attack_n_5dab74e2e4b0422422c5e936/RK=2/RS=40ykuv_bLYFWKy4HYjk6xmKXK4c-",
      "subtitle": "The event marked Sanders’ formal return to the campaign trail less than three weeks after he suffered a heart attack.",
      "author": "",
      "content": "NEW YORK (AP) — Storming past questions about his health, Bernie Sanders vowed that he’s “more ready than ever” to fight for a political revolution — with a little help from new friends — at a rally Saturday that drew thousands to a New York City park. The rally offered a pointed reminder to skeptics in both political parties that the 78-year-old democratic socialist is still very much a force in the 2020 presidential race. Sanders opened his remarks by apologizing that he secured a permit for only 20,000 people. His campaign, he said, was forced to close the gates on many more people who were trying to enter the Queens park just across the river from Manhattan. “To put it bluntly, I am back,” Sanders declared, sparking chants of, “Bernie is back” from the massive crowd. “I am happy to report to you that I am more than ready — more ready than ever — to carry on with you on the epic struggle that we face today,” he added. “I am more than ready to assume the office of president of the United States.” The event marked Sanders’ formal return to the campaign trail less than three weeks after he suffered a heart attack that threatened both his life and political future. Even before that, he was in danger of falling out of the top-tier in the 2020 Democratic primary field. Polls suggest he’s lagging behind liberal rival Elizabeth Warren and establishment favorite Joe Biden. But the fiery Brooklyn native, backed by a slate of new endorsements and two new stents in an artery connected to his heart, appeared to be expanding his coalition on Saturday. A security company hired by the campaign reported a crowd estimate of 25,000. Among those speaking, filmmaker and activist Michael Moore told the cheering crowd that he was endorsing Sanders, shortly before Rep. Alexandria Ocasio-Cortez, D-N.Y., praised the Vermont senator on stage. “Bernie Sanders fought for me,” Ocasio-Cortez said as she introduced Sanders. She heaped praise on the Vermont senator but did not explicitly say that she was endorsing him. The Sanders campaign announced earlier in the week that she had. Before the rally, Sanders campaign manager Faiz Shakir said endorsements this past week from Ocasio-Cortez and Rep. Ilhan Omar, D-Minn., in particular were proof that the Sanders campaign is growing. He predicted that they would especially help Sanders strengthen his support among young, minority voters. “Those are two people who I think have immense power to mobilize young people, and I promise you you’ll be seeing them in Iowa, but not only in Iowa, but around the country, trying to get people engaged around the issues,” Shakir said. For now, at least, Sanders can use the help. While he insists he’s ready to move forward, he’s doing so cautiously. Saturday’s rally was his only scheduled appearance before he returns to Iowa late in the coming week. The week after, he’ll join Rep. Rashida Tlaib, D-Mich., for a tour of her congressional district. Tlaib hasn’t announced whether she’ll endorse Sanders, but she is part of the same small “squad” of minority women on Capitol Hill who gave been a target of President Donald Trump. Despite the aggressive rhetoric from Sanders himself, senior adviser Jeff Weaver said Sanders would ease himself back onto the campaign trail. But by December, he predicted, Sanders health scare will be forgotten. Almost all the speakers during Saturday’s event, which spanned several hours on a sunny, crisp fall afternoon, played down the health concerns. “The only heart attack we should be talking about is the one Wall Street is going to have when Bernie Sanders is president,” said Moore, the filmmaker. Nina Turner, one of Sanders’ national co-chairs, said it “boggles my mind” that Sanders’ critics have embraced “ageism.” “Life happens to us all,” she said. “Memo to the haters: hashtag Bernie Is Back,” she added. “We never went anywhere, we just pushed pause for a minute.”",
      "date": "10/19/2019 04:45 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Far_Left",
        "target_name": "Alexandria_ocasio-cortez"
      }
    }
  ]
}