{
  "articles": [
    {
      "title": "After Taking Presidential Corruption To New Heights, Trump Calls Everyone Else Corrupt",
      "url": "https://search.huffpost.com/click/_ylt=Awr9CKkdo6td5VIAGsdsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558301/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2ftrump-corruption-projection_n_5da8bae5e4b034f1d69f56ac/RK=2/RS=D3C2iXyBJZlgxtzQuguSDyWrVzQ-",
      "subtitle": "Trump has called Democratic leaders, the news media, former President Barack Obama and the entire 2016 election “corrupt.”",
      "author": "S.V. Date",
      "content": " WASHINGTON — Look up “corrupt” in the dictionary and you could expect to find an illustration of Donald Trump looking right back ― yet that has not kept the president from repeatedly calling others corrupt in recent weeks. Trump has given his daughter and son-in-law prominent White House jobs, steers lobbyists and political groups seeking his favor toward using his Pennsylvania Avenue hotel, and even successfully pushed the U.S. government to host the next G-7 meeting at his own golf resort, which will put tens of millions of American tax dollars into his own cash registers next June. “He has no shame,” said Joe Walsh, a former Illinois congressman who is running against Trump for the 2020 Republican nomination. “He’s incapable of shame. That’s not normal.” Indeed, such actions, had they been taken by a mayor, a county executive or a governor, would in all likelihood result in state or federal public corruption charges. While laws and rules vary by state and locality, ethics laws generally prohibit public officials from profiting from their offices. Giving oneself a large government contract ― as Trump’s White House announced Thursday with the selection of his troubled Doral, Florida, golf course as the site of the next summit of the world’s largest democratic economies ― would almost certainly result in a criminal prosecution, ethics experts said. “This is a president who believes the powers of the presidency are bestowed on him to advance his own personal interests, political and profit-seeking, rather than those of the American people,” said Robert Weissman, president of the liberal watchdog group Public Citizen. But as the sitting president, Trump is immune from both ethics laws and criminal prosecution, and not only has he openly engaged in nepotism and self-dealing, he has, in recent weeks, started accusing political opponents and the news media of “corruption.” At an Oct. 2 news conference, for example, he called former Vice President Joe Biden and his son Hunter “stone, cold corrupt.” At an Oct. 11 rally in Lake Charles, Louisiana, he broadened that to all Democrats: “The radical Democrats’ policies are crazy. Their politicians are corrupt.” In an Oct. 14 statement he posted on Twitter, Trump called The New York Times corrupt. Just two days later, during a photo opportunity with the visiting president of Italy, he called his predecessor Barack Obama corrupt, as well as the entire 2016 election. Others Trump has labeled “corrupt” in recent weeks: former FBI director James Comey, former FBI agent Peter Strzok, former FBI lawyer Lisa Page, the entire Mueller investigation into the help Russia gave Trump in winning the 2016 election, all of the news media, California Democratic congressman Adam Schiff and CNN. To Trump critics, the president’s attacks are part of a predictable pattern: Accuse others of the inappropriate behavior that he himself engages in. Bandy Lee, among a group of mental health professionals who have been warning of Trump’s state of mind for years, said Trump is exhibiting typical behavior for a “paranoid, delusional” leader. “He accuses others exactly of what he is responsible for,” said Lee, a Yale Medical School professor of psychiatry. “It is a psychological defense called ‘projection.’” Josh Schwerin, a former spokesman for 2016 Democratic presidential nominee Hillary Clinton, recalled Trump’s response when Clinton accused Trump of behaving like Russian dictator Vladimir Putin’s puppet. “No puppet. No puppet. You’re the puppet,” Trump replied at the third and final presidential debate. “He accuses other people of doing the bad things he’s doing,” Schwerin said. “He is the most corrupt president in modern times,” said Jennifer Horn, a former chair of the New Hampshire Republican Party. “He has to convince his followers that everyone is corrupt so they will ignore his corruption.” The White House did not respond to HuffPost queries regarding Trump’s self-dealing and nepotism. One top Republican National Committee member, though, said he is not bothered by any of Trump’s behavior, and instead attacked the news media for not reporting sufficiently on the Clinton Foundation, Hunter Biden or the money former Obama has made since leaving office. “A few dollars on his hotels, which are actually a legitimate business, I’m not going to lose much sleep over,” said Shawn Steel, a longtime RNC member from California, urging more scrutiny of Hunter Biden, who served on the board of a Ukrainian gas company. Damaging Joe Biden’s 2020 candidacy was a key objective of Trump’s newfound interest in rooting out “corruption” in Ukraine, according to a top Trump adviser who spoke on condition of anonymity. Trump believes Biden would be his strongest opponent and has sought to pressure the Ukrainian government to investigate a conspiracy theory that Ukrainian officials seeking to help Hillary Clinton win the 2016 election planted false evidence to make it appear that Russia had helped Trump. According to that conspiracy theory, which also manages to tie in the Bidens and Hungarian billionaire George Soros and the framing of former Trump campaign chairman Paul Manafort, the hacked Democratic National Committee server and Clinton’s 33,000 deleted emails have been hidden away somewhere in Ukraine. Trump’s former homeland security adviser, Tom Bossert, has called the claim “completely debunked” and warned that Trump’s obsession with it would be the “white whale” that could bring him down. Indeed, it was Trump’s request of Ukraine’s president in a July 25 phone call to investigate both the Bidens and the 2016 election conspiracy that sparked a whistleblower complaint against Trump, which in turn led to the ongoing impeachment inquiry. White House chief of staff Mick Mulvaney admitted Thursday that those considerations played into Trump’s policy toward Ukraine. “Get over it: There’s going to be political influence in foreign policy,” he said. Kendal Unruh, a former GOP activist from Colorado who led the unsuccessful effort to dump Trump at the 2016 party convention, said it was distressing to see Republicans tolerating the president’s actions. “The Republican Party has become completely corrupted to the core in their habitual defense of Trump’s behavior,” she said. “It’s sad to watch the death of a party that once actually stood for morality and the rule of law.” Yet Yale psychiatrist Lee said increasing pressure on Trump with the threat of impeachment will create a far greater danger to the country than the mere diminishment of a political party. “His emotional drive to project all his own corruption and ineptitude onto others will overwhelm any ability on the part of others to correct or redirect his lies,” she said. “This drive will become more severe with greater pressure and, paradoxically, the sicker he is, the more effective his pathology will be in overcoming any resistance, starting with himself.”",
      "date": "10/17/2019 04:42 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Ex-Ethics Chiefs Rip Donald Trump’s Decision To Host G-7 At His Own Resort",
      "url": "https://search.huffpost.com/click/_ylt=Awr9CKkdo6td5VIAGMdsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558301/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fethics-donald-trump-doral-richard-painter-walter-shaub_n_5da95c2ae4b0e0f037897645/RK=2/RS=LGSvJBVpvb7mlQgYwohflmUJeJc-",
      "subtitle": "Walter Shaub and Richard Painter blasted the plans, calling them “unacceptable” and “the most overt corruption to date.”",
      "author": "Lee Moran",
      "content": " Two former government ethics experts have strongly condemned President Donald Trump’s decision to host the 2020 G-7 summit of world leaders at his own golf resort in Miami. Richard Painter, the former chief ethics attorney for President George W. Bush, described Thursday’s announcement by acting White House chief of staff Mick Mulvaney as “unacceptable.” Walter Shaub, the former head of the U.S. Office of Government Ethics, called it “the most overt corruption to date.” “This is not only self-dealing, this is a violation of the emoluments clause of the Constitution, which specifically provides that a person holding a position of trust with the U.S. government cannot accept any profits or benefits from foreign governments,” Painter told CNN’s Don Lemon on Thursday night. “We have had him violating the emoluments clause since day one and now he’s going out and openly asking foreign governments to subsidize his resorts in connection with the G-7,” Painter continued. “He’s got his hand out to foreign governments and if this Congress puts up with that, they are to blame as well.” Check out the clip here: Shaub, who served under President Barack Obama and resigned from his position six months into the Trump administration, vented his anger on Twitter via multiple posts. “How any Senator could fail to object to this is beyond me,” Shaub wrote in one tweet. “There’s no universe in which anyone could believe that, in a country as big as ours, the selection of Trump’s resort was anything but a product of the worst kind of corruption.” “This is so overtly corrupt that it can’t be viewed as anything but a loyalty test for Senators,” Shaub said in another. “If they are corrupt enough to look the other way, Trump will know he can do anything. In that case, he will do everything.” Shaub also said it was “a red line crossed” and that “we have reached the bottom.” “If the Senate will not act to stop this, there is no government ethics program,” he posted. “It’s over.” Read Shaub’s tweets in full below:",
      "date": "10/18/2019 03:32 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "April Ryan Abruptly Drops Out Of Fundraiser Interview With Pete Buttigieg",
      "url": "https://search.huffpost.com/click/_ylt=Awr9CKkdo6td5VIAFsdsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558301/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fapril-ryan-pete-buttigieg-campaign-event_n_5daa013be4b0f34e3a7540a6/RK=2/RS=UZtqVJLlTugcWhCPtjUpFWuYcN4-",
      "subtitle": "The CNN political analyst and Washington bureau chief for American Urban Radio Networks said she didn’t realize it was a fundraiser.",
      "author": "Amy Russo",
      "content": " Journalist April Ryan has abruptly pulled out of a political event on Saturday in which she was slated to interview South Bend, Indiana, Mayor Pete Buttigieg, claiming she was unaware it was a fundraiser for his Democratic presidential campaign. On Friday, the American Urban Radio Networks Washington bureau chief and CNN political analyst announced her decision in a tweet, saying “the campaign was not clear that the venue would be a fundraiser.” “We’ll be rescheduling the interview to a more appropriate time/place,” she added. “Looking forward to asking him the tough questions the AURN audience wants answers to.” The Washington, D.C., event’s webpage, where tickets have been sold, explicitly calls it “a grassroots fundraiser.” Ticket prices range from $15 for students to $500 for “investors.” The site also states that the funds are considered campaign contributions. Neither Ryan nor Buttigieg’s campaign immediately responded to HuffPost’s requests for comment. Last month, Buttigieg invited Ryan to attend a Congressional Black Caucus dinner as his guest. On Instagram, the reporter shared photos with Buttigieg and fellow candidate Sen. Elizabeth Warren (D-Mass.), noting that Barack Obama had invited her to the event during his own presidential campaign. In July, Ryan moderated the NAACP’s 110th annual convention in Detroit, where she interviewed both Buttigieg and Warren in addition to several other candidates including former Vice President Joe Biden and Sen. Bernie Sanders (I-Vt.).",
      "date": "10/18/2019 05:15 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Ex-Ethics Chief: If Trump Resort Hosting G-7 ‘Is Not Corrupt, Nothing Is’",
      "url": "https://search.huffpost.com/click/_ylt=Awr9CKkdo6td5VIAFMdsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558301/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fwalter-shaub-donald-trump-g-7-resort-summit_n_5daacde7e4b0422422c53885/RK=2/RS=aWqK.T0fVvcXoh_IDmkeFxKXOrY-",
      "subtitle": "“And that’s exactly what he wants,” said Walter Shaub, the former head of the U.S. Office of Government Ethics.",
      "author": "Lee Moran",
      "content": " Walter Shaub, the former head of the U.S. Office of Government Ethics, has doubled down on his scathing criticism of the selection of President Donald Trump’s Miami golf resort to host next year’s G-7 summit. On Friday’s broadcast of MSNBC’s “Hardball,” Shaub said acting White House Chief of Staff Mick Mulvaney’s dismissal of fears that Trump could personally profit from the event were “a ridiculous thing” to say. Trump has been accused of violating the Constitution’s emoluments clause, which prohibits federal officeholders from accepting gifts or profits from foreign states, with the decision. “Essentially, it boils down to this, the president in the United States participated in a contract awarded to his own business,” said Shaub, who served under former President Barack Obama and the first six months of Trump’s administration until he resigned. “This is the figurative equivalent of he reaches into the treasury, grabs a chunk of money and says ‘don’t worry, I’m not taking more than I’m spending,’” Shaub continued. “That’s no defense at all and certainly, if it had been Mick Mulvaney who owned this property, he’d be prosecuted and convicted of a felony and wouldn’t be able to say ‘don’t worry, I broke even.’” Shaub later summed up the “the bottom line.” “There is no definition of corruption that would not cover the president participating in a contract awarded to himself. So, if this is not corrupt, nothing is corrupt,” he said. “And that’s exactly what he wants and it seems to be exactly what the United States Senate is determined to have be the case.” Shaub on Thursday claimed the decision to host the event at the resort was “so overtly corrupt that it can’t be viewed as anything but a loyalty test for Senators.” “If they are corrupt enough to look the other way, Trump will know he can do anything. In that case, he will do everything,” he added. Check out the interview above.",
      "date": "10/19/2019 05:46 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Trump Biographer Has A Theory About POTUS’ Obama Netflix Deal Obsession",
      "url": "https://search.huffpost.com/click/_ylt=Awr9CKkdo6td5VIAEsdsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558301/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2ftrump-biographer-obsession-obama_n_5d808be3e4b00d69059dff4c/RK=2/RS=DlW1qUS8.TTbhBchqXP2UoY7Dwg-",
      "subtitle": "“Obama was a very profound man. Trump is a very profane man. These are polar opposites,” said Michael D’Antonio.",
      "author": "Lee Moran",
      "content": " A biographer of Donald Trump on Monday suggested why the president really attacked former President Barack Obama’s Netflix deal. “Obama may win an Emmy, and Trump has been resentful about Emmys,” Michael D’Antonio, who wrote the book “The Truth About Trump,” told CNN’s Don Lemon. Netflix’s “American Factory” — the first documentary released by Barack Obama and former first lady Michelle Obama’s production company — has been hotly tipped for awards success. Trump, however, has often groused about never winning an Emmy for the reality business show “The Apprentice.” D’Antonio’s quip came during a discussion about Trump’s obsession with his predecessor. The author had earlier noted that “Obama was a very profound man. Trump is a very profane man. These are polar opposites.” “One man denigrates women,” D’Antonio continued. “The other marries the woman he loves and stays married to her and continues to love her. The difference between these people is more than black and white. It’s everything. It’s the essence of their humanity, and Trump knows that people see it.”",
      "date": "09/17/2019 03:57 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Let’s Hear It For The Gadflies",
      "url": "https://search.huffpost.com/click/_ylt=Awr9CKkdo6td5VIAEMdsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558301/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fgadfly-candidates-democratic-debate_n_5d4260e5e4b0ca604e2cad6a/RK=2/RS=kRpIkk513fAFXzrA0dvTuF7lEJQ-",
      "subtitle": "Bill de Blasio, Tulsi Gabbard and Michael Bennet aren’t going to be president. But they each shined for a moment in Wednesday’s Democratic primary debate.",
      "author": "Zach Carter",
      "content": " The early Democratic Party 2020 debates have often demanded a very specific torture of the viewer. With 20 candidates allowed to participate, serious contenders don’t get enough time to detail their differences, while vanity candidates with pathetic polling and no real reason for running waste everyone’s time. It’s tedious. But on Wednesday night, three candidates with no chance of becoming president nevertheless did their country a service, presenting detailed and accurate critiques of the Democrats who do have a real chance of being elected. Though it pains me to say it, the gadflies brought their A-game. Early in the night, New York Mayor Bill de Blasio hit former Vice President Joe Biden over former President Barack Obama’s immigration record. Democrats don’t like to harp on it, but in his first four years in office, Obama deported more people per year than any other president in history. Immigration activists protested Obama for most of his presidency, and former Rep. Luis Gutierrez (D-Ill.) called him “the deporter in chief” on the House floor. Obama even separated children from their parents at the border, though not in the systemic manner that President Donald Trump has. So de Blasio asked Biden a simple question. “Did you say those deportations were a good idea or did you go to the president and say this is a mistake, we shouldn’t do it. Which one?” Biden didn’t really have an answer. Awkwardly, he said he would keep his conversations with Obama on immigration private. Bill de Blasio is probably never going to make it to double-digits in national polling. On Wednesday night protesters interrupted the debate to rip him for failing to take action against Daniel Pantaleo, the police officer who killed Eric Garner. But de Blasio’s confrontation with Biden nevertheless gave Sen. Cory Booker (D-N.J.) an opening to drive home an important point about the Obama administration. “You can’t have it both ways,” Booker told Biden. “You invoke President Obama more than anyone else in this campaign. You can’t do it when it’s convenient and then duck it when it’s not.” Because Obama remains the most popular figure in the Democratic Party, most 2020 contenders have been reluctant to criticize his administration’s flaws ― even on issues where the Democratic Party needs to learn from Obama’s shortcomings. But therein lies the benefit of gadflies, whose only real shot at staying in the race is generating some buzz by going toe-to-toe with the front-runners. The results weren’t cheap shots but substantive critiques. Later in the evening, Rep. Tulsi Gabbard of Hawaii went after the criminal justice record that Sen. Kamala Harris accrued first as a prosecutor in San Francisco and then as California’s attorney general. “I’m deeply concerned about this record,” Gabbard said. “There are too many examples to cite, but she put over 1,500 people in jail for marijuana violations and then laughed about it when asked if she ever smoked marijuana. She blocked evidence that would have freed an innocent man from death row until the courts forced her to do so, she kept people in prison beyond their sentences to use as cheap labor for the state of California and she fought to keep cash bail in place.” Gabbard, to be clear, is a terrible candidate. She’s been an apologist for Syrian butcher Bashar Assad and has troubling ties to Hindu nationalists, and she has spent a lot of time on Fox News ranting about Islam. But her criticisms of Harris were on point and have been documented in detail by journalists and criminal justice reform advocates. During her career in California, Harris was a tough-on-crime prosecutor and has sought to rebrand herself as a progressive prosecutor since coming to Washington. “As the elected attorney general of California,” Harris said Wednesday, “I did the work of significantly reforming the criminal justice system of a state of 40 million people, which became a national model for the work that needs to be done.” Other gadflies made an impact without directly attacking a candidate by just saying something true, very loudly. Sen. Michael Bennet (Colo.) has struggled to stand out in every debate and wasted a lot of his stage time Wednesday issuing cheap Republican talking points about “Medicare for All.” But even Bennet had a standout moment, pointing out that American schools have re-segregated over recent decades and, in many cases, simply never really integrated. Most children attend schools that are either very white or very non-white, and the non-white schools generally don’t get nearly as much funding as the white schools do. “This is the fourth debate that we have had and the second time that we have been debating what people did 50 years ago with busing when our schools are as segregated as they were 50 years ago,” Bennet said. “We need a conversation about what’s happening now, and when there’s a group of kids in this country that don’t get preschool through no fault of their own and another group does, equal is not equal.” Like deportation and criminal justice, school segregation is an uncomfortable subject for Democrats because many of the party’s leading figures built their careers in the party by feeding the problem. Booker, for instance, used to advocate for the school voucher agenda of current Education Secretary Betsy DeVos. For a long time, vouchers were a favorite policy tool conservatives used to help rich white students attend all-white or nearly-all-white private schools. The Democratic Party is in a period of transition. Many of the policies that the party supported under Presidents Bill Clinton and Barack Obama are being jettisoned, and new ideas are gaining traction. The gadflies aren’t going to be the leaders who chart the party’s future. But if they can bring its past into the light, maybe they deserve a spot on the stage.",
      "date": "08/01/2019 12:18 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Obama Remembers Former Supreme Court Justice John Paul Stevens",
      "url": "https://search.huffpost.com/click/_ylt=Awr9CKkdo6td5VIADsdsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558301/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fobama-remembers-justice-john-paul-stevens_n_5d2e7189e4b085eda5a37e8b/RK=2/RS=hx_3NttSz14dU2K8KD9LkOmzefs-",
      "subtitle": "Stevens, the third-longest-serving justice, retired during President Barack Obama’s first term.",
      "author": "Carla Herreria",
      "content": " President Barack Obama on Wednesday mourned the death of former Supreme Court Justice John Paul Stevens, who died the day before at age 99. Stevens retired from the high court in 2010 after serving on the bench for almost 35 years. He was the third-longest-serving justice of the Supreme Court. He died in a hospital in Fort Lauderdale, Florida, after a stroke. “I couldn’t have known Justice John Paul Stevens for all of his 99 years, but I’m lucky enough to have known him for some of them,” Obama, who was president when Stevens retired, said in a statement. “He was a good man, a decent man. And our country is better because of his leadership and his example.” “For more than 34 years on the bench at the Supreme Court, Justice Stevens heard cases with a level of grace, humility, and fidelity to our highest ideals that we should hope all our public servants strive for,” Obama said. “His balancing of legal precedent with the Constitution’s call for equal justice and an understanding of Americans’ daily lives helped the court — and the country — navigate controversial and defining questions of who we are and who we can be. And in doing so with his signature pragmatism and modesty, he played a pivotal role in carrying forward our founding promise into today.” Republican President Gerald Ford nominated Stevens, also a Republican, to the Supreme Court in 1975. Although he told The New York Times Magazine in 2007 that he thought of himself as “pretty darn conservative,” Stevens is often considered a liberal champion of the court. The justice wrote majority opinions on a wide range of issues, including abortion rights, capital punishment, school prayer and campaign-finance reform. Stevens led the high court’s efforts to uphold legal protections for Guantanamo Bay prisoners after President George W. Bush’s administration argued after the 9/11 attacks that prisoners there were not entitled to access to U.S. courts because they were not U.S. citizens and were being held on American soil. In retirement, Stevens remained an outspoken critic of the U.S. policy of detaining enemy combatants in Guantanamo without charges. In May 2012, Obama awarded Stevens a Presidential Medal of Freedom, the nation’s highest civilian honor, for his decadeslong career upholding the Constitution and the laws of the United States. “Known for his independent, pragmatic and rigorous approach to judging, Justice Stevens and his work have left a lasting imprint on the law in areas such as civil rights, the First Amendment, the death penalty, administrative law, and the separation of powers,” the White House said at the time. Marina Fang contributed to this report.",
      "date": "07/17/2019 10:07 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Viola Davis To Play Michelle Obama In Showtime Series ‘First Ladies’",
      "url": "https://search.huffpost.com/click/_ylt=Awr9CKkdo6td5VIADMdsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558301/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fviola-davis-michelle-obama-showtime_n_5d64fedfe4b008b1fd20bc66/RK=2/RS=YmJ_1og42qXQw59cGqXmN5.Z2Jw-",
      "subtitle": "The anthology features episodes about the powerful women who occupied the White House.",
      "author": "Ron Dicker",
      "content": " A deal is in place for Oscar-winning actor Viola Davis to play Michelle Obama, according to reports. The “How To Get Away With Murder” star is set to make her portrayal in Showtime’s dramatized “First Ladies” anthology series, Deadline reported Monday. Showtime retweeted the article. The project has a three-script commitment, with the first season highlighting Eleanor Roosevelt, Betty Ford and Obama, the entertainment outlet noted. Davis is also executive producing, The Hollywood Reporter wrote. Variety characterized the project as “in development.” Davis, a three-time Oscar nominee who won Best Supporting Actress for “Fences,” will appear on her sixth and final season of the TV series “How To Get Away With Murder” in the fall. A previous portrayal of Michelle Obama featured Tika Sumpter as the future first lady to Parker Sawyer’s future President Barack Obama in a fictionalized movie account of their courtship, “Southside With You” (2016). ",
      "date": "08/27/2019 08:01 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Joe Biden Refuses To Say Whether He Agreed With Obama’s Deportations",
      "url": "https://search.huffpost.com/click/_ylt=Awr9CKkdo6td5VIACsdsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558301/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fcory-booker-joe-biden-deportation-debate_n_5d42446ee4b0aca3411843fa/RK=2/RS=C030vUD4dkU4.meUsup_XlDcqPQ-",
      "subtitle": "Cory Booker shot back: “You invoke President Obama more than anybody in this campaign. You can’t do it when it’s convenient and then dodge it when it’s not.”",
      "author": "Elise Foley",
      "content": " In one of the hottest moments of the Democratic primary debate on Wednesday, Sen. Cory Booker (D-N.J.) turned to face former Vice President Joe Biden and said, “Mr. Vice President, you can’t have it both ways.” Booker was referring to Biden’s (and President Barack Obama’s) record on immigration: During their two terms, a record number of immigrants were deported, earning Obama the title of “deporter-in-chief” from some immigrants’ rights advocates. “You invoke President Obama more than anybody in this campaign,” Booker said during the CNN-hosted debate. “You can’t do it when it’s convenient and then dodge it when it’s not.” For his part, Biden defended Obama, while refusing to say whether he’d done anything to stop deportations. New York Mayor Bill de Blasio (D) repeatedly pressed him on the matter but never got an answer. “Did you say those deportations were a good idea?” de Blasio asked. “Or did you go to the president and say, ‘This is a mistake. We shouldn’t do it.’ Which one?” Biden both distanced himself from Obama’s record and refused to answer the question. “I was vice president. I was not the president,” Biden said. “I keep my recommendation to him private.” Biden noted repeatedly that Obama enacted pro-immigrant policies — like legal protections for young undocumented immigrants who came to the U.S. as children — and made a major push for comprehensive immigration reform. That reform push ultimately failed because congressional GOP leaders refused to take it up, in spite of the years of high deportation figures that were intended, in part, to convince Republicans that Democrats weren’t soft on unauthorized immigration. Obama later shifted his policies and his deportation figures dropped. Now, with President Donald Trump in office, Democrats are unified in support of comprehensive immigration reform and in opposition to the current president’s policies, including separating children from parents. But the particulars of the immigration policy debate have shifted. So far this cycle, one of the main issues at hand has been whether to repeal the law that makes it a criminal offense to cross the border without authorization. Decriminalizing that type of migration would mean that immigrants could still face deportation or civil penalties for crossing ― but they couldn’t be criminally prosecuted, which is how the Trump administration was able to split up immigrant families last year. Much like during Tuesday evening’s debate, the candidates were divided into two camps regarding immigration: those who insisted that nothing needs to be done beyond removing Trump and those who wanted to repeal the law. Biden opposes decriminalizing migration, and said that Trump is the reason the law is being abused. He also pointed out that opponent Julián Castro, the top booster of decriminalization, served in the Obama administration too, as secretary of the Department of Housing and Urban Development. “Mr. Vice President, it looks like one of us has learned from the lessons of the past,” Castro responded, “and one of us hasn’t.”",
      "date": "07/31/2019 10:17 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Brit Ambassador Charged That Trump Killed Iran Deal Because It Was Obama’s: Report",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DtY0o6tdceIA241sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558324/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fkim-darroch-trump-diplomatic-vandalism-barack-obama_n_5d2aabafe4b02a5a5d5c0e05/RK=2/RS=miwKu.eJas8R1Mt0pPXMIaLpnag-",
      "subtitle": "Sir Kim Darroch called Trump’s actions “diplomatic vandalism,” according to new cables obtained by the Daily Mail.",
      "author": "Mary Papenfuss",
      "content": " Britain’s now former ambassador to the U.S. was convinced last year that President Donald Trump scrapped the Iran nuclear pact in part simply because it was forged by his White House predecessor, Barack Obama, according to another leaked diplomatic memo. Sir Kim Darroch declared that Trump’s actions amounted to “diplomatic vandalism,” the Daily Mail reported on Saturday, quoting the cable. The newspaper obtained an earlier set of leaked cables from Darroch blasting Trump as a man who “radiates insecurity” and his administration as “dysfunctional” and “inept.” The leaks resulted in a vicious attack on Darroch by Trump and the envoy’s resignation on Wednesday. In the latest leaked cables to his government, Darroch said the Trump administration was “set upon an act of diplomatic vandalism, seemingly for ideological and personality reasons — it was Obama’s deal,” the newspaper reported, referring to the Iranian pact. “Moreover, they can’t articulate any ‘day-after’ strategy; and contacts with State Department this morning suggest no sort of plan for reaching out to partners and allies, whether in Europe or the region,” Darroch wrote, according to the Mail. Darroch also referred to disagreements within the administration, with Secretary of State Mike Pompeo distancing himself from Trump’s decision. Pompeo, Vice President Mike Pence and National Security Adviser John Bolton were unable to “articulate why the president was determined to withdraw, beyond his campaign promises,” Darroch reportedly wrote. He said in a second cable that Trump signed a memo to withdraw from the pact “following a typically hyperbolic statement on the nature of the ‘murderous’ Iranian regime,” according to the newspaper. Darroch wrote the memos in May of last year after a failed trip to the U.S. by then-British foreign secretary Boris Johnson, who attempted to talk Trump into sticking with the nuclear agreement. The latest bombshell erupted just as reports emerged that investigators had identified a suspect who they believed leaked the cables to the Mail. Both Johnson and Jeremy Hunt — Tory rivals in a bid to become Britain’s next prime minister — criticized a Scotland Yard official for warning journalists that they could face prison for publishing government documents. Hunt said he would “defend to the hilt the right of the press to publish those leaks if they receive them and judge them to be in the public interest,” The Guardian reported. Johnson said that prosecuting journalists in such a situation “would amount to an infringement on press freedom.” There was no immediate word about the new cable revelations from the White House.",
      "date": "07/14/2019 02:34 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Cory Booker Says He ‘Wouldn’t Be Running’ If Obama Ran For Third Term",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DtY0o6tdceIA2Y1sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558324/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fcory-booker-president-obama_n_5d430597e4b0aca3411a44cf/RK=2/RS=QvQnnvfUFvu4FvmJ9Y641GmGUQc-",
      "subtitle": "“I miss Obama... He is our statesman,” said the senator on CNN’s “New Day” on Thursday.",
      "author": "Jenna Amatulli",
      "content": " Sen. Cory Booker (D-N.J) says he wouldn’t be running for president if former President Barack Obama could run for a third term in the White House. On Thursday, Booker appeared on CNN’s “New Day” to talk about the second Democratic debate that took place on Wednesday. Host John Berman addressed the several mentions of Obama during the debate and told Booker that he heard critiques that Obama was too far right. In response, Booker said that he missed Obama and that while he wasn’t “perfect,” he “would take him back. Heck, if [Obama] was running for president for a third term, I wouldn’t be running.” The presidential hopeful went on to say that Trump “is a guy that my Republican colleagues can’t even criticize when he’s preaching racism.” Booker later added: “The reality is we have a situation right now where the president is doing things to this country that are perverting our very values and ideals, and talking about what our plans would be, different than the previous president; different than the current president, is not a bad thing.” On Wednesday, Booker went head to head with former Vice President Joe Biden over several issues, getting particularly heated on criminal justice. “If you want to compare records ― and frankly, I’m shocked that you do ― I am happy to do that,” said Booker at one point. Ahead of the debate, Booker called Biden’s new criminal justice proposal “an inadequate solution to what is a raging crisis in our country.” In response, Biden’s team said “the absurdity of this attack” was “obvious.” Booker went on the offensive with Biden on the issue, calling out the 76-year-old’s past positions. “Since the 1970s, every crime bill, major and minor, has had his name on it,” said Booker. “And those are your words, not mine. And this is one of those instances where the house was set on fire and you claimed responsibility for those laws. And you can’t just now come out with a plan to put out that fire.” When Biden responded, he defended himself by saying what he believes about the issue now and called out Booker for not doing enough to reform Newark, New Jersey, when he was mayor. Booker pushed back hard, saying: “There’s a saying in my community that you’re dipping into the Kool-Aid, and you don’t even know the flavor. You are trying to shift the view from what you created.” “There are people right now in prison for life, for drug offenses because you stood up and used that tough-on-crime phony rhetoric that got a lot of people elected but destroyed communities like mine. This isn’t about the past. This is about the present right now,” he said.",
      "date": "08/01/2019 12:41 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Barack Obama’s Life-Size Statue Featuring Sasha Unveiled In South Dakota",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DtY0o6tdceIA141sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558324/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fbarack-obama-statue-sasha-rapid-city_n_5d2defd3e4b085eda5a27742/RK=2/RS=DK4XpGmyIox8Y_suKHyyzJgJQs0-",
      "subtitle": "The former president joins past U.S. presidents who were commemorated with sculptures along the streets and sidewalks of Rapid City.",
      "author": "Kimberley Richards",
      "content": " A bronze statue portraying former President Barack Obama has been erected in South Dakota’s “City of Presidents” with a notable addition: his 18-year-old daughter, Sasha Obama. The statue, which was unveiled at the Elks Theatre in Rapid City on Saturday, depicts the former president waving one hand while holding hands with his younger daughter, who is also waving her other hand. The design was inspired by a photo of the former president with Sasha Obama at his first inauguration, the Rapid City Journal reported. Barack Obama joins other past U.S. presidents who were memorialized in the downtown area as part of the City of Presidents project that was launched in 2000 under the Rapid City Historic District Tour. The project aims to “honor the legacy of the American presidency” with sculptures positioned along the city’s streets and sidewalks, its website states. Painter and sculptor James Van Nuys, who created the Barack Obama statue, told the Journal he was happy the board chose the design with Barack Obama and Sasha Obama. Dallerie Davis, the project’s co-founder, said the group previously considered depicting Barack Obama waving by himself, before deciding on the final design. “One of us said, ‘This is boring. This is not going to have the wow factor,’” Davis told CNN. “A man waving is not a showstopper.” All of the sculptures are privately funded, the project’s website states. The Barack Obama sculpture has been designated to sit at the corner of Saint Joseph and 4th Streets in Rapid City, according to the project’s website. Van Nuys told the crowd at the unveiling ceremony on Saturday that he felt a connection to the inauguration image of Barack Obama and Sasha Obama as a father himself, according to a live taping by the South Dakota Public Broadcasting radio station. He shared that his daughter was his best friend when she was growing up, so seeing Barack Obama as a “dad with his daughter” held a special meaning for him.",
      "date": "07/16/2019 03:02 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "How Immigration Prosecutions Helped ICE Pad Obama’s Criminal Deportee Statistics",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DtY0o6tdceIA1Y1sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558324/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fice-obama-criminal-deportation-statistics_n_5d52b1aee4b05fa9df04c9e5/RK=2/RS=beZiJRGpAj71.7xi6X7lnrGurPI-",
      "subtitle": "Under Obama, Immigration and Customs Enforcement highlighted stats that those arrested at the border were criminals. Most had broken only immigration laws.",
      "author": "Roque Planas",
      "content": " Throughout Barack Obama’s presidency, he justified the record number of deportations carried out by Immigration and Customs Enforcement by pointing to the high number of criminals deported. “We’re going to keep focusing enforcement resources on actual threats to our security,” Obama said in a 2014 speech announcing executive action to shield parents of U.S. citizens from deportation. “Felons, not families. Criminals, not children. Gang members, not a mom who’s working hard to provide for her kids.” By Obama’s last year in office, publicly released data showed that 58% of deportees had a criminal conviction. More than 99% of deportees met one of the agency’s removal priorities. But data obtained this month by HuffPost through a Freedom of Information Act request reveals the most serious crime committed by more than half of the migrants arrested at the border and tagged as criminal deportees during Obama’s second term was entering the country without authorization. In other words, the difference between those slapped with a criminal immigration offense and those with a clean record was that the Justice Department chose to prosecute them simply for crossing the border. Immigration violations were the most serious crimes committed by tens of thousands of others deported from within the United States and classified as priority removals over that period, despite the fact that their records differed little from non-criminals. Some 2020 Democratic candidates, including Julián Castro and Elizabeth Warren, are pledging to repeal the laws that make this possible. The data underscores the degree to which skyrocketing prosecutions for border-crossing violations over the last decade helped criminalize a vast swath of the deportee population, giving the impression that they posed a greater public security threat than their records indicate. “They’ve been turning mere immigration law violators into criminal aliens for years in order to inflate the amount of individuals that have been removed under criminal grounds,” immigration attorney Matthew Kolken told HuffPost. “These were freshly minted criminals. They weren’t committing crimes in the United States.” While convicts made up nearly half of those deported from the border region from 2013 to 2016, the data makes it clear that there weren’t hordes of violent criminals. Traffic violations accounted for the second-highest number of criminal convictions for border deportees, making up 11% to 14% for those years. The data provided by ICE included only broad categories of crime, but previous reporting indicates that driving while intoxicated and driving without a license make up the vast majority of traffic violations on deportees’ records. Only 15% of border deportees under Obama’s second term had a conviction more serious than an immigration or traffic offense. A much smaller percentage committed more serious crimes. Far less than 1% of criminal migrants from the border and interior combined were convicted of a crime involving homicide, for example. Agency statistics include some deaths resulting from negligence or car crashes under that heading. “I’m seeing padding of the number of the people they consider to be criminals with a lot of low-level traffic violations and immigration violations,” said Douglas Massey, a Princeton sociology professor and co-founder of the Mexico Migration Project, after reviewing the data. “The criminal categories are vastly inflated. The violent crimes are really small in number.” Under Obama, ICE produced end-of-year reports that highlighted the number of criminals the agency deported, trumpeting the high percentage of convicted criminals. Those reports divided deportees removed from the interior from those expelled from the border region largely because the agency considered those arrested while trying to cross into the country a deportation priority regardless of whether they had criminal records. But the agency did not release detailed statistics over the Obama presidency detailing what convictions had marred individual migrants’ records. Instead, ICE used a system of priority categories for those deported from the interior and recorded only whether border deportees had a criminal conviction or not. The sharp rise in prosecutions for border violations that began under George W. Bush’s presidency explains the statistical sleight of hand. In the United States, deportation is handled under civil laws by immigration authorities such as the Border Patrol and ICE. But crossing the border without authorization is also a federal crime, punishable by up to six months in prison. Re-offenders can face felony charges. The law criminalizing illegal entry, authored in 1929 by segregationist Sen. Coleman Blease of South Carolina and now known as Section 1325, made up a tiny fraction of federal prosecutions by the 1990s. Instead, Border Patrol agents routinely walked unauthorized migrants back to the other side of the border or referred them for deportation proceedings in immigration court. But starting in 2005, the departments of Justice and Homeland Security teamed up to create Operation Streamline, a program to prosecute migrants en masse for jumping the border, in an effort to route Central American migrants into federal jails and create a new deterrent. By 2008, immigration prosecutions had swallowed up half the federal criminal docket ― a statistical trend that held true through Obama’s presidency. President Donald Trump ramped up the system further by enacting a “zero tolerance” policy, mandating all five federal districts that touch the border to focus still more resources on immigration prosecutions. Last year, Trump used the laws criminalizing illegal entry and reentry to carry out his widely reviled experiment with systematic family separations at the border last year. By prosecuting migrant parents traveling with their children, Trump officials channeled them into federal jails, leaving their children in the custody of immigration agencies. Immigrant rights groups and criminal justice reformers have long argued that the laws needlessly criminalize migrants, drive the expansion of privatized prisons and slap a redundant punishment on people who will have to face deportation proceedings regardless of whether they get prosecuted for illegal entry. But advocates have also long suspected that the skyrocketing illegal entry prosecutions helped both the Obama and Trump administrations pad their stats to make the deportee population appear like more of a threat than it actually is. “They’re creating this illusion that so many people removed have criminal histories, but they’re manufacturing this criminal history by prosecuting them for illegal entry and illegal reentry,” said Zenén Jaimes Pérez, advocacy and communications director for the Texas Civil Rights Project. “We know that picture starts to fall apart once you start digging into it.” The broad criminal categories identified in the documents released by ICE make it difficult to know with any certainty what convictions had led the agency to classify deportees expelled from inside the country as criminals. It identifies only broad headings like “dangerous drugs,” “homicide” and “traffic tickets.” Those categories encompass crimes ranging from marijuana possession and driving without a license to drunk driving, drug trafficking and capital murder. But there’s no doubt about what the “immigration” heading means. Over those four years, illegal entry and reentry accounted for 95% of the most serious criminal convictions for deportees under the “immigration” heading from 2013 to 2016, according to data previously released to HuffPost. The stats did not distinguish between interior and border removals. The most serious criminal conviction for 21,000 of the migrants deported from within the United States during Obama’s second term was an immigration violation ― about 6.5% of all interior removals. Those convicted of illegal reentry, a felony, would have been classified as a level one priority throughout the period ― the same categorization applied to terrorists and murderers. Thousands of other deportees removed from inside the country during that period had no criminal convictions at all ― ranging from 17.5% in 2013 to 7.6% in Obama’s last year. The number of interior deportees whose most serious offense was an immigration crime dwindled over time. That trend mirrored a drop in deportations from within the country as a whole over Obama’s second term in office as his administration used both prosecutorial discretion and executive action to shield more migrants from deportation. The trend accelerated after the collapse of comprehensive immigration reform talks in the summer of 2014. Former ICE officials defended the agency’s statistical work, contending that they did not intend to mislead the public. They pointed to the series of memos beginning in 2011 that aimed at prioritizing serious criminals, which account for the steady decrease in deportations from inside the country overall. And they insisted that Obama’s policy of focusing on criminal convicts made more efficient use of limited deportation resources than Trump’s policy of casting priorities aside. But the former officials also noted that pushing those priorities down the chain of command took time. And the administration’s focus on deporting people who had been removed in the past meant that people with immigration crimes would show up in agency deportation stats. “We never felt that the number of criminal removals was padded,” said Peter Vincent, who headed ICE’s legal branch during the Obama administration. “We were particularly sensitive to any skewing of any statistics that would suggest or imply that the number of criminal removals were higher than in actuality.” The agency struggled with certain crimes that fell into a gray area, like driving under the influence. That traffic offense often remained a priority offense because it could result in death, though prosecutors might use discretion in some cases. But though Vincent remains a vocal supporter of Obama’s prosecutorial discretion policies, he acknowledged that the word “criminal” implied something more serious than immigration violations ― often the same ones committed by deportees with clean criminal records. “We did target recent illegal entrants as a way to dissuade individuals from attempting to cross the border,” Vincent said. “That is different from simply categorizing everyone who crosses the border without authorization as a criminal. ‘Criminal’ has a different meaning and should be used to refer to someone who is a danger to our community or who has been convicted of a serious offense.” John Sandweg, who headed ICE as an acting director under Obama, defended the use of criminal prosecutions at the border, saying that internal reports showed it worked as a more effective deterrent than civil deportation proceedings. But both in the interior of the country and along the border, the agency prioritized deporting people who had been expelled before, whether or not they had been convicted of a crime. The fact that so many people deported from the border had criminal convictions in the United States, whether they were serious or not, showed how many had spent time here in the past. “The fact that they had been previously convicted for Streamline is interesting ― it’s a fair data point to be thinking of,” Sandweg said. “But the fact is that they were not deported because they were convicted of a silly 1325. It’s because they were arrested at the border.” Others viewed a clear continuity between the way ICE categorized criminals in agency statistics under Obama and the way Trump vilifies unauthorized migrants by branding them as menacing lawbreakers. Kolken, the immigration lawyer, routinely defends migrants facing prosecution for illegal reentry and the prospect of deportation at his practice in Buffalo, New York, about 1,800 miles from the U.S.-Mexico border. To secure a conviction, all the prosecutor needs to do is present evidence that the defendant was deported in the past. In those cases, immigration authorities often reinstate an old order of removal while the criminal immigration charge plays out, Kolken said. Were it not for the illegal reentry charge, he would have an opportunity to try to cancel the old order and win his client a hearing. But when the old removal order gets reinstated, his client loses the opportunity to go before an immigration judge. The vast majority of his clients have no convictions on their records aside from the illegal reentry. The scenario has played out repeatedly over the years, regardless of administration. “There is very little difference between Trump calling these people ‘bad hombres’ and Obama calling these people ‘felons, not families,’” Kolken said. “Both were attempting to dehumanize this population. Obama was allowed to get away with it. Thankfully, Trump can’t.”",
      "date": "08/15/2019 01:11 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "One Of Trump’s First Actions Reversed An Obama Rule On Guns And Mental Impairment",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DtY0o6tdceIA041sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558324/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2ftrump-obama-gun-rule_n_5d4b05dfe4b0066eb70b7a7d/RK=2/RS=sD5TM.cTrY7QP9JOljXLfbvPOtg-",
      "subtitle": "Now the president wants to know what he can do through executive action.",
      "author": "Arthur Delaney",
      "content": " President Donald Trump is weighing his options for executive action on gun control following a pair of mass shootings that killed more than 30 people, according to the White House. Trump’s predecessor, Barack Obama, actually did take executive action on gun control not long after a gunman slaughtered 26 children and teachers at Sandy Hook Elementary School in Newtown, Connecticut, in late 2012. And one of Trump’s first actions as president was to undo an Obama regulation that would have blocked some people with mental impairments from buying guns. The rule, which became effective just two days before Trump took office, required the Social Security Administration (SSA) to inform the FBI’s criminal background check system about disabled adults receiving benefits through a representative because a mental impairment limited their ability to manage finances. The Department of Veterans Affairs has long followed a similar policy, which accounts for the bulk of mental incompetency referrals to the background check system from federal agencies, according to the Congressional Research Service. Most of the 4.6 million records prohibiting gun sales due to mental incompetency in the database as of 2016 came from state and local authorities. The SSA finalized the rule at the end of 2016, a year in which Obama touted several gun control reforms he’d undertaken without help from Congress. “The gun lobby may be holding Congress hostage, but they can’t hold America hostage,” Obama said on Twitter that year. “We can’t accept this carnage in our communities.” Because Obama pursued the policy involving the SSA through regulation, however, Congress had an easy time overturning it once Trump assumed the White House. Thanks to a special legislative tool called the Congressional Review Act, Republicans undid more than a dozen regulations that had been finalized late in Obama’s second term. Gun control advocates such as the Brady Campaign to Prevent Gun Violence applauded the mental incapacity rule, but its critics included civil liberty and disability advocates. The rule would have restricted firearms sales for roughly 80,000 people, though the restrictions could be appealed. “The thousands of Americans whose disability benefits are managed by someone else range from young people with depression and financial inexperience to older adults with Down syndrome needing help with a limited budget,” the American Civil Liberties Union said in a February 2017 statement. “But no data ― none ― show that these individuals have a propensity for violence in general or gun violence in particular.” Research shows that most mass shooters don’t have severe mental health problems. The man arrested in the killing of 22 people in El Paso on Saturday allegedly wrote that he was doing it to fight an “invasion” of immigrants, echoing the president’s racist rhetoric. Trump said Wednesday that background checks and mental health policies, rather than restrictions on types of firearms, are his main focus. He told reporters that he’s hoping Republicans and Democrats in Congress can agree on gun control legislation focused on those topics. Administration officials have said they’re also looking at addressing the matters through executive action, though they haven’t specified what they have in mind. Last year, the Trump administration used its executive authority to ban bump stocks that allow semi-automatic rifles to fire as rapidly as illegal machine guns. Bump stocks helped a gunman massacre 58 people in Las Vegas in 2017. White House spokespeople did not reply to a request for comment on whether the president would favor bringing back the restriction on firearms for mentally impaired Social Security recipients. One complication looms for such a move ― federal agencies are not supposed to be able to reissue regulations struck down by the Congressional Review Act. But the Trump administration has already shown it doesn’t care about that restriction. One of the Obama rules Republicans nixed in 2017 had to do with drug testing the jobless; the Trump administration brought it back last year in a tougher form.",
      "date": "08/07/2019 02:19 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Obama Announces New Push In Fight Against Gerrymandering",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DtY0o6tdceIA0Y1sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558324/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fobama-gerrymandering-training_n_5d655e7ae4b01fcc690aa2cc/RK=2/RS=DgwOlASjr1o9Hln8IyDyM6sokBM-",
      "subtitle": "A new program will train people in the basics of redistricting and why it matters to their everyday lives.",
      "author": "Sam Levine",
      "content": " A group backed by President Barack Obama will send experts to train people across the country on the ins-and-outs of redistricting as part an effort to fight excessive partisan gerrymandering. The new effort, called Redistricting U, comes as states are gearing up for the next round of redistricting, which will take place in 2021. The program will launch with trainings in dozens of cities across 10 states this fall aimed at teaching people the basics of the redistricting process. Organizers also want to connect gerrymandering to “pocketbook issues” and hope people will leave the trainings motivated to get involved in the redistricting process in their states, said Saumya Narechania, director of advocacy and campaign manager of All On The Line, the part of the National Democratic Redistricting Committee (NDRC) that will lead the effort. “The movement for fair maps will determine the course of progress on every issue we care about for the next decade. And we can’t wait to begin organizing when the redistricting process starts in 2021. We need to build this movement from the ground up — right now,” Obama said in a statement. Obama has been involved in efforts to limit excessive partisan gerrymandering since leaving office. Last year he folded his political group, Organizing for Action, into the NDRC, a redistricting-focused group led by Eric Holder, who served as attorney general for most of Obama’s presidency. The redistricting process, which takes just once per decade, is expected to be a brutal brawl for partisan advantage. The United States Supreme Court ruled in June that there were no constitutional limits on how severely states could manipulate district lines to benefit political parties. For decades, redistricting in many places has been done behind closed doors, with lawmakers quietly negotiating deals to get the districts they want. Emails from lawmakers made public in litigation in Wisconsin, Michigan and Ohio, among other places, have shed light on just how unsavory those negotiations are. In Michigan, for example, a Republican staffer wrote happily about cramming “Dem garbage” into four districts. Advocates have long struggled to get the public interested in redistricting, seen as a wonky, boring and complicated issue. But Obama and NDRC’s decision to focus on the issue is a signal in itself of how the issue has exploded in recent years. In 2011, Republicans recognized the potential to use the redistricting process to lock in their political advantage for a decade and successfully executed a targeted campaign to do just that. The National Republican Redistricting Trust (NRRT), a GOP group focused on redistricting led by former Wisconsin Gov. Scott Walker, mocked the new effort in a tweet. The group recently sued to block a new independent panel in Michigan from drawing district lines. The NDRC has dismissed the GOP-led criticism, noting that it has championed proposals with bipartisan support. “I’m not really that focused on what the NRRT is saying about us or our program,” Narechania said. “We are hyperfocused on building a fair process and making sure that we are concentrating on places where redistricting reform gives power back to the people, not to politicians, not to the folks who are camped out in lobbyist offices who are drawing the lines in secret.” “The whole point of All On The Line is to take this process and make it as transparent as possible. And if transparency is something that folks are afraid of, then I think the question is why is that?” he said.",
      "date": "08/27/2019 01:29 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Obama Calls For Gun Control, Condemns Racist Language After Mass Shootings",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DtY0o6tdceIAz41sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558324/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fobama-mass-shootings-el-paso_n_5d488292e4b0acb57fd11cd1/RK=2/RS=JCKejYiWdgW5wYlc.QlynBIVFDo-",
      "subtitle": "“We should soundly reject language coming out of the mouths of any of our leaders that feeds a climate of fear and hatred,” the former president said.",
      "author": "Julian Shen-Berro",
      "content": " Former President Barack Obama called for stronger gun control legislation and spoke out against the “climate of fear and hatred” that has been fueled by some of the country’s leaders. He put out a statement Monday, after mass shootings in El Paso, Texas, and Dayton, Ohio, claimed at least 31 lives and injured dozens more over the weekend. During his presidency, Obama spoke after more than a dozen mass shootings, and memorably wept as he gave a speech in the aftermath of the massacre at Sandy Hook Elementary School. “No other developed nation tolerates the levels of gun violence that we do,” he said Monday. “Every time this happens, we’re told that tougher gun laws won’t stop all murders. … But the evidence shows that they can stop some killings.” In El Paso, the shooter reportedly penned an anti-immigrant manifesto and was motivated by racist, white supremacist ideology. In his statement, Obama called for both law enforcement and internet platforms to increase efforts to reduce the influence of hate groups in radicalizing troubled individuals. He called on the country to “send a clarion call and behave with the values of tolerance and diversity that should be the hallmark of our democracy.” Though he did not name anyone in particular, much of what Obama condemned was speech used by his presidential successor, Donald Trump. “We should soundly reject language coming out of the mouths of any of our leaders that feeds a climate of fear and hatred or normalizes racist sentiments,” the former president wrote. Trump has faced heavy criticism for his own role in promoting the anti-immigrant rhetoric that the El Paso shooter espoused. In a statement Monday, Trump condemned white supremacy and racism, but did not acknowledge how his own comments had fueled such beliefs. “Such language isn’t new — it’s been at the root of most human tragedy throughout history,” Obama wrote. “It has no place in our politics and our public life. And it’s time for the overwhelming majority of Americans of goodwill, of every race and faith and political party, to say as much — clearly and unequivocally.” Read the full statement below:",
      "date": "08/05/2019 04:35 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Michelle And Barack Obama Share Touching Birthday Tributes To Her Mom",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DtY0o6tdceIAzY1sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558324/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fmichelle-obama-barack-birthday-tribute-mom_n_5d40133ae4b0db8affae0c0b/RK=2/RS=Yfqa__M0uvhMH61H7qiWMLWOPlk-",
      "subtitle": "The former first lady and president posted sweet messages for Marian Robinson on Instagram.",
      "author": "Lee Moran",
      "content": " Barack Obama joined his wife Michelle Obama in publicly wishing her mother Marian Robinson a happy birthday. The former president and first lady both used Instagram to pay sweet tribute to Robinson, who turns 82 on Tuesday. Michelle Obama shared this undated throwback snap of her mom: “Whenever I see this picture, and the look in my mother’s eyes, I wonder if she has any idea what’s coming in the decades ahead,” the former first lady captioned the image. “Real love and real loss, children and grandchildren who’d keep her on her toes, a wild ride to places she’d only read about or seen on television.” Michelle Obama wrote that she also saw “something else in those eyes, something that guided me every day from the moment I was born—her unflappable belief that whatever came her way, she’d manage it.” Barack Obama, meanwhile, noted in a separate post that people had “probably seen” his mother-in-law in photos of the family attending official events like the White House Easter Egg Rolls and Christmas tree lightings. “But what you haven’t seen is the way she’s been there for us every day ― not just for Michelle and our daughters, but for me, too,” he wrote. “I’ve always appreciated her steadiness, her perspective, and the way a wisecrack from her reverberates around the room.” “Happy birthday, Marian ― here’s to many more,” he added.",
      "date": "07/30/2019 07:21 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Debate Backlash: Many Democrats Say Criticizing Obama’s Legacy Isn’t A Good Idea",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DtY0o6tdceIAy41sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558324/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fbiden-obama-2020_n_5d4326a6e4b0ca604e2edddd/RK=2/RS=QRe3FyQ5dDfzWlMcTiANgi7vboM-",
      "subtitle": "“He did an extraordinary job, and he should be given that recognition by those” running for president, Sen. Dick Durbin said.",
      "author": "Igor Bobic",
      "content": " Following a contentious debate among Democratic White House contenders Wednesday, a number of party leaders aren’t thrilled that some of the candidates focused on attacking former President Barack Obama’s legacy as a way to challenge Joe Biden. In one of the debate’s hottest exchanges, Sen. Cory Booker of New Jersey called out the former vice president ― the frontrunner in the Democratic nomination race ― for repeatedly using Obama’s name to shield himself from criticism directed his way on issues like criminal justice and immigration. “Mr. vice president, you can’t have it both ways,” Booker said, referring to Biden’s ― and Obama’s ― record on immigration, which saw a record number of undocumented immigrants deported during their eight-year administration. “You invoke President Obama more than anybody in this campaign. You can’t do it when it’s convenient and then dodge it when it’s not.” Biden defended himself by noting Obama’s decision to select him as his running mate, saying, “Barack Obama knew exactly who I was.” Also taking Biden to task on the deportation figures was Julián Castro ― a particularly striking moment, since the Texan served in Obama’s administration as secretary of housing and urban development. Biden spotlighted that, responding to Castro, “The secretary, we sat together in many meetings. I never heard him talk about any of this when he was the secretary. Castro retorted: “It looks like one of us has learned from the lessons of the past and one of us hasn’t.” Polls show Obama remains a popular figure among all voters, with approval ratings easily outstripping those for President Donald Trump. And among Democrats, Obama remains by far the most admired politician. Booker, in comments to CNN on Thursday, insisted it wasn’t a negative to reconsider part of the record of the Obama administration as part of the process of choosing the next Democratic presidential nominee. Democrats are “having an honest conversation about an administration that was incredible,” Booker said. “And I’m sure (if) Barack Obama was sitting here ... He will tell you, ‘I made some mistakes.’” But several of Booker’s Democratic Senate colleagues expressed concern about the tactic, arguing it would needlessly expose divisions in the party and take the focus off of Trump and his administration. “I think attacking President Obama is bad policy and bad politics,” Sen. Richard Blumenthal of Connecticut said Thursday. Of Biden’s tenure as vice president, Blumenthal added: “He owns it, for better or worse. But he should be proud of it.” Sen. Dick Durbin of Illinois also suggested the Democratic race should be marked by a more hands-off approach toward Obama. “You can disagree with him, and I have, but the bottom line is ... he did an extraordinary job, and he should be given that recognition by those that are running for the presidency.” Others who watched the debate expressed similar sentiments, including longtime Washington-based political analyst Stuart Rothenberg: Senate Minority Leader Chuck Schumer of New York urged his party’s White House contenders to train their sights firmly on Trump. “I think President Obama is a very popular figure in America to this day because he did a very good job. Did he accomplish everything? No,” Schumer told reporters on Thursday, “You compare the Obama administration to this administration ― it’s night and day.” Veteran Republican political consultant John Weaver ― a fierce Trump critic ―was blunter:",
      "date": "08/01/2019 03:39 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Michelle Obama Shares School Photo, Asks For Help In Giving ‘Girls A Chance To Learn’",
      "url": "https://search.huffpost.com/click/_ylt=Awr9GjBOo6tdDDYA3GlsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558350/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fmichelle-obama-day-of-charity-back-to-school-photo_n_5d711b8fe4b09bbc9efac072/RK=2/RS=vkf_2F8AQCdvUN0vyOxA5H5FvJw-",
      "subtitle": "“The future of our world is only as bright as our girls,” wrote the former FLOTUS in an Instagram post honoring International Day of Charity.",
      "author": "Jenna Amatulli",
      "content": " Former first lady Michelle Obama shared on Instagram an adorable photograph of herself from her school days in an effort to raise awareness of the “more than 98 million adolescent girls around the world” who are not in school. “It’s so easy for us to take our education for granted, especially here in the United States,” Obama wrote in the photo caption, adding: “I believe every girl on the planet deserves the same kind of opportunities that I’ve had—a chance to fulfill her potential and pursue her dreams. We know that when we give girls a chance to learn, they’ll seize it.” In light of International Day of Charity on Thursday, the 55-year-old stressed in her caption that when girls have the opportunity to learn, “our whole world benefits.” “Girls who go to school have healthier children, higher salaries, lower poverty rates, and they can even help boost their entire nation’s economy,” she wrote. In addition to asking others to share their own back-to-school photos, she implored followers to join the Girls Opportunity Alliance to “take action for global girls’ education.” The program, which is run by Obama and former president Barack Obama’s Obama Foundation, has a goal of empowering “adolescent girls around the world through education, allowing them to achieve their full potential and transform their families, communities, and countries,” according to its website. Obama ended her post with this hopeful message: “The future of our world is only as bright as our girls.” Hear, hear, Michelle.",
      "date": "09/05/2019 11:33 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Joe Biden Defends Obama’s Immigration Record But Admits He’s Learned From Experience",
      "url": "https://search.huffpost.com/click/_ylt=Awr9GjBOo6tdDDYA2mlsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558350/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fvice-president-joe-biden-defends-barack-obama-immigration-policy-deportations-afscme-forum-2020-democratic-primary_n_5d45d508e4b0ca604e32e7c4/RK=2/RS=r7wNnU6DNBl29M98mPLPX7f0eVw-",
      "subtitle": "The administration figured out that congressional Republicans were not using a “more rational approach” on immigration, the former vice president recalled.",
      "author": "Daniel Marans",
      "content": " Former Vice President Joe Biden defended former President Barack Obama’s immigration record on Saturday, even as he conceded that they both learned from the failure of their tough approach early on in which they tried to win over Republican lawmakers. Biden was one of 19 Democratic presidential candidates to speak at a candidate forum hosted by the public-sector labor union AFSCME in Las Vegas on Saturday. Jon Ralston of The Nevada Independent, who moderated the discussion alongside HuffPost’s Amanda Terkel, asked Biden to elaborate on how he feels about the Obama administration’s record volume of deportations of undocumented immigrants in its first term. “We learned a lot in the process,” Biden said. “When the president got elected, everything landed on his desk but locusts. We were about to go into a depression.” He went on to imply that the Obama administration employed a tough approach to border enforcement and unauthorized immigration partly in the misplaced hope that it would lay the groundwork for a bipartisan immigration reform bill. “We thought at the beginning we might be able to get a more rational approach to the way we dealt with, for example, immigration,” Biden said. “By the middle of the term, it was clear that wasn’t going to happen and things changed.” The changes the administration implemented included executive orders aimed at protecting undocumented immigrants who arrived as children ― those known as Dreamers ― and their parents, the former vice president noted. Ralston pressed Biden to reveal any details about how he might have advocated against the deportations behind closed doors during Obama’s first term. But Biden reiterated what he said during the presidential debate on Wednesday night ― that he does not reveal his discussions with Obama behind closed doors. “The focus was on deporting felons,” Biden said, adding, “Comparing what he did to what Trump did is just absolutely off the wall ― it’s just not true.” (No Democratic candidate has actually compared Obama’s policies to those of President Donald Trump.) In a subsequent exchange with Terkel, Biden confirmed that he does not support changing unauthorized border crossing from a crime to a civil penalty. Doing so “will be an invitation” for more undocumented immigrants to take their chances by just showing up at the border, he argued. “One of the things we’re trying to do is keep parents in difficult circumstances from giving their children to a coyote” to transport them to the border. Since the candidate forum was hosted by AFSCME, which is celebrating the passage of a Nevada law granting state workers collective bargaining rights, much of Saturday’s discussion focused on the priorities of union workers. Terkel asked Biden how he responded to criticism of the Obama administration for not pushing harder to pass the Employee Free Choice Act. The bill would have made it easier for workers to unionize by ratifying their majority through card check and thereby avoiding employer intimidation. “We pressed and pressed,” Biden said. “The fact of the matter is, there were other things happening as well.” He went on to attribute it to the Republican takeover of the House in the 2010 midterm elections, even though most of the criticism faults the Obama administration for failing to pass it in its first two years in power, when Democrats controlled both branches of government. “We did not have a Democratic Congress to be able to get it done,” he said. “But I would.”",
      "date": "08/03/2019 03:16 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Biden Poses What-If Of Obama Assassination To Explain How 1968 Jolted America",
      "url": "https://search.huffpost.com/click/_ylt=Awr9GjBOo6tdDDYA2GlsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558350/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fjoe-biden-obama-assassinated-comment_n_5d607748e4b0b59d2574a604/RK=2/RS=oC_qVIlLt3aD4gbE.BgMDLo6Agw-",
      "subtitle": "The former vice president told students at a presidential campaign event how the deaths of Bobby Kennedy and Martin Luther King Jr. led to his political awakening.",
      "author": "Antonia Blumberg",
      "content": " Former Vice President Joe Biden at a campaign event on Friday compared the political and social unrest of the late 1960s to the current political climate, asking audience members to imagine what might have happened if President Barack Obama had been assassinated. “Imagine what would have happened if, God forbid, Barack Obama had been assassinated after becoming the de facto nominee. What would have happened in America?” the Democratic presidential candidate said, according to The New York Times. Biden, 76, appeared to be engaging in a rhetorical exercise aimed at impressing upon younger voters the impact of the back-to-back assassinations of Robert F. Kennedy and Martin Luther King Jr. in 1968. Friday’s event took place on the campus of Dartmouth College in Hanover, New Hampshire. Several dozen high school and college students were in the audience, according to the Times. He also attempted a stale compliment to the women in the room, suggesting they wouldn’t want to admit their age by recalling events from the late ’60s. Biden, the current front-runner for the Democratic presidential nomination, said: I think of where we are at the moment. You know, none of you men are old enough, uh, women are old enough, but a couple of you guys are old enough to remember. I graduated in 1968. Everybody before me was: Drop out, go to Haight-Ashbury, don’t trust anybody over 30, everybody not get involved. I’m serious. I know no woman will shake their head and acknowledge it, but you guys know what I’m talking about. Right? But then what happened? Dr. Ki— I only have two political heroes. I have one hero who was my dad, but I have two political heroes were Martin Luther King and Bobby Kennedy. My senior semester, they were both shot and killed. Imagine what would have happened if, God forbid, Barack Obama had been assassinated after becoming the de facto nominee. What would have happened in America? The comments came days after Biden, during a speech in Iowa, mistakenly said Kennedy and King were killed in the 1970s. On Friday, the former vice president said those assassinations sparked his own political awakening in his 20s. “Unless I’m mistaken, Donald Trump did for your generation what the loss of two of my heroes did for mine,” he said to the students in the audience. “What they did was make you realize, my God, we’re in trouble.”",
      "date": "08/23/2019 09:50 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Chris Evans Nails What Fox News Would Do If Obama Called Himself The ‘Chosen One’",
      "url": "https://search.huffpost.com/click/_ylt=Awr9GjBOo6tdDDYA1mlsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558350/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fchris-evans-fox-news-chosen-one_n_5d5e1350e4b02cc97c8839e5/RK=2/RS=0JS2Blc4zwJLVbU0wLkq90pakHE-",
      "subtitle": "The Captain America actor uses a classic film image to describe the network’s hypocrisy.",
      "author": "Ed Mazza",
      "content": " “Avengers” actor Chris Evans says faces would’ve melted at Fox News if former President Barack Obama had ever called himself the “chosen one,” as President Donald Trump did on Wednesday. Trump made the comments while discussing his trade war with China. He looked to the sky and declared himself “the chosen one” on the issue. Evans, who played Captain America in the Marvel films, called to mind a famous scene from “Raiders of the Lost Ark” to describe how Fox News would’ve handled Obama making the same comments: Trump’s “chosen one” claim came on the same day he shared comments on Twitter from someone who hailed him as the “King of Israel.” Fox News has built up a history of hypocrisy when it comes to how it treats Trump versus how it treated Obama. The network excoriated Obama for saying he’d try to have a dialogue with enemy states, but has lavished praise on Trump for cozying up to dictators, such as North Korea’s Kim Jong Un. The network also slammed Obama for playing golf, but has been largely silent on Trump, who has golfed at more than two and a half times the rate of his predecessor, racking up an enormous tab for taxpayers.",
      "date": "08/22/2019 01:31 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Trump Again Blames Obama For Russia’s Illegal Annexation Of Crimea",
      "url": "https://search.huffpost.com/click/_ylt=Awr9GjBOo6tdDDYA1GlsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558350/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2ftrump-obama-russia-crimea_n_5d640110e4b058f037f4d8a6/RK=2/RS=z4i_A2rUIXhxTPXjN9DjiGIWiik-",
      "subtitle": "President Trump insisted that Vladimir Putin was ousted from the G-8 “because of Obama,” ignoring that Russia violated international law.",
      "author": "Nina Golgowski",
      "content": " President Donald Trump is repeating his claim that Russia was booted from the G-8 group of major industrial nations because former President Barack Obama was “outsmarted” by Russia when it illegally annexed Crimea in 2014. At a press conference in France on Monday, Trump said: “President Obama was pure and simply outsmarted. They took Crimea during his term. That was not a good thing. It could have been stopped, with the right, whatever, it could have been stopped.” He added that he’d “most certainly” invite Russian President Vladimir Putin to the group’s next summit. Trump did not describe how he thought Obama should have prevented the annexation of Crimea, but said that if it had happened under his watch, he would have admitted that he had made a mistake and apologized. Of course, Trump is known for being defiantly unapologetic. He’s also known to have a penchant for insulting the intelligence of Black people and women. Prior to his trip to France, Trump also said Obama “wanted Russia out” of the G-8 because Putin “outsmarted him,” suggesting the decision was solely motivated by ego. In reality, a majority of G-8 member countries — not just the United States — decided to suspend Russia from the group in 2014 because it had violated international law barring the acquisition of another country’s territory through coercion or force. “To do so violates the principles upon which the international system is built. We condemn the illegal referendum held in Crimea in violation of Ukraine’s constitution,” Canada, France, Germany, Italy, Japan, Britain and the U.S. said in a 2014 statement. “We also strongly condemn Russia’s illegal attempt to annex Crimea in contravention of international law and specific international obligations.” At the time, Russian Foreign Minister Sergey Lavrov dismissed Russia’s departure from the G-8 as no big deal. French President Emmanuel Macron, who is hosting this year’s summit, has expressed support for Russia’s readmission to the multinational group, but only if it helps resolve the ongoing conflict in Ukraine. Trump said Monday that he wasn’t sure whether Putin would accept an invitation to return to the group, suggesting the Russian leader also had a bruised ego. “He’s a proud person. Would I invite him, I would certainly invite him. Whether or not he could come, psychologically, I think that’s a tough thing for him to do,” he said. “You have a G-8, now it’s a G-7, and you invite the person that was thrown out really by President Obama, and really because he got outsmarted.”",
      "date": "08/26/2019 02:26 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Former President Barack Obama Remembers Toni Morrison",
      "url": "https://search.huffpost.com/click/_ylt=Awr9GjBOo6tdDDYA0mlsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558350/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fbarack-obama-toni-morrison_n_5d4992c3e4b01ae816c8fac8/RK=2/RS=CZ2aoP2qJ8l4lxONrbIQRqhKtC8-",
      "subtitle": "Obama awarded the trailblazing author of “Beloved,” “Song of Solomon” and “The Bluest Eye” with the Presidential Medal of Freedom in 2012.",
      "author": "Marina Fang",
      "content": " Former President Barack Obama commemorated the life and legacy of author Toni Morrison, who died Monday night at the age of 88, honoring “her masterful will” and her “fusion of the African American story within the American story.” “Toni Morrison was a national treasure. Her writing was not just beautiful but meaningful — a challenge to our conscience and a call to greater empathy,” he said in a statement. Time is no match for Toni Morrison. In her writing, she sometimes toyed with it, warping and creasing it, bending it to her masterful will. In her life’s story, too, she treated time nontraditionally. A child of the Great Migration who’d lifted up new, more diverse voices in American literature as an editor, Toni didn’t publish her first novel until she was 39 years old. From there followed an ascendant career—a Pulitzer, a Nobel, and so much more—and with it, a fusion of the African American story within the American story. Toni Morrison was a national treasure. Her writing was not just beautiful but meaningful—a challenge to our conscience and a call to greater empathy. She was as good a storyteller, as captivating, in person as she was on the page. And so even as Michelle and I mourn her loss and send our warmest sympathies to her family and friends, we know that her stories—that our stories—will always be with us, and with those who come after, and on and on, for all time. As president, Obama awarded the trailblazing author the Presidential Medal of Freedom in 2012, honoring her career in centering the lives and histories of African Americans. “As a single mother working at a publishing company by day, she would carve out a little time in the evening to write, often with her two sons pulling on her hair and tugging at her earrings. Once, a baby spit up on her tablet so she wrote around it. Circumstances may not have been ideal, but the words that came out were magical,” Obama said at the ceremony. “Toni Morrison’s prose brings us that kind of moral and emotional intensity that few writers ever attempt.  From ‘Song of Solomon’ to ‘Beloved,’ Toni reaches us deeply, using a tone that is lyrical, precise, distinct, and inclusive,” he continued. “She believes that language ‘arcs toward the place where meaning might lie.’ The rest of us are lucky to be following along for the ride.” “I remember reading ‘Song of Solomon’ when I was a kid and not just trying to figure out how to write, but also how to be and how to think,” he added later, referring to her 1977 novel. Obama also cited Morrison while reflecting on his favorite books during an interview with then-New York Times book critic Michiko Kakutani, shortly before he left office in 2017. “I think Toni Morrison’s writings — particularly ‘Song of Solomon’ is a book I think of when I imagine people going through hardship,” he said. “That it’s not just pain, but there’s joy and glory and mystery.” Former first lady Michelle Obama has also mentioned the book as a source of inspiration. In 2018, she told The New York Times that she has read the novel three times. “I rarely have time to reread books, but ‘Song of Solomon,’ every time I pick it up, I’m pulled into that story,” she told Today show host Jenna Bush Hager earlier this year. Morrison, best known for the Pulitzer Prize-winning novel “Beloved,” died Monday night in New York City of unspecified causes, her publisher, Knopf, said Tuesday. In 1993, she became the first Black woman to be awarded the Nobel Prize for Literature. In a rare step for her, Morrison endorsed Obama in 2008, writing in a letter that she chose the then-Illinois senator over his primary opponent, Hillary Clinton, for his “creative imagination,” calling him “the man for this time.” In thinking carefully about the strengths of the candidates, I stunned myself when I came to the following conclusion: that in addition to keen intelligence, integrity and a rare authenticity, you exhibit something that has nothing to do with age, experience, race or gender and something I don’t see in other candidates. That something is a creative imagination which coupled with brilliance equals wisdom. It is too bad if we associate it only with gray hair and old age. Or if we call searing vision naïveté. Or if we believe cunning is insight. Or if we settle for finessing cures tailored for each ravaged tree in the forest while ignoring the poisonous landscape that feeds and surrounds it. Wisdom is a gift; you can’t train for it, inherit it, learn it in a class, or earn it in the workplace–that access can foster the acquisition of knowledge, but not wisdom. In 2012, she told The Guardian that attending Obama’s first inauguration in 2009 was “the first time she felt truly American.” “I felt very powerfully patriotic when I went to the inauguration of Barack Obama. I felt like a kid. The marines and the flag, which I never look at — all of a sudden it looked … nice. Worthy,” Morrison said. “It only lasted a couple of hours. But I was amazed, that music that I really don’t like — God Bless America is a dumb song; I mean it’s not beautiful. But I really felt that, for that little moment.”",
      "date": "08/06/2019 11:52 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Julián Castro On Immigration Spar With Joe Biden: ‘This Is Not About Obama’",
      "url": "https://search.huffpost.com/click/_ylt=Awr9GjBOo6tdDDYA0GlsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558350/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fjulian-castro-immigration-joe-biden-ascme_n_5d45add6e4b0aca3411e87dd/RK=2/RS=hp0D592bIeTWMOHEue4izsfO2x0-",
      "subtitle": "The former Obama housing chief clarified his stance on the ex-president’s immigration policy after clashing with Joe Biden over Obama-era deportations.",
      "author": "Carla Herreria",
      "content": " Fresh off his debate tangle with former Vice President Joe Biden over the Obama administration’s deportation policies, Democratic presidential hopeful Julián Castro clarified that he was not specifically challenging President Barack Obama. “This is not about criticizing President Obama,” Castro said during the AFSCME’s forum on public service co-moderated by HuffPost in Las Vegas on Saturday. “This is about, ‘OK, what does the next administration have to do in the face of a President Trump that is absolutely terrible.’” Asked by moderator Jon Ralston what the candidate meant when he suggested Biden hadn’t learned from “the lessons of the past,” Castro suggested that the Obama administration made improvements on immigration reform but didn’t go far enough. “There’s no comparison between Obama and Trump,” said Castro, who served as the Housing and Urban Development secretary in the final years of the Obama administration. Castro has proposed to decriminalize illegal border crossings, making it a civil violation and preventing future administrations from separating families at the border. “President Obama was trying and that administration made adjustments and improved on immigration,” the Democrat said. “However, Trump has weaponized a certain section of the law to inflict cruelty on migrant children and their parents, so there are lessons we can learn from this.” After his time was up, Castro told reporters backstage that he feels the news media was playing into the Biden campaign’s hands by framing his criticism of the vice president as an attack on the Obama administration. The Democratic primary debate on Wednesday heated up when several candidates, including Castro, piled on Biden over the record number of deportations made under the Obama administration. Biden suggested that Castro’s plan to decriminalize border crossings was unnecessary, to which Castro replied: “It looks like one of us has learned from the lessons of the past and one of us hasn’t.”",
      "date": "08/03/2019 01:32 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "The Top Books On Barack Obama’s 2019 Summer Reading List",
      "url": "https://search.huffpost.com/click/_ylt=Awr9GjBOo6tdDDYAzmlsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558350/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fbarack-obama-summer-reading-list_n_5d5460a6e4b083855066f57f/RK=2/RS=5NF5I7.MTIpQQhl0O0j.I1IapG0-",
      "subtitle": "The former president said on Facebook that “you can’t go wrong by reading or re-reading the collected works of Toni Morrison.”",
      "author": "David Moye",
      "content": " Looks like Barack Obama is spending the summer with his head in some very good books. On Tuesday, the former president used a Facebook post to detail his summer reading list, and tops on his list was author Toni Morrison, who died Aug. 5 at the age of 88. “To start, you can’t go wrong by reading or re-reading the collected works of Toni Morrison. Beloved, Song of Solomon, The Bluest Eye, Sula, everything else — they’re transcendent, all of them. You’ll be glad you read them.” Obama also highly recommended Colson Whitehead’s “The Nickel Boys,” calling it “a necessary read, detailing the way Jim Crow and mass incarceration tore apart lives and wrought consequences that ripple into today.” The complete list, which appears below, features everything from sci-fi to spy thrillers to Hope Jahren’s “Lab Girl,” which Obama described as “a beautifully written memoir about the life of a woman in science, a brilliant friendship, and the profundity of trees.”",
      "date": "08/14/2019 04:30 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "CNN Nails Hypocrisy Of Donald Trump’s Attacks On Barack Obama’s Golfing",
      "url": "https://search.huffpost.com/click/_ylt=Awr9GjBOo6tdDDYAzGlsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558350/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fcnn-supercut-donald-trump-obama-golf_n_5d6f89dee4b09bbc9ef74c18/RK=2/RS=1VWim4RVUzCFucnFrjGhxvO5P5k-",
      "subtitle": "“I’m not gonna have time to go play golf,” Trump says in the mocking supercut of his past comments.",
      "author": "Lee Moran",
      "content": " President Donald Trump’s historic attacks on former President Barack Obama’s golfing are coming back to bite him, once again. Trump faced criticism over Labor Day weekend for apparently monitoring Hurricane Dorian from his golf course in Virginia. The total cost of his golf trips during his presidency has now topped $110 million, according to HuffPost’s analysis. On Tuesday, CNN’s “New Day” aired a supercut featuring a selection of times Trump disparaged Obama in during his campaign in 2015 and 2016 for getting out on the links ― while also claiming he’d be too busy to play golf if he won the election. Check out the segment here:",
      "date": "09/04/2019 06:18 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Van Jones: Hillary Clinton Is Playing A ‘Dangerous Game’ With Tulsi Gabbard Remarks",
      "url": "https://search.huffpost.com/click/_ylt=Awr9BNxmo6tdNZYAu3BsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558375/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fvan-jones-hillary-clinton-tulsi-gabbard-russia_n_5dab2311e4b0422422c5998b/RK=2/RS=j2hWnXT4Sl8S052RgZxum6SgJ_8-",
      "subtitle": "The CNN host said he doesn’t want Clinton’s comments on Gabbard and Russia to “legitimate these kind of attacks against anybody.”",
      "author": "Kimberley Richards",
      "content": " CNN host Van Jones criticized Hillary Clinton for her recent remarks suggesting Rep. Tulsi Gabbard (D-Hawaii) was “a favorite of the Russians” in the 2020 presidential race. “She’s playing a very dangerous game,” Jones said during a segment on “Erin Burnett Out Front” on Friday. “Hillary Clinton, if you’re concerned about disinformation ― what the Russians do, is they spread disinformation and get us divided against each other ― that is what just happened. Just throw out some information ... disinformation, smear somebody,” he continued. Jones’ remarks were in response to Clinton’s Thursday appearance on the podcast “Campaign HQ With David Plouffe.” During a conversation about the 2020 election with Plouffe, former senior adviser to Barack Obama, Clinton appeared to single out Gabbard, before unleashing accusations about Jill Stein’s 2016 presidential campaign and Russia. (Stein slammed Clinton’s comments on Twitter.) “I’m not making any predictions, but I think they’ve got their eye on somebody who’s currently in the Democratic primary ... and are grooming her to be the third-party candidate,” Clinton said during the interview. She continued, “She’s a favorite of the Russians, they have a bunch of sites and bots and other ways of supporting her so far.” Though many interpreted Clinton’s “grooming” comment as referring to the Russians, Clinton spokesperson Nick Merrill said on Twitter on Friday that the 2016 Democratic presidential nominee was referencing the Republican Party. Before making her “grooming” remarks, Clinton and Plouffe were sharing their thoughts on President Donald Trump’s election strategy. The former secretary of state did not reference Gabbard by name in that conversation, but when Merrill was asked by NBC News this week to confirm Gabbard was her target, he replied: “If the nesting doll fits.” Gabbard, who has repeatedly said she would not run as a third-party candidate if she loses the Democratic nomination, fired back at Clinton’s claims in a series of tweets on Friday. The presidential hopeful and Iraq War veteran similarly criticized The New York Times on Tuesday’s Ohio debate stage after it reported that Russian news media had frequently mentioned her. Elsewhere in the CNN segment with Burnett, Jones, who referred to Clinton as a\n”legend,” suggested there was a “backstory” to the Gabbard-Clinton-Russia debacle. He pointed to Gabbard’s decision to resign as vice chair of the Democratic National Committee in 2016 to endorse Sen. Bernie Sanders (I-Vt.) for president. “It’s been payback hell ever since,” Jones charged. He later added, “I do not want somebody of her [Clinton’s] stature to legitimate these kind of attacks against anybody ― if you’ve got real evidence, come forward with it, but if you’re just going to smear people casually on podcast, you’re playing right into the Russians’ hands.” Watch the entire CNN segment here.",
      "date": "10/19/2019 03:44 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Trump Administration To Revoke Obama-Era Water Protection Rule",
      "url": "https://search.huffpost.com/click/_ylt=Awr9BNxmo6tdNZYAuXBsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558375/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2ftrump-administration-to-revoke-obama-era-water-protection-rule_n_5d7a644ae4b06028fd38855c/RK=2/RS=058KacWNkRvBDyvmI54PhgL6HwA-",
      "subtitle": "Environmentalists say the move would leave millions of Americans with less safe drinking water and damage wetlands that prevent flooding.",
      "author": "",
      "content": "TRAVERSE CITY, Mich. (AP) — The Trump administration is revoking an Obama-era regulation that shielded many U.S. wetlands and streams from pollution but was opposed by developers and farmers who said it hurt economic development and infringed on property rights. Even before the official announcement, scheduled for later Thursday, environmental groups blasted the administration’s action, the latest in a series of moves to roll back environmental protections put into place under former President Barack Obama. The Waters of the United States rule being revoked defines which waterways are subject to federal regulation. “This action officially ends an egregious power grab and sets the stage for a new rule that will provide much-needed regulatory certainty for farmers, home builders and property owners nationwide,” Environmental Protection Agency chief Andrew Wheeler and R.D. James, assistant secretary of the Army for civil works, wrote in a column published Thursday by the Des Moines Register. Since enactment of the Clean Water Act in 1972, the federal government has gone beyond protection of navigable waterways and their major tributaries to assert jurisdiction over “isolated ponds and channels that flow only after it rains,” the officials wrote. “As the definition expanded, so too has Washington’s power over private property and the states’ traditional authority to regulate their land and water resources,” they said. President Donald Trump had ordered the agencies to develop a replacement policy that has a more restrictive definition of protected wetlands and streams, leaving fewer subject to federal protection. Environmentalists say the move would leave millions of Americans with less safe drinking water and allow damage of wetlands that prevent flooding, filter pollutants and provide habitat for a multitude of fish, waterfowl and other wildlife. The Natural Resources Defense Council said the Trump administration’s action would be challenged in court. “The Clean Water Rule represented solid science and smart public policy,” it said in a statement. “Where it has been enforced, it has protected important waterways and wetlands, providing certainty to all stakeholders.” But Don Parrish, congressional relations director for the American Farm Bureau Federation, says the 2015 regulation that extended federal protection to many U.S. wetlands and waterways created uncertainty about where farmers could cultivate land. “It would be great if farmers didn’t have to hire an army of consultants and lawyers just to be able to farm,” he said. Republican Sen. Kevin Cramer of North Dakota says the Obama rule was “an unconstitutional power grab that did nothing to advance good water management.” The question of which waters are covered under the Clean Water Act has inspired decades of lawsuits and congressional debate. A sharply divided Supreme Court in 2006 produced three differing opinions, leading the Obama administration to craft its rule. It provided federal oversight to upstream tributaries and headwaters, including wetlands, ponds, lakes and streams that can affect the quality of navigable waters. The regulation drew quick legal challenges. Courts prevented it from taking effect in parts of the U.S. Betsy Southerland, who was director of science and technology in EPA’s Office of Water during the Obama administration, said repealing its regulation would create further regulatory confusion. “This repeal is a victory for land developers, oil and gas drillers and miners who will exploit that ambiguity to dredge and fill small streams and wetlands that were protected from destruction by the 2015 rule because of their critical impact on national water quality,” Southerland said.",
      "date": "09/12/2019 11:36 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "‘Uncle Joe’ Biden Courts The Youth Vote",
      "url": "https://search.huffpost.com/click/_ylt=Awr9BNxmo6tdNZYAt3BsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558375/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fjoe-biden-2020-young-voters_n_5d80f02ce4b00d69059f3c76/RK=2/RS=7LdoC49AHWgHZlv7TXLLUgDxoo4-",
      "subtitle": "“Everybody wants another Obama and he’s the closest thing we can get,” said one student at Texas Southern University, a historically Black college in Houston.",
      "author": "Igor Bobic",
      "content": " HOUSTON ― Wading through throngs of students during a surprise visit at a historically Black university here on Friday, Joe Biden felt the love from a contingent of voters he doesn’t see often at his campaign events: young people. “It’s Uncle Joe!” one teenager shouted to a friend as the 76-year-old former vice president made his way around the student center at Texas Southern University, which was established in 1946 when Texas was still a segregated state. Biden was the only candidate who met with students there after last week’s Democratic presidential primary debate, which took place on the campus a day prior. He spent approximately 45 minutes shaking hands, posing for selfies, and giving hugs to star-struck students. Judging the reaction from among some in the crowd, one would have guessed it was actually former President Barack Obama making the rounds. “I think if there’s a Democrat that has a chance of winning, it’s definitely Biden. Everybody wants another Obama and he’s the closest thing we can get,” said Chynna Barcass, a junior at TSU who is studying political science. Obama’s political rise, though, was fueled in large part by young people. So far, polls have consistently shown Biden supporters to be older ― a trend one can’t help but notice at his rallies and town halls, which have tended to be predominantly filled by voters over the age of 60. Biden is particularly popular among older, more conservative African Americans, a source of his political strength in early primary states like South Carolina. But young Black students at TSU said they liked the former vice president, too, citing his association with Obama, who remains overwhelmingly popular among the Democratic electorate. Biden has leaned heavily into his relationship with the former president during the campaign, invoking his name repeatedly and using his legacy as a shield when faced with criticism by rivals for the Democratic nomination. Just hours before the debate last week, he released a video touting Obama administration achievements and showing him and the former president exchanging high-fives. “Barack Obama was a great president. We don’t say that enough​,” Biden wrote in a tweet accompanying the video. It’s clear why Biden’s campaign is doing this ― it’s one of his best tools in winning over not just older Black voters, but younger ones too. However, there is evidence young minority voters are more open to considering other candidates in the race, especially those who have proposed significantly more liberal policies dealing with health care and education. “My mom likes [Biden], but I don’t know. I feel like I want somebody different, somebody new,” said Ardis Thomas, a music and entertainment major who is leaning toward backing Sen. Bernie Sanders (I-Vt.) because of his plan to cancel all $1.6 trillion of U.S. student loan debt. Sanders’ presidential campaign, like his unsuccessful 2016 bid, is made up of more younger voters in general. A third of Sanders’ coalition is currently composed of voters under the age of 29, compared to just 9 percent of Biden’s, according to a survey conducted by Morning Consult last month. “A lot of people in the minority groups ... hear some of the things [Bernie is] saying and just completely get excited. I think that’s how he’s getting our vote,” argued Barcass. She added that while the idea of canceling all student debt in the U.S. sounded nice, it was nevertheless “unrealistic.” Other candidates named by students at TSU as someone they are considering supporting in the primary included Sen. Elizabeth Warren (D-Mass.), Cory Booker (D-N.J.) and former Texas congressman Beto O’Rourke, who narrowly lost his bid to oust Sen. Ted Cruz (R-Texas) during the 2018 midterm election. “I like Beto. He’s just really for the people,” said Aisha Lewis, a TSU freshman who is studying psychology. Texas is home to one of the largest African American populations in the country. Houston, in particular, has one of the most rapidly growing and diverse communities in the nation. The recent wave of Republican retirements in the House from Texas has ignited Democratic hopes about turning the state blue in the coming years. Getting young voters, who are a key segment of the Democratic electorate, enthused and out to the polls was a successful strategy for Obama in 2008 and 2012. It’s not clear yet if Biden will be able to replicate his success on that front. The former vice president’s campaign recently launched a “Students for Biden” group focused on training and recruiting organizers at college campuses, including HBCUs, but they’ve lagged behind the efforts of other candidates when it comes to drawing young voters. Biden’s campaign has acknowledged that he has to do to better at appealing to the demographic. One Biden adviser, however, argued during a press briefing last week that it is other candidates who are actually at a disadvantage in the primary due to their difficulties attracting older voters, who “tend to show up in slightly greater numbers sometimes and are regarded often as more dependable voters.” It’s true that Democratic primary voters tend to be older. Turning out voters under the age of 30 has historically been key to Democrats in winning the general election, however. In one of the most notable moments in Thursday’s presidential debate, former Housing Secretary Julián Castro targeted Biden with a sharp attack, suggesting that Biden’s memory was failing him. The broadside echoed concerns by other candidates in the race about the former vice president’s age and mental acuity, especially after highly publicized verbal slip-ups. (Warren and Sanders are also both in their 70s.) Biden’s campaign dismissed it as a “cheap shot,” and that characterization has been echoed by others in the media. But it was not an issue brought up by students at TSU, who said they were looking for a presidential candidate with their interests at heart first and foremost. “A lot of candidates think that age matters, but if you’re capable of getting things done, I don’t think it does,” said TSU College Democrats President Tyler Smith. Isaiah Thornton, who is studying journalism, agreed. “I feel like a lot of young kids like older people who know what they’re talking about,” he said.",
      "date": "09/17/2019 04:17 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "‘Saudi Arabia Should Fight Their Own Wars,’ Trump Tweeted ... When Obama Was President",
      "url": "https://search.huffpost.com/click/_ylt=Awr9BNxmo6tdNZYAtXBsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558375/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fsaudis-fight-their-own-wars-trump-locked-and-loaded_n_5d8000f1e4b00d69059d53a2/RK=2/RS=Gn7Ti3hNU25BTXKD1yfLgB0MRWk-",
      "subtitle": "He’s changed his tune now as he waits to “hear from the Kingdom” regarding a response to the attack on Saudi oil facilities.",
      "author": "Mary Papenfuss",
      "content": " Donald Trump insisted that Saudi Arabia “fight their own wars” — or “pay us an absolute fortune to protect them.” But that was in 2014, when Barack Obama was president. On Sunday he said the U.S. is “locked and loaded,” waiting to “hear from the Kingdom” about who was responsible for the attack Saturday on Saudi oil facilities. As it turns out, the U.S. didn’t wait for “the Kingdom” but instead informed the Saudis on Monday that Iran was responsible for the attack. But the Saudis said American officials failed to provide enough proof that Iran was responsible, The Wall Street Journal reported. Iran has denied responsibility. Iranian President Hassan Rouhani said the attack was an act of self-defense by the Yemeni Houthi rebels in response to being bombed by the Saudis. Trump’s supporters are backing his bristling war readiness, with Sen. Lindsey Graham (R-S.C.) suggesting the U.S. consider bombing Iran’s refineries, which would “break the regime’s back.” But Trump’s posturing has also triggered a flood of criticism, with Rep. Tulsi Gabbard (D-Hawaii) accusing the president of turning America into Saudi Arabia’s “bitch.” She accused Trump of waiting for orders from his “Saudi masters.” Sen. Mitt Romney (R-Utah) said U.S. military action on behalf of the Saudis against Iran would be “a grave mistake.” And Sen. Brian Schatz (D-Hawaii) tweeted that there is “no imminent threat and the U.S. military is not authorized to retaliate on behalf of another country.” Lawmakers reminded Trump that it’s the job of Congress whether or not to declare war. “Only Congress — not the president — can declare war,” Sen. Bernie Sanders (I-Vt.), a 2020 presidential candidate, tweeted Sunday. “And Congress will not give you the authority to start another disastrous war in the Middle East just because the brutal Saudi dictatorship told you to.” Trump appeared to back off Monday from his locked-and-loaded pose. “Do I want war?” he said to reporters in the Oval Office. “I don’t want war with anybody.” But the president added: “We’re prepared more than anybody.” He also said that the Saudis are “going to have a lot of involvement in this if we decide to do something ... that includes payment.” The attacks early Saturday on a massive oil field and refinery disrupted about 50% of Saudi oil output — 5% of the entire global supply. For decades before Trump was president, he blasted Saudi Arabia for taking advantage of its relationship with America and once mocked Obama for bowing at a meeting with the Saudi king. In office, Trump has been a constant supporter of the autocratic Saudi royal family, even after the CIA determined that Crown Prince Mohammed bin Salman was “directly involved” in the assassination a year ago of Washington Post writer Jamal Khashoggi.",
      "date": "09/16/2019 07:43 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Trump’s Cabinet Has Had More Ex-Lobbyists Than Obama Or Bush",
      "url": "https://search.huffpost.com/click/_ylt=Awr9BNxmo6tdNZYAs3BsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558375/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2ftrumps-cabinet-has-had-more-ex-lobbyists-than-obama-or-bush_n_5d811fb0e4b077dcbd6567de/RK=2/RS=VM_1CF2C4AhZxB4H0MUJ1U.3ihQ-",
      "subtitle": "Former lobbyists run the Defense and Interior departments, Environmental Protection Agency and office of the U.S. Trade Representative.",
      "author": "",
      "content": "WASHINGTON (AP) — In less than three years, President Donald Trump has named more former lobbyists to Cabinet-level posts than his most recent predecessors did in eight, putting a substantial amount of oversight in the hands of people with ties to the industries they’re regulating. The Cabinet choices are another sign that Trump’s populist pledge to “drain the swamp” is a catchy campaign slogan but not a serious attempt to change the way Washington works. Instead of staring down “the unholy alliance of lobbyists and donors and special interests” as Trump recently declared, the influence industry has flourished during his administration. The amount spent in 2019 on lobbying the U.S. government is on pace to match or exceed last year’s total of $3.4 billion, the most since 2010, according to the political money website Open Secrets. Trump also has pulled in hefty contributions from industries with business before his administration, and his hotel near the White House has been a magnet for lobbyists and foreign interests since he was elected. “An administration staffed by former industry lobbyists will almost certainly favor industry over the general public, because that’s the outlook they’re bringing to the job,” said Lee Drutman, a senior fellow in the political reform program at the think tank New America and author of the book “The Business of America is Lobbying.” Former lobbyists run the Defense and Interior departments, Environmental Protection Agency and office of the U.S. Trade Representative. The acting Labor secretary, Pat Pizzella, is an ex-lobbyist and Trump’s pick to run the department, Eugene Scalia, also is an ex-lobbyist. Scalia’s confirmation hearing before a GOP-controlled Senate committee is scheduled for Thursday and Democrats are expected to grill him on his long record of opposing federal regulations . A seventh ex-lobbyist, Dan Coats, resigned as Trump’s intelligence chief in August. President Barack Obama had five former lobbyists in his Cabinet during two terms in office and President George W. Bush had three, also during eight years in the White House, according to lobbying and foreign agent disclosure records. The review was limited to the Trump, Obama and Bush administrations because prior to 1995 there was no central database of federal lobbying registrations and the law was hazy about who was supposed to register. Shortly after taking office, Trump signed an executive order that revoked an Obama directive prohibiting lobbyists from being appointed to a post at a federal agency they’d lobbied within the last two years. While this “cooling off” period was cast aside, Trump’s order continued to bar for two years lobbyists-turned-government-employees from participating in particular matters that they’d lobbied on during the two preceding years. “Without the cooling off period, these Cabinet heads appear to be serving their former employers’ and clients’ special interests,” said Virginia Canter, chief ethics counsel of the watchdog group Citizens for Responsibility and Ethics in Washington. The White House did not immediately respond to a request for comment. Trump’s Cabinet includes the heads of the 15 executive departments and seven other senior-level posts, such as EPA administrator and director of national intelligence. Obama’s Cabinet had the same number of members and Bush’s Cabinet had two fewer. Scalia, the Labor Department nominee, has spent much of his career as a partner in the Washington office of the Gibson, Dunn & Crutcher firm, where he ran up a string of victories in court cases on behalf of business interests challenging labor and financial regulations. Scalia, the son of the late Supreme Court Justice Antonin Scalia, served for a year as the Labor Department’s top lawyer during the George W. Bush administration. His financial disclosure report lists 49 clients who paid him $5,000 or more for legal services, including e-cigarette giant Juul Labs, Facebook, Walmart and Bank of America. Disclosure records show Scalia was registered in 2010 and 2011 to lobby for the U.S. Chamber of Commerce. Pizzella has been the acting secretary since Alexander Acosta resigned the post in July amid renewed criticism of how, as a federal prosecutor, he handled a 2008 secret plea deal with wealthy financier Jeffrey Epstein. In the late 1990s and early 2000s, Pizzella lobbied for clients that ranged from Microsoft Corp. to the Mississippi Band of Choctaw Indians. He also worked on several accounts with disgraced lobbyist Jack Abramoff, although Pizzella was never accused of any misconduct or wrongdoing. Obama chose Pizzella for a GOP seat on the Federal Labor Relations Authority and he was an assistant Labor secretary during the George W. Bush administration. Two Trump Cabinet officials, Interior Secretary David Bernhardt and Environmental Protection Agency Administrator Andrew Wheeler, have been accused by congressional Democrats and public interest groups of failing to honor their ethics pledges. Both Bernhardt and Wheeler, backed by the U.S. Chamber of Commerce, have played leading roles in the administration’s rollback of environmental regulations. They also both worked at the agency they now lead during prior administrations. Interior’s inspector general launched an investigation of Bernhardt earlier this year after receiving seven separate ethics allegations against him. A complaint filed by the nonprofit Campaign Legal Center alleged that shortly after joining the department in August 2017 Bernhardt became involved in matters that were the focus of his lobbying for California’s Westlands Water District that lasted until mid-November 2016. Westlands has federal contracts to provide irrigation water to 700 family-owned farms in the fertile San Joaquin Valley. The complaint said Bernhardt had “lobbied on discrete provisions of a law directing Interior to maximize water supplies to his clients, and to minimize Endangered Species Act protections in that region.” Then, after joining Interior, Bernhardt breached his ethics pledge by directing government officials under him “to advance the particular matters he had previously lobbied on,” according to the complaint. “It is very hard to tell where Bernhardt’s lobbying career ended and where his public service begins,” said Brendan Fischer, director of the Campaign Legal Center’s federal reform program. An Interior spokesman said in a statement, “Secretary Bernhardt is and always has been committed to upholding his ethical responsibilities, and he has fully complied with those obligations.” Thomas Birmingham, Westlands’ general manager, said the agency is actually disadvantaged with Bernhardt as secretary because he’s not been able to engage with him as he did past Interior secretaries, like Ken Salazar and Sally Jewell. “I don’t know what Mr. Bernhardt has done or has not done at Interior,” Birmingham said. Wheeler worked as a lobbyist for eight years and his more than 20 different clients included coal magnate Bob Murray, who pushed hard on the Trump administration to grant a series of breaks for the sagging domestic coal industry. “I think he’s doing a great job,” Betsy Monseu, CEO of the American Coal Council, said of Wheeler. “We’re pleased to see the regulatory reform agenda moving forward.” But Canter’s organization, known as CREW, urged the EPA inspector general earlier this year to investigate whether Wheeler broke his ethics pledge. Among the allegations, CREW said Wheeler had participated in the easing of standards for storing coal ash in 2018 even though he had lobbied on those regulations the year before for Murray Energy. The inspector general’s office declined to say if it had open an investigation, directing a reporter to file a Freedom of Information Act request. An EPA statement called CREW’s complaint “baseless and just flat out false.” It said Wheeler works closely with career EPA ethics officials and abides by all ethics requirements. The Pentagon’s top official, Mark Esper, spent seven years lobbying for defense industry juggernaut Raytheon, a company that stands to gain handsomely from Trump’s push to boost military spending by billions of dollars. The company closed out 2018 by hitting a record $27.1 billion in net sales, up nearly seven percent from the $25.3 billion the year before. Esper, who was secretary of the Army when Trump chose him to be defense secretary, faced opposition from only a handful of Democrats and he was confirmed in July by a 90-8 margin. As Army secretary, Esper hasn’t participated in Raytheon-related matters under the terms of an ethics agreement that runs through this November. After that, Esper told Pentagon ethics officials that he will continue to avoid Raytheon issues unless his participation as defense secretary is determined to be essential. Robert Lighthizer, the U.S. Trade Representative, lobbied primarily for steel companies between 1999 and 2003. Beginning in 2004, he represented just one company, U.S. Steel, which paid his firm, Skadden, Arps, Slate, Meagher & Flom, $3.2 million over a seven-year period. ___ Associated Press researcher Rhonda Shafner in New York contributed to this report.",
      "date": "09/17/2019 02:12 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Donald Trump Describes Dealing With Taliban As The World’s Worst Idea — For Obama",
      "url": "https://search.huffpost.com/click/_ylt=Awr9BNxmo6tdNZYAsXBsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558375/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fdonald-trump-taliban-tweet-barack-obama-secret-talks_n_5d75da7ce4b0645135709c78/RK=2/RS=WW8L.z4nQXEPGuohf4vuJy.3Kpc-",
      "subtitle": "Awkward.",
      "author": "Mary Papenfuss",
      "content": " President Donald Trump apparently thought he was going to pull off some kind of “Art of the Deal” for Afghanistan by secretly meeting with the Taliban three days before the 18th anniversary of the Sept. 11, 2001, terror attacks. But he called it off after the Taliban claimed responsibility for a bombing near the U.S. embassy in Kabul that killed 12 people, including a U.S. soldier. In the past, Trump has repeated described negotiating with the Taliban a dreadful idea — for Barack Obama: Trump even had a tweet for Joe Biden: Critics were appalled by Trump’s Camp David invitation to the Taliban and even gave the president a new nickname:",
      "date": "09/09/2019 03:32 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Julián Castro Hits Hard At Biden On Health Care And Immigration During Debate",
      "url": "https://search.huffpost.com/click/_ylt=Awr9BNxmo6tdNZYAr3BsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558375/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fjulian-castro-joe-biden-democratic-debates-houston_n_5d7aeface4b077dcbd5b40b7/RK=2/RS=syPnkVEPLa5ULY4J6N.RozdzzyY-",
      "subtitle": "The former housing secretary did not hold back against former Vice President Joe Biden at the Democratic presidential debate in Houston.",
      "author": "Daniel Marans",
      "content": " Former Housing Secretary Julián Castro took full advantage of his moment on the national stage at the Democratic debate Thursday night to unload on former Vice President Joe Biden, accusing him of betraying the positive aspects of President Barack Obama’s legacy and refusing to disown the negative parts. His sharpest exchanges with Biden came up during discussion of two of the defining battles of the Obama presidency: those around health care and immigration policy. Health care came first, with ABC News’ panel of moderators beginning the debate in Houston with a heated and prolonged conversation about the merits and potential pitfalls of transitioning to a “Medicare for All,” single-payer health care system. Castro, who stops short of embracing a single-payer plan that forces people to drop their private insurance, nonetheless delivered a blistering attack against Biden for his health care plan. Castro simultaneously cast doubt on Biden’s self-appointed status as heir to Obama’s presidency, his commitment to universal health care coverage and his mental acuity. Biden argued that his proposed public health insurance option that Americans can buy into would achieve the same goals as the Medicare for All system proposed by Sens. Elizabeth Warren (D-Mass.) and Bernie Sanders (I-Vt.) without forcing Americans to drop their private insurance. “If you lose the job from your ... employer, you automatically can buy into this,” Biden declared. “No pre-existing condition can stop you from buying in. You get covered, period.” But Castro noted that by making enrollment in this public program optional rather than automatic, Biden’s plan fails to guarantee universal coverage. It’s a feature of Biden’s plan that he disputed in the last presidential debate, but as CNN noted in a fact check, his plan only claims it will guarantee coverage for 97% of the population. In a country of 327 million people, that leaves 10 million Americans without coverage. “Barack Obama’s vision was not to leave 10 million people uncovered,” Castro said. “He wanted every single person in this country covered. My plan would do that. Your plan would not.” Biden, who has wrapped himself in Obama’s presidency more than any other candidate, interjected repeatedly to deny that characterization. “They do not have to buy in!” he insisted. “They do not have to buy in ―” Castro cut him off and went on to insinuate that Biden’s memory might be failing him. “Are you forgetting what you said two minutes ago?” he asked, eliciting gasps from the live audience at Texas Southern University. “I can’t believe that you said two minutes ago that they had to buy in and now you’re saying they don’t have to buy in. You’re forgetting that!” South Bend, Indiana, Mayor Pete Buttigieg, who also suggested that his plan went further than Biden’s, decried the pitched tone of Castro’s exchange. “This is why presidential debates are becoming unwatchable,” he said. “Because this reminds everybody of what they cannot stand about Washington: scoring points against each other, poking at each other and telling each other that ‘My plan, your plan ― look ―’” Castro cut him off, too. “That’s called the Democratic primary election, Pete. That’s called an election. That’s an election. You know? This is what we’re here for. It’s an election,” he said, eliciting cheers from the crowd. Sen. Amy Klobuchar of Minnesota did her best to call for unity as well, though her line barely made it through the din. “A house divided cannot stand. And that is not how we’re going to win this,” she said. In a follow-up interview after the debate, Castro denied that he was casting aspersions on how Biden’s age is affecting his fitness for office. “I wasn’t taking a shot at his age,” he told ABC News. There is some disagreement as to whether Castro’s attack was fair, with Politifact deeming it “mostly false.” The lack of clarity in Biden’s language appears to have contributed to a misunderstanding. Biden might have thought Castro was suggesting that his plan required that people buy in to his public health care option and thus his response: that they “do not have to buy in.” But in so doing, Biden merely confirmed Castro’s point that enrollment under Biden’s plan is optional rather than automatic, which is why Castro seized on it as evidence of Biden contradicting himself. In a subsequent part of the exchange, Biden appeared to understand that they were debating the merits of optional enrollment. He noted that his plan automatically enrolls Americans who are eligible for Medicaid ― those with earnings below 138% of the federal poverty level ― and thus would likely cover Castro’s late diabetic grandmother, whom Castro had referenced in the debate. “If she qualifies for Medicaid, she would automatically be enrolled,” Biden said. Later on in the evening, Castro lit into Biden for failing to clarify whether he agreed early on with Obama’s policy of ramping up deportation of undocumented immigrations and neglecting to prioritize immigration reform in the first two years of his presidency when Democrats controlled Congress. It’s a subject that Sen. Cory Booker of New Jersey lambasted Biden for failing to address in the last debate in Detroit on July 31. The exchange began when Univision host Jorge Ramos, who co-moderated the debate, asked Biden whether he considered the administration’s harder-line approach to immigration a “mistake.” Ramos also asked why Latinos should trust Biden, given his service in an Obama administration in which immigration reform advocates increasingly find fault. Biden first fell back on a stock answer. “Comparing [President Obama] to the president we have is outrageous,” he said. But Ramos called him out for failing to answer the question: Does he stand by the Obama administration’s record? “The president did the best thing that was able to be done at the time,” Biden finally said. Ramos continued: What about Biden? “I’m the vice president of the United States,” he said. Ramos then turned to Castro, asking him what compromises he’d be willing to make to help immigrants as president. But Castro stayed on Biden, finishing the job that Ramos started with a riff on Booker’s critique of Biden from the previous debate. “Every time something good about Barack Obama comes up, [Biden] says, ‘Oh, I was there, I was there, I was there ― that’s me, too.’ And then every time somebody questions part of the administration that we were both part of, he says, ‘Well, that was the president,’” Castro declared, prompting applause from the audience. “He wants to take credit for Obama’s work but not have to answer any questions. I don’t get that.” Biden denied saying that. “I stand with Barack Obama all eight years, good, bad and indifferent. That’s where I stand,” he replied. Castro, the only Latino candidate in the presidential primary field, has staked his underdog bid for the presidency in no small part on his ambitious immigration reform plan. During the first Democratic presidential debate in Miami in late June, Castro had a heated exchange with former Rep. Beto O’Rourke, a fellow Texan who refused to back Castro’s plan to downgrade unauthorized border crossings to a civil violation from their current status as a felony. Of course, staking one’s candidacy in part on a criticism of Obama’s legacy is tricky terrain for any Democratic White House hopeful. The former president retains sky-high popularity among Democratic voters. Castro was careful, though, to praise Obama for his work passing the Affordable Care Act and distinguish him from Trump when it comes to immigration policy. “I agree that Barack Obama was very different from Donald Trump,” Castro said. “Donald Trump has a dark heart when it comes to immigrants.” CORRECTION: An earlier version of this article attributed the comment about a “house divided” to Sen. Kamala Harris. It was Sen. Amy Klobuchar who made the remark.",
      "date": "09/12/2019 10:36 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Obama Takes Rare Swipe At Trump By Naming 2 Things A President Shouldn’t Do",
      "url": "https://search.huffpost.com/click/_ylt=Awr9BNxmo6tdNZYArXBsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558375/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fbarack-obama-donald-trump-social-media_n_5d82ddc8e4b0957256b0f015/RK=2/RS=B8iq5ng9hoMSENVkUhLATwlP2bU-",
      "subtitle": "And Trump does both. A lot.",
      "author": "Ed Mazza",
      "content": " Former President Barack Obama seemed to take direct aim at President Donald Trump on Wednesday by naming two things the occupant of the Oval Office shouldn’t do. And Trump does both. A lot. Obama said at a tech conference that when he was president, he relied on a diversity of opinions before making decisions, according to Axios. “The other thing that is helpful is not watching TV or reading social media,” he was quoted as saying. “Those are two things I would advise, if you’re our president, not to do,” he added, per The Washington Post. “It creates a lot of noise and clouds your judgment.” Obama didn’t mention Trump by name, and at least one former Obama insider insisted that this wasn’t a shot at the current POTUS. Former Obama speechwriter Jon Favreau tweeted: While that may be the case, Obama would certainly be aware of how the comments could be taken in light of the Trump presidency. Obama made another statement that could also be interpreted as a swipe at his successor. “I’m proud of the fact we didn’t have indictments,” Obama said. “I’ve said that before, but that is pretty rare in modern-day.” The “modern-day” occupant of the White House has surrounded himself with aides and associates who are now in legal trouble. Former campaign manager Paul Manafort and former personal attorney Michael Cohen are currently serving prison time. Former campaign adviser George Papadopoulos served a 12-day sentence. Former national security adviser Michael Flynn is awaiting sentencing. And longtime aide Roger Stone is charged with lying to Congress in a trial set to begin in November.",
      "date": "09/19/2019 02:45 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    },
    {
      "title": "Barack Obama Mourns The Passing Of Cokie Roberts",
      "url": "https://search.huffpost.com/click/_ylt=Awr9BNxmo6tdNZYAq3BsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558375/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fpresident-barack-obama-cokie-roberts_n_5d8101d7e4b03b5fc88a7734/RK=2/RS=w9H1PzNrc7xW.x4K1tT9X6Use2g-",
      "subtitle": "The former president hailed the veteran journalist’s “trailblazing” work in the field, a stark contrast from Trump’s response that Roberts “never treated me nicely.”",
      "author": "",
      "content": "Cokie Roberts had a fan in the Obama family. After the veteran ABC News journalist died Monday at age 75, former President Barack Obama hailed Roberts as a “trailblazing figure” and an inspirational icon. “Michelle and I are sad to hear about the passing of Cokie Roberts,” he said in an emailed statement. “She was a trailblazing figure; a role model to young women at a time when the profession was still dominated by men; a constant over forty years of a shifting media landscape and changing world, informing voters about the issues of our time and mentoring young journalists every step of the way.” “She will be missed ― and we send our condolences to her family.” Roberts got her start at CBS News in the 1970s, when women rarely occupied prominent roles in the newsroom. Despite those headwinds, she went on to become a decorated journalist, winning three Emmys. In 2017, Roberts said she felt privileged to have had a career in the “front seat to history.” The statement from Obama was a stark contrast from the current president’s response to Roberts’ death. President Donald Trump told reporters Tuesday that he “never met her,” and once again made a person’s death about himself. “She never treated me nicely, but I would like to wish her family well. She was a professional and I respect professionals. ... Never treated me well, but I certainly respect her,” Trump said, according to a pool report. Roberts riled up then-candidate Trump in a 2016 interview when she asked him about white children using his name to bully and intimidate Hispanic children. Trump called her question “nasty.”",
      "date": "09/17/2019 01:19 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Left",
        "target_name": "Barrack_Obama"
      }
    }
  ]
}