{
  "articles": [
    {
      "title": "Bernie Sanders Unveils Sweeping Criminal Justice Reform Plan",
      "url": "https://search.huffpost.com/click/_ylt=Awr9K57QnqtdDB8A0.dsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571557200/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fbernie-sanders-criminal-justice_n_5d59688ce4b0d8840ff4c011/RK=2/RS=am9u4If2xEunRD854g9flSU8X3o-",
      "subtitle": "The proposal aims to cut the nation’s prison population in half and end mandatory minimum sentencing.",
      "author": "",
      "content": "COLUMBIA, S.C. (AP) — Democratic presidential candidate Bernie Sanders is proposing a criminal justice overhaul that aims to cut the nation’s prison population in half, end mandatory minimum sentencing, ban private prisons and legalize marijuana. He says the current system does not fairly treat people of color, addicts or the mentally ill. “We have a system that imprisons and destroys the lives of millions of people,” Sanders told The Associated Press before the planned released of his proposal Sunday. “It’s racist in disproportionately affecting the African American and Latino communities, and it’s a system that needs fundamental change.” Sanders was promoting the plan during a weekend of campaigning in South Carolina, where the majority of the Democratic electorate is African American. The Vermont senator, who won the support of some younger black Democrats during the 2016 primary, has stepped up his references to racial disparities, particularly during stops in the South and urban areas. As president, Sanders said he would abolish mandatory minimum sentencing and reinstate a federal parole system, end the “three strikes law” and expand the use of alternative sentencing, including community supervision and halfway houses. The goal is to reduce the prison population by one-half. “A very significant number of people who are behind bars today are dealing with one form or another of illness,” Sanders said. “These should be treated as health issues, not from a criminal perspective.” According to the National Alliance on Mental Illness , 2 million people with mental illness are booked into jails annually. Taking aim at what his proposal calls “for-profit prison profiteering,” Sanders would ban private prisons, make prison phone calls and other inmate communications free, and audit prison commissaries for price gouging and fees. The plan would legalize marijuana and expunge previous marijuana convictions, and end a cash bail system that Sanders says keeps hundreds of thousands who have not been convicted of a crime languishing in jail because they cannot afford bail. “Can you believe that, in the year 2019, 400,000 people are in jail awaiting a trial because they are poor?” Sanders said. “That is a moral outrage, it is a legal outrage.” According to the Prison Policy Initiative , more than 460,000 people are being held in local jails around the country while they await trial, with a median bail amount of $10,000 for felony offenses. Sanders wants to improve relations between law enforcement agencies and the communities they serve. To do that, he proposes to end federal programs that provide military equipment to local police forces, establish federal standards for the use of body cameras, provide bias training and require that the Justice Department review all officer-involved shootings. “You have a lot of resentment in minority communities all over this country, who see police forces not as an asset but as an invading force,” Sanders said. On capital punishment, Sanders’ plan formalizes his call to end the federal death penalty and urges states to eliminate the punishment as well. “When we talk about violence in society and trying to lower the levels of violence, it is not appropriate that the state itself is part of capital punishment,” Sanders said. Sanders said that over the long term, his plan will save the public money because of reductions to overall incarceration costs. “It will cost money but it will pay for itself many, many times over,” Sanders said. “Locking people up is very, very expensive.” ___ Kinnard can be reached at http://twitter.com/MegKinnardAP",
      "date": "08/18/2019 11:07 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders Hits Trump Over Comments On Jewish American ‘Disloyalty’",
      "url": "https://search.huffpost.com/click/_ylt=Awr9K57QnqtdDB8A0edsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571557200/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fbernie-sanders-trump-jewish-american-disloyalty_n_5d5cafe7e4b0f667ed6a3b01/RK=2/RS=D2uqqPvLs7lCMkBWkLEdSmgHtoQ-",
      "subtitle": "The Vermont senator and 2020 presidential candidate said, “I am a proud Jewish person and I have no concerns about voting Democratic.”",
      "author": "Sanjana Karanth",
      "content": " Sen. Bernie Sanders took a jab Tuesday at President Donald Trump over his remarks earlier that day accusing Jewish Americans who vote for Democrats of being uninformed or disloyal. “Let me say this to the president: I am a proud Jewish person, and I have no concerns about voting Democratic,” the independent from Vermont told supporters at a campaign rally in Sioux City, Iowa. “And in fact, I intend to vote for a Jewish man to become the next president of the United States.” Sanders’ comments were in response to Trump’s remarks to reporters earlier Tuesday in the Oval Office. He said Jewish Americans who vote for Democrats show “either a total lack of knowledge or great disloyalty.” Trump made the remark to reporters when speaking about Israel barring Reps. Ilhan Omar (D-Minn.) and Rashida Tlaib (D-Mich.) from entering the country. While he did not specifically say who Democratic Jewish Americans would be disloyal to, he has previously called the Muslim congresswomen “anti-Israel” and “anti-Semites,” and equated Israel with all Jewish people. Nearly 80% of Jewish voters in the U.S. voted Democratic in the 2018 midterm elections, according to the Pew Research Center. Many Jewish groups, including the Jewish Democratic Council of America, said Trump was invoking the “dual loyalty” trope against Jewish Americans that is considered anti-Semitic. Sanders often references his family’s experience in the Holocaust. His father migrated to the U.S. as a teenager, fleeing persecution in Poland. Sanders has also made it a point to balance talking about his Jewish heritage with his criticism of the Israeli government and its treatment of Palestinian people. The senator has continuously vocalized support for Omar and Tlaib, who are attacked daily for their criticism of Israel’s government and their support for the pro-Palestinian Boycott, Divestment and Sanctions (BDS) movement. After Israel announced its decision to bar the congresswomen, Omar stressed the need for more oversight of the billions of dollars the U.S. gives in aid to Israel every year. Sanders agreed with Omar, saying that Israel should decline U.S. aid if it’s going to prevent a congresswoman from entering the country. “If Israel doesn’t want members of the United States Congress to visit their country, to get a firsthand look at what’s going on, and I have been there many, many times, but if [Prime Minister Benjamin Netanyahu] doesn’t want members to visit, maybe he can respectfully decline the billions of dollars that we give to Israel,” he said on MSNBC’s “All In” last week. ",
      "date": "08/20/2019 11:14 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Donald Trump Jr. Mocks Bernie Sanders Boxing Stunt And Gets Whomped By Twitter",
      "url": "https://search.huffpost.com/click/_ylt=Awr9K57QnqtdDB8Az.dsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571557200/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fdonald-trump-jr-bernie-sanders-punching-bag-twitter_n_5d67e7d1e4b01fcc691069de/RK=2/RS=lDDRA8H7RdyuQAOl8LidT3ruDKw-",
      "subtitle": "The president’s son tweeted a video of Sanders getting hit by a punching bag and suggested it “wouldn’t exactly strike fear in the minds of our adversaries.”",
      "author": "David Moye",
      "content": " Donald Trump Jr. came out swinging against Bernie Sanders’ boxing skills ― and ended up getting pummeled by Twitter users. On Thursday, the president’s son tweeted a video of Sanders jokingly showing off his boxing skills at the Muhammad Ali Center in Louisville, Kentucky. The clip features Sanders slamming his bare fist into a punching bag, which rebounds and bonks him on the head. Sanders took the blow with good humor. But Trump Jr. used the clip to suggest world leaders might do the same if Sanders were to win the 2020 election instead of his dear old dad, Donald Trump. Both politics and boxing can be pretty brutal, but Trump Jr. apparently posted the video before realizing he was setting himself up ― once again ― as a punching bag for Twitter users. And they were happy to pile on: One guy had a pointed question for Trump Jr. And one woman wondered if Trump Jr. wanted a tweet do-over.",
      "date": "08/29/2019 12:45 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders Wants To Give Federal Workers The Right To Strike",
      "url": "https://search.huffpost.com/click/_ylt=Awr9K57QnqtdDB8AzedsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571557200/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fbernie-sanders-federal-workers-right-to-strike_n_5d5c698ce4b05f62fbd6ac85/RK=2/RS=W_gPSMlz0IhzBucQ6DbSYWsmlW4-",
      "subtitle": "The Vermont senator’s labor plan would also eliminate so-called right-to-work laws and limit CEO pay for federal contractors.",
      "author": "Kevin Robillard",
      "content": " Sen. Bernie Sanders, a leading candidate for the Democratic Party’s 2020 presidential nomination, rolled out a sweeping plan to expand the rights of workers and unions, including giving federal employees the right to strike, making it easier to form unions, eliminating so-called right-to-work laws and allowing unions in the same industry to jointly negotiate with employers. Sanders, who is currently in the top tier of candidates for the party’s nomination, is competing for union endorsements with former Vice President Joe Biden, Sen. Elizabeth Warren (Mass.) and Sen. Kamala Harris (Calif.), and the plan could help woo organized labor in the critical early voting states of Iowa, New Hampshire and Nevada. Unions can provide crucial volunteers and cash to help put campaigns over the top. The plan is based on the Workplace Democracy Act, legislation Sanders has introduced every year since he arrived in Congress in 1992. “There are many reasons for the growing inequality in our economy, but one of the most significant reasons for the disappearing middle class is that the rights of workers to join together and bargain for better wages, benefits, and working conditions have been severely undermined,” Sanders’ campaign wrote in rolling out the plan. The campaign said Sanders would aim to double union membership during his first four-year term in office. Union membership has long been in decline in the United States, and only about 1 in 10 workers are members of a union today. Sanders and other progressives have long argued the decline of unions has been a leading driver of economic inequality ― unionized employees typically make more money and are more likely to have health coverage and strong retirement plans. By executive order, Sanders would require federal contractors to take steps to make their workplaces more employee-friendly: They’d be barred from outsourcing jobs, paying their CEOs more than 150 times what their average worker makes and be required to pay workers at least $15 an hour. He’d also push to give federal employees the ability to strike for the first time. Other steps would require a friendly Congress: Sanders would propose eliminating the section of the Taft-Hartley Act that allows states to adopt right-to-work laws that undermine unions. He’d also seek to make union organizing easier with majority sign-up, also known as “card check.” His plan would seek to bar corporations from forcing employees to attend anti-union meetings and would push for a law guaranteeing the ability of public sector workers to collectively bargain. The last provision could prove particularly popular in Iowa. In 2017, the state’s Republican-controlled government passed a law that said public employees in the Hawkeye State could negotiate only over wages, not for health care or other benefits. Another major union priority included in the plan and that would require congressional approval is sectoral bargaining, which allows unions across a single industry to bargain together and set universal standards for wages and benefits.",
      "date": "08/21/2019 09:00 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "What ‘Medicare For All’ Would Really Mean For The Middle Class",
      "url": "https://search.huffpost.com/click/_ylt=Awr9K57QnqtdDB8Ay.dsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571557200/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fmedicare-for-all-middle-class_n_5da67eeae4b062bdcb1a7926/RK=2/RS=I79EOnisThPVApg.79ChvAlXZrI-",
      "subtitle": "The answer is more complicated than the Democratic debates might suggest.",
      "author": "Jonathan Cohn",
      "content": " The question of whether “Medicare for All” would be a winner for the middle class has been a big topic in the 2020 presidential campaign and it came up again in Tuesday night’s Democratic debate. By now, you may be familiar with the arguments. Sen. Bernie Sanders (I-Vt.), author of a leading Medicare for All proposal, openly concedes that it will require some new taxes to finance the cost of generous insurance for everybody. Sen. Elizabeth Warren (D-Mass.), who has endorsed the Sanders bill, refuses to admit that taxes would go up, presumably because she doesn’t want to give Republicans fodder for an attack ad. But the underlying arguments from the two are actually the same. Whatever middle-class Americans ended up paying into a new Medicare for All system, Sanders and Warren say, it would be less than what they pay for the current system in the form of private health insurance premiums, out-of-pocket costs and lost wages. On Tuesday night, Warren turned that claim into a vow. “Costs will go up for the wealthy,” Warren said. “They will go up for big corporations. And for middle-class families, they will go down. I will not sign a bill into law that does not lower costs for middle-class families.” Can she deliver on that promise? Can Sanders? Can any backer of Medicare for All? It’s impossible to say definitively right now because the answer depends on some key details still missing from the existing proposals. The Sanders bill, for example, doesn’t specify which taxes it would raise. It also doesn’t indicate exactly how the new program would pay doctors, hospitals and other providers of medical care. But you can get a sense of how Medicare for All might look in practice by looking closely at a structurally similar state-level proposal in New York that progressives have been promoting and that was the subject of a thorough analysis last year. The analysis found that the middle class really did come out ahead, although that determination came with a few, very important caveats that frequently get lost in these debates. The proposal is called the New York Health Act and, like Medicare for All, it would wipe out nearly all existing insurance arrangements to enroll everybody into a brand-new, state-run program. Financing under the NYHA would come from taxes on payrolls and non-wage income (interest, dividends, etc.). Progressives have been pushing for the idea to get a serious hearing in the New York state legislature, now that Democrats finally have full control. So far, that hasn’t happened. But last year, the Rand Corporation, an independent think tank with its own model for projecting the effects of health care proposals, produced a detailed report on how the NYHA might work out in practice. It’s not an easy calculation to make, because introducing such a system would inevitably cause so many changes, some of which would push in opposite directions from others. People would start using more health care services, for instance, because they had coverage for the first time or because the NYHA plan, like Medicare for All, would be more generous than existing coverage. That would tend to drive up the program’s costs. On the other hand, the NYHA plan would simplify billing and administration, in part because doctors and hospitals wouldn’t have to spend time communicating and haggling with private insurers. That would tend to reduce costs. In the end, Rand researchers determined, the NYHA as designed would reduce overall spending on medical care in New York state. And as long as taxes to pay for the program were sufficiently progressive, the benefits would flow primarily away from the rich and toward lower- and middle-income groups. Specifically, the richest 10% of New Yorkers would be paying more for health care on average, while the other 90% would pay the same or less. That sounds a lot like the kind of plan that Sanders and Warren promise ― which is to say, it sounds a lot like a plan that would work out well for most Americans. But this is where those caveats come in. In a single-payer system like the NYHA or Medicare for All, the government sets prices for the suppliers and providers of medical care, including not just drug companies but also doctors and hospitals. That’s why these sorts of proposals can show such big savings. The NYHA doesn’t actually specify what the plan would pay doctors and hospitals, so Rand researchers had to make some assumptions. They figured that, at the outset, health providers would be paid at rates that matched the average of what all the different payers in New York (Medicaid, private insurance, etc.) pay now. But over time, Rand researchers assumed, the new system would aggressively limit year-to-year inflation, imposing the kind of cost discipline that does not exist now. This is how universal coverage systems in the rest of the world control costs. But here in the U.S., where such controls have never existed on such a widespread basis, lobbying groups representing the health care industry would fight hard to avoid such limits on their payments. And there’s good reason to think those lobbyists would prevail ― if not by killing Medicare for All outright, then by winning much more favorable terms on payment. That would inflate the program’s cost, forcing the government to raise more revenue. But there are limits to how high taxes on high earners can go, because at some point “tax avoidance” ― that is, people finding ways to shield income or qualify for lower rates ― makes it difficult to increase revenue. “Creating a single-payer plan where the wealthy pay more and everyone else comes out no worse or ahead would require a delicate balance of high tax rates for the wealthy that do not cause substantial tax avoidance and moderate to low tax rates for everyone else,” Jodi Liu, chief author of the Rand report, told HuffPost. “The overall tax revenue needed would depend critically on how much providers are paid.” Then there is the other big asterisk in the Rand report. It’s one thing to say that, on average, people in the lower 90% of the income scale would pay less for their health care. It’s quite another thing to say that every single person in the lower 90% of the income scale would pay less for their health care. In reality, for each income group, at least some individuals would likely find themselves paying more, not less, once a Medicare for All system took effect. Imagine, for example, a 30-year-old who today buys a minimalist policy directly from an insurer ― say, one of the “bronze” plans with relatively skimpy benefits that barely meet the Affordable Care Act’s coverage standards. Because that plan covers so little and because 30-year-olds pay lower premiums than older people, that bronze plan is probably pretty cheap. The bronze plan could easily cost less than the new taxes for Medicare for All and maybe a lot less, depending on how much money the 30-year-old makes and just how skimpy that plan is. The Rand analysis of the NYHA makes this quite clear. The report’s appendix breaks down the effect that the plan would have within specific income groups. Within the middle income groups ― those with annual income between 139% and 400% of the poverty line, or about $35,790 to $103,000 for a family of four ― there is always a fraction for whom the NYHA taxes are more than they would have spent for health care under the status quo. The percentage of people on the hook for higher costs would generally be fairly small. But the “rate shock” that came with the Affordable Care Act, when people suddenly discovered their insurance cost more than it did the previous year, also affected a tiny portion of the population. It created a huge backlash anyway. That doesn’t mean the same thing would happen with Medicare for All. One reason the Affordable Care Act’s rate shock led to so much anger is that the new Obamacare plans came with high deductibles. Lots of people felt like they were paying more but not getting great insurance in return. The whole point of Medicare for All, like the NYHA, is to give everybody better insurance than they have today. Even people who felt worse off in the transition to Medicare for All might be grateful for the switch later on. That 30-year-old with a bronze policy today could be in real trouble if they got hit with serious medical expenses, given that deductibles on bronze plans can approach $7,000. And under Medicare for All, the 30-year-old would probably have more choices of doctors and hospitals. Bronze plans are famous for their tiny provider networks. All of this assumes that Rand’s projections are basically on target ― and that the New York plan is a reasonable proxy for how Medicare for All might work out in the nation as a whole. But projections can be wrong and New York, like any state, has plenty of idiosyncrasies that make extrapolating from it difficult. To the extent experts have tried to perform similar analyses on the Sanders proposal, the verdict has been mixed, depending in part on assumptions they made about missing details in the bill. In 2016, Kenneth Thorpe, an Emory University economist who had served in the Clinton administration, concluded that tax hikes necessary to finance the Sanders proposal would leave nearly three-quarters of working households that previously had private coverage owing more in taxes than they would have owed in premiums and out-of-pocket costs. But just this week, the Commonwealth Fund and the Urban Institute released a new report about health care options and concluded that, in a plan that looks like Medicare for All, “higher-income people will likely face the greatest increases in taxes, meaning their new tax burdens would likely exceed their savings; the reverse is likely true for lower-income populations.” As Larry Levitt, executive vice president at the Henry J. Kaiser Family Foundation, told HuffPost, “A Medicare for All plan absolutely can be designed to fulfill the promise that the middle class would on average pay less for health care. But it requires some big trade-offs to do that.” So far, those trade-offs haven’t gotten much attention.",
      "date": "10/16/2019 08:20 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders Unveils Plan To Defend The News Media, Says Democracy Requires It",
      "url": "https://search.huffpost.com/click/_ylt=Awr9K57QnqtdDB8AyedsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571557200/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fbernie-sanders-journalism-news-industry_n_5d64a535e4b0d2fa2daff30b/RK=2/RS=h_iXmi9s2OCjuu87gPwXgyCkcdo-",
      "subtitle": "“We need to rebuild and protect a diverse and truly independent press,” the senator from Vermont and 2020 Democratic presidential candidate wrote.",
      "author": "Nick Visser",
      "content": " Sen. Bernie Sanders (I-Vt.) unveiled a sweeping plan to protect American journalism on Monday, decrying President Donald Trump’s attacks on the media, a spate of megamergers of media companies and the rise of Silicon Valley behemoths leeching advertising dollars from the news industry. “Today, after decades of consolidation and deregulation, just a small handful of companies control almost everything you watch, read, and download,” Sanders, a 2020 presidential candidate, wrote in the Columbia Journalism Review. “Given that reality, we should not want even more of the free press to be put under the control of a handful of corporations and ‘benevolent’ billionaires who can use their media empires to punish their critics and shield themselves from scrutiny.” Read the full article in the Columbia Journalism Review. Newsroom employment across the U.S. has plummeted since 2008, and the Pew Research Center said last month that the total number of journalism jobs was slashed by nearly a quarter over the past decade. The cuts were largely seen at newspapers, but other massive digital enterprises have seen dramatic rounds of layoffs in recent years, including BuzzFeed, Vice and HuffPost. From January to May of this year, about 3,000 people working in the news industry were laid off or offered a buyout package, according to an analysis by Bloomberg. At the same time, news companies have been scrambling for ways to become profitable as traditional advertising dollars dry up (or hunted for billionaire benefactors, such as Jeff Bezos’ purchase of The Washington Post or Dr. Patrick Soon-Shiong’s of the Los Angeles Times). Sanders noted that much of that cash still exists, and as of this year, digital advertising outpaces both print and television ad revenue. But the money largely flows to Google and Facebook, who control about 60% of the digital advertising market. “We need to rebuild and protect a diverse and truly independent press so that real journalists can do the critical jobs that they love, and that a functioning democracy requires,” Sanders said. Were he to unseat Trump in the 2020 election, Sanders said he would issue an “immediate moratorium” on mergers of major media corporations and instead focus on protections for local, independent news outlets. The senator also said he would appoint an attorney general to oversee tech giants like Facebook and Google to stop efforts to “cannibalize, bilk, and defund news organizations.” “Trump’s authoritarian bullying of the media is totally unacceptable and it must be denounced and rejected,” he wrote. “But let us be clear: that alone will not solve the journalism crisis. Moreover, a further expansion of oligarchic business models in the media industry could make matters worse.” Sanders said he planned to further support initiatives to unionize newsrooms as well as pushing for a plan that could see employees buy their media outlets through a stock-ownership plan before the companies are sold. Sanders has been a leading contender among the crowded Democratic presidential field. A new national poll released Monday showed the senator in a virtual three-way tie with former Vice President Joe Biden and Sen. Elizabeth Warren (D-Mass.) (although it’s still early to put much faith in such numbers before the primaries even begin, and other polls have had different results). Recode notes that the Sanders campaign has grown frustrated with the media in the past, lambasting the “corporate media” at times. Earlier this month, Sanders suggested that Bezos influenced The Washington Post’s coverage and was more critical of him than other candidates. The remarks prompted the executive editor of the Post to fire back, calling the idea a “conspiracy theory” while assuring readers that the newspaper operates with “full independence.” Regardless of the tiff, the plan presents a dramatic and novel effort among the Democratic candidates to better protect a free press, a far cry from Trump’s blistering criticism of anyone and everyone critical of his administration. “Our constitution’s First Amendment explicitly protects the free press because the founders understood how important journalism is to a democracy,” Sanders wrote on Monday. “More than two centuries after the constitution was signed, we cannot sit by and allow corporations, billionaires, and demagogues to destroy the Fourth Estate, nor can we allow them to replace serious reporting with infotainment and propaganda.”",
      "date": "08/27/2019 12:54 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders Hails Volunteer Army As Advantage Over Rivals",
      "url": "https://search.huffpost.com/click/_ylt=Awr9K57QnqtdDB8Ax.dsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571557200/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fbernie-sanders-volunteer-army-distributed-organizing-2020-democratic-presidential-primary_n_5d65fbd5e4b01fcc690b9a90/RK=2/RS=VFvjthcbW9tL50D8xX.w53dUP8s-",
      "subtitle": "The progressive presidential contender’s staff and volunteers have led 11,000 events, according to his campaign.",
      "author": "Daniel Marans",
      "content": " Staff and volunteers for the presidential campaign of Sen. Bernie Sanders (I-Vt.) have organized and hosted over 11,000 events, including more than 2,000 in California, the campaign announced Tuesday evening. The vast majority of the events have been organized by volunteers, according to the campaign. The achievement, which top Sanders campaign organizers revealed in a conference call with over 7,000 supporters, reflects what the Sanders campaign sees as a secret weapon as it seeks to stand out in a crowded field of candidates: a “distributed” ― or volunteer-run ― organizing system that it innovated in the 2016 race and has since fine-tuned. Joining the call with volunteers after several of his advisers spoke, Sanders affirmed that, although the campaign would engage in conventional tactics like television and radio advertisements, its strength was the devotion of its supporters, many of whom have become volunteers. “We are going to win this campaign because we ... are going to have the strongest grassroots movement of any campaign,” he said. “That is how we win this thing. We win this going to our base, our strength of support.” The conceit of distributed organizing, which has its fair share of skeptics, is that campaigns can amplify by orders of magnitude the effect of the staff they employ directly by empowering exceptionally motivated volunteers to run their own house parties, lead their own canvasses and develop, and monitor their own voter contacts by phone and text message. It differs from traditional campaign volunteering in terms of the resources and technology the Sanders campaign, and others inspired by it, have expended on creating an infrastructure to facilitate the work of its most dedicated supporters. It will be difficult to fully measure the organizing technique’s effectiveness prior to Feb. 3, when Sanders competes in Iowa’s Democratic caucus. On Tuesday evening’s call, the campaign said its staff and volunteers had made 2 million calls and sent 30 million text messages to voters in early states. It also recently concluded a two-week campus organizing boot camp, or “summer school,” that it says graduated more than 1,500 college and graduate school students who plan to serve as campaign ambassadors and organizers at their universities. A viral initiative earlier this month asking Sanders supporters to share on social media the life experience that brought them to the campaign ― dubbed “#MyBernieStory” ― doubled as a volunteer recruitment technique. The campaign directed Sanders supporters who used the campaign’s organizing app, Bern, to post “#MyBernieStory” on Twitter or Facebook to use a digital tool to contact several other voters by text message and encourage them to get involved in the campaign. The campaign estimates that it reached the equivalent number of voters through those digitally facilitated connections as it would normally reach from knocking on 63,000 doors. Critics of distributed organizing argue that it is no substitute for the professionally run field organizing teams that have powered successful presidential campaigns. And on that front, Sanders got a later start than some of his rivals, beginning hiring field organizers in the early states only in May. Sen. Elizabeth Warren of Massachusetts, by contrast, already had 50 staff members in Iowa by that time. The Sanders campaign insists, though, that distributed organizing aims not to supplant traditional field organizing but to magnify its impact. It now has dozens of paid, full-time field organizers in each of the four early states of Iowa, New Hampshire, Nevada and South Carolina, as well as in California, a Super Tuesday state with a primary open to all registered voters. The conference call noted the campaign’s distributed organizing strategy has gone from identifying and recruiting volunteers to now putting that volunteer army to work more aggressively. Campaign organizing leaders invited call participants to volunteer in real time to host a “Plan to Win” house party in September, where volunteers will bond with their peers and receive marching orders for the next phase of the campaign. The campaign said it received 1,700 commitments from volunteers on the call to host such house parties. The Sanders campaign is hoping to capitalize on the momentum it has developed in recent weeks after a series of high-profile policy rollouts and endorsements, including his first official declaration of support from a national labor union. The Sanders campaign, which has tangled bitterly with media outlets and pollsters for what it believes is bias against the Vermont senator, touted a national poll released Monday that showed Sanders in a statistical three-way tie for first place with Warren and former Vice President Joe Biden. But Sanders still trails Biden in the averages of polls in Iowa and New Hampshire, states that are essential to his success. His campaign has argued that polls, which generally survey a universe of likely voters, do not account for the ways in which his campaign is seeking to turn out infrequent and new voters often left out of polling. At least one leading pollster has disputed the Sanders campaign’s analysis of the polls’ shortcomings. Still, the Sanders campaign believes its success hinges on reaching those non-traditional voters ― and sees its volunteer force as a key tool to do it. “We will win this election ― we will win the Democratic nomination, we will defeat Trump ― because we are going to bring out people who, in many cases, have not participated in politics before,” Sanders said Tuesday evening. “And I’m talking about a generation of young people who in my view are the most progressive generation in the history of our country ― anti-racist, anti-sexist, anti-homophobia, anti-religious bigotry.”",
      "date": "08/28/2019 12:43 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Van Jones: Hillary Clinton Is Playing A ‘Dangerous Game’ With Tulsi Gabbard Remarks",
      "url": "https://search.huffpost.com/click/_ylt=Awr9K57QnqtdDB8AxedsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571557200/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fvan-jones-hillary-clinton-tulsi-gabbard-russia_n_5dab2311e4b0422422c5998b/RK=2/RS=RLy3wifHlrgERbnBNQ5RPMqq_4I-",
      "subtitle": "The CNN host said he doesn’t want Clinton’s comments on Gabbard and Russia to “legitimate these kind of attacks against anybody.”",
      "author": "Kimberley Richards",
      "content": " CNN host Van Jones criticized Hillary Clinton for her recent remarks suggesting Rep. Tulsi Gabbard (D-Hawaii) was “a favorite of the Russians” in the 2020 presidential race. “She’s playing a very dangerous game,” Jones said during a segment on “Erin Burnett Out Front” on Friday. “Hillary Clinton, if you’re concerned about disinformation ― what the Russians do, is they spread disinformation and get us divided against each other ― that is what just happened. Just throw out some information ... disinformation, smear somebody,” he continued. Jones’ remarks were in response to Clinton’s Thursday appearance on the podcast “Campaign HQ With David Plouffe.” During a conversation about the 2020 election with Plouffe, former senior adviser to Barack Obama, Clinton appeared to single out Gabbard, before unleashing accusations about Jill Stein’s 2016 presidential campaign and Russia. (Stein slammed Clinton’s comments on Twitter.) “I’m not making any predictions, but I think they’ve got their eye on somebody who’s currently in the Democratic primary ... and are grooming her to be the third-party candidate,” Clinton said during the interview. She continued, “She’s a favorite of the Russians, they have a bunch of sites and bots and other ways of supporting her so far.” Though many interpreted Clinton’s “grooming” comment as referring to the Russians, Clinton spokesperson Nick Merrill said on Twitter on Friday that the 2016 Democratic presidential nominee was referencing the Republican Party. Before making her “grooming” remarks, Clinton and Plouffe were sharing their thoughts on President Donald Trump’s election strategy. The former secretary of state did not reference Gabbard by name in that conversation, but when Merrill was asked by NBC News this week to confirm Gabbard was her target, he replied: “If the nesting doll fits.” Gabbard, who has repeatedly said she would not run as a third-party candidate if she loses the Democratic nomination, fired back at Clinton’s claims in a series of tweets on Friday. The presidential hopeful and Iraq War veteran similarly criticized The New York Times on Tuesday’s Ohio debate stage after it reported that Russian news media had frequently mentioned her. Elsewhere in the CNN segment with Burnett, Jones, who referred to Clinton as a\n”legend,” suggested there was a “backstory” to the Gabbard-Clinton-Russia debacle. He pointed to Gabbard’s decision to resign as vice chair of the Democratic National Committee in 2016 to endorse Sen. Bernie Sanders (I-Vt.) for president. “It’s been payback hell ever since,” Jones charged. He later added, “I do not want somebody of her [Clinton’s] stature to legitimate these kind of attacks against anybody ― if you’ve got real evidence, come forward with it, but if you’re just going to smear people casually on podcast, you’re playing right into the Russians’ hands.” Watch the entire CNN segment here.",
      "date": "10/19/2019 03:44 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders Sings Cardi B’s ‘Money’ In Flat-Out Funny Dub Track",
      "url": "https://search.huffpost.com/click/_ylt=Awr9K57QnqtdDB8Aw.dsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571557200/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fbernie-sanders-cardi-b-money_n_5d5e904ae4b0dfcbd4892982/RK=2/RS=qUUK09G3Ge4ME1Rn.s8XK2S7t5E-",
      "subtitle": "The 2020 Democratic presidential candidate lays down the rap of his ardent hip-hop supporter.",
      "author": "Ron Dicker",
      "content": " Bernie Sanders has rapper Cardi B in his camp. She even interviewed the Democratic presidential candidate recently to discuss police brutality and other issues. Thanks to the YouTube comedy channel baracksdubs, Sanders (I-Vt.) appears to return the love with a hilariously dubbed version of the senator “performing” the hip-hop star’s “Money.” Just hearing Sanders say, “I like morning sex,” in the drastically edited clip will make your day. Maybe a real Bernie-Cardi collaboration could be coming?",
      "date": "08/22/2019 09:57 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "4 Takeaways From The Third 2020 Democratic Debate",
      "url": "https://search.huffpost.com/click/_ylt=Awr9ImDmnqtd0J8ASa5sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571557222/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2ftakeaways-from-third-2020-democratic-debate_n_5d7b1cdfe4b03b5fc880dc79/RK=2/RS=6tG9OWXioUvuHNbfhoqN63k.IWY-",
      "subtitle": "A temporary truce holds among the top-tier trio of presidential candidates in Houston.",
      "author": "Kevin Robillard",
      "content": " The 2020 Democratic presidential primary is in the middle of a slog, and Thursday night’s debate reflected that. The campaign is mature enough that multiple candidates have dropped out of the race but still young enough for the top-polling candidates to bring risk-averse approaches to the debate, limiting the possibilities for fireworks. It was late enough in the cycle for most of the arguments to be familiar to a highly informed voter but perhaps not late enough to qualify as must-see television for the less-engaged. Little happened on Thursday night to directly and immediately threaten the polling lead of the top three presidential candidates ― former Vice President Joe Biden, Sen. Elizabeth Warren (D-Mass.) and Sen. Bernie Sanders (I-Vt.) ― and, beyond their now-standard opening 30-minute exchange on health care and “Medicare for All” and a brief scuffle on Biden’s vote for the Iraq War, they avoided directly criticizing each other. The lower-polling candidates, including Sen. Kamala Harris (D-Calif.), Sen. Amy Klobuchar (D-Minn.) and former Rep. Beto O’Rourke (D-Texas), all deployed different strategies for a breakout moment: Klobuchar used her corny sense of humor, Harris tried to focus on criticizing President Donald Trump, and O’Rourke had success introducing his campaign’s new focus on gun control to a national audience.  Here are four takeaways from the third Democratic presidential debate: Polling in recent weeks has shown a solid top trio of Biden, Warren and Sanders, with Harris and South Bend, Indiana, Mayor Pete Buttigieg ― both of whom had stints in the top tier ― falling into the single digits. The fact that Warren and Biden, who have clashed in the past, were sharing the debate stage for the first time only increased expectations of a showdown. Instead, new lines of contrast were few and far between, with all three top candidates opting to take a rain check on a climactic battle. Sanders and Warren teamed up to battle Biden in an occasionally testy health care exchange that mostly was a retread of arguments from earlier debates. Repeat viewers who were sold on Sanders’ Medicare for All plan and those who prefer Biden’s more incremental push to expand Obamacare were unlikely to have heard any arguments to budge them. One answer from Sanders did stand out. After Biden brought up his own vote in favor of the Iraq War, Sanders highlighted his own opposition to the conflict. “The truth is, the big mistake, the huge mistake, and one of the big differences between you and me, I never believed what [Dick] Cheney and [George W.] Bush said about Iraq,” Sanders said to Biden. “You’re right,” the former vice president responded, as many in the audience cheered. But Sanders quickly let the topic drop, moving on to discuss his work to improve veterans’ health care as the top Democrat on the Senate Veterans Affairs Committee. In the same answer, he noted he had voted against increases in military spending during the Trump administration. That’s a potential point of contrast with Warren, but he never mentioned her votes to make the contrast clear. Though all three top-tier candidates received plenty of attention from the moderators ― Biden led in speaking time, with 17½ minutes, Warren was second with 16½ minutes, and Sanders was in fourth beyond Booker with 14 minutes ― all also had stretches when they seemed to take a back seat. Their campaigns are likely to be fine with that. At this point, the front-runners have much more ground to lose than they stand to gain. The goal of any lower-polling candidate is to have A Moment, and O’Rourke’s declaration of support for a mandatory buyback of assault weapons ― “Hell, yes, we’re going to take your AR-15, your AK-47,” he told the moderators. “We’re not going to allow it to be used against our fellow Americans anymore.” ― qualified as one and is likely to be one of the few clips voters who didn’t watch live will see from the debate. It’s likely to generate attention not only because the party’s base seems ready to embrace candidates adopting bolder positions on gun control but also because it’s a risky position for a Democrat to hold for the general election. O’Rourke, who is polling in single digits, has adopted a more urgent tone in his campaign since the mass shootings in El Paso and Odessa, Texas, last month and has put an aggressive gun control push at the center of his messaging. It’s paying off: The O’Rourke campaign bragged that it had its best fundraising hour of the quarter during the debate. It’s possible this is O’Rourke finding his stride. But it’s also possible it leads to a burst of attention with little long-term effect. (See the praise of former Housing and Urban Development Secretary Julián Castro after the first debate for an example.) Castro has consistently shown his willingness to draw contrasts and critique his opponents ― remember his attacks on O’Rourke in the first debate ― and Biden was his main target Thursday. His attack on the 76-year-old former vice president during the health care portion of the debate ― “You just said that. You just said that two minutes ago. You just two minutes ago said that they would have to buy in.” ― is unlikely to lead to a detailed policy discussion and has already led to a discussion about whether the attack was unfairly ageist. (Castro, in post-debate interviews, insisted he wasn’t taking a shot at Biden’s age.) Sure, slamming Biden is likely to please progressives eager for the other candidates to knock the Delawarean from his perch atop the polls. The response to Castro’s comments, even in the immediate hours after the debate, illustrates the risks of throwing punches in a primary, especially when the other candidate has an extensive network of surrogates and allies like Biden does. The debate had barely ended when former Chicago Mayor Rahm Emanuel was on national television calling Castro “mean and vindictive.” Expect similar commentary from other Obama administration alumni with fond feelings for the former vice president. At the same time, Castro, who is polling at around 1%, was not guaranteed to feature in post-debate chatter. The punches he threw at Biden mean he will be talked about ― something a candidate polling at 1% needs desperately. And another debate exchange made it clear Castro isn’t going to shy away from criticizing the other candidates. “This is why presidential debates are becoming unwatchable,” Buttigieg said after the former San Antonio mayor’s exchange with Biden. “Yeah, that’s called the Democratic primary election, Pete. That’s called an election,” Castro responded. “This is what we’re here for.” Thursday’s debate moderators were two white men, one black woman and one Latino man. It was a diverse group of questioners, and it paid off. Some of the strongest questions of the night came from ABC News correspondent Linsey Davis and Univision anchor Jorge Ramos. The majority of the moderators in the 2016 and 2018 Democratic debates were men, and predominantly white men. But the Democratic National Committee instituted a new rule for the 2020 election cycle mandating that every debate have a female moderator. It also encouraged news outlets hosting debates to include people of color. On Thursday, Davis pressed Harris on her criminal justice record, listing positions that have changed over the years. And Davis pointedly read Biden one of his quotes from 1975, in which he said he didn’t believe society had any responsibility to address the legacy of slavery. Ramos pressed Biden on President Barack Obama’s deportations of undocumented immigrants and asked him why Latinos should trust him. He also challenged Biden when he dodged the question. He then turned to Castro, the former Obama Cabinet secretary and the only Latino candidate in the field, and asked him why voters should trust Democrats to deal with immigration reform since the party failed to do it when it controlled Congress and the White House in 2009. Amanda Terkel contributed to this report.",
      "date": "09/13/2019 01:23 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Democratic Front-Runners Spar On Stage For The First Time In Houston Presidential Debate",
      "url": "https://search.huffpost.com/click/_ylt=Awr9ImDmnqtd0J8AR65sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571557222/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fjoe-biden-elizabeth-warren-houston-democratic-debate_n_5d7ada3be4b00d690595ac7e/RK=2/RS=R43UkC3yCAqdA5TVL1_hHZeay2A-",
      "subtitle": "The much-anticipated confrontation between leading 2020 candidates Joe Biden, Elizabeth Warren and Bernie Sanders never really came to fruition.",
      "author": "Igor Bobic",
      "content": " HOUSTON ― After two debates that did not feature the leading Democratic presidential candidates all on one stage, Thursday’s showdown finally felt like a real debate, with establishment front-runner Joe Biden sparring with the progressive challengers close at his heels in the polls, Sens. Elizabeth Warren (D-Mass.) and Bernie Sanders (I-Vt.), as well as other moderates in the race. The 10 candidates ditched the introductory boilerplate and dived straight into their differences on health care and the economy, executing veiled shots at each other they’ve telegraphed for weeks. But the highly anticipated face-off between Biden, Warren, and Sanders, the three polling leaders in the race, never really came to a head beyond one exchange on health care. “How are we going to pay for it?” Biden asked moments after the debate began, referring to the universal health care plan backed by both Sanders and Warren. “I want to hear that tonight. My distinguished friend, the senator on my left, has not indicated how she pays for it,” he said, referring to Warren. “The senator says she’s for Bernie. Well, I’m for Barack,” the former vice president added, name-dropping former President Barack Obama. Warren responded by saying “we all owe a huge debt to President Obama,” who remains overwhelmingly popular among the Democratic electorate, and explained that she planned to make the richest individuals pay for her plan. Sanders, who has made his “Medicare for All” plan the signature feature of his candidacy, also made sure not to miss a dig at Biden. “Let us be clear, Joe, in the United States of America, we are spending twice as much per capita on health care as the Canadians or any other major country on earth,” Sanders said. Biden’s campaign previewed his attacks in the days leading up to the debate as advisers repeatedly argued that Democrats should select a nominee able to offer “more than plans,” a reference to Warren’s most popular line on the campaign trail, “I have a plan for that.” Warren, meanwhile, took swipes of her own ahead of the debate that were widely seen as focusing on Biden. On the campaign trail, Warren repeatedly touted how she is not “spending my time with high-dollar donors and with corporate lobbyists,” a reference to the former vice president’s fundraising events with well-heeled donors. The tension between the two campaigns spilled out into the open on the eve of the debate after former Pennsylvania Gov. Ed Rendell, a Biden surrogate, penned an op-ed in The Washington Post calling Warren a “hypocrite” and saying that she “didn’t have any trouble” taking his money until she swore off high-dollar fundraisers for her presidential bid this year. Biden’s campaign told reporters on Thursday that he was not involved in the decision to publish the op-ed. The expected fireworks between the two candidates fizzled on stage, however. Warren did not bring up the op-ed, and apart from her remarks on Medicare for All, she played it safe by focusing on her plans for the economy and taking on corruption in Washington. Biden ignored Warren’s former work in bankruptcy law and clients, continuing to make his case about “restoring the soul of America” amid the chaotic tenure of President Donald Trump. Former Housing and Urban Development Secretary Julián Castro, meanwhile, delivered one of the sharpest attacks against Biden when he insinuated that the onetime Delaware senator’s memory might be failing him. “Are you forgetting what you just said two minutes ago?” Castro said during an exchange on health care, eliciting some gasps from the audience and reprimands from several other candidates on stage. The line appeared to evoke some critics’ concerns about Biden’s mental acuity. “This is why presidential debates are becoming unwatchable,” lamented South Bend, Indiana, Mayor Pete Buttigieg afterward. Minnesota Sen. Amy Klobuchar agreed, chiming in with, “A house divided cannot stand.” Biden campaign adviser Anita Dunn responded by telling reporters that Castro “clearly didn’t learn from the first two debates that taking personal cheap shots at Vice President Biden actually doesn’t work out that well.” But New Jersey Sen. Cory Booker seemed to back up Castro in a later interview with CNN, stating that “there’s a lot of people concerned about Joe Biden’s ability to carry the ball all the way across the end line without fumbling.” It was unclear, however, if the damage to Biden over the course of the night was severe enough to knock him from his front-runner perch. Other lower-ranked candidates also had standout moments during the night. Buttigieg got emotional in his closing remarks while talking about coming out as gay when the “don’t ask, don’t tell” policy forced LGBTQ members of the military to keep quiet about their sexual orientation. Former Texas congressman Beto O’Rourke won applause when he reiterated his support for a mandatory buyback program for assault weapons. O’Rourke vowed: “Hell, yes, we’re going to take your AR-15, your AK-47.” Klobuchar took a swing at Sanders over the specifics in his health care plan, saying, “While Bernie wrote the bill, I read the bill and ... it says that we will no longer have private insurance as we know it.” And the audience loved California Sen. Kamala Harris’ opening remarks in which she spoke directly into the camera to address Trump and his policies. “Now, Mr. President, you can go back to watching Fox News,” she said. This story has been updated with additional comments during and after the debate.",
      "date": "09/12/2019 11:28 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Top Progressive Group Endorses Elizabeth Warren For President",
      "url": "https://search.huffpost.com/click/_ylt=Awr9ImDmnqtd0J8ARa5sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571557222/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fworking-families-party-endorses-elizabeth-warren-2020-democratic-presidential-primary_n_5d7fa657e4b03b5fc8873fce/RK=2/RS=nyvXVZBYbI2umEDyLG1S_pd8EAs-",
      "subtitle": "The Working Families Party endorsed Sen. Bernie Sanders (I-Vt.) in the 2016 election cycle.",
      "author": "Daniel Marans",
      "content": " The Working Families Party, a leading progressive organization with roots in organized labor, announced Monday that it is endorsing the presidential bid of Sen. Elizabeth Warren of Massachusetts. The group’s backing provides a boost to Warren as she seeks to solidify her climb in the polls and replace Sen. Bernie Sanders, a Vermont independent, as the leading alternative on the left to former Vice President Joe Biden. “Senator Warren strikes fear into the hearts of the robber barons who rigged the system, and offers hope to millions of working people who have been shut out of our democracy and economy,” Maurice Mitchell, Working Families Party national director, said in a statement. “Our job now is to help Senator Warren build the mass movement that will make her transformational plans a reality.” As part of the group’s endorsement process, Mitchell grilled five presidential candidates ― Warren, Sanders, Sen. Cory Booker of New Jersey, former Housing Secretary Julián Castro and New York Mayor Bill de Blasio ― on live broadcasts that gave members the opportunity to submit questions or ask them live. Warren distinguished herself in her interview by, among other things, promising to repeal the 1994 crime bill authored by Biden. The group’s interview with Booker proved more contentious, with an extended discussion of his ties to controversial Garden State political bosses. Sen. Kamala Harris of California canceled her interview with the organization, citing a scheduling conflict, a decision that prompted the group to take her out of the running. The group had ruled out all but those six candidates based on their answers to a questionnaire. The endorsement, reflecting the views of 61% of Working Families Party members and leaders in a ranked-choice voting system, is a particularly sharp disappointment for Sanders, who picked up the group’s backing in the 2016 election cycle, but received just 36% of the vote from participating members this time around. The Sanders campaign’s political director, Analilia Mejia, is the former executive director of the New Jersey Working Families Party. Mitchell acknowledged Sanders’ role as a progressive trailblazer in his statement on the endorsement. “Senator Warren and Senator Sanders have both shaped the ideological terrain on which this campaign is being waged,” Mitchell said. “They have proven an effective team on debate stages and in the polls, and we hope that partnership continues. We’re proud to call both of them allies in the fight for a more just America.” The endorsement nonetheless drew skepticism from Sanders supporters, some of whom questioned the legitimacy of the endorsement process and talked of canceling their dues to the organization. Some Sanders supporters interpreted a Mitchell quote in The New York Times in which he warned against progressives who hoped to defeat moderate Democrats with “thought pieces or pithy tweets” as a dig at them. Mitchell denied that was his intention in an interview with HuffPost. “I was talking about the work all of us have to do to defeat the far right and the corporate forces who want to capture the Democratic nomination ― all those forces. We need to organize against them,” Mitchell said. ”I wouldn’t take this occasion to choose to settle a score against a candidate who I think is amazing and doing great work.” Mitchell acknowledged, however, that the endorsement causes pain to many Working Families Party members who are staunchly in Sanders’ corner and raises the challenge of moving forward as a unified bloc. “We knew that this would be a hard vote and that there would be folks who would be very disappointed. And that’s what happens when mature political organizations wrestle around really important decisions,” Mitchell said. ”We’re going to continue to organize and keep our eyes on the prize.” Mitchell and the Working Families Party also stand behind the fairness of the endorsement process. In the previous presidential election cycle, members of the group’s national committee ― the council of unions and grassroots groups that function as its key stakeholders ― held the vast majority of votes in the endorsement process. This year, activists who are not on the national committee ― both dues-paying members and supporters who do not pay dues ― were allotted half of the votes. The roughly 50 activist leaders representing grassroots organizations on WFP’s national committee had votes worth the other half of the total. And while activists who do not pay dues were permitted to cast ballots in the 2016 election cycle, Working Families Party claims it took specific steps to screen them this year, including through an email blast that required progressives to affirm their support for the group’s agenda and proceed through an online portal for voting. In total, about 10,000 people cast ballots, according to the group. The Working Families Party has neither demographic data about the participants in its endorsement process, nor insight into the rationale of activists who opted for Warren over Sanders. It likewise declined to provide a breakdown of votes for either candidate based on whether participants were activist leaders with privileged voting status, dues-paying members or mere sympathetic supporters. Mitchell said that, on a personal note, he appreciates Warren’s ability to communicate progressive ideas to a diverse array of people. “We need a candidate that can break down these concepts in ways that encourage a multiracial alignment of folks to defeat Trump and defeat neo-fascism and I think she’s uniquely positioned to do that,” he said. Warren’s endorsement last Monday of Kendra Brooks, a WFP candidate running for Philadelphia city council, swayed some members of WFP’s leadership with privileged voting status, according to a progressive strategist familiar with these leaders’ thinking. The Working Families Party was founded in 1998 by a coalition of New York labor unions and community organizations hoping to establish a progressive foothold within the Democratic Party-run politics of the Empire State. In New York, where the group retains its largest presence, progressive Democrats have the chance to run on its ballot line as well as that of the Democratic Party as a show of strength from the party’s progressive wing. As Working Families Party has matured, it has gotten bolder in its political stances and more distant from its roots in New York’s labor unions. A decision by the group to endorse Cynthia Nixon’s challenge to New York Gov. Andrew Cuomo in the 2018 Democratic primary at once prompted an exodus of nearly all of the labor unions backing the organization and freed it to chart a more independent path. Although New York remains its hub, the Working Families Party now has state-level affiliates in 13 other states and the District of Columbia, as well as local branches in four others. States with affiliates include the general-election battlegrounds of Pennsylvania and Wisconsin. The Working Families Party, which often sets up PACs to boost candidates it endorses in state and local elections, has yet to spell out exactly how it will use its resources to buttress Warren’s 2020 bid. Mitchell, who is African American and previously served as a leader of the Black Lives Matter movement, said that the group is well equipped to organize working-class voters and voters of color ― some of the very people polls suggest Warren has had difficulty attracting. Referring to these voting blocs, Mitchell said, “There are a number of communities that often do not get heard and get taken for granted, unfortunately by a lot of Democrats. It’s going to be our interest to lift them up.” The endorsement from a powerhouse of New York politics comes ahead of a rally Warren is holding in Manhattan’s Washington Square Park on Monday evening. The Warren campaign chose the site for its proximity to the Triangle Shirtwaist Factory, a sweatshop where a fire in 1911 killed 145 garment workers. Warren plans to discuss the resonance that the tragedy, which became a rallying cry for labor organizing in the city and across the country, has for her campaign and the movement she is trying to build. This article has been updated to include comments from Maurice Mitchell and details about the Working Families Party’s voting process.",
      "date": "09/16/2019 12:08 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "The Attack On Elizabeth Warren That Could Actually Matter",
      "url": "https://search.huffpost.com/click/_ylt=Awr9ImDmnqtd0J8AQ65sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571557222/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2felizabeth-warren-health-care-2020-democrats_n_5d856183e4b0957256b703de/RK=2/RS=QDq9iXwcgbGyxyEHhFLXBx51C7k-",
      "subtitle": "Warren is facing criticism from the left and center on voters’ No. 1 issue: health care.",
      "author": "",
      "content": "The attempt to pile on Elizabeth Warren has begun. The senator from Massachusetts, who has firmly joined Sen. Bernie Sanders (I-Vt.) and former Vice President Joe Biden in the Democratic presidential field’s top tier, has faced a barrage of critiques in recent days from campaigns who often claim she has received a free pass from the media. Many of these attacks happen without ever mentioning Warren’s name. Candidates ― including Biden, Sen. Cory Booker of New Jersey and Mayor Pete Buttigieg of South Bend, Indiana ― often talk about how Democrats need to have more than Warren’s signature policy plans in order to win. A staffer for Sen. Kamala Harris (D-Calif.) suggested Warren hadn’t done enough to help Democratic candidates in the 2018 midterms. (She donated $11 million to other candidates and progressive causes.) Others have been more direct: The always-colorful, oft-quoted former Pennsylvania Gov. Ed Rendell, a Biden surrogate, attacked Warren as a “hypocrite” for touting her decision not to hold high-dollar fundraisers after holding them in the past. But the attacks that could land the most damage focus on Warren’s trustworthiness on health care, the No. 1 issue for voters in both the Democratic primary and in the general election, according to polling. Though Warren has rolled her out own detailed policy plans on everything from gun control to child care to rural economic development, she is the only leading candidate to avoid releasing her own health care plan, instead endorsing Sanders’ “Medicare for All” legislation while saying she remains open to alternatives. The position has left her vulnerable to attacks from Sanders supporters as well as from opponents of Medicare for All, which would eliminate private health insurance and require the government to pay for Americans’ health coverage. Warren’s steady rise in the Democratic primary has come, in large part, from her ability to appeal to both the party’s mainstream and left-wing branches, but health care is an issue that could turn chunks of both groups against her and undercut her central image as a candidate with a brilliant idea for every problem. “I support Medicare for All. I think it’s a good plan,” Warren told CBS after the Sept. 12 Democratic debate in Houston when asked if she would roll out her own health care plan. But she quickly added: “I support a lot of plans, other things that people have come up with it. When they’re good plans, let’s do it. This isn’t some kind of contest, ‘I got to think of mine first.’ It’s about what’s best for the American people.” Buttigieg, appearing on CNN on Thursday, noted that Warren has avoided explicitly stating if she would support higher taxes on middle-income earners of the kind needed to fund a single-payer system. Two days earlier, during an appearance on “The Late Show,” Stephen Colbert was unable to pin Warren down on the need for higher taxes to fund Medicare for All. Warren instead stuck to her formulation that under her plan net “costs” would go down for the vast majority of Americans because of the elimination of out-of-pocket expenses. “Sen. Warren is known for being straightforward and was extremely evasive when asked that question, and we’ve seen that repeatedly,” Buttigieg said of Warren’s refusal to directly answer Colbert’s questions. “I think that if you are proud of your plan and it’s the right plan, you should defend it in straightforward terms.” (Buttigieg, who rolled out his own health care plan on Thursday, has said only that he would fund an expansion of health care coverage by closing corporate tax loopholes, without further details.) Biden echoed this line of attack during a Friday event in Cedar Rapids, Iowa, suggesting Warren and Sanders were hiding the effect of Medicare for All. “You can’t beat Trump by not being straightforward about what it’s going to do,” he told a voter who questioned why he wasn’t supporting Medicare for All. Buttigieg, along with Biden and other moderate Democrats, has long argued that Sanders’ and Warren’s stated preference for Medicare for All is politically unwise and would cause chaos for tens of millions of Americans with private health insurance. But the recent attacks have focused squarely on the question of tax increases. “It’s fundamentally dishonest, because for people’s pocketbooks, Medicare for All will be a tax decrease, and the people saying this know that,” said Adam Green, co-founder of the Progressive Change Campaign Committee and a prominent Warren backer. “It’s an insurance company and Republican talking point.” Green also claimed Warren’s “refusal to take the bait” was helping her with Democrats. “Republicans will inevitably make unfair attacks in the general election. We can’t live in fear of that. But we don’t need to give them Democratic validators.” Warren is a relatively recent convert to single-payer, signing on to Sanders’ legislation only in September 2017. Since then, she has continued to work on interim fixes to the private health insurance system. In March 2018, she backed legislation ― co-sponsored by Sanders ― designed to tighten regulations on private insurers and keep them in the Affordable Care Act exchanges. When she first began running for president, she discussed protecting Medicaid more than pushing for single-payer. But at the first Democratic debate on June 27, she made her stance clear: She was “with Bernie on Medicare for All,” including the elimination of private health insurance. Warren reiterated her stance in the two subsequent debates and an interview released earlier this month with dying progressive activist Ady Barkan. Barkan, who has his used his struggles with ALS to help illustrate the need for single-payer health care, specifically pressed her to explain her greater reluctance on the topic closer to the start of her campaign. “There are areas where markets just don’t work and a big part of health care is one of those,” Warren told Barkan. “So the idea that we could get a couple of regulations in place and it will sort itself out is just not true with health care.” One advantage for Warren is that the National Nurses United union, a major institutional backer of Medicare for All that endorsed Sanders in the 2016 cycle, has not yet endorsed in the 2020 presidential primary. Asked whether the union considered Warren’s stance adequate, NNU spokesperson Chuck Idelson would not respond directly, instead saying that if the union decides to endorse in the race, it will “certainly explain” how the endorsement is “consonant” with its priorities. But Warren’s remarks have failed to assuage left-wing Sanders supporters ― many of whom are associated with the Democratic Socialists of America or Jacobin magazine ―  who don’t think they can count on her to enact a policy they believe is the bedrock of a robust, contemporary welfare state. They point to small signals from Warren ― her failure to give the plan a prominent place on her campaign website or to give it more than a passing mention in most of her speeches ― as reasons to be skeptical. Natalie Shure, a leading Medicare for All advocate and dues-paying member of the Boston chapter of the DSA, argued Thursday on the popular left-wing YouTube show “The Majority Report” that Warren was not willing to “fight tooth and nail for a robust, single-payer, Medicare for All health care system.” In a follow-up interview with HuffPost, Shure said that Warren’s unwillingness to explicitly embrace the need for middle-class tax hikes to fund Medicare for All is emblematic of her tepidness on the matter. “She’s simultaneously trying to tap into the activist energy and enthusiasm that activists have spent years building for single-payer and Medicare for All … without forfeiting any of the plausible deniability or the support of people who wouldn’t want to go that far,” Shure said. That’s a distinction from Sanders, who has staked his presidential run on the ability to galvanize a social movement ― a “political revolution” ― capable of at least generating momentum behind Medicare for All, according to Shure. “She looks at her role differently than a Sanders presidency would look at his role,” Shure said. “He would lead a movement to get it, which I think is necessary for anyone who wants it. I don’t think she’d veto it if it came to her desk. She might even whip votes for it. But I don’t think she is going to reach outside of electoral politics for it.” Minnesota Attorney General Keith Ellison, a Sanders stalwart who carried the single-payer bill in the House, put it more gently. Warren “hasn’t eased up on it. She hasn’t wavered, gotten weak in the knees,” he said, referring to Warren’s recent remarks affirming her support for the policy. “But I think it means something that Bernie carried the bill, wrote the bill and has been fighting for it even before it was a popular thing.”",
      "date": "09/21/2019 08:00 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders Isn’t Worried About Splitting The Progressive Vote With Elizabeth Warren",
      "url": "https://search.huffpost.com/click/_ylt=Awr9ImDmnqtd0J8AQa5sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571557222/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fbernie-sanders-elizabeth-warren-split-vote_n_5d766b36e4b0fde50c2aaafa/RK=2/RS=OOky_K5ikjXqSBz3LOMf9qo.i0E-",
      "subtitle": "“I think there is a political process, and people will make their own choices,” Sanders told Yahoo News. “But I’m feeling pretty good about the future.”",
      "author": "",
      "content": "NEW YORK — In an interview with Yahoo News last Thursday, Sen. Bernie Sanders, I-Vt., brushed off the possibility that he and Sen. Elizabeth Warren could split the progressive vote, creating an easy path for former Vice President Joe Biden to win the Democratic presidential primary. As it stands now, polls show Sanders and Warren vying for second place behind Biden even though the combined bloc supporting the two progressives is larger than that of the ex-vice president. Sanders and Warren have broadly similar platforms. While there are some differences between their approaches, they both support Sanders’s signature Medicare for All public health care plan, large increases in spending to fight climate change, and programs to cut student debt and expand affordable housing. Biden has far more moderate positions, including a health care plan that would preserve private insurance and more modest spending to address climate change. And while Biden has called for increased education spending, unlike Warren and Sanders, he hasn’t backed plans to make public colleges fully tuition free and to eliminate large amounts of student debt. Sanders has said Biden doesn’t share his “vision” for the country. Still, when asked about the possibility that having two progressive candidates will end up dooming them both, Sanders offered a one word response. “Nope,” he said. “I think there is a political process, and people will make their own choices,” Sanders added. “But I’m feeling pretty good about the future.” The Vermont senator stressed that he is “confident” about his organization in key early states. “We’re a long way away from election day in Iowa. I think It’s about five months, and a lot can change. All I can say is that given the grassroots movement that we have in Iowa, in New Hampshire, Nevada, South Carolina, California, I’m feeling pretty good that we’re going to win those states,” said Sanders. While Sanders and Warren share similar policy goals, there are some indications their bases of support are quite different, and if one dropped out, the supporters wouldn’t necessarily migrate to the remaining candidate. But Sanders offered a message to any progressives who might be choosing between him and Warren. When asked about the distinctions between the two, Sanders emphasized his record and role in pushing the Democratic Party to the left since his last run for president in 2016. “What I would say is, if you look at the issues that folks are talking about today — not only candidates but people all over this country — that has a lot to do with my willingness four years ago to stand up to the political establishment, the economic establishment, the media establishment, and say, ‘You know what? Maybe we need policies and a government that represents all of us and not just wealthy campaign contributors,’” Sanders said. While Warren is mounting her first presidential campaign and doesn’t have as long a political career as Sanders, she was a prominent advocate for reducing income inequality during her prior academic career. Since she was elected to the Senate in 2012, Warren has, like Sanders, pushed for dramatic expansions to public education and health care programs. Sanders said he’s pleased other candidates are supporting aspects of his agenda, including universal health care, free public education and aggressive steps to fight climate change. “These are issues that I talked about in a very aggressive way. I am proud that other candidates are coming onboard,” Sanders said. “But I think that if you check my record, I have a life of standing up to the very powerful special interests and fighting for working people.” Yahoo News pressed Sanders on whether he was implying that he “paved the way” for Warren’s candidacy. “Well I don’t want to talk about Elizabeth Warren or anybody else; [it’s] not a question of paving the way. Everybody comes to their own views,” Sanders said. “All I can say is that for the last many decades, going back to when I was elected mayor of Burlington, my record has been standing up for working families, taking on powerful special interests and, in fact, achieving some real results.” Sanders, who has the largest number of individual donors so far, went on to say he’s “proud of the record that I have right now in putting together the strongest grassroots movement … for a political campaign this country has ever seen.” “That’s why I’m confident we’re going to win this election,” said Sanders.",
      "date": "09/09/2019 11:30 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders Pursues Joe Biden Voters As Primary Field Narrows",
      "url": "https://search.huffpost.com/click/_ylt=Awr9ImDmnqtd0J8AP65sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571557222/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fbernie-sanders-joe-biden-elizabeth-warren-voters-primary_n_5d7116fae4b0cdfe057b978a/RK=2/RS=063R1DVaylgZ6U8WwocnngPO_RE-",
      "subtitle": "Although he’s closest to Warren ideologically, Sanders believes voters who back Biden are the most persuadable.",
      "author": "Daniel Marans",
      "content": " Sen. Bernie Sanders (I-Vt.) and Sen. Elizabeth Warren (D-Mass.), who represent the Democratic Party’s more progressive wing, draw more frequent comparisons than any other 2020 primary candidates. News outlets have doggedly documented the two candidates’ subtle differences and, as Warren has climbed in opinion polls, have implied that her rise has come at Sanders’ expense. But the Sanders campaign does not see it that way. His aides argue that they are competing more heavily to win over voters who gravitate toward former Vice President Joe Biden, rather than Warren or any other candidate. Biden, the Sanders campaign believes, attracts the older working-class voters ― of all races ― with whom Sanders eventually gained traction in the 2016 election cycle. “Bernie appeals to younger working-class voters. Biden appeals to older working-class voters,” Ben Tulchin, the Sanders’ campaign’s chief pollster, told HuffPost. “The latter are some of the same voters Bernie won over last time. Our view is that we can win them back again, especially talking about his core economic message.” “When Bernie talks about a rigged economy propped up by a corrupt political system, that really resonates,” he added. In keeping with this approach, the Sanders campaign’s text messaging program has a specific response for voters who say they are supporting Biden. It also has a response for voters who say they are backing Sanders, but only a general response for cases where they say they are supporting any other candidate. The Sanders campaign, which claims to have sent 30 million text messages to voters, shared with HuffPost a text message that a volunteer sent a Nevada voter who said they were deciding between Sanders and Biden. “Thanks for letting me know!” the volunteer replied. “Did you know that Joe Biden told a room full of Wall Street billionaire donors that ‘nothing would fundamentally change’ if he became president? I’m for Bernie because he DOES think we need major change.” That pitch seemed to work. The voter eventually said they’d be backing Sanders. Biden did indeed tell a room full of wealthy donors that “nothing will fundamentally change” for them at a June fundraiser. His campaign maintains that Biden’s full remarks show he was saying that wealthy people would not need to give up their standard of living in order to enact policies that lift up all Americans. Whether one considers the volunteer’s texting appeal fair or not, it is a taste of the kind of contrast Sanders hopes to draw with Biden, who has deployed populist rhetoric about bridging the income gap but has often supported business-friendly policies and courted the party’s donor class over the course of four and a half decades in politics. (Neither Sanders nor Warren use private fundraisers to solicit big donations.) Trade is an area where Sanders believes he has a significant advantage over Biden with older working-class voters, particularly in industrial states like Iowa, a caucus state that hosts the first contest of the presidential primary on Feb. 3. Sanders voted against the North American Free Trade Agreement and permanent normal trade relations with China, which cost the United States blue-collar manufacturing jobs. Biden supported both. Sanders also opposed the Trans-Pacific Partnership, the now-defunct trade agreement that Biden promoted in his capacity as then-President Barack Obama’s vice president. Exit polling suggests that drawing a contrast with Hillary Clinton’s pro-free-trade record helped Sanders pull off a pivotal upset in the Michigan primary in March 2016. The campaign also sees Sanders’ plans to reduce the high cost of prescription drugs — which even voters on Medicare struggle to pay — and his long-standing support for expanding Social Security benefits as key selling points for older working-class voters. One of Biden’s main messages though, is that he’s the most electable candidate. He can win against Trump, he says, in part because he’s more moderate than Sanders and Warren. But Tulchin said voters concerned about electability tend to skew more educated and affluent, which are not the primary targets of Sanders’ class-centric message anyway. “The more upscale you go, the less well Bernie does,” he said. Tulchin emphasized that though Sanders believes he can win over some of the white working-class voters who voted for Obama in 2012 and subsequently switched to Trump, the campaign believes his message has appeal with working-class Black and Latino voters as well. The campaign is optimistic about Sanders’ chances in Nevada, where the disproportionately working-class Latino population makes up a large share of the electorate. (An average of public polls in the state nonetheless shows Sanders tied for second place with Warren.) Tulchin told HuffPost that public polling data so far supports the campaign’s view that Biden voters have a similar socioeconomic profile to Sanders voters. In a national poll conducted by Monmouth University in late August, Sanders came in first place among Democratic voters without a four-year college degree, with 24% support. He was followed by Biden, who had 18%, and Warren, who had 17%. In the same survey, Biden and Sanders both had similarly high favorability ratings among both college-educated and non-college-educated voters, while Warren had a favorability rating with college-educated Democrats that was 20 percentage points higher than among those without a degree. (Sen. Kamala Harris of California and South Bend, Indiana, Mayor Pete Buttigieg enjoyed a favorability edge among college-educated voters at least as large as Warren’s.) In addition, Morning Consult’s national poll in late August shows that Biden supporters would pick Sanders as their second choice and vice versa. But the public opinion research is vast enough that other polls offer contradictory data. For example, a late August poll released by Quinnipiac University found that Sanders trails Biden among Democrats earning less than $50,000 a year, and lags behind both Biden and Warren among white voters without a college degree. And a Pew Research Center poll from mid-August found that more Biden voters would pick Warren or Harris as their second choice than would pick Sanders. Neither the Biden campaign nor the Warren campaign responded to a request for comment for this story. Over Labor Day weekend, HuffPost interviewed 35 voters at three Sanders rallies in New Hampshire and Maine; a Warren rally in New Hampshire; and a Labor Day breakfast in Maine hosted by local labor unions. There was plenty of affinity for Biden ― and Warren ― amongst the Sanders supporters. Of the 15 Sanders supporters with whom HuffPost spoke, voters cited Biden as their second choice just as frequently as they named Warren. (Some, though, were unwilling countenance a Sanders loss. Others named other second-choice candidates.) Wayne McAllister, 30, who came to see Sanders in Raymond, New Hampshire, on Sunday with his wife Ryann, 24, volunteered for conservative Sen. Ted Cruz (R-Texas) in the 2016 election cycle. He got turned onto Sanders’ message ― and progressive politics more broadly ― after joining the Iron Workers Local 7 union, which endorsed Sanders in 2016. “His message is pretty much what the labor movement was, which is: power to the people, band together, take down corporations ― or at least keep them in check to make sure they don’t hold too many of the cards, that the worker still has a voice, that the worker still has a say in the matter of what happens,” McAllister said. And Biden would be his second choice, McAllister said, because he’s “one of the elder statesmen, been around for a while.” Joe Piccone, who works for Teamsters union Local 340 in Maine and attended the Labor Day breakfast in Portland, Maine, said he was backing Sanders because Sanders is a “pro-labor guy.” Biden is the only other person who Piccone said he feels confident would also fight for unions. Biden “has a track record with labor that I’m familiar with,” Piccone said. “That’s not being critical of Elizabeth Warren ― that’s saying I’m going with a known entity.” But in a clear example of why the Sanders campaign isn’t focusing on Warren supporters, just one of the 10 voters who told HuffPost they’re backing the Massachusetts senator said Sanders was their second choice. Lisa Wenger, a public school teacher who came to see Warren speak in Hampton Falls, New Hampshire, on Monday and said that Warren’s speech won her over, considers Sanders “too far left.” Asked what she makes of people who liken Warren to Sanders, Wenger said, “That’s just a bunch of meshugas.”",
      "date": "09/05/2019 01:38 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders: ‘Hurricane Dorian Has Everything To Do With Climate Change’",
      "url": "https://search.huffpost.com/click/_ylt=Awr9ImDmnqtd0J8APa5sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571557222/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fbernie-sanders-hurricane-dorian-has-everything-to-do-with-climate-change_n_5d6ec73ae4b011080455f988/RK=2/RS=EAozE3AgcQ7PeNMUwgbRfC3KdK4-",
      "subtitle": "The Democratic presidential candidate warned of global warming’s potential contribution to the storm’s development.",
      "author": "Amy Russo",
      "content": " Sen. Bernie Sanders (I-Vt.) on Tuesday pointed to global warming as a major cause of Hurricane Dorian, which has pummeled the Bahamas with devastating winds and massive flooding and is slowly churning toward the coast of Florida. In a tweet, the Democratic presidential candidate slammed the fossil fuel industry for wreaking havoc on the environment, arguing that it “creates death and destruction, then spends billions denying its responsibility.” “Let us be clear: Hurricane Dorian has everything to do with climate change, which is the existential crisis of our time,” he added. Sanders’ remarks were spurred by a New York Times op-ed on worsening hurricanes, which was shared by the New Consensus, a liberal think tank helping to develop the Green New Deal. Sander’s is a co-sponsor of a version of the Green New Deal. which proposes a broad range of environmental and economic initiatives and has been closely linked to freshman Rep. Alexandria Ocasio-Cortez (D-N.Y.). As of Tuesday, Dorian had wound down from a Category 5 storm to a Category 2. It was initially able to gain significant force by feeding on warm ocean waters. Though it may be too early to determine the exact impact of climate change on the hurricane’s development, the warming of the planet’s oceans seems to have fueled upticks in the intensity of hurricanes. According to the National Oceanic and Atmospheric Administration, more than 90% of Earth’s warming over the last 50 years has occurred in the planet’s oceans, where heat is absorbed much more readily than on land. The 2018 National Climate Assessment, published by the federally mandated U.S. Global Change Research Program, pointed to the rise in greenhouse gasses as a contributing factor in triggering hurricane activity in the Atlantic Ocean region. It also attributed the intensity of the 2017 Atlantic hurricane season to “a combination of natural and human-caused” elements. That year’s hurricanes included Harvey, Irma, Jose and Maria ― each of which reached Category 5 or 4 intensity.",
      "date": "09/03/2019 07:25 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie World Is Starting To Go After Elizabeth Warren",
      "url": "https://search.huffpost.com/click/_ylt=Awr9ImDmnqtd0J8AO65sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571557222/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fbernie-sanders-campaign-elizabeth-warren-progressive_n_5d8bcfdce4b0019647a279bb/RK=2/RS=SHOc9eI7n4XeZ29TAX8teplqMXs-",
      "subtitle": "Bernie Sanders supporters are questioning Warren’s progressive bona fides — and for the first time, the campaign is going along with it.",
      "author": "Daniel Marans",
      "content": " As Sunday turned to Monday, Briahna Gray, national press secretary for Sen. Bernie Sanders’ presidential campaign, posted a series of criticisms of Sen. Elizabeth Warren (D-Mass.) on Twitter. Gray began with subtlety, highlighting a speech the Vermont senator gave on the House floor in the 1990s in support of gay military veterans and service members. And, in what appeared to be a subtweet at Warren, she noted that Sanders delivered the speech at a time when “your fave was still ‘evolving’ (read ‘triangulating’) on gay rights.” (In a follow-up conversation, Gray would not say to whom she was referring when she said “fave.” Warren supported same-sex marriage during her first Senate run in 2012, prior to former President Barack Obama’s “evolution.”) Next, Gray noted that under Sanders’ pro-union legislation, Warren’s campaign would be forced into mediation for failing to reach a collective bargaining agreement so many months after recognizing its campaign staff’s union. Finally, in a post shortly after midnight, Gray slammed Warren’s refusal to endorse a national rent control law, echoing a critique voiced earlier in the weekend by left-wing activists. She suggested that it contradicted Warren’s self-described can-do attitude toward other ambitious policies. Gray’s comments in themselves were not out of the ordinary. Sanders campaign aides are notoriously feisty and independent on social media ― a marked contrast with the boringly disciplined etiquette of other campaigns’ staffers. But when HuffPost reached out on Monday to clarify whether Gray’s remarks were part of a shift toward more explicit confrontation with Warren, the campaign directed HuffPost to Gray, who stood by her remarks. “Primary campaigns are about drawing contrasts between candidates so that voters can make an informed choice between them,” Gray said in a statement. Sanders and Warren reportedly struck a non-aggression pact in December prior to launching their respective campaigns. The much-vaunted détente survived two nationally televised debates in which the two contenders shared a stage. They eschewed the moderators’ efforts to drive a wedge between them in favor of teaming up against moderate rivals. Even in the course of a conversation about this article, the Sanders campaign wanted to emphasize his high regard for Warren. “Sen. Sanders respects Sen. Warren and values his friendship with her,” Mike Casca, a senior communications adviser for the Sanders campaign, said in a statement. “They’ve been longtime allies in fighting to improve the lives of working Americans.” But though Sanders himself has yet to criticize Warren, his aides and surrogates have been taking gradually bolder shots at the Massachusetts senator. The non-aggression pact is fraying. Gray’s remarks follow more implicit steps in this direction by other Sanders lieutenants. Amid left-wing uproar over the Working Families Party’s endorsement of Warren, top Sanders spokesman Mike Casca gave his blessing to calls for the WFP to release a breakdown of its endorsement vote that would show whether the group’s national delegates overrode the will of pro-Sanders dues-paying members and activists. The following day, when Sanders received his millionth donor, Sanders campaign manager Faiz Shakir noted that Sanders is the only candidate to rule out high-dollar private fundraisers for the primary as well as the general election. The observation was a veiled ding at Warren, who has said that in the interest of defeating President Donald Trump, she would resume courting wealthy donors during the general election. Just a few weeks ago, HuffPost reported that the Sanders campaign saw supporters of former Vice President Joe Biden as riper targets for persuasion. The campaign had a custom-made text message response for Biden backers, but only a generic one for voters leaning toward other candidates. But Warren’s rise, reflected in everything from the WFP endorsement to new polling showing her winning more of Sanders’ 2016 voters than Sanders himself, has raised the specter of her supplanting Sanders as the go-to progressive alternative to Biden. The campaign aides’ jabs at Warren, however tame and haphazard, provide an official imprimatur to a broader argument that Sanders surrogates and partisans have been making more openly for some time: that Warren’s progressive bona fides are questionable and that she is a flawed general election candidate. Below is a summary and explanation of their various claims against her. The Warren campaign declined to comment for this story. The most recent pile-on against Warren kicked into gear over the weekend when she addressed the Iowa Center for Community Improvement Action Fund’s candidate forum in Des Moines, Iowa. An activist pressed Warren on whether she would back national rent control legislation, which would cap annual rent increases across the country. Warren said that she would fight to ensure that localities are free from state laws that prevent them from pursuing rent control on their own, but would not back a national rent control law. “Writing a rent control plan in Washington may work for Chicago, but it’s not gonna work for Iowa City or it may not work for Dallas,” she said. Warren introduced an affordable housing bill in March that would allot $10 billion in grants that cities and regions could compete for, provided that they end restrictive land-use policies. It would also give cities that enact tenant protections like rent control opportunities for additional cash. “My administration will also take whatever legal steps it can to stop states from preempting local efforts to enact tenant protection laws,” she wrote in a Medium post outlining her housing plans. Warren would also invest $500 billion in building or restoring affordable housing ― a figure she pays for by restoring the estate tax to its 2009 level. And she wants to create a home-buying assistance program for first-time buyers in historically redlined neighborhoods to narrow the Black-white wealth gap. Sanders, by contrast, would cap all annual rent increases at the higher of either 3% or 1.5 times the rate of inflation. Cities would be able to go further and landlords could apply for exemptions from the rule if they make major capital investments in a property. For some left-wing activists, particularly those living in expensive cities, making rent control “universal” ― or at least expanding it ― has become a priority nearly as urgent as achieving single-payer health care. Rep. Alexandria Ocasio-Cortez of New York, who volunteered for Sanders in 2016, introduced a rent control bill on Wednesday that also caps rent hikes at 3%. As a result, a video of Warren’s exchange with the activist in Iowa posted by California-based labor organizer Brett Banditelli sparked biting criticism of Warren on social media. For example, Cea Weaver, who helped pass New York state’s new rent regulations, suggested that Warren’s lack of interest in national rent control reflected an elitist reliance on economic orthodoxy. Gray, the Sanders campaign aide, embedded Banditelli’s video in her critical tweet as well. “Bernie says yes to [national] rent control [because] we can, we should, & we must,” she wrote. Analilia Mejia, the Sanders campaign’s political director, also highlighted the contrast between the two candidates’ platforms on Twitter. “There just isn’t a comparison,” she wrote. Beginning with the first Democratic presidential debate in June, Warren has repeatedly affirmed her support for Sanders’ single-payer “Medicare for All” health care legislation. When pressed about the bill’s prohibition on all but very limited forms of private health insurance ― a provision that has stirred the most political jitters ― Warren has endorsed it time and again. Two presidential rivals, Sens. Kamala Harris of California and Cory Booker of New Jersey, have, by comparison, backed away from Sanders’ bill despite co-sponsoring it in the Senate. But some Sanders partisans note that Warren, a recent convert to the Medicare for All cause, still has not made it a major feature of her stump speech. She barely mentions the policy unless she is asked about it, and she has refused to explicitly say she would back middle-class taxes to pay for it. That has raised fears that Warren would not fight for it once in office, which Medicare for All proponents consider a prerequisite for its eventual passage. “She’s simultaneously trying to tap into the activist energy and enthusiasm that activists have spent years building for single-payer and Medicare for All … without forfeiting any of the plausible deniability or the support of people who wouldn’t want to go that far,” Natalie Shure, a member of the Boston chapter of the Democratic Socialists of America, told HuffPost. During a campaign event Wednesday in New Hampshire, Warren sparked a new round of skepticism when she described Sanders’ “Medicare for All” legislation, which she has co-sponsored, as a “framework.” “What we’ve got in Medicare for All is a framework, and it doesn’t have the details, and you’re right to be asking, but the most important part of your asking is to raise awareness so we get this right as we go through it,” Warren said. The remark prompted a swipe from Sanders’ senior adviser Warren Gunnels, who disputed Warren’s word choice on Twitter. Medicare for All “isn’t a framework. It’s a 100-page bill,” he wrote. Bernie World skepticism of Warren’s support for Medicare for All is rooted in a broader suspicion of her more recent arrival at stances Sanders has held for decades. They argue that she is less trustworthy in general because she has admitted to being a registered Republican until the mid-1990s. (Her research into the struggles of families declaring bankruptcy prompted her to leave the GOP, according to Warren.) Susan Sarandon, an Oscar-winning actor and prominent Sanders campaign surrogate, caused a stir in August when she took a veiled swipe at Warren while introducing Sanders at a campaign event in Iowa. Sanders, she said, “is not someone who used to be a Republican. He is not someone who used to take money — or still takes money — from Wall Street. He is the real deal.” Sarandon’s remarks about taking money from Wall Street might refer to Warren’s courtship of wealthy donors, including some from the financial world, during her 2018 Senate reelection campaign. She transferred over $10 million left over from that campaign to her presidential run before announcing that she would shun the fundraisers during the Democratic primary. (Warren’s campaign has noted that big-ticket fundraisers accounted for only one-quarter of her total haul in 2017 and 2018.) John Cusack, another actor backing Sanders, introduced him at a rally on Tuesday in Chicago with members of several of the city’s public-sector labor unions. He has echoed Sarandon’s attacks on Warren’s Republican past. “No ones [sic] been more consistent then [sic] Bernie for justice,” he tweeted on Monday night. “Warren was a republican as an adult -  glad she figured out supply side economics was a hustle - but come on.” In addition to their policy and ideology-based arguments that Warren is not radical enough, prominent Sanders supporters are also claiming that she is less competitive against Trump in a general election. The argument is twofold: First, they point to Warren’s style on the stump and lower rates of support among Democrats without a college degree as evidence that she would have difficulty in a general election. Sanders had a narrow edge among voters with less than a college degree in an August poll conducted by the Pew Research Center, while Warren had a commanding lead over him among voters with advanced degrees. (Biden held the lead for voters at every education level except those with advanced degrees.) Krystal Ball, a co-host of Hill TV’s digital show “Rising,” made the case on Monday that Warren’s appeal is stronger among more educated and successful Democrats because her focus on “plans” appeals to their meritocratic faith in common-sense problem-solving. Warren’s failure to resonate with working-class voters despondent in the country’s institutions make Ball “terrified” that Warren will lose to Trump, the pro-Sanders commentator said. “‘I’ve got a plan for that’ is like a magical elixir to” highly educated Democrats, Ball said. “It says, ‘The experts have been consulted, the white paper has been drafted. We the ascenders of the meritocracy will decide what is to be done about these poor, struggling denizens of the working class.’” Ball’s characterization of Warren is not entirely accurate. She regularly denounces the political and economic system for being “rigged” in favor of the super-rich, and has lionized grassroots movements like the one that emerged from the tragic fire at the Triangle Shirtwaist Factory in 1911 as models for the kind of structural change she hopes to usher in. And some analysts have noted that newcomers tend to fare worse among working-class voters at the start of primary contests, because those voters follow the news less consistently. When those candidates go on to win their party’s presidential nomination and the general election though, working-class voters have tended to come along. Former President Barack Obama, for example, trailed Hillary Clinton with white working-class voters for much of the primary, but thanks to a populist message, ultimately won enough of their votes to prevail twice in states like Ohio. The second line of attack that Sanders supporters raise against Warren is their objection to her past identification as a Native American in various informal legal settings. Warren has apologized for producing a DNA test in October that showed she likely had traces of Cherokee heritage. She has also affirmed that she is not a person of color. But for some Sanders supporters, who appear to consider the dustup an electoral liability, Warren’s apology is not enough. In a Twitter thread earlier this month, Josh Fox, an anti-fracking activist and filmmaker backing Sanders, said Warren’s identification as Native American “when she was actually a descendent of colonialists is a huge self-inflicted mistake.” Fox went on to incorrectly assert that Warren had not even apologized. (In fact, she has apologized for the DNA test, as well as identifying as Native American in various professional legal listings.) “Why isn’t owning a mistake like this possible? I think it would make her more sympathetic and more human to be honest,” he wrote. “If she just said- ‘hey I was wrong about this, and I am being bullied by Donald Trump and etc.’” This piece has been updated with more information about Warren’s proposed affordable housing bill.",
      "date": "09/26/2019 05:45 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders Pokes Fun At His Own Fashion Sense: ‘Actually, It’s Kohl’s’",
      "url": "https://search.huffpost.com/click/_ylt=Awr9ImDmnqtd0J8AOa5sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571557222/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fbernie-sanders-fashion-kohls_n_5d89b3f1e4b0c2a85cb03805/RK=2/RS=m29dK7yBKWhroHZIln9mnV7w2FU-",
      "subtitle": "The 2020 Democratic candidate corrected a supporter who said he looked like he was wearing “about $250 worth of J.C. Penney.”",
      "author": "Josephine Harvey",
      "content": " Sen. Bernie Sanders (I-Vt.) is happy to acknowledge he’s no fashionista. A supporter at a Monday town hall event in Decorah, Iowa, spoke up after Sanders asked the audience to share thoughts on income, wealth and equality, pointing out the dramatic difference in wardrobe choices of the Democratic 2020 candidate and President Donald Trump﻿. “Bernie, I noticed your suit, and I made a comment on Facebook about what people wear and how you notice the racial or class divide in people.” “I’m sorry, but an Armani suit is about $2,000 and you look like you’re wearing about $250 worth of J.C. Penney,” he said. “Actually, it’s Kohl’s,” Sanders interrupted, prompting a loud cheer from the audience. The man went on to slam Trump for his lavish lifestyle, saying “no one I know has a $250 million boat like Donald Trump, nobody eats a $700 plate of food every day, and nobody has a $2,000 suit, and nobody wants one. He’s ridiculous.” Sanders appeared at the event during four days of campaigning in Iowa. He addressed health care, climate change, criminal justice reform and early childhood education. He also criticized the president for greed and corruption. Watch a clip of the exchange below:",
      "date": "09/24/2019 07:05 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Stephen Colbert Reveals The Real Reason Behind Bernie Sanders’ Heart Procedure",
      "url": "https://search.huffpost.com/click/_ylt=Awr9CKr9nqtdqhQAYQNsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571557245/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fstephen-colbert-bernie-sanders-heart-procedure_n_5d95846fe4b0da7f66217708/RK=2/RS=LgMNEp0khVEb0Z3i3ngYYJodTDM-",
      "subtitle": "“Senator, get well soon!” The “Late Show” host said.",
      "author": "Josephine Harvey",
      "content": " Sen. Bernie Sanders (I-Vt.) underwent an emergency heart procedure on Tuesday evening, and Stephen Colbert has a theory about how it was possible. “He was hospitalized for treatment of an artery blockage,” “The Late Show” host said. “It’s what happens when people want a president who has a heart.” Sanders was hospitalized following a campaign event on Tuesday and doctors inserted two stents. His campaign released a statement saying he was “conversing and in good spirits” but would be resting over the coming days. Colbert also joked about Sanders’ appearance on the show a week earlier, during which he had “knocked on wood” about his health. Watch the “Late Show” segment below to hear the punchline:",
      "date": "10/03/2019 02:48 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Larry David Kills As Bernie Sanders In Spoof Town Hall On ‘Saturday Night Live’",
      "url": "https://search.huffpost.com/click/_ylt=Awr9CKr9nqtdqhQAXwNsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571557245/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2flarry-david-bernie-sanders-snl-democratic-presidential-forum-spoof_n_5d903870e4b0e9e7604df8e8/RK=2/RS=urjdGxFRkEBv3IE0v7ExSoKANys-",
      "subtitle": "And Woody Harrelson’s Joe Biden soothes: “Daddy’s here, America. I see you, I hear you, I sniff you, and I hug you from behind.”",
      "author": "Mary Papenfuss",
      "content": " Comedian Larry David reprised his role as Sen. Bernie Sanders (I-Vt.) in an “Impeachment Town Hall” on the season premiere of “Saturday Night Live” — and it was hard to believe he wasn’t the real senator. David looked like Sanders, even sounded like him — just funnier. “Hello everyone,” he said. “I’m so excited to be back and to ruin things a second time!” He skewered a slow-talking Joe Biden (played by host Woody Harrelson), noting: “Remember when everyone thought I was going to be the one who seemed out of touch? This guy makes me look like Drake.” He wound up his pitch offering: “Free college, free healthcare, free refills on any medium-sized soft drink.” He added: “Last time my slogan was ‘feel the Bern.’ This time it’s ‘Let’s burn this place to the ground.’” Harrelson’s Biden soothed: “Daddy’s here, America. I see you, I hear you, I sniff you, and I hug you from behind.” Kate McKinnon resurrected her Sen. Elizabeth Warren (D-Mass.) impression. “I hope you guys all enjoyed hot-girl summer, because it’s school-librarian fall,” she said. “I have the energy of a mother of five boys who all play a different sport.” Maya Rudolph, a former “SNL” cast member, as Sen. Kamala Harris (D-Calif.) described herself as “America’s cool aunt, a fun aunt, I call that a ‘Funt’ ... the kind of Funt that will give you weed but then arrest you for having weed.” New cast member Chloe Fineman did a spacey turn as candidate Marianne Williamson who discussed her strategy for impeachment. “Here’s how I will impeach Donald Trump: I will trap his soul inside this crystal,” she explained. “So this election, vote for magic.” Alex Moffat played former Democratic Rep. Beto O’Rourke; new cast member Bowen Yang was Andrew Yang; Chris Redd played Cory Booker; and “Weekend Update” host Colin Jost made a rare sketch appearance as Pete Buttigieg. Check them all out in the video above.",
      "date": "09/29/2019 02:06 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders Rolls Out Plan To Curb CEO Pay",
      "url": "https://search.huffpost.com/click/_ylt=Awr9CKr9nqtdqhQAXQNsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571557245/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fbernie-sanders-income-inequality-plan-tax-ceo-pay-2020-democratic-presidential-primary_n_5d911c28e4b0e9e7604ea6ef/RK=2/RS=Llf6wCcHR_zygFgQDbp1CQhSqYs-",
      "subtitle": "The Vermont senator would increase taxes on companies where CEOs earn more than 50 times the median worker.",
      "author": "Daniel Marans",
      "content": " Sen. Bernie Sanders (I-Vt.) released an “income inequality tax plan” on Monday that would increase taxes on big companies where CEO pay is more than 50 times higher than that of the median worker. Sanders, a fierce critic of income inequality who is seeking the Democratic presidential nomination, identifies the explosion in compensation for top corporate executives as a key factor depressing ordinary workers’ wages. “At a time of massive income and wealth inequality, the American people are demanding that large, profitable corporations pay their fair share of taxes,” Sanders said in a statement accompanying the plan. “It is time to send a message to corporate America: If you do not end your greed and corruption, we will end it for you.” Sanders’ proposal, which applies to publicly and privately held companies with annual revenue of $100 million or more, would increase companies’ corporate tax rate by 0.5 percentage points if their CEO received compensation worth between 50 and 100 times what the company’s median employee earned. The higher a company’s CEO-to-median worker pay ratio would go, the higher the surtax it would endure under Sanders’ plan. The legislation would levy a 1-point tax hike on companies with CEO-to-median worker ratios between 100-to-1 and 200-to-1; a 2-point tax hike for those with ratios between 200-to-1 and 300-to-1; a 3-point tax hike for those with ratios between 300-to-1 and 400-to-1; a 4-point tax hike for those with ratios between 400-to-1 and 500-to-1; and a 5-point tax hike for those with ratios of more than 500-to-1. CEO pay has exploded relative to the compensation received by ordinary workers in the past few decades. In 2018, the average CEO-to-median worker pay of a corporation in the S&P 500 index was 287-to-1, according to an AFL-CIO analysis of data collected by the federal government. Prior to the 1970s, the gap between executive pay and that of ordinary workers at their companies was dramatically narrower. CEO compensation, including stock options, at the biggest 350 firms grew 940% since 1978, even as typical worker pay climbed just 12% over the same period, according to an analysis by the Economic Policy Institute. The EPI analysis, which looks at average, rather than median, worker compensation, found that the CEO-to-average worker pay ratio went from 20-to-1 in 1965 to 58-to-1 in 1989 to 278-to-1 in 2018. The Institute for Policy Studies, a left-leaning Washington think tank, released a report documenting high CEO pay on Monday as well. The report found that at 50 publicly-traded companies with the highest CEO-to-median worker pay gaps, the median worker would have to work 1,000 years to earn the CEO’s pay. The Sanders campaign estimates that if companies increased median worker pay to $60,000 a year and capped CEO pay at $3 million, no company would pay additional taxes under his plan. Assuming that corporate behavior does not change, however, the plan would raise an additional $150 billion in revenue over a 10-year period, which Sanders would use to fund his plan to cancel Americans’ $81 billion in medical debt. “The American people are sick and tired of corporate CEOs who now make 300 times more than their average employees, while they give themselves huge bonuses and cut back on the healthcare and pension benefits of their employees,” Sanders said. “They want corporations to invest in their workers, not just dividends, stock buybacks and outrageous compensation packages to their executives.” A February 2016 survey conducted by Stanford University broadly affirms Sanders’ suggestion that his proposal is popular. The poll found that while Americans usually underestimate how much CEOs get paid, nearly two-thirds ― 62% ― support capping their compensation, though just 49% said they wanted changes to come through government intervention. Sanders is locked in something of an arms race of economic populism with Sen. Elizabeth Warren of Massachusetts, who now leads him in public Democratic primary polls of Iowa and New Hampshire. Last week, Sanders unveiled a plan to tax the wealth of the richest 0.1% of households at gradually increasing rates. It goes considerably further than a proposal Warren released in January, prior to Sanders’ entry in the race, that would impose a 2% tax on wealth above $50 million. Although Warren has not proposed a similar plan to tax CEO pay, legislation she introduced in August 2018, the Accountable Capitalism Act, would, among other things, require corporations to allow employees to elect 40% of corporate board members. The change could reduce CEO pay by giving workers a greater say in executive compensation.",
      "date": "09/30/2019 08:00 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Surging In The Polls, Elizabeth Warren Sets Her Sights On California’s Primary",
      "url": "https://search.huffpost.com/click/_ylt=Awr9CKr9nqtdqhQAWwNsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571557245/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2felizabeth-warren-2020-california_n_5d975434e4b0f5bf79739c81/RK=2/RS=T17qibYlESL2NhtAQIXDvzSFZNU-",
      "subtitle": "The Massachusetts senator is picking up steam in the Golden State as home-state Sen. Kamala Harris’ polling numbers tumble.",
      "author": "Igor Bobic",
      "content": " SAN DIEGO ― A new poll confirms that a tight three-way race is developing in California’s key Democratic presidential primary, with one candidate showing impressive momentum: Sen. Elizabeth Warren of Massachusetts. A survey released Thursday by the Public Policy Institute of California showed Warren the choice of 23% of likely primary voters, with former Vice President Joe Biden at 22% and Sen. Bernie Sanders (I-Vt.) at 21%. When the Democratic race was first taking shape in the spring, a Quinnipiac Poll had shown Warren in single digits in the Golden State, far behind Biden, Sanders and California Sen. Kamala Harris. Indeed, as Warren’s support has surged in California ― as it has nationally ― the prospects for Harris in her home state have taken a hit, again reflecting national trends. Perhaps the new poll’s most striking finding is that Harris trailed well behind the pack with just 8% support, another sign of trouble for her struggling campaign. “Warren may well be a beneficiary of Harris’ collapse,” said veteran California Democratic strategist Garry South. “Since her very impressive debut (as a White House candidate) in Oakland in January, Harris has done little in California to solidify whatever support may have been potentially there for her.” Voters like Cindy Henderson, an author who showed up to hear Warren speak Thursday as the candidate made her first campaign stop in San Diego, give a glimpse into the race’s current dynamics. “I was actually a Kamala fan,” Henderson said. “Just something in the last two or three months, I’m just kind of dropping off [on her]. I think she’s not quite ready. I just don’t think there’s much depth yet. The more I hear and watch what Elizabeth does, it’s just like, OK, she’s a rock star. I’m loving her message.” Warren drew about 8,500 people for her rally in downtown San Diego. (A rally for Sanders was attended by an estimated 6,400 people at the same venue in May). Like most of Warren’s audiences, her Thursday crowd was predominantly white ― which aligns with how her support breaks down in public opinion surveys, as well. A UC Berkeley Institute of Governmental Studies poll released in late September showed her leading the California race with 29%, with Biden at 21% and Sanders at 20%. But Warren trailed both of those two with Latino voters. Warren mostly stuck to her populist stump speech on Thursday, laying out her plans to take on Washington corruption, special interests and big corporations. She appeared to choke up at one point as she recalled the family struggles that marked her childhood in Oklahoma, including the time her mother lost her job. The story is a big hit with many voters, who cite it when discussing the candidate. At one point, after discussing her plan to break up big tech companies, Warren called out Facebook CEO Mark Zuckerberg, who told employees in recently leaked audio the company would “go to the mat” to defeat her efforts. “And yes, Mark Zuckerberg, I’m looking at you,” she said, to cheers and applause from the audience. The true contours of the Democratic battle will emerge in February when the narrative-driving nominating contests in Iowa, New Hampshire, Nevada and South Carolina take place. But right around the corner comes primaries in 14 states on March 3, Super Tuesday. And California is the day’s dominant contest, with 416 convention delegates allotted. That’s why so many of the main Democratic contenders are paying frequent visits to the state to meet with voters ― as well as well-heeled donors. Also, early mail-in voting begins a month before the actual primary date. And conquering California presents unique challenges for a politician: its population is decidedly more diverse than that in the earlier-voting states, campaign ads are far more expensive than in those other locales and gaining media attention is difficult. In terms of having the money to compete, Warren and Sanders are well-primed as the race enters the final stretch before primary season. Warren raised $24.6 million in the third quarter, her campaign told supporters in an email Friday, and has $25.7 million cash on hand. Sanders, hospitalized earlier this week in Nevada because of a blocked artery, raised $25.3 million from July to September (his campaign didn’t release a cash-on-hand figure). Their figures are especially impressive because both candidates have opted against holding fundraisers focused on big-dollar donors during the primary campaign. Biden’s campaign, meanwhile, reported a lackluster $15.2 million raised over the past three months, far less than his second-quarter haul of $21.5 million. He could be in trouble if his fundraising continues to taper off. President Donald Trump’s re-election campaign and the Republican National Committee announced raising a combined $125 million in the third quarter, a record-setting haul. His war chest will only grow as Democrats spend several months ― and maybe more, in the case of a lengthy primary battle ― determining their nominee. Warren dismissed Trump’s haul on Thursday, telling reporters she didn’t think “scooping up a bunch of money from rich people and buying a bunch of TV ads” is “how democracy works anymore.” She added: “I think it’s going to be about going out and building a grassroots movement.” Given Warren’s steady rise in the primary race, the Oct. 15 Democratic debate in Westerville, Ohio, looms particularly large for her. As the frontrunner in several of the race’s most recent national polls, she’ll likely have a bigger target on her back. Even as Warren received enthusiastic backing at her San Diego rally, interviews with some of the undecided voters at it underscored some of the doubts she still most overcome. Corinne Lytle-Bonine, an environmental consultant who voted for Sanders in the 2016 Democratic primary, acknowledged she was giving Warren a strong look this time around. “Having the nomination be another old white man is a hard pill to swallow when it feels like women have been the ones really carrying the Democrats through 2018,” Lytle-Bonine said. She added that “I think Warren has some establishment credentials that Bernie doesn’t, and may make her more electable in the general election.” Still, Lytle-Bonine questioned why Warren has been hesitant to acknowledge whether the middle class would see a tax hike if, as president, she would push into law “Medicare-for-All” government health care plan Sanders has introduced and that she supports. Several of Warren’s rivals have criticized her for repeatedly dodging the question; she’s brushed off the attacks as unfair Republican framing. “I wish that she would” directly deal with that issue, Lytle-Bonine said. “I guess I don’t know what is holding her back. I don’t think it’s a hard answer to say ‘Yes, we’ll raise taxes, however, all of your out-of-pocket expenses (for health care) go away.’”",
      "date": "10/04/2019 05:20 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Elizabeth Warren Raises $24.6 Million In 3rd Quarter, Trailing Only Sanders",
      "url": "https://search.huffpost.com/click/_ylt=Awr9CKr9nqtdqhQAWQNsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571557245/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2felizabeth-warren-raises-24-6-million-in-third-quarter-trailing-only-sanders_n_5d9746cfe4b0da7f662578df/RK=2/RS=g0SeAFh1Kw6l2IGR82Uq6RL_Y3c-",
      "subtitle": "The Massachusetts senator’s presidential campaign now has $25.7 million on hand.",
      "author": "Kevin Robillard",
      "content": " Massachusetts Sen. Elizabeth Warren raised $24.6 million in the third quarter, her campaign told supporters in an email Friday, and now has $25.7 million to spend as the 2020 Democratic race enters its final stretch before primary season. The haul is second only to fellow progressive Sen. Bernie Sanders (I-Vt.) among contenders for the Democratic presidential nomination. Sanders raised $25.3 million from July to September, while former Vice President Joe Biden raised just $15.2 million. South Bend, Indiana, Mayor Pete Buttigieg, who trails the other top fundraisers by significant margins in public polling, raised just over $19 million. “This means our grassroots movement is in an incredible position — to double down on our investments in grassroots organizing, to keep getting Elizabeth’s plans for big, structural change in front of more caucus-goers and voters, and to bring more people into this fight,” campaign manager Roger Lau wrote. It is all but certain that Warren and Sanders ― two left-leaning progressives who have chosen to bypass high-dollar fundraisers during the campaign ― will be the two candidates with the most successful third quarters. Warren, in particular, faced skepticism over her decision to bypass high-dollar fundraising ― an area where she had excelled prior to the 2020 presidential race. “Elizabeth didn’t sell her time to wealthy donors, over the phone or in person at closed-door fundraisers,” Lau wrote. “Instead, she got to spend her time traveling across the country, hosting town halls, taking tens of thousands of selfies, and hearing directly from people about what’s on their minds.” Warren, whose steady rise now has her essentially tied with Biden in most public polling, had 943,000 donations from 509,000 different individual donors. The average donation was $26, and the campaign said more than 300,000 people donated for the first time during the third quarter. Among lower-tier candidates, California Sen. Kamala Harris raised $11.6 million, Andrew Yang raised $10 million and New Jersey Sen. Cory Booker raised $6 million. Other candidates, including former Texas Rep. Beto O’Rourke, have not yet released their fundraising totals. President Donald Trump’s reelection campaign said that it and the Republican National Committee ― which can collect much bigger checks than the individual Democratic contenders ― raised more than $125 million in the third quarter.",
      "date": "10/04/2019 10:52 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders Hospitalized For Emergency Heart Procedure",
      "url": "https://search.huffpost.com/click/_ylt=Awr9CKr9nqtdqhQAVwNsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571557245/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fbernie-sanders-hospitalized-heart-procedure-emergency_n_5d94b6bde4b0019647b1e1b4/RK=2/RS=.gqwA5CvHLTFbzkAcjcwgWXq1jM-",
      "subtitle": "The campaign said Sen. Sanders “will be resting up over the next few days.”",
      "author": "Ryan Grenoble",
      "content": " Democratic presidential candidate Sen. Bernie Sanders (I-Vt.) underwent an emergency heart procedure following a campaign event Tuesday evening, his campaign confirmed in a statement. “During a campaign event yesterday evening, Sen. Sanders experienced some chest discomfort,” the campaign said in an emailed statement. “Following medical evaluation and testing he was found to have a blockage in one artery and two stents were successfully inserted. Sen. Sanders is conversing and in good spirits.” “He will be resting up over the next few days,” the statement read. Sanders’ campaign is canceling his events until further notice. The Sanders campaign has also canceled its TV advertising spending in Iowa, according to political ad tracker Medium Buying. It had originally planned to start airing ads Thursday. Campaign rivals including Sen. Elizabeth Warren (Mass.), former Vice President Joe Biden and South Bend, Indiana, Mayor Pete Buttigieg were quick to tweet messages of support and encouragement. “Anyone who knows Bernie understands what a force he is,” Biden wrote. “We are confident that he will have a full and speedy recovery and look forward to seeing him on the trail soon.” Bernie himself posted on Twitter Wednesday afternoon, expressing gratitude both for his health care staff and his access to good care. In September, the 78-year-old canceled three events in South Carolina to rest his voice, which had grown hoarse due to what the campaign called a “vigorous” schedule. He and Biden, 76, pledged that month to release an updated set of medical records before the Democratic presidential primaries. “I think it’s the right thing to do,” Sanders said at the time. “The American people have the right to know about whether the person they are going to be voting for for president is healthy, and we will certainly release our medical records before the primaries.” Sanders pushed back on concerns about his age in the 2016 presidential election with the release of a doctor’s note that concluded he was “in overall very good health.” A medical history accompanying the note, written by senate physician Brian P. Monahan, detailed health problems “including gout, mild hypercholesterolemia, diverticulitis, hypothyroidism, laryngitis secondary to esophageal reflux, lumbar strain and complete removal of superficial skin tumors.” The note specifically stated the senator has no history of heart disease, doesn’t smoke tobacco and consumes alcohol “infrequently.” This story has been updated with comment from Sanders.",
      "date": "10/02/2019 10:47 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Stephen Colbert Hits Bernie Sanders With A Tough Question",
      "url": "https://search.huffpost.com/click/_ylt=Awr9CKr9nqtdqhQAVQNsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571557245/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fstephen-colbert-bernie-sanders_n_5d8d5aade4b0ac3cdda60a81/RK=2/RS=NI8wmVgURyDZi.P1gjpdS8qa0wI-",
      "subtitle": "“Are you at all insulted that Trump didn’t try to get dirt on YOU from the Ukraine?” the “Late Show” host asked the Vermont senator.",
      "author": "Josephine Harvey",
      "content": " Stephen Colbert had a personal question for Sen. Bernie Sanders (I-Vt.) on his show Thursday night. “Let me just hit you here as a senator. Are you at all insulted that Trump didn’t try to get dirt on you from the Ukraine?” asked “The Late Show” host, referring to President Donald Trump’s  July 25 phone call with Ukrainian President Volodymyr Zelensky in which he asked Ukraine to investigate former Vice President Joe Biden, who is now a Democratic presidential candidate. Sanders, also a 2020 hopeful, replied with a laugh, clearly not too upset by the fact the president hadn’t gone after him. Watch the segment and Sanders’ reply below:",
      "date": "09/26/2019 10:35 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders Reveals The Only Thing He ‘Admires’ About Donald Trump",
      "url": "https://search.huffpost.com/click/_ylt=Awr9CKr9nqtdqhQAUwNsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571557245/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fbernie-sanders-traits-admires-donald-trump-hair_n_5d88180de4b070d468cec36b/RK=2/RS=gMSsNeq8HsBdLMX1sLILDfNp7pU-",
      "subtitle": "It was a struggle, but the 2020 presidential candidate eventually managed to find one positive thing to say about the president.",
      "author": "Josephine Harvey",
      "content": " Sen. Bernie Sanders (I-Vt.) has very reluctantly acknowledged two traits that he “admires” about President Donald Trump. While speaking at a youth forum at Drake University in Des Moines, Iowa, on Sunday, the 2020 presidential candidate was asked by a student, in the interest of smoothing political divisiveness, to name one “genuine thing” that he admires about the president. Miming being punched in the gut, Sanders was not exactly enthusiastic about answering the question. “His hair, I’m really impressed by the color of his hair,” he quipped at first. He continued by telling the student he probably wouldn’t be too happy with his actual answer. Sanders acknowledged his respect for several of his Republican colleagues in the Senate, explaining it’s not odd for them to sit down to lunch together, and that they don’t “hate each other” ― despite holding differing views. However, he decried Trump as a racist, sexist, homophobe, xenophobe and religious bigot, saying that he would do anything he could to tackle that type of behavior. He was greeted by a round of applause, but the moderator pressed him to name just one “single thing” that he could say that he admires. “He gets up at 3 o’clock in the morning to tweet. So I’m impressed by people who get up at 3 o’clock in the morning,” Sanders replied. The event also featured presidential candidates Rep. Tulsi Gabbard (D-Hawaii), Sen. Michael Bennet (D-Colo.), Andrew Yang, former Rep. Joe Sestak and businessman Tom Steyer. Watch a clip of the event from the Des Moines Register below:",
      "date": "09/22/2019 11:18 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders Spends $1.3 Million On His 1st TV Ads For 2020",
      "url": "https://search.huffpost.com/click/_ylt=Awr9CKr9nqtdqhQAUQNsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571557245/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fbernie-sanders-first-campaign-ad-iowa_n_5d9399bce4b0e9e760542f17/RK=2/RS=8SjAsbuUJoCpGnUbUTdIi8x6zpc-",
      "subtitle": "After raising $25 million in the last three months, the Sanders campaign will launch its first TV ads of the cycle in Iowa.",
      "author": "Carla Herreria",
      "content": " Sen. Bernie Sanders (I-Vt.) is closing in on Iowa by launching his first paid televised ads for the 2020 presidential election cycle in the state, his campaign announced Tuesday. Sanders spent $1.3 million on the ad buy in Iowa, the first state to vote in the Democratic primary. The senator’s in-house production team created the 30-second and 60-second ads, titled “Fights for Us.” They will run in Iowa for about two weeks beginning Thursday morning. The 60-second version of the ad flags President Donald Trump as a “dangerous demagogue” and highlights Sanders’ long history of activism, briefly featuring a photo of a 21-year-old Sanders being arrested at a protest against segregation in Chicago schools in 1963. The announcement for the ad came shortly after Sanders’ campaign revealed that the senator raised $25.3 million from about 1.4 million donations in the past three months. However successful his fundraising, Sanders was still dragging behind Massachusetts Sen. Elizabeth Warren and former Vice President Joe Biden at third place in a recent poll of likely Democratic caucus attendees in Iowa. Warren, who surged in the poll as Biden fell to second place, made an aggressive ad buy last week, spending at least $10 million in advertising in the first four states to vote in the 2020 Democratic primary, including Iowa.",
      "date": "10/01/2019 04:02 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders Raised More Than $25 Million This Quarter, Campaign Says",
      "url": "https://search.huffpost.com/click/_ylt=Awr9BNsTn6td_V8AIopsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571557267/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fbernie-sanders-raised-more-than-25-million_n_5d92dfdfe4b0019647adbdc3/RK=2/RS=CTtpzwU2KlymtjYui1MzdScxfts-",
      "subtitle": "That figure came from 1.4 million donations, an average of $18.07 apiece.",
      "author": "Nick Visser",
      "content": " Sen. Bernie Sanders (I-Vt.) raised $25.3 million in the third quarter of 2019, a sum that came from around 1.4 million donations, his campaign reported  Tuesday. “Bernie is proud to be the only candidate running to defeat Donald Trump who is 100 percent funded by grassroots donations – both in the primary and in the general,” Faiz Shakir, Sanders’ campaign manager, said in a statement. “Media elites and professional pundits have tried repeatedly to dismiss this campaign, and yet working-class Americans keep saying loudly and clearly that they want a political revolution.” The third quarter ended Monday, and all 2020 candidates must report their fundraising totals to the Federal Election Commission by Oct. 15. It’s unclear how Sanders’ third-quarter haul stacks up against his fellow candidates, but the senator has long been in the top echelon of fundraising, leaning on the support of small-dollar donations that propelled him forward in 2016. Sens. Elizabeth Warren (D-Mass.) and Kamala Harris (D-Calif.), Mayor Pete Buttigieg and former Vice President Joe Biden had all also raised more than $20 million by the end of July, while other candidates have struggled to hit those targets, according to Open Secrets. Sanders’ campaign said Tuesday he had raised a total of $61.5 million since he unveiled his bid for the White House, noting that 99.9% of donors hadn’t yet maxed out how much they’re legally allowed to give. An additional $2.6 million was transferred to the campaign from other campaign accounts. Some Democrats had been ringing the alarm bells to their supporters as the deadline loomed. Sen. Cory Booker (N.J.) said last month that his campaign was considering dropping out of the race if it didn’t reach a self-imposed goal of $1.7 million for the quarter (his team said they “blew past” that total this weekend). Former Housing and Urban Development Secretary Julián Castro’s campaign also sent out a stark fundraising email in recent days, although his team later said it wasn’t a signal that he planned to leave the race. Candidates’ number of donors will come into play for the Democratic National Committee’s upcoming debates in November. That event will have a higher threshold, mandating candidates have at least 165,000 individual donors as well as reaching at least 3% in at least four approved polls of Democratic voters. President Donald Trump, on the other hand, has already amassed a gargantuan war chest, raising more than $200 million from his campaign committee and outside groups. His campaign has not yet filed its FEC disclosures for the third quarter.",
      "date": "10/01/2019 06:00 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders Suffered Heart Attack, Doctors Confirm",
      "url": "https://search.huffpost.com/click/_ylt=Awr9BNsTn6td_V8AIIpsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571557267/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fbernie-sanders-released-from-hopsital_n_5d97c255e4b0fc935eda16fd/RK=2/RS=iO_EwCxM8ytWRmu2LoP8VO_1MlA-",
      "subtitle": "The presidential candidate was released from a Vegas hospital where doctors confirmed he was diagnosed with a myocardial infarction, known as a heart attack.",
      "author": "Carla Herreria",
      "content": " Sen. Bernie Sanders (I-Vt.) has been released from a Las Vegas hospital three days after a heart attack, his doctors revealed in a statement through his presidential campaign Friday. The Democratic presidential candidate was first admitted to the hospital on Tuesday. His campaign hadn’t disclosed any information on Sanders’ specific condition at that time, noting only that he “experienced some chest discomfort” and underwent an emergency heart procedure to have two stents inserted to relieve a blocked artery. The doctors who treated Sanders confirmed in their Friday statement that the senator suffered a myocardial infarction, otherwise known as a heart attack. Sanders posted a video with his wife two hours after his release was announced, thanking his supporters for their support and “warm wishes.” “I’m feeling so much better,” he said from Las Vegas. “I want to thank the doctors, nurses, and staff at the Desert Springs Hospital Medical Center for the excellent care that they provided,” he said in a statement. “After two and a half days in the hospital, I feel great, and after taking a short time off, I look forward to getting back to work.” Video shows Sanders walking on his own out of the hospital while waving at cameras and cheering before getting into an SUV. “After presenting to an outside facility with chest pain, Sen. Sanders was diagnosed with a myocardial infarction,” Drs. Arturo E. Marchand Jr. and Arjun Gururaj said at Desert Springs Hospital Medical Center in Las Vegas. “The Senator was stable upon arrival and taken immediately to the cardiac catheterization laboratory, at which time two stents were placed in a blocked coronary artery in a timely fashion,” the physicians said. “All other arteries were normal.” Sanders is expected to attend the Democratic presidential debate in Ohio on Oct. 15. This article has been updated with a statement and video from Sanders. CORRECTION: An earlier version of this article said Sanders was hospitalized Wednesday. He went into the hospital Tuesday night.",
      "date": "10/04/2019 06:46 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Sanders Says He’d Ban Corporate Money From Democratic Convention, Presidential Inauguration",
      "url": "https://search.huffpost.com/click/_ylt=Awr9BNsTn6td_V8AHopsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571557267/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fbernie-sanders-campaign-finance-reform-end-corporate-money-democratic-convention-2020-democratic-presidential-primary_n_5d9aa2e7e4b03b475f9bb0e2/RK=2/RS=0fB3LXXbvlJ.f1tf49bwb6LdyIw-",
      "subtitle": "His plan to end the influence of major businesses goes further than that of other 2020 candidates.",
      "author": "Daniel Marans",
      "content": " Sen. Bernie Sanders (I-Vt.) on Monday released a plan that would eliminate some of the last unrestrained corporate spending in Democratic politics, by banning corporate funding for the party’s nominating convention and presidential inauguration events. Sanders’ proposal to “get corporate money out of politics” ― the first plan his presidential campaign has released since he was hospitalized for a heart attack last week ― would, among other things, ensure public financing of federal elections, create a new federal elections oversight board, prohibit advertising during presidential primary debates, and enact a lifetime lobbying ban for former members of Congress and top staffers. But replacing corporations’ sponsorship of the Democratic National Convention with a public financing system is both the most ambitious and the most controversial element of Sanders’ proposal. Seventeen donors were responsible for contributing three-quarters of the funding for the party’s 2016 convention in Philadelphia, including a $5.6 million in-kind donation from Comcast for broadcast and internet services. Sanders said his own campaign’s success raising money in small increments ― he topped the Democratic presidential field with a $25.3 million haul in the third quarter of this year ― shows that corporate money and wealthy donors are not necessary. “Our grassroots-funded campaign is proving every single day that you don’t need billionaires and private fundraisers to run for president,” Sanders said in a statement accompanying the plan. “When we win the Democratic nomination and defeat Donald Trump, we will transform our political system by rejecting the influence of big corporate money.” Some of the other changes Sanders proposes include banning lobbyist and corporate PAC donations to the Democratic National Committee if he is the Democratic presidential nominee, barring former DNC chairs and vice chairs from lobbying, and capping individual contributions to official inauguration committees at $500. He would also seek to pass a constitutional amendment clarifying that money is not equivalent to speech and that corporations do not have the legal status of individuals, thereby eliminating key legal justifications for court rulings striking down campaign finance regulations. As Democrats have grown warier of corporate influence in politics, the party’s national convention every four years — which is overwhelmed by corporate spending and lobbyist influence peddling — has attracted more scrutiny from good government advocates and progressive activists. Meanwhile, the DNC’s convention CEO, Joe Solmonese, has already set out to court corporate sponsors to raise upward of $70 million for the party’s nominating convention in Milwaukee in July 2020. Perks for six-figure donors include VIP convention credentials and box seats to attend the proceedings. That makes the convention a natural target for Sanders, an independent who has long been antagonistic toward the donors and insiders that play an outsize role in Democratic Party politics. “When Bernie is the nominee, everything will fundamentally change for corporate elites,” Josh Orton, the Sanders campaign’s policy director, said in a statement. “A Bernie Sanders convention will be a people-powered convention.” Sanders’ proposal is likely to raise questions about his ability and willingness to compete with President Donald Trump, who will have virtually limitless cash to finance a rival convention. A convention provides a political party a key opportunity to introduce its presidential and vice presidential nominees to a national audience on live television. Of course, it is much easier to swear off high-dollar private fundraisers ― as Sanders and Sen. Elizabeth Warren (D-Mass.) have done ― in a presidential primary. It is harder to replace multimillion-dollar corporate checks that come in for the convention than the $2,800 checks that closed-door fundraisers earn candidates in primaries. Sanders’ proposal differs from that of Warren, a fellow economic populist who has surpassed him in national and early-state primary polls. In an anti-corruption proposal released in September, Warren suggested a lifetime ban on lobbying for former members of Congress, presidents, vice presidents, Cabinet secretaries and federal judges. But she does not yet have a major plan to reform campaign financing, including how the national political conventions are financed. Warren has also said that she would resume soliciting big checks in private fundraisers if she were the Democratic presidential nominee, arguing that to do otherwise would amount to “unilateral disarmament” against Trump and the Republicans. Sanders, by contrast, has said he would not change his ban on the policy.",
      "date": "10/07/2019 06:00 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "‘It Was Like A Rallying Cry’: Bernie Sanders Campaign Surges Ahead After Heart Attack",
      "url": "https://search.huffpost.com/click/_ylt=Awr9BNsTn6td_V8AHIpsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571557267/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fbernie-sanders-campaign-heart-attack-2020-democratic-presidential-primary_n_5d9bda67e4b03b475f9ea78d/RK=2/RS=HL_zis6xqXMv0skRHSWaMUoCzM8-",
      "subtitle": "The Vermont senator’s presidential campaign and top supporters say they are buoyed by a wave of support following the 78-year-old’s hospitalization.",
      "author": "Daniel Marans",
      "content": " Less than a week after suffering a heart attack, Sen. Bernie Sanders (I-Vt.) addressed hundreds of campaign staffers on Monday afternoon to offer his gratitude for their work and assure them he is more committed than ever to winning the Democratic presidential nomination. “Ironically, I will tell you that I feel more strongly about the need for a political revolution today than I did when I began,” he said, according to the campaign. The mood amongst the staffers who were on the brief call was boisterous, according to three people who were on the call who requested anonymity to speak without authorization. One of the campaign aides described being moved by Sanders’ reminder that their campaign — which boasts the slogan, “Not me. Us.” — was about the hopes and dreams of millions of working people seeking a better life. “You work so fucking hard on these things, that it’s good to hear the person you work for have this really kind of humbling approach to it all,” the aide said. “He said ‘Don’t take your eye off the ball’ in a way that really got people moving.” The call embodied the broader response that the campaign has had since Sanders was hospitalized late Tuesday night with chest pain that ended up being a “myocardial infarction,” or heart attack: That Sanders is well on his way back to full health, that his fight for Medicare for All is more personal than ever, and that he has no plans to slow down his campaign. “The working class Americans who are the core of Bernie’s movement wake up each day and battle adversity of all kinds, and we believe they will be drawn even closer to the senator as he continues to fight for a shared vision to transform our country so it works for all of us – not just the wealthy and well-connected,” Sanders campaign manager Faiz Shakir said in a statement on Monday. Sanders, 78, was treated in Las Vegas, Nevada, with the insertion of two stents to unclog one of his arteries. On Friday, he emerged from the hospital alongside his wife Jane with a triumphant fist in the air, recorded a video for his supporters on social media, and returned home to Burlington, Vermont. He and his wife took a walk in the rain on Monday, which CNN captured on camera. In addition to facing the politically tricky task of persuading primary voters that a septuagenarian heart attack survivor is up to the task of winning the White House, the Sanders campaign is already working to quiet skepticism of its immediate response to his ailment. Nearly three days passed between Sanders’ hospitalization and the announcement on Friday that he had suffered a heart attack. Sanders’ team maintains that they provided the accurate medical information as soon as it was available; they were not sure of the diagnosis until he was discharged from the hospital. In keeping with a mid-September promise, Sanders will be releasing his full medical records in the near future, though the campaign did not provide any additional details about timing. The Sanders campaign did its best to continue with business as usual in the days following his hospitalization. Over the weekend, the campaign dispatched three of its co-chairs ― former Ohio state Sen. Nina Turner, California Rep. Ro Khanna and San Juan, Puerto Rico, Mayor Carmen Yulín Cruz ― to barnstorm the early primary states with a packed schedule of events. And early Monday morning, the campaign released Sanders’ plan to get corporate money out of politics, including the cash-riddled presidential nominating conventions. Sanders will have his first chance to demonstrate his vitality at the fourth Democratic presidential debate in Westerville, Ohio, on Oct. 15. The Vermont senator does not have any public events planned prior to the debate; he canceled a scheduled appearance at an LGBTQ town hall on CNN this Thursday. In the meantime, the campaign is keen to showcase the strength of Sanders’ support network, which appears to have been inspired by his hospitalization to redouble their efforts on his behalf. The campaign announced on Sunday that its staff and volunteers had met its goal of making 1 million phone calls to voters in Iowa, New Hampshire, Nevada, South Carolina and California in ten days’ time. According to an aide, the campaign experienced a spike in volunteers on Wednesday after news of Sanders’ hospitalization broke, pushing the phone call tally up to 1.3 million. The figure is not surprising given the frenzy of emotion among his supporters following his hospitalization. A number of Sanders partisans with significant social media followings downplayed the significance of the stent procedure and highlighted the speed of Sanders’ recovery. And the campaign racked up 8,000 donations on Wednesday, according to co-chair, Rep. Ro Khanna of California. One of the donors was RoseAnn DeMoro, the former executive director of the National Nurses United union, and a prominent campaign supporter, who chipped in $100. “It was like a rallying cry. It was incredible,” DeMoro said of the outpouring of support for Sanders. “That’s the difference between having a movement as opposed to just a campaign.” Sanders supporters, many of whom have lost faith in more conventional politicians, are famously passionate in their support for Sanders. The prospect that a health scare could damage his standing in the polls prompted so much renewed involvement due to supporters’ belief that Sanders is uniquely equipped to defeat Trump and solve the country’s problems, according to Jim Zogby, a pollster and top Sanders surrogate. “People all of a sudden woke up and said, ‘Bernie might not be in the mix ― this can’t be,’” said Zogby, who also runs the Arab American Institute. “He comes back to an invigorated campaign with a staff and a support base that has doubled down in their efforts to make this happen. Because they realize that for them ― and for me ― he’s the critical choice.” Calls for Sanders to drop out of the race ― however few they were in number ― only riled up Sanders’ supporters, many of whom already firmly believe that the established media and political classes will stop at nothing to prevent Sanders from winning. The Thursday release of “Rising Up,” a five-minute video created by Matt Orfalea, a Sanders activist not affiliated with the campaign, added to the dramatic “us versus them” narrative that has long animated Bernie World. Orfalea’s video, which many called an advertisement, showed numerous clips of pundits, reporters and comedians mocking Sanders on a series of topics, juxtaposed with footage of him doing the opposite — greeting supporters with a smile, listening sympathetically, speaking to crowds of diverse voters. The spot, which featured some of the do-it-yourself charm of the 2016 campaign, earned plaudits from prominent Democrats who are not supporting Sanders but are nonetheless sympathetic to claims of media bias against him. In just a few days, the video racked up over 6.3 million views on Twitter alone ― far more than Sanders’ first official campaign ad, which came out days earlier. “It’s something that deeply resonates and it was released at the perfect moment, when Bernie needed it the most,” Rebecca Katz, a progressive strategist who is not aligned with any presidential candidate, said of the video. “It’s the kind of things voters don’t just watch but also share.” A question on the minds of some poll watchers is nonetheless how Sanders’ heart attack affects the campaign of Massachusetts Sen. Elizabeth Warren, 70, a fellow progressive who has surpassed Sanders in national and early primary-state polls. In a gesture of solidarity, Warren’s campaign bought dinner on Wednesday for Sanders’ staff at his campaign headquarters in Washington. The Warren campaign declined to comment for this story. But two prominent Warren supporters suggested that Sanders’ continued presence in the race could only help her candidacy. Adam Green, a co-founder of the Progressive Change Campaign Committee, which has endorsed Warren, argued that the presence of another left candidate is mutually beneficial. It increases the legitimacy of their shared ideas, and is liable to dissuade super-rich donors from erecting a super PAC to take out either one of them, he posited. “If you knock one out, you help the other,” Green said of such a scenario. “And if you run ads hitting both of them, you just elevate them as the two most clear and transformational progressives.” Murshed Zaheed, a partner at the progressive communications firm Megaphone Strategies who previously worked for former Senate Majority Leader Harry Reid (D-Nev.), echoed Green’s sentiments, likening it to a progressive race to the top. “There’s no coincidence that both of them are smashing the neoliberals in this race in terms of fundraising,” said Zaheed. “Competition makes each one better.”",
      "date": "10/08/2019 05:45 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders Says Campaign Acted Appropriately With Heart Attack News",
      "url": "https://search.huffpost.com/click/_ylt=Awr9BNsTn6td_V8AGopsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571557267/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fbernie-sanders-defends-campaign-heart-attack_n_5d9e5394e4b06ddfc5131a83/RK=2/RS=wv7Mw_x4ni2Jfx8M1.a9XRjbNt8-",
      "subtitle": "Critics say the Sanders campaign wasn’t being transparent when they didn’t disclose his heart attack after he was hospitalized last week.",
      "author": "Carla Herreria",
      "content": " Sen. Bernie Sanders (I-Vt.) brushed off claims that his presidential campaign wasn’t being transparent when the presidential hopeful was hospitalized after suffering a heart attack. “That’s nonsense,” Sanders, 78, said of the criticism, according to NBC News. “I don’t know what people think campaigns are. You know we’re dealing with all kinds of doctors, and we wanted to have a sense of what the hell was going on, really.” Sanders said his campaign acted “absolutely appropriately” by not rushing to alert the media after he was hospitalized. “So the first thing that we’re trying to do is understand what’s going on and not run to The New York Times and have to report every 15 minutes,” he told reporters Tuesday. “You know, this is not a baseball game. So I think we acted absolutely appropriately.” When the Sanders campaign announced that the senator was hospitalized last week, they didn’t specify Sanders’ exact condition. The campaign noted only that Sanders had “experienced some chest discomfort” and underwent an emergency heart procedure for a blocked artery. Two and a half days later, Sanders was released from the hospital. At that time, his campaign issued a statement in which his doctors revealed he had a myocardial infarction, commonly known as a heart attack. The episode has thrust Sanders’ health into the spotlight as one of the oldest candidates running for president. Critics have raised questions about whether he should campaign aggressively, but his staffers remain energized to move forward. Before his heart attack, the senator promised to release his medical records before the Democratic primaries begin. He told reporters Wednesday that he would release those records “at the appropriate time,” according to Politico. Sanders also said he had no intention of slowing down his campaign. “We’re going to get back into the groove of a very vigorous campaign,” Sanders said Tuesday. “I love doing rallies, and I love doing town meetings.”",
      "date": "10/09/2019 07:07 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Trump Impeachment Crisis Tees Democratic Candidates Up For Chaotic Fall",
      "url": "https://search.huffpost.com/click/_ylt=Awr9BNsTn6td_V8AGIpsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571557267/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fdemocratic-candidates-impeachment-trump-chaotic-fall_n_5da1c6b8e4b02c9da04b114d/RK=2/RS=srtD0OQbmT4MoF1y1A0znzamm0A-",
      "subtitle": "The Democratic presidential race had largely been static through the summer.",
      "author": "",
      "content": "WASHINGTON (AP) — A Democratic presidential race that had been largely static through the summer has tumbled into a chaotic fall, shaped by unpredictable events and the deepening impeachment crisis surrounding President Donald Trump. Less than four months before voting begins, front-running candidates are facing urgent questions about their ability to challenge Trump, prompted by a health scare for Sen. Bernie Sanders, an uneven response by Joe Biden to the president’s efforts to tie him to the impeachment inquiry and nagging questions about liberal Sen. Elizabeth Warren‘s electability. Lower-tier candidates are struggling just to be heard. The uncertainty is heightening anxieties among Democrats desperate to defeat Trump in 2020. Although impeachment could imperil Trump’s presidency, the process has also highlighted Trump’s skill at discrediting his opponents, sometimes with baseless conspiracy theories. And Democrats appear no closer to sorting out what tactics, what ideology and what person is best-suited to overcome that. Progressive candidates like Sanders and Warren are surging in fundraising and drawing support from a wide swath of voters, according to polls, but face opposition from moderates who question whether now is the time to start the kind of sweeping — and divisive — economic and societal reforms they are pushing. It’s a concern some moderates say has only increased against the backdrop of impeachment. “The divisions we have in the country threaten the health and stability of our democracy. President Trump has fractured so many norms,” former Iowa Gov. Tom Vilsack said in an interview. “Like a patient getting over an illness or injury, we have to first heal the nation’s divisions and reestablish our norms before we have the needed strength to successfully embrace and implement an array of big ideas.” Vilsack, a longtime friend of Biden’s, has not endorsed anyone in the 2020 race. He’s been courted by, and consulted with, numerous candidates, and has spoken regularly with Warren. The Massachusetts senator has energized voters with a menu of detailed policy proposals, a folksy, relatable way of explaining them and a swell of small-dollar donations that brought in more than $24.6 million in the most recent quarter. That’s increasingly turning her into a target for candidates who see her calls for overhauling health care and rebalancing wealth in America as outside the mainstream. Pete Buttigieg, the mayor of South Bend, Indiana, who is trying to break into the upper rung, has focused in particular on Warren’s health care plan, the Sanders’-authored “Medicare for All” single-payer system that Buttigieg describes as a “my-way-or-the-highway approach.” But it’s more than the policy Buttigieg is arguing against. “We have to be able not only to thrill a debate audience or a Twitter following but actually make something happen, which tells us that having the smartest policy is only half the battle when it comes to what will actually make a difference,” Buttigieg said in an interview. For now, Warren advisers are happy to have Sanders still in the race to help absorb those blows rather than becoming the sole target of the attacks. “Politically, it’s good for Warren and Sanders to have each other in the race,” said Adam Green, co-founder of the Progressive Change Campaign Committee. “They bolster each other’s ideas.” The confidence Sanders’ campaign felt last week after announcing a $25.3 million haul in the third quarter — the highest in the race — was lessened after the 78-year-old senator suffered a heart attack. He told reporters this week that he planned to scale back his campaign, then said he had misspoken. He’ll return to the campaign on Tuesday for a debate in Ohio. His advisers privately acknowledge that the timing of the heart attack — which came just as the impeachment inquiry was escalating — may have helped limit the political fallout because attention was focused elsewhere. But they also understand that he will have to more directly address lingering health concerns. Jeff Weaver, Sanders’ chief strategist, dismissed any long-term concerns, noting that the 2020 contest includes several older candidates, including the 73-year-old Trump. “There are a number of older candidates in the race, including the sitting president of the United States, and I can tell you with confidence, there’s only one we can say with assurance whose arteries are completely open,” Weaver said, referencing the stent procedure designed to clear Sanders’ clogged arteries. Biden, 76, stands as the strongest obstacle to Warren and Sanders, fundamentally opposed on policy and pitching a more conciliatory approach to governing. The former vice president was already facing questions about whether he was out of step with the party’s activist liberal base and up for the challenge of taking on Trump before he got pulled into the impeachment inquiry, which centers on Trump’s push for Ukraine to investigate the former vice president and his son. Although Trump’s allegations against Biden are so far without foundation, the president and his allies have aggressively pressed the charges. Biden responded forcefully this week, but only after days of hand-wringing among supporters and advisers who worried he appeared ill-prepared for combatting the kind of asymmetrical political warfare at which Trump excels. Still, Biden backers contend that the mere fact that Trump has appeared focused on trying to take down Biden allows the former vice president to strengthen his electability argument by previewing what a one-on-one race with the president would look like. “He’s able to go out there every day and make this Biden vs. Trump argument,” said John Anzalone, a pollster for Biden. That’s the fear for some lower-tier candidates — that the head-to-head fight between Trump and Biden, and the grassroots support of Warren and Sanders, block out their opportunities for a late surge. Everyone is at risk, including those who have had flashes of success in recent months but are now languishing in the single digits in many polls, including California Sen. Kamala Harris, former Rep. Beto O’Rourke and New Jersey Sen. Cory Booker. Buttigieg said there is no secret strategy for those candidates seeking to break out during this intense fall stride toward the first votes other than engaging in a “respectful and robust” debate of ideas. “Where there’s an important difference, people need to understand that,” he said.",
      "date": "10/12/2019 08:47 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Bernie Sanders: ‘I Was Dumb’ To Ignore Heart Attack Warning Signs",
      "url": "https://search.huffpost.com/click/_ylt=Awr9BNsTn6td_V8AFopsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571557267/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fbernie-sanders-heart-attack-symptoms_n_5d9ce1e4e4b06ddfc50fa4ac/RK=2/RS=1za7zsDhNlxSrAvddiZY4o38cC4-",
      "subtitle": "The Vermont senator and Democratic presidential candidate hopes his recent hospitalization will be a lesson to the public.",
      "author": "Amy Russo",
      "content": " Sen. Bernie Sanders (I-Vt.) admitted on Tuesday that he mishandled his health before being hospitalized last week with a heart attack. Now, he’s urging the public to watch out for the warning signs. “I must confess that I was dumb,” the Democratic presidential candidate told reporters outside his home in Vermont ahead of a cardiologist appointment. Sanders noted that at some points on the campaign trail he was leading three to four rallies in a single day, adding that “in the last month or two, [I] just was more fatigued than I usually have been, and I should have listened to those symptoms.” “So if there’s any message that I hope we can get there, [it’s] that I want people to pay attention to their symptoms,” he said. “When you’re hurting, when you’re fatigued, when you have pain in your chest, listen to it.” On Oct. 1, the 78-year-old underwent an emergency heart procedure in Las Vegas to treat a blocked artery with two stents, having noticed something was wrong when he experienced chest discomfort. Hours after his release on Friday, Sanders shared a taped statement on Twitter, announcing that he was “feeling so much better” and thanking his supporters “for all of the love and warm wishes that you sent me.” Meanwhile, Sanders’ campaign has hit the pause button with no scheduled events until his planned appearance at the fourth Democratic debate on Oct. 15 in Westerville, Ohio.",
      "date": "10/08/2019 05:24 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Rainè Riggs, Bernie Sanders’ Daughter-In-Law, Dies Suddenly At 46 After Cancer Diagnosis",
      "url": "https://search.huffpost.com/click/_ylt=Awr9BNsTn6td_V8AFIpsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571557267/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fraine-riggs-bernie-sanders-daughter-in-law-dead-obituary_n_5d9d9d4fe4b06ddfc510d03f/RK=2/RS=YjVR2suoICr_ABF3LlKUevBKgjw-",
      "subtitle": "Riggs, a neuropsychologist and mom of three, died two days after being diagnosed with neuroendocrine cancer, according to her obituary.",
      "author": "Dominique Mosbergen",
      "content": " Rainè Riggs, a neuropsychologist and daughter-in-law of Democratic presidential hopeful Bernie Sanders, died on Saturday — two days after receiving a cancer diagnosis, according to an obituary shared online by Lee & Martin Funeral Home in Burgettstown, Pennsylvania. Riggs was 46. “How do you go on day by day when your heart just keeps breaking over and over?” the obituary said of Riggs’ sudden passing. “Our world will never be the same.” Riggs, who was married to Sanders’ son Levi, died the same day that the Vermont senator returned home after suffering a heart attack. According to the obituary, the mom of three had fallen ill three weeks before her death, but doctors had been “stumped” as to what was wrong with her. She was eventually diagnosed with neuroendocrine cancer at the University of Pittsburgh Medical Center. “Her last words were to tell her children how much she loved them and she was so sorry that she got sick. Her last moment was spent with her No. 1 cheerleader, her mother, holding her hand and whispering in her ear how much she loved her,” the obituary said. Riggs served as the director of behavioral medicine at Dartmouth Medical School for several years and started the Palliative Care Department for Dartmouth Medical Center, the obituary said. She also owned Riggs Geriatric Psychology in Windsor, Vermont, and spent time volunteering with homeless veterans, pediatric hospice and at Ground Zero in the aftermath of 9/11. Riggs loved to bake and pick berries with her children, the obituary added. “Rainè’s favorite pastime was spending time at the beach, whether at the lake or the ocean. She made sure the summer was filled with little trips and never wasted a day.”",
      "date": "10/09/2019 06:41 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    },
    {
      "title": "Sanders Heads Into Debate With Something To Prove: His Health",
      "url": "https://search.huffpost.com/click/_ylt=Awr9BNsTn6td_V8AEopsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571557267/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fsanders-heads-into-debate-with-something-to-prove-his-health_n_5da3f07fe4b02c9da04cd949/RK=2/RS=RUxJIMBZ9_bKEVKOBcMR_7kb_24-",
      "subtitle": "Polling indicates voters have significant doubts about whether the Vermont senator is healthy enough to serve as president.",
      "author": "",
      "content": "ALTOONA, Iowa ― Vermont Sen. Bernie Sanders, a leading candidate for the 2020 Democratic presidential nomination, got a warm welcome at a gathering of the United Food and Commercial Workers union at a casino in this Des Moines suburb. The International President of the UFCW, Marc Perrone, praised him as a “liberal lion” who had changed the debate on health care and economic policy. At the end of Sanders’ speech, the roughly 400 union members stood and applauded. There was one problem, if you could call it that: Sanders wasn’t in Altoona. While Democratic candidates major (former Vice President Joe Biden) and minor (Colorado Sen. Michael Bennet) had flown to Iowa for the event, Sanders appeared from the living room of his family home in Burlington, Vermont, and delivered his speech via Skype. As new polling suggests Sanders’ heart attack may harm his chances to win the nomination, his campaign is working to project normalcy, even as Sanders remains at home under doctor’s orders. Sanders is set to make his first public appearance outside of Vermont since the health scare on Tuesday night at the fourth Democratic presidential debate in the suburbs of Columbus, Ohio ― an appearance his campaign hopes will quiet doubts about whether he can win the nomination. Sanders’ speech at the UFCW forum was his standard fare: He promised “Medicare for All,” a $15 minimum wage, doubling union membership in his first term, and floated the possibility of making the work week shorter. (Sanders’ friendly welcome from the UFCW crowd wasn’t a total surprise: The union represents his campaign staff.) “You’ve proven no matter what may come, you’ll never shrink from a righteous fight,” Perrone said before Sanders spoke. “You’ve had a cardiac event, and you still wanted to be here with us.” Sanders has made himself available to reporters multiple times in the past week and sat for an interview with ABC News on Sunday, hoping to continue to get his campaign’s message out, even if he’s unable to travel to the early states. In a new HuffPost/YouGov survey, 88% of registered voters say they’ve heard at least a little about Sanders having a heart attack. The news appears to have taken a toll on perceptions of his health ― just 19% of voters say they believe he is in good enough physical condition to serve effectively as president for four years. By comparison, 43% believe former Vice President Joe Biden is in adequate health, with 53% saying the same of President Donald Trump and 66% of Massachusetts Sen. Elizabeth Warren. Views of the candidates’ health are clearly, to some extent, motivated by politics: 85% of Republican and Republican-leaning voters consider Trump physically healthy enough to serve, while only a quarter of Democrats and Democratic-leaners say the same. But even those on Sanders’ side of the aisle are expressing concerns. Just 28% of Democrats and Democratic-leaning voters say they think Sanders is in physical condition to serve effectively, compared to the 59% who say the same of Biden and the 81% who say the same of Warren. More broadly, a 56% majority of voters say they believe Sanders’ age would make it difficult for him to serve effectively as president, with 44% saying the same of Biden, who was born the year after him. Only a third are similarly concerned about Trump’s age. Warren, perhaps helped by the fact that many voters believe her to be younger than she is, fared best on the metric, with just 16% saying her age would make it difficult for her to serve. It’s not yet clear whether or to what extent these concerns will eat into Sanders’ standing in the horse race, which has remained relatively stable in aggregate for months. Polling that focuses specifically on the candidates’ age may overstate the degree to which voters are making their decisions on that basis. The electorate may not be pining for a septuagenarian president ― just 3% of Democrats say they’d consider that ideal, per one survey ― but that hasn’t stopped them from advancing a trio of candidates in their 70s to front-runner status against an incumbent of similar age. There’s also potential room for specific worries about a candidate’s health to recede. In a 2016 Economist/YouGov poll taken after Hillary Clinton suffered a bout with pneumonia, only 45% of voters thought she was in physical condition to serve as president; within two weeks, however, that number had recovered to 52%, close to where she’d stood earlier in the campaign. (That same poll put confidence in Trump’s physical health in the mid-60s, significantly better than his current standing.) Voters say, 64% to 22%, that it’s fair for the media to question a candidate’s physical health. They’re more divided on how much information candidates should be expected to provide about their health. About half say candidates should publicly release all medical information that might affect their ability to serve, while 39% say the candidates should have the right to keep their records private. Democratic voters are more than twice as likely as GOP voters to say candidates should release all their medical information ― a reversal from 2016, when Republicans were the party more likely to favor such disclosure and to consider media scrutiny fair game. Sanders’ campaign maintains that he will demonstrate his vitality on national television when he participates in Tuesday’s presidential debate in Westerville, Ohio. It is his first public appearance since the Oct. 1 hospitalization. On the debate stage, said campaign spokesman Mike Casca, voters will see a “reinvigorated Bernie.” “He will dispel any lingering concerns when he returns to his regular pace on the trail,” Casca added. Sanders announced over the weekend that his first major campaign event since the heart attack will be a large “Bernie’s Back” rally on the East River waterfront in Queens, New York, on Saturday. The rally, held in the same city where Warren drew her largest crowd of the campaign, follows a rocky period for Sanders’ as it has sought to quiet doubts about viability. Sanders, who has been recovering at his home in Burlington, Vermont, told a group of reporters staking out his home on Tuesday that he would likely be slowing the pace of his campaign by, among other things, holding fewer than three or four events a day. A day later, he said he had “misspoke” and that he had no plans to decelerate the campaign. But the campaign has said that Sanders’ error was tonal ― implying that the campaign would be less intense ― rather than substantively inaccurate. It has not taken back the part of his remarks where he said he would hold fewer daily events going forward. In response to a request for clarification from HuffPost, the campaign declined to detail the volume of Sanders’ future events, but said that Sanders would be careful not to overextend himself. Indeed, Sanders and his aides often imply that adopting a lighter schedule would not affect the campaign’s performance, since he previously had one of the most packed schedules of any of the Democratic candidates. “Nobody’s run a more vigorous campaign than Sen. Sanders ― often holding three or four rallies a day with town halls throughout ― and he was doing it all with a partially blocked artery,” Casca said. Sanders vowed in mid-September that he would release his full medical records well before the Iowa caucus on Feb. 3. He has reiterated that commitment in the wake of his heart attack. In a Sunday interview with ABC News’ Jonathan Karl, he said merely that the campaign would be releasing them “as soon as we can.” In the meantime, Sanders has been putting out a steady stream of digital content from his Burlington home designed to showcase his health. On Friday, Sanders released a video on social media showing him hitting baseballs pitched by deputy campaign manager Ari Rabin-Havt. The clip quickly racked up more than 500,000 views on Twitter. And when Karl interviewed him on Sunday, he pitched to Sanders in the Vermont senator’s backyard. Karl subsequently took a shot at Sanders’ pitches. “True ― I got shelled by a 78-year-old guy who just had a heart attack,” Karl wrote in an Instagram post capturing video of Sanders making contact on Karl’s pitch. “But check out Sanders on the mound.” The HuffPost/YouGov poll consisted of 1,000 completed interviews conducted Oct. 8-10 among U.S. adults, using a sample selected from YouGov’s opt-in online panel to match the demographics and other characteristics of the adult U.S. population. HuffPost has teamed up with YouGov to conduct daily opinion polls. You can learn more about this project and take part in YouGov’s nationally representative opinion polling. More details on the polls’ methodology are available here. Most surveys report a margin of error that represents some but not all potential survey errors. YouGov’s reports include a model-based margin of error, which rests on a specific set of statistical assumptions about the selected sample rather than the standard methodology for random probability sampling. If these assumptions are wrong, the model-based margin of error may also be inaccurate. Click here for a more detailed explanation of the model-based margin of error. Robillard reported from Iowa. Marans reported from New York. Edwards-Levy reported from Washington.",
      "date": "10/14/2019 09:28 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Far_Left",
        "target_name": "Bernie_Sanders"
      }
    }
  ]
}