{
  "articles": [
    {
      "title": "Lawsuit Accuses Betsy DeVos And Her Deputies Of Being Motivated By Sexism",
      "url": "https://search.huffpost.com/click/_ylt=Awr9CWvAqatdyVcAIdFsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560001/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fbetsy-devos-sexual-assault-lawsuit_n_5bd9ff6ee4b01abe6a1ad4a9/RK=2/RS=hRhAr98es1NeqH8iujDwgDNl2KA-",
      "subtitle": "The lawsuit says that the education secretary’s decision to scrap Obama-era rules governing sexual assault on campus was based on bias and stereotypes.",
      "author": "Rebecca Klein",
      "content": " A new filing in a lawsuit against the Trump administration accuses Secretary of Education Betsy DeVos and a top deputy of being motivated in part by sexism in their policy decisions. The lawsuit, originally filed in January, challenged DeVos’ elimination of Obama-era Title IX guidance on how sexual assault cases are handled on campus. But an amended complaint submitted Wednesday says that DeVos’ decision was influenced by discriminatory and stereotyped views of women. DeVos scrapped the Title IX guidance in September 2017, issuing her own interim guidance on the subject. Her version raised the standard of evidence used in campus sexual assault cases. At the time, DeVos said that the Obama administration’s directive was an example of federal overreach. But plaintiffs in the filing say DeVos and her deputies had more nefarious motivations, and they use new Freedom of Information Act records as evidence. The records indicate that Department of Education leaders had solicited input from groups and academics who push inflated and widely discredited statistics regarding the prevalence of false rape allegations. A National Sexual Violence Resource Center study found that false reports account for only about 2 percent to 10 percent of such allegations, a range that it said was likely inflated. “What you see is that this administration is buying into the sex stereotype that women and girls lie about these types of things, and they’re making policy based on that view,” Karianne Jones, counsel for Democracy Forward Foundation, told HuffPost. Democracy Forward is representing the plaintiffs in the lawsuit, along with the National Women’s Law Center, National Center for Youth Law and Equal Rights Advocates. According to the lawsuit, the records also show Candice Jackson, then acting head of the department’s Office for Civil Rights, recommended a book to her staff, Unwanted Advances: Sexual Paranoia Comes to Campus by academic Laura Kipnis. The book describes Obama’s Title IX guidance as allowing women to seek legal recourse for “awkward sexual experiences” and then ask for protection from “sexual bogeymen,” per the filing. A spokeswoman for the Department of Education wasn’t able to comment on the specifics of pending litigation but pushed back on the lawsuit’s assertions, noting that department leaders met with a wide range of stakeholders on the issue at the time. “This lawsuit is nothing more than a baseless, politically motivated attack on the Secretary,” spokeswoman Elizabeth Hill said by email. “She and OCR staff met with a number of people on this important issue including survivors, falsely accused students, college presidents and university GCs and the message was very clear from all of them — we have to get this right on behalf of students and the current process isn’t serving students well. “The Secretary is committed to Title IX reforms that will ensure survivors feel empowered to come forward, all students are afforded due process and universities have clear rules to follow.” The lawsuit says that, although the department solicited the views of those who were critical of Obama’s Title IX guidance, “the Department met with organizations that advocate for Title IX’s protections for survivors only after repeated, collective requests from those organizations.” The FOIA records also show that Jackson had consulted with figures such as professor Gordon Finley of Florida International University on the issue. Finley is a member of the National Coalition for Men, a men’s rights organization, and has referred to Obama’s Title IX guidance as a “war on men.” Records also show Jackson was in close contact with the group Families Advocating for Campus Equality, requesting they publish op-eds before a speech by DeVos, according to the lawsuit. The group was started by parents whose children had been accused of sexual assault on campus. DeVos previously publicly met with representatives of the National Coalition for Men and Families Advocating for Campus Equality. The plaintiffs in the case, which include groups like SurvJustice, Equal Rights Advocates and Victim Rights Law Center, say these documents, along with other statements and actions taken by DeVos and Jackson, show they had “discriminatory motivation.” An original lawsuit filed by the plaintiffs challenged the Trump administration’s overall rescission of Obama’s Title IX guidance. An overall challenge to the rescission was dismissed, with the judge saying you cannot challenge a nonbinding piece of guidance. But the amended complaint takes a different approach, instead focusing on the mindset of administration officials. At the time DeVos rescinded the guidance, she said the old process lacked due process. A report from the Wall Street Journal on Wednesday says that DeVos is gearing up to release new rules on the matter, which will require that accused students be allowed to cross-examine their accusers and will narrow the definition of sexual assault cases that schools must arbitrate. Advocates worry that such a process will make victims more reluctant to come forward. The lawsuit mentions President Donald Trump’s previous comments and behavior toward women, accusing him of sexism. Jackson previously said that 90 percent of sexual assault accusations are a result of drunken regrets or misunderstandings, a remark noted in the amended complaint and original lawsuit. At the time of the original lawsuit, a lawyer for the federal government said this did not prove intentional sexism on Jackson’s part. CORRECTION: A previous version of this story mischaracterized the guidance Betsy DeVos issued for campus sexual assault cases; her version raised, not lowered, the standard of evidence used.",
      "date": "10/31/2018 08:49 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "‘Shame On You’: Betsy DeVos Slammed For Trying To Defund Special Olympics",
      "url": "https://search.huffpost.com/click/_ylt=Awr9CWvAqatdyVcAH9FsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560001/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fbetsy-devos-special-olympics_n_5c9aeac4e4b08c450ccd9fc8/RK=2/RS=sQinJHoO7_wz7XYEUGFgy5cdgkE-",
      "subtitle": "The proposed cuts have almost no chance of passing Congress.",
      "author": "Ed Mazza",
      "content": " Education Secretary Betsy DeVos tried to defend the department’s proposed budget cuts ― including the elimination of funding for the Special Olympics ― in a hearing before House lawmakers on Tuesday. It didn’t go well. According to Education Week, the proposal released earlier this month would gut at least 29 programs in an attempt to save some $7 billion. “We had to make some difficult decisions with this budget,” DeVos told a House subcommittee. “Madam Secretary, I have to say, and maybe it’s offensive: Shame on you,” Rep. Rosa DeLauro (D-Conn.) said per CNN. The suggested budget has little chance of making it into law; the Trump administration has proposed similar cuts in previous years that didn’t pass when Republicans controlled the House. With Democrats now holding the purse strings, it’s even less likely to pass. But if the Special Olympics cuts were enacted, more than 10 percent of the organization’s revenue would be impacted. Rep. Mark Pocan (D-Wis.) asked DeVos how many kids would be affected by the proposed Special Olympics cuts. DeVos said she didn’t know. “It’s 272,000 kids,” he replied. DeVos admitted that the Special Olympics was an “awesome organization” but noted that it also received support from philanthropic groups. DeVos, a billionaire, even donated a portion of her salary to the organization last year. More than two years ago, she met with Special Olympics athletes and shared this image on Twitter: This week, that old image received many new replies: You hurt people. Your life hurts people. DeVos pushed back on the negative public reactions to the budget proposal in a statement on Wednesday. “The Special Olympics is not a federal program,” the statement said. “It’s a private organization. I love its work, and I have personally supported its mission. Because of its important work, it is able to raise more than $100 million every year. There are dozens of worthy nonprofits that support students and adults with disabilities that don’t get a dime of federal grant money.” This story has been updated with a statement from Betsy DeVos.",
      "date": "03/27/2019 02:24 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Betsy DeVos May Rescind Title IX Guidelines. Here’s What That Could Mean.",
      "url": "https://search.huffpost.com/click/_ylt=Awr9CWvAqatdyVcAHdFsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560001/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fbetsy-devos-may-rescind-title-ix-guidelines-heres-what-that-could-mean_n_59aff829e4b0dfaafcf443e5/RK=2/RS=mAfTUA13zQ3cls22bdqlsFzc8Og-",
      "subtitle": "Advocates say rolling back the 2011 Dear Colleague Letter would send a startling message to student survivors of sexual assault.",
      "author": "Alanna Vagianos",
      "content": " Secretary of Education Betsy DeVos will reportedly make a major announcement this Thursday regarding the department’s stance on Title IX. According to BuzzFeed’s Tyler Kingkade, DeVos will reportedly speak about the college campus gender equality policy that’s “centered around equal opportunity and equal protection for all” at George Mason University’s Law School in Arlington, VA. Since DeVos was confirmed in February, many advocacy groups have raised concerns that the Secretary of Education would roll back Title IX guidelines. While Title IX is best known as a broad tool for enforcing equal treatment of female and male student athletes, it also offers other important protections in areas including sexual harassment, sexual assault, and protections for trans and parenting students. In the past six months DeVos rescinded protections for transgender students and made the investigation process for college sexual assault less transparent, while also threatening to cut resources and funding. One impactful directive on campus sexual violence is the 2011 Dear Colleague Letter, a comprehensive set of guidelines that clarifies what schools’ responsibilities are under the law to enforce Title IX. According to BuzzFeed, insiders expect DeVos to discuss Obama-era policies on campus sexual violence such as the 2011 Dear Colleague Letter on Thursday, and potentially roll them back. Managing Director of End Rape on Campus Jess Davidson explained to HuffPost that if DeVos rescinds the Dear Colleague Letter, it will send a strong message to both survivors and universities. “I’m very concerned about what it means for the federal government’s view on sexual assault, and their view on survivors, for them to possibly rescind a guidance that is critical in helping students understand what their own rights are,” Davidson said. “That is a very bad leadership signal and I believe it would have a trickle-down effect to university presidents and to other community leaders. If the government doesn’t think that this is important than why should they?” The Dear Colleague Letter is essentially a reminder to universities and Title IX administrators that schools need to follow the Title IX law. Alexandra Brodsky, a civil rights attorney and co-founder of anti-sexual violence organization KnowYourIX, told HuffPost that if DeVos were to rescind the letter it would not change the law. “If DeVos stands up on stage on Thursday and says that the 2011 Dear Colleague Letter is rescinded, the law hasn’t changed at all. Survivors have the same rights, schools have the same responsibility,” Brodsky said. Davidson and Brodsky agreed that rolling back the Dear Colleague Letter would simply make the campus sexual violence reporting process that much more confusing ― for survivors and universities. “It helps students understand what their rights are,” Davidson said. “But it’s not just survivors who are really going to struggle with this. The people who use the 2011 Dear Colleague Letter the most ― or are supposed to use it the most ― are Title IX administrators, the people who are conducting these investigations on campuses across the country. It’s going to be really hard for them to do their jobs effectively if they don’t have this kind of guidance. Schools need more clarification, not less.” In July, DeVos met with three groups to discuss sexual violence on college campuses in separate 90-minute roundtable discussions. The groups included survivors and advocates, university representatives and attorneys, and ― by far the most controversial ― students who had been falsely accused of assault. Brodsky, who was at the July meeting, said that in those discussions with DeVos the overwhelming consensus from universities and legal representatives was that the department should not rescind the Dear Colleague Letter. Davidson, who was also in attendance at the July meetings, noted that most of the “wrongfully accused” advocates were from Men’s Rights Activists (MRA) groups. These groups tend to believe that sexual violence is over-reported, and that false accusations happen more often than they actually do. (According to research, 2 to 10 percent of reported rapes turn out to be false.) “Among communities that believe [survivors cry rape], I think they see rescinding the Dear Colleague Letter as a win because they believe that it will help prevent kangaroo courts,” Davidson said. The Dear Colleague Letter, however, does include guidelines to help both parties ― the victim and the alleged attacker ― navigate the reporting process fairly. “A lot of this conversation arranged around the Dear Colleague Letter is that it’s a threat to the procedural rights of accused students,” Brodsky noted. “But actually the Dear Colleague Letter and Title IX provide more robust protections than are available under the U.S. Constitution.” On a more granular level, rescinding the Dear Colleague Letter would impact the ability of survivors to ensure their schools are following Title IX procedures. Davidson said that when she was a college student going through the Title IX process, she was able to access the Dear Colleague Letter online and hold her university accountable. “I was able to very easily find the 2011 Dear Colleague Letter online, highlight the sections that were not being followed in my proceeding, and take it to the Title IX office and say, ‘This is what you’re not doing and it’s wrong and I deserve a fairer process than this, in fact I’m guaranteed it under Title IX,’” she told HuffPost. “If we rescind the guidance it makes it harder for students to do that. It makes it harder for students to stand up for their own civil rights and to know their own civil rights.”",
      "date": "09/06/2017 01:01 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "How Betsy DeVos Became The Most Hated Cabinet Secretary",
      "url": "https://search.huffpost.com/click/_ylt=Awr9CWvAqatdyVcAG9FsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560001/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fbetsy-devos-most-hated-secretary_n_59ee3d3be4b003385ac13c9b/RK=2/RS=AkwOyAvBm17TnT1jWaQQaOd4F9g-",
      "subtitle": "Meet the new Democratic boogeyman for 2018.",
      "author": "",
      "content": "WASHINGTON ― Cabinet secretaries are rarely household names. For every Colin Powell and Hillary Clinton, there are 10 Ann Venemans and Anthony Foxxes. If an official does gain wider name recognition, it’s usually someone in a higher position like the attorney general or secretary of state. Under President Donald Trump, however, something different is happening: Everyone hates the education secretary, the person who is 16th in line to the presidency and controls only 3 percent of the federal budget. Lawmakers and activists say they’ve heard more about Betsy DeVos than any other Cabinet secretary ever ― often from people who aren’t usually politically engaged. “All the time,” said Sen. Elizabeth Warren (D-Mass.). “This is true in town halls, when I’m walking down the sidewalk in my neighborhood, when I go into the grocery store. People come up to me to talk about Betsy DeVos. There’s just no comparison. I’ve never had this happen with any other Cabinet secretary.” “There is no one in America more unpopular than Betsy DeVos,” said Sen. Jeff Merkley (D-Ore.). “To have somebody who scorns public education, who never went to a public school, her children never went to a public school... to be in charge of public education is an outrage.” A HuffPost/YouGov poll conducted Oct. 9-10 found that, indeed, DeVos is Trump’s most unpopular Cabinet official, alongside Jeff Sessions, the much more visible attorney general. DeVos and Sessions both have a 42 percent unfavorability rating in that poll. When asked which Cabinet members are doing a “bad job,” 32 percent of respondents picked Sessions and 32 percent picked DeVos. Thirty-seven percent of respondents said DeVos is doing a worse job than her predecessors, with just 20 percent saying she’s doing better and 12 percent saying she’s doing about the same. A recent Morning Consult/Politico poll had similar results: DeVos was Trump’s most unpopular Cabinet secretary, with a net favorability rating of -12 percent, followed by Sessions, who was at -4 percent. And in June, New York Times columnist Gail Collins conducted a reader poll for worst Trump Cabinet member. DeVos won. DeVos is now a household name for many Democrats ― so much so that she has essentially become a new boogeyman for 2018. Democratic candidates nationwide are mentioning her in their fundraising emails. A Democratic operative who works on Senate races said that emails and communications about DeVos “tend to perform very strongly.” Democratic groups certainly mounted a determined campaign against DeVos’ confirmation, and they continue to hammer her today. But they did that for a number of nominees, most of whom didn’t become as despised as the education secretary. What’s so different about DeVos? In the Trump Cabinet, it turns out, you can more or less get away with being a plutocrat, a dilettante or a saboteur hostile to the very mission of the agency you mean to lead. You just can’t get away with being all three at once. The Department of Education did not respond to HuffPost’s requests for comment. Spend any time talking to people about DeVos, and what you’ll hear over and over is that she has no experience in public education. She never went to public school, never sent her kids to public school and never worked in a public school. (She did volunteer in one, however.) What DeVos had was political connections, thanks to her family’s fortune. She’s a billionaire, the daughter-in-law of the co-founder of Amway, the multilevel marketing corporation. She’s long been active in the Michigan Republican Party and is a major donor. “My family is the biggest contributor of soft money to the Republican National Committee,” she wrote in Roll Call in 1997. “I have decided to stop taking offense at the suggestion that we are buying influence. Now I simply concede the point. They are right. We do expect something in return. We expect to foster a conservative governing philosophy consisting of limited government and respect for traditional American virtues. We expect a return on our investment.” DeVos’ driving cause has been “school choice.” In Michigan, she led the push to use public dollars to pay for private school tuition through vouchers and other means. That experiment has been a success for banks and hedge funds, and a resounding failure for many students. A 2016 report by the Education Trust-Midwest, a nonprofit, concluded that under the model shaped by DeVos, “Michigan’s K-12 system is among the weakest in the country and getting worse. In little more than a decade, Michigan has gone from being a fairly average state in elementary reading and math achievement to the bottom 10 states. It’s a devastating fall.” DeVos wasn’t an education expert. She was, as The Washington Post pointed out, essentially a lobbyist who used her money to push an agenda that didn’t have much evidence of success to back it up. Her defenders, however, say she is a passionate advocate of returning control of education to parents, so that they can decide how their money is used. She has used her money to commit herself to education, these defenders say, and she’s dedicated to helping children. Democrats and education experts in certain circles knew about DeVos before Trump nominated her for education secretary. But she wasn’t widely recognizable ― until her confirmation hearing, that is. DeVos’ performance at her January hearing may have been one of the worst ever for a Cabinet nominee. She didn’t know about a key federal law that protects students with disabilities. She tried to argue that guns may be acceptable in schools, saying a school out West, for example, might need to protect against grizzly bears. She confused two different ways to measure student achievement — by proficiency or by growth — even though they’re hot topics of debate in education circles. And she refused to commit to enforcing federal regulations meant to protect student borrowers from programs that leave them buried in debt with few employable skills. “She seemed to know very little about public education,” said Sen. Al Franken (D-Minn.), who was a member of the committee that questioned DeVos. “And of course, her office is one where someone should know an incredible amount about public education.” DeVos’ disastrous performance translated to internet gold for the activists opposing her. Clips of DeVos struggling to answer questions from Democratic senators quickly went viral. “To be honest, she just did all the work for us at the hearing,” said one Democratic congressional staffer who requested anonymity to speak openly. “She was so good at explaining how unqualified she was for the job.” Franken was the one who questioned DeVos about the difference between the “proficiency” and “growth” approaches to measuring student achievement ― a difference that DeVos eventually admitted she didn’t know about. “In the aftermath of her hearing, I did hear a tremendous amount about my questioning of her and the whole hearing in general,” Franken said. About a week after the hearing, Franken was out to dinner with former Vice President Walter Mondale at a restaurant in Minneapolis. Mondale took the senator to the back of the restaurant to meet the staff. “There was a guy who was carrying plates to wash, and he just said to me, ‘Thanks for your questions to DeVos. Please vote against her,’” Franken said. “This wasn’t someone who was a member of the teachers’ union, at least as far as I can tell. He was working in the kitchen. That happened a lot. It was people from all walks of life who were just taken with how bad that hearing was.” Josh Nelson is deputy political director at the progressive activist group Credo, which mobilized against DeVos’ nomination. His group has done thousands of petitions over the past decade, but they’ve never seen anything like the response to DeVos. “CREDO has fought to block the confirmation of more than a dozen Trump nominees and the campaign opposing Betsy DeVos resonated with our members more than any of the others,” Nelson said in an email. “Our petition generated 1,500,000 signatures ― far more than any other petition we have ever run... We believe it was the largest petition opposing a cabinet nominee in U.S. history.” Their members also made more than 100,000 phone calls to Senate offices, working closely with unions ― the American Federation of Teachers and the National Education Association ― and other progressive groups. NEA said that in just one month, it sent more than 1.2 million emails and made more than 40,000 phone calls concerning DeVos’ confirmation. Parents and teachers are highly networked. They organize school concerts, field trips, bake sales and all sorts of other events on a daily basis. As it turns out, they can also organize opposition to a Cabinet secretary. “We’ve never had an outpouring like that,” said NEA President Lily Eskelsen Garcia. “And by the way, those weren’t all our members.” NEA members posted messages to Facebook urging others to oppose DeVos, Eskelsen Garcia said, and then “they called their friends and neighbors, they organized their church groups. They got a lot of parents and community folks to make those phone calls too.” Some people have wondered whether DeVos has taken extra heat because she’s a woman ― one of just two in Trump’s Cabinet. Meghan McCain, author and daughter of Sen. John McCain (R-Ariz.), said she found the backlash to DeVos “a little sexist.” Thurston Domina, an associate professor of education policy at the University of North Carolina, told NPR that DeVos is “no more clueless or ideologically awful than some other appointees, but we have a cultural role for a man who’s sort of a cowboy and comes in.” Because of this double standard, Domina said, DeVos comes off looking like a “lady who lunches.” Eskelsen Garcia, the first female president of the NEA in 25 years, rejected the idea that DeVos is facing greater opposition because of her gender. “Betsy DeVos is unpopular because of her policies,” she said. “Any attempt to make her somehow the victim of some kind of discrimination herself is absolutely not supported by anything I’ve ever seen.” DeVos isn’t the first female education secretary ― that was Shirley Hufstedler, who held that position during the Carter administration. Most recently, Margaret Spellings served as education secretary from 2005 to 2009. Over the years, AFT has clashed with plenty of government officials ― including those in Democratic administrations. But there was a key difference, said Randi Weingarten, the union’s president: “There was always a common ground... about public education. They didn’t actively try to kill what is foundational to democracy.” DeVos, of course, did end up getting confirmed. But the circumstances were embarrassing: Vice President Mike Pence had to break the tie, giving her the smallest margin of confirmation ever. Pence had to cast a vote in his role as president of the Senate because two Republican senators ― Susan Collins of Maine and Lisa Murkowski of Alaska ― decided to join with a united Democratic caucus in opposing DeVos’ confirmation. In a speech announcing her opposition, Collins expressed her surprise at DeVos’ unfamiliarity with the Individuals with Disabilities Education Act, which had flummoxed the nominee during her hearing. Ultimately, Collins said, an education secretary needs to support strengthening public education. “The mission of the Department of Education is broad, but supporting public education is at its core,” she said. “I am concerned that Mrs. DeVos’ lack of experience with public schools will make it difficult for her to fully understand, identify, and assist with those challenges, particularly for our rural schools in states like Maine.” Murkowski, like Collins, is from a rural state and said she was concerned that DeVos wasn’t fully committed to helping students “who are not able to access an alternative choice in education as in so many of my communities.” Also key to Murkowski’s opposition, she said, was the outpouring of disapproval from Alaskans. “I have heard from thousands ― truly thousands of Alaskans who have shared their concerns about Mrs. DeVos as secretary of education,” she said in a speech on the Senate floor. “They’ve contacted me by phone, by email, in person. Their concerns center, as mine do, on Mrs. DeVos’ lack of experience with public education and the lack of knowledge she portrayed at her confirmation hearing.” Alyse Galvin, a founding member of Great Alaska Schools, was a major spearhead of that opposition, which targeted both of the state’s senators. She and other education advocates in Alaska organized a “Betsy DeVos Tie-Breaker Telethon” on Facebook Live, urging people to call them and give their thoughts about DeVos. They then displayed the results and noted where they were coming from. “It was a really obvious visual reminder to people about where Alaskans stood with DeVos,” Galvin said. The top reason people said they opposed DeVos was because of her lack of experience in public education. “Every teacher ― and I would say a lot of parents ― know the name ‘Betsy DeVos,’” Galvin said. “And I would say most people in the nation, up until this year, have never known who their education secretary is... We’ve trusted that it’s going to work. When word got around that this person has never even set foot really as an educator in public education, there was no doubt that people were going to start paying attention.” Republicans who oppose DeVos say it’s not against the party’s philosophy to support public education. Indeed, the vast majority of Americans send their children to public schools, and for the most part, people are happy with their local schools. Ginny Evans is a high school teacher in a Dallas suburb and a member of the NEA. She voted for Trump. “School choice is, to me... whether I’m going to have my child go to [public] school in Plano or go to school in Lewisville,” she said. “It’s not charter schools. I’m going to keep our dollars in public education. And there is no way our most vulnerable ― our special education kids ― there is no way they can even get the quality education that they deserve in a charter school. There’s not enough there.” David Kinsella is a high school teacher in Prince William County, Virginia, who identifies as a moderate Republican (he didn’t vote for Trump). He, too, is a member of the NEA, and he said he doesn’t like that DeVos seems more interested in helping the “charter school industry” than helping public schools and the students who attend them. He noted that in many places, like Virginia, there isn’t much demand for charter schools. A genuinely conservative approach, he said, would be to respect those choices rather than pushing charter schools on communities. “We’ve always had a history of supporting public schools,” he said. “I don’t know why suddenly we all have to change because Betsy DeVos arrives on the scene. All Republicans [aren’t] going to change their philosophy and say, ‘OK! Out with public schools. Let’s bring in the private charter schools and let’s help that industry and help them get ahead.’” DeVos may be in office, but the opposition to her hasn’t stopped. Just days after her confirmation in early February, she decided to visit a middle school in Washington, D.C. She encountered protesters, who shouted “Shame!” and forced her to retreat to her car with her security detail. “I respect peaceful protest and I will not be deterred in executing the vital mission of the Department of Education,” DeVos later said. “No school door in America will be blocked from those seeking to help our nation’s schoolchildren.” Since then, DeVos has consistently faced protests. Betsy DeVos at GWU #SupportSurvivors #INeedTitIeIX https://t.co/Os2o7geXXc One of the most notable protests occurred in May at Bethune-Cookman University, a historically black college in Daytona Beach, Florida. Students booed DeVos, who was giving a commencement address, and about half of the graduating students turned their backs on her. Dominik Whitehead, a BCU graduate, was the lead organizer. He decided to do something about DeVos’ appearance at his alma mater after hearing that she had co-opted HBCUs for her own agenda, saying historically black schools were pioneers of ”school choice.” In reality, HBCUs were a response to Jim Crow laws that barred African-Americans from attending white schools. In other words, they didn’t really have much choice. Ultimately Whitehead organized more than 60,000 people to sign online petitions objecting to DeVos’ speech. DeVos has aggressively pushed her agenda since taking office, even though she had little support for her confirmation. “You’d think that someone who came in in that manner would tiptoe carefully and adopt a listening posture and move with some humility,” said the congressional staffer. “We just haven’t seen that. She’s been gangbusters on a lot of things, particularly on our rolling back all sets of protections for students.” After reportedly putting up an initial resistance, DeVos went along with the Trump administration’s decision to rescind protections for transgender students that allowed them to use the restroom that best corresponded to their gender identity. DeVos rescinded Obama administration rules on how colleges should handle sexual assault, leaving advocates worried that the move could help shield those who have been accused. She withdrew consumer protections for student loan borrowers and reinstated heavy fees for some borrowers who default. And in April, DeVos hired a woman to head the Office for Civil Rights who once claimed she’d experienced discrimination in college for being white. “What she’s been effective in is creating a platform for herself and for her colleagues that now, people have to fight against,” Weingarten said. “So instead of taking the tremendous energy and aspiration and the hope and glow in the aftermath of changing No Child Left Behind and rolling up our sleeves to focus on teaching and learning, we’re back in the school wars. How is that fair to kids?” “It’s breathtaking,” Warren said. “She doesn’t even pretend that she’s working for students... She has filled the room with for-profit college hacks and has clearly picked their side over and over. She’s been very effective at rolling back rules that were in place to try to get some accountability with the for-profit colleges.” The fight has continued to energize activists and union members. “We have never seen more energy than we’re seeing right now,” Eskelsen Garcia said. “We have actually had our phones ringing off the hooks. The increased activism of our members and parents and community leaders saying, ‘Put me in, Coach. What can I do to fight this horrible agenda of this secretary of education?’ We’ve never seen anyone in charge of public education and protecting students be so remiss in their job.” “It’s awoken an activism by a lot of people who weren’t active before,” Weingarten said. Warren has kept an eye on DeVos with a project called DeVos Watch. The oversight campaign focuses on how DeVos’ work affects student loan borrowers. Over the summer, Warren had a victory when she teamed up with Sen. Roy Blunt (R-Mo.) to stop the Department of Education from giving management of the entire $1.2 trillion federal student loan portfolio to just one company, rather than the nine companies that currently manage it. “You’d have a completely non-competitive market for the student loan serving and a too-big-to-fail company, making, I should say, hundreds of millions of dollars,” Warren said. “This is big money. And she just announced that this is how she’s going to do it.” DeVos backed off from her plan after Blunt and Warren introduced their legislation. “Change is possible. I’ve seen it. I’ve seen it even with Betsy DeVos,” Warren said. “But you don’t get what you don’t fight for. And that’s why it’s important to be in these fights.” DeVos is still moving forward where she can. Last week, she rescinded 72 documents that were intended to provide clarity about students’ rights and how schools can use federal money. The Education Department determined the documents were unnecessary. One of the key federal laws they provided guidance on? The Individuals with Disabilities Education Act ― which DeVos hadn’t heard of at her hearing just a few months ago. Ariel Edwards-Levy contributed reporting. Want more updates from Amanda Terkel? Sign up for her newsletter, Piping Hot Truth, here.",
      "date": "10/24/2017 05:46 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "9 Teachers On Why They Oppose Betsy DeVos As Education Secretary",
      "url": "https://search.huffpost.com/click/_ylt=Awr9CWvAqatdyVcAGdFsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560001/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2f8-teachers-on-why-they-oppose-betsy-devos-as-education-secretary_n_587fb887e4b0cf0ae8818b58/RK=2/RS=FNihKIL0hddsNaT1CDd5j0ytZ_E-",
      "subtitle": "null",
      "author": "",
      "content": "",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Betsy DeVos Comes Clean: A Fiction",
      "url": "https://search.huffpost.com/click/_ylt=Awr9CWvAqatdyVcAF9FsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560001/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fbetsy-devos-comes-clean-a-fiction_b_59ed3292e4b092f9f241935c/RK=2/RS=SN33CMXp42LkweCnSXq7zHfvlX4-",
      "subtitle": "null",
      "author": "Mercedes Schneider",
      "content": " One of US ed sec Betsy DeVos’ preferred phrases is “let me be clear.” She has used the phrase in numerous speeches/public responses (see here and here and here and here). However, I wonder what DeVos would say if she actually decided to be clear concerning her motivations in promoting two stock DeVosian ideas: 1) decision making *left to the states* and 2) hyperindividualism in school choice (i.e., that an education “system” is somehow a falsehood, an artifact of centuries past, or somehow in conflict with what is “best for each child”). What if Betsy allowed America’s middle class behind the veil of her public words? How would such a speech read? Below is my take on that very idea: Clear Betsy. Without further ado, let the dance between fiction and reality begin. *** First of all, I’d like to thank all of you for coming because I appreciate yet another opportunity to campaign in a manner that ultimately promotes my favorite minority, the one to which I belong: America’s elite among elite, those possessing the top .1% in American net worth. One way to understand my elitist motivations is to study the history and positions of the American Legislative Exchange Council (ALEC). Of course, I would have preferred that ALEC be kept from public awareness, which it was for almost four decades. However, the unfortunate truth is that those without the interests of corporate America in mind destroyed that beautiful ALEC secrecy in 2012. The ALEC end game is to supplant federal control over states with corporate control. We prefer to promote this idea as federalism, or state control. The reality is states are ripe for control, and that control might as well come from moneyed interests– the .1%– rather than the federal government. The beauty in promoting “state control” is that those outside of the top .1% (or, let’s be generous, outside of the top 1%) hear the term “state control” and equate it with “local control.” Though I occasionally mention local control, I do not ultimately advocate for local control. You will not hear me give a speech in which I advocate replacing state control with local control. Local control is too close to you people, and, as such, corporate interests become more difficult to serve because it is the state legislators (and therefore, statehouses) that ALEC corporations control, not usually the local politicians. Besides, we lose the ability to hide our ALEC intentions behind federal scapegoating if we do not center our pseudo-local arguments on state control, and the best way to fool the public is to divert attention from the corporate control we desire by actively campaigning for federal control over states as the ultimate problem. On the food truck of state control, local control is the condiments.  I know about food trucks because I have seen them, and I have seen the condiments, as well. As for my constant focus on the individual when it comes to school choice: Such a diversion is necessary in order to keep you people from forming and relying upon collectives. Anyone outside of the .1% does not stand a chance against us individually; we can bulldoze such outsiders easily via our vast financial resources. But when you people join together and pool your resources, well, that presents more of a problem. Not only do you begin to challenge us via your resources (one of which constitutes your very selves as a work force for our beloved corporations); your numbers draw attention to issues, attention that frankly slides the veil just a shade too far back from our self-serving motives. That is why I hate unions. Now, it does not serve me to state so directly, so I instead prefer to appeal to the ideal of American individualism– an ideal, as I already mentioned, easily subdued. As easy as leading one sheep away from the flock and into a dark wood in which one wolf awaits. The single sheep who believes that one-on-one with a single wolf makes a fair match comes to a similar end as the single middle-class worker who believes his individuality equips him to effectively negotiate the terms of his employment with a single corporate magnate. An individual worker who does not know his place can be replaced with little to no interference in production. Though the sheep-wolf analogy breaks down if one considers that an entire flock of sheep poses no threat to a single wolf, a collective of middle class workers can pose a threat to corporate power– thus the need to fragment middle-class (and lower-class, for that matter) unity. The same lack of individual power holds true of school choice. Break up the collective by first convincing parents that their individual voices drive school choice. In reality, the so-called “empowered” parent has no power to make a school work for his or her child. However, convincing parents to Look Out for Number One, in turn, destabilizes the financial well-being of the community school (which I like to call outdated, just to push parents even further along the hyper-individualistic path), which, in turn, ideally leads to the freeing up of all of that public money to end up where it should be: under private sector control. Once the money hits the private sector, it becomes easier to funnel upward, and as that money makes its sure way into the bank accounts of corporate America, the power of the .1% is strengthened regardless of the state of the American economy, with you people increasingly dependent upon us. That is, if we can continue to successfully cripple that collective. So, now you know the truth of it all. I think I can safely speak for ALEC in general when I say it is nothing personal, just the right of privilege. If you were in my place, I’m sure you would understand. Thank you; enjoy your food trucks, and God bless corporate America. *** Originally posted 10-21-17 at deutsch29.wordpress.com. ***",
      "date": "10/22/2017 08:16 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Democratic Congresswoman Demands Betsy DeVos Resign For Promoting ‘Racist Research’",
      "url": "https://search.huffpost.com/click/_ylt=Awr9CWvAqatdyVcAFdFsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560001/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fkatherine-clark-demands-betsy-devos-resign_n_5ca26e1ae4b04693a945fe6e/RK=2/RS=XslHMc5ZbQTwhuAV8xfAeg4YZRA-",
      "subtitle": "“What Betsy DeVos did that I so object to and find disgusting is she rescinded civil rights policy and cherry-picked racist research to back it up.”",
      "author": "Amy Russo",
      "content": " A Democratic congresswoman is demanding that Education Secretary Betsy DeVos step down, accusing her of supporting race-based punishment of students in light of her push to end an Obama administration policy on fair treatment for minorities in the classroom. “I am calling for her resignation because she has failed to live up to her basic job responsibilities of making sure that our kids have fair and equitable access to a great public education and to keep them safe,” Rep. Katherine Clark (D-Mass.) told MSNBC’s “Morning Joe” on Monday. “What Betsy DeVos did that I so object to and find disgusting is she rescinded civil rights policy and cherry-picked racist research to back it up.” In December, the Trump administration scrapped guidance intended to shield students from racist discipline at school shortly after DeVos recommended the move. In doing so, DeVos cited a Journal of Criminal Justice study that argued that “the use of suspensions by teachers and administrators may not have been as racially biased as some scholars have argued.” The study also claimed that “the racial gap in suspensions was completely accounted for by a measure of the prior problem behavior of the student.” According to U.S. News & World Report, the findings stated that differences in suspension rates across racial groups “appear to be a function of differences in problem behaviors that emerge early in life, that remain relatively stable over time, and that materialize in the classroom.” Clark called out DeVos’ use of the research as an indication that she had failed “to stick up for children” and was therefore “unfit to carry on this job.” The congresswoman denounced DeVos’ use of the research, which she contended was an effort to portray behavioral issues as a matter of “who these children are” in terms of race. Responding to Clark’s criticisms, Department of Education press secretary Liz Hill emailed the following statement on Tuesday: The Secretary rescinded this guidance months ago because she heard repeatedly that it wasn’t working for students or for teachers. For the Congresswoman to show up and try to grab headlines is nothing more than political opportunism at its worst. Secretary DeVos always has and always will fight to make sure every student is treated like an individual and has the opportunity to learn and grow in an environment that is safe and nurturing. DeVos came under fire last month for advocating for the end of federal funding for the Special Olympics, but her proposal was later dismissed by President Donald Trump, who said he told his “people” to keep it in the administration’s budget proposal. This story has been updated with a statement from the Department of Education.",
      "date": "04/01/2019 07:45 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Betsy DeVos’ $40 Million Yacht Set Adrift By Vandals At Ohio Dock",
      "url": "https://search.huffpost.com/click/_ylt=Awr9CWvAqatdyVcAE9FsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560001/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fbetsy-devos-40-million-yacht-set-adrift-by-vandals-at-ohio-dock_n_5b59cf4fe4b0fd5c73cc92ea/RK=2/RS=MLK6DwXcsNstkUeZ2067nwhSnWI-",
      "subtitle": "Someone untied the SeaQuest from its mooring, causing it to ram into a dock and sustain “large scratches and scrapes,” according to a police report.",
      "author": "Hayley Miller",
      "content": " A $40 million yacht owned by the family of Secretary of Education Betsy DeVos was set adrift by vandals at a dock in Ohio last weekend, causing thousands of dollars worth of damage to the vessel, according to the Toledo Blade. The SeaQuest’s captain said his crew awoke Sunday to find the boat had been untied from its mooring at the Huron Boat Basin and was floating away, according to a police report obtained by HuffPost. The crew was “able to gain control of the ship, but not before it struck the dock with its Starboard forward section,” the police report stated. Damage to the yacht consisted of “several large scratches and scrapes,” which the captain estimated would cost between $5,000 and $10,000 to repair, according to the police report. Huron City Police Chief Robert Lippert confirmed to HuffPost that the yacht belonged to the DeVos family. He said DeVos had not been aboard at the time, but could not confirm whether other family members had been. Representatives for DeVos and her family did not immediately respond to HuffPost’s requests for comment. Lippert would not speculate on a potential motive, citing the ongoing investigation. Police had not yet obtained surveillance video of the incident, but were following up on a few potential leads, Lippert said. “Had there been different wind or more wind, [the yacht] could have certainly floated a lot further than it did,” Lippert told HuffPost. The 163-foot yacht is one of 10 boats owned by the DeVos family, the Blade reported. Betsy DeVos is one of the Trump administration’s wealthiest officials, with an estimated net worth of around $1 billion, according to Forbes. Her father founded Prince Corporation, a successful automotive business, and her father-in-law co-founded Amway marketing company. DeVos visited Toledo, Ohio, earlier this month to tour the Correctional Treatment Facility and Penta Career Center, according to her public schedule. Her role as secretary of education has been intensely criticized by public school advocates and LGBTQ activists, who condemn her efforts to strengthen “school choice” initiatives, as well as her decision to rollback LGBTQ student protections imposed under the Obama administration. This article has been updated with additional details about DeVos.",
      "date": "07/26/2018 12:01 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Republicans Make New Push For Program That Would Bolster Private Schools",
      "url": "https://search.huffpost.com/click/_ylt=Awr9CWvAqatdyVcAEdFsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560001/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fbetsy-devos-school-choice_n_5c775fcde4b010e7c563cdab/RK=2/RS=WwqjQVuwQWvSCzP.VOzcpVGVn2U-",
      "subtitle": "Critics say the bill would divert resources from public schools. Betsy DeVos says that’s “fake news.”",
      "author": "Rebecca Klein",
      "content": " Secretary of Education Betsy DeVos came to Washington in February 2017 with a mission ― to increase school choice. On Thursday, Republican legislators like Sen. Ted Cruz (Texas) took DeVos’ dream one step closer to reality, unveiling a bill that could help families use public dollars to pay for private schools and other educational programs like apprenticeships, online learning and special education services. The bill, the Education Freedom Scholarship and Opportunity Act, would give individuals and businesses tax credits for donating to organizations that grant state scholarships. These organizations, in turn, would dole out scholarships to students. Standing beside Cruz and Rep. Bradley Byrne (R-Ala.) at a press conference Thursday morning, DeVos hailed the effort as a “historic investment in America’s students,” framing the issue as one of “education freedom” rather than “school choice.” “What’s missing in education today is at the core of what makes America truly great: freedom,” DeVos said. States will have the ability to opt into the program and shape how the scholarships are used, as well as determining which students are eligible. Cruz told The Daily Caller that his legislation would provide $10 billion in federal tax credits. (The Department of Education, on the other hand, is pushing $5 billion in tax credits.) Individuals could donate to a scholarship organization anywhere in the country under the program, even if their state doesn’t create one. They would be able to donate up to 10 percent of their adjusted gross income, while businesses could give up to 5 percent of their net taxable income. The program would look similar to tax credit programs that already exist in 18 states ― and that opponents say function as school voucher programs by another name. But DeVos and her allies are emphasizing that this bill wouldn’t divert resources from public schools, and could help bolster them, if a state created a program that would allow scholarships to be used in that way. In programs that already exist, tax credits are often used to send low-income children to private schools. But opponents say that when a student leaves a public school for a private one, the public school no longer receives per-pupil funding for that student, even as its fixed costs ― like building infrastructure ― remain the same. DeVos dismissed as “fake news” the idea that the bill is an attack on public education. “The only folks who are threatened are the ones who have a vested financial interest in suppressing education freedom,” she said. Private schools that participate in existing school choice programs ― including vouchers ― aren’t subject to the same accountability or transparency rules as public schools, and a vast majority of them are religious. Over 40 percent of the schools that participate in current programs are non-Catholic Christian schools. Of those schools, at least 30 percent use evangelical textbooks that promote creationism, and sometimes push regressive ideas about race and gender, according to a previous HuffPost investigation. At least 14 percent of religious schools that currently participate in private school choice programs openly discriminate against LGBTQ students, according to a HuffPost investigation. DeVos has previously unsuccessfully proposed injecting federal money into private school choice programs in the Department of Education budget. She has also faced grilling by lawmakers about whether she would allow federal dollars to go to schools that discriminate against LGBTQ students. But at Thursday’s press conference, Cruz called school choice “the civil rights issue of the 21st century.” He was flanked by students and families who have benefited from school choice around the country, including those with special needs. The legislation faces an uphill battle in Congress, and while it has received praise from pro-voucher education reform groups, public school advocacy groups are pushing back against it. “It reflects this administration’s persistent disdain for public education,” said JoAnn Bartoletti, executive director of the National Association of Secondary School Principals, in a statement. A statement from Sen. Patty Murray (D-Wash.) called the proposal “dead on arrival.” But DeVos and Cruz pointed out that President Donald Trump promoted school choice during his campaign, and that he was elected to enact such a program. They also emphasized that the legislation won’t result in any federal mandates, with states designing their programs as they see fit. “The American people elected Donald Trump in part because he pledged to bring school choice to America’s students,” DeVos said.",
      "date": "02/28/2019 01:17 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Betsy DeVos Comes Clean: A Fiction",
      "url": "https://search.huffpost.com/click/_ylt=Awr9IlvfqatdqjMAw69sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560031/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fbetsy-devos-comes-clean-a-fiction_b_59ed3292e4b092f9f241935c/RK=2/RS=EiTANaXK4GsF42nXG8lPBvTyaHY-",
      "subtitle": "null",
      "author": "Mercedes Schneider",
      "content": " One of US ed sec Betsy DeVos’ preferred phrases is “let me be clear.” She has used the phrase in numerous speeches/public responses (see here and here and here and here). However, I wonder what DeVos would say if she actually decided to be clear concerning her motivations in promoting two stock DeVosian ideas: 1) decision making *left to the states* and 2) hyperindividualism in school choice (i.e., that an education “system” is somehow a falsehood, an artifact of centuries past, or somehow in conflict with what is “best for each child”). What if Betsy allowed America’s middle class behind the veil of her public words? How would such a speech read? Below is my take on that very idea: Clear Betsy. Without further ado, let the dance between fiction and reality begin. *** First of all, I’d like to thank all of you for coming because I appreciate yet another opportunity to campaign in a manner that ultimately promotes my favorite minority, the one to which I belong: America’s elite among elite, those possessing the top .1% in American net worth. One way to understand my elitist motivations is to study the history and positions of the American Legislative Exchange Council (ALEC). Of course, I would have preferred that ALEC be kept from public awareness, which it was for almost four decades. However, the unfortunate truth is that those without the interests of corporate America in mind destroyed that beautiful ALEC secrecy in 2012. The ALEC end game is to supplant federal control over states with corporate control. We prefer to promote this idea as federalism, or state control. The reality is states are ripe for control, and that control might as well come from moneyed interests– the .1%– rather than the federal government. The beauty in promoting “state control” is that those outside of the top .1% (or, let’s be generous, outside of the top 1%) hear the term “state control” and equate it with “local control.” Though I occasionally mention local control, I do not ultimately advocate for local control. You will not hear me give a speech in which I advocate replacing state control with local control. Local control is too close to you people, and, as such, corporate interests become more difficult to serve because it is the state legislators (and therefore, statehouses) that ALEC corporations control, not usually the local politicians. Besides, we lose the ability to hide our ALEC intentions behind federal scapegoating if we do not center our pseudo-local arguments on state control, and the best way to fool the public is to divert attention from the corporate control we desire by actively campaigning for federal control over states as the ultimate problem. On the food truck of state control, local control is the condiments.  I know about food trucks because I have seen them, and I have seen the condiments, as well. As for my constant focus on the individual when it comes to school choice: Such a diversion is necessary in order to keep you people from forming and relying upon collectives. Anyone outside of the .1% does not stand a chance against us individually; we can bulldoze such outsiders easily via our vast financial resources. But when you people join together and pool your resources, well, that presents more of a problem. Not only do you begin to challenge us via your resources (one of which constitutes your very selves as a work force for our beloved corporations); your numbers draw attention to issues, attention that frankly slides the veil just a shade too far back from our self-serving motives. That is why I hate unions. Now, it does not serve me to state so directly, so I instead prefer to appeal to the ideal of American individualism– an ideal, as I already mentioned, easily subdued. As easy as leading one sheep away from the flock and into a dark wood in which one wolf awaits. The single sheep who believes that one-on-one with a single wolf makes a fair match comes to a similar end as the single middle-class worker who believes his individuality equips him to effectively negotiate the terms of his employment with a single corporate magnate. An individual worker who does not know his place can be replaced with little to no interference in production. Though the sheep-wolf analogy breaks down if one considers that an entire flock of sheep poses no threat to a single wolf, a collective of middle class workers can pose a threat to corporate power– thus the need to fragment middle-class (and lower-class, for that matter) unity. The same lack of individual power holds true of school choice. Break up the collective by first convincing parents that their individual voices drive school choice. In reality, the so-called “empowered” parent has no power to make a school work for his or her child. However, convincing parents to Look Out for Number One, in turn, destabilizes the financial well-being of the community school (which I like to call outdated, just to push parents even further along the hyper-individualistic path), which, in turn, ideally leads to the freeing up of all of that public money to end up where it should be: under private sector control. Once the money hits the private sector, it becomes easier to funnel upward, and as that money makes its sure way into the bank accounts of corporate America, the power of the .1% is strengthened regardless of the state of the American economy, with you people increasingly dependent upon us. That is, if we can continue to successfully cripple that collective. So, now you know the truth of it all. I think I can safely speak for ALEC in general when I say it is nothing personal, just the right of privilege. If you were in my place, I’m sure you would understand. Thank you; enjoy your food trucks, and God bless corporate America. *** Originally posted 10-21-17 at deutsch29.wordpress.com. ***",
      "date": "10/22/2017 08:16 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Betsy DeVos Compares School Choice Critics To ‘Flat-Earthers’",
      "url": "https://search.huffpost.com/click/_ylt=Awr9IlvfqatdqjMAwa9sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560031/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fbetsy-devos-school-choice-flat-earthers_n_5924a9b7e4b0ec129d30556f/RK=2/RS=X9tHtfubkyy2k_2SLzTU6T6ItIU-",
      "subtitle": "The education secretary accuses critics of hindering innovation, then calls Trump’s budget, which would cut education 13 percent, a “historic investment” in students.",
      "author": "Kate Abbey-Lambertz",
      "content": " Opponents of school choice policies are akin to “flat-earthers” who are fighting innovation in education, Secretary of Education Betsy DeVos said Monday night. DeVos gave a speech praising President Donald Trump’s plans for the “most ambitious expansion of education choice in our nation’s history ― a day before his administration released a budget proposal that would slash Education Department funding by more than $9 billion. “The time has expired for ‘reform.’ We need a transformation ― a transformation that will open up America’s closed and antiquated education system,” DeVos said at the American Federation for Children’s annual National Policy Summit in Indianapolis. “Defenders of our current system have been regularly resistant to any meaningful change. In resisting, these ‘flat-earthers’ have chilled creativity and stopped American kids from competing at the highest levels.” DeVos chaired the AFC, which advocates for school choice, before Trump nominated her to lead the Department of Education. She also suggested that refusal to embrace school choice was like hanging on to your flip phone in the age of smartphones and said that she wanted to “drag American education out of the Stone Age.” DeVos likely used the term “flat-earthers” to refer to people who believe in an outdated, discredited theory, but she has faced criticism for her support of religious education, which in some institutions undermines scientific theory. She has made significant donations to a Michigan private school that taught creationism alongside evolution in science classes and has served on its board. A billionaire who has long been involved in education advocacy, DeVos has pushed for school choice and reforms that would benefit parochial and private schools. School choice policies include expanding charter schools and voucher programs that let students use the public dollars allocated for their schooling to enroll in different districts or in charter or private schools. DeVos believes these policies give kids more opportunities and access to better schools. Critics see school choice as kneecapping public education, particularly poorer school districts and their students. Trump’s 2018 budget, released Tuesday, calls for a 13 percent decrease in funding for the Education Department and major changes to student loan programs. For K-12 education, it would actually increase funding for school choice initiatives, adding $1 billion in grants for school districts, $167 million for a charter school program and $250 million for a program that gives low-income families scholarships for private and parochial schools. The cuts will hit various programs that enjoy broad bipartisan support, The Atlantic noted, including state grants for career and technical education and the federal work-study program. A $2.3 billion program that supports professional development and class-size reduction would be eliminated, as would $1.2 billion in grants for after-school and summer school programs used by nearly 2 million students. DeVos said in a statement that the budget “makes an historic investment in America’s students” and gives states and parents more decision-making power. She explained away the cuts as “tough choices we have had to make when assessing the best use of taxpayer money” and said the administration is “taking a hard look at programs that sound nice but simply haven’t yielded the desired outcomes.” The budget is only a proposal and needs approval by Congress, where it will face steep opposition. But the potential cuts have appalled education advocates. The “shortsighted and cruel proposal” is “an assault on the American Dream,” said John King, president of the Education Trust and former education secretary under President Barack Obama. It “would make the climb to success much steeper for all our young people, especially students of color and students from low-income families,” King said.",
      "date": "05/23/2017 06:59 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Democratic Congresswoman Demands Betsy DeVos Resign For Promoting ‘Racist Research’",
      "url": "https://search.huffpost.com/click/_ylt=Awr9IlvfqatdqjMAv69sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560031/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fkatherine-clark-demands-betsy-devos-resign_n_5ca26e1ae4b04693a945fe6e/RK=2/RS=Oa8yQqGiKSEM1oSrnt8OPPhNo_c-",
      "subtitle": "“What Betsy DeVos did that I so object to and find disgusting is she rescinded civil rights policy and cherry-picked racist research to back it up.”",
      "author": "Amy Russo",
      "content": " A Democratic congresswoman is demanding that Education Secretary Betsy DeVos step down, accusing her of supporting race-based punishment of students in light of her push to end an Obama administration policy on fair treatment for minorities in the classroom. “I am calling for her resignation because she has failed to live up to her basic job responsibilities of making sure that our kids have fair and equitable access to a great public education and to keep them safe,” Rep. Katherine Clark (D-Mass.) told MSNBC’s “Morning Joe” on Monday. “What Betsy DeVos did that I so object to and find disgusting is she rescinded civil rights policy and cherry-picked racist research to back it up.” In December, the Trump administration scrapped guidance intended to shield students from racist discipline at school shortly after DeVos recommended the move. In doing so, DeVos cited a Journal of Criminal Justice study that argued that “the use of suspensions by teachers and administrators may not have been as racially biased as some scholars have argued.” The study also claimed that “the racial gap in suspensions was completely accounted for by a measure of the prior problem behavior of the student.” According to U.S. News & World Report, the findings stated that differences in suspension rates across racial groups “appear to be a function of differences in problem behaviors that emerge early in life, that remain relatively stable over time, and that materialize in the classroom.” Clark called out DeVos’ use of the research as an indication that she had failed “to stick up for children” and was therefore “unfit to carry on this job.” The congresswoman denounced DeVos’ use of the research, which she contended was an effort to portray behavioral issues as a matter of “who these children are” in terms of race. Responding to Clark’s criticisms, Department of Education press secretary Liz Hill emailed the following statement on Tuesday: The Secretary rescinded this guidance months ago because she heard repeatedly that it wasn’t working for students or for teachers. For the Congresswoman to show up and try to grab headlines is nothing more than political opportunism at its worst. Secretary DeVos always has and always will fight to make sure every student is treated like an individual and has the opportunity to learn and grow in an environment that is safe and nurturing. DeVos came under fire last month for advocating for the end of federal funding for the Special Olympics, but her proposal was later dismissed by President Donald Trump, who said he told his “people” to keep it in the administration’s budget proposal. This story has been updated with a statement from the Department of Education.",
      "date": "04/01/2019 07:45 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Betsy DeVos’ $40 Million Yacht Set Adrift By Vandals At Ohio Dock",
      "url": "https://search.huffpost.com/click/_ylt=Awr9IlvfqatdqjMAva9sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560031/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fbetsy-devos-40-million-yacht-set-adrift-by-vandals-at-ohio-dock_n_5b59cf4fe4b0fd5c73cc92ea/RK=2/RS=E7yfVAf0.1NH2vOmORJ4.vLImYo-",
      "subtitle": "Someone untied the SeaQuest from its mooring, causing it to ram into a dock and sustain “large scratches and scrapes,” according to a police report.",
      "author": "Hayley Miller",
      "content": " A $40 million yacht owned by the family of Secretary of Education Betsy DeVos was set adrift by vandals at a dock in Ohio last weekend, causing thousands of dollars worth of damage to the vessel, according to the Toledo Blade. The SeaQuest’s captain said his crew awoke Sunday to find the boat had been untied from its mooring at the Huron Boat Basin and was floating away, according to a police report obtained by HuffPost. The crew was “able to gain control of the ship, but not before it struck the dock with its Starboard forward section,” the police report stated. Damage to the yacht consisted of “several large scratches and scrapes,” which the captain estimated would cost between $5,000 and $10,000 to repair, according to the police report. Huron City Police Chief Robert Lippert confirmed to HuffPost that the yacht belonged to the DeVos family. He said DeVos had not been aboard at the time, but could not confirm whether other family members had been. Representatives for DeVos and her family did not immediately respond to HuffPost’s requests for comment. Lippert would not speculate on a potential motive, citing the ongoing investigation. Police had not yet obtained surveillance video of the incident, but were following up on a few potential leads, Lippert said. “Had there been different wind or more wind, [the yacht] could have certainly floated a lot further than it did,” Lippert told HuffPost. The 163-foot yacht is one of 10 boats owned by the DeVos family, the Blade reported. Betsy DeVos is one of the Trump administration’s wealthiest officials, with an estimated net worth of around $1 billion, according to Forbes. Her father founded Prince Corporation, a successful automotive business, and her father-in-law co-founded Amway marketing company. DeVos visited Toledo, Ohio, earlier this month to tour the Correctional Treatment Facility and Penta Career Center, according to her public schedule. Her role as secretary of education has been intensely criticized by public school advocates and LGBTQ activists, who condemn her efforts to strengthen “school choice” initiatives, as well as her decision to rollback LGBTQ student protections imposed under the Obama administration. This article has been updated with additional details about DeVos.",
      "date": "07/26/2018 12:01 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Republicans Make New Push For Program That Would Bolster Private Schools",
      "url": "https://search.huffpost.com/click/_ylt=Awr9IlvfqatdqjMAu69sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560031/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fbetsy-devos-school-choice_n_5c775fcde4b010e7c563cdab/RK=2/RS=SB57cVT1vkynrtg98EmZMS9Nja0-",
      "subtitle": "Critics say the bill would divert resources from public schools. Betsy DeVos says that’s “fake news.”",
      "author": "Rebecca Klein",
      "content": " Secretary of Education Betsy DeVos came to Washington in February 2017 with a mission ― to increase school choice. On Thursday, Republican legislators like Sen. Ted Cruz (Texas) took DeVos’ dream one step closer to reality, unveiling a bill that could help families use public dollars to pay for private schools and other educational programs like apprenticeships, online learning and special education services. The bill, the Education Freedom Scholarship and Opportunity Act, would give individuals and businesses tax credits for donating to organizations that grant state scholarships. These organizations, in turn, would dole out scholarships to students. Standing beside Cruz and Rep. Bradley Byrne (R-Ala.) at a press conference Thursday morning, DeVos hailed the effort as a “historic investment in America’s students,” framing the issue as one of “education freedom” rather than “school choice.” “What’s missing in education today is at the core of what makes America truly great: freedom,” DeVos said. States will have the ability to opt into the program and shape how the scholarships are used, as well as determining which students are eligible. Cruz told The Daily Caller that his legislation would provide $10 billion in federal tax credits. (The Department of Education, on the other hand, is pushing $5 billion in tax credits.) Individuals could donate to a scholarship organization anywhere in the country under the program, even if their state doesn’t create one. They would be able to donate up to 10 percent of their adjusted gross income, while businesses could give up to 5 percent of their net taxable income. The program would look similar to tax credit programs that already exist in 18 states ― and that opponents say function as school voucher programs by another name. But DeVos and her allies are emphasizing that this bill wouldn’t divert resources from public schools, and could help bolster them, if a state created a program that would allow scholarships to be used in that way. In programs that already exist, tax credits are often used to send low-income children to private schools. But opponents say that when a student leaves a public school for a private one, the public school no longer receives per-pupil funding for that student, even as its fixed costs ― like building infrastructure ― remain the same. DeVos dismissed as “fake news” the idea that the bill is an attack on public education. “The only folks who are threatened are the ones who have a vested financial interest in suppressing education freedom,” she said. Private schools that participate in existing school choice programs ― including vouchers ― aren’t subject to the same accountability or transparency rules as public schools, and a vast majority of them are religious. Over 40 percent of the schools that participate in current programs are non-Catholic Christian schools. Of those schools, at least 30 percent use evangelical textbooks that promote creationism, and sometimes push regressive ideas about race and gender, according to a previous HuffPost investigation. At least 14 percent of religious schools that currently participate in private school choice programs openly discriminate against LGBTQ students, according to a HuffPost investigation. DeVos has previously unsuccessfully proposed injecting federal money into private school choice programs in the Department of Education budget. She has also faced grilling by lawmakers about whether she would allow federal dollars to go to schools that discriminate against LGBTQ students. But at Thursday’s press conference, Cruz called school choice “the civil rights issue of the 21st century.” He was flanked by students and families who have benefited from school choice around the country, including those with special needs. The legislation faces an uphill battle in Congress, and while it has received praise from pro-voucher education reform groups, public school advocacy groups are pushing back against it. “It reflects this administration’s persistent disdain for public education,” said JoAnn Bartoletti, executive director of the National Association of Secondary School Principals, in a statement. A statement from Sen. Patty Murray (D-Wash.) called the proposal “dead on arrival.” But DeVos and Cruz pointed out that President Donald Trump promoted school choice during his campaign, and that he was elected to enact such a program. They also emphasized that the legislation won’t result in any federal mandates, with states designing their programs as they see fit. “The American people elected Donald Trump in part because he pledged to bring school choice to America’s students,” DeVos said.",
      "date": "02/28/2019 01:17 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "DeVos Stands With Scoundrels, Not Students",
      "url": "https://search.huffpost.com/click/_ylt=Awr9IlvfqatdqjMAua9sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560031/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fdevos-stands-with-scoundrels-not-students_b_5a08d3cce4b0f1dc729a6c34/RK=2/RS=9nzrb0Azq_er8VWW._jp1IJlyes-",
      "subtitle": "The department will be on the wrong side of history, the wrong side of justice and the wrong side of our people.",
      "author": "David Halperin",
      "content": " The U.S. Department of Education under Secretary Betsy DeVos this week began the process of dismantling the rules issued under President Obama to constrain the predatory abuses of for-profit colleges. At the end of the troubling first day of what’s called negotiated rule-making, members of the public were given an opportunity to speak.  I was the only person to get up to speak. I said this: This proceeding is blocking a regulation that was carefully considered and carefully crafted to protect students and taxpayers from predatory college abuses. What the department now is doing is a bad idea, and I have submitted public comments explaining why I believe that. But that’s the Washington, D.C. perspective on what’s going on here ― injury to a rule. From the perspective of those hard working Americans who have been defrauded and abused by for-profit colleges ― veterans, single mothers, immigrants, the forgotten Americans whom President Trump promised to fight for ― this proceeding, and this department’s failure to act on 99,000 pending applications for relief, is about something much more urgent. Almost all the students seeking relief attended for-profit colleges. Many were left with useless credits and degrees from high-priced, low-quality programs. They were deceived into enrolling and left without the careers or salaries they were promised. Many nonetheless faithfully pay down their student loans every month, even if that leaves them with little money for rent, food, clothes for their children. This proceeding, and the delay in acting on claims, is causing immense hardship and heartbreak for those Americans. My colleagues and I know these men and women. They’re good people. All they wanted was a chance to pursue their dreams and make better lives for their families. They’re not asking, as Secretary DeVos recently suggested, for “free money,”only to have some of their debts cancelled, so they have some chance for a future. But instead of standing with them, Secretary DeVos and this department are now standing with the people who have caused the harm, the people who have pocketed billions and required taxpayer bailout after taxpayer bailout. There is no sound public policy rationale for delaying and rewriting the borrower defense rule. The rule would quickly start saving money for taxpayers, by pushing the department to remove from federal aid those predatory schools that produce widespread loan defaults. But the issue papers prepared by the department for this meeting reveal its determination to cancel legitimate protections for students and taxpayers. I know and respect some owners and executives of for-profit schools. Some really do want the best for their students. The industry has many good teachers. Some owners expressed legitimate concerns during past rule makings. But over eight years of the last administration, the department took those concerns into consideration, and I believe we ended up with rules and policies that are more than fair to schools, rules that penalize bad actors while rewarding colleges that actually help students train for careers. This process today is, instead, about the corruption of our system. It’s about the blatant desire of some for-profit colleges, which are associated with political appointees, donors, and friends of this administration, to go back to the recent bad old days, when they could act with impunity ― deceiving and abusing students in order to maximize profits. Their misconduct, which has led to scores of federal and state law enforcement actions, and is still very much ongoing, has been a national scandal. And this proceeding extends and embodies that scandal. State attorneys general ― Republicans and Democrats ― will continue to fight against for-profit college fraud. Responsible Members of Congress, media outlets, and advocates for students and veterans will continue to expose abuses, and more prospective students will get the truth about bad actors in this industry, even if your department continues to weaken enforcement efforts, relax oversight of accreditors, approve sham conversions to non-profit status, and gut accountability rules. The department will be on the wrong side of history, the wrong side of justice and the wrong side of our people. Keep the existing borrower rule. Help these students. This article also appears on Republic Report.",
      "date": "11/13/2017 05:27 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Colbert Cuts Loose On Betsy DeVos’ $40 Million Yacht Being Set Adrift",
      "url": "https://search.huffpost.com/click/_ylt=Awr9IlvfqatdqjMAt69sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560031/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fcolbert-roasts-betsy-devos-over-her-40-million-yacht-getting-loose_n_5b5cc294e4b0b15aba9967ba/RK=2/RS=Lr30SYQeokVz5W9qmhGaHr_x.hw-",
      "subtitle": "Apparently, the 163-foot ship is one of many belonging to the DeVos family.",
      "author": "Andy McDonald",
      "content": " With the release of the Michael Cohen tape and the discovery of a lake on Mars, there was a lot of big news this week. But one story was really floating Stephen Colbert’s boat on Friday’s “Late Show.” The host told the sad tale of Education Secretary Betsy DeVos’ luxury yacht, which was untied from the Huron Boat Basin dock in Ohio and set adrift on Lake Erie. The $40 million, 163-foot boat, the SeaQuest, was recovered by its 12-person crew with some minor collision damage. Luckily, the DeVos family has a fleet ― yes, fleet ― of 10 ships. Local police called it an act of vandalism, but Colbert sounded skeptical. “I’m not pro-vandalism. I’m even kind of pro-yacht,” he said. “But I’m not sure if setting a boat free counts as vandalism.” CORRECTION: A previous version of this story mistakenly placed Betsy DeVos’ vandalized boat on Lake Huron. The boat was docked in the town of Huron, Ohio, which actually sits on the shore of Lake Erie.",
      "date": "07/28/2018 04:58 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Betsy DeVos Meets Teen Wearing Trans Pride Flag During School Visit",
      "url": "https://search.huffpost.com/click/_ylt=Awr9IlvfqatdqjMAta9sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560031/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fbetsy-devos-student-trans-pride-flag_n_5b0ee7c4e4b0568a88110468/RK=2/RS=GnyLPgsRMzCoRs0nTG7Vrid52Po-",
      "subtitle": "The education secretary did not seem to acknowledge the ensemble.",
      "author": "Curtis M. Wong",
      "content": " A Michigan student didn’t miss an opportunity to make a statement when Education Secretary Betsy DeVos visited their school this week. Eighth-grader Torin Hodgman wore a transgender pride flag as a cape during DeVos’ Tuesday appearance at the Grand Rapids Public Museum School in Grand Rapids, Michigan. The 14-year-old Hodgman, who identifies as genderqueer and prefers the pronouns “they” and “their,” can be seen walking alongside DeVos in the above MLive video. DeVos interacted with students, who presented a series of science and environmental projects. She did not appear to acknowledge Hodgman’s ensemble. Hodgman said they had planned to ask DeVos about school safety for LGBTQ youths during a morning roundtable. While they didn’t get a chance to do that, Hodgman hopes she recognized the flag. “Public schools are a place for all children,” Hodgman told MLive. The student’s concerns are certainly justified. About a month into President Donald Trump’s tenure, the Department of Justice and Department of Education rescinded Obama-era guidance that schools should allow trans students to use bathrooms, locker rooms and other school facilities that align with their gender identity. In February the Education Department announced that it will no longer investigate complaints filed by students who say they were barred from using corresponding facilities.",
      "date": "05/30/2018 05:21 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Betsy DeVos’ Title IX Changes Will Make Life Even Harder For Sexually Abused Boys",
      "url": "https://search.huffpost.com/click/_ylt=Awr9IlvfqatdqjMAs69sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560031/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fopinion-devos-title-ix-sexual-assault-boys_n_5c2d0ac1e4b0407e9087807e/RK=2/RS=7W7TUvuMLEzmBtk0kLceq6Z_dNM-",
      "subtitle": "null",
      "author": "",
      "content": "The U.S. Department of Education has angered women’s rights advocates by proposing an overhaul of Title IX, the landmark law that has been used since the 1980s to hold schools accountable for preventing and responding to sexual violence against students. The proposed changes would strip away many protections against sexual violence that students have under Title IX. Now these protections are under threat not just for college students, but for child victims in K-12 schools, too. While Title IX was intended to protect equal access to education for women and girls, it also protects the men and boys who experience the terrible consequences of sexual violence in schools, from kindergarten through college. To strip them of even these bare protections of the law does no service to boys and men. One in 6 men in America is a survivor of sexual assault or abuse, and 1 in 20 boys is a victim of sexual abuse. In 2017 data covering the hundreds of thousands of child abuse cases handled by the nation’s 854 Children’s Advocacy Centers that year, 24 percent of perpetrators were cited as an “other known person,” like a neighbor or doctor. Or a classmate, teacher or coach. The proposed new rules would make it harder to prevent that abuse from happening and harder to hold schools and perpetrators accountable when it does. They would ignore the “low-level” sexual misconduct like inappropriate comments or groping that research tells us is a precursor to child sexual abuse. They would also create safe spaces for abusers by limiting schools’ responsibility to address sexual assaults that happen off-campus, even when a child is assaulted by a classmate or teacher. They would even interfere in the neutral, fact-finding investigative process by subjecting child victims to cross-examination by their abusers, ensuring that the process of seeking justice and support services is as traumatic as possible and discouraging victims from coming forward. The agony of male survivors stalks the halls of the schools we attended as children. It lurks in the locker rooms where we went to football camp. It haunts classrooms where after-school tutorials turned to abuse. It infests the margins of our memories, crowding out the boyhood joys of scouting, of learning or of sports with private pain. That old poison, sexual abuse, leads men and women to despair, depression, drinking and even early death. The first course of the antidote to this poison is belief — belief in the victims of sexual violence, the acknowledgment of their bravery, and the understanding that they risk so much, and often stand to gain so little, by telling what has happened to them. The cultural conversation that peaked during the Brett Kavanaugh confirmation fight incorrectly pitted men against women and pitted victims of sexual violence against those who, for whatever reason, believe they may one day stand wrongfully accused. Yet false sexual assault claims are no more common than false reports of other crimes, estimated at 2-10 percent of all reported assaults — and most assaults go unreported. A countermovement arose based on the false premise that false sexual assault claims, which are vanishingly rare, are commonplace. Now, the misinformation and fear-mongering of the #HimToo movement, which frightened parents and school leaders, has metastasized into a harmful federal policy. This misguided policy shift focuses on the extremely rare instances of young men being falsely accused, rather than on the heartbreakingly common experiences of children and adults who disclose experiences of sexual violence with the virtual guarantee that someone important to them won’t believe them or will add to their trauma. Survivors need belief. Their healing begins with the words: I believe you. The countervailing disbelief is at the heart of these heartless Title IX changes. Another thing survivors need is a fair chance at getting justice and support services when something bad happens to them at school. Is the Department of Education really concerned that there’s too little sexual assault in our schools, or that it’s too easy for children to find a school leader who believes them and will do the right thing? This, in an era when institutions of all kinds are discovering there’s hell to pay for ignoring the truth? When as many as one-quarter of college women are sexually assaulted while in school? Twenty million men — and many, many more women and non-binary people — have been victimized by sexual violence. They don’t need fewer protections. They need more. Keeping these protections for our nation’s schoolchildren in place is our collective responsibility, and I encourage individuals and institutions to submit comments opposing the rule changes before the Jan. 28 deadline. But in particular, I appeal to the parents who are so worried about their sons facing false accusations that they are in favor of throwing out these victim protections. I can empathize with the many parents who have kept themselves up at night with this question: Who will believe my son if he’s accused? Yet if we ignore the crisis of sexual abuse and assault in our schools, we must be prepared to ask ourselves the more tragic question: Who will believe my son if he’s the one who gets hurt? Blake Warenik serves as director of communications at National Children’s Alliance, the nation’s largest network of care centers for child victims of abuse. CORRECTION: A previous version of this story misstated the deadline for submitting comments opposing the rule change. It is Jan. 28, not Jan. 29.",
      "date": "01/02/2019 02:41 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Betsy DeVos Loves To Tell This Teacher’s Story. But He Says She Got It All Wrong.",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DtD0qatdfogA6.FsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560053/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fbetsy-devos-jed-teacher_n_5c524d60e4b0ca92c6dd1812/RK=2/RS=ccvuCRuFX_Q41LMD91STPgTQG0I-",
      "subtitle": "“I hate knowing she is using my words to further push her agenda,” says educator Jed Dearybury.",
      "author": "Rebecca Klein",
      "content": " Education Secretary Betsy DeVos loves to tell the story about a former teacher named “Jed.” Here’s how it goes. Jed, a once-passionate public school teacher, was told to “keep it down” at school because his class was having too much fun learning. He left the profession, DeVos likes to suggest, because he didn’t have enough autonomy to teach as he wished. If only there were fewer federal mandates and more flexibility, DeVos often says before pushing for more school choice. Politicians and public figures often trot out anecdotes about everyday people whose experiences illuminate a larger issue. But DeVos has referenced “Jed” quite regularly. She has used the Jed anecdote in three speeches since 2017, in an interview with The Wall Street Journal and when testifying before Congress. She most recently spoke of him on Monday in a speech she gave to the National School Boards Association. But who is Jed? The real-life Jed, HuffPost discovered, is actually mortified by the attention. “I hate knowing she is using my words to further push her agenda, which is the antithesis of me,” said Jed Dearybury, who was a finalist for South Carolina Teacher of the Year in 2014. “Honestly, it makes me mad as hell. It makes me want to fight harder.” Dearybury met with DeVos, along with nine other former teachers, in July of 2017. DeVos wanted to chat with educators who had recently left the classroom to learn more about their experiences and why they switched jobs. In truth, Dearybury, who spent over 13 years teaching at public elementary schools in South Carolina, didn’t leave the classroom over frustration with his district or state or federal mandates. He changed jobs so he could advocate for teachers on a larger scale, without fear of overstepping. He now works for the Palmetto State Teachers Association as the director of professional development and communications. The organization “is as close as you’re going to get to a union in South Carolina,” said Dearybury. After publication he told HuffPost in another interview that while South Carolina is legally prohibited from having unions, PSTA “is a professional association that represents and unifies teachers across the state” in the absence of one. (Dearybury spoke to HuffPost in an individual capacity and not as a representative of his employer.) “I love all these teachers striking across America. I wish every teacher in America would walk out on the same day,” said Dearybury, who left the classroom around three years ago. In the later interview with HuffPost, he clarified that “while we don’t want strikes, sometimes they do get people’s attention.” He had no idea his words were going to be used in public speeches and congressional testimony. He was under the impression it was a casual, off-the-record conversation. The anecdote he provided in the meeting, about being told to “keep it down,” was told as an example of how even sometimes fellow teachers have overly rigid views of pedagogy. Indeed, it was another teacher ― not a school administrator ― who had reprimanded him. Two other meeting attendees have confirmed this version of events to HuffPost. Dearybury worries that leaders of his former district, which he loved, will hear one of DeVos’ speeches and interpret it as him criticizing them. He is also concerned his words will be interpreted as an endorsement of DeVos’ agenda. A spokesperson for DeVos did not respond to a request for comment. Secretary DeVos has referenced Jed when speaking before highly polarizing groups, such as the American Legislative Exchange Council. “The frustration they expressed, I think, is indicative of a system that for too long has tried to control everything from above and has not respected and honored the needs of the individual students,” DeVos said of the teachers she met with, including Jed, when speaking before Congress in May. Meanwhile, Dearybury says he is concerned about the treatment of LGBTQ students under the Trump administration and the unequal distribution of funds between schools in rich and poor areas. “I want equal opportunities for all students. In this administration, when they say equal opportunity, they think you mean you want rich kids to go to private school and get a tax credit,” he said. This story has been updated to include additional comments from Dearybury about PSTA. CORRECTION: A previous version of this story misstated the title of the National School Boards Association as the American School Boards Association.",
      "date": "01/31/2019 10:00 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Betsy DeVos Now Says She Doesn’t Think Schools Can Call ICE On Students",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DtD0qatdfogA6eFsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560053/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fbetsy-devos-now-says-she-doesnt-think-schools-can-call-ice-on-students_n_5b16b7e0e4b0734a9937e0cf/RK=2/RS=zrX68biF7U9mxy1xc07bJ.mLK5g-",
      "subtitle": "Last week, DeVos said schools could call ICE on undocumented students.",
      "author": "Rebecca Klein",
      "content": " Education Secretary Betsy DeVos, who sparked a firestorm last week when she said it was a school’s choice to call Immigration and Customs Enforcement to report potentially undocumented students, changed her tune Tuesday, telling a Senate subcommittee she doesn’t think schools can call ICE on undocumented students. DeVos’ reversal came during a tense exchange with Sen. Chris Murphy (D-Conn.), who demanded that DeVos give a yes or no answer to whether the law allows this. DeVos first told Murphy that the 1982 Supreme Court decision in Plyler v. Doe “says students that are not documented have the right to an education.” When pressed for clarification, DeVos said she thinks “a school is a sacrosanct place for students to be able to learn, and they should be protected there.” Murphy accused DeVos of ducking the question. “I think educators know in their hearts that they need to ensure that students have a safe place to learn,” DeVos responded. Finally, after multiple rounds of prodding and Murphy’s question, “So they can’t call ICE?” DeVos responded: “I don’t think they can.” Democratic members of Congress and civil rights groups have been demanding that DeVos correct her original comments since she made them. A week ago, in an exchange with Rep. Adriano Espaillat (D-N.Y.) while testifying before the House Education and the Workforce Committee, DeVos said she thinks it’s “a school decision, it’s a local community decision” whether school leaders should call ICE on undocumented students or families. The Education Department subsequently said DeVos believes that schools should follow the principles established by Plyler v. Doe, which requires public schools to educate all students. Many critics of the education secretary, however, demanded a more public correction. By Monday, over 100 members of Congress had signed a letter reiterating the need for a “swift, decisive, and widely disseminated correction.” Espaillat said Tuesday, after DeVos’ appearance before the Senate subcommitee, that he doesn’t believe her new statement goes far enough. ″I would like to see from her a more definitive answer, as opposed to ‘I think,’” Espaillat told HuffPost. “I think is in the right direction, but it’s not a definitive answer.” Espaillat said he is “perplexed” that DeVos hasn’t clarified the issue. “This only lends itself to people feeling afraid or skeptical about things and it doesn’t help matters,” said Espaillat. ”We would like to have a definitive answer, and it should be more along the lines of, this is what the law says, therefore they cannot do it.” ",
      "date": "06/05/2018 02:18 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Betsy DeVos Mulls The Fate Of Guidance Designed To Reduce Racial Bias In Schools",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DtD0qatdfogA5.FsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560053/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fdevos-discipline-guidance_n_5ac4f523e4b093a1eb2150df/RK=2/RS=jSxf3kJBWKYwLLhNXU1CgWRpGJ8-",
      "subtitle": "DeVos is meeting with proponents and critics of Obama-era guidance intended to stymie the school-to-prison pipeline.",
      "author": "Rebecca Klein",
      "content": " Education Secretary Betsy DeVos met with a group of civil rights leaders, parents and teachers Wednesday morning to discuss the impact of Obama-era guidance that calls on schools to reduce their reliance on suspensions and to consider whether racial bias plays a role in their disciplinary practices. The examination of this guidance is part of DeVos’ work as leader of a new Federal Commission on School Safety, although she has reportedly been thinking for months about rescinding the guidance. Wednesday’s meeting, which took place on the 50th anniversary of the assassination of Martin Luther King Jr., involved leaders in some of the country’s most prominent civil rights groups, including the NAACP’s Legal Defense Fund, the Leadership Conference on Civil and Human Rights and the Lawyer’s Committee for Civil Rights Under Law ― all of which are strongly in favor of keeping the guidance. Other participants included leaders from the nation’s largest teachers union, the National Education Association, as well as teachers from the advocacy group Educators for Excellence and education researchers. Later on Wednesday, DeVos also met with groups, parents and teachers who want to see the guidance repealed. Liz King, senior policy analyst and director of education policy for the Leadership Conference, described the morning meeting as “frustrating and underwhelming.” King spoke directly to Education Department officials about how this administration’s actions are having a negative impact on school climate, especially for LGBTQ and immigrant students. She urged DeVos to maintain the existing guidance. “Our children deserve better than this administration,” said King, who described DeVos as “very pleasant,” although “she didn’t say much.” Evan Stone, co-CEO of Educators for Excellence, left the meeting with a more positive view, although he still suspects advocates of the guidance are fighting an “uphill battle.” He was heartened that DeVos opened the meeting by acknowledging the large racial disparities in how students are disciplined. DeVos said she was moved by the stories from educators in the room, according to Stone. Stone’s group requested that DeVos come visit some of the communities that have had positive experiences with the Obama-era guidance. “Hopefully the lived experience of teachers who are working to change things will have an impact,” he said. In a country where students of color, students with disabilities and LGBTQ students are disproportionately subject to harsh disciplinary practices, like suspensions and expulsions, the guidance is seen as a tool to help reduce the flow of students who are pushed from school into the criminal justice system. The guidance warns schools that they could be found in violation of federal civil rights laws if they are disciplining some groups of students ― like students of color or students with disabilities ― at disproportionately high rates. It also encourages schools to adopt restorative justice practices as a way to deal with discipline issues, rather than punishments that push kids out of the classroom. On the other side of the issue, critics say the guidance helps keep disruptive children in the classroom, putting teachers and students at risk. The guidance came under renewed scrutiny after the school shooting in Parkland, Florida, in February, when conservative leaders speculated that lax discipline policies allowed the accused shooter’s behavior to go unchecked. (The school’s responses to the suspect’s behavior appear entirely unrelated to the guidance. The Education Department had also started meeting with critics of the guidance months before the shooting.) But even before Wednesday’s meetings began, DeVos faced critiques from the advocacy groups and civil rights organizations that had not been offered a seat at the table. Groups like the National Women’s Law Center sent DeVos a letter slamming what they called “the exclusive and non-transparent approach” of the summit. The letter was co-signed by groups like the Human Rights Campaign and the National Center for Transgender Equality. It expressed the groups’ support for the guidance. A number of other groups asked to be included in Wednesday’s discussion but did not receive an invitation. A representative from the National Disability Rights Network told HuffPost they asked the Education Department’s Office for Civil Rights for an invitation last Friday, but the agency declined. The Council of Parent Attorneys and Advocates, a group that represents children with disabilities, also asked both the Education Department’s Office for Civil Rights and its Office of Special Education and Rehabilitative Services for an invitation, but did not hear back. King said it was “was glaringly apparent there was no one from the disability community, the LGBTQ community, the Native American community, the Latino community, or the immigrant community in the room.” Additionally, only one of the country’s major teachers unions was invited, with the administration leaving out the American Federation of Teachers. “I find it very offensive that they don’t want to hear our opinions,” AFT President Randi Weingarten told HuffPost. DeVos’ meeting with critics of the guidance included groups like the Manhattan Institute, as well as parents and teachers who believe the guidance should be rescinded. (The Education Department did not respond to HuffPost’s request for information about who would be present at this meeting.) Nicole Landers of Baltimore County is one such parent. She says the relaxed disciplinary practices at her kids’ schools have come at the expense of student safety. Landers’ daughter was sexually harassed last year by another student when she was a fifth-grader. Her older son was bullied to the point where he became suicidal. Their tormentors, though, remained in the classroom, and she believes the Obama-era guidance helped make this situation possible. “Whatever intentions were set forth in the guidance, the response to the guidance has been kind of knee-jerk in nature that has ended up hurting all of the children,” Landers said. “It takes away the rights from the victimized students, as the offending students are left in the classroom to avoid suspensions.” This is a developing story. Check back for updates.",
      "date": "04/04/2018 01:33 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Betsy DeVos Says School Safety Commission Won’t Look At Role Of Guns In School Shootings",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DtD0qatdfogA5eFsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560053/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fbetsy-devos-school-shootings_n_5b16c97ce4b09578259c3ac6/RK=2/RS=.XOf2BkY8Z80HBWjUVBTsCYCFWM-",
      "subtitle": "The secretary of education said the commission is not charged with focusing on firearms.",
      "author": "Rebecca Klein",
      "content": " Testifying before the Senate appropriations subcommittee on Tuesday, Education Secretary Betsy DeVos said the Federal Commission on School Safety, which she chairs, will not look at the role of guns in a recent spate of school shootings. In an exchange with Sen. Patrick Leahy (D-Vt.), DeVos said it is “not part of the commission’s charge per se” to look at the role of firearms as it relates to gun violence. Instead, DeVos said the commission will study “school safety and how we can ensure our students are safe at school.” Leahy asked DeVos if she thinks an 18-year-old should be able to buy AR-15-style guns and ammunition. “I believe that’s very much a matter for debate, and I know that’s been debated within this body and will continue to be,” DeVos replied. “Our focus is on raising up successful proven techniques and approaches to ensuring schools are safe for students to attend.” The White House charged DeVos with leading a federal commission on school safety after a shooting in Parkland, Florida, in February left 17 dead. In a March press release, the White House said the commission will study and make recommendations on issues including “age restrictions for certain firearm purchases.” HuffPost reached out to the Education Department to see if the commission still plans to make recommendations in this area, given DeVos’ comments Tuesday. In response, department spokeswoman Elizabeth Hill clarified that the commission will still be making such recommendations. “It is one of the 27 items to be addressed by the report,” Hill said in an email. She also noted “that the commission cannot create or amend current gun laws — that is the Congress’ job.” While speaking with Leahy, DeVos also said the commission will not look at countries where teens spend similar amounts of time playing video games or on social media but that do not have the same high rates of gun violence in schools as the U.S. Leahy ended the exchange by noting that the commission “will look at gun violence in schools but not look at guns ― an interesting concept.” DeVos has been holding listening sessions and events for her commission in recent weeks. On Wednesday, the commission is scheduled to hold a public listening session.",
      "date": "06/05/2018 03:45 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "What Betsy DeVos’ New Rule Means For Sexual Assault Survivors At Community Colleges",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DtD0qatdfogA4.FsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560053/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fopinion-betsy-devos-campus-sexual-assault-rape-title-nine_n_5bf5942be4b0771fb6b530a9/RK=2/RS=GwIStqisHfMi_iLIEE.t5jyPkmM-",
      "subtitle": "null",
      "author": "",
      "content": "Last week, Secretary of Education Betsy DeVos released a proposed regulation on Title IX that would let schools off the hook for mishandling complaints of sexual violence. The phrase “college sexual assault” evokes nightmarish experiences in Ivy-covered dorm rooms and fraternity housing, and that’s certainly where some of these assaults are perpetrated. But DeVos’ proposed rule would also have devastating impacts on community college students, who make up 42 percent of all undergraduate students in the United States. The new rule would allow community colleges and other schools to disregard violence that occurs outside of their programs and activities, even when that violence interferes with a survivor’s education. That means that schools wouldn’t be required to investigate and provide support to a survivor who is assaulted in her off-campus apartment by a student from her biology class. This policy would have especially serious ramifications for community college students, many of whom do not live on campus or are enrolled part time. In fact, the college sexual assault crisis is particularly acute at commuter schools, where the environment around the immediate campus can be a high-risk area for sexual assault and stalking. In addition, the new policy would only require schools to investigate the most extreme forms of harassment and assault. It’s possible that a student who is fearful of attending a class as their stalker waited for them outside the door wouldn’t have rights under the changes proposed to Title IX. And as the American Civil Liberties Union notes, a school would only be required to act when the sexual violence or harassment completely denies a student access to education. This would constitute a significant rollback of survivors’ rights: Right now, schools are expected to assist survivors when harassment interferes with or limits their access to education, for example, when a student is struggling to keep their grades up or is afraid to attend a class where their abuser is present. If DeVos gets her way, students would be forced to endure repeated and escalating levels of abuse without being able to ask their schools for help. So that student whose stalker waits for her outside class won’t be eligible for support from her school if she drops the class, or drops out of school entirely. It’s easy to see how the proposed rule sets up community college students for failure. By the time that the Department of Education would require a school to intervene, a survivor might have had to already drop a prerequisite course that would allow them to complete their degree or matriculate to a 4-year institution. And even if a survivor graduates or transfers, the trauma of their school’s betrayal will linger. Experiencing institutional abuse can engender mistrust with subsequent academic institutions, and survivors may be less inclined to report at their new college. It gets worse. The Department of Education would also forbid schools from removing perpetrators from spaces they share with survivors while an investigation is ongoing. As a result, survivors will bear the brunt of withdrawing from classes for fear of encountering their abusers on a regular basis. This will hit survivors at community colleges especially hard, because for students at those schools, course flexibility ― like night classes and part-time enrollment ― is critical to balancing classes with employment, child care and other commitments. If a student cannot find a different time slot for a class they share with an abuser, they may be compelled either to withdraw or re-enroll in a different semester. And Title IX, a law intended to protect survivors of sexual violence, will have been the reason for their educational setbacks. Finally, DeVos’ proposal would incentivize community colleges to make it harder, not easier, to report sexual assault. That’s because under the proposed rule, the Department of Education will only find a school in violation of Title IX if their leadership had direct knowledge of the assault or harassment. This creates perverse incentives for schools to make it more difficult to report, and disincentivizes informing students of their rights. It’s already hard enough for students to get accurate information about their rights on campuses and the services available to them if they’re assaulted. When I arrived at my community college, the school provided only a short, general online training that barely scratched the surface of resources available on my campus. Throughout my time at the school, I did not know the identity of my Title IX Coordinator or how to report harassment ― and I was the President of the Women’s Student Association. When I escaped my abuser’s physical and psychological harm, he cut off the financial resources that would have enabled me to attend a four-year college. Community college was my only option, so I enrolled in a two-year associate’s degree program in New York. At that school, my friends experienced sexual violence akin to the much-publicized abuse at four-year institutions, and that abuse and institutional betrayal had severe consequences for my friends’ educations.  But they were never greeted with the national outrage that was extended to survivors at schools like Columbia, an elite four-year school that’s just a few miles away. Community colleges afford critical educational opportunities to survivors of sexual assault, and they’re also rife with sexual violence and discrimination. And DeVos’ proposed rules would only make things worse. Throughout her tenure as Secretary of Education, Betsy DeVos has been all too willing to deregulate higher education at the direct expense of students. These new Title IX rules are no different. Instead of protecting the civil rights of community college students, DeVos has opted to dismantle Title IX’s protections in favor of schools’ bottom lines. For survivors at community colleges, the cost of the new rule may be their educations. The Department of Education is about to accept public comments on the proposed regulation. If you want to stand with survivors and prevent this rule from becoming law, you can join us here.  Jaslin Kaur is a Policy and Advocacy Organizer with Know Your IX, and a senior at City University of New York Hunter College.",
      "date": "11/22/2018 08:00 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Betsy DeVos’ New Title IX Regulations Will Only Hurt Female Student Athletes",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DtD0qatdfogA4eFsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560053/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fopinion-devos-title-ix-college-athletes_n_5bff08bbe4b0388c1770f4de/RK=2/RS=4HLKOi8wppQsHBuC1VhqfFle_3I-",
      "subtitle": "null",
      "author": "",
      "content": "Earlier this month, Secretary of Education Betsy DeVos released newly proposed Title IX regulations regarding how schools should handle reports of sexual harassment and violence. When they are formally put into place, these guidelines will narrow the definition of sexual misconduct so fewer cases fall under Title IX’s umbrella. It would also make schools responsible only for harassment or violence done on campus or at school-sanctioned events (so not at off-campus fraternity houses or apartments.), and restrict whom someone must report to at a college in order to initiate a formal investigation. And these new regulations would encourage a higher standard of evidence. Those most concerned about students who are accused of harassing or harming others are cheering what they see as a strengthening due process and the rights of the accused. Survivors and their advocates are concerned this will make it harder to report and so discourage people from doing so. Also, this is a financial advantage for universities who will have less legal liability (DeVos appears to care very much about protecting institutions over and above students.) As someone who has reported on campus sexual assault and sports over the last five years, it’s hard for me not to read over these proposed regulations and think immediately about what this will all mean for college athletics. Anyone who cares about mitigating abuse and the enabling of it within collegiate athletic departments should be very worried. There is recent data that suggests student-athletes are more likely to be involved in Title IX cases than other students. You have to wonder what DeVos’ changes mean specifically for student-athletes who are themselves victims of sexual harassment or violence at the hands of another student-athlete. Sports play such a large role on university campuses. Student athletics regularly involve huge amounts of money and they have their own media machine always looking for content. When the issue of campus sexual assault discussed, it is often when it involves a student-athlete. Think of Baylor, Minnesota, Michigan State, Tennessee, Florida State, Texas A&M, on and on. “I meet at least three female survivors that have been raped by another athlete at every single school I go to,” Brenda Tracy told me. Tracy, founder of Set The Expectation and a rape survivor whose attackers included Oregon State football players, spends much of her time visiting and speaking with sports administrators and student-athletes about changing the culture of departments and encouraging programs to work toward eradicating sexual harassment and violence. She believes these proposed guidelines will not foster “any type of a culture for survivors so they can come forward and report,” which will especially be true in athletic departments. A 2014 congressional report found that one-fifth of universities allowed their athletic departments to oversee cases that involved student-athletes. And this was under the Obama administration’s guidelines, the ones that DeVos’ administration and advocates for the accused thought went too far. At the time, Kate Fagan wrote a piece for espnW in which she talked about the specific problem in collegiate athletic departments: “That 20 percent number in the congressional report is chilling, as athletic departments (as well as colleges in general, of course) have competing interests,” she wrote. “Yes, they’re charged with protecting the welfare of student-athletes but also with protecting a very lucrative brand. Too often, their commitment to the former is sacrificed for a preservation of the latter.” Now, when DeVos’ proposed guidelines go into effect, it will mean less incentive for a commitment to protecting the welfare of student-athletes in the face of preserving the overall interests of an athletic department. That’s cynical, sure, but it’s backed up by a history that shows that programs fail to adequately implement Title IX when it comes providing equitable resources for women’s sports (which is an extension of an overall culture within sport that cares less about female athletes) and when it comes to dealing with reports of sexual harassment or violence. “It’s already hard enough for a female athlete to navigate the process,” Tracy says. Athletic programs, she says, train athletes to think of it as a family. And so, “Everything stays within athletics. If you have a problem in your class, you find a tutor in athletics. If you get a parking ticket, go to this person in athletics. So, it’s already hard enough to report against another athlete, because you’re basically betraying the family, right? You’re causing a problem.” Cody McDavis, a former Division I basketball player at the University of Northern Colorado and an advocate for survivors of sexual violence, told me these proposed regulations “compound on an issue of non-accountability in collegiate athletics” by “further insulat[ing] that non-accountability. There’s an elephant in the room, but it’s just being put under the carpet in a fairly obvious way.” The NCAA doesn’t care enough about this issue to do anything (they certainly didn’t punish Michigan State). What they have done has no teeth. McDavis says sports needs to get this right, though. “It drives a lot of the cultural mores,” he says, so sports “can be a beacon of a lot of good things, but they can also be one of a lot of bad things.” If the Department of Education and the NCAA are not going to help mitigate sexual harassment and violence within athletic departments, what can someone do? Well, first, these are proposed regulations. The public can comment on them beginning on Nov. 29. End Rape on Campus and Know Your IX have partnered to create Hands Off IX that explains how to participate in the process. For sports specifically, McDavis has a petition “calling on the Power Five Conference Commissioners — the most influential conferences in the NCAA — to immediately ban student-athletes with a history of violence.” Tracy says fans, alumni and donors should go directly to their schools and advocate for policies that protect the safety of the campus and of student-athletes. And the media has to keep reporting and we all have to keep sharing these stories. Universities might not like being legally liable but they might just hate bad PR more. No one wants to be the next Baylor or Ohio State or Michigan State. It’s our job to tell them: So don’t be. Jessica Luther is a freelance journalist, an author and a co-host of the feminist sports podcast “Burn It All Down.”",
      "date": "11/29/2018 09:32 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Trevor Noah Skewers Betsy DeVos With Fake For-Profit University Ad",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DtD0qatdfogA3.FsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560053/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2ftrevor-noah-fake-ad-betsy-devos_n_5afd2e7be4b06a3fb50dad55/RK=2/RS=nmYCU73m17t8VQq1MTwWQqpSfIM-",
      "subtitle": "“Are you looking to spend $100,000 you don’t have to get a degree that won’t help you find a job?”",
      "author": "Lee Moran",
      "content": " Education Secretary Betsy DeVos came under the scrutiny of “The Daily Show” on Wednesday night. Host Trevor Noah shone a light on how fraudulent for-profit universities are “poised to make a comeback” after DeVos dismantled the Department of Education team dedicated to investigating fraud. “So Betsy DeVos is stopping the people who are stopping the fraud,” said Noah. “She is like a reverse superhero. You know, flies into a bank robbery to help the robbers.” He then recruited regular contributor Roy Wood Jr. to make a “more accurate” spoof ad promoting a fictional version of one of these “shady schools.” Check out the full clip above.",
      "date": "05/17/2018 05:36 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Betsy DeVos Slammed Over Proposed Special Education Cuts",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DtD0qatdfogA3eFsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560053/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fbetsy-devos-slammed-over-proposed-special-education-cuts_n_5c9ba896e4b03c8bce1c6ad4/RK=2/RS=H5DQ.dOhxs5oaQP9kbW8WgLQmSc-",
      "subtitle": "null",
      "author": "",
      "content": "",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Friday’s Morning Email: Inside The Voucher Schools Championed By Betsy DeVos",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DtD0qatdfogA2.FsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560053/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2ffridays-morning-email-inside-the-voucher-schools-championed-by-betsy-devos_n_5a2a81e8e4b0a290f04ff594/RK=2/RS=OmssExa0OvXXsrDH1j.a1bBYF64-",
      "subtitle": "And bankrolled by taxpayer money.",
      "author": "Lauren Weber",
      "content": " (And want to get The Morning Email each weekday? Sign up here.) INSIDE THE VOUCHER SCHOOLS CHAMPIONED BY BETSY DEVOS That are spending tax dollars to teach “creationism, racism and sexism.” [HuffPost] [Tweet | Share on Facebook] AS LOS ANGELES FIRES FORCE 200,000 TO EVACUATE, SAN DIEGO BLAZE SPARKS NEW ALARM Hurricane-force winds are making the devastating wildfires, which have scorched over 140,000 acres, worse. [HuffPost] THE SIX WOMEN AND ONE MAN WHO COULD REPLACE AL FRANKEN A look at his possible replacements after the senator announced his resignation amid sexual misconduct allegations yesterday. [HuffPost] ‘INSIDE THE REAL (AND REALLY SECRET) MIDDLE EAST PEACE PROCESS’ “The defining fault line in the Middle East today is not between supporters of Palestine and those of Israel. The fight that will decide the Mideast’s future is that between Iran and its many opponents — most importantly Saudi Arabia.” [HuffPost] REP. TRENT FRANKS TO RESIGN FROM CONGRESS Franks, an Arizona Republican, said in a statement that the House Ethics Committee is investigating his “discussion of surrogacy with two previous female subordinates, making each feel uncomfortable.” The committee also voted to investigate Rep. Blake Farenthold (R-Texas) over allegations that he sexually harassed a former staffer and then used $84,000 in taxpayer money to settle her claim. [HuffPost] THREE DEAD IN AZTEC, NEW MEXICO, HIGH SCHOOL SHOOTING Two students and the suspected shooter are among the fatalities. [HuffPost] A FIRST STEP BREXIT DIVORCE DEAL HAS BEEN REACHED Between the E.U. and the U.K. [HuffPost] GABRIELLE UNION: ‘THE FLOODGATES HAVE OPENED FOR WHITE WOMEN’ “It’s no coincidence whose pain is being heard.” [HuffPost] SO SAUDI ARABIA’S LEADER SPENT $450 MILLION ON A PAINTING Here’s what that would do for the victims of his war in Yemen. [HuffPost] LINDSAY VONN SAYS SHE IS NOT REPRESENTING TRUMP AT THE OLYMPICS This does not seem like it’ll go over well with the White House. [HuffPost] ‘WHAT LIES BENEATH THE COMEBACK OF MICHELLE PFEIFFER AND THE DECLINE OF JULIA ROBERTS’ “Pfeiffer’s return to the spotlight feels like something to celebrate. Perhaps it even shows Hollywood is changing.” [HuffPost] ‘THE CROWN’ IS BACK And yes, you should spend all weekend binging Season 2. [Vulture] ARE YOU COUNTING DOWN THE DAYS UNTIL THE ROYAL WEDDING? Get HuffPost’s royal roundup in your inbox every Saturday. We promise you’ll be dead chuffed with our coverage. [HuffPost] That time Roy Moore said that maybe Putin is right and that America was united during slavery. The DNC is going to start paying its interns. Trump’s support is dropping with white evangelicals. “X-Men” director accused of raping 17-year-old boy. The VA decided it was probably a bad idea to cut a program that helps homeless vets. Larry Nassar, the former USA gymnastics doctor, was sentenced to 60 years in federal prison on child pornography charges. David Cassidy completely cut his daughter, Katie Cassidy, out of his will. Melania Trump said she’d love to go to a deserted island for the holidays. Read into that what you will. Back in the day, wearing red lipstick put you at risk as being labeled a witch. We’d like to visit this “inclusive” water park that has been modified to accommodate children with special needs. The 10-minute audio montage of 2017 is a lot. Eminem rips racism in new anthem. That time Kate Winslet said Woody Allen totally gets women. Melissa McCarthy And Jennifer Aniston teamed up to troll science deniers. The appetizer recipes that will kill at your next holiday party. What Jessica Alba would need to start acting again. This woman says she prefers ghosts to men. Vice President Mike Pence’s cat, Pickle, has died at 16. Russell Tovey opens up about playing a gay superhero. Bad news, team: Sophie Turner says winter isn’t coming until at least 2019. Why some people dread opening gifts in front of other people. And according to Fergie, she couldn’t stop hallucinating on crystal meth.",
      "date": "12/08/2017 07:30 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Tuesday’s Morning Email: How Betsy DeVos Became The Most Hated Cabinet Secretary",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DuMPqqtdDjYAj4psBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560079/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2ftuesdays-morning-email-how-betsy-devos-became-the-most-hated-cabinet-secretary_n_59ef188de4b0d14acdcc5bf5/RK=2/RS=FeOC4PpZzG7q3sgrwIINaUbgob0-",
      "subtitle": "“Meet the new Democratic bogeyman for 2018.”",
      "author": "Lauren Weber",
      "content": " (And want to get The Morning Email each weekday? Sign up here.) HOW BETSY DEVOS BECAME THE MOST HATED CABINET SECRETARY “Lawmakers and activists say they’ve heard more about Betsy DeVos than any other Cabinet secretary ever ― often from people who aren’t usually politically engaged.” [HuffPost] [Tweet | Share on Facebook] U.S. TO ‘ALLOW REFUGEES FROM ALL COUNTRIES, BUT WITH NEW RULES’ “The Trump administration will allow refugee admissions to the U.S. to resume for all countries but with new rules meant to better vet applicants, administration officials and others familiar with the planning said.” [WSJ | Paywall] U.S. CONSIDERING PUNISHMENT OF MYANMAR Over the country’s horrific treatment of its Rohingya Muslim minority. [Reuters] GOLD STAR FAMILY PROMISED $25,000 BY TRUMP RECEIVES CHECK A week after it became public the president had not fulfilled his promise to send it. [HuffPost] MEGYN KELLY HITS OUT AT BILL O’REILLY’S CLAIMS THAT NO ONE COMPLAINED ABOUT HIM “This must stop,” Kelly said Monday. “The abuse of women, the shaming of them, the threatening and the retaliation, the silencing them after the fact — it has to stop.” Bill O’Reilly later said that “I truly believe that these people at the New York Times are out to hurt people with whom they disagree” and that he was “mad at God.” [HuffPost] YOU DECIDE WHETHER YOU SHOULD BE ALARMED That nuclear “alert pads” are being updated. [WaPo] GOODBYE MEDIA TRAFFIC (AND PROFITABILITY) AS WE KNOW IT Facebook is rolling out a test where it removes publishers’ content from people’s newsfeeds. [ReCode] MAKE SURE TO THROW AWAY THESE PACKAGED VEGETABLES IN YOUR FRIDGE Due to a possible listeria contamination. [HuffPost] GOOD NEWS, ASTROS FANS Sports Illustrated predicted the team would win the 2017 World Series years ago. [HuffPost] WHAT’S COMING AND LEAVING NETFLIX NEXT MONTH If you’re dedicated enough, and watch about 11 episodes a day, you could binge all of “How I Met Your Mother” before it leaves. Totally doable. [HuffPost] NYC MAY ADD TOLLS TO COMBAT DOWNTOWN TRAFFIC London, Singapore, Oslo and Stockholm have similar pricing schemes in effect. [HuffPost] THIS GUY REPORTEDLY GOT TICKETED FOR SINGING ALONG TO HIS FAVORITE SONG IN THE CAR It’s a miracle we’re not millions of dollars in debt if that’s a crime. Sorry, sometimes you just wanna dance with somebody. [HuffPost] HOW TO MAKE YOUR HALLOWEEN CANDY HAUL EVEN BETTER Take a look at these wine pairings. You’re so very welcome. [HuffPost] Police fear a serial killer is “terrorizing” Tampa. Sgt. La David Johnson’s widow spoke to “Good Morning America” about the controversial Trump phone call. Former Fox News host Eric Bolling said he’d like Bill O’Reilly to stop discussing the death of his son. A top Russian journalist from Russia’s independent radio station was stabbed in the neck by an assailant who broke into her office to attack her. Authorities found a body they believe to be the missing 3-year-old Texas girl whose father left her outside as punishment. Twitter had some thoughts on that infamous CNN apple banana ad. Yes, that’s a nude cyborg bodysuit on Taylor Swift in the promo for her next music video. Why you’re seeing the hashtag #JusticeForJanet. Photos of people terrified in haunted houses are the best part of Halloween. Matt Damon says he did know that Harvey Weinstein harassed Gwyneth Paltrow. This guy won the Venice marathon after a bunch of runners made a wrong turn. Women’s soccer star Megan Rapinoe went after the “old, male and stale” world soccer officials. Yes, James Comey tweeted a picture of himself wearing running shoes in Iowa. That happened. Apparently no sport is safe from doping: Not even the Iditarod. Here’s the sports-news outlet that wants to “wait every local paper out and let them continuously bleed until we are the last ones standing.” Did you miss this “Walking Dead” Easter egg in the season premiere? We did as we were too concerned about Carl. Gabrielle Union and Lena Dunham get real about “passing the mic” to women of color. Say goodbye to the New York City MetroCard. Pro tip: An all-male panel on female empowerment is not a good idea. Are you reading this email on your phone while crossing the street? That’s illegal now in Honolulu. Think about why folks find an orange Trump hat he’s selling for Halloween amusing. And the president is not going to like The New Yorker’s latest cover.",
      "date": "10/24/2017 07:03 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "I’m Drowning In $120K Of Student Debt And I’m Suing Betsy DeVos To Make Her Fix That",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DuMPqqtdDjYAjYpsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560079/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fsuing-betsy-devos-student-debt_n_5d44529ae4b0aca3411ce72d/RK=2/RS=k4wizqGloTy9CMqDJFn2ciKxxjw-",
      "subtitle": "null",
      "author": "",
      "content": "I am drowning in more than $120,000 of student debt after being defrauded by a for-profit college, and I refuse to wait for relief from the Trump administration. That’s why I am going on the offense and suing Education Secretary Betsy DeVos. More than 158,000 other former students are doing the same. Many have been waiting more than two years for the department to cancel their debts under a law called Defense to Repayment (DTR), which requires debt discharges for scammed students. Recently, nearly 900 of us submitted testimony in the case. While it is now widely known that student debt has reached crisis levels, statements from former students reveal the specific impact that student debt, particularly debt from predatory schools, has on people’s lives. A survey of the defrauded students found that 96% feel their lives are worse off now than before they went to school. Nearly half have put off getting married and having children because of debt. Student debt is a national crisis, with more than 44 million people together owing $1.5 trillion, but these testimonies provide even more evidence of the suffering that former for-profit college students experience. In 2007, I enrolled in the Illinois Institute of Art in Schaumburg, Illinois, to earn my bachelor’s in fine arts. Now I’m not sure I will ever be able to repay my more than six-figure debt. My credit is ruined. Before I filed my application for DTR and my loans were placed into forbearance, debt collectors would call me as many as 10 times a day at all hours. They even called my recently deceased grandmother as well as other members of my family, none of whom are listed on my loan documents. The worst part is the effect that this debt has had on my family. My children have never known a life free from debt and all the anxiety that it causes. My 59-year-old mother holds some of my loans via the Parent Plus loan program. That means that until these loans are canceled, she cannot retire. This debt has already affected three generations of my family. To add insult to injury, I received a worthless degree from the school I attended. The quality of the education was dismal. Students had to learn from free online tutorials and YouTube videos. Instructors would frequently be late or absent, and many classes covered the same content under a different name. During my enrollment, the school engaged in fraud, which was later revealed in an $11 billion whistleblower lawsuit. Recruiters showed prospective students falsified career placement statistics and offered inflated salary numbers. They also lied about the equipment and facilities that would be available to students. While I struggle every day with this debt, I am also convinced that debtors can win relief if we band together. DTR is the provision in the Higher Education Act that established rules for college financial aid programs. It was made public a few years ago by borrowers who had attended Corinthian, a chain of for-profit colleges that had been under investigation for scamming students since 2007. The Obama administration eventually agreed that predatory loans should be canceled under the law. In fact, 28,000 people saw their loans disappear in the first mass student debt cancellation in US history. But Obama’s Department of Education did not finish the job. Soon after her appointment by President Donald Trump, DeVos stopped processing borrower defense claims. Not a single loan has been canceled for more than a year. Sen. Dick Durbin (D-Ill.) asked DeVos about the delay in a congressional hearing, and she seemed to blame students for being defrauded! “There are bad actors,” she testified, “on both sides of the equation.” That is why I and my fellow borrowers will force America’s billionaire education secretary to finally follow the law. In the final accounting, we are fighting for more than just debt relief. We are organizing for the right to a true education that doesn’t put us in debt. To win that battle, we know that we must stand together and refuse to be silent. This article was supported by the Economic Hardship Reporting Project. Based in Chicago, Ami is an organizer with the Debt Collective. She holds a Bachelor of Fine Arts degree from the Art Institute. Do you have a compelling personal story you’d like to see published on HuffPost? Find out what we’re looking for here and send us a pitch!",
      "date": "08/05/2019 09:00 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Alyssa Milano Rips Betsy DeVos’ Campus Sexual Assault Rules In Dr. Seuss Spoof",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DuMPqqtdDjYAi4psBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560079/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2falyssa-milano-betsy-devos-title-ix_n_5c0867bfe4b069028dc653e2/RK=2/RS=eHV6qWo0xTUVKjTcLvkvxrUWqvc-",
      "subtitle": "The actress and activist gave the education secretary the Grinch treatment to protest the DOE’s proposed changes to Title IX guidelines.",
      "author": "David Barden",
      "content": " Actress and Me Too activist Alyssa Milano has slammed Betsy DeVos’ new Title IX guidelines in a Dr. Seuss-inspired holiday story. As HuffPost previously reported, the education secretary’s proposed regulations for Title IX, a federal law meant to ensure gender equality in education, are expected to overhaul the way colleges handle sexual assault allegations. The guidelines, released last month, narrow the definition of sexual misconduct, essentially providing more protections for those accused of assault while making it harder for survivors of sexual violence to report it. In a video titled “One ShIXtty Gift,” released Wednesday by It’s On Us ― an organization launched in 2014 to stop sexual assault ― Milano tells a tale of how DeVos came up with the regulations. “Late one evening at the Department of Ed., thoughts were bouncing around Betsy DeVos’ head,” Milano reads. “She needed a gift, she started to think, a present for the people that would really stink.” The clip concludes with Milano urging viewers to “put one more thing” on their list of holiday tasks this year: taking “Betsy’s shitty gift” and shoving it right “up her ... notice and comment section.” Milano then explains how people can submit comments to voice their concerns about the guidelines. Check out the full video in the clip below.",
      "date": "12/05/2018 09:49 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Betsy DeVos’ ‘Painful and Awkward’ Ignoring Of Reporter Sets Anderson Cooper Off",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DuMPqqtdDjYAiYpsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560079/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fanderson-cooper-betsy-devos-special-olympics_n_5c9db9e1e4b0bc0daca59976/RK=2/RS=ko2sjs71ODzMaiqFIhyOgLBH8KI-",
      "subtitle": "The CNN host couldn’t get over the education secretary’s “epic non-response” to questions about cutting money for the Special Olympics.",
      "author": "Lee Moran",
      "content": " CNN’s Anderson Cooper poked fun Thursday at Education Secretary Betsy DeVos over her “epic non-response” to a reporter asking her questions about her proposal to cut money for the Special Olympics. The host of “Anderson Cooper 360°” explained how, ahead of President Donald Trump’s (not-strictly-true) claim that he’d protected federal money for the organization, CNN’s Ryan Nobles had grilled DeVos as she waited for an elevator. Cooper rolled the footage and summarized: “Oh my God, that was so painful and awkward.” “That was something,” he added. “Let’s keep that on hold for later use and just bring it up every now and then.” Check out the clip here:",
      "date": "03/29/2019 03:10 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Betsy DeVos’ Deputy Privately Admitted Trump Administration’s Idea Could Hurt Kids",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DuMPqqtdDjYAh4psBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560079/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fbetsy-devos-deputy-admitted-trump-administrations-idea-could-hurt-kids_n_5b296571e4b0a4dc9921cb1f/RK=2/RS=3_yfixbFgMOZ.b5i6qbYoDFqohE-",
      "subtitle": "Candice Jackson indicated she was against rescinding the Obama-era school discipline guidance that protects brown and black children.",
      "author": "Rebecca Klein",
      "content": " One of the Department of Education’s top civil rights appointees said in a private meeting that it isn’t necessary for the Trump administration to rescind school discipline guidance designed to protect black and brown children. The appointee, Candice Jackson, also acknowledged that such a move could harm vulnerable kids, according to a document obtained by HuffPost. Still, the guidance remains on the administration’s chopping block. The Obama-era guidance is supposed to help prevent schools from disproportionately punishing black and brown students. However, in recent months, it has come under fire from the Trump administration and has become a target for rescission. Jackson, who now serves as second in command at the Department of Education’s Office for Civil Rights, made these comments during a phone conversation in March with representatives from the Southern Poverty Law Center, a civil rights advocacy group. At the time, Jackson was temporarily serving as the highest official in the Office for Civil Rights, an agency that enforces federal civil rights laws in schools. In the call with the SPLC, Jackson said much of the opposition to the guidance is based on misinformation and misperception, according to a letter the SPLC later sent to Jackson that documented these comments. The letter, which HuffPost has obtained, was an acknowledgment of the SPLC’s meeting with Jackson, as well as a follow-up to some of the points discussed surrounding the guidance. On Tuesday, the SPLC sent another letter to Kenneth Marcus, who recently took over for Jackson as head of the Office for Civil Rights. The letter reiterates the comments Jackson made and urges Marcus to take the same position as his predecessor, “that rescinding the DOJ/ED Discipline Guidance is unnecessary and harmful.” “Assistant Secretary Marcus has an opportunity here to demonstrate a commitment to core American values,” Zoe Savitsky, deputy legal director of SPLC, told HuffPost. In response to requests for comment about the meeting, Department of Education spokeswoman Elizabeth Hill said the fate of the guidance is still undecided and the administration is continuing to study the issue as part of the Federal Commission on School Safety. “OCR has met with many advocacy groups with diverse opinions on this important issue. While those meetings continue, absolutely no decisions have been made,” Hill said. In the past, Jackson has come under fire for her comments that most campus sexual assaults are a result of regrettable drunken hookups. The Obama-era guidance, released in 2014, clarified how schools should interpret federal civil rights laws to ensure they’re not discriminating against students. The directive asked schools to taper their use of tough disciplinary tactics ― like suspensions and expulsions ― and warned schools that they could violate the law if certain groups of students are consistently receiving harsher punishments than others. The guidance was issued in reaction to stark statistics showing that students of color are disproportionately subject to harsher discipline than their white peers, even for the same behavior. The Department of Education continues to receive hundreds of legal complaints regarding discriminatory discipline in schools. In 2017, the department received over 200 complaints, HuffPost previously reported. However, the guidance has been sitting on the Trump administration’s chopping block for months. As far back as November 2017, Education Secretary Betsy DeVos began meeting with critics of the directive. Then, in March, President Donald Trump asked DeVos to lead a Federal Commission on School Safety after the deadly school shooting in Parkland, Florida. Part of the school safety commission’s mandate is to recommend policies surrounding the “Repeal of the Obama Administration’s ‘Rethink School Discipline’ policies.” DeVos has held meetings with both critics and advocates of the guidance. Critics of the Obama directive say it has put pressure on teachers to keep misbehaving students in the classroom to maintain low suspension numbers, making schools less safe. Others say schools were not given the tools to implement alternatives to suspensions and expulsions, creating a more chaotic environment. But civil rights groups like the SPLC see the guidance as a key tool in helping to protect vulnerable students who are already disproportionately pushed out of school. During the March meeting, Jackson asked for more evidence to support what the SPLC letter calls “the fact that racial disparities in school discipline cannot be explained by differences in behavior by race” and mentioned several districts where she heard the guidance might be negatively affecting students. Still, with Jackson, the SPLC found a somewhat sympathetic ear. After noting how much misinformation surrounds the guidance, Jackson said the Education Department could “provide a more thorough explanation of the purpose and goals of the guidance.” It is unclear where Marcus, the new head of the civil rights office, will land on this issue, although civil rights groups have expressed fear that he will promote rescission. They ardently opposed his confirmation to the position. Tuesday’s SPLC letter calls on him “to protect vulnerable students and ensure that they are not harmed, either by the unnecessary and discriminatory use of exclusionary discipline or by any actions taken by the Department.”",
      "date": "06/20/2018 12:15 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Kate McKinnon Channels Bobble-Head Betsy DeVos On ‘Saturday Night Live’",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DuMPqqtdDjYAhYpsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560079/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fmckinnon-betsy-devos-snl_n_5aadfe54e4b0c33361b1033b/RK=2/RS=k7daAlFCHmO_qTC.05xT4su8w6U-",
      "subtitle": "She wants to make certain “all schools are safe learning environments for guns.”",
      "author": "Mary Papenfuss",
      "content": " Chameleon Kate McKinnon again played an uncanny Betsy DeVos on “Saturday Night Live,” admitting with a smile on her vacuous face that she’s not good at her job. The “Weekend Update” bit was a play on DeVos’ disastrous appearance last week on “60 Minutes,” when she admitted she lacked facts on school performance and said she never “intentionally” visits poorly performing schools to try to determine what isn’t working. Asked to explain the awkward interview, a cheerful McKinnon explained to anchor Colin Jost: “I think the problem is that the words that were coming out of my mouth were bad, and that is because they came from my brain.” As for her ideas on education, “I don’t like to think of things in terms of school,” she admitted, and encouraged states to come up with their own solutions, like establishing a school for bears in Wyoming, where there are lots of “potential grizzlies.” She added, “And in North Carolina, stop being trans.” Asked why she is criticized so often, she responds: “I think it’s because I do not do a good job, and I can’t because I don’t know how.” She does hope to make sure that “all schools are safe learning environments for guns.” And while “DeVos” admits not being good on camera, “behind the scenes my ideas are much worse.” Check it out above.",
      "date": "03/18/2018 02:35 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Betsy DeVos’ New Campus Sexual Misconduct Rules Would Strengthen Rights Of The Accused",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DuMPqqtdDjYAg4psBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560079/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fbetsy-devos-sexual-misconduct-campus-rules_n_5b87a5e9e4b0cf7b00324a05/RK=2/RS=esLYl95gM8YkhL80Lh7TZvNTnK8-",
      "subtitle": "The education secretary’s proposed policies would also  reduce liability for colleges and universities, and boost support for victims.",
      "author": "",
      "content": "(Reuters) ― U.S. Education Secretary Betsy DeVos will issue new rules to colleges and universities for addressing sexual harassment or assault cases, lessening their liability for incidents that happen off-campus, the New York Times reported on Wednesday. The new policies would also strengthen the rights of students accused of assault, harassment or rape and seek to provide more support for victims, the Times reported. Department of Education spokeswoman Liz Hill declined to discuss the proposed recommendations with Reuters. “We are in the midst of a deliberative process. Any information the New York Times claims to have is premature and speculative, and therefore we have no comment,” Hill said. The report was published on the same day that officials said a former University of Southern California (USC) gynecologist, George Tyndall, accused of sexually assaulting hundreds of students, had agreed to a suspension of his medical license. The Education Department is investigating how USC handled that case after the university acknowledged failing to properly act on at least eight complaints lodged against Tyndall between 2000 and 2014. Last year, the administration of Republican President Donald Trump reversed guidelines established under President Barack Obama, a Democrat, on how colleges should handle sexual assault accusations, saying the prior policies led to too many students being falsely charged or disciplined. The prior rules outlined a strict set of steps for schools to follow or risk losing funding under Title IX, the federal law that bars sex discrimination in education. According to the New York Times, the rules being prepared by DeVos’ office would preserve much of Title IX but would also for the first time legally define sexual harassment on campuses and how schools were expected to address formal complaints. The proposals would hold colleges and universities responsible only for incidents on campus or in their programs and call for impartiality in investigating allegations and using the presumption that the accused student or staff member is innocent until proven guilty, the newspaper reported. “The proposed campus sexual misconduct policies from Betsy DeVos and her Department of Education are just the latest example of the Trump administration turning its back on women and victims of sexual assault,” the Democratic National Committee said in a statement. “These proposed rules are a blatant and disturbing attack on every student who has experienced or could experience sexual assault or misconduct on a college campus, and they exemplify the misplaced priorities of DeVos and the Trump administration,” the DNC said. (Reporting by Dan Whitcomb in Los Angeles; editing by Grant McCool)",
      "date": "08/30/2018 04:27 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Betsy DeVos’ New Title IX Guidelines Prioritize Schools Over Sexual Assault Survivors",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DuMPqqtdDjYAgYpsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560079/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fbesty-devos-new-title-ix-guidelines-prioritize-schools-over-sexual-assault-survivors_n_5beede5fe4b0510a1f3037cf/RK=2/RS=vvvUgMhGxd1y4k6dwx0v2M8ZDWc-",
      "subtitle": "The Education Department just proposed guidelines to the civil rights law that would drastically change the way schools handle sexual misconduct.",
      "author": "Alanna Vagianos",
      "content": " Secretary of Education Betsy DeVos released her long-awaited proposed Title IX guidelines Friday morning, and there’s a lot to unpack. The proposed regulations essentially provide more protections for the accused and make it harder for survivors of sexual violence to report harassment and assault by narrowing the definition of sexual misconduct. Additionally, the guidelines essentially prioritize schools above all by creating fewer sexual misconduct cases, which reduces costs (saving colleges anywhere from $286 to $368 million over 10 years, according to estimates included in the proposed guideline). “The Trump Administration’s proposed rule is designed to let schools off the hook for sexual assault and harassment,” Sage Carson, manager of the anti-sexual violence organization Know Your IX, said in a Friday morning statement. “These proposals signal the Department of Education’s decision to prioritize schools’ bottom line over survivors’ right to an education,” she continued. “If these draft rules become law, more survivors will be forced out of school by harassment, assault, and their schools’ indifference to their complaints.” Title IX, the federal civil rights law created to ensure gender equality in education, applies to all schools that receive federal funding, including nearly all colleges and universities, all public K-12 schools and a few private K-12 schools that receive federal dollars. The regulations differ slightly for K-12 schools versus college and university campuses. The suggested guidelines are similar to a copy partially leaked in August which faced swift criticism from survivor advocacy groups for making it harder for victims to report harassment and assault. Below are the provisions that could have the largest impact on how sexual misconduct is handled in school settings across the country: Keeping with the leaked copy, Friday’s suggested guidelines narrow the definition of sexual misconduct, defining it as “unwelcome conduct on the basis of sex that is so severe, pervasive, and objectively offensive that it effectively denies a person equal access to the recipient’s education program or activity.” Jess Davidson, executive director of survivor advocacy organization End Rape on Campus, described this portion of the regulations as “one of the most harmful parts of the rule.” “The definition is extreme and it’s going to require that students are harassed multiple times before they are able to receive any form of accommodation,” she told HuffPost. Under the proposed guideline, a school “is only responsible for responding to conduct that occurs within its ‘education program or activity.’” The Education Department loosely defines “education program or activity” as “all of the operations of” a school including anything that has “any academic, extracurricular, research, [or] occupational training.” This definition, however, does not include off-campus housing or bars and other settings within a school environment where assault and misconduct often take place. This is one of the most worrisome provisions of the entire 149-page proposal because 87 percent of college students live off campus. Davidson noted that this provision could prove disastrous for marginalized students, specifically community college and commuter students who spend a majority of their time off-campus. Additionally, this would allow schools like Michigan State and Ohio State, both currently embroiled in sexual assault scandals, to sidestep misconduct perpetrated by staff at off-campus events. “Would it make sense for Larry Nassar not to be held accountable if he only abused student athletes at off-campus events? It’s absurd,” Sejal Singh, policy coordinator for Know Your IX, said to HuffPost in August. Under the proposed provisions, the accused can participate in a live cross-examination of the alleged victim through a third party (although this does not apply fully to K-12 incidents). Unlike the earlier leaked copy, Friday’s proposed rule would not allow the accused to cross-examine their accuser personally. Additionally, the accuser is allowed to request that their alleged perpetrator watch the live cross-examination from a separate room which prohibits “any unnecessary trauma that could arise from personal confrontation.” This process, known as mediation, encourages schools to simply work it out themselves instead of following a regulated investigation protocol. “Before the 2011 Dear Colleague Letter (DCL), schools pushed survivors to ‘work it out’ with their rapists, fostering a climate where students were afraid to come forward” anti-sexual violence organization Know Your IX said in a Friday statement. “The Department’s decision to revert back to a harmful status quo will allow for schools and rapists to intimidate survivors into silence.” Additionally, the Education Department has not offered any guidelines on how this mediation process would potentially play out. The guidelines would restrict whom a victim can report to in order to implement corrective measures through the school. College students would only be able to report a Title IX issue with the school’s Title IX coordinator which, Davidson said, is cause for concern. “The lived experience of most college students don’t set them up to go first to the dean of students or to the Title IX administrator directly,” she said. “Most students want to talk to ― as anybody does ― students want to talk to a campus official or an adult who they trust, who will be on their side, who will affirm them, and will help them find safety and an answer.” “To see this definition go forward ― that would essentially give a free pass to OSU and Michigan State and Larry Nassar ― is really horrifying,” Davidson added. It’s worth noting that mandatory reporting laws still apply, but for a student to receive help and protection from their school specifically, they would need to seek out a Title IX coordinator. This provision would not apply to students K-12. The proposed guidelines state a school can use “either the preponderance of the evidence standard or the clear and convincing evidence standard.” Many survivor advocate groups, however, highlighted that using a “clear and convincing” standard would treat sexual misconduct survivors more harshly than victims of other discriminatory campus crimes. “Instead of imposing discriminatory procedural hurdles for campus sexual harassment cases, schools should use the same standards that they use for other serious campus wrongdoing, such as physical assault or arson,” Know Your IX noted. Many politicians and Title IX advocates were up in arms over the proposed guidelines. Rep. Carolyn B. Maloney (D-N.Y.) urged Congress to stand against the proposal, writing that it “seems intended to make college campuses safe spaces to commit sexual assault and harassment instead of safe spaces to learn.” In a Friday statement, Sen. Patty Murray (D-Wash.) called on “every woman, man, mom, dad, and anyone else who cares about campus safety and preventing sexual assault to make your voices heard and demand that Secretary DeVos and President Trump withdraw this proposal immediately.” Lara Kaufmann, Director of Public Policy for Girls Inc., pointed out how damaging this proposal could be for K-12 girls specifically. “All girls should be able to grow up safe, respected, and valued,” she said in a statement to HuffPost. “Unfortunately, these new proposals will lead to fewer students reporting assaults and harassment, more dangerous K-12 schools, and more girls being denied their civil right to equal access to education.” President of the American Federation of Teachers Randi Weingarten also condemned the proposed rules in a Friday statement. “This rule abdicates the responsibility to protect every student’s right to safety on campus,” she said. “It tells academic institutions that they needn’t bother helping to protect students; they won’t be liable. These changes once again demonstrate that students are not DeVos’ priority.” Since she was confirmed as Secretary of Education last year, DeVos has been on a mission to overhaul the Obama-era Title IX guidelines and regulations. In 2017, DeVos met with people “wrongly accused” of sex crimes (a group consisting mainly of so-called men’s rights activists) and, not long after, rescinded an Obama-era Title IX guideline, The Dear Colleague Letter. “It’s worth noting that the secretary has talked a lot about the importance of a fair process but that’s not what this reads like to me,” Davidson said. “This isn’t somebody trying to create fairness in the process, this is somebody who is trying to prevent the process from taking place at all.” Legally, the Education Department is required to consider all comments from the public and publicly respond to criticism before making a decision. Head here to read the Education Department’s proposed Title IX guidelines in full.",
      "date": "11/16/2018 01:29 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    },
    {
      "title": "Trevor Noah Eviscerates Betsy DeVos Over Her Confirmation Hearing",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DuMPqqtdDjYAf4psBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560079/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fbetsy-devos-daily-show-trevor-noah_n_58804285e4b02c1837e9c776/RK=2/RS=fP5ssPp8PbMv.8g5xeewyySi5a4-",
      "subtitle": "Noah says DeVos as education secretary is like putting an Amish man in charge of NASA.",
      "author": "David Moye",
      "content": " Trevor Noah thinks Betsy DeVos’ terrible performance during her confirmation hearing is a sad representation of America’s education system. “She’s going to get confirmed even though she failed everything. Every subject she got at the hearing. Failed. Failed. Failed. Failed ― except Donations 101,” he said on Wednesday’s “The Daily Show.” Noah went on to say that having her as secretary of education would be like having an Amish guy as head of NASA. “And that’s why I feel like this hearing was a perfect metaphor for the worst of the education system in America,” Noah said. “Here’s a student who’s clearly not proficient in the required subject matter, but because of the system, we know they’re still going to get pushed through.”",
      "date": "01/19/2017 12:56 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Betsy_Devos"
      }
    }
  ]
}