{
  "articles": [
    {
      "title": "In Chilling Echo Of Ethnic Cleansing, Trump Says North Syria Needed To Be ‘Cleaned Out’",
      "url": "https://search.huffpost.com/click/_ylt=Awr9Ds72pqtdtggAdg1sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559286/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2ftrump-erdogan-kurds-ethnic-cleansing-syria-ceasefire_n_5da8e1eae4b0bc924759b575/RK=2/RS=Bn9e3sHPBx_b5Jkv5PmVclLqzlo-",
      "subtitle": "The president called it “rough love.”",
      "author": "Mary Papenfuss",
      "content": " Donald Trump lavished praise Thursday on his “friend” and “hell of a leader”  Recep Tayyip Erdogan after the Turkish president launched an incursion into northeast Syria. Trump said the Turks needed to have a swath of Syria “cleaned out” after battling with Syrian Kurds there. Trump spoke after Turkey announced a five-day “pause” in fighting in Syria negotiated by Vice President Mike Pence. The deal was reached just over a week after Trump agreed in a phone call with Erdogan to pull out U.S. troops in Syria to cede the battlefield to the Turks, who have targeted America’s Kurdish allies. Pence has termed the new deal a “ceasefire,” but the Turkish foreign minister called it a “pause,” emphasizing: “This is not a ceasefire,” and said that Turkish troops would not withdraw. Turkey will pause its invasion for 120 hours to allow the Kurds to withdraw from a zone of the border region. But the agreement also allows Turkey to take over a significant swath of Syria and calls on Syrian Kurdish forces, known as the YPG, to surrender their heavy weapons. The deal would suspend U.S. economic sanctions against Turkey. “For many, many years, Turkey, in all fairness, they’ve had a legitimate problem” with northeast Syria, where the Kurds are settled, Trump said in remarks in Texas ahead of his rally in Dallas. “They had terrorists, they had a lot of people in there they couldn’t have …. and they had to have it cleaned out.” (See the video above.) The Kurds have battled ISIS for years alongside U.S. troops — and have fought against Turkey for centuries over disputed territory. Now that the ethnic group is under siege, the destabilization has “created a perfect situation for ISIS to capitalize on,” Rita Katz, executive director of the SITE Intelligence Group, a private firm that tracks online extremist activity, told The Washington Post. Trump said in Texas: “I want to thank Turkey” for agreeing to the pause in fighting — even though it was Turkey that launched the invasion. “We’ve gotten everything we’ve ever dreamed of,” Trump added. He said the Kurds are “incredibly happy” with the “solution.” Trump said the “ceasefire” was something that Turkey had been after for 10 years. “You would have lost millions and millions of lives. They couldn’t get it without a little ‘rough love,’ as I called it ... they needed a little bit of that at the beginning,” Trump said. “And then everybody said, ‘Wow, this is tougher than we thought.’ When those guns start shooting, they tend to do things.” Trump called it a “great day for the United States. It’s a great day for Turkey ... The Kurds were great. Great day for the Kurds. It’s really a great day for civilization.” On Wednesday Trump said that the Kurdish allies were “no angels” and said that in some cases they represent a threat more dangerous than ISIS, whom the Kurds fought against with American troops in Syria. He stated that Turkey’s invasion of Syria “has nothing to do with us.” The House on Wednesday voted overwhelmingly, 354 to 60, to denounce the U.S. troop withdrawal in Syria; 129 Republicans joined all the Democrats in the vote on the resolution.",
      "date": "10/17/2019 08:45 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Trump Pens Bizarre Letter To Turkey’s Erdogan About Syria: ‘Don’t Be A Tough Guy’",
      "url": "https://search.huffpost.com/click/_ylt=Awr9Ds72pqtdtggAdA1sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559286/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2ftrump-letter-erdogan-turkey_n_5da785efe4b034f1d69c963a/RK=2/RS=rAmBXHqWSvIuDGmiINc7LlNfbYQ-",
      "subtitle": "President Donald Trump wrote a strange letter to the Turkish president advising the foreign leader not to be a “tough guy” or a “fool.”",
      "author": "Josephine Harvey",
      "content": " President Donald Trump warned Turkish President Recep Tayyip Erdogan not to be a “tough guy” or a “fool” in a letter sent as Turkey launched its invasion on northern Syria. A senior White House official has confirmed that the Oct. 9 letter, released Wednesday, is authentic. “Dear Mr. President: Let’s work out a good deal! You don’t want to be responsible for slaughtering thousands of people, and I don’t want to be responsible for destroying the Turkish economy ― and I will,” the letter begins, before going on to say that the Kurds are willing to negotiate. Trump finalizes the letter by urging the Turkish leader to deal with the issue in the right and humane way, concluding with: “Don’t be a tough guy. Don’t be a fool! I will call you later.” The letter was written on the same day as Turkish military began attacking Kurdish forces, which were allied with the U.S. in the battle against the self-described Islamic State. Days earlier, Trump had ordered the withdrawal of U.S. troops from the region, a decision which was met with bipartisan condemnation. In an Oct. 6 statement, the White House announced the decision, saying that Trump had spoken with Erdogan over the phone. “Turkey will soon be moving forward with its long-planned operation into Northern Syria,” the statement from the White House read. “The United States Armed Forces will not support or be involved in the operation, and United States forces, having defeated the ISIS territorial ‘Caliphate,’ will no longer be in the immediate area.” The following day, Trump addressed his decision via tweet, warning Turkey not to do anything that he considered to be “off limits” ― and threatening to destroy its economy if it did so. He defended his widely condemned decision to effectively greenlight Turkey’s invasion, which severely jeopardizes the lives of the U.S.-allied Kurdish forces and risks the re-emergence of ISIS, by saying that it was now up to Turkey, Europe, Syria, Iran, Iraq, Russia and the Kurds to “figure the situation out.” “Fighting between various groups that has been going on for hundreds of years. USA should never have been in Middle East,” he wrote in a string of tweets. “The stupid endless wars, for us, are ending!” On Monday, Trump signed an executive order imposing sanctions and visa bans on top Turkish officials as a mode of punishment for their invasion of Syria. He said he had also increased tariffs on Turkish steel imports and would immediately halt negotiations on a major trade deal with the country. He also said a small number of U.S. troops would remain in Syria. The Senate is working to introduce its own sanctions bill against Turkey, saying that Trump’s orders are insufficient. Before the release of the letter Wednesday, the president muddied the waters further, undercutting the longstanding alliance between the Kurdish forces and the U.S. during a news conference, in which he said the Kurds are “not angels” and that Turkey’s invasion of Syria was “not our problem” ― even as Vice President Mike Pence and Secretary of State Mike Pompeo were scheduled to travel to Turkey that day to negotiate a ceasefire. In a meeting earlier in the day with Democratic leaders in Congress to discuss the president’s handling of the Turkey crisis, Trump bragged about the “nasty” letter he sent to Erdogan, according to a senior aide cited by NBC News. When asked in the meeting by Senate Minority Leader Chuck Schumer (D-N.Y.) what his plan was to contain ISIS and whether it entailed relying on the Syrians and the Turks, Schumer said the president replied, “To keep the American people safe.” Erdogan said Wednesday that he would not meet with Pence and Pompeo unless Trump came, but his communications director later clarified that he would meet with the U.S. delegation. Erdogan vowed to press on with the offensive in northern Syria until his mission to create a “safe zone” was complete and the region was cleared of Kurdish forces. He maintained Tuesday that Turkey would “never declare a ceasefire,” saying that he was not worried about any sanctions. S.V. Date contributed reporting.",
      "date": "10/16/2019 05:52 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Trump Appoints ‘Illuminati’ Self-Help Author ‘Magus Incognito’ To Federal Education Board",
      "url": "https://search.huffpost.com/click/_ylt=Awr9Ds72pqtdtggAcg1sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559286/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fmagus-incognito-george-mentz-trump-education-board_n_5da87fa4e4b0b24e75de7719/RK=2/RS=johg1PrBD.Lwrb7Pm8C5sWV1GvM-",
      "subtitle": "The writer, whose real name is George Mentz, also sells certifications that you’ve likely never heard of.",
      "author": "Ryan Grenoble",
      "content": " President Donald Trump has appointed an author of self-styled “Illuminati” self-help and financial advice books to a position on a federal education board. The appointment of George Mentz ― who also writes under the pen name “Magus Incognito” ― to the Commission on Presidential Scholars was announced last Wednesday in ﻿a White House press release. The group is tasked with selecting “presidential scholars” from across the country, an honorific reserved for 161 high school seniors who “demonstrate exceptional accomplishments in academics, the arts, career and technical education and an outstanding commitment to public service.” Federal Election Commission filings show Mentz has given substantial sums to Republican causes and candidates, including more than $10,000 to Trump’s campaign and an associated political action committee. Mentz’s author page on Amazon suggests that he is a prolific writer, with more than 60 titles to his name. That includes works with titles like “The Law of Attraction & Prosperity Bible – The Illuminati Wealth Manifesto & Codex” and “The Illuminati Handbook – The Path of Illumination and Ascension.” In a 2013 book by “Magus Incognito” called “Rosicrucian and Masonic Spirituality & Secrets – The Handbook,” Mentz tells readers the book’s teachings “can propel the initiate into the 4th dimension of existence on this Earth.” Mentz told The Denver Post that he uses “Illuminati” in book titles primarily for marketing purposes. “Just because I use the word Illuminati, don’t let that get you too excited,” Mentz told the paper in an interview published Wednesday. “If you look the word up, it means ‘illumination.’ How to be more aware, conscious, a better person.” In addition to his work as an author, Mentz pens finance columns for the conservative website Newsmax, and teaches online financial planning courses for Texas A&M University. Mentz attended law and business school in Louisiana and now lives in Colorado Springs, where he owns the Global Academy of Finance and Management. For $378, the company awards certifications to individuals who can then list official-sounding titles and acronyms after their names. (The certifications are “valid” for two years and then “members” must renew them annually.) At least 118 such titles are listed on the GAFM website, including “Certified Chartered FinTech Professional (ChFP),” “Master Business Analyst (MBA)” and “Registered Islamic Financial Specialist (RIFS).” It’s unclear what qualifications applicants must demonstrate in order to obtain the certifications. Mentz told The Denver Post they’re based on standards like college coursework.",
      "date": "10/17/2019 02:09 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Rick Perry Reportedly Called Rudy Giuliani To Address Trump’s Concerns About Ukraine",
      "url": "https://search.huffpost.com/click/_ylt=Awr9Ds72pqtdtggAcA1sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559286/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2frick-perry-rudy-giuliani-trump-concerns-ukraine_n_5da7d355e4b0b5c9be48d8f3/RK=2/RS=s0_EG_366b7xyX27x2iBE1hiAs4-",
      "subtitle": "The energy secretary said Trump’s lawyer offered debunked conspiracy theories on Ukrainian influence in the 2016 election, The Wall Street Journal reports.",
      "author": "Sanjana Karanth",
      "content": " Energy Secretary Rick Perry reportedly called President Donald Trump’s personal lawyer Rudy Giuliani earlier this year to address the president’s concerns about alleged corruption in Ukraine. Perry told The Wall Street Journal, in an interview published Wednesday, that Trump directed him this spring to seek out Giuliani, who pushed debunked conspiracy theories about Ukrainian interference in the 2016 U.S. presidential election instead of acknowledging that there had been Russian interference. Perry said he contacted Giuliani as a way to set the stage for a meeting between Trump and newly elected Ukrainian President Volodymyr Zelensky, according to the Journal. The energy secretary’s meeting adds to a growing picture of Giuliani working with Cabinet officials to push Ukraine to launch investigations. The former Texas governor became publicly linked to the Trump-Ukraine scandal earlier this month after sources familiar with the situation told Axios that Perry arranged Trump’s July 25 call with Zelensky and that the president said so in a recent conference call with House Republicans. “The only reason I made the call was because Rick asked me to,” Trump reportedly said, according to Axios. “Something about an LNG [liquefied natural gas] plant.” In the call with Zelensky, which is at the center of the House impeachment inquiry, Trump asked the Ukrainian president to interfere in the 2020 election by investigating political rival Joe Biden and his son Hunter Biden. Trump also alleged that Ukraine has Hillary Clinton’s email server, asking Zelensky to look into cybersecurity firm Crowdstrike, which was hired to investigate the hack of the Democratic National Committee in 2016. Perry’s phone call with Giuliani reportedly came after a White House meeting in May after Zelensky’s inauguration, according to the Journal. Officials at the meeting, including Perry and then-U.S. envoy to Ukraine Kurt Volker, encouraged Trump to meet the new president, but Trump said that they needed to work with Giuliani to resolve the lawyer’s concerns about Ukraine. Perry reportedly understood those concerns to be related to Trump’s 2016 presidential campaign. Giuliani has been specifically pushing the conspiracy theory that it was Ukraine and not Russia that interfered in the 2016 election. Former special counsel Robert Mueller and the U.S. intelligence community investigated and found that Russia had interfered in the election to help Trump win. Perry told the Journal that some of the conspiracy theories that Giuliani related in their call included that Ukraine was responsible for a dossier on Trump’s alleged ties to Russia, that Ukraine had Clinton’s email server and that the country’s government made up false evidence to send former Trump campaign chairman Paul Manafort to jail. “I don’t know whether that was crap or what,” Perry told the newspaper. “I’m just saying there were three things that he said. That’s the reason the president doesn’t trust these [Ukrainian] guys.” The three House committees in charge of leading the impeachment inquiry subpoenaed Perry last week, demanding that the energy secretary turn over documents related to the Trump administration’s communications with Ukraine. “Recently, public reports have raised questions about any role you may have played in conveying or reinforcing the President’s stark message to the Ukrainian President,” the chairmen of the House Intelligence, Foreign Affairs and Oversight and Reform committees wrote Oct. 10. The letter also said the reports bring up questions “about your efforts to press Ukrainian officials to change the management structure at a Ukrainian state-owned energy company to benefit individuals involved with Rudy Giuliani’s push to get Ukrainian officials to interfere in our 2020 election.” Perry has to respond to House subpoenas by Friday. The energy secretary also has denied reports that he is expected to resign by the end of the year.",
      "date": "10/16/2019 11:39 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Republicans Rage At Trump’s Syria Policy With Little To Show For It",
      "url": "https://search.huffpost.com/click/_ylt=Awr9Ds72pqtdtggAbg1sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559286/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2ftrump-syria-turkey-kurds-republicans_n_5da776f6e4b034f1d69c80c9/RK=2/RS=2bwG020QKjmY3y3ybQw7LfJqU3g-",
      "subtitle": "They huffed and they puffed and, well, they’re still not standing up to Trump.",
      "author": "Igor Bobic",
      "content": " WASHINGTON ― Republicans are apoplectic about Donald Trump’s abrupt decision to withdraw U.S. troops from Syria, calling it a shameful betrayal of the Kurds to a deadly Turkish invasion that could lead to a resurgence of the Islamic State in the Middle East. But ask them what Congress ― an independent institution charged with oversight of the executive branch ― ought to do to remedy the situation, and they scratch their heads, unable to come up with an answer. “It’s a great question. It’s such a big problem right now, it’s going to take some time to unravel what the next step should be,” Sen. Marco Rubio (R-Fla.) said Wednesday. Even Sen. Mitt Romney (R-Utah), one of Trump’s biggest critics who called the situation in Syria a “very dark moment in American history,” struggled to name a solution. “We’ve created an extraordinary mess, and the path forward is certainly unclear,” Romney told reporters on Capitol Hill. On the table is a bipartisan sanctions bill introduced by Sens. Lindsey Graham (R-S.C.) and Chris Van Hollen (D-Md.) that would unleash a series of economic sanctions against Turkey for its incursion into Syria, where a number of human rights violations have been reported following Trump’s decision to effectively greenlight the invasion by pulling U.S. troops out of northern Syria. It’s not clear, however, how much support there is for such a bill, nor whether it would prove effective. Senate Majority Leader Mitch McConnell has notably not committed to bringing it to the floor for a vote. Nor has the Kentucky Republican said whether he’ll allow a vote on a nonbinding bipartisan, bicameral resolution opposing Trump’s Syria policy that passed in the House on Wednesday by a 354-60 vote. “Turkey is a NATO ally, and we don’t want to totally fracture our relationship with them. We don’t want to further drive them into the arms of the Russians,” McConnell said at a weekly news conference Wednesday. Though McConnell voiced support for the Kurds and expressed his hope that a Thursday trip by Vice President Mike Pence and Secretary of State Mike Pompeo to Turkey “can somehow repair the damage” in the region, he made no remarks during an explosive meeting with Trump and other top congressional lawmakers at the White House on Wednesday afternoon. During that discussion in the Cabinet Room, Trump berated House Speaker Nancy Pelosi (D-Calif.) after she spoke out against the president’s handling of the Syria crisis. Trump, according to Pelosi, had a “meltdown” and offered no strategy for dealing with the situation going forward. Only two Republicans spoke in the meeting: Rep. Liz Cheney of Wyoming and Rep. Michael McCaul of Texas. Earlier Wednesday, Trump further undermined the long-standing alliance between U.S. and Kurdish forces who have been fighting alongside each other against ISIS in Syria. The president said that the Kurds are “not angels” and that Turkey’s invasion of Syria is “not our problem.” The Trump administrations’ abrupt foreign policy shift in the Middle East has brought bipartisan backlash from lawmakers, including top Trump ally Graham. The South Carolina Republican warned Trump was committing the “the biggest mistake of his presidency” by abandoning the Kurds, but he held out hope that Trump might yet correct course on Syria. “I fear this is a complete and utter national security disaster in the making, and I hope President Trump will adjust his thinking,” Graham tweeted Wednesday. Democrats, meanwhile, were skeptical that Republicans might take more drastic action in seeking to force Trump to alter course in the Middle East. As chairman of the powerful Senate Judiciary Committee, for example, Graham could hold up the president’s nominations to federal courts as leverage over the president. The Senate Foreign Relations Committee could also hold hearings into the matter. “I don’t think that’s likely to happen. Come on. Take a look around,” Sen. Dick Durbin (D-Ill.) told HuffPost on Wednesday.",
      "date": "10/16/2019 10:02 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Senate Advances Another Trump Court Pick Rated ‘Not Qualified’ To Serve",
      "url": "https://search.huffpost.com/click/_ylt=Awr9Ds72pqtdtggAbA1sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559286/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fsenate-trump-court-pick-justin-walker-not-qualified_n_5da8a558e4b0b24e75def646/RK=2/RS=I0vMKWoajD1xlsRYzAW.ng9eW.g-",
      "subtitle": "Justin Walker lacks the experience to be a lifetime federal judge, the American Bar Association says. But Republicans are ready to confirm him anyway.",
      "author": "Jennifer Bendery",
      "content": " WASHINGTON ― Senate Republicans voted Thursday to advance another of President Donald Trump’s judicial nominees, Justin Walker, who earned a rare and embarrassing “not qualified” rating from the American Bar Association. Every Republican on the Judiciary Committee voted to advance Walker, the president’s pick for a lifetime seat on the U.S. District Court for the Western District of Kentucky, to the Senate floor for a confirmation vote. Every Democrat voted no. Walker, 37, “does not presently have the requisite trial or litigation experience” to be a federal judge, the ABA’s Standing Committee concluded in a July review. The nonpartisan ABA, which thoroughly reviews each of a president’s judicial nominees, typically requires that someone chosen for a lifetime court seat have at least 12 years of experience practicing law. It’s not an automatic disqualifier, though, if a nominee has other substantial trial or courtroom experience. Walker falls short on both counts. “Mr. Walker’s experience to date has a very substantial gap, namely the absence of any significant trial experience,” the ABA concluded. “Mr. Walker has never tried a case as lead or co-counsel, whether civil or criminal. ... In addition, based on review of his biographical information and conversations with Mr. Walker, it was challenging to determine how much of his ten years since graduation from law school has been spent in the practice of law.” Ahead of the committee vote, Sen. Dick Durbin (D-Ill.) chided Republicans for voting to advance Walker despite his obvious lack of qualifications ― something they’ve done with other Trump court picks, too. “Some of the people who have come before us have literally never, ever entered a courtroom in their lives,” Durbin said. “They may not have ever seen a “Perry Mason” show and certainly didn’t stick around for the second half of any “Law and Order” episode. Now they want to be trial judges for the rest of their natural lives.” “Come on,” he added. “There have got to be more qualified Republican attorneys in America than the ones we’re seeing before this committee.” To date, since Trump became president, Senate Republicans have confirmed at least four lifetime federal judges who earned “not qualified” ratings from the ABA. They include U.S. Circuit Judge Leonard Steven Grasz, who the ABA concluded was “unable to separate his role as an advocate from that of a judge” given his strong anti-LGBTQ and anti-abortion views; U.S. District Judge Charles Goodwin, who the ABA said lacked the ability to fulfill the demands of a federal judge given his frequent absence from the courthouse in his former role as a magistrate judge; and U.S. Circuit Court Judge Jonathan Kobes, who the ABA found “was unable to provide sufficient writing samples of the caliber required” of a circuit judge. For context, in his entire eight years in the White House, President Barack Obama didn’t nominate anyone to be a lifetime federal judge who earned a “not qualified” ABA rating. Walker, a University of Louisville law professor who previously clerked for then-D.C. Circuit Court Judge Brett Kavanaugh, may be a weak candidate for a federal judgeship, but he has a strong ally in the Senate: Majority Leader Mitch McConnell (R-Ky.), who recommended him to the White House. “This is unquestionably the most outstanding nomination that I’ve ever recommended to Presidents to serve on the bench in Kentucky,” McConnell tweeted in July, just a day after the ABA issued its awful rating of Walker’s qualifications. When Kavanaugh was nominated to the Supreme Court in 2018, Walker went out of his way to defend his former boss against credible allegations by Christine Blasey Ford that he sexually assaulted her when they were high school students. Walker participated in more than 70 media interviews challenging Ford. “She may believe that assailant was Brett Kavanaugh,” Walker claimed in a Fox News interview in September 2018. “I believe she’s mistaken.” Walker’s nomination now heads to the full Senate for a confirmation vote.",
      "date": "10/17/2019 02:45 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "In Dallas, Trump Unleashes Wrath On Democrats As Impeachment Inquiry Finds Foothold",
      "url": "https://search.huffpost.com/click/_ylt=Awr9Ds72pqtdtggAag1sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559286/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2ftrump-texas-rally-dallas_n_5da91695e4b0e71d65b6553d/RK=2/RS=zYl8a2nHpOGi_rM8Z.c3W3panVk-",
      "subtitle": "Earlier in the day, acting White House chief of staff Mick Mulvaney confirmed Trump ordered military aid to Ukraine to be put on hold. He later denied those remarks.",
      "author": "Nick Visser",
      "content": " President Donald Trump raged against Democrats and the House impeachment inquiry during his campaign rally Thursday in Dallas, arguing that the Democratic Party, including 2020 presidential rival Joe Biden, had “betrayed our country.” “At stake in this fight is the survival of American democracy itself. Don’t kid yourself,” Trump, largely going off-script, told supporters at American Airlines Arena. “They are destroying this country, but we will never let it happen, not even close. For three straight years, radical Democrats have been trying to overthrow the results of a great, great election.” The president has been on the defense in recent weeks as a parade of former administration officials have spoken to House investigators, shedding new light on Trump’s demands that Ukraine investigate political rival Biden and his son. Lawmakers have fired off a slate of subpoenas to interview current and former diplomats and administration officials in recent weeks, and, despite the White House’s efforts to keep them from testifying, they have been talking at length. House Speaker Nancy Pelosi (D-Calif.) opened the formal impeachment inquiry last month after a whistleblower complaint about Trump’s July 25 call with Ukrainian President Volodymyr Zelensky. The White House released a reconstruction of the conversation, during which Trump repeatedly asked his counterpart to investigate the Bidens. Hunter Biden had served on the board of a Ukrainian energy company for five years. The call came shortly after Trump ordered his aides to put on hold nearly $400 million in military funding that had been appropriated for Ukraine, and critics have claimed the call reflected a clear demand for a quid pro quo for political help. In Texas, Trump repeated a slate of conspiracy theories featuring the Bidens, accusing the father and son of engaging in impropriety while Joe Biden was vice president. Neither has been accused of any wrongdoing, and Hunter Biden said earlier this month he did nothing “improper.” But despite Trump’s assertions, the drama around his call with Ukraine deepened Thursday within his own orbit as acting White House chief of staff Mick Mulvaney held an extraordinary press conference in which he confirmed that Trump ordered the military aid to be withheld unless Zelensky agreed to help in the U.S. election. Mulvaney’s remarks to the press prompted a maelstrom within the White House and undercut Trump’s own denials, but Mulvaney walked them back just hours later. He placed blame on the media for misconstruing his comments “to advance a biased and political witch hunt against President Trump” and said there was “absolutely no quid pro quo” demanded by the White House. Trump echoed that in Dallas before going on a tear against Pelosi and the anonymous whistleblower, calling the House speaker “crazy” and “nuts.” The criticism came a day after Sen. Chuck Schumer (D-N.Y.) said the president insulted Pelosi during a meeting at the White House, referring to her as a “third-grade politician.” Pelosi fired back that Trump had a “meltdown” during the discussion. “I really don’t believe anymore that they love our country. I don’t believe it. Crazy Nancy. That crazy Nancy, she is crazy,” Trump said. “They come after me, but what they’re really doing is they’re coming after the Republican Party and what they’re really, really doing is they’re coming after and fighting you, and we never lose.” The president also demanded once again to face his whistleblower and lobbed criticism at the intelligence community inspector general, Michael Atkinson, who first received the complaint and deemed it urgent and credible. “What about the whistleblower? The whistleblower got it all wrong,” Trump, appearing enraged, said. “Who’s the whistleblower? We have to know. Is the whistleblower the spy?”",
      "date": "10/17/2019 10:53 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Whoopi Goldberg Slams Trump’s Reaction To Syria Criticism: ‘Grow A Pair, Man’",
      "url": "https://search.huffpost.com/click/_ylt=Awr9Ds72pqtdtggAaA1sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559286/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fwhoopi-goldberg-the-view-trump-syria_n_5da8b8e7e4b0b5c9be4b50cf/RK=2/RS=CWcfKzYlwIxZpU4d2G8wKILSAp4-",
      "subtitle": "“The View” co-host lambasted the president for pulling U.S. troops out and then “pretending you didn’t do it.”",
      "author": "David Moye",
      "content": " Whoopi Goldberg has some advice for Donald Trump: “Grow a pair, man.” “The View” co-host’s ballsy suggestion came during a Thursday discussion on Trump’s handling of the crisis on the Turkey-Syria border, as well as the way he lashed out in a meeting with congressional leaders on his abrupt removal of U.S. troops from Syria. “Here’s the thing that’s really pissing me off,” Goldberg said. “You made a decision to pull these troops out, and now you’re pretending you didn’t do it.” Following Trump’s decision to pull troops, Turkey launched an attack on the Kurds, long an ally of the U.S. “For me, if you are going to sit in that office, grow a pair, because you did this, you started this,” Goldberg said Thursday. “You pulled these folks out. You’re the one trying to say the Kurds are not good — they fought beside us.” “When did you decide they weren’t altogether right for us to be working with? When did this all happen? Last week,” she continued. “So grow a pair, man. You brought this on yourself.” You can see the complete segment below.",
      "date": "10/17/2019 04:05 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Mick Mulvaney Walks Back Admission Of Quid Pro Quo In Trump’s Ukraine Call",
      "url": "https://search.huffpost.com/click/_ylt=Awr9Ds72pqtdtggAZg1sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559286/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fmick-mulvaney-walks-back-quid-pro-quo-answer_n_5da8e40ce4b0258abfcac997/RK=2/RS=0xXANSbuY8X6U.zZJ6lhD8N6600-",
      "subtitle": "“Once again, the media has decided to misconstrue my comments to advance a biased and political witch hunt against President Trump,” the White House chief of staff said.",
      "author": "Lydia O’Connor",
      "content": " Hours after saying Thursday that President Donald Trump withheld foreign aid in order to get Ukraine’s help in the U.S. election, acting White House chief of staff Mick Mulvaney walked back his remarks. He released a lengthy statement wrongly blaming the press for putting a spin on his comments. “Once again, the media has decided to misconstrue my comments to advance a biased and political witch hunt against President Trump,” he said. “Let me be clear, there was absolutely no quid pro quo between Ukrainian military aid and any investigation into the 2016 election.” But the remarks Mulvaney made at a news conference earlier in the day were not vague. “We do that all the time with foreign policy,” Mulvaney said when ABC News reporter Jon Karl noted that it would constitute a quid pro quo if the U.S. was withholding funding from Ukraine unless it agreed to do an investigation into the Democrats’ server. “Get over it,” Mulvaney added later. “There’s going to be political influence in foreign policy. ... That is going to happen. Elections have consequences.” Mulvaney’s statement, which followed reports that the White House was shocked by his comments at the news conference, contradicts that. “The president never told me to withhold any money until the Ukrainians did anything related to the server,” he said. “The only reasons we were holding the money was because of concern about lack of support from other nations and concerns over corruption.” But in his earlier remarks, Mulvaney said Trump told him he was concerned about corruption related to the Democratic National Committee’s server, the key element of a debunked conspiracy theory that Trump and others close to him have pushed. The baseless claim is that the DNC server has gone missing in a cover-up and that Crowdstrike, a private cybersecurity company hired to investigate Russia’s hack of the DNC’s servers, is now framing Russia for election interference. In reality, the DNC’s so-called “server” is actually a system of 140 individual servers, none of which are missing. This article has been updated with details on the news conference and the server conspiracy theory.",
      "date": "10/17/2019 06:15 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Trump Donor Gordon Sondland Claims He Was ‘Disappointed’ By President’s Ukraine Dealings",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DuYZp6tdNmIAzAZsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559321/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fgordon-sondland-trump-ukraine-testimony_n_5da86d9ae4b0b24e75de3580/RK=2/RS=8gVFzi8gj9bGuLxDGQ3CorTiqNw-",
      "subtitle": "The U.S. ambassador to the European Union criticized the president in prepared testimony to House committees as part of their impeachment inquiry.",
      "author": "",
      "content": "Gordon Sondland, the U.S. ambassador to the European Union, criticized President Donald Trump’s dealings with Ukraine, saying he was “disappointed” in the president’s efforts to have Rudy Giuliani interfere in foreign affairs. Giuliani, Trump’s personal attorney, was being paid by one of the recently indicted Ukrainian-American businessmen who were helping him dig up dirt on former Vice President Joe Biden, whom Trump sees as his chief political rival. Sondland, a self-described “lifelong Republican” who donated $1 million to Trump’s inaugural committee and was nominated as EU ambassador in 2018, told House impeachment investigators in an opening statement on Thursday that Trump indicated he was “skeptical” that Ukraine was serious about reform. A few days after Ukrainian President Volodymyr Zelensky’s inauguration in May, Trump instructed Sondland and others in a U.S. delegation to Ukraine to talk to Giuliani. “It was apparent to all of us that the key to changing the President’s mind on Ukraine was Mr. Giuliani,” Sondland said. “Our view was that the men and women of the State Department, not the President’s personal lawyer, should take responsibility for all aspects of U.S. foreign policy towards Ukraine.” Sondland also addressed a text message he sent suggesting that he and a colleague “stop the back and forth by text” after a colleague suggested Trump wanted a quid pro quo with Ukraine. He claimed in his testimony that this was not an attempt to prevent the creation of a paper trail. Sondland said he simply prefers “to talk rather than to text” because it’s the way to “most effectively get things done.” “Any implication that I was trying to avoid making a record of our conversation is completely false. In my view, diplomacy is best handled through back-and-forth conversation,” he said. Read his remarks as prepared for delivery below, via BuzzFeed’s Zoe Tillman: This is a developing story. Check back for updates.",
      "date": "10/17/2019 09:50 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "‘National Boss’ Pelosi Lights Up Twitter After Viral Photo Of Her Standing Up To Trump",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DuYZp6tdNmIAygZsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559321/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fnancy-pelosi-trump-boss_n_5da7d11be4b034f1d69cda8b/RK=2/RS=rTNXVlkxFVYPovAgHsvRfWJa4HI-",
      "subtitle": "The House speaker’s White House moment happened on National Boss Day.",
      "author": "Ed Mazza",
      "content": " Supporters of House Speaker Nancy Pelosi (D-Calif.) are hailing her “boss move” in the White House on Wednesday when she literally stood up to President Donald Trump in an instantly viral image. And it happened on National Boss Day. Trump released the photo himself, claiming it showed an “unhinged” Pelosi: But the photo was celebrated instead ― with Pelosi even making it the banner on her Twitter page. “Fifty years from now, schoolchildren studying American history will come upon this photograph, and they will instantly know who was in charge in that room,” Lawrence O’Donnell said on MSNBC. “The adult standing and pointing at the pained face across the table.” On social media, the usual Michael Scott memes for National Boss Day ― with the occasional Bruce Springsteen tweet mixed in ― were quickly overwhelmed by images of “boss” Pelosi in the White House:",
      "date": "10/17/2019 12:03 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Nancy Pelosi Hilariously Trolls Trump With New Pic On Twitter Profile",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DuYZp6tdNmIAyAZsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559321/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fnancy-pelosi-troll-donald-trump-twitter-photo_n_5da7a6cae4b034f1d69cc446/RK=2/RS=wI3YrhQQduany0jamDBoS.gKKR8-",
      "subtitle": "The president tried to insult the House speaker with a photo. It’s now featured proudly on her Twitter page.",
      "author": "David Moye",
      "content": " Donald Trump attempted to paint House Speaker Nancy Pelosi as unhinged, but it may not have worked as he hoped. On Wednesday, the president reportedly berated Pelosi during a meeting regarding the crisis on the Turkey-Syria border and, according to the California Democrat, even called her a “third-grade politician.” Pelosi later called Trump’s behavior a “meltdown,” which apparently ticked him off, so he tried the old “I’m rubber and you’re glue” trick on Twitter. Trump posted a photo of Pelosi standing up at the meeting, which he labeled an “unhinged meltdown” ― and who should know more about that than a self-proclaimed “stable genius”? Many Twitter users didn’t think the photo made Pelosi look unhinged at all. One person who was especially fond of the photo was none other than Pelosi herself, who made it her cover photo on her Twitter page. Trump hasn’t responded to how Pelosi spun the photo, but he doubled down on his dubious claim that she had a meltdown.",
      "date": "10/16/2019 09:18 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Mulvaney Acknowledges Quid Pro Quo In Trump Ukraine Call, Says ‘Get Over It’",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DuYZp6tdNmIAxgZsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559321/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fmick-mulvaney-acknowledges-quid-pro-quo_n_5da8a1ffe4b0b24e75deeec6/RK=2/RS=dJ4cpmbIkQAhe8KMcqtUNfZpaFY-",
      "subtitle": "Trump’s acting chief of staff told reporters, “We do that all the time,” when asked about withholding aid for political help. Later, he walked back that admission.",
      "author": "Carla Herreria",
      "content": " Acting White House chief of staff Mick Mulvaney admitted on Thursday that President Donald Trump withheld foreign aid in order to get Ukraine’s help in the U.S. election. “We do that all the time with foreign policy,” Mulvaney responded when ABC News reporter Jon Karl pointed out that withholding funding from Ukraine “unless the investigation into the Democrats’ server happens” is a “quid pro quo.” “Get over it,” Mulvaney added later. “There’s going to be political influence in foreign policy. ... That is going to happen. Elections have consequences.” Foreign policy negotiations often demand trading a move by one country with a policy change by the other. President John F. Kennedy resolved the Cuban Missile Crisis with the Soviet Union by agreeing to remove U.S. nuclear missiles from Turkey in exchange for the USSR pulling its nuclear missiles from Cuba. What makes Trump’s exchange different is that the “favor” he asked of Ukrainian President Volodymyr Zelensky was a personal, political benefit. The insertion of personal gain is what makes it corrupt. Mulvaney claimed that the Trump administration was withholding aid from Ukraine to coerce the country into investigating a supposed Democratic National Committee email server and alleged “corruption” in the 2016 election ― not former Vice President Joe Biden, one of Trump’s top political rivals heading into 2020. (Mulvaney’s claim is incomplete and misleading: Trump brought up both the DNC server and Biden in his call with Ukraine’s president.) When Karl asked why the U.S. stopped the aid, Mulvaney said that Trump thought it was unfair that the European Union wasn’t doing more to help Ukraine. Then Mulvaney referenced a debunked conspiracy theory that claims the DNC’s physical “server” is missing in a cover-up and that Crowdstrike, a private cybersecurity company hired to investigate Russia’s hack of the DNC’s servers, is framing Russia for election interference. “Did [Trump] also mention to me in the past the corruption that related to the DNC server? Absolutely. No question about that,” Mulvaney told the reporter. “But that’s it, and that’s why we hung up the money.” As The Daily Beast reported last year, the DNC’s so-called “server” is actually a system of 140 servers and none of the DNC’s machines are missing. Speaking to reporters, Republican Sen. Lisa Murkowski of Alaska denounced efforts to “hold up” foreign aid for political reasons. “You don’t hold up foreign aid that we had previously appropriated for a political initiative,” Murkowski said in response to questions about Mulvaney’s press conference. Hours after the news conference, Mulvaney walked back his admission that the U.S. withheld Ukranian aid for political gain. In a lengthy statement, he said the opposite of his earlier remarks: “There was absolutely no quid pro quo between Ukranian military aid and any investigation into the 2016 election.” Mulvaney also wrongly blamed the media for “misconstruing” and putting a spin on the comments he made during the news conference, which was televised and streamed live to the public. Paul Blumenthal contributed reporting. This article has been updated with Mulvaney’s later comments denying he had said there was a quid pro quo over political help.",
      "date": "10/17/2019 01:36 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Donald Trump Jr.’s Oblivious Gripe About Nepotism Gets The Treatment On Twitter",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DuYZp6tdNmIAxAZsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559321/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fdonald-trump-jr-hunter-biden-nepotism-backlash_n_5da6b806e4b002e33e77181f/RK=2/RS=Yyn_cHkqZk1nR9G0gwMaQsvETMA-",
      "subtitle": "“Dude your name is literally your dad’s full name,” one person fired back.",
      "author": "Lee Moran",
      "content": " Donald Trump Jr. was widely ridiculed on Twitter after he attacked Hunter Biden for acknowledging that he’d benefited in life because of his surname. Critics responded by sarcastically calling President Donald Trump’s son ― who is an executive vice president for his father’s company, The Trump Organization, and appeared on his father’s reality TV show “The Apprentice” ― an “anti-nepotism activist.” Biden, the son of former vice president and current 2020 Democratic candidate Joe Biden, admitted in an interview on “Good Morning America” that he wouldn’t have acquired roles on the boards of certain companies “without saying that I’m the son of the vice president of the U.S.” “I don’t think that there’s a lot of things that would have happen in my life if my name wasn’t Biden,” Biden added. He denied any wrongdoing in his work with Ukrainian and Chinese companies. Trump Jr. claimed there was a “Dumpster fire at Biden HQ!” Detractors immediately noted the irony of Trump Jr.’s claim:",
      "date": "10/16/2019 03:30 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Trevor Noah Mocks Trump’s Sons For Complaining About Nepotism",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DuYZp6tdNmIAwgZsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559321/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fdaily-show-hunter-biden-trump-junior-nepotism_n_5da7f382e4b034f1d69cfd63/RK=2/RS=qPI8IPsft5kAnNpX_kgkhf70tZw-",
      "subtitle": "“The Daily Show” host thinks it’s curious that Donald Trump Jr. and Eric Trump are griping about Hunter Biden.",
      "author": "Josephine Harvey",
      "content": " Trevor Noah mocked President Donald Trump’s sons Eric and Donald Jr. Wednesday night for griping about Hunter Biden receiving favoritism because of his family name. Noah said he could understand why most people would complain about Hunter Biden getting a leg up in life via his last name, but what he couldn’t understand was the Trump children doing it. Trump Jr. drew ire on Twitter Tuesday after he criticized Hunter Biden for acknowledging in an interview that he would not have acquired certain roles on the boards of companies had he not been the son of former Vice President Joe Biden: “If there was ever an example of people who got opportunities because of their names, it’s these two,” Noah said of the Trump offspring on Wednesday night’s “The Daily Show.”",
      "date": "10/17/2019 02:42 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Rep. Elijah Cummings Dead At 68",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DuYZp6tdNmIAwAZsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559321/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2frep-elijah-cummings-dead_n_5da82baae4b0b5c9be49604f/RK=2/RS=uR3aGAmw3Xf2vAwn2dfB1guz5y4-",
      "subtitle": "The veteran Democratic representative chaired the powerful House Oversight Committee investigating President Donald Trump’s impeachment.",
      "author": "Lee Moran",
      "content": " Rep. Elijah Cummings (D-Md.) has died, according to a statement from his office. The Democratic member of Congress chaired the House Oversight Committee, which is among the panels investigating the impeachment of President Donald Trump. He was 68. Cummings died at Gilchrist Hospice Care in Baltimore at approximately 2:30 a.m. Thursday “due to complications concerning longstanding health challenges,” his office confirmed in a statement to HuffPost. He did not return to work following an unidentified medical procedure in September. “Congressman Cummings was an honorable man who proudly served his district and the nation with dignity, integrity, compassion and humility,” his wife Maya Rockeymoore Cummings, the Maryland Democratic Party chair, said in a statement. “He worked until his last breath because he believed our democracy was the highest and best expression of our collective humanity and that our nation’s diversity was our promise, not our problem,” she added. “It’s been an honor to walk by his side on this incredible journey. I loved him deeply and will miss him dearly.” Cummings, the son of a sharecropper, practiced law for almost two decades and served in the Maryland House of Delegates before winning his congressional seat in 1996, where he was renowned for championing civil rights issues. His House committee’s probes into the Trump administration drew fierce anger from the president. In July, Trump tweeted racist insults about Cummings and his majority-black district, calling it a “rodent-infested mess.” Cummings earlier this year said he had “no doubt” that Trump is a racist after the president said four Democratic members of Congress ― all women of color ― should “go back” to other countries. On the only time in 2017 that Cummings talked one-on-one with Trump about lowering drug prices, the Baltimore Sun reported him as telling the president: “Mr. President. You’re now 70-something, I’m 60-something. Very soon you and I will be dancing with the angels. The thing that you and I need to do is figure out what we can do — what present can we bring to generations unborn?” Rep. Carolyn Maloney (D-N.Y.) reportedly will serve as acting chair of the Oversight Committee until a permanent replacement is selected. Trump on Thursday tweeted his condolences, describing Cummings as someone whose “work and voice on so many fronts will be very hard, if not impossible, to replace!” Lawmakers from both sides of the aisle, celebrities and journalists also remembered the lawmaker on social media.",
      "date": "10/17/2019 05:01 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Next G-7 Summit To Be Held At Trump’s Miami Golf Course",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DuYZp6tdNmIAvgZsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559321/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fg7-summit-trump-golf-course-miami_n_5da89adbe4b034f1d69f0703/RK=2/RS=w1bZyIG5rgkGFxXVOTENIk_r7ZQ-",
      "subtitle": "Acting chief of staff Mick Mulvaney dismissed concerns that the president would personally profit by holding the summit at a property he owns.",
      "author": "Antonia Blumberg",
      "content": " President Donald Trump plans to host next year’s Group of Seven summit for leaders of major industrial nations at his golf resort in Miami, acting chief of staff Mick Mulvaney announced on Thursday. Mulvaney told reporters during a press briefing that the Trump National Doral is the “best place” to host the summit, dismissing concerns that the president would personally profit by doing so. “There’s no issue on him profiting on this in any way, shape or form,” Mulvaney said. Mulvaney said the administration looked at 12 potential sites before settling on the Doral. “This was by far and away the best choice,” he said. The acting chief of staff dismissed one reporter’s comparison of Trump to former Vice President Joe Biden, saying the Trump family made its money before Trump was in office. (The president is facing a House impeachment investigation for pressuring the government of Ukraine to dig up dirt on Biden for allegedly using his office to personally profit.) Mulvaney said Trump is aware that hosting the summit at his own property could raise concerns of impropriety. “The president knows that,” he said. “We know the environment we live in. He knows exactly he’s going to get that reaction. That’s fine, I’m willing to take that.” House Judiciary Chairman Jerrold Nadler (D-N.Y.) called the administration’s decision “brazen” and accused the president of using his office “for personal financial gain” in a statement on Thursday. “The Administration’s announcement that President Trump’s Doral Miami resort will be the site of the next G7 summit is among the most brazen examples yet of the President’s corruption,” Nadler said. “He is exploiting his office and making official U.S. government decisions for his personal financial gain.” Trump first floated the idea of hosting the G-7 summit at his Florida resort in August, prompting the House Judiciary Committee to look into potential violations of the U.S. Constitution. The president is the sole beneficiary of a trust that now owns his family business. Hosting the summit at the Doral would thus likely put many millions of dollars into Trump’s own cash registers. In a financial disclosure form filed in May, the president claimed to have received $81,417,193 in “income” from the Florida resort over the previous year. Trump’s use of his own property for the summit could prove to violate the Constitution’s emoluments clauses, which prohibit federal officeholders from receiving gifts or payments from governments, Nadler and Rep. Steve Cohen (D-Tenn.), who chairs the subcommittee on the Constitution, civil rights and civil liberties, said in a statement in August. Nadler said Thursday that the committee would continue investigating the decision for possible violations of the emoluments clauses. But he added: “We will not allow this latest abuse of power to distract from Congress’ efforts to get to the bottom of the President’s interference in the 2020 election.” Mulvaney’s assertion that the Trump resort is obviously the “best choice” for the summit has also been called into question. “It’s a dump,” one former White House official, who asked not to be named, said of the Doral. During the Republican National Committee’s meeting at the resort last spring, there were major maintenance issues in evidence. “At least one of the guest buildings smelled of mildew, as did its guest rooms,” HuffPost’s S.V. Date reported earlier this year. “The restaurant on the lower floor in the main lodge had a mustiness tinged with the fraternity house odor of spilled alcohol. Its lap pool’s water was both over-chlorinated and kept at too low a level, making it unpleasant to use for its intended purpose.” This story has been updated with a statement from House Judiciary Chair Jerrold Nadler. S.V. Date contributed to this report.",
      "date": "10/17/2019 12:56 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Fox News’ Andrew Napolitano: Hosting G-7 At Trump Resort Is ‘Profound’ Emoluments Breach",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DuYZp6tdNmIAvAZsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559321/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fg7-doral-andrew-napolitano-emoluments-violation-trump_n_5da9057fe4b04c4d24e9a6d5/RK=2/RS=iay5Zq6l.lR1wTZlsKfNlUo44F0-",
      "subtitle": "This is “exactly what the emoluments clause was written to prohibit,” the legal analyst said on Fox Business.",
      "author": "Mary Papenfuss",
      "content": " Fox News legal analyst Judge Andrew Napolitano criticized President Donald Trump’s decision to host the next Group of Seven summit at his own golf resort in Miami as a “direct and profound” violation of the emoluments clause of the Constitution. Trump has “bought himself an enormous headache now” with his choice for next year’s summit, Napolitano explained Thursday on Fox Business. “This is about as direct and profound a violation of the emoluments clause as one could create.” The emoluments clause of the Constitution prohibits federal officeholders from receiving gifts or payments from foreign governments. It’s designed to prevent the president from being influenced by gifts or cash from foreign entities. The Doral setup is “exactly what the emoluments clause was written to prohibit,” Napolitano said. Acting White House chief of staff Mick Mulvaney announced the decision Thursday. He told reporters during a press briefing that the Trump National Doral is the “best place” to host the summit and dismissed concerns that the president would personally profit from the choice of venue. Mulvaney said there’s “no issue of him profiting on this in any way, shape or form,” because the event will be provided “at cost,” which would be determined by Trump’s golf resort. Critics point out that the business also will greatly benefit financially from the worldwide exposure such an event would bring. In any case, the Constitution “does not address profits,” Napolitano noted. “It addresses any present, as in a gift, any emolument, as in cash, of any kind whatever — I’m quoting the emoluments clause — from any king, prince or foreign state,” he emphasized. House Judiciary Chairman Jerry Nadler (D-N.Y.) called the decision among the most “brazen examples yet of the president’s corruption. He is exploiting his office and making official U.S. government decisions for his personal financial gain.” Check out what else Napolitano had to say in the video up top.",
      "date": "10/17/2019 09:55 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Anderson Cooper’s Face Says It All As Trump Awards G-7 Meeting To His Own Resort",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DuQxp6tdEG4AcwdsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559345/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fanderson-cooper-donald-trump-g7_n_5da9635ee4b0e71d65b6ae8d/RK=2/RS=qI5Rm5Jm0_.Dzp.Sj4ue7mtwWGU-",
      "subtitle": "The CNN host taunts the president in his “RidicuList” segment.",
      "author": "Ed Mazza",
      "content": " CNN’s Anderson Cooper called out President Donald Trump for awarding next year’s G-7 summit hosting gig to his own resort. On Thursday, acting White House chief of staff Mick Mulvaney called the Trump National Doral resort near Miami “far and away the best physical facility for this meeting.” Cooper mocked the announcement with both his facial expressions and a heaping dose of sarcasm: Really? Far and away? Gosh! I mean, thank goodness that they found a hotel with a golf course. You know how hard those are to find in the United States? It’s like finding a Russian needle in a Ukrainian haystack. Cooper also played clips of Trump talking up his resort, promising that each delegation could have its own bungalow. “Sounds fancy ― sounds like the Beverly Hills Hotel, where you can allegedly have your security guard bring the porn stars in the back way,” Cooper said, referring to the site of Trump’s alleged dalliances with adult entertainer Stormy Daniels and Playboy model Karen McDougal. See his full “RidicuList” takedown below:",
      "date": "10/18/2019 04:37 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Rick Perry Officially Notifies Trump Of His Resignation",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DuQxp6tdEG4AcQdsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559345/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2frick-perry-resigns-trump_n_5da8d003e4b0bc9247599b5b/RK=2/RS=7hKNFvtBPrCj40gv5hpT4jmHwNQ-",
      "subtitle": "The energy secretary said he’ll step down from the Cabinet “at a date later this year” after weeks of speculation over his departure.",
      "author": "Carla Herreria",
      "content": " Rick Perry notified President Donald Trump that he was resigning from his post as secretary of the Department of Energy. Perry told the president before his campaign rally in Dallas. “It has been a tremendous honor to serve our country in your administration in such a meaningful way,” Perry said in a letter to Trump. He did not give a specific date when he would leave office, noting that he plans “to resign at a date later this year.” The Department of Energy made Perry’s resignation letter public on Thursday night, just as Trump announced it during his rally in Dallas. “He’s going to be leaving at the end of the year, and probably coming back here,” Trump told his Texas supporters. Whatever he does he’s going to be very successful.” Perry’s notice of resignation comes after weeks of speculation over his departure and before news of his involvement with Trump’s efforts to pressure the Ukrainian president to investigate his political rivals came to light. Perry, the former governor of Texas, revealed in an interview with The Wall Street Journal on Wednesday that he called Trump’s personal attorney Rudy Giuliani, under Trump’s direction, to discuss the president’s concerns of corruption in Ukraine. Perry told the Journal that the call was intended to help set up a meeting between Trump and Ukrainian President Volodymyr Zelensky. The remarks Perry made in that interview directly contradicts an earlier report by Axios that Trump during a conference call claimed he unwillingly made the call to Zelensky, which is now the focus of a House impeachment probe because Perry urged him to. Though Perry didn’t offer an official date for his departure, he was reportedly expected to leave office by the end of November, Politico reported earlier this month. Earlier Thursday, at a ribbon-cutting ceremony for a new Luis Vuitton factory in Texas, Trump told reporters that he already had a replacement lined up for energy secretary. “We have the man ... that we’re going to be putting in Rick’s place,” Trump said, according to video by The Hill. Perry has served as energy secretary for over two years. This article has been updated with the Department of Energy making a formal announcement of Perry’s resignation.",
      "date": "10/17/2019 04:40 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Joe Scarborough Unloads On Donald Trump’s Base For Swallowing His Lies",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DuQxp6tdEG4AbwdsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559345/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fjoe-scarborough-donald-trump-supporters-lies_n_5da9a52be4b0e0f0378a5f5f/RK=2/RS=P..rWMFBzu994x8Sl8__r7Tnc8U-",
      "subtitle": "“It’s the responsibility of the people that show up at those rallies to not be stupid, to not be so stupid that they should be kept away from blenders.”",
      "author": "Lee Moran",
      "content": " Joe Scarborough on Friday tore into President Donald Trump’s hardcore supporters who unquestioningly accept his lies as the gospel truth. The host of MSNBC’s “Morning Joe” urged Trump’s base to spend just three seconds watching the news, reading their local newspaper or searching credible sites on Google. If they had done so, he said, they would have realized that the president’s claim at a Thursday rally in Dallas that the Kurds are happy with Turkey’s temporary pause on its attacks on Kurdish-held northern Syria was untrue. The attacks began last week after Trump withdrew U.S. support for Kurdish allies in the region. “It’s the responsibility of the people that show up at those rallies to not be stupid, to not be so stupid that they should be kept away from blenders,” said Scarborough, adding that it was a “horrible deal for the Kurds.” “The responsibility, you know, sure it’s with the president, but at this point it’s with the people cheering and waving things, Trump flags, in the audience,” he continued. “They have a responsibility to not be dumb, and they have a responsibility to be informed. They have a responsibility not to be ignorant, and all I’m asking is that they just spend two or three minutes actually looking at the news and educating themselves.” Scarborough said “just about everything” Trump said on stage in Texas Thursday about the Middle East, the Kurds and Turkey was false — and that the consequences would be dire. “We’re all going to pay for it,” he warned. “You’re going to pay for it. We’re going to pay for it. Our children are going to pay for it. Our country’s going to pay for it with the rise of ISIS. This is coming again.” Check out Scarborough’s comments starting at the 10-minute mark above.",
      "date": "10/18/2019 09:28 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Gordon Sondland’s Testimony About The Trump-Ukraine Scandal Defies Belief",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DuQxp6tdEG4AbQdsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559345/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fsondland-ukraine-trump-giuliani_n_5da8ca57e4b034f1d69f7557/RK=2/RS=grDmy3ZP8adCNPpHhQc43LyvpQ8-",
      "subtitle": "The ambassador claims he didn’t know Donald Trump was targeting Joe Biden in Ukraine — but the evidence was on front pages for months.",
      "author": "Nick Robins-Early",
      "content": " Ambassador Gordon Sondland told House impeachment investigators on Thursday that he didn’t know President Donald Trump’s interest in Ukraine had anything to do with 2020 rival Joe Biden. Sondland’s explanation is hard to believe. In his opening statement, the U.S. ambassador to the European Union said he only recently learned that Trump’s personal lawyer Rudy Giuliani may have tried to get Ukrainian officials to probe the former vice president’s dealings in the country. But it would have been almost impossible for someone working at the highest levels of diplomacy, who claimed Ukraine was an important part of his portfolio, to ignore the signs ― or the headlines. Even before Trump’s now-infamous July 25 phone call in which he requested that Ukrainian President Volodymyr Zelensky launch an investigation into Biden, there was a deluge of press coverage about his son Hunter Biden’s work at gas company Burisma Holdings, and Trump’s interest in it. If that weren’t enough, Giuliani and other Trump associates had spent months openly pushing conspiracy theories involving Biden and Ukraine. In Sondland’s account of events, Trump held a meeting with him, Energy Secretary Rick Perry and then-special representative to Ukraine Kurt Volker on May 23 in which it became clear that Giuliani would be the president’s point person on Ukraine. “I did not understand, until much later, that Mr. Giuliani’s agenda might have also included an effort to prompt the Ukrainians to investigate Vice President Biden or his son or to involve Ukrainians, directly or indirectly, in the President’s 2020 reelection campaign,” Sondland stated. But it shouldn’t have been hard for Sondland to guess Trump and Giuliani’s interest in Ukraine: Giuliani openly told The New York Times on May 9 that he was traveling to Kyiv to push for an investigation into Biden and Burisma. Giuliani was then forced to cancel his trip amid a public backlash and allegations he was seeking to influence the 2020 election. He blamed the cancellation on “enemies of the president” he claimed were in the current Ukrainian administration. Days before Giuliani canceled his trip, it was also front-page news in The New York Times that Trump and his associates were focused on the Bidens’ history in Ukraine as they looked at Joe Biden as a potential opponent in 2020. The May 2 report specifically highlighted Giuliani’s role in the effort, pointing out that he had met with both current and former top prosecutors in Ukraine to ask about the Burisma investigation. “Mr. Giuliani has spearheaded the effort among conservatives to publicize and encourage the new investigation in Ukraine,” the Times reported. Allegations that Biden had sought to quash an investigation into Burisma had been swirling around conservative media for months after John Solomon, an opinion columnist for The Hill, promoted a series of dubious and poorly fact-checked claims from a former Ukrainian prosecutor. His piece on Biden was shared over 37,000 times and prompted far-right outlets such as The Gateway Pundit to run with the story in multiple follow-up articles. Solomon, now a contributor for Fox News, was also a frequent guest of Trump favorites on the network such as Sean Hannity. Trump even tweeted out, “John Solomon: As Russia Collusion fades, Ukrainian plot to help Clinton emerges,” following one of Hannity’s shows in March — the title of a column claiming a conspiracy between Democrats and Ukrainian officials during the 2016 presidential campaign. The scrutiny of the Bidens in Ukraine and Giuliani’s role in pushing for an investigation intensified in the months after The New York Times story, with The Washington Post, The New Yorker, The Washington Times, BuzzFeed and others all publishing substantial reports on the subject. Beyond the media coverage, Trump’s most vocal supporters and advisers had made Biden and Ukraine a frequent talking point. Trump 2020 communications director Tim Murtaugh, senior adviser Katrina Pierson and rapid response director Andrew Clark all tweeted about the accusations against Biden, as did various other conservative figures and far-right activists. Despite the wealth of information on Ukraine, the Bidens, and Guiliani’s rabid pursuit of conspiracy theories related to them, Sondland supposedly missed this entire part of the Trump administration’s efforts. He even told Congress that although Giuliani directly mentioned Burisma to him in August, the company’s name didn’t stand out as worth noticing. His carefully worded statement also neglected to mention exactly when he finally did come to understand that Giuliani’s efforts in Ukraine included pushing for an investigation. If you believe his account, it’s a wonder he ever learned about it at all.",
      "date": "10/17/2019 06:05 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Senators Demand Answers On Decision To Hold G-7 Summit At Trump Doral",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DuQxp6tdEG4AawdsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559345/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fsenators-demand-answers-from-white-house-on-g7-summit-set-at-trump-doral_n_5da9ec2ce4b04c4d24ec0399/RK=2/RS=19MNGasYOyZODMG0QkhNGxHlx9c-",
      "subtitle": "Sens. Sherrod Brown, Ron Wyden and Gary Peters called the decision “another outrageous example” of presidential misconduct.",
      "author": "Sara Boboltz",
      "content": " A group of senators has demanded that President Donald Trump’s administration explain itself for allowing next year’s Group of Seven summit to be held at the president’s Miami golf resort ― a seemingly flagrant constitutional violation. In a letter dated Thursday, Sens. Sherrod Brown (D-Ohio), Ron Wyden (D-Ore.) and Gary Peters (D-Mich.) called the decision “another outrageous example of the President using his office to funnel money from American taxpayers and foreign sources into his own pockets.” The Constitution’s emoluments clauses forbid any president from profiting off his or her role in the Oval Office. Acting chief of staff Mick Mulvaney revealed Trump National Doral would host the next G-7 summit of top world leaders at an extraordinary press conference Thursday afternoon. “This was by far and away the best choice,” Mulvaney said, claiming that officials considered 12 potential sites before settling on Doral. He also claimed Trump would not profit from the decision to hold the global conference at his own commercial property. In their letter ― addressed to Mulvaney, acting Homeland Security Secretary Kevin McAleenan (who submitted his resignation last week), Treasury Secretary Steve Mnuchin and Secretary of State Mike Pompeo ― the senators demanded to know when Trump first suggested the summit be held at his Miami resort. He first made the suggestion publicly in late August. The senators are demanding to see a wide swath of documentation, including texts, emails and meeting notes, a list of precisely which other sites were considered and those properties’ bids, and projected costs of hosting the summit at Doral. Multiple past White House ethics chiefs ― along with Fox News legal analyst Andrew Napolitano ― have slammed the decision as a clear violation of the Constitution’s emoluments clauses. Other critics say Trump may have violated the constitutional ban on accepting outside payments on multiple occasions already, having made frequent visits to his golf properties in Virginia and Florida since his inauguration. The White House, for its part, says these visits are billed “at cost” so the Trump Organization derives no profit from taxpayer dollars. But the president sparked even more questions when Vice President Mike Pence stayed at Trump International in Doonbeg, Ireland, over the summer, even though his meetings with Irish leaders were on the other side of the country, in Dublin. Pence’s trip is currently under investigation by multiple congressional committees, who are also looking into the Air Force’s use of Trump Turnberry ― a golf resort located near an airport the military uses for refueling in Scotland.",
      "date": "10/18/2019 02:54 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "GOP Senators Shrug As Trump Plans To Host G-7 Summit At His Own Resort",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DuQxp6tdEG4AaQdsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559345/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2ftrump-g7-summit-republicans_n_5da8c1aae4b0b24e75df35d2/RK=2/RS=2oIEeFYZsJhKw6SXO2dWEnGoMJo-",
      "subtitle": "“I just think it’s another day in the life of Washington, D.C., these days,” Sen. Marco Rubio (R-Fla.) said.",
      "author": "Igor Bobic",
      "content": " WASHINGTON ― The announcement that next year’s Group of Seven summit for leaders of major industrial nations will be held at President Donald Trump’s golf resort in Miami was met with apathy from many members of his party on Capitol Hill on Thursday, even as Democrats and ethics watchdogs cried foul that holding the event at a business the president personally profits from would put him in direct violation of the Constitution. “Show me where there is a violation of law. I’m not sure that there is, not that I’m aware of,” Sen. Mike Rounds (R-S.D.) told reporters on Thursday. The emoluments clause of the U.S. Constitution prohibits federal government officials from accepting gifts from foreign states. Democrats have argued in court that the president is violating the emoluments clause by accepting payments from foreign and domestic parties through his businesses, like the Trump International Hotel in Washington, D.C. “It’s so brazen and craven that it’s virtually saying, ‘To heck with the rule of law,’” said Sen. Richard Blumenthal (D-Conn.). The senator said he planned to add the matter to his lawsuit against Trump focusing on his business deals and the emoluments clause. Acting White House chief of staff Mick Mulvaney told reporters during a press briefing on Thursday that the Trump National Doral is the “best place” to host the summit, dismissing concerns that the president would personally profit by doing so. “This was by far and away the best choice,” Mulvaney claimed, noting the administration considered other options for the event. But Blumenthal argued that the issue of whether Trump profits from the move or does not is irrelevant given that the emoluments clause does not specifically mention “profit,” and because of the president’s refusal to release his tax returns. “The question is not profit. It’s money and payments. And we’ll never know whether there is profit because it’s not a public corporation and he’s not releasing his tax returns,” he added. Few Republicans spoke out against the White House decision to host the G-7 at Trump Doral on Thursday. Sen. Lisa Murkowski (R-Alaska) said “no” when asked if she found it appropriate. Sen. Ron Johnson (R-Wis.) said the president’s resort was “probably not the best location” for the summit. Other Republicans downplayed the decision, however, putting faith in Trump even as the House moved forward with its impeachment inquiry. “It may seem careless politically, but on the other hand there’s tremendous integrity in his boldness and his transparency,” Sen. Kevin Cramer (R-N.D.) said of Trump, complaining that Democrats “make big deals out of nothing all the time.” “I would have a problem if they were paying double the going rate, if it was a one-star resort getting four-star rates or five-star rates,” Cramer added of the summit, which is typically financed with taxpayer dollars. Sen. Marco Rubio (R-Fla.), meanwhile, said he would be hard-pressed to oppose an event that would bring a substantial financial boon to residents of his home state of Florida, even as he allowed some might quibble with its legality. “Anything that draws a major event like that to Florida is not something I would discourage,” Rubio said of the G-7’s planned location in Miami. Asked whether Trump’s profiting from the G-7 would blunt the president’s attacks against former Vice President Joe Biden, who he has accused of enriching his family while in office, Rubio shrugged. “I don’t think it changes anything. I just think it’s another day in the life of Washington, D.C., these days,” he said.",
      "date": "10/17/2019 05:27 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Democrats Finally Prepare Subpoena For Trump’s D.C. Hotel Documents",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DuQxp6tdEG4AZwdsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559345/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fdonald-trump-hotel-subpoena_n_5da9bfd2e4b04c4d24eb4980/RK=2/RS=9z1chRx8wol1dRe68b385LKYPFc-",
      "subtitle": "The hotel occupies a federally owned building and has become a hot spot for lobbyists, foreign governments and others to put money in the president’s pocket.",
      "author": "Paul Blumenthal",
      "content": " House Democrats have threatened to subpoena the General Services Administration if the agency does not hand over records related to the approval of President Donald Trump’s Washington, D.C., hotel by next Wednesday. The House Transportation and Infrastructure Committee has repeatedly requested documents related to the GSA’s approval of the hotel, which occupies space in a federal building owned by the agency. The GSA has sent over some documents, but withheld others, including the legal memos and the hotel’s monthly profit reports and profit statements. Committee Chairman Peter DeFazio (D-Ore.) and Rep. Dina Titus (D-Nev.), chair of the subcommittee in charge of public buildings, requested those withheld documents be handed over by Oct. 23 in a letter sent to GSA Administrator Emily Murphy on Thursday. If the agency fails to produce those documents the committee will compel them by issuing a subpoena. The committee’s pursuit of these documents is part of its investigation into the president’s conflicts of interest, his potential violations of the Constitution’s emoluments clauses, which bar him from receiving payments or benefits from governments beyond his salary, and whether GSA followed proper procedures in approving the lease for the hotel. The Trump Organization was awarded a lease to build a luxury hotel inside the historic Old Post Office building on Pennsylvania Avenue in 2014. The Trump International Hotel opened in October 2016, just weeks before Trump would win the presidential election. His victory posed a sudden problem for the new hotel. The lease contained a clause forbidding any “elected official of the Government of the United States” to “be admitted to any share or part of this Lease, or to any benefit that may arise therefrom.” Additionally, the Constitution’s emoluments clauses forbid executive branch officers from receiving any payment or benefit from foreign governments and both federal and state governments aside from their salary. GSA lawyers could have investigated this issue during the 2016 election, but they didn’t. Instead, they waited until after Trump won the election to begin considering the problems posed by his continued ownership of the lease, according to an inspector general report. GSA lawyers then decided they would completely ignore the Constitution’s emoluments clauses in their review of legal problems posed by the president owning a federal lease. The hotel has since become a symbol of the Trump administration’s corruption. It has attracted lobbyists, foreign governments, corporate executives and Republican political campaigns to spend lavishly. And the president personally benefits from all payments to the hotel. Read the letter to the GSA below: This story has been updated with more background on the hotel.",
      "date": "10/18/2019 10:05 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Trump On Turkey And Kurds: ‘You Have To Let Them Fight Like 2 Kids’",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DuQxp6tdEG4AZQdsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559345/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2ftrump-turkey-kurds-let-kids-fight-dallas-rally_n_5da90201e4b0e0f037890e43/RK=2/RS=l7Rd.8zwy_hsHm2FQBHbdGUKc2E-",
      "subtitle": "At his campaign rally in Dallas, the president brought up Turkey’s agreement to temporarily pause its attacks on Kurdish-held northern Syria.",
      "author": "",
      "content": "DALLAS ― President Donald Trump said Thursday that he had to let Kurdish allies and Turkey “fight a little while” before the U.S. would be able to stop the Turkish attack on northern Syria that the president himself had enabled. “Sometimes you have to let them fight a little while, then people find out how tough the fighting is,” he told supporters at his campaign rally in Dallas. “Sometimes you have to let them fight like two kids in a lot, you gotta let them fight, and then you pull them apart.” Earlier Thursday, the White House said Turkey agreed to temporarily halt deadly military operations against northern Syria, a region that’s been held by Kurdish allies who had been fighting ISIS alongside the U.S. troops until Trump decided to abruptly withdraw earlier this month. The agreement gives the Kurds some time to give up their weapons and leave the region that Turkey has been trying to capture. It will allow Turkish forces to take over northern Syria. The deal worked “without spilling a drop of American blood,” Trump told supporters at the rally. The withdrawal decision led to Turkey attacking the Kurdish-held region with at least 180 airstrikes as of Thursday morning, killing at least 16 fighters, four civilians (including an infant), and injuring at least 70 more in border towns, according to The New York Times. Hundreds of thousands of Kurds have fled northeastern Syria since Trump’s announcement to withdraw the U.S. troops. The deal, which Turkey’s foreign minister clarified as a “pause” and not a ceasefire, creates a five-day halt in Turkey’s attack against the Kurds, whom the country considers terrorists. The deal came after Vice President Mike Pence and Secretary of State Mike Pompeo traveled to Turkey to prevent an escalation of the violence that Trump had effectively greenlighted. “During a five-day period, we’re going to see if we can get it all finalized, and I think it will be,” Trump said Thursday evening. “So Turkey’s going to be happy, the Kurds are going to be happy, ISIS is going to be unhappy.” Trump sympathized with Turkey at the campaign rally, calling the country’s President Recep Tayyip Erdogan a “gentleman” and saying that Turkey “was having a lot of bad things happen from this region, in all fairness.” The president has faced overwhelming backlash by both Democrats and Republicans for his decision to withdraw U.S. troops from the Kurdish-held region, basically allowing Turkish forces to invade while leaving the Kurds vulnerable. Many said the decision would likely lead to a resurgence of ISIS, made more likely after hundreds of ISIS supporters escaped detention in northern Syria as a result of Trump’s move. On Wednesday, Trump made a series of comments undermining the U.S. alliance with the Kurds, saying the fighters were “not angels” and the Turkish invasion “not our problem.” The Senate on Thursday introduced sanctions on Turkey, a more detailed and punitive measure than the sanctions Trump imposed earlier this week. The House voted overwhelmingly Wednesday to condemn Trump’s recent foreign policy decision in the Middle East. Trump has continued to defend his decision, saying this week that it was “strategically brilliant.” On Wednesday, after the House vote, the president berated House Speaker Nancy Pelosi in a meeting meant to be about Trump’s plan of action on Syria. Some supporters at the rally thought Trump made the right move in pulling the U.S. troops from the region, citing the need for the country to stay out of wars. “We need to get out of there. We’ve been having wars for no reason for pretty much my entire life,” 40-year-old Josh Warren of Garland, Texas, told HuffPost. “[President George W.] Bush put us in those wars. They were wars to fill his pockets. Bush wasn’t really for this country.” “I think he needs to bring our American troops home,” said Debbie Bewley. “I don’t think we need to be involved in useless wars.”",
      "date": "10/17/2019 11:09 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "John Kasich Supports Trump Impeachment: ‘I Say It With Great Sadness’",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DuQxp6tdEG4AYwdsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559345/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fkasich-trump-impeahcment_n_5daa0aace4b0422422c48c99/RK=2/RS=U0Ns7IRiuAKmXafUDKzTV_Wxulk-",
      "subtitle": "The Ohio Republican said acting White House chief of staff Mick Mulvaney’s admission of a quid pro quo on Thursday pushed him “across the Rubicon.”",
      "author": "Jenna Amatulli",
      "content": " Former Ohio Gov. John Kasich says he would support the impeachment of President Donald Trump if he were in the House of Representatives. The Republican told CNN’s Ana Cabrera on Friday that he was pushed over the edge by acting White House Chief of Staff Mick Mulvaney’s admission on Thursday that Trump’s pressure on Ukraine was part of a quid pro quo. “The issue of impeachment is really big to me. When I heard what Mulvaney said ... it pushed me across the Rubicon,” said Kasich, who has been an outspoken critic of Trump in the past. He went on to say that Trump abused his power by withholding vital military aid from Ukraine, a U.S. ally, and that he believes the president’s actions are grounds for impeachment. “I say it with great sadness. This is not something I really wanted to do,” Kasich said, before adding: “This behavior, in my opinion, cannot be tolerated and action is going to have to be taken.” Kasich, who ran for president in 2016, also said he’d vote yes on the inquiry without hesitation. “If you’re asking if I was sitting in the House of Representatives today and you asked me, ‘How do I feel? Should impeachment move forward and go for a full examination and trial in the United States Senate?’ My vote would be yes, and I don’t say it lightly,” he said. Nearly all House Democrats have voiced support for the impeachment inquiry, while many Republicans have defended Trump.",
      "date": "10/18/2019 04:26 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Behind Trump’s Texas Show Of Force, A Weakened President",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DuhGp6tdMBcANW1sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559367/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2ftrump-texas-rally-weakened-president_n_5da90b8ee4b0e0f037891867/RK=2/RS=bcKsINRGzTliYRUxic.mdYHBXjE-",
      "subtitle": "Thousands of cheering supporters greeted Trump in Dallas. But he shares the blame for the GOP’s weakening hold on the country’s largest red state.",
      "author": "Roque Planas",
      "content": " DALLAS ― President Donald Trump brushed off impeachment concerns, railed against Democrats and promised to deliver a resounding victory in the 2020 election at a rally here Thursday attended by thousands of cheering supporters. A sea of red hats and shirts calling for “liberal tears” and “Trump 2020: No more bullshit” flooded downtown Dallas ahead of the rally. Thousands of supporters came, with some arriving two days early. Volunteers collected signatures for a petition demanding an end to the impeachment inquiry in the House of Representatives. “They should stop the impeachment because the president is doing a great job,” said Alan Bewley, a Trump supporter who lives on a country road 90 minutes outside Dallas. In the speech, Trump hurled insults against leading liberal figures like House Speaker Nancy Pelosi (“crazy”), former Vice President Joe Biden (“sleepy”), former U.S. Rep. Beto O’Rourke of Texas (“very dumb”) and elected Democrats in general (“very sick”). Biden and O’Rourke are among Trump’s 2020 rivals. “They want to impose an extreme agenda,” Trump said of the Democrats. “They cannot pass it and they cannot win it at the ballot box. They won’t come close in 2020. They know it ― they’re not going to win it… It’s going to be a landslide.” But behind Trump’s show of force lies lackluster polling numbers, a weakening Republican Party and uncertainty about whether the president is more of an asset or a liability for the conservative control of the country’s largest red state. Dallas itself is a Democratic stronghold, so Trump’s visit offered a moment for the president to connect with supporters in the surrounding suburbs and rural areas, where he remains popular. But Democrats are gaining on Republicans across Texas. They sharply narrowed the statewide gap in last year’s midterm election, led by O’Rourke’s near-miss Senate campaign. Republicans’ margin of victory in that statewide race was not the double-digit thumping they’re used to here. Sen. Ted Cruz held on to his seat in a less-than-3-percentage-point squeaker, and the power of the far-right dwindled in the Statehouse. O’Rourke’s campaign hinged on the use of Trump as a foil. “Trump is without question the worst thing that has happened to the Texas Republican Party in the last 20 years,” Rice University political scientist Mark Jones said. “He single-handedly turned Texas from a red state to a pink state.” Some Texas Republicans have echoed that theory behind closed doors. “With all due respect to Trump, who I love, by the way, he’s killing us in the urban-suburban districts,” Texas House Speaker Dennis Bonnen said in a private meeting in June, according to secretly recorded audio released this week. “The only reason Donald Trump is in Texas tonight is that he knows he will lose the state and lose this election,” Texas Democratic Party Chairman Gilberto Hinojosa said in a statement. “Several polls show Trump losing Texas to top Democratic contenders. Donald Trump is terrified.” Trump carried Texas in 2016 by 9 percentage points. But 48% of Texas voters said they definitely wouldn’t vote for Trump in 2020, according to a Quinnipiac poll released last month, compared with 35% who said they’d definitely support him. Other surveys have shown leading Democrats within the margin of error in head-to-head matches with Trump. Texas leaders who joined Trump, however, offered full-throated support and cast aside concerns that the state could flip as an invention of the media. “If they take Texas, they will take the U.S. Senate. If they take Texas, they will take the White House. But we can’t let that happen ― not on our watch,” Sen. John Cornyn said at the rally. “We know the liberals who are running against President Trump want open borders, socialized medicine. They want to bankrupt Texas with the Green New Deal.” Texas Lt. Gov. Dan Patrick urged the crowd to boo O’Rourke repeatedly and excoriated the “progressive left” as “our enemy.” Patrick bragged that the president would draw more people to the portable toilets at his rally than O’Rourke would draw at the counter-rally in nearby Grand Prairie. Thursday’s rally marked Trump’s second major political event this year. He also held a major rally in El Paso back in February aimed at drumming up support for his proposed border wall and to take jabs at O’Rourke after his Senate run. He also visited in April for fundraising.",
      "date": "10/17/2019 10:25 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Twitter Critics Bash Mulvaney For Ordering Us Not To Believe Our Own Ears",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DuhGp6tdMBcAM21sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559367/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fmulvaney-quid-pro-quo-twitter_n_5da9174de4b0e0f037892898/RK=2/RS=g.K8f5Prsm8QHgXk4.PXQ5fWa50-",
      "subtitle": "Let’s go to the videotape.",
      "author": "Mary Papenfuss",
      "content": " Acting White House chief of staff Mick Mulvaney pulled an astounding about-face Thursday when he flatly denied he said what he’d said about a quid pro quo in President Donald Trump’s pressure on Ukraine to launch an investigation into his political rivals. But Mulvaney was captured on video — and critics on Twitter are going with what they actually heard him say. “I heard you say it loud and clear today. Real time. Out of your mouth,” one complained. Mulvaney explained at a press conference that the U.S. withheld nearly $400 million in military aid to Ukraine in part to pressure the nation to investigate Trump’s debunked conspiracy theory that Democrats manipulated the 2016 election. “That’s why we held up the money,” announced Mulvaney. ABC News reporter Jon Karl noted: “To be clear, what you just described is a quid pro quo.” Mulvaney responded: “We do that all the time with foreign policy.” He later added: “Get over it. There’s going to be political influence in foreign policy .... Elections have consequences.” Then Mulvaney insisted it had all been “misconstrued” by the media. Not so fast ...",
      "date": "10/17/2019 11:37 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "‘This Is Really Bad’: Rick Santorum Has An Ominous 2020 Warning For Trump",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DuhGp6tdMBcAMW1sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559367/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2frick-santorum-donald-trump-2020_n_5da94972e4b0e71d65b67f06/RK=2/RS=k97v8Hj6emH6_.swrVXVHtXLyTI-",
      "subtitle": "The president’s most loyal voters are turning on him, the former Pennsylvania senator says.",
      "author": "Ed Mazza",
      "content": " Former Sen. Rick Santorum (R-Pa.) warned President Donald Trump that he’s rapidly losing Republican voters and that could doom his 2020 reelection effort. The reason, Santorum said, was Trump’s decision to pull out of Syria, allowing Turkey to attack the Kurdish allies who helped U.S. troops in the fight against ISIS terrorists. “He has really stepped in it,” Santorum said on CNN on Thursday night. “This was a poor decision, this is having really startling ― even startling to him ― consequences.” Santorum called the Kurds “one of our closest allies” and slammed the president’s decision to withdraw as “reckless.” And, Santorum said he’s hardly alone among Republicans: This is really bad for the president come November of 2020 and I have been hearing from so many Republicans who love Donald Trump who are telling me for the first time they’re taking a step back and they’re actually thinking about whether they’re going to vote for this man. I’ve heard this from people I’m stunned to hear it from. Santorum also warned that this decision could hurt Trump with the voters that matter most to his reelection chances. “I think it’s gonna affect him with his base,” Santorum said. Hear more of Santorum’s thoughts below:",
      "date": "10/18/2019 03:38 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Jim Mattis Turns Trump’s ‘Overrated’ Insult Into An Oscar-Worthy Badge Of Honor",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DuhGp6tdMBcAL21sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559367/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fjim-mattis-meryl-streep-overrated-general_n_5da91963e4b04c4d24e9c0f6/RK=2/RS=.mTRRodbR98MsgGzbO4BWhic0T4-",
      "subtitle": "The former defense secretary unleashed a hilarious roast on the president at the annual Alfred Smith memorial dinner.",
      "author": "Josephine Harvey",
      "content": " Former Secretary of Defense Jim Mattis is honored to be considered overrated by his old boss. Mattis wisecracked his way through his speech at New York’s Alfred E. Smith memorial dinner Thursday night, capitalizing on the annual opportunity to banter about politics at the white-tie charity affair. In the wake of President Donald Trump’s remarks during an explosive meeting Wednesday with congressional leaders about the situation in Syria, in which Trump dubbed Mattis “the world’s most overrated general,” Mattis claimed the title with pride. “I’m not just an overrated general, I am the greatest, the world’s most, overrated,” Mattis quipped. “I’m honored to be considered that by Donald Trump, because he also called Meryl Streep an overrated actress. So I guess I’m the Meryl Streep of generals. And frankly, that sounds pretty good to me.” Mattis continued to unleash the one-liners throughout his speech, roasting the president again later, saying: “I earned my spurs on the battlefield; Donald Trump earned his spurs from the doctor” ― in a brazen reference to Trump’s deferral from service in the Vietnam War due to a medical disqualification for “bone spurs” in his feet. The president gave Mattis his new “overrated” title in response to a question from Senate Minority Leader Chuck Schumer (D-N.Y.), who read a quote from Mattis’ Sunday appearance on “Meet the Press,” warning that ISIS would resurge in the Middle East if the U.S. withdrew from northern Syria. According to two Democratic aides present at the meeting, the president cut Schumer’s question short, writing Mattis off as the “world’s most overrated general.” “You know why? He wasn’t tough enough,” Trump said, according to the aides. “I captured ISIS. Mattis said it would take two years. I captured them in one month.” Mattis, a retired Marine Corps general, was Trump’s first defense secretary. He resigned in 2018 because, he said, his views on policy did not align with those of the president. Trump called Oscar winner Streep one of the “most over-rated actresses in Hollywood” in 2017 after she criticized him during her speech after winning an award at the Golden Globes. “You do have to admit that, between me and Meryl, at least we’ve had some victories,” Mattis quipped Thursday.",
      "date": "10/17/2019 11:31 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "GOP Group Uses Trump’s Own Words On Corruption Against Him In Searing Fox News Ad",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DuhGp6tdMBcALW1sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559367/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2frepublicans-for-the-rule-of-law-trump-properties-ad_n_5da96ed3e4b0e0f0378998f3/RK=2/RS=Q1a.yVIKPVaRaoxOPGJFLLPIc20-",
      "subtitle": "Republicans for the Rule of Law released the commercial after the president decided to host the next G-7 summit at a Trump golf resort.",
      "author": "Lee Moran",
      "content": " President Donald Trump’s past comments about corruption are turned against him in a GOP organization’s new TV ad. The commercial, released online Thursday by Republicans for the Rule of Law in response to the controversial announcement that the next G-7 summit will be held at the president’s Miami golf resort, begins with footage of Trump attacking his Democratic rival Hillary Clinton during the 2016 campaign. It then cuts to examples of the ways Trump appears to have personally profited from his time in the White House. Check out the video here: “While candidate Trump was running for president he promised to drain the swamp and tackle corruption,” said Sarah Longwell, the executive director of Republicans for the Rule of Law. “Instead he is using the U.S. government and taxpayer money to enrich himself and his family,” Longwell added. “Holding the G-7 at a Trump property is inappropriate and Republicans should condemn the president’s continued efforts to use the office of the presidency for his personal enrichment.” The 67-second ad will air on Fox News in the Washington, D.C., area on Monday during the widely watched morning show “Fox & Friends.” It will also appear on the conservative network’s digital platforms. The group similarly flipped Vice President Mike Pence’s 2016 campaign assertion that “foreign governments cannot participate in the American political process” with the below spot earlier in the week. It will run in the home states of vulnerable Republicans.",
      "date": "10/18/2019 05:59 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Ex-Ethics Chiefs Rip Donald Trump’s Decision To Host G-7 At His Own Resort",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DuhGp6tdMBcAK21sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559367/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fethics-donald-trump-doral-richard-painter-walter-shaub_n_5da95c2ae4b0e0f037897645/RK=2/RS=uijB9rUR5caGVVz8QCPRYJA3usY-",
      "subtitle": "Walter Shaub and Richard Painter blasted the plans, calling them “unacceptable” and “the most overt corruption to date.”",
      "author": "Lee Moran",
      "content": " Two former government ethics experts have strongly condemned President Donald Trump’s decision to host the 2020 G-7 summit of world leaders at his own golf resort in Miami. Richard Painter, the former chief ethics attorney for President George W. Bush, described Thursday’s announcement by acting White House chief of staff Mick Mulvaney as “unacceptable.” Walter Shaub, the former head of the U.S. Office of Government Ethics, called it “the most overt corruption to date.” “This is not only self-dealing, this is a violation of the emoluments clause of the Constitution, which specifically provides that a person holding a position of trust with the U.S. government cannot accept any profits or benefits from foreign governments,” Painter told CNN’s Don Lemon on Thursday night. “We have had him violating the emoluments clause since day one and now he’s going out and openly asking foreign governments to subsidize his resorts in connection with the G-7,” Painter continued. “He’s got his hand out to foreign governments and if this Congress puts up with that, they are to blame as well.” Check out the clip here: Shaub, who served under President Barack Obama and resigned from his position six months into the Trump administration, vented his anger on Twitter via multiple posts. “How any Senator could fail to object to this is beyond me,” Shaub wrote in one tweet. “There’s no universe in which anyone could believe that, in a country as big as ours, the selection of Trump’s resort was anything but a product of the worst kind of corruption.” “This is so overtly corrupt that it can’t be viewed as anything but a loyalty test for Senators,” Shaub said in another. “If they are corrupt enough to look the other way, Trump will know he can do anything. In that case, he will do everything.” Shaub also said it was “a red line crossed” and that “we have reached the bottom.” “If the Senate will not act to stop this, there is no government ethics program,” he posted. “It’s over.” Read Shaub’s tweets in full below:",
      "date": "10/18/2019 03:32 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Some Kids Would Lose Free School Lunches Under Trump Proposal",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DuhGp6tdMBcAKW1sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559367/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2ftrump-free-school-lunch_n_5da9d599e4b04c4d24eba1cd/RK=2/RS=o7wVJHjeFHViQlTxU1V4EsLqY0w-",
      "subtitle": "One of Trump’s several behind-the-scenes food benefit cuts has a spillover effect on children.",
      "author": "Arthur Delaney",
      "content": " Nearly a million kids could lose automatic access to free school lunches thanks to a policy change the Donald Trump administration could finalize next year. The U.S. Department of Agriculture released the number this week after having initially said the rule change would affect far fewer children. In the past year, the administration has proposed a series of new regulations that would reduce enrollment and cut benefits in the Supplemental Nutrition Assistance Program. The proposed cuts are a core part of the administration’s anti-welfare agenda, which has hummed along in the background as the president’s scandals and corruption dominate headlines. One proposal would reduce states’ flexibility in setting eligibility standards, potentially trimming caseloads by 3 million, or about 9% of total projected enrollment in 2020. The National School Lunch Program serves more than 30 million kids, including 22 million who qualify for free or reduced-price meals if their parents have low incomes. A subset of those students are automatically certified for free meals if their parents receive SNAP benefits; it’s those kids who could lose automatic enrollment in free or discounted school lunches under the Trump proposal. The vast majority of students who would lose automatic certification would still be eligible for free or reduced meals, but they would have to apply instead of being automatically signed up when their school crosschecks federal SNAP enrollment data. The USDA said only 4% of the affected kids would lose eligibility for free or discounted lunch, but has acknowledged that some of those who are eligible will not go through the application process. Democrats are not impressed. “Even for those who remain eligible, forcing low-income families to navigate the burdensome paperwork will inevitably lead to eligible children losing access to a critical source of daily nutrition,” said Rep. Bobby Scott (D-Va.). When the Trump administration originally released the rule in July, USDA officials told reporters the proposal would affect 265,000 schoolchildren. This week, the USDA said in a regulatory filing that closer to 982,000 kids would be affected. “The analysis more than doubles the figures USDA first estimated, and now shows almost a million students will either lose their free school meals entirely, or have to jump through additional bureaucratic hoops to re-certify their eligibility,” Rep. Marcia Fudge (D-Ohio) said in a press release. At a hearing on Thursday, USDA official Brandon Lipps suggested that the administration had to cut benefits because too many undeserving people are gaming the system. “For far too long, negative press has weakened Americans’ confidence in important programs you have charged us with administering,” Lipps said, pointing to the tale of a millionaire who’d signed up for benefits in Minnesota just to make a point about lax eligibility standards. (The man qualified because he had no income.) Republicans themselves have made a strong effort to generate negative press about food benefits and to publicize the case of the wealthy retiree known as the “Minnesota Millionaire.” They invited him to a hearing in June, cited his story when they put out the regulation in July, and did so again this week. Republicans in the Minnesota legislature trumpeted his case in 2018. “Because one person scammed the system we’re supposed to punish hungry kids?” Fudge asked. “It is just ridiculous and I’m sick of hearing it.”",
      "date": "10/18/2019 01:38 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Mitch McConnell: Trump’s ‘Nightmare’ Syria Withdrawal Threatens To Bring Terror Home",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DuhGp6tdMBcAJ21sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559367/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fmitch-mcconnell-donald-trump-syria-turkey-isis-op-ed_n_5daa38a7e4b0f34e3a75a4de/RK=2/RS=_HUUw_fSCF1wqojRbkhtzcPa2zM-",
      "subtitle": "Pulling out of Syria is a “grave strategic mistake,” the Senate majority leader warned in an op-ed.",
      "author": "Mary Papenfuss",
      "content": " Senate Majority Leader Mitch McConnell (R-Ky.) lambasted President Donald Trump’s decision to pull U.S. troops from Syria in an op-ed Friday, calling the move a “grave strategic mistake” that threatens to bring “terror to our shores.” “The combination of a U.S. pullback and the escalating Turkish-Kurdish hostilities is creating a strategic nightmare for our country,” McConnell warned in The Washington Post. The events have “set back the United States’ campaign against the Islamic State and other terrorists. Unless halted, our retreat will invite the brutal Assad regime in Syria and its Iranian backers to expand their influence.” McConnell also noted that “we are ignoring Russia’s efforts to leverage its increasingly dominant position in Syria to amass power and influence throughout the Middle East and beyond. ... Predictably, our adversaries seem to be relishing these developments.” The Kentucky senator pointed to his experience working with three presidential administrations since the Sept. 11 terror attacks and learning that the threat from groups like the self-described Islamic State, also known as ISIS, “is real and cannot be wished away,” he warned. He pointed out that the U.S. is “not in this fight alone,” and has relied on local forces, including the Kurds, in the fight against ISIS. “Ironically, Syria had been a model for this increasingly successful approach,” McConnell noted. “We saw humanitarian disaster and a terrorist free-for-all after we abandoned Afghanistan in the 1990s, laying the groundwork for 9/11,” McConnell wrote. “We will see these things anew in Syria and Afghanistan if we abandon our partners and retreat from these conflicts before they are won.” Earlier this month, Trump agreed to cede the battlefield in northeast Syria to Turkey, which began attacking Kurdish residents of the region almost immediately. Read McConnell’s entire op-ed here.",
      "date": "10/18/2019 07:53 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    },
    {
      "title": "Rick Perry Won’t Comply With Subpoena In Impeachment Probe",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DuhGp6tdMBcAJW1sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559367/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2frick-perry-wont-comply-with-subpoena_n_5daa373ae4b08cfcc31b6d06/RK=2/RS=9PZXEDJLOy18BKHbEWn_hvQj6aU-",
      "subtitle": "The outgoing Energy Secretary insists the impeachment inquiry “lacks any legitimate constitutional foundation.”",
      "author": "Lydia O’Connor",
      "content": " An assistant to Rick Perry said Friday that the outgoing Energy Secretary won’t comply with a subpoena from the House of Representatives as part of its impeachment inquiry into President Donald Trump. In a letter to the three House Democrats who issued the subpoena last week, Assistant Secretary of Energy Melissa Burnison said the Energy Department is “unable to comply with your request for documents and communications at this time” and argued that items requested “are potentially protected by executive privilege” and thus require careful review before they can be shared. “Given that your inquiry lacks any legitimate constitutional foundation, any pretense of fairness, or even the most elementary due process protections, the Executive Branch cannot be expected to participate in it,” the letter said. The documents Perry is refusing to provide concern the issue at the heart of the House’s impeachment probe: the Trump administration’s communications with Ukraine, and Trump’s pressure on Ukrainian President Volodymyr Zelensky to investigate former Vice President Joe Biden, one of the president’s political rivals. The former Texas governor’s entanglements in Trump’s Ukraine scandal came to the surface earlier this month when sources familiar with the situation told Axios that during a recent conference call with House Republicans, Trump said Perry had arranged his July 25 call with Zelensky. Perry also told The Wall Street Journal this week that Trump directed him to communicate with his personal attorney Rudy Giuliani about alleged corruption in Ukraine, showing how closely Perry is connected to Trump’s dealings with the foreign power. Perry’s response to the subpoena comes a day after he announced his plans to resign by the end of the year, saying he wants to spend more time in Texas with family.",
      "date": "10/18/2019 07:39 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Right",
        "target_name": "Donald_Trump"
      }
    }
  ]
}