{
  "articles": [
    {
      "title": "How Elizabeth Warren Got A Big Progressive Endorsement — And Why It Matters",
      "url": "https://search.huffpost.com/click/_ylt=Awr9IkwVqatdaGEARSlsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559829/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fhow-elizabeth-warren-won-working-families-party-endorsement_n_5d83a6c7e4b0849d47255c16/RK=2/RS=CwsYFzWCcGYN4zxCMFIZPzqLGPA-",
      "subtitle": "“I really feel that Elizabeth Warren would have a better shot at unifying the left and the center,” said one Working Families Party leader.",
      "author": "Daniel Marans",
      "content": " Sen. Elizabeth Warren (D-Mass.) beat out Sen. Bernie Sanders (I-Vt.) for the endorsement of the Working Families Party, one of the country’s most influential progressive organizations. The decision came down to three main factors, according to six people who participated in the WFP’s endorsement process: her more aggressive outreach to key decision-makers, her strong commitment to racial and gender equity, and the perception that she has broader national appeal. Warren “has a long track record of working with our folks on issues from the foreclosure crisis to the sale of homes to Wall Street,” said Jonathan Westin, the executive director of the low-income activist group New York Communities for Change and one of two people who cast votes for Warren on behalf of the New York WFP state committee. “A lot of it stems from how she has run her campaign. From the beginning, she centered racial inequality in her campaign. She went to Jackson, Mississippi, and talked to these issues head on. It was not an addendum.” Since announcing its endorsement of Warren on Monday, the Working Families Party has been bombarded with complaints from Sanders supporters questioning whether the outcome of the vote reflected the views of WFP leaders — who they suspect put Warren over the top — or the group’s more numerous dues-paying members and supporters. The votes of the former were represented by 56 delegates on the WFP’s national committee, including Westin, and were weighted to make up half of the total endorsement vote. An estimated 10,000 of WFP’s dues-paying members and other progressive activists who participated in the online ballot made up the other half. HuffPost spoke with Westin and five other WFP state and regional leaders whose votes in state-level plebiscites determined the way their national committee delegates voted. The goal of HuffPost’s inquiry was not to assess the fairness of WFP’s endorsement process, but to get a sense of why many delegates chose Warren. In addition to Westin, HuffPost spoke with Andrea Serrano, executive director of the Albuquerque, New Mexico, nonprofit Olé; Stephanie Zucker, a WFP activist from near Morgantown, West Virginia; and three other New Yorkers: education activist Billy Easton, organized labor official Sandra Cuellar Oxford and fair housing advocate David Schwartz. Easton, Oxford and Schwartz cast votes that bound New York’s delegates to Warren; Zucker and her fellow West Virginia WFP committee members voted to have their national delegates endorse Warren as well. Serrano would not say how the New Mexico WFP affiliate voted, but described what people who participated in the process found attractive in Warren’s candidacy. As with the four other candidates the WFP considered endorsing, Sanders sat for a public, live-streamed endorsement interview, where he was questioned by WFP national organizing director Nelini Stamp and WFP activists. But Sanders did not participate in a later video conference call with WFP national delegates and members of the WFP’s state committees. On that call, presidential candidates could make their case for an endorsement directly to the people with a say in the matter. Warren and former Secretary of Housing and Urban Development Julián Castro availed themselves of the opportunity; Sanders did not. “It was an opportunity for Bernie and his people to make their pitch. It’s a lost opportunity,” said Oxford, a WFP leader in upstate New York. Sanders’ absence did not sway Oxford per se, who cited other reasons for her vote for Warren. But for other WFP leaders, it reflected Warren’s greater affinity for the political art of courting allies, an activity that critics and supporters alike say Sanders has been less invested in over the course of his career. “This is the thing about Warren, you see it in her selfie lines: She’ll put in all of the work to try and connect with a voter, to try and secure an endorsement ― like she was trying to do in the WFP process ― and to make her case,” said Westin, who voted for Sanders in the WFP’s endorsement process for the 2016 election cycle. “And I think it’s actually a quality that we need in terms of somebody who is going to beat Trump.” Prior to the endorsement process, Warren had likewise exhibited a knack for politicking that was unmatched by Sanders. A week before the WFP revealed the results of its endorsement process, she endorsed Kendra Brooks, a WFP candidate for one of two at-large Philadelphia city council seats that are effectively reserved for non-Democrats, and currently occupied by Republicans. Warren also endorsed Stephen Smith, the WFP-backed progressive running for the Democratic gubernatorial nomination in West Virginia. Sanders, whose political director Analilia Mejia previously ran the New Jersey Working Families Party, could have one-upped Warren by endorsing both Brooks and Nicolas O’Rourke, the second WFP candidate for Philadelphia city council. Instead, he endorsed neither of them. “Supporting progressive Black and other women of color for office is always a positive thing,” Serrano said. The Sanders campaign did not immediately provide an explanation for Sanders’ decisions not to participate in the video conference call, or endorse in the Philadelphia city council races. Sanders has worked hard to dispel the perception, formed during his 2016 presidential run, that he is insufficiently committed to addressing injustices like racism and sexism on their own terms, rather than strictly as manifestations of economic inequality. He hired a more diverse contingent of senior campaign staff; featured race more prominently in his stump speech; took pains to court influential Black leaders in early primary states like South Carolina; and produced, among other things, a far-reaching criminal justice reform platform that seeks to redress racist practices. But several of the WFP leaders who spoke to HuffPost still consider Warren to be more genuinely committed to combating racial inequity, in particular, as a form of injustice that must be addressed independent of structural economic problems. Warren’s remarks in Detroit in July about countering the effects of historic housing discrimination in Black neighborhoods stood out to Easton, who runs the Alliance for Quality Education in Albany, New York, and considers racial justice the most important issue in the race. “I haven’t seen a white candidate for major office be crystal clear and direct and so effective, breaking down the concept in a way people can understand,” he said. Serrano argued that, by contrast, Sanders’ attempts to broaden his message outward from the economy had been inadequate. “It is not OK to separate class from race and gender … People have tried to say, ‘Do better on this subject,’ and it just doesn’t seem to last,” she said. Conversely, some of the WFP stakeholders cited Warren’s identification as a capitalist seeking to put a check on the economic system’s most oppressive features, rather than replace it, as both more in line with their own thinking, and evidence of her broader national appeal. Zucker, who is a part owner of her family’s veterinary hospital, described Warren’s vision as “capitalism with a conscience” and said she shares that view. “I’m fully in support of [Sanders’] policies in the vast majority of areas. But I think Elizabeth Warren is doing a better job of communicating what I believe is their shared vision of a just economy.” Others spoke more generally about what they see as Warren’s success expanding beyond a core group of left-wing supporters. “I really feel that Elizabeth Warren would have a better shot at unifying the left and the center. We can’t just think we’re going to go as far left as we can and bring the center along with us,” Oxford said. “I feel that Elizabeth has been somewhat more conciliatory and offered a larger tent to those who definitely won’t vote for Bernie.” Sanders supporters point to polling that has shown higher levels of support for Sanders than Warren among working-class voters and, until recently, Black voters, as evidence that he is better equipped to build a winning, national coalition. But Warren’s supporters in the WFP believe that her base of support will continue to diversify as more Americans pay attention to the primary race. “My membership is low-income people of color and my membership absolutely loves Elizabeth Warren,” Westin said. “[Former vice president] Joe Biden and Bernie have been big names for years. People are just tuning into the race.” Given the complexity of the WFP’s endorsement process, it is not surprising that it has generated some skepticism. Sanders partisans — acting with some encouragement from the Sanders campaign — have urged the WFP to release a breakdown of the vote that would show whether Warren won the endorsement thanks to the national delegates or had enough support to win among the dues-paying members and associated activists who voted. “Why don’t they want to release it?” wrote Matt Bruenig, a founder of the People’s Policy Project, a left-wing think tank. “You hate to speculate about such things, but the only answer is because the member votes went for Sanders while the leadership votes went for Warren, and the organization is embarrassed to reveal the degree to which the leadership overruled the membership.” The WFP says it is refusing to release the figures because to do so would create an artificial division in the status of different voters, when all of the votes cast are equally legitimate. In some cases, the distinctions might be hazy anyway. Schwartz, Zucker and Easton all voted in the online general membership ballot in addition to casting their state committee votes. More broadly, the WFP defends its practice of granting its most committed activists and partner organizations an outsize say in its endorsement, particularly given the grassroots constituencies they each represent. By contrast, an assortment of sympathetic progressives who were not previously involved in WFP were free to participate in the larger membership vote if they affirmed the WFP’s values through the completion of an online form by Sept. 6. Some Sanders supporters mobilized people to participate on Reddit. And the Progressive Change Campaign Committee leveraged its considerable email list to encourage its activists to cast votes for Warren. The WFP also noted that in the 2016 endorsement process, the votes of national delegates were weighted to make up 87.5% of the total vote share ― far more than in the 2020 endorsement process. Those national delegates represented a group of WFP stakeholders that was less diverse and more conservative, including a number of labor unions that departed the organization in 2018 in protest of its endorsement of Cynthia Nixon’s candidacy for New York governor. The WFP only ended up endorsing Sanders in the 2016 election cycle, over many of those stakeholders’ protestations, because 87% of the dues-paying members and other activists — who got the remaining one-eighth of the vote not held by national leaders — backed Sanders. Part of Bruenig’s argument for the WFP to release the breakdown of its vote, is precisely that the organization released a breakdown of Sanders’ share of the non-leadership vote when it announced its endorsement in Dec. 2015. But the WFP released the figure in the 2016 election cycle as a show of force for Sanders amid deep skepticism from within the WFP’s national stakeholders. The fury expressed by many Sanders supporters toward the WFP endorsement reflects the realization of socialists who got involved in politics thanks to Sanders’ 2016 campaign that they are not as closely aligned with the national WFP as they previously thought. In New York City in particular, members of the Democratic Socialists of America have worked closely with the WFP. New York City DSA, which endorsed Nixon at the WFP’s urging over the objections of many of its members, provided an essential army of door knockers for her ultimately unsuccessful campaign. But while there is considerable overlap, DSA members are more uniformly socialist in their political outlook than the average WFP activist. Sanders, a self-described democratic socialist, is the most conservative presidential contender for whom they are willing to consider mobilizing their membership to support. For example, Sanders has been far more consistent and emphatic than Warren in his support for “Medicare for All,” which is perhaps the single highest policy priority of DSA members. “The split is between people who came into politics long before 2016 and have been doing progressive politics as a profession for a long time, and the movement that was sparked by the Sanders campaign,” said Michael Kinnucan, a member of the NYC DSA. “His campaign got thousands of people involved in American politics at the rank-and-file level, in DSA and elsewhere, and that movement has begun to reshape American politics. Those folks do feel betrayed that the power and potential of that movement is not recognized by some people in the Working Families Party.”",
      "date": "09/19/2019 02:36 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Elizabeth Warren Had Another Solid Debate. Does That Matter?",
      "url": "https://search.huffpost.com/click/_ylt=Awr9IkwVqatdaGEAQylsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559829/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fthird-democratic-debate-poll-huffpost-yougov_n_5d828e3ce4b070d468c64d3e/RK=2/RS=u71C_g2ADnVXPku1069Cok.PAIE-",
      "subtitle": "Joe Biden still leads in the polls, and last week’s debate doesn’t look like a game-changer. But new surveys offer other good news for Warren.",
      "author": "Ariel Edwards-Levy",
      "content": " For the third time in a row, Massachusetts Sen. Elizabeth Warren pulled off a well-received debate performance, new polling finds. More broadly, the state of the 2020 campaign appears to remain much where it’s stood since August: Former Vice President Joe Biden continues to lead in the horse race polls, trailed by Warren and Vermont Sen. Bernie Sanders. A few other metrics suggest Warren may be positioned for further growth. And most primary voters remain very far from locked into a decision, meaning there’s plenty of room for things to change. Thirty-seven percent of Democratic and Democratic-leaning voters who saw at least clips of the debate last Thursday said they came away with an improved view of Warren, according to a new HuffPost/YouGov survey, while just 9% said their opinions of her worsened. That’s not as dramatic as her reception in the first and second debates, when half or more reported improved views, but it’s still enough to place her ahead of her rivals this round. Three other candidates also saw their positive ratings for the debates significantly outstrip their negatives: South Bend, Indiana, Mayor Pete Buttigieg (31% had an improved view of him compared to 11% whose view worsened); former Texas Rep. Beto O’Rourke (30% improved to 13% worsened) and New Jersey Sen. Cory Booker (26% improved to 11% worsened). Former Housing and Urban Development Secretary Julián Castro ― who aggressively challenged Biden onstage ― saw the worst numbers (15% improved compared to 41% worsened), with the remaining candidates breaking more or less close to even. The standard provisos about debate polling remain relevant here: Voters’ preexisting opinions of the candidates help to shape their reactions; opinions remain fluid; and, of course, impressing voters in a debate doesn’t necessarily translate into gaining even temporary ground in the horse race. Plenty of voters, as FiveThirtyEight notes, didn’t even watch the debate. In the HuffPost/YouGov survey, only about 55% of Democratic and Democratic-leaning voters said they caught even clips of the event. Perhaps the clearest example of the debates affecting this race so far has been California Sen. Kamala Harris’ brief surge following a strong initial performance, and her subsequent fall from the top tier of polling when she failed to match it in subsequent debates. By contrast, Sanders’ poll numbers have remained basically stable since summer, while Warren’s rise has appeared gradual and largely untethered to any specific incident. “We’re practically raised to believe that debates impact election results in big ways. Millions watch, candidates spend countless hours preparing, media can’t stop talking, and writing, about them. And, after all, we’re taught debates are the way we should be making voting decisions. They’ve just got to be game-changers,” Democratic pollster Mark Mellman wrote. “But they’re not ... Voters in the early states will get lots more direct exposure to the candidates through other mechanisms.” To examine the broader state of the race beyond debate night, the new HuffPost/YouGov poll also asked voters to look over the full slate of Democratic candidates and pick whom they’d be enthusiastic or upset to see nominated, and who they believe is capable of defeating President Donald Trump. Biden still holds a clear, if not overwhelming, lead on electability: A 66% majority of Democratic and Democratic-leaning voters thinks the former vice president is capable of winning the general election, a recovery of nearly 10 points since this summer. A smaller 56% majority currently believes Warren can win, with half saying the same of Sanders. Fewer than one-third say the same of any of the other candidates. Warren, meanwhile, stands out on enthusiasm, with 48% saying they’d be enthusiastic about having her as the Democratic nominee and only 9% saying they’re upset by that prospect. The idea of a Biden nomination raises only slightly less excitement (41% would be enthusiastic) but higher discontent (25% would be upset); a hypothetical Sanders nomination leaves 39% enthusiastic and 17% upset. Although Warren has often looked particularly strong in YouGov’s polling compared to other outlets, other recent polling shows similar results. FiveThirtyEight/Ipsos debate polling also gives Warren strong reviews for last week’s debate. And in an NBC/Wall Street Journal poll released this week, Warren led both on enthusiasm and as the candidate with whom most primary voters would feel, at least, comfortable. Nearly all national polling that asks a straightforward horse race question ― whom people would vote for if the election were today ― shows Biden still ahead. But there’s a significant variation on the exact size of Biden’s lead, as well as whether Warren or Sanders now stands as his closest rival. One reason for that volatility is that the race remains exceptionally fluid. In the HuffPost/YouGov survey, only 52% of Democratic and Democratic-leaning voters say they have even a good idea about whom they’ll support, and in the NBC/Wall Street Journal poll, only 9% of Democratic primary voters said they’d definitely made up their minds. There’s still months until anyone starts voting, and things could change pretty quickly once they do. For now, “undecided” may still be the real front-runner. Use this widget to further explore the results of the HuffPost/YouGov survey, using the menu at the top to select survey questions and the buttons at the bottom to filter the data by subgroups. The HuffPost/YouGov poll consisted of 1,000 completed interviews conducted Sept. 14-15 among U.S. adults, using a sample selected from YouGov’s opt-in online panel to match the demographics and other characteristics of the adult U.S. population. HuffPost has teamed up with YouGov to conduct daily opinion polls. You can learn more about this project and take part in YouGov’s nationally representative opinion polling. More details on the polls’ methodology are available here. Most surveys report a margin of error that represents some but not all potential survey errors. YouGov’s reports include a model-based margin of error, which rests on a specific set of statistical assumptions about the selected sample rather than the standard methodology for random probability sampling. If these assumptions are wrong, the model-based margin of error may also be inaccurate. Click here for a more detailed explanation of the model-based margin of error.",
      "date": "09/18/2019 05:48 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Bernie World Is Starting To Go After Elizabeth Warren",
      "url": "https://search.huffpost.com/click/_ylt=Awr9IkwVqatdaGEAQSlsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559829/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fbernie-sanders-campaign-elizabeth-warren-progressive_n_5d8bcfdce4b0019647a279bb/RK=2/RS=HgXqMRPti9izIf9CbzcZVbPKIEU-",
      "subtitle": "Bernie Sanders supporters are questioning Warren’s progressive bona fides — and for the first time, the campaign is going along with it.",
      "author": "Daniel Marans",
      "content": " As Sunday turned to Monday, Briahna Gray, national press secretary for Sen. Bernie Sanders’ presidential campaign, posted a series of criticisms of Sen. Elizabeth Warren (D-Mass.) on Twitter. Gray began with subtlety, highlighting a speech the Vermont senator gave on the House floor in the 1990s in support of gay military veterans and service members. And, in what appeared to be a subtweet at Warren, she noted that Sanders delivered the speech at a time when “your fave was still ‘evolving’ (read ‘triangulating’) on gay rights.” (In a follow-up conversation, Gray would not say to whom she was referring when she said “fave.” Warren supported same-sex marriage during her first Senate run in 2012, prior to former President Barack Obama’s “evolution.”) Next, Gray noted that under Sanders’ pro-union legislation, Warren’s campaign would be forced into mediation for failing to reach a collective bargaining agreement so many months after recognizing its campaign staff’s union. Finally, in a post shortly after midnight, Gray slammed Warren’s refusal to endorse a national rent control law, echoing a critique voiced earlier in the weekend by left-wing activists. She suggested that it contradicted Warren’s self-described can-do attitude toward other ambitious policies. Gray’s comments in themselves were not out of the ordinary. Sanders campaign aides are notoriously feisty and independent on social media ― a marked contrast with the boringly disciplined etiquette of other campaigns’ staffers. But when HuffPost reached out on Monday to clarify whether Gray’s remarks were part of a shift toward more explicit confrontation with Warren, the campaign directed HuffPost to Gray, who stood by her remarks. “Primary campaigns are about drawing contrasts between candidates so that voters can make an informed choice between them,” Gray said in a statement. Sanders and Warren reportedly struck a non-aggression pact in December prior to launching their respective campaigns. The much-vaunted détente survived two nationally televised debates in which the two contenders shared a stage. They eschewed the moderators’ efforts to drive a wedge between them in favor of teaming up against moderate rivals. Even in the course of a conversation about this article, the Sanders campaign wanted to emphasize his high regard for Warren. “Sen. Sanders respects Sen. Warren and values his friendship with her,” Mike Casca, a senior communications adviser for the Sanders campaign, said in a statement. “They’ve been longtime allies in fighting to improve the lives of working Americans.” But though Sanders himself has yet to criticize Warren, his aides and surrogates have been taking gradually bolder shots at the Massachusetts senator. The non-aggression pact is fraying. Gray’s remarks follow more implicit steps in this direction by other Sanders lieutenants. Amid left-wing uproar over the Working Families Party’s endorsement of Warren, top Sanders spokesman Mike Casca gave his blessing to calls for the WFP to release a breakdown of its endorsement vote that would show whether the group’s national delegates overrode the will of pro-Sanders dues-paying members and activists. The following day, when Sanders received his millionth donor, Sanders campaign manager Faiz Shakir noted that Sanders is the only candidate to rule out high-dollar private fundraisers for the primary as well as the general election. The observation was a veiled ding at Warren, who has said that in the interest of defeating President Donald Trump, she would resume courting wealthy donors during the general election. Just a few weeks ago, HuffPost reported that the Sanders campaign saw supporters of former Vice President Joe Biden as riper targets for persuasion. The campaign had a custom-made text message response for Biden backers, but only a generic one for voters leaning toward other candidates. But Warren’s rise, reflected in everything from the WFP endorsement to new polling showing her winning more of Sanders’ 2016 voters than Sanders himself, has raised the specter of her supplanting Sanders as the go-to progressive alternative to Biden. The campaign aides’ jabs at Warren, however tame and haphazard, provide an official imprimatur to a broader argument that Sanders surrogates and partisans have been making more openly for some time: that Warren’s progressive bona fides are questionable and that she is a flawed general election candidate. Below is a summary and explanation of their various claims against her. The Warren campaign declined to comment for this story. The most recent pile-on against Warren kicked into gear over the weekend when she addressed the Iowa Center for Community Improvement Action Fund’s candidate forum in Des Moines, Iowa. An activist pressed Warren on whether she would back national rent control legislation, which would cap annual rent increases across the country. Warren said that she would fight to ensure that localities are free from state laws that prevent them from pursuing rent control on their own, but would not back a national rent control law. “Writing a rent control plan in Washington may work for Chicago, but it’s not gonna work for Iowa City or it may not work for Dallas,” she said. Warren introduced an affordable housing bill in March that would allot $10 billion in grants that cities and regions could compete for, provided that they end restrictive land-use policies. It would also give cities that enact tenant protections like rent control opportunities for additional cash. “My administration will also take whatever legal steps it can to stop states from preempting local efforts to enact tenant protection laws,” she wrote in a Medium post outlining her housing plans. Warren would also invest $500 billion in building or restoring affordable housing ― a figure she pays for by restoring the estate tax to its 2009 level. And she wants to create a home-buying assistance program for first-time buyers in historically redlined neighborhoods to narrow the Black-white wealth gap. Sanders, by contrast, would cap all annual rent increases at the higher of either 3% or 1.5 times the rate of inflation. Cities would be able to go further and landlords could apply for exemptions from the rule if they make major capital investments in a property. For some left-wing activists, particularly those living in expensive cities, making rent control “universal” ― or at least expanding it ― has become a priority nearly as urgent as achieving single-payer health care. Rep. Alexandria Ocasio-Cortez of New York, who volunteered for Sanders in 2016, introduced a rent control bill on Wednesday that also caps rent hikes at 3%. As a result, a video of Warren’s exchange with the activist in Iowa posted by California-based labor organizer Brett Banditelli sparked biting criticism of Warren on social media. For example, Cea Weaver, who helped pass New York state’s new rent regulations, suggested that Warren’s lack of interest in national rent control reflected an elitist reliance on economic orthodoxy. Gray, the Sanders campaign aide, embedded Banditelli’s video in her critical tweet as well. “Bernie says yes to [national] rent control [because] we can, we should, & we must,” she wrote. Analilia Mejia, the Sanders campaign’s political director, also highlighted the contrast between the two candidates’ platforms on Twitter. “There just isn’t a comparison,” she wrote. Beginning with the first Democratic presidential debate in June, Warren has repeatedly affirmed her support for Sanders’ single-payer “Medicare for All” health care legislation. When pressed about the bill’s prohibition on all but very limited forms of private health insurance ― a provision that has stirred the most political jitters ― Warren has endorsed it time and again. Two presidential rivals, Sens. Kamala Harris of California and Cory Booker of New Jersey, have, by comparison, backed away from Sanders’ bill despite co-sponsoring it in the Senate. But some Sanders partisans note that Warren, a recent convert to the Medicare for All cause, still has not made it a major feature of her stump speech. She barely mentions the policy unless she is asked about it, and she has refused to explicitly say she would back middle-class taxes to pay for it. That has raised fears that Warren would not fight for it once in office, which Medicare for All proponents consider a prerequisite for its eventual passage. “She’s simultaneously trying to tap into the activist energy and enthusiasm that activists have spent years building for single-payer and Medicare for All … without forfeiting any of the plausible deniability or the support of people who wouldn’t want to go that far,” Natalie Shure, a member of the Boston chapter of the Democratic Socialists of America, told HuffPost. During a campaign event Wednesday in New Hampshire, Warren sparked a new round of skepticism when she described Sanders’ “Medicare for All” legislation, which she has co-sponsored, as a “framework.” “What we’ve got in Medicare for All is a framework, and it doesn’t have the details, and you’re right to be asking, but the most important part of your asking is to raise awareness so we get this right as we go through it,” Warren said. The remark prompted a swipe from Sanders’ senior adviser Warren Gunnels, who disputed Warren’s word choice on Twitter. Medicare for All “isn’t a framework. It’s a 100-page bill,” he wrote. Bernie World skepticism of Warren’s support for Medicare for All is rooted in a broader suspicion of her more recent arrival at stances Sanders has held for decades. They argue that she is less trustworthy in general because she has admitted to being a registered Republican until the mid-1990s. (Her research into the struggles of families declaring bankruptcy prompted her to leave the GOP, according to Warren.) Susan Sarandon, an Oscar-winning actor and prominent Sanders campaign surrogate, caused a stir in August when she took a veiled swipe at Warren while introducing Sanders at a campaign event in Iowa. Sanders, she said, “is not someone who used to be a Republican. He is not someone who used to take money — or still takes money — from Wall Street. He is the real deal.” Sarandon’s remarks about taking money from Wall Street might refer to Warren’s courtship of wealthy donors, including some from the financial world, during her 2018 Senate reelection campaign. She transferred over $10 million left over from that campaign to her presidential run before announcing that she would shun the fundraisers during the Democratic primary. (Warren’s campaign has noted that big-ticket fundraisers accounted for only one-quarter of her total haul in 2017 and 2018.) John Cusack, another actor backing Sanders, introduced him at a rally on Tuesday in Chicago with members of several of the city’s public-sector labor unions. He has echoed Sarandon’s attacks on Warren’s Republican past. “No ones [sic] been more consistent then [sic] Bernie for justice,” he tweeted on Monday night. “Warren was a republican as an adult -  glad she figured out supply side economics was a hustle - but come on.” In addition to their policy and ideology-based arguments that Warren is not radical enough, prominent Sanders supporters are also claiming that she is less competitive against Trump in a general election. The argument is twofold: First, they point to Warren’s style on the stump and lower rates of support among Democrats without a college degree as evidence that she would have difficulty in a general election. Sanders had a narrow edge among voters with less than a college degree in an August poll conducted by the Pew Research Center, while Warren had a commanding lead over him among voters with advanced degrees. (Biden held the lead for voters at every education level except those with advanced degrees.) Krystal Ball, a co-host of Hill TV’s digital show “Rising,” made the case on Monday that Warren’s appeal is stronger among more educated and successful Democrats because her focus on “plans” appeals to their meritocratic faith in common-sense problem-solving. Warren’s failure to resonate with working-class voters despondent in the country’s institutions make Ball “terrified” that Warren will lose to Trump, the pro-Sanders commentator said. “‘I’ve got a plan for that’ is like a magical elixir to” highly educated Democrats, Ball said. “It says, ‘The experts have been consulted, the white paper has been drafted. We the ascenders of the meritocracy will decide what is to be done about these poor, struggling denizens of the working class.’” Ball’s characterization of Warren is not entirely accurate. She regularly denounces the political and economic system for being “rigged” in favor of the super-rich, and has lionized grassroots movements like the one that emerged from the tragic fire at the Triangle Shirtwaist Factory in 1911 as models for the kind of structural change she hopes to usher in. And some analysts have noted that newcomers tend to fare worse among working-class voters at the start of primary contests, because those voters follow the news less consistently. When those candidates go on to win their party’s presidential nomination and the general election though, working-class voters have tended to come along. Former President Barack Obama, for example, trailed Hillary Clinton with white working-class voters for much of the primary, but thanks to a populist message, ultimately won enough of their votes to prevail twice in states like Ohio. The second line of attack that Sanders supporters raise against Warren is their objection to her past identification as a Native American in various informal legal settings. Warren has apologized for producing a DNA test in October that showed she likely had traces of Cherokee heritage. She has also affirmed that she is not a person of color. But for some Sanders supporters, who appear to consider the dustup an electoral liability, Warren’s apology is not enough. In a Twitter thread earlier this month, Josh Fox, an anti-fracking activist and filmmaker backing Sanders, said Warren’s identification as Native American “when she was actually a descendent of colonialists is a huge self-inflicted mistake.” Fox went on to incorrectly assert that Warren had not even apologized. (In fact, she has apologized for the DNA test, as well as identifying as Native American in various professional legal listings.) “Why isn’t owning a mistake like this possible? I think it would make her more sympathetic and more human to be honest,” he wrote. “If she just said- ‘hey I was wrong about this, and I am being bullied by Donald Trump and etc.’” This piece has been updated with more information about Warren’s proposed affordable housing bill.",
      "date": "09/26/2019 05:45 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "CNBC Host Says Wall Street Is Scared Of Elizabeth Warren And She Approves",
      "url": "https://search.huffpost.com/click/_ylt=Awr9IkwVqatdaGEAPylsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559829/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2felizabeth-warren-cnbc-wall-street_n_5d782e96e4b094928f07a61f/RK=2/RS=IoukxhjTK.ly7D0Z6d.PeX44ihY-",
      "subtitle": "The presidential candidate retweeted a video featuring “Mad Money” host Jim Cramer explaining how bankers fear her.",
      "author": "David Moye",
      "content": " Typically, presidential candidates only “approve” the messages in their own campaign ads, but Elizabeth Warren is different. On Tuesday, the Massachusetts senator was happy to tweet her support of a CNBC segment that was highly critical of her. In the segment, “Mad Money” host Jim Cramer said that Wall Street executives are terrified of Warren and say her White House bid has “got to be stopped.” Considering that Warren wants to raise taxes on the wealthy ― including, presumedly, Wall Street executives ― at least one Twitter user felt the CNBC segment was “the greatest Warren campaign ad possible.” Warren immediately capitalized on it: The reaction on Twitter suggests she may be on to something.",
      "date": "09/10/2019 08:33 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Elizabeth Warren Raises $24.6 Million In 3rd Quarter, Trailing Only Sanders",
      "url": "https://search.huffpost.com/click/_ylt=Awr9IkwVqatdaGEAOylsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559829/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2felizabeth-warren-raises-24-6-million-in-third-quarter-trailing-only-sanders_n_5d9746cfe4b0da7f662578df/RK=2/RS=R2LDU_R9AhSTikKmlyyQvnWQXfs-",
      "subtitle": "The Massachusetts senator’s presidential campaign now has $25.7 million on hand.",
      "author": "Kevin Robillard",
      "content": " Massachusetts Sen. Elizabeth Warren raised $24.6 million in the third quarter, her campaign told supporters in an email Friday, and now has $25.7 million to spend as the 2020 Democratic race enters its final stretch before primary season. The haul is second only to fellow progressive Sen. Bernie Sanders (I-Vt.) among contenders for the Democratic presidential nomination. Sanders raised $25.3 million from July to September, while former Vice President Joe Biden raised just $15.2 million. South Bend, Indiana, Mayor Pete Buttigieg, who trails the other top fundraisers by significant margins in public polling, raised just over $19 million. “This means our grassroots movement is in an incredible position — to double down on our investments in grassroots organizing, to keep getting Elizabeth’s plans for big, structural change in front of more caucus-goers and voters, and to bring more people into this fight,” campaign manager Roger Lau wrote. It is all but certain that Warren and Sanders ― two left-leaning progressives who have chosen to bypass high-dollar fundraisers during the campaign ― will be the two candidates with the most successful third quarters. Warren, in particular, faced skepticism over her decision to bypass high-dollar fundraising ― an area where she had excelled prior to the 2020 presidential race. “Elizabeth didn’t sell her time to wealthy donors, over the phone or in person at closed-door fundraisers,” Lau wrote. “Instead, she got to spend her time traveling across the country, hosting town halls, taking tens of thousands of selfies, and hearing directly from people about what’s on their minds.” Warren, whose steady rise now has her essentially tied with Biden in most public polling, had 943,000 donations from 509,000 different individual donors. The average donation was $26, and the campaign said more than 300,000 people donated for the first time during the third quarter. Among lower-tier candidates, California Sen. Kamala Harris raised $11.6 million, Andrew Yang raised $10 million and New Jersey Sen. Cory Booker raised $6 million. Other candidates, including former Texas Rep. Beto O’Rourke, have not yet released their fundraising totals. President Donald Trump’s reelection campaign said that it and the Republican National Committee ― which can collect much bigger checks than the individual Democratic contenders ― raised more than $125 million in the third quarter.",
      "date": "10/04/2019 10:52 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Elizabeth Warren Reveals ‘The Most Fun’ Part Of Campaigning Against Donald Trump",
      "url": "https://search.huffpost.com/click/_ylt=Awr9IkwVqatdaGEAOSlsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559829/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2felizabeth-warren-most-fun-part-2020-campaign_n_5d81ed63e4b0849d4720a0cb/RK=2/RS=nTqkEu_5GtiPpQy0efbhJ2I35oY-",
      "subtitle": "The Democratic candidate also explained why Trump “is truly a terrible president. Not just bad, terrible.”",
      "author": "Lee Moran",
      "content": " Democratic presidential candidate Sen. Elizabeth Warren (D-Mass.) on Tuesday explained why spending hours posing for selfies with supporters after rallies is one of the perks of her 2020 campaign. Some 20,000 people packed New York’s Washington Square Park for Warren’s rally on Monday. Afterward, she attended to a four-hour selfie line. “You know, the selfies are the most fun about this,” Warren told “The Late Show” host Stephen Colbert. “And it truly is the case, because it means you get the person to person about this.” “It means for every single person who stays in that line, and look, somebody waited four hours, the guy at the end,” she continued. “But it’s about power and saying, ‘I get it, we got a Washington that’s working great for the rich and the powerful, not working for much of anyone else, you came in here, you talked about how it’s broken, you talked about how to fix it, and people who say I can do a piece of that, I’m in this fight all the way and I got a selfie to prove it.’ So that’s where we are. And it’s fun.” Check out the interview here: Colbert later asked Warren if her assertion at the rally — that “we can’t choose a candidate we don’t believe in just because we’re too scared to do anything else” — was a “veiled shot” at her 2020 rival, former Vice President Joe Biden. “No, the way I see this, these really are scary times,” Warren responded. “It’s scary times because Donald Trump is truly a terrible president. Not just bad, terrible.”",
      "date": "09/18/2019 05:13 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Elizabeth Warren’s Plan For ‘Big Structural Change’ Threatens Joe Biden’s Delaware",
      "url": "https://search.huffpost.com/click/_ylt=Awr9IkwVqatdaGEANylsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559829/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fjoe-biden-elizabeth-warren-debate-delaware_n_5d76b4d7e4b07521023140e6/RK=2/RS=_9ItlLkIe1rGwdLs3eKIB0VI9Wk-",
      "subtitle": "For 36 years, the former senator defended his home state’s pro-corporate policies, which Democratic rivals now want to end.",
      "author": "",
      "content": "On Thursday night, Joe Biden and Elizabeth Warren will share a presidential debate stage for the first time in a hotly anticipated showdown between the establishment Democratic front-runner and one of his fiercest progressive challengers. Biden and Warren’s core disagreement centers on how hard the next president should push to fundamentally restructure the American economy. Warren has called for “big structural change”; Biden promises a return to normalcy. To really understand this schism, you must consider the 36 years that then-Sen. Biden spent defending the uniquely pro-corporate laws of his home state, Delaware — laws that protect America’s biggest companies from taxes, lawsuits and accountability; fuel economic inequality; and prioritize the interests of shareholders over those of consumers, debtors and workers. The system Biden protected affects every American: Because so many companies are registered there, Delaware is effectively the principal author and enforcer of much of the nation’s corporate law. The state boasts more corporate registrations than human residents, including two-thirds of Fortune 500 companies. Delaware is corporate America’s home base. Like Sen. Bernie Sanders’ attacks on the “rigged economy,” Warren’s calls for change represent a direct challenge to Delaware’s special status. By taking on three key policies that have made Delaware into the corporate paradise it is today, the Massachusetts senator is calling much of Biden’s record into question. Warren’s first and biggest target is the notion of shareholder primacy: the idea that corporate managers’ most important legal duty is to maximize shareholders’ wealth. That means the interests of workers, families, local communities and the environment are of secondary importance to executives and board members. “That is in part a function of Delaware corporate law,” said Kent Greenfield, a corporate and constitutional law professor at Boston College. Under Delaware law — which covers all those companies registered in the state ― shareholders must come first. In effect, Delaware corporate law encourages companies to undercut employee pay and ship jobs overseas in order to enrich shareholders. And it locks out other stakeholders, like workers and consumers, from being considered in the corporate decision-making process. Between 2007 and 2016, Warren noted last year, “large American companies dedicated 93% of their earnings to shareholders.” This has other real-world consequences. When President Donald Trump pushed a massive corporate tax cut through Congress in 2017, for example, much of that money was returned to shareholders, rather than workers or other stakeholders. As vice president, Biden criticized shareholder primacy, saying in 2016 that corporations should “embrace your obligation to workers as well as your shareholders.” But it’s the competition between states to develop the most business-friendly corporate charters ― the competition that Delaware won ― that effectively ensures shareholder primacy across the nation. And the last time Congress moved to end that competition in the 1970s, Sen. Biden swooped in to defend Delaware’s position. In the wake of a succession of corporate scandals and bankruptcies, the Senate held a series of hearings to examine whether the federal government, instead of the states, should issue corporate charters for large companies. These hearings were anathema to Delaware’s politicians and business community. The state was then, as now, the national leader in corporate registrations. Fees from business registrations were, and still are, a major source of funding for the state government. (Today, they account for more than one-quarter of the state’s income.) Federalizing corporate charters would also cut profits for the state’s lawyers, accountants and corporate registration companies. As Congress mulled a possible change, Biden appeared before two different committees to vouch for prominent Delaware lawyers who were there to argue against nationalizing corporate charters and for preserving Delaware’s special position. At one hearing, he suggested that senators not attending should “take the time” to review the lawyers’ testimony “before they make final decisions.” Before another hearing, he praised the witness: “His judgment on these matters is also pretty sharp.” Biden and Delaware won: Congress never moved to have the federal government take over issuing big corporate charters. The hearings fizzled out after Ronald Reagan took the White House and Republicans won the Senate in 1980. Now progressives like Sanders and Warren are trying again. In 2018, Warren introduced legislation to federalize the top tier of corporate charters and thereby take away Delaware’s special place as the national writer of corporate law. Warren’s bill would require corporations with more than $1 billion in annual revenue to obtain a federal corporate charter that would require them to consider the needs of a broader array of stakeholders — employees, local communities, suppliers, the environment — when making decisions rather than solely focusing on the concerns of shareholders. “The role that Delaware plays in determining our system of corporate governance is also, in that sense, going to be in play in the coming campaign,” said Robert Hockett, a Cornell Law School professor who advises Warren, Sanders and Rep. Alexandria Ocasio-Cortez (D-N.Y.). The second aspect of the Delaware system that Sanders and Warren have taken aim at is its credit card industry, which Biden boosted by making it harder for Americans to discharge credit card debt in bankruptcy. In 1981, Delaware state lawmakers, at the behest of Republican Gov. Pete du Pont, passed a sweeping financial deregulation bill designed to attract banks to the state. The bill, written by lobbyists for Chase Manhattan Bank and J.P. Morgan (then two separate companies), eliminated the state’s interest rate caps and gave special tax treatment to financial institutions. Months after the legislation passed, MBNA Corporation, one of the largest credit card issuers in the country, relocated from Maryland to Delaware. In the decades that followed, Biden and the rest of Delaware’s congressional delegation worked hard to protect MBNA and the other financial institutions that flocked to their state. One big problem for credit card issuers was federal bankruptcy law. As the credit card industry exploded in the 1980s and 1990s, an increasing number of Americans filed for personal bankruptcy protection ― a legal process that allows individuals to prioritize what debts they can pay off and start anew with less debt than before. Creditors, including the credit card industry, banks and retailers, argued that people were taking advantage of the process to discharge debt they could otherwise pay. These businesses wanted the debts owed to them to be higher priority and harder to discharge. On the other side were academics led by Warren, then a Harvard Law School professor. Warren’s research found that people filing for personal bankruptcy were generally dealing with a stroke of bad luck. They had a major medical expense, a messy divorce or a lost job. (Some of this research was — and remains — controversial.) And women made up a major proportion of those declaring bankruptcy. Warren argued that the system was a last-ditch safety net for hardworking people. In the late 1990s, the credit card industry funded a massive lobbying campaign to pass federal legislation to make it harder to discharge credit card debt in personal bankruptcy. They hired President Bill Clinton’s former Treasury secretary, Lloyd Bentsen, and funded multiple questionable studies to back up their argument that fraud was causing the spike in bankruptcies. At the same time, Congress created a National Bankruptcy Review Commission to study the problem. The commission, which Warren served as reporter and senior adviser, mainly sided with the academics against the credit card industry. But the industry’s lobbying campaign won out. The first legislation to change the bankruptcy process in favor of creditors was pushed through the House in 1997. It went through four separate iterations before ultimately becoming law in 2005. Republicans generally backed the bills while the majority of Democrats opposed them. That first bill passed the Senate too and almost became law ― until Biden reportedly threatened to filibuster the measure because the House had made it too friendly to creditors in conference committee. Nonetheless, he had initially voted for that bill, and afterward, he took the reins as the main Democratic voice in favor of rewriting bankruptcy law. News reports at the time referred to Biden as “the linchpin to passage,” “the only Democratic true believer” and “possibly the bankruptcy bill’s staunchest defender.” In 2000, President Clinton pocket-vetoed another version of the bill on the advice of first lady Hillary Clinton, whom Warren had convinced to oppose the measure. A Democratic amendment that would have prevented abortion opponents from using bankruptcy to discharge legal debt stemming from their participation in violent protests killed the 2001 bill. Finally, with a bigger Republican majority in 2005, Congress passed a bill that was signed into law by President George W. Bush. Biden was one of a minority of Senate Democrats who voted for the legislation all four times. Today, Biden claims that his support was part of an effort to improve legislation that was ultimately going to pass with or without him. As the ranking Democrat on the Senate Judiciary Committee in 2005, he saw it as his job to work with Republicans and Democrats to solve the issue of rising personal bankruptcies. Through his actions, he helped to protect lower-income debtors, prioritize alimony and child support payments, and increase credit card disclosure, according to the Biden campaign. The former vice president has “championed the middle class for his entire career and has a proven track record of delivering on his progressive values,” said Mike Gwin, a Biden campaign spokesman. But though he showed some distaste for creditors’ goals, Biden believed the bill was necessary and tried time and time again to pass it. He shoehorned the measure into a foreign affairs bill to get it before the Senate Foreign Relations Committee, where he was ranking member, in 2000. He cast the deciding and only Democratic vote in a 10-8 split supporting the bill in the Senate Judiciary Committee in 2001. “I am so sick of this self-righteous sheen put on anybody who wants to tighten up bankruptcy [who] is [painted as] really anti-debtor,” Biden said at a 2001 hearing. “People are getting hurt.” Over the years, he voted against numerous consumer-friendly amendments offered by his Democratic colleagues that would have eased the bill’s new requirements for consumers filing bankruptcy over medical debts or debts incurred while on active-duty military service. He opposed other amendments that would have put caps on credit card interest rates and penalized mortgage lenders if they had broken the Truth in Lending Act when they extended credit. “Some of these looked like they were sympathetic to people with real issues, but they were not good public policy solutions,” a former Biden Senate aide said. Through the many iterations of the bankruptcy bill, Warren emerged as its fiercest outside opponent. And she directly took on Biden. The year after the 2001 bill failed, Warren wrote a 39-page article in the Harvard Women’s Law Journal arguing that politicians like Biden should be forced to pay a political price for supporting economic legislation that hurts women. Biden’s assertion that he made the bill prioritize women was misleading, Warren argued. Biden said he moved alimony and child support up the list of priorities for payment when a person entered personal bankruptcy. Child support services professionals backed his proposal, arguing that it would “revolutionize the enforcement of support obligations against debtors in bankruptcy.” But Warren wrote that this move was simply a sleight-of-hand, pushing alimony and child support payments above priorities that only came into play in business-related bankruptcies. The practical effects of the proposed change, she wrote, “would be either nonexistent or detrimental.” More to the point, the latest bill’s restrictions on personal bankruptcy would fall hardest on women because it was women who made up the majority of bankruptcy filings, Warren argued. “For a million women who will go to the bankruptcy courts each year, there is no more important pending federal legislation,” she wrote. Major women’s rights organizations, including the NOW Legal Defense and Education Fund, the National Partnership for Women and Families, and the National Women’s Law Center, opposed the bill for the same reason. Warren and Biden finally came face to face at a Senate hearing on bankruptcy in 2005. In a now-famous exchange, he back-handedly complimented her for making “a very compelling and mildly demagogic argument.” He suggested she was targeting the wrong credit card problem by opposing the bankruptcy bill. “Your problem with credit card companies is usury rates from your position,” Biden said. “It is not about the bankruptcy bill.” “But, Senator, if you are not going to fix that problem, you can’t take away the last shred of protection from these families,” Warren replied. “I got it, OK. You are very good, Professor,” Biden said to laughs from Warren and the audience. The 2005 law did reduce the personal bankruptcy filing rate. But studies indicate the law made it harder for the country to rebound from the 2008 financial crisis, led to 250,000 additional home foreclosures and drove a 25% increase in persistent insolvency. The pro-creditor status quo might not last forever — especially if Sanders or Warren wins the presidential election and the Democrats retake control of the Senate. The Sanders campaign announced on Sept. 5 that it would introduce a proposal to roll back parts of the 2005 law to help those with heavy medical debts. The Warren campaign has yet to release any bankruptcy-related reforms. The third pillar of the Delaware system that Sanders and Warren have challenged are the laws that make it a favorite place for companies to file for bankruptcy. Biden, again, has been on the other side. In the early 2000s, Enron, an energy services firm, collapsed amid a massive corruption scandal. John Cornyn, then attorney general of Texas, pushed the company to file for bankruptcy in Houston, where it was based and where it employed 7,500 people. Instead, Enron filed for bankruptcy in Manhattan, where one of its subsidiaries was incorporated and it employed 57 people. This was possible because U.S. law allows corporations to file in any state in which they or their subsidiaries are incorporated. In other words, companies can venue or forum shop, effectively choosing the jurisdiction most favorable to their interests in bankruptcy. And there are two favorite venues: Delaware and New York. The Los Angeles Dodgers filed for bankruptcy in Delaware. General Motors, famously of Detroit, filed for bankruptcy in Manhattan. There is a longstanding debate in the world of corporate bankruptcy law about whether venue shopping is a problem. Some contend it makes sense to let companies go to Manhattan and Delaware where the judges have greater experience in handling large, complicated bankruptcies. But others, like Warren, argue that venue shopping allows corporations to pick their judges while creating steep burdens for employees, pensioners and other small creditors to attend out-of-town proceedings and pay the higher legal fees charged in both Delaware and Manhattan. That’s what Enron’s employees argued. And it was why now-Sen. Cornyn, with Warren’s help, authored an amendment to the 2005 bankruptcy reform bill to ban venue shopping. At that same committee hearing, he asked her to explain her concerns about the practice. “In the case of large corporations that can leave their home venue ― Enron, who can leave Houston, Texas, where its employees, where its pensioners, where its trade creditors reside ― and escape the obligation to make the process open to the thousands of people who are directly affected by the bankruptcy, that affects the bankruptcy system overall,” Warren said. “A fair bankruptcy system is one that retains access for the employees, for the pensioners, for the small creditors, and that means those cases need to stay home, not go to a distant location where they [the corporations] think they may get a better deal.” Warren’s comment ― that corporations could “escape the obligation to make the process open” ― angered Biden. “I find it outrageous such a statement,” Biden said before asking Warren if she thought Delaware courts weren’t open. Delaware’s dominance in corporate bankruptcy cases is a side effect of its dominance in corporate charter registration. It’s also a huge cash cow for local businesses from law firms to hotels to restaurants. But to critics like Warren, it makes it easier for the little people to get screwed. “Employees of companies like Enron literally cannot go to Delaware and hire local counsel, which the Delaware bankruptcy court requires them [to do] before they can make an appearance, and that effectively cuts thousands of small employees, pensioners and local trade creditors out of the bankruptcy process,” Warren tried to explain to Biden. “If they can’t afford it, they are not there.” Before moving on, Biden declared that Cornyn’s amendment was going nowhere. Biden and his fellow Delaware senator, Tom Carper, threatened to withhold their votes from the bankruptcy bill if the venue shopping amendment was attached. Cornyn withdrew it under pressure from Republican leadership in order to placate the two Democrats. That wasn’t the first time Biden had quashed an effort to stop venue shopping in corporate bankruptcy. “Most of these proposals were to remove an industry Delaware had built up and to get a piece of the action for themselves,” the former Biden Senate aide said. “As long as Senator Joseph Biden of Delaware is in the Senate,” any possibility of venue shopping reform is “nonexistent,” Brady Williamson, the National Bankruptcy Review Commission’s chairman, observed in 2006. When Warren won election to the Senate in 2012, she joined Cornyn as the Democratic co-sponsor on legislation to ban venue shopping. But the bill hasn’t moved in the Senate even though Biden is gone. Delaware’s current Democratic senators ― Carper and Chris Coons ― have taken his place as its biggest opponents. “It’s another one of these ‘what’s good for Delaware and to hell with the nation,’” said Adam Levitin, a bankruptcy law professor at Georgetown University Law Center. It’s no big surprise when senators promote their home state’s business interests. “I take it very personally when my colleague or a colleague in the Senate decides to take an action that would benefit his state only marginally but would do great damage to my state,” Biden said in 2004. “I take that very personally.” Biden’s competitors for the Democratic presidential nomination have done it too. Sanders has supported stationing F-35 jets in Vermont, bringing jobs and dollars to his state. Warren and Sen. Amy Klobuchar (Minn.), whose states are both home to big medical device manufacturers, endorsed a bill to repeal the medical device tax included in the Affordable Care Act. And Sen. Cory Booker (N.J.), whose state is home to numerous pharmaceutical companies, voted against a proposal to lower drug prices. What has made Biden’s parochialism so significant is that his state’s special interests are central to the structure of the U.S. — and global — economy. By putting his state first, Biden helped to build and protect the economic structure that Warren and Sanders blame for a wide range of Americans’ troubles. That is what the coming debates will be about. CORRECTION: An earlier version of this story stated incorrectly that Biden voted against a 2005 amendment to bar wealthy bankruptcy filers from hiding assets in special asset protection trusts. He voted for it.",
      "date": "09/11/2019 11:00 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Top Progressive Group Endorses Elizabeth Warren For President",
      "url": "https://search.huffpost.com/click/_ylt=Awr9IkwVqatdaGEANSlsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559829/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fworking-families-party-endorses-elizabeth-warren-2020-democratic-presidential-primary_n_5d7fa657e4b03b5fc8873fce/RK=2/RS=pPDmI0haj2AAhEcH6ZuRut9seuU-",
      "subtitle": "The Working Families Party endorsed Sen. Bernie Sanders (I-Vt.) in the 2016 election cycle.",
      "author": "Daniel Marans",
      "content": " The Working Families Party, a leading progressive organization with roots in organized labor, announced Monday that it is endorsing the presidential bid of Sen. Elizabeth Warren of Massachusetts. The group’s backing provides a boost to Warren as she seeks to solidify her climb in the polls and replace Sen. Bernie Sanders, a Vermont independent, as the leading alternative on the left to former Vice President Joe Biden. “Senator Warren strikes fear into the hearts of the robber barons who rigged the system, and offers hope to millions of working people who have been shut out of our democracy and economy,” Maurice Mitchell, Working Families Party national director, said in a statement. “Our job now is to help Senator Warren build the mass movement that will make her transformational plans a reality.” As part of the group’s endorsement process, Mitchell grilled five presidential candidates ― Warren, Sanders, Sen. Cory Booker of New Jersey, former Housing Secretary Julián Castro and New York Mayor Bill de Blasio ― on live broadcasts that gave members the opportunity to submit questions or ask them live. Warren distinguished herself in her interview by, among other things, promising to repeal the 1994 crime bill authored by Biden. The group’s interview with Booker proved more contentious, with an extended discussion of his ties to controversial Garden State political bosses. Sen. Kamala Harris of California canceled her interview with the organization, citing a scheduling conflict, a decision that prompted the group to take her out of the running. The group had ruled out all but those six candidates based on their answers to a questionnaire. The endorsement, reflecting the views of 61% of Working Families Party members and leaders in a ranked-choice voting system, is a particularly sharp disappointment for Sanders, who picked up the group’s backing in the 2016 election cycle, but received just 36% of the vote from participating members this time around. The Sanders campaign’s political director, Analilia Mejia, is the former executive director of the New Jersey Working Families Party. Mitchell acknowledged Sanders’ role as a progressive trailblazer in his statement on the endorsement. “Senator Warren and Senator Sanders have both shaped the ideological terrain on which this campaign is being waged,” Mitchell said. “They have proven an effective team on debate stages and in the polls, and we hope that partnership continues. We’re proud to call both of them allies in the fight for a more just America.” The endorsement nonetheless drew skepticism from Sanders supporters, some of whom questioned the legitimacy of the endorsement process and talked of canceling their dues to the organization. Some Sanders supporters interpreted a Mitchell quote in The New York Times in which he warned against progressives who hoped to defeat moderate Democrats with “thought pieces or pithy tweets” as a dig at them. Mitchell denied that was his intention in an interview with HuffPost. “I was talking about the work all of us have to do to defeat the far right and the corporate forces who want to capture the Democratic nomination ― all those forces. We need to organize against them,” Mitchell said. ”I wouldn’t take this occasion to choose to settle a score against a candidate who I think is amazing and doing great work.” Mitchell acknowledged, however, that the endorsement causes pain to many Working Families Party members who are staunchly in Sanders’ corner and raises the challenge of moving forward as a unified bloc. “We knew that this would be a hard vote and that there would be folks who would be very disappointed. And that’s what happens when mature political organizations wrestle around really important decisions,” Mitchell said. ”We’re going to continue to organize and keep our eyes on the prize.” Mitchell and the Working Families Party also stand behind the fairness of the endorsement process. In the previous presidential election cycle, members of the group’s national committee ― the council of unions and grassroots groups that function as its key stakeholders ― held the vast majority of votes in the endorsement process. This year, activists who are not on the national committee ― both dues-paying members and supporters who do not pay dues ― were allotted half of the votes. The roughly 50 activist leaders representing grassroots organizations on WFP’s national committee had votes worth the other half of the total. And while activists who do not pay dues were permitted to cast ballots in the 2016 election cycle, Working Families Party claims it took specific steps to screen them this year, including through an email blast that required progressives to affirm their support for the group’s agenda and proceed through an online portal for voting. In total, about 10,000 people cast ballots, according to the group. The Working Families Party has neither demographic data about the participants in its endorsement process, nor insight into the rationale of activists who opted for Warren over Sanders. It likewise declined to provide a breakdown of votes for either candidate based on whether participants were activist leaders with privileged voting status, dues-paying members or mere sympathetic supporters. Mitchell said that, on a personal note, he appreciates Warren’s ability to communicate progressive ideas to a diverse array of people. “We need a candidate that can break down these concepts in ways that encourage a multiracial alignment of folks to defeat Trump and defeat neo-fascism and I think she’s uniquely positioned to do that,” he said. Warren’s endorsement last Monday of Kendra Brooks, a WFP candidate running for Philadelphia city council, swayed some members of WFP’s leadership with privileged voting status, according to a progressive strategist familiar with these leaders’ thinking. The Working Families Party was founded in 1998 by a coalition of New York labor unions and community organizations hoping to establish a progressive foothold within the Democratic Party-run politics of the Empire State. In New York, where the group retains its largest presence, progressive Democrats have the chance to run on its ballot line as well as that of the Democratic Party as a show of strength from the party’s progressive wing. As Working Families Party has matured, it has gotten bolder in its political stances and more distant from its roots in New York’s labor unions. A decision by the group to endorse Cynthia Nixon’s challenge to New York Gov. Andrew Cuomo in the 2018 Democratic primary at once prompted an exodus of nearly all of the labor unions backing the organization and freed it to chart a more independent path. Although New York remains its hub, the Working Families Party now has state-level affiliates in 13 other states and the District of Columbia, as well as local branches in four others. States with affiliates include the general-election battlegrounds of Pennsylvania and Wisconsin. The Working Families Party, which often sets up PACs to boost candidates it endorses in state and local elections, has yet to spell out exactly how it will use its resources to buttress Warren’s 2020 bid. Mitchell, who is African American and previously served as a leader of the Black Lives Matter movement, said that the group is well equipped to organize working-class voters and voters of color ― some of the very people polls suggest Warren has had difficulty attracting. Referring to these voting blocs, Mitchell said, “There are a number of communities that often do not get heard and get taken for granted, unfortunately by a lot of Democrats. It’s going to be our interest to lift them up.” The endorsement from a powerhouse of New York politics comes ahead of a rally Warren is holding in Manhattan’s Washington Square Park on Monday evening. The Warren campaign chose the site for its proximity to the Triangle Shirtwaist Factory, a sweatshop where a fire in 1911 killed 145 garment workers. Warren plans to discuss the resonance that the tragedy, which became a rallying cry for labor organizing in the city and across the country, has for her campaign and the movement she is trying to build. This article has been updated to include comments from Maurice Mitchell and details about the Working Families Party’s voting process.",
      "date": "09/16/2019 12:08 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Elizabeth Warren Ramps Up Campaign With 8-Figure Ad Buy",
      "url": "https://search.huffpost.com/click/_ylt=Awr4xJMtqatdfAgAsTVsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559853/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2felizabeth-warren-strategy_n_5d8a2672e4b0c2a85cb1a24c/RK=2/RS=b.dIXjeOpxtU3ckjfImawh5TaK4-",
      "subtitle": "The 2020 Democratic candidate also is hiring more organizers in states that vote in March, including on the all-important Super Tuesday.",
      "author": "",
      "content": "Massachusetts Sen. Elizabeth Warren’s presidential campaign is set to begin a major advertising blitz, spending at least $10 million in the first four states to vote in the 2020 Democratic primary. The campaign also plans to begin hiring staff in primary states that vote in March, including on all-important Super Tuesday. Building operations in the March states is crucial ― three-fifths of the Democratic delegates will be awarded by the end of 2020’s third month. The new spending, announced in a memo to supporters from campaign manager Roger Lau, shows how Warren plans to continue the momentum that’s elevated her into the top tier of primary contenders, alongside Vermont Sen. Bernie Sanders and former Vice President Joe Biden. The size of the advertising buy also highlights how Warren has been able to continue raising gobs of cash after deciding to stop attending high-dollar fundraising. “Our biggest expense as a campaign is our staff, but as the campaign heats up, it will be on media to reach potential voters,” Lau wrote in his email. “Because we’re 100% grassroots funded, we’ve built our team to spend your dollars as effectively as possible to help deliver victory.” Lau said the ad buy will mostly be on digital platforms rather than traditional broadcast television, and the campaign will produce the ads in-house rather than using a traditional media consultant. “Take any of our big problems: Health care, climate change, gun violence. Corruption is at the root of why our government won’t act,” Warren says in a 15-second ad as President Donald Trump and former House Speaker Paul Ryan appear onscreen. “I’m Elizabeth Warren. I know what’s wrong, I know how to fix it and I’ll fight to get it done.” The Warren campaign also released a 60-second ad highlighting her roots in Oklahoma and the hollowing out of the American middle class, and a 30-second ad highlighting her work to create the Consumer Financial Protection Bureau and defeat former GOP Sen. Scott Brown. “Leave it to a liberal professor to highlight a speech she gave at a liberal university in the heart of liberal New York City,” Republican National Committee Communications Director Michael Ahrens said, referring to the 60-second ad that uses footage from her Sept. 17 rally. “Warren may have plans, but they would decimate millions of middle class jobs and eliminate health plans for 200 million Americans.” Lau provided fewer details on the campaign’s staffing plans in the March states, but highlights Illinois, California, Maine, Michigan, Minnesota, Texas and Florida as places where it will make investments. “We’re targeting our resources to invest in places that will be critical to keeping the House, taking back the U.S. Senate, and regaining ground in key state legislatures in 2020,” he wrote. Warren has been steadily rising in the polls and attracting massive crowds to her rallies. She’s eschewed exclusive fundraisers with wealthy donors generally favored by presidential candidates as a way to amass campaign cash, instead relying on grassroots outreach ― more than 1 million donations from all 50 states, D.C., and Puerto Rico. Warren has become known for her personal outreach to supporters. She calls donors out of the blue to thank them for their contribution, and stays for hours after campaign events to take selfies with people. Lau estimates that she has done more than 60,000 selfies and taken more than 600 unfiltered questions at 134 town halls in 27 states and Puerto Rico. This story has been updated with comment from the RNC.",
      "date": "09/24/2019 11:00 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "The Attack On Elizabeth Warren That Could Actually Matter",
      "url": "https://search.huffpost.com/click/_ylt=Awr4xJMtqatdfAgArzVsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559853/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2felizabeth-warren-health-care-2020-democrats_n_5d856183e4b0957256b703de/RK=2/RS=jQzgmqw_eAJcdxTOWXcYCJ2Zc9A-",
      "subtitle": "Warren is facing criticism from the left and center on voters’ No. 1 issue: health care.",
      "author": "",
      "content": "The attempt to pile on Elizabeth Warren has begun. The senator from Massachusetts, who has firmly joined Sen. Bernie Sanders (I-Vt.) and former Vice President Joe Biden in the Democratic presidential field’s top tier, has faced a barrage of critiques in recent days from campaigns who often claim she has received a free pass from the media. Many of these attacks happen without ever mentioning Warren’s name. Candidates ― including Biden, Sen. Cory Booker of New Jersey and Mayor Pete Buttigieg of South Bend, Indiana ― often talk about how Democrats need to have more than Warren’s signature policy plans in order to win. A staffer for Sen. Kamala Harris (D-Calif.) suggested Warren hadn’t done enough to help Democratic candidates in the 2018 midterms. (She donated $11 million to other candidates and progressive causes.) Others have been more direct: The always-colorful, oft-quoted former Pennsylvania Gov. Ed Rendell, a Biden surrogate, attacked Warren as a “hypocrite” for touting her decision not to hold high-dollar fundraisers after holding them in the past. But the attacks that could land the most damage focus on Warren’s trustworthiness on health care, the No. 1 issue for voters in both the Democratic primary and in the general election, according to polling. Though Warren has rolled her out own detailed policy plans on everything from gun control to child care to rural economic development, she is the only leading candidate to avoid releasing her own health care plan, instead endorsing Sanders’ “Medicare for All” legislation while saying she remains open to alternatives. The position has left her vulnerable to attacks from Sanders supporters as well as from opponents of Medicare for All, which would eliminate private health insurance and require the government to pay for Americans’ health coverage. Warren’s steady rise in the Democratic primary has come, in large part, from her ability to appeal to both the party’s mainstream and left-wing branches, but health care is an issue that could turn chunks of both groups against her and undercut her central image as a candidate with a brilliant idea for every problem. “I support Medicare for All. I think it’s a good plan,” Warren told CBS after the Sept. 12 Democratic debate in Houston when asked if she would roll out her own health care plan. But she quickly added: “I support a lot of plans, other things that people have come up with it. When they’re good plans, let’s do it. This isn’t some kind of contest, ‘I got to think of mine first.’ It’s about what’s best for the American people.” Buttigieg, appearing on CNN on Thursday, noted that Warren has avoided explicitly stating if she would support higher taxes on middle-income earners of the kind needed to fund a single-payer system. Two days earlier, during an appearance on “The Late Show,” Stephen Colbert was unable to pin Warren down on the need for higher taxes to fund Medicare for All. Warren instead stuck to her formulation that under her plan net “costs” would go down for the vast majority of Americans because of the elimination of out-of-pocket expenses. “Sen. Warren is known for being straightforward and was extremely evasive when asked that question, and we’ve seen that repeatedly,” Buttigieg said of Warren’s refusal to directly answer Colbert’s questions. “I think that if you are proud of your plan and it’s the right plan, you should defend it in straightforward terms.” (Buttigieg, who rolled out his own health care plan on Thursday, has said only that he would fund an expansion of health care coverage by closing corporate tax loopholes, without further details.) Biden echoed this line of attack during a Friday event in Cedar Rapids, Iowa, suggesting Warren and Sanders were hiding the effect of Medicare for All. “You can’t beat Trump by not being straightforward about what it’s going to do,” he told a voter who questioned why he wasn’t supporting Medicare for All. Buttigieg, along with Biden and other moderate Democrats, has long argued that Sanders’ and Warren’s stated preference for Medicare for All is politically unwise and would cause chaos for tens of millions of Americans with private health insurance. But the recent attacks have focused squarely on the question of tax increases. “It’s fundamentally dishonest, because for people’s pocketbooks, Medicare for All will be a tax decrease, and the people saying this know that,” said Adam Green, co-founder of the Progressive Change Campaign Committee and a prominent Warren backer. “It’s an insurance company and Republican talking point.” Green also claimed Warren’s “refusal to take the bait” was helping her with Democrats. “Republicans will inevitably make unfair attacks in the general election. We can’t live in fear of that. But we don’t need to give them Democratic validators.” Warren is a relatively recent convert to single-payer, signing on to Sanders’ legislation only in September 2017. Since then, she has continued to work on interim fixes to the private health insurance system. In March 2018, she backed legislation ― co-sponsored by Sanders ― designed to tighten regulations on private insurers and keep them in the Affordable Care Act exchanges. When she first began running for president, she discussed protecting Medicaid more than pushing for single-payer. But at the first Democratic debate on June 27, she made her stance clear: She was “with Bernie on Medicare for All,” including the elimination of private health insurance. Warren reiterated her stance in the two subsequent debates and an interview released earlier this month with dying progressive activist Ady Barkan. Barkan, who has his used his struggles with ALS to help illustrate the need for single-payer health care, specifically pressed her to explain her greater reluctance on the topic closer to the start of her campaign. “There are areas where markets just don’t work and a big part of health care is one of those,” Warren told Barkan. “So the idea that we could get a couple of regulations in place and it will sort itself out is just not true with health care.” One advantage for Warren is that the National Nurses United union, a major institutional backer of Medicare for All that endorsed Sanders in the 2016 cycle, has not yet endorsed in the 2020 presidential primary. Asked whether the union considered Warren’s stance adequate, NNU spokesperson Chuck Idelson would not respond directly, instead saying that if the union decides to endorse in the race, it will “certainly explain” how the endorsement is “consonant” with its priorities. But Warren’s remarks have failed to assuage left-wing Sanders supporters ― many of whom are associated with the Democratic Socialists of America or Jacobin magazine ―  who don’t think they can count on her to enact a policy they believe is the bedrock of a robust, contemporary welfare state. They point to small signals from Warren ― her failure to give the plan a prominent place on her campaign website or to give it more than a passing mention in most of her speeches ― as reasons to be skeptical. Natalie Shure, a leading Medicare for All advocate and dues-paying member of the Boston chapter of the DSA, argued Thursday on the popular left-wing YouTube show “The Majority Report” that Warren was not willing to “fight tooth and nail for a robust, single-payer, Medicare for All health care system.” In a follow-up interview with HuffPost, Shure said that Warren’s unwillingness to explicitly embrace the need for middle-class tax hikes to fund Medicare for All is emblematic of her tepidness on the matter. “She’s simultaneously trying to tap into the activist energy and enthusiasm that activists have spent years building for single-payer and Medicare for All … without forfeiting any of the plausible deniability or the support of people who wouldn’t want to go that far,” Shure said. That’s a distinction from Sanders, who has staked his presidential run on the ability to galvanize a social movement ― a “political revolution” ― capable of at least generating momentum behind Medicare for All, according to Shure. “She looks at her role differently than a Sanders presidency would look at his role,” Shure said. “He would lead a movement to get it, which I think is necessary for anyone who wants it. I don’t think she’d veto it if it came to her desk. She might even whip votes for it. But I don’t think she is going to reach outside of electoral politics for it.” Minnesota Attorney General Keith Ellison, a Sanders stalwart who carried the single-payer bill in the House, put it more gently. Warren “hasn’t eased up on it. She hasn’t wavered, gotten weak in the knees,” he said, referring to Warren’s recent remarks affirming her support for the policy. “But I think it means something that Bernie carried the bill, wrote the bill and has been fighting for it even before it was a popular thing.”",
      "date": "09/21/2019 08:00 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Thousands Pack NYC Park As Elizabeth Warren Promises A Grassroots Movement To Take On Corruption",
      "url": "https://search.huffpost.com/click/_ylt=Awr4xJMtqatdfAgArTVsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559853/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2felizabeth-warren-washington-square-park_n_5d7ff77de4b077dcbd62cf5e/RK=2/RS=87wfbALcb7pLmF2l0.P5hzb_yUc-",
      "subtitle": "Speaking to a massive crowd at Washington Square Park, the Democratic presidential hopeful honored the working women killed at the infamous Triangle Shirtwaist Factory fire.",
      "author": "",
      "content": "NEW YORK ― Sen. Elizabeth Warren (D-Mass.) drew thousands of New Yorkers to her presidential campaign rally Monday in Washington Square Park, where she discussed her plans to fight corruption and support workers nationwide. The Democratic presidential hopeful honored the scores of mostly immigrant women who died in the Triangle Shirtwaist Factory fire of 1911 — which occurred about a block from where Warren spoke Monday — and praised the women’s trade unions that fought for change in the wake of the tragedy. “We’re not here today because of famous arches or famous men,” Warren said, referring to the park’s iconic arch looming behind her, which is named for President George Washington. “In fact, we’re not here because of men at all. We’re here because of some hard-working women. Women who, more than a hundred years ago, worked long hours in a brown, 10-story building a block that way.” Nearly 150 people ― mostly Jewish and Italian female workers ― died in March 1911 when the factory went up in flames and their bosses, fearing the employees might steal scraps of fabric, trapped them inside by locking the exit doors. “It was one of the worst industrial disasters in American history,” Warren said. “One of the worst, but it should not have been a surprise.” Working conditions at the Triangle Shirtwaist Factory were infamous, but the company’s owners were wealthy, politically connected and corrupt, she said. “They made campaign contributions and talked with their friends in the legislature,” Warren said. “They greased the state government so thoroughly that nothing changed. Business owners got richer, politicians got more powerful, and working people paid the price.” “Does any of this sound familiar?” she asked the crowd, which responded with an affirmative cheer. “Take any big problem we have in America today and you don’t have to dig very deep to see the same system at work.” The Harvard law professor-turned-senator’s rally in Manhattan is the culmination of a day filled with headline-generating announcements designed to cement her second-place standing in many early polls and replace Sen. Bernie Sanders (I-Vt.) as the left’s alternative to former Vice President Joe Biden. Warren unveiled a plan early Monday morning to combat Washington corruption that builds on legislation she introduced in August 2018 curbing, among other things, the influence of lobbyists. A few hours later, she received the endorsement of the Working Families Party, a national progressive organization that backed Sen. Bernie Sanders (I-Vt.) in the 2016 election cycle. At the rally, Warren also debuted the endorsements of two young, progressive New York state lawmakers, state Sen. Alessandra Biaggi and Assemblywoman Yuh-Line Niou, who said that Warren would finish the fight against corruption that they were waging in New York’s capital of Albany. Biaggi was part of a crop of six left-leaning Democrats who unseated a rogue faction of Democratic state senators aligned with the GOP who effectively kept the legislative chamber in Republican control. (Biaggi and Niou are part of a list of 14 New York City and state lawmakers who have endorsed Warren, according to the campaign.) Maurice Mitchell, national director of the Working Families Party, introduced Warren on stage before her speech, attesting to her potential appeal beyond the group of highly educated voters that polling suggests are her most ardent supporters. “Elizabeth Warren has proposed a whole host of solutions that meet the full scale of the crises we face ... Elizabeth Warren has a plan for it!” he said. “But crucially, Sen. Warren realizes that you need more than plans; we need to meet this moment with a movement of working people.” Warren’s show of force Monday evening was seemingly aimed at showcasing her strength in progressive bastions that were once Sanders’ exclusive stomping grounds. The Vermont senator drew massive crowds to a rally in the same park in April 2016, claiming some 27,000 people attended. Warren’s campaign said more than 20,000 people attended her rally, making it her largest to date. A spokesperson for the city Department of Parks and Recreation told HuffPost that officials believe the park’s capacity is 10,000, and that Warren’s event had a permit for 8,000 to 10,000 people. The city said it could not corroborate Warren’s crowd estimate. Sanders supporters often argue that their candidate is a more consistent and more effective champion of grassroots social movements than Warren, whose most famous campaign slogan ― “I got a plan” ― evokes a more technocratic approach than Sanders’ “political revolution.” On Monday evening though, Warren also emphasized her commitment to building a grassroots movement capable of powering her plans to fruition. Warren turned the Triangle Shirtwaist Factory tale into a parable for inside-outside organizing ― a term for policymaking that pairs mass mobilization with specialized legislative expertise and horse-trading. She described how one woman moved by the tragic spectacle of the fire was Frances Perkins, who went on to serve Franklin Delano Roosevelt as secretary of labor ― both when he was governor of New York and later when he became president. Perkins is widely viewed as the architect of New York’s first major labor reforms, as well as the social-democratic policies at the heart of the New Deal, including Social Security and a law establishing the first minimum wage. “As Frances Perkins put it: the Triangle Fire was ‘the day the New Deal was born,’” Warren said. Warren went on to recount how the movements for the abolition of slavery, women’s voting rights, labor rights, black civil rights and LGBTQ rights had all had to withstand skepticism of their power to effect change. But they persevered, she argued, just as Americans must now do to end corruption and restructure the economy. “They organized. They built a grassroots movement. They persisted,” she said, referencing a famous complaint GOP Senate Leader Mitch McConnell (R-Ky.) made about her. “And they changed the course of American history.” Warren’s campaign went the extra mile to paint her movement as an extension of Perkins’ work. The podium from which she spoke was constructed by an all-female woodworking company run by a supporter using old barn wood from Perkins’ historic home in Maine. Perkins’ grandson, Tomlin Perkins Coggeshall, procured the wood for the campaign and attended the rally. Some voters who supported Sanders in 2016 but showed up for Warren on Monday said they had gone with Sanders when it was a binary choice because they preferred him to Hillary Clinton. Astrid Clarke, a 49-year-old student and caregiver from Brooklyn’s East New York neighborhood, thought Sanders was a better bet than Clinton in the general election last time. Now she “loves” Warren for her plans. “I like the way it’s people-centric and the way she can explain it so you know that it’s hers,” Clarke said. Other attendees said they had been Clinton supporters. One such Clinton supporter, Katie Carella, a 39-year-old children’s publishing professional living in Manhattan, also emphasized Warren’s “plans.” “She literally has a plan for everything,” Carella said. “I think we have to be asking for big structural changes in order to make any headway.” This story has been updated with additional comments from Warren, and from a spokesperson for the city Department of Parks and Recreation.",
      "date": "09/16/2019 07:18 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Elizabeth Warren Protege Katie Porter Waits Out Making A 2020 Endorsement",
      "url": "https://search.huffpost.com/click/_ylt=Awr4xJMtqatdfAgAqzVsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559853/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fkatie-porter-2020-endorsement_n_5d8e52f4e4b0ac3cdda8769f/RK=2/RS=Bl2VPDXUSZsyDsiwMwozbMPGA3U-",
      "subtitle": "The California lawmaker counts both Warren and Kamala Harris, her home-state senator, as mentors.",
      "author": "",
      "content": "WASHINGTON ― Rep. Katie Porter is in a bit of an awkward spot. The California Democrat, a protege and former student of Sen. Elizabeth Warren (D-Mass.), has yet to make an endorsement in the 2020 Democratic presidential primary ― even as Warren has emerged as a leading candidate in the race, drawing ever-larger crowds on the campaign trail and beating out former Vice President Joe Biden in recent polls. One reason for Porter’s reluctance could be that Sen. Kamala Harris (D-Calif.) is still very much in the race. Porter shares a history with Harris, too: As attorney general of California, Harris appointed Porter to be the state’s independent monitor of banks, and Porter has spoken of Harris as another mentor in her political rise. Harris has more to gain from Porter’s endorsement, given her plunge in the polls over the last month, including surveys conducted of Democratic voters in California. In the latest University of California, Berkeley, Institute of Governmental Studies poll of the state, Warren led the field with 29% of likely Democratic primary voters. Harris trailed with just 8%. Even as Porter has stayed neutral, other California Democrats have gotten off the sidelines and backed various candidates in the presidential primary. “I adore Elizabeth and Kamala,” Porter told HuffPost recently. “I think either of them would be terrific presidents. I’m very enthusiastic and supportive of both of them, and that’s where it stands.” Spokespersons for both the Warren and Harris campaigns did not respond to a request for comment. Porter received endorsements from both senators in her long-shot 2018 bid for Congress in the heart of Orange County, California, which was once a conservative bastion before Donald Trump came along. In Congress, Porter teamed up with both senators to tackle issues touching on consumer protections and corporate malfeasance. A bicameral bill she co-sponsored with Warren and other senators sought to bolster the power of the Consumer Finance Protection Bureau, whose creation Warren spearheaded. Porter also introduced legislation with Harris that would strengthen the power of state attorneys general to monitor banks. Other Democrats are likely weighing similar decisions as they watch the 2020 jockeying ahead of the pivotal Iowa caucuses. Rep. Mike Levin, another first-term California Democrat, told HuffPost he doesn’t anticipate endorsing until the California primary. “You can count me in the ‘anybody but Trump’ column,” Levin said. Biden currently has the most support from prominent members of the party, according to The New York Times’ endorsement tracker, including many from states that are not his native Pennsylvania or Delaware. Harris, meanwhile, has the backing of four California representatives, including first-term Rep. Katie Hill. “There are many senators running for president and many members of Congress know them personally. There’s nothing easy about backing someone who’s not your hometown senator,” said Rebecca Katz, a progressive consultant and onetime aide to former Sen. Harry Reid (D-Nev.). Porter, meanwhile, says she’s not focused on the ins and outs of the presidential race. But she would like her constituents to hear from as many candidates as possible ahead of California’s March primary, which will take place three months earlier than when the balloting occurred in 2016, in order to increase the state’s role in shaping the 2020 race. “There are a lot of delegates to be had in California, and in particular my area of Orange County ― we just flipped it to the Democrats ― so there’s a lot of enthusiasm there, and I would love to have candidates to come and visit,” Porter said. “And I would welcome any of them to do that.”",
      "date": "09/27/2019 03:55 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Jonathan Van Ness Explains Why He’s Endorsing Elizabeth Warren",
      "url": "https://search.huffpost.com/click/_ylt=Awr4xJMtqatdfAgAqTVsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559853/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fjonathan-van-ness-elizabeth-warren-endorsement_n_5d8cd4e5e4b0019647a4c41c/RK=2/RS=6YIon7lcqoCR6vs_QnI_IzPmJVY-",
      "subtitle": "The “Queer Eye” star said he was inspired to support the senator after he paid $3,500 to replace his HIV medication last month.",
      "author": "Kimberley Richards",
      "content": " Jonathan Van Ness has endorsed Sen. Elizabeth Warren of Massachusetts in the 2020 Democratic primary. The 32-year-old revealed his HIV-positive status in a New York Times profile last week, ahead of the Sept. 24 release of his memoir. Then, during an interview Wednesday, Van Ness told Build Series that he realized he had a “significant role to play” and a “responsibility” to support people living with HIV after publicly sharing his status. (Both Build Series and HuffPost are a part of Verizon Media.) “That’s why I’m endorsing Senator Elizabeth Warren for president,” the “Queer Eye” star said. He revealed that his support for her was cemented after a difficult experience seeking medication last month. Van Ness said he misplaced his daily HIV medication while he was traveling between New York and Philadelphia. “I just was not thinking, so I left my medicine in New York City and I got to Philly and realized I didn’t have my medication,” he said. He visited a pharmacy late at night and, after dealing with his insurance company, had to pay $3,500 for the prescription. He was frustrated, both by the inconvenience of being unable to simply get a single replacement pill, and by the high cost, which he would have been unable to afford three years ago. “How the fuck do I have $3,500 sitting around in my fucking checking account?” Van Ness added, noting three years ago — before he appeared on “Queer Eye” — his financial situation was much different. The Centers for Disease Control and Prevention states that skipping dosages could give “HIV the chance to multiply rapidly,” which could weaken the immune system, and goes on to say that in most cases individuals who miss a dose can “take the medicines as soon as you can ... (unless your pharmacist or health care provider has told you something different).” On Wednesday, Van Ness tweeted about his support for Warren, writing that health care “shouldn’t be for profit, ever, it’s a human right.” Van Ness then tweeted a video of a phone call he had with Warren, in which he describes how impressed he was with her remarks on health care at the Democratic debate on Sept. 12, where the candidate also discussed high prescription drug costs. Warren supports the “Medicare for All” proposal introduced by Sen. Bernie Sanders (I-Vt.), which would provide all Americans health care through the government. She has received some criticism for not releasing her own health care plan and, when asked after the debate if she is going to, Warren said, “I support Medicare for All, I think it’s a good plan. ... Other things that people have come up with, when they’re good plans, let’s do it. This isn’t some kind of contest, ‘I gotta think of mine first,’ it’s what best for the American people.” In his Build Series interview, Van Ness addressed the dangers of HIV stigmatization, noting that there’s “so much more work to be done.” He said he reads stories of people “dying from HIV/AIDS-related deaths all over the world, due to lack of treatment, stigmatization, no access to facilities...” “If I was in one of those places, the person that people love so much, the ball of sunshine ... If I was born 20 years before I was born there’s a really good chance that I wouldn’t be here,” he said.",
      "date": "09/26/2019 06:53 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Mark Zuckerberg Says What He Thinks About Elizabeth Warren In Leaked Audio",
      "url": "https://search.huffpost.com/click/_ylt=Awr4xJMtqatdfAgApzVsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559853/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fmark-zuckerberg-facebook-elizabeth-warren_n_5d93476ce4b0ac3cddaed70c/RK=2/RS=I3CkWkRKQaY98EjYqywyJeJyPC4-",
      "subtitle": "The Facebook CEO singled out the 2020 Democratic contender, who has called for the breakup of tech giants.",
      "author": "Marina Fang",
      "content": " Facebook co-founder and CEO Mark Zuckerberg told employees he’s ready to “go to the mat and ... fight” Sen. Elizabeth Warren (D-Mass.) and other politicians who have called for big tech companies to be broken up, and predicted the social media giant will prevail even if Warren wins the presidency in 2020. “There might be a political movement where people are angry at the tech companies or are worried about concentration or worried about different issues and worried that they’re not being handled well,” Zuckerberg told Facebook employees in Q&A sessions in July, according to leaked audio recordings published by The Verge on Tuesday. “That doesn’t mean that, even if there’s anger and that you have someone like Elizabeth Warren who thinks that the right answer is to break up the companies. I mean, if she gets elected president, then I would bet that we will have a legal challenge, and I would bet that we will win the legal challenge.” He continued: Does that still suck for us? Yeah. I mean, I don’t want to have a major lawsuit against our own government. I mean, that’s not the position that you want to be in … It’s like, we care about our country and want to work with our government and do good things. But look, at the end of the day, if someone’s going to try to threaten something that existential, you go to the mat and you fight. Warren responded to the disclosure by reiterating her plan to break up tech giants, tweeting Tuesday: “What would really ‘suck’ is if we don’t fix a corrupt system that lets giant companies like Facebook engage in illegal anticompetitive practices, stomp on consumer privacy rights, and repeatedly fumble their responsibility to protect our democracy.” Facebook has repeatedly come under fire for privacy concerns, potential antitrust violations, its role in election interference and the dissemination of hate speech, online abuse and disinformation. Warren has called for big tech companies like Facebook, Google and Amazon to be broken up, warning of their threats to competition, privacy and free speech. “Today’s big tech companies have too much power  ―  too much power over our economy, our society, and our democracy. They’ve bulldozed competition, used our private information for profit, and tilted the playing field against everyone else,” Warren wrote in March. “We need to stop this generation of big tech companies from throwing around their political power to shape the rules in their favor and throwing around their economic power to snuff out or buy up every potential competitor.” Several other Democratic candidates have taken similar positions, including Sen. Bernie Sanders (I-Vt.). Sen. Kamala Harris (D-Calif.) has said she would “seriously take a look at” breaking up Facebook, calling it “essentially a utility that has gone unregulated.” Part of Warren’s plan would involve more regulation of “anti-competitive mergers,” like Facebook’s acquisition of Instagram. “Unwinding these mergers will promote healthy competition in the market ― which will put pressure on big tech companies to be more responsive to user concerns, including about privacy,” Warren said in March. According to the leaked audio, Zuckerberg reassured employees that “the rule of law” is on Facebook’s side. He said “the case is not particularly strong” against the company, arguing that election interference and the spread of hate speech could be “more likely” if social media giants were “more fragmented.” Read more of Zuckerberg’s comments here.",
      "date": "10/01/2019 10:12 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Elizabeth Warren Soars In Latest Iowa Poll",
      "url": "https://search.huffpost.com/click/_ylt=Awr4xJMtqatdfAgApTVsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559853/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2felizabeth-warren-roughly-tied-joe-biden-iowa-poll_n_5d86becbe4b0849d472a37a1/RK=2/RS=LbcTYVH.6lYcruMaLdUpj9QmS.U-",
      "subtitle": "The Massachusetts senator rose while the former vice president lost his lead in a key poll for Iowa’s upcoming Democratic caucuses.",
      "author": "Carla Herreria",
      "content": " Sen. Elizabeth Warren (Mass.) closed the gap of support between her and former Vice President Joe Biden as the top contender for the presidential nomination in Iowa’s Democratic caucuses, the first state in the country to vote in the race, according to the latest results of a key poll in Iowa released Saturday night. In the Des Moines Register/CNN/Mediacom poll, Warren was the first-choice candidate with support from 22% of likely Democratic caucus attendees ― up 7 percentage points since the last poll in June. Biden, who has maintained a slight edge over his opponents in other polling, fell 3 percentage points, bringing him to second place with 20% of their support. According to the Register, support for Biden has fallen in the Iowa polls since last year. Sen. Bernie Sanders (I-Vt.), who is also running for the Democratic nomination, fell far behind both Warren and Biden in the Saturday’s poll, taking third place at 11% ― down 5 percentage points since June. All the other Democratic 2020 candidates polled in the single digits. South Bend, Indiana, Mayor Pete Buttigieg and Sen. Kamala Harris (Calif.) rounded out the top five candidates, polling at 9% and 6% respectively. Despite Warren’s and Biden’s lead, there’s still room for other contenders to crawl back up before the Iowa Democratic caucuses in February. Sixty-three percent of likely caucusgoers said in the poll that they hadn’t fully made up their minds yet on their most favored candidates. Ann Selzer, the most respected pollster in the state, conducted the poll on 602 likely Democratic caucusgoers between Sept. 14 and Sept. 18. The poll has a margin of error of plus or minus 4 percentage points. Earlier Saturday, all of the 2020 Democratic candidates came together for an annual Steak Fry fundraiser for the Polk County Democrats in Des Moines. CORRECTION: An earlier version of this article referred to Bernie Sanders as a Democratic senator from Vermont. Sanders was elected as an independent, though he caucuses with Democrats and is running for the Democratic presidential nomination.",
      "date": "09/21/2019 09:39 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Elizabeth Warren Wants To Tax Corporate Lobbying",
      "url": "https://search.huffpost.com/click/_ylt=Awr4xJMtqatdfAgAozVsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559853/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2felizabeth-warren-lobbying-tax_n_5d93c202e4b0019647b05afc/RK=2/RS=N3HkrGF92YLYS0U5.THQ1fMQRcQ-",
      "subtitle": "The 2020 Democratic presidential candidate has a new plan for a progressive tax on lobbyists in Washington.",
      "author": "Paul Blumenthal",
      "content": " Sen. Elizabeth Warren (D-Mass.) has a plan to crack down on lobbying in Washington: She wants to institute a progressive tax on “excessive” lobbying expenditures. The proposal from the 2020 Democratic presidential candidate was first listed among her proposals to rein in Washington lobbying in September, but she is now providing extensive details. She would place a 35% tax on annual lobbying expenses above $500,000 for corporations and trade organizations. The tax rate will increase to 60% for expenses over $1 million and then 75% for spending exceeding $5 million. The income generated by the new tax will be placed in a “Lobbying Defense Trust” that will be used to help fund congressional support agencies, such as a reinstated Office of Technology Assessment and the Congressional Budget Office, and heavily lobbied executive branch agencies. It would also create an Office of the Public Advocate to help regular people better influence government decision-making. The general idea is that a tax on lobbying creates a market-based mechanism to discourage corporate spending that seeks to gain from making back-room deals rather than creating wealth. Currently, there is a strong incentive for corporations and other special interests to spend heavily on lobbying to obtain beneficial treatment. All combined, more than $3 billion was spent on reported lobbying expenditures in each of the past 10 years. Corporations make up the largest share of this spending. Total revenue from the proposed lobbying tax would have raised $10 billion over the past 10 years, according to an analysis provided by the Warren campaign. Fifty-one corporations would have been hit with the highest proposed tax rate of 75% for spending above $5 million. These companies and trade groups include the U.S. Chamber of Commerce, Koch Industries, Exxon, Boeing, Microsoft, Pfizer, Walmart, Google and Facebook. The lobbying tax is one of many proposals Warren has introduced to crack down on corruption in Washington. She has proposed banning elected lawmakers and top officials from lobbying, expand the definition of lobbying to increase disclosure, ban foreign lobbying and ban lobbyists from donating or raising campaign money, among other things. The thinking behind Warren’s tax on lobbying expenditures is slightly different ― maybe even opposed to ― the restrictions on lobbying usually considered by Congress. It can be argued that some of these restrictions have simply had the effect of making lobbying less transparent ― as more people involved in the influence industry find loopholes to evade registering as lobbyists. The tax, however, is simply a mechanism to deter excessive lobbying ― or at least impose a cost on it. This is what Luigi Zingales, a professor at the University of Chicago Booth School of Business, thought when he proposed a tax on lobbying in his 2012 book, ”A Capitalism for the People.” The Warren campaign consulted him when crafting the proposal. “If you tax lobbying in a progressive way then it reduces the influence of the largest companies on the important decisions,” Zingales told The Economist in a 2012 interview. “People lobby because there’s a high return, but if you start taxing them and using some of that money to subsidise the opponents then it evens out.” And that is Warren’s thinking, too. “My new lobbying tax will make hiring armies of lobbyists significantly more expensive for the largest corporate influencers like Blue Cross Blue Shield, Boeing, and Comcast,” Warren said in a post explaining the new tax policy. “Sure, this may mean that some corporations and industry groups will choose to reduce their lobbying expenditures, raising less tax revenue down the road ― but in that case, all the better.”",
      "date": "10/02/2019 09:00 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Warren Courts African American Voters To Cement Her 2020 Coalition",
      "url": "https://search.huffpost.com/click/_ylt=Awr4xJMtqatdfAgAoTVsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559853/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2felizabeth-warren-african-american-voters-south-carolina_n_5d901f50e4b0e9e7604df3df/RK=2/RS=JE96eq7WdrEgSmjXmmxWIeutYI0-",
      "subtitle": "Biden is leading in South Carolina, but Warren supporters hope a focus on the state — plus her education and child care plans — can win over African Americans.",
      "author": "Kevin Robillard",
      "content": " ROCK HILL, S.C. ― Massachusetts Sen. Elizabeth Warren came to historically Black Clinton College in this suburb of Charlotte hoping to woo the voters she needs to complete a coalition that can claim the 2020 Democratic presidential nomination: African Americans. Warren’s slow and steady rise in polling has been largely powered by white voters with college degrees, though more recent polls have shown gains across basically every demographic within the Democratic Party. But one of her biggest rivals for the nomination, former Vice President Joe Biden, still has a substantial lead among African American voters nationally and in this crucial state, the first in the south to cast its primary ballots. Compared to Iowa and New Hampshire ― the overwhelmingly white states that vote first and second in the primary ― Warren has spent little time in South Carolina. A local reporter noted it had been more than a month since her last public event in the state, and a candidate tracker from the Charleston Post and Courier shows her attending just 12 events in the state before Saturday, compared to 17 for Biden, and more than 30 for Vermont Sen. Bernie Sanders, the third leading contender for the nomination. (Two African American candidates ― California Sen. Kamala Harris and New Jersey Sen. Cory Booker ― lead the way with 36 and 39 events, respectively.) Warren’s supporters in South Carolina say if she picks up her pace in visits to the state, African American voters will embrace her message of battling political corruption and raising taxes on the wealthy to fund universal child care and free public higher education. “We’re still a high-touch community, even in a high-tech society,” said state Sen. Wendy Brawley, an African American who predicted Warren could win the state. “She gets that she needs to show up where we are.” Warren’s stop at Clinton College showed the promises and challenges that face the former Harvard Law professor. The crowd of roughly 1,000 people was mostly white, and attendees of all races largely said they arrived at the event already in her corner. Warren’s pitch barely varied from her standard stump speech: She walked voters through her famous policy plans while nearly totally avoiding two hot topics of the day ― the possible impeachment of President Donald Trump and the details of her support for “Medicare for All.” She did note her higher education plan would funnel an additional $50 billion to historically Black colleges like Clinton. It’s not new for Warren to be courting African Americans. Some Black progressive activists have been raving about her since at least April, and she’s often held listening sessions with Black leaders as she tours the country. “What I’m doing is showing up and trying to talk to people about why I’m in this fight, what’s broken and how to fix it,” Warren told reporters when asked about the majority-white crowd and what she needed to do to win over Black voters. But it does appears Warren is ready to invest more time and resources in the state. She’s opening a campaign office in Rock Hill next week, her campaign said. But while the Warren team is eager to talk up the strength of their field operations in Iowa and New Hampshire, they declined to reveal how many staffers are on the ground in the Palmetto State. (In total, Warren has 300 staffers, and 60% of those are in Iowa, New Hampshire, South Carolina or Nevada.) Biden’s campaign has 41 staffers on the ground here. Brawley and other Warren backers in the state pointed to two Warren policies they believe could help court Black voters: Her education policies — including the elimination of student debt — could woo younger Black voters, while her proposal to make sure no family spends more than 7% of its income on childcare would attract Black women of all ages. “In my district, when you have grandparents raising their grands, when you have people working two jobs to keep a roof over their heads, not having childcare is a real issue,” Brawley said. “These are pocketbook issues that really matter, that can change people’s lives if we give them even a little attention.” Casey McClure, a 26-year-old who said she “loved everything about” Warren, suggested Biden’s lead in the state was due to a generation gap. “It’s the older voters,” she said, noting she had met Biden during one of his earlier stops in the state. “She needs to get the young people out to vote.” But there are some signs the gap might be closing. “I love Joe, but he might not be as spunky as he used to,” said McClure’s mother, who declined to give her name. A Quinnipiac University poll this week saw Warren essentially tied with Biden, and building beyond her base of college-educated white voters. She earned the support of 27% of Democrats and Democratic-learning voters nationally, compared to 25% for the former vice president, and 16% for Sanders. That included a lead among college-educated white voters, liberals, voters aged 35 to 50, and those making more than $50,000 a year. She also tied Biden among white voters without a college degree. Among white voters overall, Warren led Biden 33% to 23%. But among Black voters, Biden’s advantage was substantial: Forty percent said they support him, while only 19% backed Warren. That still represents a marked improvement for Warren. In July, the same poll found just 4% of Black voters supported her, while 53% supported Biden. A CNN poll of South Carolina voters released Sunday morning, however, painted a much grimmer picture for Warren. The poll showed Biden earning 37% of the statewide vote to Warren’s 16%, with Sanders at 11%. Among Black voters, Warren tallied just 4% of the vote compared to Biden’s 45% and Sanders’ 13%. Biden and his allies have long viewed Black voters as a crucial backstop for his campaign. While Sanders turned in strong performances in Iowa and New Hampshire in 2016, his campaign floundered as Hillary Clinton, the party’s eventual nominee, routed him among African Americans. The primary schedule is similar this year. Fourteen states are holding their primaries on March 3, so-called Super Tuesday, when more than 40% of the Democratic delegates are up for grabs. Six of those states, including delegate-rich Texas, are at least 10% Black. But state Rep. Kambrell Garvin, another Warren backer, suggested Biden and others shouldn’t count on South Carolina’s voters to stay static, and noted the results in Iowa and New Hampshire could sway their votes. “I know South Carolina for some of the other campaigns is considered to be a firewall state, but I don’t know if that’s a good strategy,” he said. “I think African-American voters are not monolithic, and I think they’re going to make decisions that best suit their community.”",
      "date": "09/29/2019 10:08 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Elizabeth Warren Hilariously Trolls Political Smear Calling Her A ‘Cougar’",
      "url": "https://search.huffpost.com/click/_ylt=Awr9ImhIqatdPXgAtU9sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559880/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2felizabeth-warren-jacob-wohl-epic-troll_n_5d9669d5e4b0da7f6623db43/RK=2/RS=D43k2GT5IIQ7aBfYoCzeOY0JhAs-",
      "subtitle": "Two discredited far-right conspiracy theorists were up to their old tricks. But she deftly dismissed them.",
      "author": "David Moye",
      "content": " A pair of thoroughly discredited political dirty tricksters attempted to smear Sen. Elizabeth Warren of Massachusetts as a “cougar” on Thursday, and the Democratic presidential candidate responded hilariously ―and truthfully ― without getting catty. The two far-right conspiracy theorists who are already known for fraudulent claims ― Jacob Wohl and Jack Burkman ― held a press conference in Arlington, Virginia, featuring Kelvin Whelly, a former U.S. Marine in his mid-20s who claims he had a paid sexual affair with Warren, 70, that included bondage. Whelly claims he met Warren through a male escort website, Cowboys4Angels, and that their first tryst occurred on Aug. 8, 2018, in Massachusetts. But he offered no verifiable evidence to back up his story and Rolling Stone later reported that the Cowboys4Angels chief executive said, after checking his records, that “this guy never worked for me.” Wohl and Burkman have made clear in the past their avid support for President Donald Trump, but even the pro-Trump Daily Caller noted that Whelly had a hard time keeping a straight face while discussing his allegations. Warren, meanwhile, won the day with a witty response that embraced her “cougar” past, telling the world it made her who she is. Twitter users thought Warren’s cougar tweet was the cat’s meow: Wohl, though only 21, already has defined the term “checkered past.” As a teenager, the Southern California native was involved in financial scams and banned for life by the National Futures Association. In August, new charges of securities fraud were filed against him.",
      "date": "10/03/2019 07:32 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Surging In The Polls, Elizabeth Warren Sets Her Sights On California’s Primary",
      "url": "https://search.huffpost.com/click/_ylt=Awr9ImhIqatdPXgAs09sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559880/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2felizabeth-warren-2020-california_n_5d975434e4b0f5bf79739c81/RK=2/RS=Ij8WnWsXYzrQjRBWHl4SgFnIIDQ-",
      "subtitle": "The Massachusetts senator is picking up steam in the Golden State as home-state Sen. Kamala Harris’ polling numbers tumble.",
      "author": "Igor Bobic",
      "content": " SAN DIEGO ― A new poll confirms that a tight three-way race is developing in California’s key Democratic presidential primary, with one candidate showing impressive momentum: Sen. Elizabeth Warren of Massachusetts. A survey released Thursday by the Public Policy Institute of California showed Warren the choice of 23% of likely primary voters, with former Vice President Joe Biden at 22% and Sen. Bernie Sanders (I-Vt.) at 21%. When the Democratic race was first taking shape in the spring, a Quinnipiac Poll had shown Warren in single digits in the Golden State, far behind Biden, Sanders and California Sen. Kamala Harris. Indeed, as Warren’s support has surged in California ― as it has nationally ― the prospects for Harris in her home state have taken a hit, again reflecting national trends. Perhaps the new poll’s most striking finding is that Harris trailed well behind the pack with just 8% support, another sign of trouble for her struggling campaign. “Warren may well be a beneficiary of Harris’ collapse,” said veteran California Democratic strategist Garry South. “Since her very impressive debut (as a White House candidate) in Oakland in January, Harris has done little in California to solidify whatever support may have been potentially there for her.” Voters like Cindy Henderson, an author who showed up to hear Warren speak Thursday as the candidate made her first campaign stop in San Diego, give a glimpse into the race’s current dynamics. “I was actually a Kamala fan,” Henderson said. “Just something in the last two or three months, I’m just kind of dropping off [on her]. I think she’s not quite ready. I just don’t think there’s much depth yet. The more I hear and watch what Elizabeth does, it’s just like, OK, she’s a rock star. I’m loving her message.” Warren drew about 8,500 people for her rally in downtown San Diego. (A rally for Sanders was attended by an estimated 6,400 people at the same venue in May). Like most of Warren’s audiences, her Thursday crowd was predominantly white ― which aligns with how her support breaks down in public opinion surveys, as well. A UC Berkeley Institute of Governmental Studies poll released in late September showed her leading the California race with 29%, with Biden at 21% and Sanders at 20%. But Warren trailed both of those two with Latino voters. Warren mostly stuck to her populist stump speech on Thursday, laying out her plans to take on Washington corruption, special interests and big corporations. She appeared to choke up at one point as she recalled the family struggles that marked her childhood in Oklahoma, including the time her mother lost her job. The story is a big hit with many voters, who cite it when discussing the candidate. At one point, after discussing her plan to break up big tech companies, Warren called out Facebook CEO Mark Zuckerberg, who told employees in recently leaked audio the company would “go to the mat” to defeat her efforts. “And yes, Mark Zuckerberg, I’m looking at you,” she said, to cheers and applause from the audience. The true contours of the Democratic battle will emerge in February when the narrative-driving nominating contests in Iowa, New Hampshire, Nevada and South Carolina take place. But right around the corner comes primaries in 14 states on March 3, Super Tuesday. And California is the day’s dominant contest, with 416 convention delegates allotted. That’s why so many of the main Democratic contenders are paying frequent visits to the state to meet with voters ― as well as well-heeled donors. Also, early mail-in voting begins a month before the actual primary date. And conquering California presents unique challenges for a politician: its population is decidedly more diverse than that in the earlier-voting states, campaign ads are far more expensive than in those other locales and gaining media attention is difficult. In terms of having the money to compete, Warren and Sanders are well-primed as the race enters the final stretch before primary season. Warren raised $24.6 million in the third quarter, her campaign told supporters in an email Friday, and has $25.7 million cash on hand. Sanders, hospitalized earlier this week in Nevada because of a blocked artery, raised $25.3 million from July to September (his campaign didn’t release a cash-on-hand figure). Their figures are especially impressive because both candidates have opted against holding fundraisers focused on big-dollar donors during the primary campaign. Biden’s campaign, meanwhile, reported a lackluster $15.2 million raised over the past three months, far less than his second-quarter haul of $21.5 million. He could be in trouble if his fundraising continues to taper off. President Donald Trump’s re-election campaign and the Republican National Committee announced raising a combined $125 million in the third quarter, a record-setting haul. His war chest will only grow as Democrats spend several months ― and maybe more, in the case of a lengthy primary battle ― determining their nominee. Warren dismissed Trump’s haul on Thursday, telling reporters she didn’t think “scooping up a bunch of money from rich people and buying a bunch of TV ads” is “how democracy works anymore.” She added: “I think it’s going to be about going out and building a grassroots movement.” Given Warren’s steady rise in the primary race, the Oct. 15 Democratic debate in Westerville, Ohio, looms particularly large for her. As the frontrunner in several of the race’s most recent national polls, she’ll likely have a bigger target on her back. Even as Warren received enthusiastic backing at her San Diego rally, interviews with some of the undecided voters at it underscored some of the doubts she still most overcome. Corinne Lytle-Bonine, an environmental consultant who voted for Sanders in the 2016 Democratic primary, acknowledged she was giving Warren a strong look this time around. “Having the nomination be another old white man is a hard pill to swallow when it feels like women have been the ones really carrying the Democrats through 2018,” Lytle-Bonine said. She added that “I think Warren has some establishment credentials that Bernie doesn’t, and may make her more electable in the general election.” Still, Lytle-Bonine questioned why Warren has been hesitant to acknowledge whether the middle class would see a tax hike if, as president, she would push into law “Medicare-for-All” government health care plan Sanders has introduced and that she supports. Several of Warren’s rivals have criticized her for repeatedly dodging the question; she’s brushed off the attacks as unfair Republican framing. “I wish that she would” directly deal with that issue, Lytle-Bonine said. “I guess I don’t know what is holding her back. I don’t think it’s a hard answer to say ‘Yes, we’ll raise taxes, however, all of your out-of-pocket expenses (for health care) go away.’”",
      "date": "10/04/2019 05:20 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Elizabeth Warren Is Right. In The 1970s, Pregnant Teachers Didn’t Keep Their Jobs.",
      "url": "https://search.huffpost.com/click/_ylt=Awr9ImhIqatdPXgAsU9sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559880/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fwarren-teachers-fired-pregnancy_n_5d9ca7b4e4b03b475fa08b78/RK=2/RS=BmExCc2Zq0Y7F6PG_zq24MIkRoY-",
      "subtitle": "Back then, teaching was the national model for discriminating against pregnant workers and getting away with it.",
      "author": "",
      "content": "Sen. Elizabeth Warren’s presidential campaign is on the offensive against a report that questions a compelling piece of her origin story: her account of being pushed out of her first teaching job because she was six months pregnant. Although the reports don’t contain evidence that Warren is lying, they show there is no written evidence she was fired from her elementary school job and they open the door to the possibility that she voluntarily resigned to raise a family. What’s missing, though, is a crucial fact about the time period when Warren says she was shown the door: In 1971, teaching wasn’t just another profession where women experienced pregnancy discrimination. It was the national model for how employers could systematically discriminate against pregnant workers and get away with it. School districts around the country followed plain-as-day policies that terminated pregnant teachers or forced them to take unpaid leave, usually around the fifth month of pregnancy when they were obviously pregnant. A National Education Association survey in 1970 found that a majority of school districts had such a policy, and that most of those policies came with no guarantee that a teacher would get her job back after giving birth. That placed school teachers on the front lines of the fraught legal and cultural battles for better protections for working women, writes legal historian Deborah Dinner. National women’s groups took up the treatment of pregnant teachers as an organizing cause. Women’s legal advocates recruited teachers as civil rights test cases. The Supreme Court’s first pregnancy discrimination case, argued in 1973, pitted three pregnant teachers against a “five month” policy. That case, and the questions it left unanswered, became the basis for the landmark Pregnancy Discrimination Act of 1978. In other words, when a pregnant Warren left her teaching job, pregnancy discrimination against teachers was rampant, controversial and inextricable from the much larger battle on the overall status of working women. The question isn’t why her school board would lie about forcing her out — it’s why wouldn’t it? Warren’s story of being shuffled out of her first teaching job goes like this: In 1971, she was a teacher — her dream job — at a special-needs school for public school students at Riverdale Elementary in New Jersey. In April, when she was pregnant but not obviously, the school renewed her teaching contract for another year. By the summer, she was six months pregnant — “visibly pregnant” — and the job was no longer hers. “The principal did what principals did in those days: wished me luck, showed me the door, and hired someone else for the job,” she said at a recent town hall. In some recent appearances, she has dropped the “showed me the door” line, but she defended her characterization in an interview with CBS News. “When someone calls you in and says the job that you’ve been hired for for the next year is no longer yours, ‘We’re giving it to someone else,’ I think that’s being shown the door,” Warren said. The Washington Free Beacon, a conservative outlet, cast doubt by noting that Warren had once described her exit differently: “[I] said, ‘I don’t think this is going to work out for me.’ I was pregnant with my first baby, so I had a baby and stayed home for a couple of years,” she said in a 2007 interview. (Warren told CBS that she wasn’t comfortable opening up about the discrimination aspect until recently.) And it pointed to contemporaneous reports from 1971 that also paint her exit as voluntary. A local news item said Warren was “leaving to raise a family,” while another said the school board hired Warren’s replacement after she “resigned for personal reasons.” Of course, what really matters here is whether Warren had a choice to keep her job at all. And to read just those two news items is to miss the reality that in 1971, it was the de facto or actual expectation in the majority of American school districts that a teacher who became pregnant would resign. “Voluntary resignations” were many teachers’ only alternative to automatic dismissal — and Warren’s school district was reportedly no exception. “The rule was at five months you had to leave when you were pregnant. Now, if you didn’t tell anybody you were pregnant, and they didn’t know, you could fudge it and try to stay on a little bit longer,” Trudy Randall, a retired Riverdale Elementary teacher, told CBS. “But they kind of wanted you out if you were pregnant.” Certainly, by 1971, Warren’s principal would have known that to openly fire her because she was pregnant was to court trouble. “In the early 1970s,” the country at large was embroiled in a “major cultural and legal debate over the rights of pregnant workers,” according to a history of the Pregnancy Discrimination Act published in the Yale Journal of Law & Feminism. The American Federation of Teachers denounced mandatory pregnancy dismissals at its annual convention in 1970. By the next year — the year Warren left her job — the federation and the National Organization for Women were coordinating local name-and-shame campaigns against school boards with retrograde policies. One district that found itself under fire was a school board in New Jersey, the state where Warren had worked. In 1972, the state civil rights commission slapped down a policy forcing teachers to leave school at five months pregnant. An Associated Press story from that time reported the ruling to mean “pregnant teachers can no longer be automatically forced out of New Jersey’s classrooms.” Because teaching was one of a few career options reliably available to women, the treatment of pregnant schoolteachers was at the heart of the broader societal clash over pregnant workers. Schools were also a special battleground because teaching jobs were mostly government jobs — it gave pregnancy discrimination against teachers the sheen of authority. Among the very first federal cases against pregnancy discrimination was brought in 1973, by a Minnesota teacher named Margo Seaman, who sued her school district for forcing her, when she was seven months pregnant, to take a semesterlong leave of absence. Seaman was able to stay in her job but lost her fight for back pay, in no small part because her teacher’s union had capitulated in 1971 to a policy “providing for permanent ‘termination’ of a teacher after five months of pregnancy, with no guarantee of reinstatement.” And in 1974, the Supreme Court took up its first pregnancy discrimination suit, which the legal professor Nicholas Pedriana called “a typical early pregnancy discrimination case”: “Public school teachers who became pregnant were required to take maternity leave beginning in the fifth month of pregnancy.” The case, Cleveland Board of Education v. LaFleur, involved three teachers from two school districts in Ohio and Virginia who were pregnant in 1970 or 1971 and were forced to take many months of unpaid maternity leave with no guarantee of getting their jobs back. In a 7-2 decision, the Supreme Court ruled that the five-month rule was arbitrary and unconstitutional. The questions that case left unanswered — namely, whether pregnancy discrimination was a form of gender discrimination and subject to an even wider array of civil rights laws — led eventually to the passage of the Pregnancy Discrimination Act. At the heart of all of these legal fights and retrograde school board policies were traditional ideas about gender, Dinner writes: the notion that pregnancy, a visible sign of women’s sexual activity, wasn’t classroom-appropriate; that pregnant women couldn’t work without endangering their health and their pregnancies; and that new mothers shouldn’t work but focus on their families. Those ideas started to crumble in the 1970s. But they still persist, and, making it all the more difficult to dismiss Warren’s story, they still result in routine pregnancy discrimination against professional women today. Today, the idea of putting a visibly pregnant CEO on the cover of a magazine is still considered trailblazing. Today, the idea that pregnant women place special burdens on their co-workers is still pervasive. Pregnant women often find themselves “mommy tracked,” and paid or promoted less than their peers for equivalent work based on the assumption that their futures belong to their families. “Pregnancy discrimination remains pervasive, especially for women in low-wage and physically demanding jobs,” said Dina Bakst, co-founder and co-president of A Better Balance, a national legal advocacy organization for women’s rights. “It is a key barrier to gender equality in the workplace, often snowballing into devastating economic consequences for women.” And it is still prevalent in the teaching profession. Religious schools, for instance, have fought for and often won the legal right to fire pregnant teachers who are unmarried or who conceive using methods, like IVF, opposed by some faiths. Denine Hasan, who is a New Jersey schoolteacher like Warren was, said she wasn’t at all surprised by Warren’s account. Hasan says that she, too, was shuffled out of her position when she became pregnant — during the 2012-13 school year. Like Warren, she wasn’t outright fired. Instead, she says, she was assigned to a new school, given unprecedented negative reviews and treated with hostility or punished when she asked for medically recommended accommodations for her high-risk pregnancy. Officials informed Hasan, who was not tenured, that her contract would not be renewed when she went on maternity leave. (The Asbury Park School District has not admitted wrongdoing, and didn’t immediately respond to requests for comment.) “I don’t think I would get pregnant again. Because you’re just fearful. What’s going to happen? Am I going to lose my job?” Hasan told HuffPost. “Women are always viewed differently than men,” she continued. “Its natural for us to bear children, and then to be put in situations where now we’re losing jobs because we’re doing something that’s natural. It’s like we can’t win.” Emily Peck contributed reporting",
      "date": "10/08/2019 05:52 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Vintage Photo Of Elizabeth Warren In Jeans Is The Fashion Inspo We Need",
      "url": "https://search.huffpost.com/click/_ylt=Awr9ImhIqatdPXgAr09sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559880/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2felizabeth-warren-jeans_l_5d939fe4e4b0019647b01073/RK=2/RS=2FdDye6R6P794rgtly6_7qEIxDE-",
      "subtitle": "null",
      "author": "",
      "content": "",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Women On Twitter Share Pregnancy Discrimination Stories For Elizabeth Warren",
      "url": "https://search.huffpost.com/click/_ylt=Awr9ImhIqatdPXgArU9sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559880/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2felizabeth-warren-women-share-pregnancy-discrimination-stories_n_5d9d2684e4b02c9da0409c98/RK=2/RS=ZMc97m8Dk.Lg.h9d1TaoDYKBbTM-",
      "subtitle": "In the wake of scrutiny over the presidential candidate’s own story of losing her job, the senator urged other women to come forward. So they did.",
      "author": "Josephine Harvey",
      "content": " Sen. Elizabeth Warren (D-Mass.) is standing firm in the face of scrutiny, and so are her supporters, who are sharing their own stories on Twitter of when they faced discrimination because of pregnancy. The 2020 presidential candidate tweeted Tuesday to reiterate that she had been edged out of her first teaching job when she became pregnant. She had been responding to unsubstantiated accusations that she had actually voluntarily resigned. “We can fight back by telling our stories. I tell mine on the campaign trail, and I hope to hear yours,” she added. The conservative website Washington Free Beacon on Monday surfaced the minutes from an April 1971 board of education meeting showing a unanimous vote to extend Warren’s teaching contract, two months before her exit in June. This does not necessarily contradict Warren’s story, which is that her contract was renewed in April but that by June, when she was six months’ pregnant, the principal “showed her the door.” “When someone calls you in and says the job that you’ve been hired for for the next year is no longer yours ― ‘We’re giving it to someone else’ ― I think that’s being shown the door,” Warren told CBS News on Monday. The Washington Free Beacon also cast doubt on Warren’s account by noting she had once described her exit from the job differently in a 2007 interview, when she said: “[I] said, ‘I don’t think this is going to work out for me.’ I was pregnant with my first baby, so I had a baby and stayed home for a couple of years.” When asked to explain this, Warren told CBS she wasn’t comfortable delving into the discrimination aspect publicly until later in her career. On Tuesday, after Warren’s tweets, people on Twitter shared their own experiences of job discrimination due to pregnancy, or those of their friends and family. Here are some of those stories: Yep. In the late 90s, after 3 years of stellar reviews/promotions, I was suddenly fired within a month of telling my boss I was pregnant. They said I lied when I’d called in sick one day (morning sickness), but went to visit family later. I was young+scared, so I didn’t fight it. Do you have a similar story of job discrimination due to pregnancy? Get in touch with HuffPost’s Amanda Terkel.",
      "date": "10/08/2019 10:05 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Elizabeth Warren Releases Plan For LGBTQ Rights And Equality",
      "url": "https://search.huffpost.com/click/_ylt=Awr9ImhIqatdPXgAq09sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559880/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2felizabeth-warren-lgbtq-plan_n_5d9e246ae4b087efdba732c1/RK=2/RS=VXyJyIsmrlGDiRn1dtzhbzKMLLQ-",
      "subtitle": "The 2020 candidate said she would reverse Trump’s transgender military ban on day one of a Warren administration.",
      "author": "Antonia Blumberg",
      "content": " Democratic presidential candidate Elizabeth Warren released a wide-ranging LGBTQ policy plan on Thursday morning, vowing to enact measures and funnel resources toward fighting discrimination on the basis of sexual orientation and gender expression. In a 12-page memo, the Massachusetts senator outlined dozens of ways a Warren administration would “fight for LGBTQ+ equality in solidarity with the leaders and organizers who have been at the helm from the very beginning.” The measures include things like working to pass the Equality Act, which would extend civil rights protections to LGBTQ people, and amending the Religious Freedom Restoration Act to ensure it can’t be used to discriminate against LGBTQ people. Warren said she would reverse the Trump administration policy that bans transgender people from serving in the military, as well as appoint a special envoy to the State Department to oversee LGBTQ human rights. “I have opposed the Trump Administration’s shameful ban on transgender service members from the start, and I will reverse it on Day One,” the senator wrote in her plan. Warren’s plan highlights the recent murders of transgender people in the U.S., most of them trans women of color, and states “it is time for a president to say their names and honor their memory.” The senator included a number of measures aimed at reducing violence against trans women of color, including reversing the Department of Housing and Urban Development’s proposal to allow homeless shelters to deny transgender people access to their services. Warren released the plan ahead of her participation in a Thursday town hall hosted by CNN and the Human Rights Campaign that will focus on issues affecting the LGBTQ community. The senator is also expected to join the Las Vegas Pride Parade on Friday. Thursday’s plan comes on the heels of a sweeping climate justice proposal Warren released on Wednesday and which reads as an ambitious blueprint of how to implement a Green New Deal. Like her LGBTQ plan, Warren’s climate proposal looks at addressing the intersections of multiple issues ― in this case how race and privilege play into conversations about the environment. “Justice cannot be a secondary concern ― it must be at the center of our response to climate change,” Warren wrote in the memo.",
      "date": "10/10/2019 06:00 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Elizabeth Warren Has A Plan For Brett Kavanaugh",
      "url": "https://search.huffpost.com/click/_ylt=Awr9ImhIqatdPXgAqU9sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559880/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2felizabeth-warren-plan-brett-kavanaugh_n_5d9aa9dfe4b03b475f9bb770/RK=2/RS=mpyqUIXkR0U0WGr7X1FmTXbwbdo-",
      "subtitle": "The Democratic 2020 presidential candidate is targeting misconduct in the federal judiciary, including the Supreme Court.",
      "author": "",
      "content": "Sen. Elizabeth Warren (D-Mass.) unveiled a plan to reform federal judicial misconduct on Monday, a day after the one-year anniversary of Brett Kavanaugh’s controversial confirmation to the Supreme Court. “It’s time to ensure that judges do not hear cases where they have conflicts of interests, strengthen our nation’s ethics rules for judges, and ensure accountability for judges who violate these rules,” the 2020 presidential candidate wrote in her announcement of the plan for an impartial and ethical federal judiciary. Warren’s plan includes closing a loophole that allows federal judges to escape investigations for misconduct when they resign from office or are elevated to the Supreme Court ― a loophole that Warren has railed against in the past. “My plan extends the authority of the Judicial Conference to former judges so that individuals under investigation cannot simply resign from the bench to avoid accountability,” Warren said. “This provision would allow the judiciary to reopen the investigations into Alex Kozinski, Maryanne Trump-Barry, Brett Kavanaugh, and any other judge who benefited from this loophole.” Kozinski was a judge on the federal 9th Circuit accused in 2017 by at least 15 law clerks of sexual misconduct. But, as Warren noted, the investigation into Kozinski’s behavior was dropped when he retired. Trump-Barry, President Donald Trump’s sister, resigned as a federal appellate judge in April, ending a probe into whether she violated judicial conduct rules by participating in the Trump family’s alleged tax fraud schemes. When Kavanaugh rose to the Supreme Court, sexual assault and perjury complaints against him were dismissed. “The basic premise of our legal system is that every person is treated equally in the eyes of the law ― including judges,” Warren said on Monday. “Our judiciary only functions properly when it lives up to this promise, and it risks eroding its legitimacy when the American people lose faith that judges are ethical and fair-minded.” Warren also unveiled several proposals she hasn’t mentioned publicly before. They include prohibiting judges from deciding for themselves whether they should recuse themselves from a case due to conflict of interest; requiring Supreme Court justices to give written explanations of their decisions when a party asks for a recusal; and giving strong disciplinary tools to judicial ethics watchdogs, such as allowing them to take away nonvested pension benefits from judges. Warren’s plan also proposes extending the Code of Conduct for United States Judges to the Supreme Court, which is currently not covered by such guidelines. Explaining the need for this provision, Warren cited the 83 ethics complaints lodged against Kavanaugh that were dismissed upon his confirmation to the Supreme Court, as well as the lack of action after Supreme Court Justice Clarence Thomas failed to disclose payments his wife received from a conservative judicial activist group. “Because the Supreme Court is not covered by a Code of Conduct, no procedure exists to file new complaints” against Kavanaugh, Warren said. She added that “questions are often raised about the behavior of Supreme Court Justices, such as Justice Thomas’s 13 years of financial disclosures that failed to list $690,000 in payments to his wife from the Heritage Foundation, a right-wing judicial activist group ― but these actions are beyond the scope of current rules.” Such lack of oversight, Warren said, has gone on for long enough. “These changes will not only allow us to ensure accountability for bad actors, including reopening inquiries into the conduct of offenders like Brett Kavanaugh,” she wrote. “They will also hold the vast majority of judges who act in good faith to the highest ethical standards, and in the process, begin to restore accountability and trust in a fair and impartial federal judiciary.” Warren’s plan comes almost exactly a year after the Senate voted 50-48 to confirm Kavanaugh to the Supreme Court, following explosive allegations that he sexually assaulted at least three women when he was younger.",
      "date": "10/07/2019 09:00 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Kate McKinnon’s Elizabeth Warren Fakes Horror That Billionaires Don’t Like Her On ‘SNL’",
      "url": "https://search.huffpost.com/click/_ylt=Awr9ImhIqatdPXgAp09sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559880/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fkate-mckinnon-snl-elizabeth-warren-weekend-update_n_5d997d18e4b03b475f9a7962/RK=2/RS=Zg0IvBDmK6CTZcJ__dMbU4vyrUc-",
      "subtitle": "“I’m going to tell them the same thing my grandson told me when he took me to ‘Avengers: Infinity War’ — ‘This ain’t for you.’”",
      "author": "Mary Papenfuss",
      "content": " Kate McKinnon turned on her most charming Elizabeth Warren for an appearance by her inner senator and Democratic presidential candidate on “Weekend Update.” “Warren” was so very upset — not — when informed by host Colin Jost that big-money donors would rather back Donald Trump. “You’re kidding me,” she said in mock horror on the “Saturday Night Live” segment. “What? The billionaires don’t like me? Oh no!” She added: “I’m going to tell them the same thing my grandson told me when he took me to ‘Avengers: Infinity War’ — ’This ain’t for you.’” Then again, McKinnon said snidely, “taking big checks from Wall Street worked out great for the last lady running for president.” Asked about two right-wing conspiracy theorists’ report that she had a paid bondage relationship with a 20-something Marine, McKinnon smiled and said sarcastically: “That’s Elizabeth’s Warren’s vibe for sure.” But “if you think I’m in a room with a veteran and I don’t immediately thank him for his service and then make sure he’s getting his VA benefits, you’re insane,” McKinnon added. Check it out above.",
      "date": "10/06/2019 02:44 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Elizabeth Warren Visits Michigan’s Most Polluted ZIP Code",
      "url": "https://search.huffpost.com/click/_ylt=Awr9ImhIqatdPXgApU9sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559880/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fwarren-environment-detroit-pollution_n_5d9baf5fe4b099389805038f/RK=2/RS=RrEEcKzD7JwKJHm99uNQJohEXsE-",
      "subtitle": "The Massachusetts senator toured an area visited three times by former fellow presidential candidate Jay Inslee, whose climate policy she has adopted.",
      "author": "Alexander C. Kaufman",
      "content": " Democratic presidential candidate Elizabeth Warren visited Michigan’s most polluted ZIP code for the first time last week. The Massachusetts senator toured a community center and a school in the 48217 ZIP code in southwestern Detroit, where playgrounds sit sandwiched between the Great Lake State’s only oil refinery and car manufacturing plants. Rep. Rashida Tlaib (D-Mich.) guided the Sept. 29 visit, of which the campaign shared video with HuffPost. “What’s that smell?” Warren says at the start of the video, turning to Tlaib in the backseat of an SUV. “That’s what my people smell every day,” the congresswoman says. “I thought the smell was normal. I really did. I didn’t realize that it was killing us.” Just as gobbling fatty snacks at the Iowa State Fair is a rite of passage for top-tier presidential hopefuls, a pilgrimage to the 48217 is now becoming a touchstone for any contender who wants to be taken seriously on the nation’s environment. Warren, citing a packed scheduled, passed on a chance to visit the area in July, when community activists invited all 20 candidates participating in the second round of Democratic primary debates in Detroit. Of the three who agreed to come ― former Rep. Beto O’Rourke of Texas, former Housing and Urban Development Secretary Julian Castro and Washington Gov. Jay Inslee ― only Inslee, then running as the race’s long-shot climate candidate, showed up. It was Inslee’s third time in the 48217. Warren, a potential front-runner for the Democratic nomination, said she’d adopt much of Inslee’s book-length stack of climate proposals when the Evergreen State governor dropped out to run for reelection at home in August. Now she’s covering the same ground, visiting the kind of frontline community that could lend her credibility as her campaign courts older Black voters, a key demographic to winning the nomination. The area, crisscrossed by highways and choked by air emissions, made a powerful backdrop for Warren just days after releasing a meaty proposal to restore union membership. The policy outline came out just as the United Auto Workers union was preparing for a long-haul strike against Detroit giant General Motors. After photographing legally questionable flaring ― when excess gas is vented into the air and burned ― at the Marathon Petroleum Corp. refinery next door to the Kemeny Recreation Center, Warren drove by Salina Elementary School, where Tlaib says officials only recently installed air filtration systems to protect students from cancer-causing particulate matter spewed from the neighboring AK Steel plant. “These big corporations have enough muscle with the government that they squeeze it to get tax breaks. So the cost of running these schools and keeping these roads paved fall disproportionately on you,” Warren says to a trio of activists. “So you’re not only paying the cost in terms of what you breathe, what your children breathe, your bodies ― you’re also paying the cost out of pocket.”",
      "date": "10/08/2019 05:45 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Trump Impeachment Crisis Tees Democratic Candidates Up For Chaotic Fall",
      "url": "https://search.huffpost.com/click/_ylt=Awr9ImxhqatdT74AFOdsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559905/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fdemocratic-candidates-impeachment-trump-chaotic-fall_n_5da1c6b8e4b02c9da04b114d/RK=2/RS=GUhp6N4iXxuosw7yFipH_rDEr70-",
      "subtitle": "The Democratic presidential race had largely been static through the summer.",
      "author": "",
      "content": "WASHINGTON (AP) — A Democratic presidential race that had been largely static through the summer has tumbled into a chaotic fall, shaped by unpredictable events and the deepening impeachment crisis surrounding President Donald Trump. Less than four months before voting begins, front-running candidates are facing urgent questions about their ability to challenge Trump, prompted by a health scare for Sen. Bernie Sanders, an uneven response by Joe Biden to the president’s efforts to tie him to the impeachment inquiry and nagging questions about liberal Sen. Elizabeth Warren‘s electability. Lower-tier candidates are struggling just to be heard. The uncertainty is heightening anxieties among Democrats desperate to defeat Trump in 2020. Although impeachment could imperil Trump’s presidency, the process has also highlighted Trump’s skill at discrediting his opponents, sometimes with baseless conspiracy theories. And Democrats appear no closer to sorting out what tactics, what ideology and what person is best-suited to overcome that. Progressive candidates like Sanders and Warren are surging in fundraising and drawing support from a wide swath of voters, according to polls, but face opposition from moderates who question whether now is the time to start the kind of sweeping — and divisive — economic and societal reforms they are pushing. It’s a concern some moderates say has only increased against the backdrop of impeachment. “The divisions we have in the country threaten the health and stability of our democracy. President Trump has fractured so many norms,” former Iowa Gov. Tom Vilsack said in an interview. “Like a patient getting over an illness or injury, we have to first heal the nation’s divisions and reestablish our norms before we have the needed strength to successfully embrace and implement an array of big ideas.” Vilsack, a longtime friend of Biden’s, has not endorsed anyone in the 2020 race. He’s been courted by, and consulted with, numerous candidates, and has spoken regularly with Warren. The Massachusetts senator has energized voters with a menu of detailed policy proposals, a folksy, relatable way of explaining them and a swell of small-dollar donations that brought in more than $24.6 million in the most recent quarter. That’s increasingly turning her into a target for candidates who see her calls for overhauling health care and rebalancing wealth in America as outside the mainstream. Pete Buttigieg, the mayor of South Bend, Indiana, who is trying to break into the upper rung, has focused in particular on Warren’s health care plan, the Sanders’-authored “Medicare for All” single-payer system that Buttigieg describes as a “my-way-or-the-highway approach.” But it’s more than the policy Buttigieg is arguing against. “We have to be able not only to thrill a debate audience or a Twitter following but actually make something happen, which tells us that having the smartest policy is only half the battle when it comes to what will actually make a difference,” Buttigieg said in an interview. For now, Warren advisers are happy to have Sanders still in the race to help absorb those blows rather than becoming the sole target of the attacks. “Politically, it’s good for Warren and Sanders to have each other in the race,” said Adam Green, co-founder of the Progressive Change Campaign Committee. “They bolster each other’s ideas.” The confidence Sanders’ campaign felt last week after announcing a $25.3 million haul in the third quarter — the highest in the race — was lessened after the 78-year-old senator suffered a heart attack. He told reporters this week that he planned to scale back his campaign, then said he had misspoken. He’ll return to the campaign on Tuesday for a debate in Ohio. His advisers privately acknowledge that the timing of the heart attack — which came just as the impeachment inquiry was escalating — may have helped limit the political fallout because attention was focused elsewhere. But they also understand that he will have to more directly address lingering health concerns. Jeff Weaver, Sanders’ chief strategist, dismissed any long-term concerns, noting that the 2020 contest includes several older candidates, including the 73-year-old Trump. “There are a number of older candidates in the race, including the sitting president of the United States, and I can tell you with confidence, there’s only one we can say with assurance whose arteries are completely open,” Weaver said, referencing the stent procedure designed to clear Sanders’ clogged arteries. Biden, 76, stands as the strongest obstacle to Warren and Sanders, fundamentally opposed on policy and pitching a more conciliatory approach to governing. The former vice president was already facing questions about whether he was out of step with the party’s activist liberal base and up for the challenge of taking on Trump before he got pulled into the impeachment inquiry, which centers on Trump’s push for Ukraine to investigate the former vice president and his son. Although Trump’s allegations against Biden are so far without foundation, the president and his allies have aggressively pressed the charges. Biden responded forcefully this week, but only after days of hand-wringing among supporters and advisers who worried he appeared ill-prepared for combatting the kind of asymmetrical political warfare at which Trump excels. Still, Biden backers contend that the mere fact that Trump has appeared focused on trying to take down Biden allows the former vice president to strengthen his electability argument by previewing what a one-on-one race with the president would look like. “He’s able to go out there every day and make this Biden vs. Trump argument,” said John Anzalone, a pollster for Biden. That’s the fear for some lower-tier candidates — that the head-to-head fight between Trump and Biden, and the grassroots support of Warren and Sanders, block out their opportunities for a late surge. Everyone is at risk, including those who have had flashes of success in recent months but are now languishing in the single digits in many polls, including California Sen. Kamala Harris, former Rep. Beto O’Rourke and New Jersey Sen. Cory Booker. Buttigieg said there is no secret strategy for those candidates seeking to break out during this intense fall stride toward the first votes other than engaging in a “respectful and robust” debate of ideas. “Where there’s an important difference, people need to understand that,” he said.",
      "date": "10/12/2019 08:47 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Elizabeth Warren Defends Pregnancy Discrimination Story",
      "url": "https://search.huffpost.com/click/_ylt=Awr9ImxhqatdT74AEudsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559905/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2felizabeth-warren-defends-pregnancy-discrimination-story_n_5d9e0b71e4b04e4e9a35928e/RK=2/RS=EfMG4gaEiXelXp_LlPEy2r76pc4-",
      "subtitle": "null",
      "author": "",
      "content": "",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Elizabeth Warren’s Climate Justice Plan Aims To Keep Water Public, Study Pollution More",
      "url": "https://search.huffpost.com/click/_ylt=Awr9ImxhqatdT74AEOdsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559905/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2felizabeth-warren-environment-climate-justice-plan_n_5d9d02f1e4b06ddfc50ffb77/RK=2/RS=e1V56qNjLZUhLKKzKdwXYPEFGoo-",
      "subtitle": "The Democratic presidential hopeful is adopting much of what former candidate Jay Inslee put out.",
      "author": "Alexander C. Kaufman",
      "content": " Democratic presidential candidate Elizabeth Warren released a sweeping climate justice plan on Wednesday morning, vowing to ramp up research on the health effects of pollution and discourage the transfer of public water services to for-profit companies. The 12-page memo marks the Massachusetts senator’s eighth climate-related proposal since launching a presidential campaign built on an ambitious slate of policy plans at the start of the year. The latest proposal collects much of Warren’s existing ideas on improving racial equity and reducing pollution and reframes them in what looks like an ambitious, nearly 5,900-word blueprint on how to implement a Green New Deal. “Justice cannot be a secondary concern ― it must be at the center of our response to climate change,” Warren wrote in the memo. “The Green New Deal commits us to a ‘just transition’ for all communities and all workers. But we won’t create true justice by cleaning up polluted neighborhoods and tweaking a few regulations at the EPA.” The document borrows heavily from the plan laid out by former climate candidate Jay Inslee, who quit the Democratic presidential primary in August to run for reelection as Washington’s governor, including efforts to quantify pollution inequity between communities and apply that data to decisions on where to invest Green New Deal money. Warren also proposes turning the White House Council on Environmental Quality, a currently sleepy office tasked with coordinating public health policy across federal agencies, into an environmental justice hub. The Warren plan offers fewer wonky details on which agencies should do what work than the Inslee proposal did. But notably included in the senator’s release are calls to increase research funding at the Centers for Disease Control and Prevention and to overhaul drinking water infrastructure, putting an end to the privatization of water delivery. Under her administration, Warren would “fully fund” the CDC’s “environmental health programs, such as childhood lead poisoning prevention, and community health investigations” and would “provide additional grant funding for independent research into environmental health effects.” Her campaign declined to share an exact dollar figure. It’s a relatively novel idea to include the CDC in a campaign climate plan, something the other leading environmental champions in the race have omitted so far. Yet it’s likely to be popular. In February, representatives from four dozen public health groups sent a letter to House lawmakers pleading for an increase in federal funding for the CDC’s “critically underfunded” lead and climate programs. The CDC is the fourth-most favorably viewed federal agency and has some of the most bipartisan support, a Pew Research Center poll found in September. Yet the CDC’s operating budget fell nearly $1 million between the 2018 and 2019 fiscal years. Warren’s plan goes beyond just researching the effects of lead poisoning. Citing the recent lead contaminations in the drinking water of Flint, Michigan, and Newark, New Jersey, she said her administration would “end decades of disinvestment and privatization of our nation’s water system ― our government at every level should invest in safe, affordable drinking water for all of us.” Ramping up federal spending on water infrastructure is a staple of Democratic campaigns at this point, particularly as Newark’s former mayor, now-Sen. Cory Booker (D-N.J.), is running for the presidential nomination. But curtailing the transfer of control of public services from government agencies to private companies is another issue altogether. The private water industry serves 73 million Americans, according to National Association of Water Companies data. For-profit water services put public health at risk, a 66-page paper by University of Louisville law professor Craig Anthony Arnold argues, because the profit motive incentivizes companies to provide better services to customers who pay more and to maintain infrastructure with an eye to the length of the firm’s contract. Detroit’s debt-choked public utility threatened to shut off water to nearly 17,500 households that were behind on bills last year, only to decrease the shutoff rate 70% this year. In the timing of the 2018 shutoffs, just as the city was looking to privatize its utility, the left-wing think tank Centre for Research on Globalization saw an effort to streamline a troubled facility before selling it off to profiteers. Other cities are actively opposing such privatization. Last November, Baltimore became the first big city in the United States to ban water privatization with an amendment to its charter. Wednesday’s proposal did not make clear whether a Warren White House would take explicit steps to discourage municipalities from switching to private water. But the campaign said an influx of federal funding to overhaul water infrastructure should make switching to private water services far less appealing. Income and race are strong indicators of how much pollution exposure Americans can expect to face. Black neighborhoods, on average, have air that’s 48% more polluted than that in white neighborhoods, an NAACP report found last year, and Black Americans are 75% more likely to live in neighborhoods abutting industrial sites. The journal Environmental Research published a study last year that determined Black, Hispanic and poor students face the highest risks of inhaling toxic pollutants in crumbling schools across the country.",
      "date": "10/09/2019 08:00 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Elizabeth Warren Takes Facebook’s Ad Policy, Fires It Back At Zuckerberg And Trump",
      "url": "https://search.huffpost.com/click/_ylt=Awr9ImxhqatdT74ADudsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559905/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2felizabeth-warren-facebook-ad-zuckerberg-trump_n_5da19852e4b02c9da04adb70/RK=2/RS=vnsbpRR_5HxNPCVq4bdAHG8Ebpc-",
      "subtitle": "With her new ad, the Democratic presidential candidate is playing the platform’s game — to her own advantage.",
      "author": "Lee Moran",
      "content": " Sen. Elizabeth Warren (D-Mass.) is taking advantage of Facebook’s rules to prove a point about the social network’s refusal to ban posting false ads and statements from politicians. The Democratic presidential candidate is running an ad that begins with “breaking news” that then goes on to make the (fake) claim that the company and its CEO Mark Zuckerberg “just endorsed Donald Trump for re-election” in 2020. Check it out here: “You’re probably shocked, and you might be thinking, ‘how could this possibly be true?’” Warren’s ad continues. “Well, it’s not. (Sorry.) But what Zuckerberg *has* done is given Donald Trump free rein to lie on his platform ― and then to pay Facebook gobs of money to push out their lies to American voters.” “If Trump tries to lie in a TV ad, most networks will refuse to air it. But Facebook just cashes Trump’s checks,” it adds. “Facebook already helped elect Donald Trump once. Now, they’re deliberately allowing a candidate to intentionally lie to the American people. It’s time to hold Mark Zuckerberg accountable.” Facebook drew ire this week for refusing to pull an ad that makes false accusations about former Vice President Joe Biden, who is one of Warren’s opponents in the Democratic presidential nominating contest. The platform has also faced heavy scrutiny over the role it played in the widespread dissemination of misinformation about candidates including Hillary Clinton during the 2016 election. In audio that leaked last week, Zuckerberg said he was prepared to “go to the mat and ... fight” lawmakers such as Warren who are keen to break up big technology companies. Warren, meanwhile, this week called out Facebook’s “incredible power to affect elections and our national debate” in a lengthy Twitter thread, below: Nick Clegg, the former deputy prime minister of the U.K. who is now Facebook’s vice president of global affairs and communications, said last month that the company didn’t believe “it’s an appropriate role for us to referee political debates and prevent a politician’s speech from reaching its audience and being subject to public debate and scrutiny.” “That’s why Facebook exempts politicians from our third-party fact-checking program. We have had this policy on the books for over a year now, posted publicly on our site under our eligibility guidelines,” he added. “This means that we will not send organic content or ads from politicians to our third-party fact-checking partners for review. However, when a politician shares previously debunked content including links, videos and photos, we plan to demote that content, display related information from fact-checkers, and reject its inclusion in advertisements.”",
      "date": "10/12/2019 06:24 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Trump Lover Flashed Gun At Elizabeth Warren Supporter: Police",
      "url": "https://search.huffpost.com/click/_ylt=Awr9ImxhqatdT74ADOdsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559905/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fjoseph-schumacher-trump-threatened_n_5d9cc938e4b087efdba3bcdb/RK=2/RS=12fSyLOVqVDvv.4T5UZwyD3Xjok-",
      "subtitle": "Police say Joseph Schumacher followed an 18-year-old woman in Moorhead, Minnesota, while harassing her over her Warren bumper sticker.",
      "author": "David Moye",
      "content": " A Donald Trump supporter in Moorhead, Minnesota, was arrested on felony charges Monday after police say he trailed a woman with an Elizabeth Warren bumper sticker on her car and flashed a gun at her. The 18-year-old woman was driving when the suspect, 27-year-old Joseph Schumacher of West Fargo, North Dakota, pulled up next to her in his own vehicle and yelled at her about the bumper sticker, according to a release from the Moorhead Police Department. Wanting to make sure the woman knew where he stood on the political spectrum, Schumacher pointed toward his own pro-Trump bumper sticker while continuing to voice “his difference in national political views,” the statement continued. The harassment continued for a few blocks, Moorhead Police Capt. Deric Swenson told the Minneapolis Star-Tribune. “The victim initially thought it wasn’t going to be serious,” Swenson said. “Then things escalated seriously.” The woman said when Schumacher drove ahead of her, he held up a handgun he had inside his vehicle, according to Valley News Live. The woman then called 911 to report the incident. A short time later, cops found Schumacher, searched his car and found a loaded handgun in the center console, according to The Smoking Gun. Police said a passenger in Schumacher’s vehicle confirmed the story told to them by the victim. Schumacher was arrested on two felony counts of making terroristic threats, as well as misdemeanor weapons charges. He was booked into custody at the Clay County Jail and due in court on Tuesday.",
      "date": "10/08/2019 03:35 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Bless Elizabeth Warren’s Unabashed Love For The Rock And ‘Ballers’: ‘It Is Eye Candy’",
      "url": "https://search.huffpost.com/click/_ylt=Awr9ImxhqatdT74ACudsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559905/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2felizabeth-warren-ballers-the-rock-dwayne-johnson_n_5da0b9dae4b06ddfc5196426/RK=2/RS=TVb3ju_Wmg6mxq9NUo1MqFSRxP4-",
      "subtitle": "The 2020 presidential candidate said star Dwayne “The Rock” Johnson is  \n her “kind of guy!”",
      "author": "Jenna Amatulli",
      "content": " You might think you love something passionately, but we can assure you: You do not love whatever that is as much as Sen. Elizabeth Warren (D-Mass.) loves the HBO show “Ballers.” The 2020 Democratic candidate has been showing her love for the series starring Dwayne “The Rock” Johnson for years now. The pair have been bantering on Twitter, and the show paid homage to Warren by featuring a shot of The Rock reading Warren’s 2017 book “This Fight Is Our Fight” in the August premiere of Season 5. As if the lovefest couldn’t get better, Warren spoke to Entertainment Weekly for an article published Friday about the upcoming finale of the show’s final season and her affection for The Rock. Asked about people surprised she’s a fan of the show, Warren answered: “Why would people be surprised that I like Ballers? It’s got The Rock! What’s not to love?” Later in the interview, she added: “Who doesn’t like The Rock? And I have to say, who doesn’t love The Rock’s wardrobe choices, don’t they just knock you out? Those vests and the pink shirts … Oh man, it is eye candy.” Warren also addressed The Rock’s comments a couple years ago that running for president “would be a great opportunity to help people.” “I would welcome him to the race,” Warren said with a laugh. “I know he would fight for the principles that he believes in — he’s my kind of guy!” “Ballers” airs its finale on HBO on Sunday, Oct. 13.",
      "date": "10/11/2019 02:20 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Elizabeth Warren Drops A Total Zinger About Marriage At LGBTQ Town Hall",
      "url": "https://search.huffpost.com/click/_ylt=Awr9ImxhqatdT74ACOdsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559905/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2felizabeth-warren-lgbtq-town-hall-zinger_n_5d9ff104e4b06ddfc5174b45/RK=2/RS=9bhmOPVmjE44GMJLU5WKiy7rcqA-",
      "subtitle": "The presidential candidate had a sassy response for those who say marriage is between “one man and one woman.”",
      "author": "Josephine Harvey",
      "content": " Sen. Elizabeth Warren (D-Mass.) may as well have dropped the mic Thursday night after delivering a lippy response to a question about traditional views on marriage. Morgan Cox, chair of the Human Rights Campaign board of directors, asked the 2020 presidential candidate how she would respond if an “old-fashioned” supporter approached her on the campaign trail and said: “My faith teaches me that marriage is between one man and one woman.” “Well, I’m going to assume it’s a guy who said that, and I’m going to say, ‘then just marry one woman.’ I’m cool with that,” Warren fired back. “Assuming you can find one.” The audience erupted with cheers and laughter: In response to a follow-up question from CNN moderator Chris Cuomo, Warren said that, despite growing up in a conservative household, she couldn’t really recall a time where she felt differently about same-sex marriage. She cited the lyrics of a song she learned in church: “They are yellow, black and white. They are precious in his sight Jesus loves all the children of the world.” She said that, although her exposure to same-sex couples was gradual during her upbringing in Oklahoma, the hatefulness that could be directed at the gay community shocked her, particularly from people of faith. Warren also tackled how Democrats could expect to pass the Equality Act, medical care for transgender people in the military and correctional facilities, cost-reduction for HIV medications, and decriminalizing HIV transmission, among other topics. She had just released a wide-ranging LGBTQ policy plan Thursday morning.",
      "date": "10/11/2019 12:11 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Sanders, Warren Blast Joe Biden In First Major Clash Of Front-Runners",
      "url": "https://search.huffpost.com/click/_ylt=Awr9ImxhqatdT74ABudsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559905/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fbernie-sanders-elizabeth-warren-joe-biden-clash-ohio-debate-2020-democratic-presidential-primary_n_5da68b0de4b002e33e76ee03/RK=2/RS=p0OtzU0Zx1uI22Uh.Cs6IFyGV2o-",
      "subtitle": "The two progressive candidates tried to poke holes in the former vice president’s self-styled image as a pragmatist at the Democratic presidential debate.",
      "author": "Daniel Marans",
      "content": " More than two-thirds of the way into the Democratic presidential debate on Tuesday night, former Vice President Joe Biden took a casual swipe at his rivals without specifying whom he was speaking about exactly. “We can’t be running any vague campaigns. We’ve got to level with people,” Biden said. “I’m going to say something that is probably going to offend some people here, but I’m the only one on this stage who has gotten anything really big done.” When a CNN moderator pressed Biden to clarify which candidates he thought were being vague, he pointed first to his left at Sen. Elizabeth Warren (D-Mass.) and then to his right, at Sen. Bernie Sanders (I-Vt.), claiming they were both obfuscating about the cost of “Medicare for All.” What happened next was the most direct and contentious exchange among the three candidates ― the septuagenarian trio leading in the public polls ― thus far in the primary. Sanders and Warren both took Biden to task for what they argued were either policy mistakes that hurt ordinary people or exaggerations of his role in the passage of positive reforms. Sanders began by seizing on Biden’s insistence that he alone had shepherded “anything really big” into law. He drew a no-holds-barred contrast with Biden’s record on war, trade and bankruptcy reform, aiming to expose him as a false populist. “Joe, you talked about working with Republicans and getting things done. But you know what you also got done? And I say this as a good friend ― you got the disastrous war in Iraq done,” Sanders said. “You got a bankruptcy bill, which is hurting middle-class families all over this country, you got trade agreements, like NAFTA, PNTR with China done, which have cost us 4 million jobs.” Sanders and Biden subsequently had a brief back-and-forth about Medicare for All, with Biden insisting that adopting a single-payer system was not necessary for achieving universal coverage. Then it was Warren’s turn to answer Biden’s implicit charge that she is vague and impractical. She focused on her brainchild: the Consumer Financial Protection Bureau, part of the Dodd-Frank Wall Street reform law. “Following the financial crash of 2008, I had an idea for a consumer agency that would keep giant banks from cheating people. And all of the Washington insiders and strategic geniuses said, ‘Don’t even try because you will never get it passed,’” she recalled. “And sure enough, the big banks fought us, the Republicans fought us, some of the Democrats fought us. But we got that agency passed into law.” Warren promised to leverage her knowledge from that fight to use every lever in her power as president, including executive actions, to enact “structural reform.” “I know what we can do by executive authority, and I will use it,” she said. “In Congress, on the first day, I will pass my anti-corruption bill, which will beat back the influence of money and repeal the filibuster.” Biden tried to share in the credit for passing the law that created the CFPB. “I agreed with the great job she did, and I went on the floor and got you votes. I got votes for that bill!” he declared. “I convinced people to vote for it, so let’s get those things straight, too.” Warren wasn’t having it. “I am deeply grateful to President Obama, who fought so hard to make sure that agency was passed into law, and I am deeply grateful to every single person who fought for it and who helped pass it into law,” she responded, notably omitting Biden’s name. Amanda Terkel and Molly Redden contributed reporting.",
      "date": "10/15/2019 11:43 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    },
    {
      "title": "Read Live Updates From The 4th Democratic Presidential Debate",
      "url": "https://search.huffpost.com/click/_ylt=Awr9ImxhqatdT74ABOdsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559905/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fdemocratic-debate-cnn-new-york-times_n_5da60d95e4b062bdcb19cd92/RK=2/RS=h5Qw9AhtxCcUcnCmt5Z36AnRB3I-",
      "subtitle": "Twelve candidates face off in the largest presidential primary debate in American history.",
      "author": "Paige Lavender",
      "content": " Twelve 2020 Democratic presidential hopefuls face off Tuesday at a debate hosted by CNN and The New York Times. The debate can be streamed live at CNN’s website. The debate, taking place at Otterbein University in Westerville, Ohio, will feature the following candidates: Former Vice President Joe Biden New Jersey Sen. Cory Booker South Bend, Indiana, Mayor Pete Buttigieg Former Housing and Urban Development Secretary Julián Castro California Sen. Kamala Harris Minnesota Sen. Amy Klobuchar Former Texas Rep. Beto O’Rourke Vermont Sen. Bernie Sanders Massachusetts Sen. Elizabeth Warren Entrepreneur Andrew Yang Hawaii Rep. Tulsi Gabbard Billionaire philanthropist Tom Steyer The winner of the Democratic primary is expected to face President Donald Trump in the general election. Read live updates on the debate below. (You may need to refresh the page to see the latest updates.) 11:08 p.m. ET And that’s a wrap for the fourth Democratic presidential primary debate. Thanks for following along, and be sure to check out even more coverage on HuffPost. ― Paige Lavender 11:02 p.m. ET Also missing tonight: Questions on immigration. ― Sarah Ruiz-Grossman 10:54 p.m. ET Sanders and Castro both mentioned homelessness of their own accord, but there were no questions tonight about affordable housing. The lack of affordable housing is a nationwide crisis. On a given day in January 2018, more than 500,000 people were homeless in the U.S. Trump went on a tear last month about homelessness in California, which has one of the highest rates of homelessness in the U.S., and complained about how people living in tents were ruining the “prestige” of San Francisco and Los Angeles. ― Sarah Ruiz-Grossman 10:53 p.m. ET Klobuchar says her most surprising friendship was with the late Republican Sen. John McCain, whom she says she misses “every day.” She shares a quote from him: “There is nothing more liberating in life than fighting for a cause larger than yourself.” ― Nina Golgowski 10:50 p.m. ET Castro says he agrees with Ellen DeGeneres’ message of practicing kindness but that he also believes we should hold people accountable for what they have done. “I think we can do both things,” he says. ― Nina Golgowski 10:47 p.m. ET The final question of the night is about... Ellen DeGeneres? She caused a stir last week after being spotted palling around with former President George W. Bush at an NFL game. She was criticized for joking with Bush, and then fiercely defended her friendship with him on her show. Despite the cultural relevance, it feels like a weird question to end a debate that had zero questions about climate change. ― Paige Lavender 10:44 p.m. ET Biden accuses Warren of pursuing vague ideas. Warren responds by touting the Obama administration’s push for the consumer protection agency she recommended. “I convinced people to vote for it,” Biden says to Warren, who then thanks Barack Obama. Biden interjects, telling Warren she did a “hell of a job at your job.” “Thank you,” Warren replies ― coolly. ― Ja’han Jones 10:42 p.m. ET Warren and Sanders make the pitch for their “bold” policy plans over more centrist reform policies. Warren says: “People who are struggling to pay health care are fighting today. ... People who are getting stopped by police because of the color of their skin are in a fight today. ... Anybody who doesn’t understand that Americans are already in these fights is not in a position to win them.” Sanders says: “We need bold action if we’re gonna save this planet. … The way you win an election in this time in history is not with the same old, same old.” ― Sarah Ruiz-Grossman 10:33 p.m. ET Biden tries to tout his accomplishments, saying, “I’m the only one on this stage who has actually gotten anything really big done.” Sanders is not having it. “You know what you also got done? ― and I say this as a good friend ― you got the disastrous war in Iraq done,” Sanders says. ― Paige Lavender 10:32 p.m. ET In response to a rare debate question about packing the Supreme Court, Biden and Castro say they would not pack the court and Buttigieg floats the idea of term limits for justices. ― Sarah Ruiz-Grossman 10:29 p.m. ET Harris, Booker, Gabbard, Biden and Warren all say they would codify Roe v. Wade to protect reproductive rights. It’s pointed out that they’re in Ohio, one of several states that has banned abortions after just six weeks into pregnancy — policies that Booker likens to “people trying to punish poverty,” considering how wealthier women typically have the means to circumvent state abortion bans. ― Sara Boboltz 10:23 p.m. ET For the first time this primary season, the moderators ask a question about abortion and reproductive rights. ― Paige Lavender 10:21 p.m. ET Yang, on data rights, says, “Right now our data is worth more than oil.” He questions when Americans received an actual check in the mail for it. ― Nina Golgowski 10:16 p.m. ET Harris urges her fellow contenders to “join” her in calling for Trump to be removed from Twitter. Read more on her calls for the company to suspend the president’s account. ― Sarah Ruiz-Grossman 10:14 p.m. ET Steyer touts his business success as an advantage over Trump in 2020. He says Democrats need a candidate who can show Trump to be “a failure as a businessperson, and a fraud and a failure as a steward of the American economy.” ― Ja’han Jones 10:12 p.m. ET Booker, speaking as “the only vegan on the stage,” argues against questioning any of the Democratic candidates about their health, saying Trump is the unhealthiest person running for president in 2020. ― Paige Lavender 10:11 p.m. ET Yang criticizes Warren’s plan to break up giant tech companies such as Google in the name of enforcing antitrust laws. He says political leaders “have to be realistic that competition doesn’t solve all the problems.” Then, a zinger: “There’s a reason nobody’s using Bing today. Sorry, Microsoft, but it’s true. So it’s not like breaking up these big tech companies will revive Main Street businesses across the country.” ―  Sara Boboltz 10:08 p.m. ET Gabbard, a 38-year-old military combat veteran, would be the youngest president, if elected. When asked about it, she argues that it’s “not fair” to question the oldest three candidates about their health and fitness and not the other candidates. ― Nina Golgowski 10 p.m. ET Front-runners Biden, Sanders and Warren were all asked questions about their age. Biden says, “One of the reasons I’m running is because of my age and my experience,” and points to his yearslong record in the Obama White House and the “wisdom” that comes with years. Warren comes out strong: “I will out-work, out-organize and out-last anyone ― and that includes Donald Trump or whoever the Republicans get stuck with.” ― Sarah Ruiz-Grossman 9:58 p.m. ET As O’Rourke talks about medical marijuana’s potential to help alleviate Americans’ dependence on opioid medications, Yang offers some commentary. “Yes! Preach, Beto!” he shouts, turning his gaze up to the ceiling. ― Sara Boboltz 9:57 p.m. ET When asked about his recent heart attack, Sanders insists he’s healthy and invites people to an upcoming rally. He thanks people for their prayers and well-wishes while he was hospitalized. ― Paige Lavender 9:55 p.m. ET O’Rourke agrees with Yang on decriminalizing opioid use and touts medical marijuana as an alternative treatment for patients. Here’s more from O’Rourke’s plan on legalizing marijuana nationwide and what weed company owners in Oakland, California, told him last month about his plan. ― Sarah Ruiz-Grossman 9:52 p.m. ET Steyer and Yang both blame big corporations and a lack of oversight from the government for the opioid crisis. Yang goes a step further, arguing safe injection sites should be open around the country and opioid addicts should be referred to counseling and rehab instead of prison. He also repeats an argument he’s made before that opiates should be decriminalized for personal use. ― Paige Lavender 9:48 p.m. ET Klobuchar says the people who should pay for treatment for those affected by the opioid epidemic are the people “who got them hooked and killed in the first place.” ― Nina Golgowski 9:46 p.m. ET Castro brings Atatiana Jefferson into the gun violence debate, saying, “Police violence is also gun violence, and we need to address that.” Read more about the officer, who has been charged with murder. ― Sara Boboltz 9:44 p.m. ET Booker and Harris assume roles they’ve assumed in previous debates, speaking ― solitarily ― about gun violence as it relates to Black communities, which experience gun death disproportionately. “The leading cause of death of young Black men in America is gun violence,” Harris says. ― Ja’han Jones 9:41 p.m. ET Booker, Buttigieg and O’Rourke go at it again on gun control, with O’Rourke arguing for a mandatory assault weapons buyback and Buttigieg responding to O’Rourke: “I do not need lessons from you on courage ― political or personal.” Booker jumps in to mention the issue of everyday gun violence. Read more from their arguments online earlier this week. ― Sarah Ruiz-Grossman 9:39 pm. ET Klobuchar, addressing foreign interference in our elections, highlights her Honest Ads Act that would prohibit social media companies from running paid political ads without disclosing the sponsor. She adds that paper ballots need to be available in every voting precinct. ― Nina Golgowski 9:38 p.m. ET Proving that women can tell corny jokes, too, Klobuchar cracks one about foreign interference in the 2016 election: “This wasn’t ‘meddling.’ That’s what I do when I call my daughter on a Saturday night and ask her what she’s doing.” She adds: “Sorry.” ― Sara Boboltz 9:34 p.m. ET O’Rourke dodges a question about how he would enforce a mandatory gun buyback, an idea he floated in the last presidential debate. “I expect my fellow Americans to follow the law,” he says, arguing “we don’t go door to door” to enforce any law in the U.S. He argues certain weapons should be considered “too dangerous to sell,” and by that logic, “too dangerous to own.” ― Paige Lavender 9:28 p.m. ET O’Rourke says: Because the U.S. turned its back on the Kurds, “it makes it more likely that we will have to send another generation of soldiers to fight our battles there.” ― Nina Golgowski 9:25 p.m. ET Castro says Trump has made a “total disaster in Syria.” He also draws a line between what’s happening there and the Trump administration’s border policies. “This president is caging kids on the border and letting ISIS prisoners run free,” he says. ― Paige Lavender 9:24 p.m. ET Harris on Trump’s volatility in the middle east: “Dude gotta go, and when I’m commander in chief we will stop this madness.” ― Ja’han Jones 9:23 p.m. ET Several of the candidates call out Trump for reversing yearslong policy by withdrawing troops from Syria, saying it sends a signal to allies that the U.S. can’t be trusted. Buttigieg, who served in the military, says when he was deployed, one of the things “keeping me safe” was that the U.S. flag on his uniform was trusted. Sanders says: “What country in the world will trust the word of the United States?” ― Sarah Ruiz-Grossman 9:19 p.m. ET A few moments later, Gabbard (a veteran) tries to get Buttigieg (another veteran) to say he supports endless wars, as he shakes his head and visibly sighs. The mayor responds: “What we were doing in Syria is keeping our word. Part of what gets people to put their lives on the line to work with us is to stand by our word.” ― Sara Boboltz 9:17 p.m. ET Gabbard addresses conflict in the Middle East, taking time to call claims she is a “Russian asset” and Bashar Assad apologist “completely despicable.” After saying both parties are responsible for the conflict in the region, Gabbard vows to end U.S. involvement in “regime change.” ― Ja’han Jones 9:13 p.m. ET Biden says Trump withdrawing troops from Syria is the “most shameful thing” he’s ever seen in foreign policy. “This is shameful, shameful what this man has done,” Biden says. Read more about Trump’s decision and reactions to it. ― Sarah Ruiz-Grossman 9:10 p.m. ET Steyer’s campaign releases a statement arguing that he was the first presidential candidate to call for a wealth tax ― back in October of 2018. “Under my own proposal,” he says, “I would pay more than an additional $10 million annually in taxes and have also called for closing the carried interest tax loophole.” ― Nina Golgowski 9:06 p.m. ET Castro makes the second mention of homelessness of the night, saying he’s visited homeless people in Las Vegas who are sleeping “in the shadows of hotels worth hundreds of millions of dollars.” Here’s a look at his visit to homeless encampments in Oakland, California, last month. ― Sarah Ruiz-Grossman 9:05 p.m. ET Booker chimes in with a call for unity: “Tearing each other down because we have a different plan, to me, is unacceptable.” ― Sara Boboltz 9:03 p.m. ET Yang criticizes Warren for her plan to tax wealth, arguing that a value-added tax ― similar to ones implemented in Germany and Denmark ― are more suitable for the United States. “If we give the American people a tiny slice of every Amazon sale, every Google search,” he says, billions of dollars will be funneled to them. ― Ja’han Jones 9:01 p.m. ET “The rich are not like you and me,” Warren says, noting that a wealth tax would yield more than an income tax. (She plans to introduce a wealth tax.) “The really, really billionaires are making money off their accumulated wealth, and it just keeps growing. ... I think that as democrats we will succeed when we dream big and fight hard.” Klobuchar has harsh words for Warren in response, slamming her rival’s progressive, detailed policies. “I think simply because you have big ideas doesn’t mean that you’re fighting for regular people,” Klobuchar says. ― Sara Boboltz 8:59 p.m. ET Harris touts her proposed tax credits for lower-income Americans as a solution to poverty and income inequality. She mentions her single mother who raised her and her sister, saying she would put them to bed and then “sit up at the kitchen table trying to figure out how to make it all work.” ― Sarah Ruiz-Grossman 8:52 p.m. ET Sanders talks about the need to raise taxes on billionaires, saying it’s an “outrage” that a handful of the richest Americans make more than the bottom one-third of Americans. He also makes the first mention of homelessness on stage tonight, lamenting the “half a million Americans sleeping out on the street today.” Steyer then chuckles when the moderator points out he’s the only billionaire on the stage. “There have been 40 years when corporations have bought this government,” Steyer says. “The results are as shameful as Senator Sanders says. It’s absolutely wrong, and it’s absolutely undemocratic and unfair.” He then touts his wealth tax. Warren jumps in. “Why does everyone on this stage think it’s more important to protect billionaires than to invest in an entire generation of Americans?” she asks. ― Sarah Ruiz-Grossman and Sara Boboltz 8:48 p.m. ET General Motors, whose workers are currently striking in the biggest auto industry work stoppage in decades, prompts a discussion about unions and living wages. HuffPost’s Dave Jamieson has more on the GM strike here. ― Paige Lavender 8:46 p.m. ET Booker takes a swipe at Yang’s universal basic income platform, saying it’d be better to raise the minimum wage and put “the dignity back in work.” ― Nina Golgowski 8:43 p.m. ET Castro, like Sanders, says he would create jobs by investing in infrastructure and a Green New Deal. ― Nina Golgowski 8:41 p.m. ET Warren reiterates her argument that corporate greed, not automation, is the leading cause of job loss in the U.S. She argues for greater worker representation on corporate boards and stronger unions. ― Ja’han Jones 8:39 p.m. ET Booker quotes Yogi Berra and says he’s “having deja vu all over again” listening to his peers debate health care and Hunter Biden. He also argues women shouldn’t be the only ones fighting for reproductive rights. ― Paige Lavender 8:38 p.m. ET Sanders vows to put Americans to work by fixing infrastructure, hiring more teachers, canceling student debt, and creating 20 million jobs through his proposed Green New Deal. ― Nina Golgowski 8:36 p.m. ET Harris jumps into the fierce debate on health care to call attention to the issue of women’s reproductive health. She says there has been “not nearly one word” on the topic during previous debates, even as there is a “full-on attack” on abortion access in some states. “Poor women, women of color will die. … People need to keep their hands off of women’s bodies and let women make the decisions about their own lives,” Harris says, to loud cheers. ― Sarah Ruiz-Grossman 8:29 p.m. ET Sanders hits back amid a fierce debate on stage on “Medicare for All”: “As somebody who wrote the damn bill … premiums are gone, co-payments are gone, deductibles are gone. ... The overwhelming majority of people will save money on their health care bills.” He also adds that “it is appropriate to acknowledge that taxes will go up.” ― Sarah Ruiz-Grossman 8:27 p.m. ET Buttigieg, taking his first swipe at Warren over her support for “Medicare for All,” says the senator has a plan for everything except how to pay for her health care bill. ― Ja’han Jones 8:26 p.m. ET Asked to clarify whether her health care plan will raise taxes for the middle class, Warren says she won’t sign a bill into law “that does not lower costs for middle-class families.” “Costs will go up for the wealthy and big corporations; for hardworking middle-class families costs will go down,” she says. ― Paige Lavender 8:23 p.m. ET Biden answers a question on his son Hunter’s business dealings with Ukraine while Biden was vice president. (The moderator notes there was no evidence of wrongdoing.) “Look, my son did nothing wrong. I did nothing wrong,” Biden says, adding that the issue should be “Trump’s corruption ― that’s what we should be focusing on.” He points repeatedly to statements Hunter Biden made earlier on Tuesday. ― Sarah Ruiz-Grossman 8:19 p.m. ET During his first remarks, O’Rourke praises Gabbard and Buttigieg for serving in the military. ― Paige Lavender 8:18 p.m. ET Yang says he supports impeachment but argues Democrats are losing “when we’re talking about Donald Trump” instead of discussing policies the candidates hope to advance. ― Ja’han Jones 8:17 p.m. ET Buttigieg, on impeachment, says that “presidents 10 years or 100 years from now will look back on this moment to see whether the president is above the law.” He adds, though, that he’s running to unify the country. ― Sara Boboltz 8:16 p.m. ET Gabbard, the only member of the House on tonight’s debate stage, says if the Senate doesn’t vote to impeach Trump he will feel “exonerated.” ― Nina Golgowski 8:15 p.m. ET Warren: “Impeachment is the way that we establish that this man will not be permitted to break the law over and over without consequences.” Sanders: “I look forward to not only a speedy and expeditious impeachment process, but Mitch Mcconnell has got to do the right thing and allow a free and fair trial in the Senate.” ― Nina Golgowski 8:14 p.m. ET Klobuchar mentions some of Trump’s recent controversies, saying she’d like to know how abandoning Kurdish allies and asking the Ukrainian president to investigate Biden will “make America great again.” ― Paige Lavender 8:13 p.m. ET Harris says Trump has “committed crimes in plain sight.” “On this issue with Ukraine, he’s been selling out our democracy. ... I don’t think this impeachment process is gonna take very long, because as a former prosecutor, I know a confession when I see it.” — Sarah Grossman 8:12 p.m. ET Booker on impeachment: “This must be fair” and must be about “patriotism, not partisanship.” — Ja’han Jones 8:10 p.m. ET MarianWilliamson would like to remind everyone she’s still in the race. — Sara Boboltz 8:06 p.m. ET Warren on impeachment: “Sometimes there are issues that are bigger than politics and I think that’s the case with this impeachment inquiry. ... No one is above the law, and that includes the president of the United States.” — Sarah Ruiz-Grossman 8:03 p.m. ET The candidates are all officially on the stage and the debate has begun. — Sara Boboltz",
      "date": "10/15/2019 07:06 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Elizabeth_Warren"
      }
    }
  ]
}