{
  "articles": [
    {
      "title": "After Taking Presidential Corruption To New Heights, Trump Calls Everyone Else Corrupt",
      "url": "https://search.huffpost.com/click/_ylt=AwrTLYhbqKtdMB4A7RxsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559643/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2ftrump-corruption-projection_n_5da8bae5e4b034f1d69f56ac/RK=2/RS=lm7lUtRuZe5hbbEDcZwutWQN61o-",
      "subtitle": "Trump has called Democratic leaders, the news media, former President Barack Obama and the entire 2016 election “corrupt.”",
      "author": "S.V. Date",
      "content": " WASHINGTON — Look up “corrupt” in the dictionary and you could expect to find an illustration of Donald Trump looking right back ― yet that has not kept the president from repeatedly calling others corrupt in recent weeks. Trump has given his daughter and son-in-law prominent White House jobs, steers lobbyists and political groups seeking his favor toward using his Pennsylvania Avenue hotel, and even successfully pushed the U.S. government to host the next G-7 meeting at his own golf resort, which will put tens of millions of American tax dollars into his own cash registers next June. “He has no shame,” said Joe Walsh, a former Illinois congressman who is running against Trump for the 2020 Republican nomination. “He’s incapable of shame. That’s not normal.” Indeed, such actions, had they been taken by a mayor, a county executive or a governor, would in all likelihood result in state or federal public corruption charges. While laws and rules vary by state and locality, ethics laws generally prohibit public officials from profiting from their offices. Giving oneself a large government contract ― as Trump’s White House announced Thursday with the selection of his troubled Doral, Florida, golf course as the site of the next summit of the world’s largest democratic economies ― would almost certainly result in a criminal prosecution, ethics experts said. “This is a president who believes the powers of the presidency are bestowed on him to advance his own personal interests, political and profit-seeking, rather than those of the American people,” said Robert Weissman, president of the liberal watchdog group Public Citizen. But as the sitting president, Trump is immune from both ethics laws and criminal prosecution, and not only has he openly engaged in nepotism and self-dealing, he has, in recent weeks, started accusing political opponents and the news media of “corruption.” At an Oct. 2 news conference, for example, he called former Vice President Joe Biden and his son Hunter “stone, cold corrupt.” At an Oct. 11 rally in Lake Charles, Louisiana, he broadened that to all Democrats: “The radical Democrats’ policies are crazy. Their politicians are corrupt.” In an Oct. 14 statement he posted on Twitter, Trump called The New York Times corrupt. Just two days later, during a photo opportunity with the visiting president of Italy, he called his predecessor Barack Obama corrupt, as well as the entire 2016 election. Others Trump has labeled “corrupt” in recent weeks: former FBI director James Comey, former FBI agent Peter Strzok, former FBI lawyer Lisa Page, the entire Mueller investigation into the help Russia gave Trump in winning the 2016 election, all of the news media, California Democratic congressman Adam Schiff and CNN. To Trump critics, the president’s attacks are part of a predictable pattern: Accuse others of the inappropriate behavior that he himself engages in. Bandy Lee, among a group of mental health professionals who have been warning of Trump’s state of mind for years, said Trump is exhibiting typical behavior for a “paranoid, delusional” leader. “He accuses others exactly of what he is responsible for,” said Lee, a Yale Medical School professor of psychiatry. “It is a psychological defense called ‘projection.’” Josh Schwerin, a former spokesman for 2016 Democratic presidential nominee Hillary Clinton, recalled Trump’s response when Clinton accused Trump of behaving like Russian dictator Vladimir Putin’s puppet. “No puppet. No puppet. You’re the puppet,” Trump replied at the third and final presidential debate. “He accuses other people of doing the bad things he’s doing,” Schwerin said. “He is the most corrupt president in modern times,” said Jennifer Horn, a former chair of the New Hampshire Republican Party. “He has to convince his followers that everyone is corrupt so they will ignore his corruption.” The White House did not respond to HuffPost queries regarding Trump’s self-dealing and nepotism. One top Republican National Committee member, though, said he is not bothered by any of Trump’s behavior, and instead attacked the news media for not reporting sufficiently on the Clinton Foundation, Hunter Biden or the money former Obama has made since leaving office. “A few dollars on his hotels, which are actually a legitimate business, I’m not going to lose much sleep over,” said Shawn Steel, a longtime RNC member from California, urging more scrutiny of Hunter Biden, who served on the board of a Ukrainian gas company. Damaging Joe Biden’s 2020 candidacy was a key objective of Trump’s newfound interest in rooting out “corruption” in Ukraine, according to a top Trump adviser who spoke on condition of anonymity. Trump believes Biden would be his strongest opponent and has sought to pressure the Ukrainian government to investigate a conspiracy theory that Ukrainian officials seeking to help Hillary Clinton win the 2016 election planted false evidence to make it appear that Russia had helped Trump. According to that conspiracy theory, which also manages to tie in the Bidens and Hungarian billionaire George Soros and the framing of former Trump campaign chairman Paul Manafort, the hacked Democratic National Committee server and Clinton’s 33,000 deleted emails have been hidden away somewhere in Ukraine. Trump’s former homeland security adviser, Tom Bossert, has called the claim “completely debunked” and warned that Trump’s obsession with it would be the “white whale” that could bring him down. Indeed, it was Trump’s request of Ukraine’s president in a July 25 phone call to investigate both the Bidens and the 2016 election conspiracy that sparked a whistleblower complaint against Trump, which in turn led to the ongoing impeachment inquiry. White House chief of staff Mick Mulvaney admitted Thursday that those considerations played into Trump’s policy toward Ukraine. “Get over it: There’s going to be political influence in foreign policy,” he said. Kendal Unruh, a former GOP activist from Colorado who led the unsuccessful effort to dump Trump at the 2016 party convention, said it was distressing to see Republicans tolerating the president’s actions. “The Republican Party has become completely corrupted to the core in their habitual defense of Trump’s behavior,” she said. “It’s sad to watch the death of a party that once actually stood for morality and the rule of law.” Yet Yale psychiatrist Lee said increasing pressure on Trump with the threat of impeachment will create a far greater danger to the country than the mere diminishment of a political party. “His emotional drive to project all his own corruption and ineptitude onto others will overwhelm any ability on the part of others to correct or redirect his lies,” she said. “This drive will become more severe with greater pressure and, paradoxically, the sicker he is, the more effective his pathology will be in overcoming any resistance, starting with himself.”",
      "date": "10/17/2019 04:42 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "GOP Group Uses Trump’s Own Words On Corruption Against Him In Searing Fox News Ad",
      "url": "https://search.huffpost.com/click/_ylt=AwrTLYhbqKtdMB4A6xxsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559643/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2frepublicans-for-the-rule-of-law-trump-properties-ad_n_5da96ed3e4b0e0f0378998f3/RK=2/RS=zcOtlT4Ck763QmiJ7M4mz3t30FI-",
      "subtitle": "Republicans for the Rule of Law released the commercial after the president decided to host the next G-7 summit at a Trump golf resort.",
      "author": "Lee Moran",
      "content": " President Donald Trump’s past comments about corruption are turned against him in a GOP organization’s new TV ad. The commercial, released online Thursday by Republicans for the Rule of Law in response to the controversial announcement that the next G-7 summit will be held at the president’s Miami golf resort, begins with footage of Trump attacking his Democratic rival Hillary Clinton during the 2016 campaign. It then cuts to examples of the ways Trump appears to have personally profited from his time in the White House. Check out the video here: “While candidate Trump was running for president he promised to drain the swamp and tackle corruption,” said Sarah Longwell, the executive director of Republicans for the Rule of Law. “Instead he is using the U.S. government and taxpayer money to enrich himself and his family,” Longwell added. “Holding the G-7 at a Trump property is inappropriate and Republicans should condemn the president’s continued efforts to use the office of the presidency for his personal enrichment.” The 67-second ad will air on Fox News in the Washington, D.C., area on Monday during the widely watched morning show “Fox & Friends.” It will also appear on the conservative network’s digital platforms. The group similarly flipped Vice President Mike Pence’s 2016 campaign assertion that “foreign governments cannot participate in the American political process” with the below spot earlier in the week. It will run in the home states of vulnerable Republicans.",
      "date": "10/18/2019 05:59 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Elizabeth Warren Has A Plan — And A Story",
      "url": "https://search.huffpost.com/click/_ylt=AwrTLYhbqKtdMB4A6RxsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559643/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2felizabeth-warren-plans_n_5cfad50fe4b02ee347770b45/RK=2/RS=OJO6priVsor2Hv8gOS3V4EHMQxg-",
      "subtitle": "Campaigning on policy doesn’t work for every Democrat. Here’s why it seems to be working for her.",
      "author": "Jonathan Cohn",
      "content": " DETROIT ― Elizabeth Warren took her presidential campaign to the Midwest this week, starting with two stops in Michigan where she unveiled a $2 trillion “green manufacturing” proposal. The choice of locale had little to do with state’s Democratic primary, which comes well into the cycle on March 10, and everything to do with symbolism. Michigan is among the politically critical states Donald Trump won narrowly in 2016. This was Warren’s way of saying that she can win there by seizing one of his signature issues: bringing factory jobs back to the U.S. The Massachusetts senator has been doing a lot of that lately. She rolled out her opioid plan in West Virginia and Ohio, two states ravaged by the epidemic, and introduced a plan to protect public lands during a swing through Colorado and Utah. When it was time to sketch out a scheme to increase affordable housing, Warren toured low-income neighborhoods in Alabama, Mississippi and Tennessee. These trips have organizing value, especially because of Warren’s now-famous “selfie lines,” where she offers a photo to anybody willing to wait. (Just think of all the images bouncing around on social media pages.) But it’s the attention these trips generate for her policies, not the pictures, that best explains why Warren has been gaining ground. It wasn’t so long ago that the professional political class was ready to dismiss her. She couldn’t shake the controversy over her statements about Native American heritage and, despite being well-known and beloved on the activist left, her poll numbers dipped ― relegating her to the middle of the second tier, with a bunch of other candidates looking up at Vermont Sen. Bernie Sanders and former Vice President Joe Biden. Now she has been on the cover of Time magazine and her poll numbers are on the rise. Although she remains well behind the front-runners, a recent Economist/YouGov survey found 42% of Democratic voters were at least considering Warren for the primaries. It was the second highest of any Democrat, just behind Biden and just ahead of Sanders. (Over the weekend, a new Iowa poll produced strikingly similar results.) At this early stage of the primary campaign, with so many voters still tuning in for the first time, that means a lot. But it is one thing to climb back into the Democratic race and quite another to win it, to say nothing of prevailing in November. And there are reasons to wonder just how far policy can take Warren, starting with what happened to the last brainy presidential candidate who ran on an ambitious, detailed campaign agenda. Warren’s mantra is “I have a plan for that,” but Hillary Clinton had plenty of plans too. In 2016, she still came up short in the Electoral College. Warren, though, is not Hillary. In fact, her approach to policy is more reminiscent of the other Clinton, Bill, back when he first ran for president in 1992. In the run-up to that election, Bill more or less invented the modern version of campaigning on policy, eventually publishing a book, “Putting People First,” that turned into a governing blueprint for his first years in office. As president, he became famous for policy-laden State of the Union speeches that consistently bored pundits and impressed the public, buoying him in moments of political peril. The idea that Warren has more in common with Bill than Hillary might seem odd, given that Warren’s unabashedly liberal agenda is an explicit rejection of the Democrats’ governing philosophy in the 1990s ― one that was openly apologetic about big government, relied heavily on free trade and free markets, and led to the regulatory changes in banking that first attracted Warren’s ire and pushed her into politics. But on bread-and-butter issues, Bill in 1992 ran a thematically populist campaign that worked because of how it fit together, who he was, and the kind of leadership he was proposing to unseat. In other words, he had a coherent, credible story to tell. Warren does too. That story starts with Warren’s upbringing in Oklahoma, in a family that sometimes faced financial difficulty, especially after her father, who had juggled a series of blue-collar jobs, had to stop working because of a heart attack. It is not a story of overcoming extraordinary struggle. It is a story of overcoming ordinary struggle, like losing the family station wagon, punctuated by occasional crises and bad decisions, like the time Warren left college early in order to marry a man she would later divorce. The bemused, sardonic way she reminisces about that episode ― “you know it’s a problem when you have to refer to the husbands by their number” ― probably rings true to the tens of millions of Americans who have gone through divorce, or at the very least a large portion of the women among them. These recollections, so well known to reporters and followers but still new to most Americans, do more than establish a connection with potential voters. They give Warren a natural platform for talking about policy, because she can attest personally to the importance of things like a high minimum wage (which is what her mom got when she was supporting the family), strong unions (which is how her brother got his pension), and cheap community colleges (which is how she eventually got her degree). Maybe the best known of these is the story she tells about her experience as a working mother, sobbing because she couldn’t find decent child care and was preparing to quit her job, until her Aunt Bee saved her by moving in and taking care of the kids. “If everybody in the world had an Aunt Bee, we’d all be fine,” Warren said during an MSNBC town hall in Fort Wayne, Indiana, the day after her Michigan tour. “But they don’t.” Then Warren pivoted to her child care plan, which she says will guarantee affordable, quality care for all families with kids. One risk of proposing so many policies is that they come to seem scattershot, so that the whole ends up being a lot less than the sum of the parts. Warren has managed to avoid this so far, in part because she’s got such a clear, strong overarching message to her campaign ― that she is fighting to make sure government is on the side of low- and middle-income Americans, not the wealthy and powerful corporations out to exploit them. It’s a familiar trope that works best with a foil. Bill Clinton in 1992 had the advantage of running against a patrician, seemingly aloof George H.W. Bush in the middle of a recession. Hillary had a much tougher time because she was running against Trump, who promised, as she did, to protect working-class Americans. Trump had a very specific kind of working-class American in mind, namely the white kind, but he made enough promises ― like great health care for everyone ― to undermine Hillary’s claim to the populist mantle. Warren has the luxury of running against a different version of Trump, one that still talks like a populist but has the governing record of a plutocrat. He gave huge tax cuts to the rich. He made it easier for corporations to take jobs offshore. He tried to take health insurance away from tens of millions of people. He’s knee-deep in corruption. Of course every Democrat can (and does) make these attacks. Warren has the credibility of somebody whose political career started as a crusader against greedy, corrupt banks. And then there are the plans. It’s obvious from the details of her proposals that she’s consulted widely with experts and has thought through some of the tougher design questions, like how you actually make sure there are enough new child care providers and that they will be good at what they do. Much of this necessarily goes beyond what even most politically engaged voters grasp. That may not matter. At the Detroit rally, a working mother named Hallie Bard, from the suburb of Farmington, talked about how much Warren’s child care plan meant to her, even though she didn’t know much about how the plan would actually work. “I have been dealing with this for 15 years,” Bard said. “It has prohibited me from taking jobs occasionally, because my entire check would go to child care and I am not about to underpay someone to care for the most important people in my life. … It’s important to me that she gets it, that she understands there needs to be a dedication to that.” But as the campaign moves forward, not everyone will take to Warren or her agenda so kindly. There will be philosophical objections from conservatives wary of what would likely be the largest expansion of government in half a century. There will also be more practical objections, some outlandish and some not. Her wealth tax would apply to only the very richest Americans, even though Republicans are sure to imply otherwise when they attack it as a big tax hike. But it could genuinely be difficult to enforce ― and, without the big sums she envisions it collecting, financing all of those great-sounding initiatives on education and health care gets more complicated. This is just one big danger of proposing so many policies: It creates so many targets for opponents to attack. Another is feasibility. She’s one of the few Democrats who has called for ending the filibuster, which would stop a progressive agenda cold even if Democrats take the Senate. But she is also calling for a constitutional amendment guaranteeing a right to vote and overturning Citizen United ― steps that, however advisable, aren’t happening anytime soon. And that’s to say nothing of the formidable political hurdles Warren still faces, starting but not ending with the fact that a large number of Americans still have issues with women who have brains or ambition or, heaven forbid, both. That was trouble for Hillary Clinton and will just as surely be trouble for Warren too. It’s a good sign for Warren that she’s drawing healthy crowds: 500 in Detroit and 1,700 in Lansing, her campaign said. But both were overwhelmingly white, even though Detroit is the blackest city in America. It’s just one reminder that she draws support heavily from college-educated, white liberal voters ― an important constituency in the Democratic Party, for sure, but hardly enough to secure the nomination. Warren has time, however, and under the right circumstances policy really can be a strong political asset. Years ago, in the middle of yet another Democratic presidential campaign, Mark Schmitt of the New America Foundation observed, “It’s not what you say about the issues, it’s what the issues say about you.” Right now, the issues say Warren knows who she is and what she wants to do. A pitch like that could take her far.",
      "date": "06/09/2019 08:00 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Biden Would Have Been The First Democratic Nominee To Support The Hyde Amendment Since Carter",
      "url": "https://search.huffpost.com/click/_ylt=AwrTLYhbqKtdMB4A5xxsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559643/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fjoe-biden-hyde-amendment_n_5cfad085e4b02ee3477703e4/RK=2/RS=EkfGjnD4m_0ACvWB0uArJFzgVAk-",
      "subtitle": "Now, he’s just discarding his position in exactly the same way Al Gore did.",
      "author": "Paul Blumenthal",
      "content": " Until he abruptly reversed course Thursday, 2020 presidential candidate Joe Biden was seeking to become the first Democratic presidential nominee since President Jimmy Carter to support the law banning the use of federal funds on abortion services. Though nominees through the decades had varied stances on choice ― from John Kerry’s “personally pro-life” dance to Hillary Clinton’s full-throated support for reproductive freedom ― they each came out in support of repealing the Hyde Amendment’s ban on federal funding for abortion services even if, like Biden, they had to flip-flop. Carter was the first Democratic Party presidential candidate to take a position on the federal funding of abortion services. The Hyde Amendment was enacted by Congress during the 1976 presidential campaign and would be up for renewal in 1977. This was also the first presidential campaign since the Supreme Court legalized abortion in its 1973 Roe v. Wade decision. A devout evangelical Christian, Carter took what would become a common abortion position for Democratic presidential nominees. He was personally opposed to abortion but would respect the court’s constitutional interpretation legalizing the practice. But Carter went a bit further. He also supported the Hyde Amendment’s ban on Medicaid funding being used for abortion services. “I personally don’t believe the federal government ought to finance abortions,” Carter said at an October 1976 presidential debate. He continued to stake out this position while in office, particularly after a series of Supreme Court decisions said that the federal government had no obligation to fund abortion services. But he did endorse exceptions to the federal ban for rape, incest and the life of the mother. At the same time, he made callous statements about the federal funding ban that outraged women’s rights advocates both inside and outside his administration. When asked about how the Hyde Amendment made it harder for poor women to access abortion services that rich women could easily afford, Carter gave a characteristic response: “Well, as you know, there are many things in life that are not fair, that wealthy people can afford and poor people can’t. But I don’t believe that the federal government should take action to try to make those opportunities exactly equal, particularly when there is a moral factor.” The National Organization for Women refused to endorse his reelection, even against Ronald Reagan, the first full-throated anti-abortion major party presidential nominee. Reagan’s reelection opponent Walter Mondale, Carter’s vice president, was a big supporter of abortion rights who endorsed dumping the Hyde Amendment. But the Republican Party spent more energy attacking his vice presidential pick Geraldine Ferraro, the first woman on a major party presidential ticket, as she was an outspoken pro-choice Catholic. A big part of the party’s strategy since Nixon involved peeling off urban and suburban white Catholic voters from their traditional Democratic Party allegiance and highlighting the apparent contradiction between the Church and Ferraro was a way to play to these voters. (It also helped underline opposition to abortion rights as an extension of anti-feminism.) Democrats’ 1988 nominee Massachusetts Gov. Michael Dukakis was also a pro-choice opponent of the Hyde Amendment, although he couched his support for abortion rights within his personal religious opposition to abortion. Dukakis prevailed over a number of opponents in the Democratic Party primary who did support the Hyde Amendment. At the party’s nominating convention a section was added to its platform that, for the first time, however euphemistically, called for repealing the Hyde Amendment, “the fundamental right of reproductive choice should be guaranteed regardless of ability to pay.” Arkansas Gov. Bill Clinton won the party’s nomination in 1992. Like Carter, Clinton was a Southern governor who backed middle-ground social positions that conformed to his increasingly conservative state, including on abortion. As governor, he had opposed spending federal funds on abortions except in the cases of rape, incest or the life of the mother and signed legislation requiring minors to obtain parental consent to get an abortion. Those positions quickly softened in the Democratic Party primary. As the party’s nominee, Clinton openly called for getting rid of the Hyde Amendment and argued that the national health care plan he was running on would provide funding for abortion services. Reproductive rights advocates welcomed Clinton’s shift. “It’s natural to back these kinds of pragmatic, get-along compromises in a conservative state,” Harriett Woods, then-president of the National Women’s Political Caucus, told the Associated Press in 1992. “Now he is a national candidate responsible for a broader majority. I’m pleased that he’s growing.” In office, Clinton proposed ending the Hyde Amendment by excluding it from the budgets he submitted to Congress. The legislature, however, did not rescind the rule, but instead loosened it to allow exceptions for rape and incest. (The Hyde Amendment already provided an exception for the life of the mother.) Clinton’s health care plan would have paid for abortion coverage, but it too ran aground in Congress. Al Gore, Clinton’s vice president, had a harder time squaring his reversal on the Hyde Amendment when he ran for president in 2000. In his first run for Congress, Gore sought to differentiate himself from his father, a famous liberal Southern senator, by taking more conservative positions. “I don’t believe a woman’s freedom to live her own life, in all cases, outweighs the fetus’s right to life,” he said on the primary campaign trail in 1976 bid for Tennessee’s 6th congressional district. By the time Gore made it to the Senate in 1985 he had adopted more pro-choice positions, including claiming he had always backed Roe v. Wade. But he continued to oppose federal funding for abortions. That was until Clinton chose him to be his vice president. Gore faced questions about his support for the Hyde Amendment immediately. He said that he still opposed federal funding for abortions, but he supported the use of federal money for abortion services in Clinton’s proposed national health care plan. In the 2000 presidential campaign, Gore called for ending the Hyde Amendment. Sen. Bill Bradley, Gore’s lone primary opponent, attacked him for flip-flopping on this issue. Bradley argued that Gore’s past positions on abortion made him an anachronistic choice for a more modern and liberal Democratic Party and his flip-flopping made him untrustworthy. Gore said that he had “always, always, always” supported Roe v. Wade, but had changed his mind on his support for the Hyde Amendment after it was shown to him that the policy produced “an inequitable result.” (This is practically identical to what has happened with Biden.) Abortion rights advocates came to Gore’s defense. “The fact that he evolved doesn’t make him any less pro-choice than a Bradley or anyone else,” Kate Michelman, then-president of NARAL, said in 2000. This evolution, or flip-flop, however you want to cut it, fed into the media-driven narrative that Gore was inauthentic while his opponent, George W. Bush, the Yale legacy child of a wealthy century-old political dynasty, was someone you could have a beer with (even though Bush was a recovering alcoholic). Kerry’s 2004 challenge to Bush featured attacks on him as both an inauthentic flip-flopper like Gore and, as with Ferraro, being a pro-choice Catholic. Unlike Gore, Kerry had a long record of support for abortion rights and repeatedly voted against the Hyde Amendment. He did, however, argue that he was personally opposed to abortion, but did not let his personal religious views interfere with the exercise of the Constitution. “Now, I believe that you can take that position and not be pro-abortion, but you have to afford people their constitutional rights,” Kerry said about his support for allowing federal funding for abortions. The Hyde Amendment did not come up much during the 2008 presidential campaign. Barack Obama’s lone statement on the issue came from the Reproductive Health Reality Check questionnaire sent out by Rewire News: “Obama does not support the Hyde amendment. He believes that the federal government should not use its dollars to intrude on a poor woman’s decision whether to carry to term or to terminate her pregnancy and selectively withhold benefits because she seeks to exercise her right of reproductive choice in a manner the government disfavors.” When in office, however, Obama affirmed the Hyde Amendment as part of a compromise to pass the Affordable Care Act. A group of about a dozen anti-abortion House Democrats held up passage of Obama’s landmark health care bill at the last minute with demands that no federal funds for the program be used to cover abortion services. To obtain their votes, which were needed, Obama agreed to sign an executive order affirming that the Hyde Amendment principles extended to the Affordable Care Act. Hillary Clinton, the first woman nominated for president by a major party, was a longtime supporter of abortion rights and made sure the party endorsed them openly. The 2016 Democratic Party platform was the first to ever explicitly call for the end of the Hyde Amendment. The Democratic convention also featured speakers openly discussing their abortions. This development appeared to indicate that the Democratic Party would take the polar opposite position of the Republican Party on abortion. It would make a full-throated defense of abortion rights and move to roll back the restrictions imposed by their opponents. That was until Biden jumped to the top of the 2020 polls. As history shows, Biden’s since-changed position on the Hyde Amendment could have made him the first Democratic Party nominee in 40 years to hold such a belief. His evolution on the issue recalls Gore’s shift of just 25 years ago. Perhaps, he’ll catch up to 2016 before the primary ends.",
      "date": "06/09/2019 05:45 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "George Conway Warns ‘Hypocritical’ GOP To Take Rape Accusation Against Trump Seriously",
      "url": "https://search.huffpost.com/click/_ylt=AwrTLYhbqKtdMB4A5RxsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559643/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fe-jean-carroll-george-conway-donald-trump-rape-gop_n_5d0e977de4b0aa375f4d873e/RK=2/RS=LYwSUchmTktOwTgABGnoXhujdME-",
      "subtitle": "Republicans should be just as incensed as they were about accusations against Bill Clinton, writes Kellyanne Conway’s husband.",
      "author": "Mary Papenfuss",
      "content": " Attorney George Conway lashed Republicans in a scathing op-ed published Saturday, warning them to hold Donald Trump to the same standards they applied to Bill Clinton and take a new rape accusation against the president seriously. Conway, husband of White House senior adviser Kellyanne Conway, pointed to Republican furor after retired Arkansas nursing home operator Juanita Broaddrick accused Clinton of rape, which he denied. Trump, who has been accused of sexual misconduct by 23 women, seated Broaddrick in a front row during one of his 2016 campaign debates with Hillary Clinton. The new accusation against Trump of rape in a Bergdorf dressing room was detailed in a New York magazine piece by renowned advice columnist E. Jean Carroll. That accusation “rests upon a significantly stronger foundation than Broaddrick’s,” Conway argues in his piece in The Washington Post. While Carroll went public with her accusation, Broaddrick denied for years — including under oath — reports that she had been sexually assaulted by Clinton, Conway notes. Carroll’s account is also “supported by the sheer number of claims that have now surfaced against Trump ... [including] unwelcome or forcible sexual conduct or assault against them. These claims — all denied by the president — far outnumber the publicized sexual misconduct incidents that involved Clinton, which mostly concerned rumors or allegations of consensual affairs,” he writes. (Conway represented Paula Jones, who accused Clinton of sexual harassment.) Conway says Carroll’s account of the alleged sexual assault is also supported by Trump’s “depraved” 2005 remarks on an “Access Hollywood” tape that surfaced during his 2016 campaign in which he boasts about how he treats women: “When you’re a star ... you can do anything ... grab them by the pussy.” He also preened that he “just starts kissing women ... I don’t even wait.” Conway writes: “Whatever else he may have done, Clinton never made a video like that. What Trump described on the video is exactly what Carroll says he did to her.” Trump has insisted he has “never met this person in my life” — which Conway slammed as another “utterly brazen, easily disprovable Trumpian lie.” Carroll included a photo with her article of Trump with ex-wife Ivana apparently speaking to Carroll at a gala. Conway concluded: “Republicans or conservatives who promoted Broaddrick’s charges would be hypocritical if they fail to champion Carroll and condemn Trump.”",
      "date": "06/22/2019 06:58 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Hillary Clinton Trolls Trump’s GOP Supporters: ‘China, If You’re Listening...’",
      "url": "https://search.huffpost.com/click/_ylt=AwrTLYhbqKtdMB4A4xxsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559643/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fhillary-clinton-china-if-youre-listening_n_5cca7b29e4b0913d078c6650/RK=2/RS=Vx6_v0LjjYTwRuu0U0K8UtIBrzw-",
      "subtitle": "The former presidential candidate wonders how Republicans would react if a Democrat asked China to hack Trump’s tax returns.",
      "author": "Ed Mazza",
      "content": " Former presidential candidate Hillary Clinton called out Republican lawmakers Wednesday for refusing to fully investigate Russian interference in the 2016 election because they know it aided them and helped to elect President Donald Trump. She told MSNBC’s Rachel Maddow that if the shoe was on the other foot, however, those same lawmakers would no doubt react very differently. As an example, she offered a hypothetical. “Imagine, Rachel, that you had one of the Democratic nominees for 2020 on your show and that person said, ‘Y’know, the only other adversary of ours, who’s anywhere near as good as the Russians, is China. So why should Russia have all the fun? And since Russia is clearly backing Republicans, why don’t we ask China to back us?’” Then, she got even more specific, using Trump’s own words from when he called on Russia to hack her, just paraphrased slightly. “China, if you’re listening, why don’t you get Trump’s tax returns?” Clinton said in this hypothetical scenario. “I’m sure our media would richly reward you.” During a 2016 news conference, Trump infamously said: “Russia, if you’re listening, I hope you’re able to find the 30,000 emails that are missing. I think you will probably be rewarded mightily by our press.” Clinton said that, according to special counsel Robert Muller’s report, such a call wouldn’t be considered criminal conspiracy even if China hacked the IRS and delivered those returns to a WikiLeaks-like organization because it took place in the open. That’s what happened in 2016 when Russia hacked email accounts of people close to Clinton and delivered the messages to WikiLeaks after Trump openly called on them to hack his rival. “Just saying that shows how absurd the situation we find ourselves in,” Clinton said. She said that Republicans like to mention her whenever they want a distraction from real issues, such as Russian interference in the 2016 election and Trump’s obstruction. “That’s the real story. That’s what they don’t want the American people thinking about,” Clinton said. “So when in doubt, say something wild about me.” Clinton also noted that Trump’s obsession with her meant that she was “living rent-free” inside the president’s brain. “And it’s not a very nice place to be, I can tell you that,” she added. See the full interview above.",
      "date": "05/02/2019 03:00 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Elizabeth Warren On Sexism And Not Getting ‘Hillary’d’ In The 2020 Election",
      "url": "https://search.huffpost.com/click/_ylt=AwrTLYhbqKtdMB4A4RxsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559643/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2felizabeth-warren-sexism-2020-election_n_5cbf0a32e4b00b3e70cf4b7e/RK=2/RS=HDQ7qZkvHW02YaMVbCDGdWspylQ-",
      "subtitle": "“We stay after it every day. One might say you persist,” the presidential hopeful said during a Monday night town hall.",
      "author": "Alanna Vagianos",
      "content": " Sen. Elizabeth Warren (D-Mass.) knows exactly how she’ll combat sexism in the 2020 Democratic presidential primary ― persistence. During a Monday night town hall in New Hampshire, a student asked Warren how the presidential hopeful plans to not get “Hillary’d” ― a phrase the student used to refer to the onslaught of sexist attacks Hillary Clinton received during her 2016 campaign. Warren laughed at the student’s use of “Hillary’d” before referencing her 2012 senate race, which she won against incumbent Republican Sen. Scott Brown. The senator said she was encouraged by other Democrats to run against Brown, but most blatantly told her that she shouldn’t expect to actually win. “People said to me you’re gonna lose because Massachusetts in 2011, according to conventional wisdom, was not ready to have a woman senator or governor,” she said. “We never had and people said it’s just not gonna happen. Not at least for another generation.” Warren said the comments only made her more intent on winning the Senate seat, but that didn’t stop the sexist coverage of her campaign. “I jumped in the race and, sure enough, the early coverage, it’s about what I’m wearing, it’s about my hair, it’s about my voice, it’s about whether or not I smiled enough — I didn’t,” she added, to laughter from the audience. She said she was fully committed to making “something count every single day” of that race. “Every day when I saw a little girl I would come up and I’d usually get down [on one knee] like a teacher, and I would say, ‘Hi my name is Elizabeth, and I’m running for Senate because that’s what girls do,’” Warren said to applause from the audience. “And then we would pinky swear to remember. And so, every night when I went home — no matter what the day had been like — I would count how many pinky swears we had done.” Warren said she plans on using hard work and persistence, as she did in the 2012 senate race, to win the 2020 primary and election. “We stay after it every day,” she said. “One might say you persist.”",
      "date": "04/23/2019 09:54 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Chelsea Clinton Gives Birth To Her Third Child, Jasper Clinton Mezvinsky",
      "url": "https://search.huffpost.com/click/_ylt=AwrTLYhbqKtdMB4A3xxsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559643/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fchelsea-clinton-birth-third-child-jasper_n_5d35de27e4b0419fd330a897/RK=2/RS=sIbkuEaAyPDZGDQlSqTeq.IXkUc-",
      "subtitle": "The former first daughter announced the arrival of a second son with husband Marc Mezvinsky on Monday morning.",
      "author": "David Moye",
      "content": " Chelsea Clinton has become a mother for the third time, giving birth on Monday. The daughter of former President Bill Clinton and former Secretary of State Hilary Clinton announced the arrival of baby Jasper via Twitter. The boy is Chelsea Clinton’s third child with husband Marc Mezvinsky. Clinton’s other kids are Charlotte, 4, and Aidan, 3. As you might expect, Hillary Clinton was very happy about the news. Chelsea Clinton has previously said that watching her parents interact with her children brings her happiness. “It’s just been such a joy for me to watch them sort of rediscover that part of their lives and to watch them as grandparents,” Clinton told Jimmy Kimmel in 2015. Hillary Clinton once admitted that seeing her grandkids more was the one good thing about losing the 2016 election. “My grandchildren. I get to see them all the time. I get to spend a lot of time with them,” the former New York senator told The Hill. “They’re the loves of my life.”",
      "date": "07/22/2019 12:50 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "What Year Is It? Twitter Users Torch Trump For Attacking Clinton In 2020 Kickoff",
      "url": "https://search.huffpost.com/click/_ylt=AwrTLYhbqKtdMB4A3RxsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559643/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fdonald-trump-kickoff-hillary-clinton_n_5d09d276e4b0e560b70b691b/RK=2/RS=zjQK.Mp5istHkdYjCWP2PLJkzlA-",
      "subtitle": "The president’s Orlando rally even had “lock her up” chants.",
      "author": "Ed Mazza",
      "content": " President Donald Trump formally kicked off his 2020 reelection campaign on Tuesday night in Orlando, but in many ways it looked a lot like 2016. Trump mentioned Hillary Clinton frequently, and the crowd replied with their ’16 chants of “lock her up.” Trump even toyed with keeping the same campaign slogan, at one point asking the audience to choose between 2016′s “Make America Great Again” and the apparent new slogan, “Keep America Great.” Trump’s critics panned the throwback speech on Twitter:",
      "date": "06/19/2019 04:59 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Trump Defends Retweet Of Baseless Conspiracy Theory Implicating Clintons In Epstein’s Death",
      "url": "https://search.huffpost.com/click/_ylt=AwrgDdxyqKtdLwcAXrpsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559666/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2ftrump-defends-epstein-retweet-clinton-conspiracy_n_5d52e3d1e4b05fa9df056ccb/RK=2/RS=CQLBlxJUCCuRjvNBPUqIIJcRVRo-",
      "subtitle": "The president said he thought it was “fine” to retweet the conspiracy because it came from a person with lots of Twitter followers.",
      "author": "Antonia Blumberg",
      "content": " President Donald Trump is defending his retweets of baseless conspiracy theories attempting to link Jeffrey Epstein’s apparent suicide with former President Bill Clinton and former Secretary of State Hillary Clinton. Speaking with reporters in Morristown, New Jersey, on Tuesday, Trump said he thought it was “fine” to retweet the conspiracy because it came from “a very highly respected conservative pundit.” But the president also appeared to try to downplay his actions, saying, “That was a retweet. That wasn’t from me, that was from him.” The tweets originated from Terrence K. Williams, whose Twitter bio identifies him as an actor and commentator. “Died of SUICIDE on 24/7 SUICIDE WATCH ? Yeah right! How does that happen,” Williams tweeted on Saturday. ”#JefferyEpstein had information on Bill Clinton & now he’s dead. I see #TrumpBodyCount trending but we know who did this!” Williams’ tweet included a video that mentions another unsubstantiated conspiracy theory that suggests the Clintons were responsible for the death of White House aide Vince Foster, who died by suicide in 1994. There is no evidence to back either conspiracy theory. Trump shared the post with his followers over the weekend. “He’s a big Trump fan. ... He’s a man who has half a million followers, a lot of followers, and he’s respected,” the president said of Williams. “And, as you know, Bill Barr wants to do an entire investigation of the whole Epstein matter.” Trump said he had “no idea” whether he believed Bill Clinton had anything to do with Epstein’s death, according to NBC reporter Kelly O’Donnell. He then questioned whether Clinton ever visited the convicted sex offender’s private island. That comment appeared to hint at a second conspiracy theory Trump retweeted over the weekend. He shared a tweet posted by an account named @BreakingNLive that claimed court documents in Epstein’s case showed that Clinton “took private trips to Jeffrey Epstein’s ‘pedophilia island.’” Epstein owned Little St. James Island, which is part of the U.S. Virgin Islands and was nicknamed “pedophile island” by locals, according to the Associated Press. The court documents, which were recently unsealed, include flight logs showing that Clinton flew on the financier’s private jet a number of times, but the documents do not indicate that he traveled to Little St. James Island. The logs also show that Trump has flown on Epstein’s jet. Both Clinton and Trump had relationships with Epstein.",
      "date": "08/13/2019 01:47 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Hillary Clinton Announces Death Of Brother Tony Rodham",
      "url": "https://search.huffpost.com/click/_ylt=AwrgDdxyqKtdLwcAXLpsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559666/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fhillary-clinton-brother-tony-rodham-dies_n_5cfbf674e4b04e90f1ca3e30/RK=2/RS=kWjrfGUlkHFvqQkiYzKUV31q0gA-",
      "subtitle": "“It’s hard to find words, my mind is flooded with memories of him today.”",
      "author": "Amy Russo",
      "content": " Hillary Clinton’s brother Tony Rodham died Friday night. The 2016 presidential candidate broke the news in a tweet Saturday, mourning his passing. “We lost my brother Tony last night,” she wrote. “It’s hard to find words, my mind is flooded with memories of him today. When he walked into a room he’d light it up with laughter. He was kind, generous, & a wonderful husband to Megan & father to Zach, Simon, & Fiona. We’ll miss him very much.” Rodham was born in 1954 to Hugh Rodham and Dorothy Howell, and was the youngest of their three children. Like his sister, Rodham also became politically involved, working for the Democratic National Convention in 1992 as then-Arkansas Gov. Bill Clinton launched his successful presidential bid. In 2007, Rodham joined Hillary Clinton’s first presidential campaign. Hillary Clinton appears to have had a sometimes strained relationship with Rodham, who along with his brother Hugh had jokingly become known to Clinton’s White House aides as “The Brothers Rodham,” according to Politico. In 2015, the outlet reported that during Clinton’s time as secretary of state, Rodham pushed the agency to approve visas. But that wasn’t all. In 1999, a Washington Post article detailed the brothers’ “embarrassing business venture” in which they attempted to turn a profit from harvesting hazelnuts in the former Soviet republic of Georgia. The enterprise reportedly angered then-national security adviser Sandy Berger as Aslan Abashidze, a local politician in the port city of Batumi, claimed it was an indication of “political support” from Bill Clinton himself. Abashidze was a rival of then-Georgian President Eduard Shevardnadze, a U.S. ally who became irked as a result. Eventually, Berger pressured the Rodham brothers into dropping the project altogether. In 2001, The New York Times revealed that during the end of the Clinton administration, Rodham had convinced his brother-in-law, who was serving as president, to override Justice Department objections and pardon Edgar Allen Gregory Jr. and wife Vonna Jo Gregory, a Tennessee couple found guilty of bank fraud. A congressional probe subsequently discovered that the duo had paid Rodham nearly $250,000 for work as a “consultant” while they attempted to secure the pardon. In 2016, Rodham briefly appeared with Hillary Clinton during a campaign visit to Scranton, Pennsylvania, where their father was born and raised. Rodham had three children, two with wife Megan Madden, whom he married in 2005, four years after his divorce from wife Nicole Boxer, the daughter of former California Sen. Barbara Boxer. Rodham and Boxer share a son, Zach. The cause of death has not yet been made public. Clarification: Language has been amended to reflect more accurately the parentage of Rodham’s children.",
      "date": "06/08/2019 04:11 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Beyond Jeffrey Epstein: Trump Has Promoted Many Conspiracy Theories Over The Years",
      "url": "https://search.huffpost.com/click/_ylt=AwrgDdxyqKtdLwcAWrpsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559666/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2ftrump-jeffrey-epstein-conspiracy-theories_n_5d544700e4b0cfeed1a77eb2/RK=2/RS=PLl741qRcUvpuR930Wj4mhtToNE-",
      "subtitle": "Birtherism, wind turbines and more from President Donald Trump.",
      "author": "",
      "content": "Since the death of Jeffrey Epstein on Saturday morning, President Trump has asserted via retweets and statements to the press that former President Bill Clinton might have had something to do with the disgraced financier’s hanging. While Epstein did have connections to both Trump and Clinton, there’s absolutely no evidence that Clinton or his wife, former Secretary of State Hillary Clinton, had anything to do with the apparent suicide. Trump has a long history of promoting fringe conspiracies while offering little to no evidence to support them. Similar to the Epstein case, he has even floated the idea that the Clintons may have been involved in the 1993 suicide of former White House aide Vince Foster. In addition to targeting the Clintons, over the years, Trump-backed conspiracy theories have involved former President Barack Obama, Sen. Ted Cruz, global warming, Supreme Court Justice Antonin Scalia and wind turbines. What follows are some of the significant conspiracy theories pushed by Trump over the years.  Trump began pushing the idea that Obama was hiding something about his true birthplace in 2011. According to a New York Times report diving into the six-week period in which Trump went on a media blitz casting doubt on Obama’s history: “Why doesn’t he show his birth certificate?” he asked on ABC’s “The View.” “I want to see his birth certificate,” he told Fox News’s “On the Record.” And on NBC’s “Today Show,” he declared, “I’m starting to think that he was not born here.” In 2012, Trump said he thought the birth certificate the White House provided could have been fake. When asked in 2015 if he believed Obama was born in the United States, Trump said, “I really don’t know.” Trump finally admitted at a 2016 campaign event that Obama was born in the United States but never apologized for promoting the lie.  Since losing the popular vote to Hillary Clinton in the 2016 election, Trump has repeatedly claimed that he was the true top vote-getter if not for millions of illegal ballots cast for his opponent by undocumented immigrants going to the polls multiple times. A comprehensive 2014 report examining years of elections turned up 31 instances of credible fraud out of one billion votes cast. There have been limited documented cases of voter fraud in the 2016 election. Trump has also insisted he won the state of New Hampshire, which Clinton claimed by 2,736 votes, because the Democrats bussed in voters from neighboring Massachusetts. Pressed for proof of such a claim, the administration dispatched senior policy adviser Stephen Miller to defend it. “I can tell you that this issue of busing voters into New Hampshire is widely known by anyone who’s worked in New Hampshire politics,” Miller claimed on ABC in 2017. “It’s very real. It’s very serious. This morning, on this show, is not the venue for me to lay out all the evidence.” In the more than two years since that interview, the White House has yet to find the venue in which to lay out its evidence. In 2017, Trump created a commission to investigate voter fraud and gather data to bolster its assertions, but requests to states to turn over voter registry information was widely rejected by officials of both parties. Trump shut down the commission in January 2018, citing “endless legal battles.” In the wake of the 2018 midterms, Trump alleged — again, without evidence — that something was amiss in the recounts for the Florida Senate and gubernatorial races. Despite the president’s insistence of a scheme against them, Republicans won both contests.  Last year on the one-year anniversary of Hurricane Maria hitting Puerto Rico, the president floated a theory that the astronomical death toll was falsified to make him look bad. “3000 people did not die in the two hurricanes that hit Puerto Rico,” Trump tweeted in September 2018. “When I left the Island, AFTER the storm had hit, they had anywhere from 6 to 18 deaths. As time went by it did not go up by much. Then, a long time later, they started to report really large numbers, like 3000.” The president added: “This was done by the Democrats in order to make me look as bad as possible when I was successfully raising Billions of Dollars to help rebuild Puerto Rico. If a person died for any reason, like old age, just add them onto the list. Bad politics. I love Puerto Rico The official Hurricane Maria death toll per the Puerto Rican government is 2,975, revised from the initial 64. That number, calculated by researchers with the Milken Institute School of Public Health at George Washington University, is lower than a Harvard University study released in May that put the number at 4,645. Among the other conspiracy theories pushed by Trump without any evidence: * The father of Sen. Ted Cruz was involved in the assassination of President John F. Kennedy. (He wasn’t.) * Supreme Court Justice Antonin Scalia was possibly murdered as opposed to dying from natural causes. (There’s no evidence of this.) * Thousands of Muslims in New Jersey celebrated after the attacks on the World Trade Center on Sept. 11, 2001. (Police say this didn’t happen.) * Global warming was a hoax put forth by the Chinese to hurt U.S. manufacturing. (It’s not.) * The noise from wind turbines causes cancer. (It doesn’t.) * The “Central Park Five” — five teenagers accused of assaulting and raping a woman in 1989 — might still be guilty of the crime. (The group was exonerated by both DNA evidence and a confession from the actual rapist.) * Vaccines cause autism. (There is no link.) * Obama ordered a wiretap of Trump Tower during the 2016 campaign.(There is no evidence of this.) _____ Download the Yahoo News app to customize your experience. Read more from Yahoo News: FBI document warns conspiracy theories are a new domestic terrorism threat How a criminal investigation in Georgia set an ominous tone for African-American voters Killer Mike reflects on Trump, Baltimore, ‘drug war reparations’ and Bernie Sanders Inside Trump’s plan to save Appalachia 360: Should Walmart stop selling guns? PHOTOS: Unrest in Hong Kong during anti-government protests",
      "date": "08/14/2019 02:03 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Hillary Clinton Mocks Donald Trump’s 2020 Rally Rant With Stamina Gag",
      "url": "https://search.huffpost.com/click/_ylt=AwrgDdxyqKtdLwcAWLpsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559666/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fhillary-clinton-donald-trump-2020-rally_n_5d0b2ee3e4b06ad4d25b2f48/RK=2/RS=tO0k_d86mCbFxljPvEQlOjmpILY-",
      "subtitle": "She also bashed Trump with an Infowars comparison.",
      "author": "Lee Moran",
      "content": " Hillary Clinton hit back in amusing style after President Donald Trump ranted about her during his 2020 reelection campaign launch in Orlando, Florida, on Tuesday night. The former secretary of state joked about being “blessed with stamina” to keep running through the president’s mind in a Twitter exchange with Democratic former Florida gubernatorial candidate Andrew Gillum. Clinton, who Trump defeated in the 2016 election, also dinged the president with a jibe about Infowars, the conspiracy theory website run by far-right personality Alex Jones. Check it out here: Trump often claimed on the 2016 campaign trail that Clinton didn’t have enough stamina to be president. “She doesn’t have the look,” he said during one of their televised presidential debates. “She doesn’t have the stamina, I said she doesn’t have the stamina, and I don’t believe she does have the stamina.” Clinton responded at the time: As soon as he travels to 112 countries and negotiates a peace deal, a ceasefire, a release of dissidents, an opening of new opportunities in nations around the world, or even spends 11 hours testifying in front of a congressional committee he can talk to me about stamina. Trump’s targeting of Clinton during Tuesday’s rally led to widespread mockery on Twitter, where many people accused him of failing to update his material. Former Rep. David Jolly (R-Fla.) bashed Trump for delivering a “tired, lazy, undisciplined political message focused on the grievance politics that elected him in the first place.”",
      "date": "06/20/2019 05:25 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Pamela Anderson Rips Julian Assange’s Critics As Spiteful Hillary Clinton Supporters",
      "url": "https://search.huffpost.com/click/_ylt=AwrgDdxyqKtdLwcAVrpsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559666/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fpamela-anderson-defends-julian-assange_n_5cf12bfae4b0e8085e38a379/RK=2/RS=LxHz1ZmEAguSDR4XSnGgGs24SZI-",
      "subtitle": "The “Baywatch” actress claimed the WikiLeaks founder’s opponents were simply angry over the 2016 presidential election.",
      "author": "Amy Russo",
      "content": " Pamela Anderson ― Julian Assange’s biggest celebrity advocate ― is doubling down on her defense of the WikiLeaks founder, claiming his critics are scapegoating him for Hillary Clinton’s election loss. In a Daily Beast op-ed published Thursday, the “Baywatch” actress argued that WikiLeaks’ 2016 release of Democratic National Committee emails did not unfairly alter the presidential race, but merely gave voters new information that may have changed their minds. “This whole saga of ‘foreign intervention’ is fundamentally absurd, and mainstream opinion painfully misguided,” Anderson wrote. “No one interfered with the right of voters to inform themselves freely, choose their own candidate, and make their vote count — not Julian, not WikiLeaks, and not even the Russians.” Despite Anderson’s attempt to diminish Russia’s actions during the election, former special counsel Robert Mueller made clear in a public statement Wednesday that “there were multiple, systematic efforts to interfere in our election,” stressing that the “allegation deserves the attention of every American.” Furthermore, in 2018, his office released a sweeping indictment of a dozen Russian military intelligence officials, pointing to Russian hackers as the source of the DNC emails, which were delivered to Wikileaks. On that matter, Anderson told those who “believe the culprits were Russian hackers” to “sort it out with the Kremlin, but keep your hands off our freedom of the press!” “So now you can sulk and whine all you want, but please don’t blame Julian for your own defeat,” she added. “If you and your lot have lost the trust of your people because they’ve learned the truth about you, well then perhaps you should stop in your tracks and think.” Less than two weeks ago, a northern Virginia federal grand jury indicted Assange on 17 counts of espionage involving his work with Chelsea Manning, a former U.S. Army analyst who is currently being held in Virginia’s Alexandria Detention Center for refusing to testify in a grand jury’s investigation of WikiLeaks. Assange worked with Manning in 2010 to publish classified information on the Iraq and Afghanistan Wars. That included a 2007 American airstrike in Baghdad that killed civilians and two Reuters journalists. Critics of Assange’s arrest contend that the charges against him raise serious implications about press freedoms. Earlier this month, Anderson was the first person to pay Assange a social visit at Belmarsh, a high-security lockup in London where he is serving out a 50-week sentence for jumping bail in an attempt to avoid being extradited to the U.S. Following her visit, Anderson held a press conference outside the prison, declaring her love for Assange and calling him “an innocent person.”",
      "date": "05/31/2019 11:54 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "New Book By Hillary And Chelsea Clinton Spotlights 100 ‘Gutsy Women’",
      "url": "https://search.huffpost.com/click/_ylt=AwrgDdxyqKtdLwcAVLpsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559666/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fhillary-clinton-chelsea-clinton-gutsy-women_n_5d49a961e4b01ae816c960fa/RK=2/RS=M3slphyjoa4p6tHo4Jkg_6GrqsA-",
      "subtitle": "Those who stood up to the status quo are the book’s focus, including Madame Curie, Shirley Chisholm and Ellen DeGeneres.",
      "author": "David Moye",
      "content": " Chelsea Clinton had a baby boy just a few weeks ago. Now she and her mom, Hillary Clinton, are giving birth to something else: A book dedicated to “gutsy women.” The Clintons took to Twitter on Tuesday to announce the project: “The Book Of Gutsy Women,” which will focus on 100 women who stood up to the status quo. Some of the women who made the cut are Madame Curie, talk show host Ellen DeGeneres and Shirley Chisholm (the first black woman elected to the House and the first black candidate for a major party’s presidential nomination). The book will also feature portraits of the Clintons’ family and friends, according to ABC News. “To us, they are all gutsy women — leaders with the courage to stand up to the status quo, ask hard questions, and get the job done,” Hillary Clinton said in a statement. “This book is a continuation of a conversation Chelsea and I have been having since she was a little girl, and we are excited to welcome others into that conversation.” Chelsea Clinton added that all the women featured in the book “share a fierce optimism that their work and lives will make a difference in the world.” She added: “We hope readers will draw strength from their stories as we have, because if history shows one thing, it’s that the world needs more gutsy women.” The book, which will be published Oct. 1, marks the first the former secretary of state and presidential candidate has written with her daughter, according to The Associated Press. Hillary Clinton’s previous books include “What Happened” and “Living History,” while Chelsea’s works include the children’s book “She Persisted: 13 American Women Who Changed the World.”",
      "date": "08/06/2019 02:17 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Trump’s Baseless Election Fraud Claim Zooms From 3 Million To 16 Million Votes",
      "url": "https://search.huffpost.com/click/_ylt=AwrgDdxyqKtdLwcAUrpsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559666/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2ftrump-fake-vote-fraud-16-million_n_5d5b27aee4b0d1e11366c6ab/RK=2/RS=LCrw3x4AaDIWOwucPdTupt1Fh6Q-",
      "subtitle": "This time he says it’s Google’s fault. “My victory was even bigger than thought!” he gushed on Twitter after watching a report on Fox Business.",
      "author": "Mary Papenfuss",
      "content": " President Donald Trump has more than quintupled down on his baseless claims of shady voting to explain why he lost the popular vote to Democrat Hillary Clinton in 2016 — and this time he blamed Google. Trump has repeatedly insisted — with no evidence — that 3 million (maybe as many as 5 million) votes were illegally cast by noncitizens. Three million happens to be close to Clinton’s popular vote margin over Trump. But now Trump is insisting that up to 16 million votes were manipulated by Google to Clinton’s benefit. “My victory was even bigger than thought!” he gushed on Twitter. The claim comes just days after Ellen Weintraub, the chair of the Federal Election Commission, wrote a letter to the president telling him to shut up about his vote-fraud claims or come up with evidence that there’s any truth to them. Trump established an investigative panel on voter fraud to substantiate his claims in 2017, but it came up with nothing and disbanded. Weintraub warned that Trump’s unsubstantiated claims undermine faith in the election system. She said she was using words a “former casino operator” could understand: “You need to lay your cards on the table — or fold.” Instead of folding, Trump raised. Trump’s new claim was apparently sparked by a Fox Business report Monday about psychologist Robert Epstein’s research. He recently testified before senators that his research has shown that Google’s search algorithms may have “impacted undecided voters in a way that gave at least 2.6 million votes to Clinton.” His study sample, however, involved just 95 voters, 21 of whom considered themselves undecided. Google denied that its search algorithms are politically biased and has said that Epstein’s study methodology was fatally flawed. “This researcher’s inaccurate claim has been debunked since it was made in 2016,” Google said in a statement to CNBC. “As we stated then, we have never re-ranked or altered search results to manipulate political sentiment.” Clinton made much of the 21 undecided voters in Epstein’s research in a Twitter clapback.",
      "date": "08/19/2019 08:53 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Mariah Carey Appears To Troll Donald Trump With ‘President’ Hillary Clinton Caption",
      "url": "https://search.huffpost.com/click/_ylt=AwrgDdxyqKtdLwcAULpsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559666/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fmariah-carey-donald-trump-hillary-clinton-photo_n_5d494653e4b0244052e0b33c/RK=2/RS=8EJuTQ0oyA8HnQjfbkYhsZx4eWg-",
      "subtitle": "The singer’s Twitter fans couldn’t get enough of the apparent diss.",
      "author": "Lee Moran",
      "content": " Mariah Carey on Monday appeared to throw subtle shade at President Donald Trump in a caption for photos of herself with Hillary and Bill Clinton. “An honor to meet President Clinton and her husband, former President Bill Clinton!” the singer tweeted along with the pictures, reportedly taken at Barbra Streisand’s concert at Madison Square Garden in New York City on Saturday. “Thank you for everything you have done and continue to do for our country,” she added. Former Democratic candidate Hillary Clinton beat Trump in the popular vote, but lost the Electoral College, in the 2016 election. Carey’s post was well-received by many of her fans online:",
      "date": "08/06/2019 08:29 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Trump Retweets Baseless Conspiracy Theory Implicating Clintons In Epstein’s Death",
      "url": "https://search.huffpost.com/click/_ylt=AwrgDdxyqKtdLwcATrpsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559666/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2ftrump-retweets-conspiracy-theories-clinton-epstein-death_n_5d4f42d9e4b0fd2733f1400b/RK=2/RS=gRCHWX86uy1EjnM_uSo_HS5oJnU-",
      "subtitle": "The president retweeted multiple unfounded claims hours after convicted sex offender Jeffrey Epstein’s apparent suicide.",
      "author": "Carla Herreria",
      "content": " Amid news of Jeffrey Epstein’s apparent suicide, President Donald Trump retweeted baseless conspiracy theories that attempt to link the convicted sex offender’s death with former President Bill Clinton and former Secretary of State Hillary Clinton on Saturday evening. Terrence K. Williams, whose Twitter bio identifies him as an actor, wrote a tweet with hashtags related to one of the conspiracy theories. The president later shared the post with his followers. “Died of SUICIDE on 24/7 SUICIDE WATCH ? Yeah right! How does that happen,” Williams wrote. ”#JefferyEpstein had information on Bill Clinton & now he’s dead. I see #TrumpBodyCount trending but we know who did this!” In a video uploaded with the tweet, Williams goes on to link Epstein’s death to another unsubstantiated conspiracy theory that suggests the Clintons were responsible for the death of White House aide Vince Foster, who died by suicide in 1994. There is no evidence proving the longstanding conspiracy theory called the “Clinton Body Count,” which tries to link the family to a number of deaths. Snopes, the fact-checking news site, extensively debunked the false claims when they first surfaced. Trump also retweeted an account named @BreakingNLive that claimed the court documents involving Epstein’s case, which were unsealed this week, showed that Bill Clinton “took private trips to Jeffrey Epstein’s ‘pedophilia island.’” However, the tweet is misleading. The court documents, unsealed this week, include flight logs that show Clinton flew on the financier’s private jet a number of times, but the documents do not indicate that Clinton traveled to a “pedophilia island,” nor do they contain the words “pedophilia island.” However, the court filings do mention that Epstein frequently traveled to the Caribbean. Epstein owned Little St. James Island, which is part of the U.S. Virgin Islands and was nicknamed “pedophile island” by locals, according to the Associated Press. The documents similarly do not indicate that Clinton traveled to Little St. James Island. The logs also show that Trump has flown on Epstein’s jet. Both Clinton and Trump had relationships with Epstein, who was known to be well-connected to powerful people. Clinton, a longtime associate of Epstein’s, said last month that he did not know anything about the “terrible crimes” that Epstein committed and said they haven’t spoken in “well over a decade.” Also last month, Trump, who has appeared in photos and video with Epstein at events and parties, said that he had a “falling out” with Epstein and was “not a fan of his.” A Trump official, Lynne Patton, a regional administrator for the Department of Housing and Urban Development, also shared an unfounded conspiracy theory after Epstein’s death. In an Instagram post, Patton suggested that Epstein was “Hillary’d,” implying — with no proof — that Hillary Clinton was responsible for his death. Before Patton was assigned to work in the administration, she worked closely with the Trump family, planning events, including Eric Trump’s wedding, and eventually becoming the Trump family’s chief of staff.",
      "date": "08/10/2019 08:16 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Meghan McCain Regrets Calling Hillary Clinton ‘Crooked’",
      "url": "https://search.huffpost.com/click/_ylt=AwrgDdyLqKtdi5UAKZpsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559691/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fmeghan-mccain-regrets-crooked-hillary-elle-interview_n_5d39c7c2e4b020cd994fe8c3/RK=2/RS=EvUjiwyVVwbVJaOC8_OTbGZvI5Q-",
      "subtitle": "“The View” co-host tells Elle magazine she regrets insulting Donald Trump’s 2016 opponent. “She was friends with my dad.”",
      "author": "David Moye",
      "content": " Drinking and political commentary seem like natural bedfellows, but not to Meghan McCain. Back in 2017, “The View” co-host caused a brief firestorm when she said she hated former Secretary of State Hillary Clinton and called her “Crooked Hillary” on air ― an insult frequently used by Donald Trump to bash his opponent in the 2016 presidential race. Now, McCain is blaming a boozy outing for her caustic comments, according to a new profile in Elle magazine. The night before that episode, McCain said she had drinks with her colleagues and got “tipsy,” in the words of the magazine. She claimed she was still feeling the effects of the outing the next morning when she said on the show, “I call her Crooked Hillary! I hate Hillary Clinton.” She told Elle she still regrets the comments. “I apologized on TV and said that I was contributing to the polarization of this country,” she said, before referencing her father, the late Sen. John McCain. “She was friends with my dad. It’s really not fair.” These days, she’s focused on another politician: Joe Biden, an old family friend who might be the first Democrat she votes for ― ever. Though she intends to remain neutral, McCain admits her relationship with the former vice president makes that hard for a variety of reasons. “Even if I did endorse him, it would hurt him,” she said. “I love Biden in a way that I loved my father.”",
      "date": "07/25/2019 12:26 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Howard Stern: If Hillary Clinton Listened To Me, She’d Be President",
      "url": "https://search.huffpost.com/click/_ylt=AwrgDdyLqKtdi5UAJ5psBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559691/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fhoward-stern-hillary-clinton-questions-2016_n_5ce50259e4b0d513447c9bcf/RK=2/RS=RKP3Grf5qH9xAw1IMGTDSptxmQo-",
      "subtitle": "But the radio host was unsuccessful with his “all-out campaign” to interview the then-Democratic candidate on his show before the 2016 election.",
      "author": "Lee Moran",
      "content": " Radio host Howard Stern has explained why he desperately wanted to interview Hillary Clinton ahead of the 2016 election, and why he believes it could have helped the then-Democratic candidate defeat Donald Trump. “I thought that if I did an interview with Hillary that she would reach a new audience,” Stern said on Tuesday’s broadcast of “The Late Show with Stephen Colbert.” He noted his potential listenership of 66 million people and how the election had hinged on less than 80,000 votes in Michigan, Pennsylvania and Wisconsin ― states where his show is popular. But the sit-down never materialized. “What if Hillary had come on and, forget politics for a second, but what if we could have talked about her humanity, why she got into public service?” asked Stern, who declared his support for Clinton ahead of the election despite his long history of inviting Trump to appear on his show. He then suggested some questions he could have asked to “humanize” her: “Here is a woman who dedicated her whole life to public service. What was her life like as a little girl growing up? What was her romance with Bill Clinton? What was she thinking when she was Secretary of State? What was she thinking when she was the First Lady? Was she saying to herself ‘I wish I could be president’ or was she satisified with that? There were a million questions I could have asked her that I think would have humanized her.” Check out the clip here: In another part of the interview, Stern claimed Trump had only run for president as “a gimmick” to boost his reality TV show “The Apprentice.” “I don’t think he wanted to be the president. I knew him,” said Stern, who was promoting his new memoir Howard Stern Comes Again. “He had a great life at Mar-a-Lago,” he added of Trump. “He was running around town. He played golf. He had a good time.” Check out that segment here:",
      "date": "05/22/2019 06:24 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Hillary Clinton Agrees With Nancy Pelosi On Potential Trump Impeachment",
      "url": "https://search.huffpost.com/click/_ylt=AwrgDdyLqKtdi5UAJZpsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559691/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fhillary-clinton-pelosi-trump-impeachment_n_5cbf56cde4b0a5de6e3e8acc/RK=2/RS=dq6yyO2tJY5rJzrxe_J35uKWd_k-",
      "subtitle": "The former secretary of state added that the Mueller report “could not be more explicit” in showing Trump obstructed justice.",
      "author": "Hayley Miller",
      "content": " Hillary Clinton on Tuesday said she agrees with House Speaker Nancy Pelosi (D-Calif.) in her reluctance to call for the impeachment of President Donald Trump in the wake of special counsel Robert Mueller’s Russia report. “I think what Nancy means, and I agree with what she means, is that it shouldn’t be a pre-ordained conclusion,” the former secretary of state said during an interview at the Time 100 Summit in New York City. “It shouldn’t be what you do for partisan political purposes almost outside of the framework of the Constitution. It should be something undertaken in a really serious ... way based on evidence,” she continued. Though some Democrats, including 2020 presidential contenders Sens. Elizabeth Warren (Mass.) and Kamala Harris (Calif.), have made concrete statements in support of impeaching Trump, Pelosi has taken a more measured approach. In a letter to her colleagues Monday, Pelosi acknowledged efforts to seek impeachment against the president in light of the “highly unethical and unscrupulous behavior” conducted by Trump, as laid out in the Mueller report. “As you know, last Thursday’s release of the redacted Mueller Report has caused a public outcry for truth and accountability,” Pelosi said in her letter. “While our views range from proceeding to investigate the finding of the Mueller report or proceeding directly to impeachment, we all firmly agree that we should proceed down a path of finding the truth.” Clinton on Tuesday compared a potential Trump impeachment to the impeachment of President Richard Nixon in 1974. Many public hearings involving Nixon administration officials took place before the House initiated impeachment proceedings against him, she noted. As a staff attorney for the House Judiciary Committee at the time, Clinton researched the historical grounds for impeachment and helped draft a memo on what constitutes high crimes and misdemeanors. “I have a kind of weird personal history about impeachment,” Clinton said during the Time summit. “It took several years for the slow acquisition and the publication of information to show the level of corruption and obstruction that was existing in [the Nixon] White House. ... By the end of it, the evidence was overwhelming.” Clinton said the Mueller report “could not be more explicit” in laying out evidence that Trump obstructed justice, adding that “any other person who had engaged in those acts would certainly have been indicted” if not for the Justice Department determination that a sitting president cannot be indicted. Nonetheless, she said, Congress must investigate and examine the evidence “as objectively as possible” before deciding to move forward with impeachment. “I think Nancy is right to be cautious about making sure whatever is done in this Congress is more in accord with the very careful approach of 1973 and ’74,” Clinton said, referring to the Nixon impeachment proceedings. “You don’t put impeachment on the table as the only item on the table. ... Instead, you say, ‘We are going to proceed with the seriousness this demands.’”",
      "date": "04/23/2019 03:53 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Hillary Clinton Fires Back After Trump’s Racist Tweet: ‘You’re Right About One Thing’",
      "url": "https://search.huffpost.com/click/_ylt=AwrgDdyLqKtdi5UAI5psBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559691/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fhillary-clinton-trump-racist-tweets_n_5d2bda8ae4b02a5a5d5d08d3/RK=2/RS=L32wKwGe54QqkNKEsH7ObKvzI3U-",
      "subtitle": "The president lobbed an inaccurate attack at several Democratic lawmakers on Sunday, saying they should “go back” to the countries they came from.",
      "author": "Nick Visser",
      "content": " Former Secretary of State Hillary Clinton slammed President Donald Trump’s racist attacks on a squad of Democratic congresswomen on Sunday, clapping back that there was one person responsible for the “complete and total catastrophe” in Washington: the president himself. “They’re from America,” Clinton wrote on Twitter, referencing Trump’s inaccurate statements about progressive women in Congress. “And you’re right about one thing: Currently their government is a complete and total catastrophe.” Her comments came just hours after Trump wrote on Twitter that a coalition of “Progressive Democrat Congresswomen” who came from “countries whose governments are a complete and total catastrophe” should “go back” to the “broken and crime infested places from which they came.” The comments were largely viewed as a vitriolic attack against four high-profile women elected to Congress last year: Reps. Alexandria Ocasio-Cortez (N.Y.), Rashida Tlaib (Mich.), Ayanna Pressley (Mass.) and Ilhan Omar (Minn.). All four are women of color, but only one — Omar — was born outside of the United States. The lawmaker was born in Somalia and immigrated to the U.S. when she was a child. Clinton has become a vocal and noted critic of the president since her defeat in 2016, lambasting his frequent invocations of her name, chastising him for spreading “sexist trash” and accusing the Trump administration of conducting “despicable” acts. She has vowed to “continue to speak out and fight for our basic rights,” even if it sometimes irks those in Washington. House Speaker Nancy Pelosi (D-Calif.) also came to her colleagues’ defense on Sunday, accusing the president of “xenophobic comments meant to divide our nation.” Republicans, on the other hand, have largely stayed silent. The hosts of “Fox & Friends” went so far as to applaud Trump’s remarks on Sunday. Despite the outcry, Trump doubled down on his remarks later that evening, saying it was “so sad to see the Democrats sticking up for people who speak so badly of our Country.” “Their disgusting language and the many terrible things they say about the United States must not be allowed to go unchallenged,” he tweeted. “If the Democrat Party wants to continue to condone such disgraceful behavior, then we look even more forward to seeing you at the ballot box in 2020!”",
      "date": "07/14/2019 11:26 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Hillary Clinton Rips Trump For Spreading ‘Sexist Trash’ With Nancy Pelosi Smear",
      "url": "https://search.huffpost.com/click/_ylt=AwrgDdyLqKtdi5UAIZpsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559691/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fhillary-clinton-nancy-pelosi-donald-trump_n_5ce9731ae4b00356fc225062/RK=2/RS=PT2QX4.IQfBy1EGpnzWAgrNgD3A-",
      "subtitle": "The 2016 presidential candidate slammed Trump and his allies for helping to circulate a doctored video that makes the House speaker appear drunk.",
      "author": "Amy Russo",
      "content": " Hillary Clinton rebuked President Donald Trump and his “cronies” for spreading doctored footage of House Speaker Nancy Pelosi (D-Calif.) in an effort to smear the congresswoman, calling it “sexist trash.” The former Democratic presidential candidate delivered the condemnation in a speech Friday at a Harris County Democratic Party event in Houston. “The president and his cronies have been running around spreading a doctored video of Nancy Pelosi,” she said, adding, “Now, it is sexist trash, but it is also a sign that Trump is running scared.” “So if you believe in the rule of law and the responsibility we all have to hold our leaders accountable, then we cannot relent on this front either,” Clinton continued, warning that the president has launched the nation into “a very real constitutional crisis.” On Wednesday, a deceptively edited video of Pelosi’s remarks at Washington’s Center for American Progress Ideas Festival began circulating online, making it appear as if the congresswoman was drunkenly stumbling through her speech. On Friday, The Washington Post debunked the footage as a hit job, though its origins remain unclear. A version shared on a Facebook page called Politics WatchDog continued to remain available with 2.6 million views as of Saturday, and the social media platform has no plans to take it down. Though the company has vowed to combat the sharing of fake news on its site, in a statement to The Guardian, a company spokesperson said it was trying to uphold free speech by leaving the edited clip up: There’s a tension here: we work hard to find the right balance between encouraging free expression and promoting a safe and authentic community, and we believe that reducing the distribution of inauthentic content strikes that balance. But just because something is allowed to be on Facebook doesn’t mean it should get distribution. In other words, we allow people to post it as a form of expression, but we’re not going to show it at the top of News Feed. On Twitter, the video was shared by the president’s personal attorney, Rudy Giuliani, who later deleted his post then tweeted out an unintelligible comment appearing to defend his decision to spread the footage. Trump himself tweeted a separate video of Pelosi on Wednesday, titling it, “Pelosi stammers through news conference.” The Post determined the clip had been selectively edited, but it is still on the president’s page.",
      "date": "05/25/2019 03:51 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Hillary Clinton Bashes Donald Trump’s Fourth Of July Military Extravaganza",
      "url": "https://search.huffpost.com/click/_ylt=AwrgDdyLqKtdi5UAH5psBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559691/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fhillary-clinton-criticizes-donald-trump-july-fourth_n_5d1e1781e4b01b834732f0ac/RK=2/RS=FkbNKenuZ4SZY.g1vFiSP0vL0OA-",
      "subtitle": "The spectacle is set to feature tanks and fighter jets soaring over Washington.",
      "author": "Amy Russo",
      "content": " Hillary Clinton is speaking out against President Donald Trump’s flashy display of military might for the Fourth of July, adding her voice to widespread criticisms of the event. “We need a strong national defense, but a president shouldn’t need it next to him in a parade to show his patriotism,” she wrote Thursday in a tweet. Trump has been accused of hijacking this year’s festivities in Washington, D.C., where he plans to showcase tanks and fighter jets for his “Salute to America” at the Lincoln Memorial. A U.S. Army spokesperson told viewers of local CBS affiliate WUSA-TV not to panic as tanks began moving into the streets earlier this week. The spectacle has also prompted the closure of the city’s airspace for the first time in four years, affecting almost 100 scheduled flights, according to CNN. The Pentagon appears to be attempting to avoid bad press related to the event. It reportedly distributed instruction cards to troops, reminding them to be careful when speaking to reporters and coaching them to express pride in their jobs and their tanks.",
      "date": "07/04/2019 12:58 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Hillary Clinton’s Response To A Lizzo Tweet Is Truly Something",
      "url": "https://search.huffpost.com/click/_ylt=AwrgDdyLqKtdi5UAHZpsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559691/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fhillary-clinton-lizzo-truth-hurts_n_5d5d5392e4b0701d280c3aad/RK=2/RS=4ughERKxhJUr5TeARPchpazImqI-",
      "subtitle": "The former secretary of state tweeted a line from “Truth Hurts” at the singer, confirming that love for Lizzo transcends politics.",
      "author": "Jenna Amatulli",
      "content": " We’re not going to text you, we’ll tell it straight to your face: Former Secretary of State Hillary Clinton tweeted “Truth Hurts” lyrics at Lizzo and, no, we’re not kidding. On Tuesday, the singer tweeted a short clip of various 2016 presidential hopefuls, including Clinton and Sen. Bernie Sanders (I-Vt.), about to observe the national anthem at a Democratic presidential debate. However, the video features Lizzo’s song “Truth Hurts” as the anthem. “Why men great ’til they gotta be great? Woo,” Lizzo sings as Clinton, Sanders and others hold their hands over their hearts. The next day, Clinton responded to the tweet with the opening of the song’s first verse: “I just took a DNA test, turns out...” The full lyric is “I just took a DNA test, turns out I’m 100% that bitch.” Sadly, Clinton did not tweet that part. It’s not clear why Clinton (or her team) chose to respond to this tweet in this way, but relating with singers and rappers seems to be all the rage these days. Rapper Cardi B has long been an admirer of Sanders, and last week the senator’s team released a video of her interviewing him about police reform, minimum wage and health care. And earlier this month, the team of Senate Majority Leader Mitch McConnell (R-Ky.) tweeted a line from “Truth Hurts” in response to a now-unavailable tweet. So, if this country is looking for something to unite both parties, it seems our biggest hope may lie in Lizzo.",
      "date": "08/21/2019 11:34 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Hillary Clinton Rips Trump For Asking A Foreign Power To Help Him Win In 2020",
      "url": "https://search.huffpost.com/click/_ylt=AwrgDdyLqKtdi5UAG5psBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559691/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fhillary-clinton-foreign-power-interference-again-tweet-trump-ukraine_n_5d8549fce4b070d468ccb87c/RK=2/RS=tqBP_2F7nosPSjaF6nT8je6Cy_I-",
      "subtitle": "Beto O’Rourke, Cory Booker, Julian Castro and Elizabeth Warren have all called for Trump to be impeached if he asked for Ukraine’s help.",
      "author": "Mary Papenfuss",
      "content": " Hillary Clinton landed an icy dig on Friday amid the controversy over President Donald Trump’s alleged strong-arming of the Ukrainian president to investigate political rival Joe Biden and his son. “The president asked a foreign power to help him win an election. Again,” she dryly tweeted — clearly referencing Russia’s role in the 2016 presidential election. Clinton attached a clip of Trump attorney Rudy Giuliani’s meltdown in a CNN interview Thursday when he said that “of course” he called on Ukrainian officials recently to investigate Biden, after initially denying it. Clinton’s attack was one of several in the wake of a Wall Street Journal article published Friday which reported that Trump pressed Ukrainian President Volodymyr Zelensky “about eight times” in a July phone call to work with Giuliani on an investigation of the former vice president’s actions as well as those of his son, Hunter. Giuliani has claimed that Biden worked when he was vice president to shield a Ukrainian energy company linked to Hunter from a corruption probe. A Ukrainian official said earlier this year there was no evidence of any wrongdoing by either Biden. Trump’s request for a Ukrainian investigation into the Bidens is part of a secret complaint filed against the president by a whistleblower in the intelligence community, The New York Times reported Friday. Trump hasn’t denied pressing Zelensky to investigate the Bidens. He has described the call with Zelensky as “beautiful,” and said it “doesn’t matter what I discussed.” The possibility of a president leveraging the power of the U.S. government on a foreign country to probe a political rival to help his reelection has begun to trigger calls for impeachment. Former Texas Rep. Beto O’Rourke, former Secretary of Housing and Urban Development Julian Castro, New Jersey Sen. Cory Booker and Massachusetts Sen. Elizabeth Warren appeared to be the first of the Democratic presidential contenders to call for Trump’s impeachment over the matter on Friday. Like Clinton, both O’Rourke and Warren referred to Russian interference in the 2016 election. Rep. Joe Kennedy (D-Mass.) said Trump should be impeached if he is blocking the whistleblower complaint from being released to congressional investigators. Richard Painter, who served as chief White House ethics lawyer in the George W. Bush administration, tweeted: “Impeach NOW.”",
      "date": "09/20/2019 08:02 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Call 911, Chelsea Clinton Just Burned Donald Trump Bad",
      "url": "https://search.huffpost.com/click/_ylt=AwrgDdyLqKtdi5UAGZpsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559691/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fchelsea-clinton-donald-trump-greatest-scam-tweet_n_5d8d41abe4b0019647a5de96/RK=2/RS=1hMCc5V9aQSeivFKJMDJWSnDQx0-",
      "subtitle": "She fired back a tweet after the president called the impeachment probe and whistleblower complaint “the greatest scam in the history of American politics.”",
      "author": "Josephine Harvey",
      "content": " Someone get ice ― because Chelsea Clinton just delivered President Donald Trump a major burn. The former first daughter fired off the zinger Thursday in response to an earlier tweet from the president, which referred to the unfolding impeachment inquiry and whistleblower complaint about his July 25 Ukraine call as the “greatest scam in the history of American politics.” Clinton is currently promoting her new book, which she co-authored with her mother, former Secretary of State Hillary Clinton. The mother-daughter duo discussed their book in a recent interview with CBS, in which Hillary Clinton, Trump’s 2016 presidential opponent, listed a “number of grounds” for the president to be impeached and compared Trump’s smearing of former Vice President Joe Biden to what he did to her during her campaign. Clinton’s burn on Thursday quickly raked up tens of thousands of likes, with many people on Twitter responding with encouragement, and Alexandria Ocasio-Cortez (D-N.Y.) torching Trump’s tweet with a reply of her own: OMG! pic.twitter.com/m1XzyFl8vJ",
      "date": "09/26/2019 08:42 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Supercut Shows Full Scale Of Sean Hannity’s Obsession With Hillary Clinton",
      "url": "https://search.huffpost.com/click/_ylt=Awr9IMyjqKtdRJcAIItsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559715/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fsean-hannity-hillary-clinton-obsession_n_5d7834f3e4b09342507b226d/RK=2/RS=TyYRQ51_saVhXxIgdlwoIcquYf4-",
      "subtitle": "The former Democratic presidential nominee was mentioned in more than 90% of the Fox News host’s shows since Donald Trump’s inauguration.",
      "author": "Josephine Harvey",
      "content": " It’s been the best part of three years since Donald Trump won the 2016 presidential race, but Sean Hannity still can’t stop talking about Trump’s former opponent Hillary Clinton. From Trump’s inauguration in January 2017 to August 2019, the “Hannity” host mentioned the former secretary of state in 505 of his Fox News show’s 587 episodes ― that’s 86% of his shows ― according to a review conducted by Media Matters. If you include mentions from guests, Clinton was name-dropped in a whopping 91% of Hannity’s shows. In one particularly long streak this year, Hannity referenced Clinton in 60 consecutive episodes between April and July. As Media Matters points out, Hannity called his show the “Stop-Hillary Express” during the 2016 presidential campaign — but he hasn’t been able to stop speaking about her since. Check out the staggering supercut of Hannity’s Clinton name-drops below:",
      "date": "09/10/2019 10:02 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Hillary Clinton Spent An Hour Reading Her Emails At A Mock Resolute Desk For Art",
      "url": "https://search.huffpost.com/click/_ylt=Awr9IMyjqKtdRJcAHotsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559715/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fhillary-clinton-emails-art-kenneth-goldsmith_n_5d792355e4b0a938a42c5fa2/RK=2/RS=Hg9a3slytMbHTBNvDUxgPkpbvp8-",
      "subtitle": "She later quipped about the exhibit featuring all 60,000 pages of her infamous emails on Twitter: “Found my emails at the Venice Biennale. Someone alert the House GOP.”",
      "author": "Jenna Amatulli",
      "content": " Hillary Clinton paid a visit to an art exhibition in Venice, Italy, that involved her sitting at a mock Resolute Desk and reading copies of her now-infamous emails. Images cropped up online Wednesday showing the 2016 Democratic nominee for president in Despar Teatro Italia, which is currently hosting a solo exhibition by the artist and poet Kenneth Goldsmith called “HILLARY: The Hillary Clinton Emails.” Goldsmith told HuffPost via email that Clinton’s visit “was a surprise,” while curator Francesco Urbano Ragazzi said organizers thought the possibility of her visiting was a joke. “Someone close to Mrs. Clinton contacted us very informally a few days before her visit. We realized that it wasn’t a joke only when we saw the security service inside the exhibition space at 9 am on Tuesday,” they told HuffPost via email. Goldsmith’s exhibition makes public “for the first time in printed format” some 60,000 pages of Clinton’s emails, which, per WikiLeaks, “were sent from the domain clintonemail.com between 2009 and 2013,” according to the description from exhibit co-organizer Zuecca Projects. Then-candidate Donald Trump turned the emails, which were stored on a private server while Clinton was secretary of state, into rallying cry during the 2016 election. The documents are being displayed in an environment that “converts in a lo-fi format some of the furnishings of the Oval Office in the White House,” the description says. “Everybody was very excited [during Clinton’s visit],” Urbano Ragazzi said. “I think the scene was so extraordinary that many customers believed that she was just a lookalike at first.” The description explains that “the pile of papers is rather unimpressive, rebutting Trump’s efforts to make them monumental.” “In this way, Goldsmith creates an anti-monument to the folly of Trump’s heinous smear campaign against Clinton,” it concludes. The artist shared on Twitter that Clinton read her emails for an hour and, per a translation from an Italian news outlet, said: “This exhibition is further proof that nothing wrong or controversial can be found on these emails. It makes them accessible to everyone and allows everyone to read them.” He also recalled Clinton saying, as an aside, to Urbano Ragazzi: “They are just so boring.” Goldsmith told HuffPost that he “hoped that she would see it as an act of tribute and love,” which he believes she did. Urbano Ragazzi added that organizers wanted Clinton to “understand the intentions” of the project. “In the digital age, making these documents available to everyone in a touchable format is a way to focus on something concrete in order to exit the impalpable toxicity of ideological narratives,” they said, before adding: “The exhibition is a way to allude to an alternative world that will never exist. We are happy that the real Hillary has been part of this image full of possibilities.” The exhibition, which began in May, runs until Nov. 24. It is curated by Francesco Urbano Ragazzi and organized by The Internet Saga and Zuecca Projects with collaboration and support from Circuitozero, The Bauers, NERO and Despar Aspiag Service. Clinton did not immediately respond to HuffPost’s request for comment, but the former senator tweeted some thoughts about the whole thing on Thursday: This article has been updated with Clinton’s tweet.",
      "date": "09/11/2019 02:51 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Trump Administration Reportedly Reviving Investigation Into Hillary Clinton’s Emails",
      "url": "https://search.huffpost.com/click/_ylt=Awr9IMyjqKtdRJcAHItsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559715/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2ftrump-administration-hillary-clinton-emails-investigation_n_5d908eb3e4b0019647a9f37e/RK=2/RS=.eHKer4bd3fgdg4PWLVRt6m_5Jc-",
      "subtitle": "Dozens of current and former State Department officials have been contacted in recent weeks about emails they sent years ago to Clinton’s private account.",
      "author": "Dominique Mosbergen",
      "content": " The Trump administration is reportedly amping up its investigation into Hillary Clinton’s private emails — reviving a controversial topic that dominated headlines during the 2016 presidential election and one that President Donald Trump continues to mention. The Washington Post reported on Saturday that the State Department is investigating the email records of dozens of current and former officials who sent messages to Clinton’s private email account when she was secretary of state. The New York Times confirmed the continuation of the investigation on Sunday. State Department investigators began contacting officials about the emails some 18 months ago, the Post reported. But the effort was apparently dropped before being revived in August. “As many as 130” officials have been contacted by the Trump administration since then, the paper said, adding that “those targeted were notified that emails they sent years ago have been retroactively classified and now constitute potential security violations.” The emails were largely sent between 2009 and 2013, when Clinton was secretary of state under former President Barack Obama. State Department officials denied to the Post that the probe was politically motivated. But one former senior U.S. official familiar with the investigation described it as a way for Republicans “to keep the Clinton email issue alive.” Trump, for one, has not dropped the matter. Just Wednesday, Trump ― who’s facing an impeachment inquiry following a series of troubling revelations related to a phone call with Ukrainian President Volodymyr Zelensky ― touted a baseless conspiracy theory about Clinton’s emails. “I think one of the great crimes committed is Hillary Clinton deleting 33,000 emails after Congress sends her a subpoena,” Trump told reporters in New York while sitting alongside Zelensky ahead of a bilateral meeting, referring to a cache of emails that was deleted by a Clinton aide in 2014. Trump suggested those emails “could very well” be in Ukraine. Clinton came under scrutiny during the 2016 presidential election for her use of a private email server to conduct State Department business ― and her choice to delete emails that she’d deemed personal rather than turning them over to investigators. Then-FBI Director James Comey said Clinton and her aides had been “extremely careless” in their handling of classified information but ultimately recommended the case be closed with no charges. Comey also said the FBI had found no evidence that the 33,000 deleted emails had been “intentionally deleted in an effort to conceal them.” Some of the emails were recovered by intelligence officials, NBC News noted. Clinton, the 2016 Democratic nominee for president, has said she believes Comey’s decision to send a letter to Congress about the email controversy mere days before the presidential election was a major factor contributing to her loss. “Absent that, I believe the evidence shows I would have won,” Clinton said in 2017.",
      "date": "09/29/2019 07:36 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Hillary Clinton ‘In Favor Of Moving Toward Impeachment’ Of Donald Trump",
      "url": "https://search.huffpost.com/click/_ylt=Awr9IMyjqKtdRJcAGotsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559715/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fhillary-clinton-impeachment-donald-trump_n_5d8a925ee4b08f48f4ac2efc/RK=2/RS=OmfA_pz0usu.KNrKdua89jnWsys-",
      "subtitle": "“I did not come to that decision easily or quickly, but this is an emergency,” the 2016 Democratic presidential nominee told People.",
      "author": "Sebastian Murdock",
      "content": " Hillary Clinton declared her support for impeachment proceedings into President Donald Trump following Tuesday’s announcement from House Speaker Nancy Pelosi (D-Calif.) that a formal impeachment process will begin. “I’m in favor of impeachment,” Clinton, who ran against Trump in the 2016 presidential election, told People magazine. “I did not come to that decision easily or quickly, but this is an emergency as I see it. … This latest behavior around Ukraine, trying to enlist the president of Ukraine in a plot to undermine former Vice President Biden or lose the military aid he needs to defend against Trump’s friend, Vladimir Putin — if that’s not an impeachable offense, I don’t know what is.” Pelosi was finally driven to announce a formal impeachment inquiry by the allegations that Trump had pressured Ukrainian President Volodymyr Zelensky to investigate 2020 Democratic presidential candidate Joe Biden and his son Hunter Biden even as Trump withheld critical military aid from Ukraine. “The president of the United States is betraying our country on a daily basis,” Clinton told People. The former U.S. secretary of state added, “This man who is in the Oval Office right now is a clear and present danger to the future of the United States.” Trump quickly responded to Tuesday’s impeachment announcement, tweeting at one point in all caps: “PRESIDENTIAL HARASSMENT.”",
      "date": "09/24/2019 06:55 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Hillary Clinton Slams Facebook For Allowing ‘Trump’s Propaganda’ To Thrive",
      "url": "https://search.huffpost.com/click/_ylt=Awr9IMyjqKtdRJcAGItsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559715/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fhillary-clinton-donald-trump-facebook-ads-propaganda_n_5d814175e4b05f8fb6eeff0e/RK=2/RS=BWUj_zLudvrSrrc8KYh6t1222r0-",
      "subtitle": "In rebuking the platform, the 2016 presidential candidate cited a “disturbing” report on the Trump campaign’s deceptions.",
      "author": "Amy Russo",
      "content": " Hillary Clinton served Facebook a fresh round of criticism Tuesday for its role in providing President Donald Trump with a massive platform for his reelection fight, which reportedly includes fake endorsements, money-making scams and deceptive information. At the “In Defense of American Democracy” conference at George Washington University, Clinton sounded the alarm on “Trump’s propaganda efforts,” citing a “very disturbing” investigation into his advertising by journalist Judd Legum. “The Trump campaign is already spending hundreds and hundreds of thousands of dollars on Facebook each week to spread fake endorsements and outright lies about Democrats,” she said. “They have been doing this since after the 2017 inauguration, but it’s getting at an even higher velocity now.” Clinton added that “even though these posts violate Facebook’s stated terms of service, they’re still up.” “Facebook is still paid for them. And the people who are targeted to receive them still believe them,” she said. Facebook did not respond to HuffPost’s request for comment. According to Legum’s newsletter, Popular Information, the Trump campaign has used stock photo models to offer phony endorsements in Facebook videos. The attractive models smile as voiceovers offer support for the president. In a NowThis feature on his reporting, Legum said that the campaign has also used Facebook ads to ask voters to make an immediate donation in order to enter contests to win items such as a signed “Make America Great Again” hat. The contests are said to have enrollment deadlines of 11:59 p.m. on that given day ― but they actually are promoted for multiple days or even weeks, Legum said. The ads are designed, he said, to “scam” Trump supporters. The often politically divisive sentiments pushed by Trump’s ads have also raised concerns. Following the shooting last month in which a gunman targeting Mexicans killed 22 people in El Paso, Texas ― having allegedly acted on a white supremacist manifesto decrying a “Hispanic invasion” ― a review of Trump’s campaign ads showed he used the same language to describe immigration. Earlier this year, about 2,200 ads claimed an “invasion” was taking place, many of them warning social media users that “illegal immigration is a serious threat to our country.” Clarification: This story has been updated to clarify that the conference was held at George Washington University but was not sponsored by the school.",
      "date": "09/17/2019 07:49 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Trump Brings Up Hillary Clinton’s Emails While Defending Ukraine Call",
      "url": "https://search.huffpost.com/click/_ylt=Awr9IMyjqKtdRJcAFotsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559715/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fdonald-trump-defends-asking-ukraine-for-dirt-on-biden-by-blaming-everyone-else_n_5d8bb419e4b0ac3cdda24255/RK=2/RS=IqKNsEx_PwkFC_SBAEJ.oBDAxN0-",
      "subtitle": "The president defended his request for a foreign leader to investigate his political rival and instead focused on attacking Hillary Clinton, the Bidens and Nancy Pelosi.",
      "author": "Sebastian Murdock",
      "content": " In a rambling press conference Wednesday in which he asserted he had done nothing wrong and tried to pivot the focus to Hillary Clinton’s emails, President Donald Trump defended asking the Ukrainian president to investigate former Vice President Joe Biden. “You know there was no pressure,” Trump told reporters of his July 25 call with Volodymyr Zelensky, who joined him for the Wednesday press conference. A summary of the leaders’ call released earlier in the day revealed Trump asked Zelensky to investigate 2020 Democratic presidential contender Biden. Trump made the request while discussing U.S. military aid to Ukraine. House Speaker Nancy Pelosi (D-Calif.) on Tuesday called for a formal impeachment inquiry in the wake of the allegations that Trump urged a foreign power to go after his political rival. When a reporter asked Trump Wednesday if he would like Zelensky to continue investigating Biden, Trump said he wanted him “to do whatever he can.” “I want him to do whatever he can, this was not his fault, he wasn’t there,” Trump said of Zelensky. “But whatever he can do in terms of corruption, because corruption’s rampant. Now when Joe Biden’s son walks away with millions of dollars from Ukraine and he knows nothing and they’re paying him millions of dollars, that’s corruption.” Trump was referring to a Ukrainian investigation into Hunter Biden’s business dealings while he was serving on the board of a Ukrainian gas company. The Ukrainian prosecutor in the case found no evidence of wrongdoing. Trump then pivoted to former 2016 presidential candidate Hillary Clinton’s emails, saying they should be investigated. He accused the U.S. government of being “corrupt,” defended using his personal lawyer as an envoy to Ukraine, and said Zelensky should give more money to the U.S. He then attacked Pelosi for opening an impeachment investigation. “She’s lost her way,” Trump said of Pelosi. “She’s been taken over by the radical left.” He ended by saying that Pelosi is no longer speaker of the House. She is.",
      "date": "09/25/2019 03:13 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Hillary Clinton: Trump ‘Knows He’s Illegitimate,’ It’s Why He’s Obsessed With Me",
      "url": "https://search.huffpost.com/click/_ylt=Awr9IMyjqKtdRJcAFItsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559715/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fhillary-clinton-trump-illegitimate_n_5d90b99be4b0e9e7604e479f/RK=2/RS=EhB.fh9mBWfnddgqgpDMG8YEPFo-",
      "subtitle": "The former secretary of state, who compared her 2016 defeat to “losing to a corrupt human tornado,” said she supports the impeachment inquiry.",
      "author": "Nina Golgowski",
      "content": " Hillary Clinton’s latest book is on “gutsy women,” and, as they say, it takes one to know one. The former first lady, senator, secretary of state, and 2016 presidential nominee took shots at President Donald Trump, his ego and what she called his “illegitimate” election, while promoting her latest book that she co-authored with her daughter, “The Book of Gutsy Women.” “I believe he knows he’s an illegitimate president,” she told CBS’s Jane Pauley in an interview that aired Sunday. “He knows. He knows that there were a bunch of different reasons why the election turned out the way it did. And I take full responsibility for those parts of it that I should. But hey, it was like applying for a job and getting 66 million letters of recommendation, and losing to a corrupt human tornado.” Her interview came as Trump faces an impeachment inquiry launched by House Speaker Nancy Pelosi (D-Calif.) into his attempts to coerce the Ukrainian president into investigating former Vice President Joe Biden, whom Trump might face in 2020. It also came following news that the State Department is revamping its investigation into emails sent to Clinton’s private email server while she was secretary of state. Trump has repeatedly asserted that she committed a crime and should be jailed. “History will probably sort it all out. So of course, he’s obsessed with me. And I believe that it’s a guilty conscience, insomuch as he has a conscience,” Clinton said of Trump’s relentless ongoing attacks on her at rallies and on social media. As for the impeachment investigation, Clinton ― who as an attorney helped investigate the impeachment of President Richard Nixon in the 1970s, and endured her husband’s own impeachment ― said she supports it. “I don’t care who you’re for in the Democratic primary or whether you’re a Republican, when the president of the United States ... uses his position to in effect extort a foreign government for his own political purposes, I think that’s very much what the founders worried about in ‘high crimes and misdemeanors,’” she added. Clinton’s book, “The Book of Gutsy Women,” will be released this week.",
      "date": "09/29/2019 12:06 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Man Obsessed With Hillary Clinton’s Private Server Hid Documents On A Secret System",
      "url": "https://search.huffpost.com/click/_ylt=Awr9IMyjqKtdRJcAEotsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559715/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fdonald-trump-secret-system_n_5d8cd295e4b0e9e76048ee32/RK=2/RS=TgdbIVKXbr8XP1cmzK2W4W074M4-",
      "subtitle": "Well, I never.",
      "author": "Amanda Terkel",
      "content": " Hillary Clinton couldn’t get away from the issue of a private email server in the 2016 election. Donald Trump said it was “bigger than Watergate” and she deserved to go to jail for it. Now, Trump has been caught using a secret computer system ― a private server, if you will ― to hide his election interference attempts. “Republicans have made it very clear that secret servers are a criminal offense,” said Jesse Ferguson, a Democratic strategist who served on the Clinton campaign. “Will they apply the same rules to Trump that they apply to everyone else?” An explosive letter from an unnamed intelligence official was released Thursday detailing attempts by the White House to cover up Trump’s wrongdoing. On more than one occasion, White House officials put transcripts of Trump’s conversations into a “standalone computer system” that was meant for storing sensitive and classified intelligence information. Officials were abusing that system, the letter says. They used it to protect politically sensitive conversations, rather than national security secrets. It’s the place they put the transcript of Trump’s conversation with the president of Ukraine when he asked for foreign help in going after former Vice President Joe Biden in the 2020 election. Hiding this transcript was deliberate. According to the whistleblower’s letter, White House officials said they were “directed” by White House lawyers to move it there, away from the regular computer system that holds other call transcripts that are distributed to Cabinet-level officials. As secretary of state, Clinton used a private email account connected to a nongovernment server. Clinton said it was for convenience, so that she wouldn’t have to carry around two phones ― one for government work and one for personal use. And her aides said she was careful about how she handled classified information. The setup, however, also gave her and her aides control over what materials were preserved for public records. Clinton was not the first government official to use a personal email address for government work. But the issue dogged her relentlessly, pushed on by Trump and his conservative allies. There’s no evidence that Clinton set up this system to deliberately hide wrongdoing. But according to the whistleblower, Trump’s White House used its second system for exactly those reasons. The call at the center of this issue is Trump’s conversation with Ukrainian President Volodymyr Zelensky on July 25. According to both the whistleblower letter and a summary of the call released by the White House, Trump pressured Zelensky to have his government investigate Biden and his son, Hunter Biden, who had served on the board of a Ukrainian gas company during President Barack Obama’s administration. In the Aug. 12 complaint, the whistleblower wrote that there were White House officials who were “deeply disturbed” by the call, adding, “They told me that there was already a ‘discussion ongoing’ with White House lawyers about how to treat the call because of the likelihood, in the officials’ retelling, that they had witnessed the President abuse his office for personal gain.” And if there were any doubt that the White House knew it was bad, officials moved the transcript to the secret system so that few people would ever know about it. “In the days following the phone call, I learned from multiple U.S. officials that senior White House officials had intervened to ‘lock down’ all records of the phone call, especially the official word-for-word transcript of the call that was produced ― as is customary ― by the White House Situation Room,” the whistleblower wrote. “This set of actions underscored to me that the White House officials understood the gravity of what had transpired in the call.”",
      "date": "09/26/2019 02:37 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    },
    {
      "title": "Hillary Clinton: I Never Had To Warn Obama Not To Extort Foreign Countries",
      "url": "https://search.huffpost.com/click/_ylt=Awr9IMyjqKtdRJcAEItsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571559715/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fhillary-clinton-stephen-colbert-late-show_n_5d92ba9de4b0e9e76051c57b/RK=2/RS=2rQ6.yvJrw7Pd5t6_ohDwVoxBVs-",
      "subtitle": "Stephen Colbert does a reality check with the former secretary of state on White House protocol.",
      "author": "Josephine Harvey",
      "content": " Former Secretary of State Hillary Clinton says advising President Barack Obama was a pretty different experience than the one the current secretary, Mike Pompeo, is having. Clinton, appearing Monday on “The Late Show” alongside daughter Chelsea Clinton, was asked by host Stephen Colbert about the bombshell leak earlier that day in which it was revealed Pompeo had been present on a controversial July 25 phone call between President Donald Trump and Ukrainian President Volodymyr Zelensky. The summary of that call released by the White House demonstrated that the president pushed the foreign leader to help dig up dirt on his political opponent Joe Biden. A week before, he had ordered the delay of more than $390 million in military aid to Ukraine. “How many times when you were secretary of state did you have to say to Barack Obama: ‘You can’t extort foreign countries’?” Stephen Colbert asked. “Did you lose count how many times you did that?” Clinton, who was Trump’s 2016 Democratic rival, had plenty to say in response, but to summarize, the answer (after first responding with a big laugh) was, “Yeah... that never happened.” The mother-daughter duo appeared on the show as part of a string of media appearances to plug their new book, “Gutsy Women.” Watch the segment from “The Late Show” below:",
      "date": "10/01/2019 12:06 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Left",
        "target_name": "Hillary_Clinton"
      }
    }
  ]
}