{
  "articles": [
    {
      "title": "Trump Just Politicized Nickelback And People Think We’ve Entered Another Universe",
      "url": "https://search.huffpost.com/click/_ylt=Awr47a_so6tdaBQAQ7ZsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558509/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2ftrump-tries-to-make-nickelback-great-again-in-doctored-clip-attacking-joe-biden_n_5d954f95e4b0da7f66214441/RK=2/RS=0k8FwbtCkG5K6nTk1yOjo68hrwg-",
      "subtitle": "Trump shared a doctored Nickelback video to mock Biden. The video was later pulled for copyright infringement.",
      "author": "Josephine Harvey",
      "content": " There’s bad news for those who were hoping the events involving President Donald Trump on Wednesday were part of a wrinkle in time. They were very much real. Following a dramatic day of foul-mouthed tweeting, raging at reporters and awkward moments with visiting Finnish President Sauli Niinistö, Trump found time to drop a doctored version of Nickelback’s “Look At This Photograph” music video, which had been edited to include an image of Joe Biden and his son alongside two other men. The video was later flagged and removed from Twitter for copyright infringement. Trump’s tweet, minus the video, remained online as of early Thursday. The video takes a swing at Biden for saying he never spoke with his son about his business dealings in Ukraine and follows up with an image of the father and son golfing with a man labelled as a “Ukraine Gas Exec.” The gas exec is Devon Archer, Hunter Biden’s longtime American business partner. The two were both board members of Ukrainian gas company Burisma Holdings. The president posted the video in response to the intensifying impeachment inquiry that began last week. A whistleblower complaint regarding his July 25 phone call with Ukrainian President Volodymyr Zelensky revealed that Trump asked Zelensky as a “favor” to investigate his 2020 rival and son based on unfounded corruption allegations relating to Burisma Holdings. Trump has accused Biden of seeking the removal of a prosecutor in Ukraine when he was Barack Obama’s vice president, supposedly in an attempt to quash an investigation into Burisma Holdings. Trump’s accusation was widely considered to be unfounded; numerous Ukrainian officials and independent media reports said there was no evidence Biden advocated for the prosecutor’s removal with his son’s interests in mind. Prior to posting the Nickelback tweet, Trump gave a press conference where he grew agitated while repeatedly refusing to answer a reporter’s question about what exactly he wanted to be investigated. People on social media were surprised by the Nickelback tweet for an array of reasons:",
      "date": "10/03/2019 02:14 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_biden"
      }
    },
    {
      "title": "Biden Campaign Urges TV News Outlets To Get Rudy Giuliani Off The Air",
      "url": "https://search.huffpost.com/click/_ylt=Awr47a_so6tdaBQAQbZsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558509/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fjoe-biden-campaign-tv-news-rudy-giuliani-off-air_n_5d91097ce4b0e9e7604e986d/RK=2/RS=rajMSDQjfDlARMcafrkXHm2GDGg-",
      "subtitle": "Aides for the Democratic presidential candidate are warning that Trump’s lawyer is spreading “outlandish falsehoods and disinformation.”",
      "author": "Amy Russo",
      "content": " Former Vice President Joe Biden’s 2020 campaign is asking television news executives to stop booking attorney Rudy Giuliani, who is spreading “false, debunked conspiracy theories on behalf of” his client, President Donald Trump. The request came in a letter that top aides Anita Dunn and Kate Bedingfield sent to anchors, producers and senior leadership at ABC, CNN, CBS, NBC, MSNBC and Fox News. “While you often fact check his statements in real time during your discussions, that is no longer enough,” a copy of the memo obtained by HuffPost read. “By giving him your air time, you are allowing him to introduce increasingly unhinged, unfounded and desperate lies into the national conversation.” Continuing, the campaign slammed Giuliani as a Trump surrogate who “has demonstrated that he will knowingly and willingly lie in order to advance his own narrative.” “Giuliani is not enlightening your viewers in any way. He’s not offering a unique or informed perspective. He’s certainly not introducing new facts, since his relationship with the truth is casual at best.” The message follows revelations that Trump pressed Ukrainian President Volodymyr Zelensky in a July phone call to assist Giuliani and Attorney General William Barr with a probe of Biden and his son, based on unfounded corruption allegations. The conversation has fueled an impeachment inquiry into the president, who has been accused of soliciting election help from a foreign government. During the elder Biden’s vice presidency, Hunter Biden worked on the board of Burisma Holdings, a Ukraine-based energy firm from which he made up to $50,000 per month, according to The New York Times. At the time, Joe Biden was pushing ― along with the international community ― for the ouster of the country’s then-prosecutor general Viktor Shokin, who was leading a corruption probe of Burisma. However, there remains no evidence that Joe Biden was aware of the investigation. Furthermore, in May, Yuriy Lutsenko, one of Shokin’s successors who has since left the position, told Bloomberg News, “Hunter Biden did not violate any Ukrainian laws ― at least as of now, we do not see any wrongdoing.” In spite of that, Giuliani has made television appearances as recently as Sunday to promulgate his theory and gin up suspicion over the Democratic presidential candidate. He has also claimed that Ukraine, rather than Russia, was responsible for the 2016 hack into the Democratic National Committee’s server. U.S. intelligence agencies have already determined that it was indeed Russia that perpetrated the breach. The latter allegation prompted Trump’s own former homeland security adviser and current ABC News analyst Tom Bossert to speak out against Giuliani on air Sunday, stating the claim has “no validity.” “At this point I am deeply frustrated with what he and the legal team is doing in repeating that debunked theory to the president,” Bossert said. Now, Biden’s campaign is urging news outlets to cut Giuliani off, warning that he is pushing “outlandish falsehoods and disinformation in the knowledge that it is hard for the corrections to catch up.” “Your obligation is to provide the American people with an informed, fact-based and responsible coverage and debate of critical issues.” In a statement to The Daily Beast, which broke the story, Giuliani said the letter “sounds like the usual left wing censorship,” arguing that “everything” he says is backed up by “affidavits and statements” and that the left is engaged in a cover-up. Trump’s reelection campaign manager, Brad Parscale, also weighed in on Twitter, asking whether the same request could be made of news organizations regarding the booking of Democrats, accusing the left of pushing “hoaxes.”",
      "date": "09/29/2019 05:08 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_biden"
      }
    },
    {
      "title": "Trump Now Wants China To Investigate The Bidens",
      "url": "https://search.huffpost.com/click/_ylt=Awr47a_so6tdaBQAP7ZsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558509/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2ftrump-china-ukraine-biden-impeachment_n_5d9609fae4b02911e116f79f/RK=2/RS=XnErQt_OciNbAnkm41_6luI.1n4-",
      "subtitle": "The president appeared to openly ask another foreign government to influence an American election, even as he is investigated for a similar request to Ukraine.",
      "author": "Marina Fang",
      "content": " President Donald Trump on Thursday suggested China should investigate 2020 presidential candidate Joe Biden, appearing to openly ask another foreign government to influence an American election, even as Congress investigates him for allegedly pressuring Ukraine into doing the same thing. “China should start an investigation into the Bidens, because what happened in China is just about as bad as what happened with Ukraine,” Trump told reporters Thursday. The president made the suggestion while defending himself against House Democrats’ impeachment proceedings, launched after Trump appeared to pressure Ukranian President Volodymyr Zelensky to dig up dirt on Biden, whose son Hunter has had business dealings in the country. Trump on Thursday continued to openly call for Ukraine to investigate the Bidens. He first made the request in a July 25 call that became public after an anonymous whistleblower filed a complaint, which is now the centerpiece of the House impeachment inquiry. “If they were honest about it, they’d start a major investigation into the Bidens. It’s a very simple answer. They should investigate the Bidens,” he said. “I would say that President Zelensky, if it were me, I would recommend that they start an investigation into the Bidens.” Trump’s suggestion comes amid GOP scrutiny at Hunter Biden joining the board of a Chinese private equity fund in 2013, while his father was vice president. The younger Biden accompanied the then-vice president on an official trip to China during that time. In response to the latest comments, Biden and his campaign said in a Thursday statement it was yet another example of Trump’s “ongoing abuse of power.” “What Donald Trump just said on the South Lawn of the White House was this election’s equivalent of his infamous ‘Russia, if you’re listening’ moment from 2016 — a grotesque choice of lies over truth and self over the country,” Biden’s campaign said, referencing Trump asking Russia to investigate 2016 presidential opponent Hillary Clinton’s emails. “The White House itself has admitted that Donald Trump tried to bully a foreign country into lying about the domestic opponent he’s afraid to look in the eye next November.” Trump’s angry defense against the impeachment proceedings has included trying to portray these unprecedented requests for foreign intervention in U.S. elections as routine. The president has previously defended the call — in which, according to the White House’s summary, he dangled military aid in exchange for the investigation into his political rival — as “a perfect conversation.” “Not a thing wrong,” he said Wednesday. “How can you impeach somebody on that conversation?” While defending himself, Trump has also falsely accused both the whistleblower and House Intelligence Chair Adam Schiff (D-Calif.), leading the investigation into Trump’s call, of “treason.” During a contentious press conference Wednesday, in which he appeared belligerent and red-faced, Trump repeatedly badgered Reuters White House correspondent Jeff Mason, when Mason tried to ask exactly what Trump wanted from Zelensky. While calling Mason “rude” and criticizing “the corrupt media,” Trump continued to defend the call and claimed that “Biden and his son are stone-cold crooked.”",
      "date": "10/03/2019 11:58 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_biden"
      }
    },
    {
      "title": "Joe Biden Goes Big On Assault Weapons, But Not As Bold As Democratic Rivals",
      "url": "https://search.huffpost.com/click/_ylt=Awr47a_so6tdaBQAPbZsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558509/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fjoe-biden-assault-weapons-gun-policy_n_5d942938e4b0e9e76054d9c3/RK=2/RS=IIx5GpsgDlyE2RRCHdBSsx1F1IQ-",
      "subtitle": "The former vice president’s gun control plan would require owners of assault-style weapons to either sell their guns or register them with the ATF.",
      "author": "Kevin Robillard",
      "content": " Former Vice President Joe Biden would seek legislation requiring owners of assault weapons to either sell their guns or register them with the Bureau of Alcohol, Tobacco, Firearms and Explosives, his campaign said Wednesday ahead of a major gun violence policy forum. Biden’s proposal does not go as far as some of his Democratic rivals. Former Texas Rep. Beto O’Rourke has pushed for a mandatory buyback of all assault weapons, and Sens. Cory Booker of New Jersey and Elizabeth Warren of Massachusetts have both argued for a federal gun licensing system. Biden and other leading Democratic 2020 presidential contenders are set to speak at a forum in Las Vegas sponsored by the gun control groups Giffords and March For Our Lives. The forum is scheduled two years and one day after the deadliest mass shooting in American history, which killed 58 people at a country music festival in the city. Biden’s plan, which would need to pass a potentially divided Congress, would offer a voluntary buyback program for assault weapons. Gun owners who don’t want to sell their weapons could register them with the ATF under the National Firearms Act. Owners are already required to register machine guns and short-barreled rifles under the law, which the Biden campaign says limits how frequently the weapons are used in criminal activity. “The way the vice president approaches this is ‘first things first,’” a Biden adviser, speaking on condition of anonymity, told reporters. “We have a comprehensive plan to deal with the problem of assault weapons.” Biden would also push for universal background checks for gun purchasers, legislation barring all online gun and ammunition sales, incentives for states to enact red flag laws and gun licensing programs, limits on gun purchases to one per individual per month, and laws to make adults criminally liable for negligently giving a minor access to a firearm and to require gun owners to safely store their weapons. Biden has a long history on gun violence. He was chair of the Senate Judiciary Committee when the existing background check system passed in 1993, and when the assault weapons ban (no longer in effect) passed in 1994. In 2014, as vice president, he served as the point person for the Obama administration’s unsuccessful push for tougher gun laws following the massacre at Sandy Hook Elementary School. Biden’s campaign is also proposing the creation of a task force to “study rampant online sexual harassment, stalking, and threats, including revenge porn and deepfakes — and the connection between this harassment, mass shootings, extremism and violence against women.” The plan also takes aim at a favorite proposal of some conservatives in response to school shootings. A theoretical Biden administration would bar the use of federal funds to train teachers on how to use guns.",
      "date": "10/02/2019 06:25 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_biden"
      }
    },
    {
      "title": "Trump Repeatedly Refuses To Answer Questions About Biden Part Of Ukraine Call",
      "url": "https://search.huffpost.com/click/_ylt=Awr47a_so6tdaBQAO7ZsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558509/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fdonald-trump-ukraine-finland-press-conference_n_5d94f639e4b0da7f6620bcee/RK=2/RS=eFyTWf_iBS0a_kZVbhYhEmrLIlQ-",
      "subtitle": "His press conference with Finland’s President Sauli Niinistö devolved into a rant about Democrats and the “fake news media.”",
      "author": "Hayley Miller",
      "content": " President Donald Trump on Wednesday repeatedly evaded questions from reporters about comments he made during a July phone call with Ukrainian President Volodymyr Zelensky regarding Joe Biden. During a press conference at the White House with Finland’s President Sauli Niinistö, Reuters correspondent Jeff Mason asked Trump to explain what exactly he had wanted Zelensky to do about the former vice president and his son, Hunter. In his long-winded response, Trump defended his phone call with Zelensky and bashed Europe for not giving more money to Ukraine. He then told Mason to ask Niinistö a question, but another reporter interrupted to press Trump about Biden. “Look, Biden and his son are stone cold crooked,” Trump claimed. “You know it and so do we.” Trump has accused then-Vice President Biden of calling for the removal of a corrupt prosecutor in Ukraine for the purpose of impeding an investigation into the Ukrainian gas company upon whose board Hunter Biden was serving. Ukrainian authorities have cleared Biden of any wrongdoing. Mason pushed Trump again: “But the question, sir, was what did you want President Zelensky to do about Vice President Biden and his son Hunter?” “Are you talking to me?” Trump asked after a few moments of silence. “Haven’t you finished with me? Listen, we have the president of Finland. Ask him a question.” But Mason continued to press Trump to answer the question, drawing heated pushback from the president. “Ask him a question,” Trump said, motioning to Niinistö. “Don’t be rude. ... I’ve answered everything. It’s a whole hoax. And you know who’s playing into the hoax? People like you and the fake news media.” Trump’s phone call with Zelensky is the subject of a whistleblower complaint filed by a U.S. intelligence official in August, which prompted House Speaker Nancy Pelosi (D-Calif.) to open a formal impeachment inquiry into Trump last week. Trump has repeatedly claimed his conversation with Zelensky was “perfect” and that he’s the victim of a “witch hunt” orchestrated by Democrats. Acting Director of National Intelligence Joseph Maguire testified before a congressional committee last week that he believes the whistleblower, who has not been identified publicly, “acted in good faith” and “followed the law” when filing the complaint. The whirlwind press conference Wednesday was eyebrow-raising from the start, with Niinistö imploring Trump to keep American democracy alive. “Mr. President, you have here a great democracy. Keep it going on,” the Finnish president told Trump, who raised his eyebrows and nodded in response. Niinistö also pushed for global action on climate change and urged Trump to work with world leaders on trade. Asked to elaborate on his democracy comments, Niinistö said, “I just wanted to tell him that I’m impressed with what the American people have gained during these decades, these 100 or so years. ... So keep it going on.”",
      "date": "10/02/2019 04:31 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_biden"
      }
    },
    {
      "title": "CNN Refuses To Air 2 Trump Campaign Ads Over ‘Demonstrably False’ Claims",
      "url": "https://search.huffpost.com/click/_ylt=Awr47a_so6tdaBQAObZsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558509/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fcnn-rejects-trump-campaign-ads-false-claims_n_5d976269e4b0da7f66261885/RK=2/RS=iyiHRE4PmW3ssUCJD5Qls_ONVWQ-",
      "subtitle": "The ads decried impeachment as a “coup” and bashed the network’s anchors as “media lapdogs.”",
      "author": "Amy Russo",
      "content": " CNN has rejected two of President Donald Trump’s campaign ads because they contain “demonstrably false” assertions and “statements of fact that are not true.” On Friday, the network confirmed its refusal to air the 30-second spots, which peddle unsubstantiated corruption allegations aimed at former Vice President Joe Biden, a leading Democratic rival to Trump in the 2020 election. The ads also claim the House’s impeachment inquiry is “nothing short of a coup” and mock CNN employees as “media lapdogs.” The first ad, titled “Biden Corruption” and posted to YouTube last week, claims that during his time in the Obama administration, Biden “promised Ukraine $1 billion” for the ouster of then-prosecutor general Viktor Shokin, who had previously led a probe of a Ukrainian firm on whose board Biden’s son sat. The implication is that Biden was engaging in some shady, secretive dealing. In fact, Biden has spoken publicly about how, acting on behalf of the Obama administration, he threatened to withhold a $1 billion loan guarantee if the Ukrainian government didn’t dismiss Shokin. The U.S. was one of many countries urging Shokin’s ouster on the grounds that he wasn’t energetically pursuing corruption cases. There is no evidence that Biden was acting out of personal interest, and his son’s past position has long been a matter of public record. The remainder of the ad maligns CNN’s prime-time anchors Chris Cuomo and Don Lemon as journalists who are willing to “fall in line” with Democrats’ pursuit of an impeachment inquiry over Trump’s documented requests for Ukrainian assistance with a probe of the Bidens. Addressing that ad, a CNN spokesperson told HuffPost that “it does not meet our advertising standards.” “Specifically, in addition to disparaging CNN and its journalists, the ad makes assertions that have been proven demonstrably false by various news outlets, including CNN,” the spokesperson said. The second Trump campaign ad, titled “Coup” and posted to YouTube on Wednesday, accuses Democrats of “trying to undo the election regardless of facts, attacking the president by any means necessary” and “fabricating evidence.” It describes the impeachment inquiry as “nothing short of a coup” that “must be stopped.” CNN told HuffPost that while it “accepts political and advocacy advertising across the political spectrum,” advertisers are required to “substantiate all factual claims made in their ads.” “We cannot accept this ad as it contains statements of fact that are not true,” the company said. “Specifically, the ad contains assertions of fact about the whistleblower complaint that have been refuted by the Intelligence Inspector General. In addition, it is inaccurate to use the word ‘coup’ to describe a constitutionally prescribed legal process.” CNN said it has also received a third ad from the Trump campaign called “Changing Things” and that ad can be aired “as it meets our commercial clearance standards.” That spot, which was posted to YouTube on Thursday, appears less incendiary, focusing partly on job creation, trade and border security.",
      "date": "10/04/2019 02:58 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_biden"
      }
    },
    {
      "title": "Biden Raised More Than $15 Million In Third Quarter, Campaign Says",
      "url": "https://search.huffpost.com/click/_ylt=Awr47a_so6tdaBQAN7ZsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558509/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fjoe-biden-raises-15-million-q3_n_5d96736be4b0da7f6623e344/RK=2/RS=vF0L06aXevMMHgMAXxYB9k.79nQ-",
      "subtitle": "The former VP’s team said the numbers indicate Biden’s staying power, but the Q3 figures fell short of Bernie Sanders’ and Pete Buttigieg’s totals.",
      "author": "Nick Visser",
      "content": " Former Vice President Joe Biden raised $15.2 million over the last three months, his campaign announced on Thursday. “Today’s fundraising totals put the campaign in a strong position as we enter the fall,” Greg Schultz, Biden’s campaign manager, said in a statement. “The question any campaign faces at this point is whether or not you have the resources to compete in early states and sustain your efforts beyond. Our campaign unequivocally does and builds on our strength each week.” The campaign also noted that 56% of donors were new to the campaign, which it said indicates Biden’s staying power and popularity in the race to unseat President Donald Trump. The total is notably less than that of at least two of his fellow candidates, although Biden is still the frontrunner in many polls. Sen. Bernie Sanders (I-Vt.) has so far raised the most out of any 2020 Democrat, picking up $25.3 million in the third quarter. South Bend, Indiana, Mayor Pete Buttigieg raised more than $19 million, and Sen. Kamala Harris (D-Calif.) garnered $11.6 million. Sen. Elizabeth Warren (D-Mass.), who rose dramatically in polls over the summer, has not yet released her third quarter fundraising numbers. Biden has been at the center of the unfolding scandal over Trump’s call with the leader of Ukraine earlier this year. During that conversation, Trump repeatedly pressed Ukrainian President Volodymyr Zelensky to investigate Biden and his son, Hunter Biden, who served on the board of a Ukrainian energy company. Before the call, Trump ordered his administration to withhold military aid from the country. Democrats have cast the conversation as an unprecedented move by a president to solicit political help from a foreign power as part of a quid pro quo, although Trump has rejected those claims. It’s unclear if the drama will damage Biden’s chances in the presidential race. Neither Biden has been accused of wrongdoing in the matter, and House Democrats have launched an impeachment inquiry into the president’s behavior. Biden has gone on the offensive in recent days, firing back at the White House for waging what he called a campaign of “lies, smears, distortions and name calling.” During a speech to supporters on Thursday, Biden continued to lambaste Trump but said he remained optimistic about this chances in 2020. “Don’t compare me to the Almighty, compare me to the alternative,” Biden said, according to a pool report, before he went on to cite polls from Ohio and Michigan that put him above Trump. “I thought those polls are wrong until Trump decided to go after me ― so now I know they’re right.” Trump, for his part, had a very good financial summer. His reelection campaign and the Republican National Committee raised a combined $125 million in the third quarter, a figure so large many Democratic leaders warned that the road ahead will not be easy. The two groups currently have more than $156 million cash on hand, double what former President Barack Obama and the Democratic National Committee had at this point before the 2012 election, Politico noted.",
      "date": "10/03/2019 07:26 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_biden"
      }
    },
    {
      "title": "A Running List Of Republicans Criticizing Trump’s Ukraine Scandal",
      "url": "https://search.huffpost.com/click/_ylt=Awr47a_so6tdaBQANbZsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558509/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2frepublicans-criticizing-trump-ukraine-china_n_5d979fbce4b03b475f98fe44/RK=2/RS=D0XNfxjaEqMRdz5sBInnFFNQHsc-",
      "subtitle": "Republicans are not as unified over the controversy as the president is insisting.",
      "author": "Lydia O’Connor",
      "content": " President Donald Trump insisted Friday that “the Republicans are very unified” in supporting him amid accusations that he improperly asked foreign leaders to investigate former Vice President Joe Biden, a 2020 political rival. But that’s not entirely true. While the Democratic-controlled House begins an impeachment inquiry into Trump’s conversations with the Ukrainian government about Biden, which were revealed after a whistleblower complaint, cracks are beginning to show in the Republican Party’s front. Trump’s public call Thursday for China to investigate Biden, too, appears to have pushed some members of the GOP over the edge. Here’s a running list of Republicans who are speaking out about Trump’s apparent attempts to compel foreign governments to aid his reelection campaign. Sen. Mitt Romney of Utah made the biggest splash Friday of any Republican so far when he slammed Trump’s “brazen and unprecedented” calls for foreign meddling in the 2020 presidential election as “wrong and appalling.” “When the only American citizen President Trump singles out for China’s investigation is his political opponent in the midst of the Democratic nomination process, it strains credulity to suggest that it is anything other than politically motivated,” Romney said. The week before, Romney also spoke out about Trump’s July phone call with the president of Ukraine. Vermont Gov. Phil Scott was the first Republican governor to publicly support an impeachment inquiry into Trump. The action is “appropriate,” he said in late September. “Congress has a solemn responsibility to every American to fulfill its role in our government system of checks and balances,” he said. Massachusetts Gov. Charlie Baker also told reporters in September that he supported an impeachment inquiry. “It’s a deeply disturbing situation and circumstance,” he said, “and I think the proper role and responsibility for Congress at this point is to investigate it and get to the bottom of it.” Republican Jim Steineke, the GOP leader of the Wisconsin State Assembly, took a stand against Trump on Friday after the president insisted on Twitter that he was right to ask other countries to investigate Biden. His behavior “cannot be normalized,” Steineke tweeted. Sen. Ben Sasse of Nebraska couldn’t defend Trump’s actions when speaking to reporters in September. “There’s obviously some very troubling things here,” he said, though he stopped short of supporting an impeachment inquiry. “Democrats ought not to be using the word ‘impeach’ before they had the whistleblower complaint or read any of the transcript,” he added, referring to the July 25 call with the Ukraine president. But he also criticized Republicans for turning a blind eye. “Republicans ought not to be rushing to circle the wagons and say there’s no there there when there’s obviously a lot that’s very troubling there.” Rep. Will Hurd of Texas, one of several Republican lawmakers to announce in recent months that he won’t seek reelection, told CNN last week that copies of text messages exchanged among U.S. diplomats about Trump’s actions “are indeed damning.” “I think this is serious stuff; these are serious matters,” he said. “This has long-term implications on our foreign policy.” Trump’s public call for China to investigate Biden, he added, “is terrible.” Maine’s Sen. Susan Collins, another fairly regular Trump critic, told reporters over the weekend that she couldn’t stand by his comments about China. “I thought the president made a big mistake by asking China to get involved in investigating a political opponent,” she said. “It’s completely inappropriate.” She also said she expected the House’s impeachment probe would make its way to the Senate. “Should the articles of impeachment come to the Senate — and right now I’m going to guess that they will — I will be acting as a juror as I did in the Clinton impeachment trial,” Collins said. Rob Portman of Ohio said there was no question as to whether Trump was wrong to bring Biden up with the Ukrainians. “The president should not have raised the Biden issue on that call, period,” he told The Columbus Dispatch on Monday. “It’s not appropriate for a president to engage a foreign government in an investigation of a political opponent.” However, he also said he didn’t view that as an impeachable offense. Portman, notably, was among a bipartisan group of senators in 2016 who wrote a letter to Ukraine’s president criticizing a Ukrainian prosecutor for corruption in his office. That prosecutor is the same one Trump has baselessly insisted Biden unfairly targeted because he was investigating a Ukrainian company for which his son, Hunter Biden, served on the board ― the relationship at the center of Trump’s request that Ukraine dig up dirt on the Bidens. This story has been updated throughout.",
      "date": "10/04/2019 05:53 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_biden"
      }
    },
    {
      "title": "Biden To Trump On Ukraine: ‘You’re Not Going To Destroy My Family’",
      "url": "https://search.huffpost.com/click/_ylt=Awr47a_so6tdaBQAM7ZsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558509/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fbiden-trump-ukraine-smears-attacks_n_5d954872e4b02911e11580c2/RK=2/RS=_EpSOB3wX0si1wz4c2TsAPdAo3U-",
      "subtitle": "The former vice president and 2020 rival called out Trump, the target of an impeachment inquiry, for asking the Ukrainian leader to probe Biden and his son.",
      "author": "Sarah Ruiz-Grossman",
      "content": " Former Vice President Joe Biden went hard after Donald Trump on Wednesday, calling him out for “repeatedly smearing” him and his family amid the controversy over the president’s July call with the leader of Ukraine. “Let me make something clear to Trump and his hatchet men and the special interests funding his attacks against me: I’m not going anywhere,” Biden was expected to say at a presidential campaign stop in Reno, Nevada, late Wednesday, according to prepared remarks provided by his Democratic campaign. “You’re not going to destroy me. And you’re not going to destroy my family. I don’t care how much money you spend or how dirty the attacks get.” Last week, House Speaker Nancy Pelosi (D-Calif.) announced a formal impeachment inquiry in response to a whistleblower complaint about a July 25 phone call between Trump and Ukrainian President Volodymyr Zelensky. The complaint said the call revealed Trump “pressuring a foreign country to investigate one of the President’s main domestic political rivals.” According to the White House’s summary of the July call, Trump asked Zelensky to work with his personal attorney Rudy Giuliani and U.S. Attorney General William Barr to investigate Biden, a front-runner in the Democratic race, as well as his son Hunter, based on unfounded corruption allegations. Trump has accused Biden of seeking the removal of a prosecutor in Ukraine when he was Obama’s vice president, supposedly in order to impede an investigation into the Ukrainian gas company on whose board his son was serving. Ukrainian authorities have cleared Biden of any wrongdoing. Earlier Wednesday, Trump repeatedly evaded questions from reporters about comments he made about Biden during the July phone call, including a question on what exactly he had wanted Zelensky to do about the former vice president and his son. “Look, Biden and his son are stone-cold crooked,” Trump claimed amid a long-winded response. “You know it, and so do we.” Biden said Trump’s “scheme” involving Ukraine was because the president was “afraid.” “He’s afraid of just how badly I would beat him next November,” Biden said, according to his prepared remarks. Earlier this week, Biden’s campaign urged TV news outlets to stop putting Giuliani on the air, saying the president’s personal lawyer was spreading “false, debunked conspiracy theories” about Hunter Biden’s dealings in Ukraine during Biden’s vice presidency. Last week, Joe Biden said he was in favor of impeaching Trump if the president refuses to comply with Congress’s investigations. After the release of the White House summary of Trump’s July call with Ukraine, Biden called the president’s actions “an impeachable offense.” Biden joined the rest of the leading Democratic candidates who had been calling for Trump’s impeachment for months. Sens. Kamala Harris (D-Calif.) and Elizabeth Warren (D-Mass.) called for Trump’s impeachment in late spring in response to special counsel Robert Mueller’s April report and May public statement about his investigation into Russia’s 2016 election interference and possible obstruction of justice by Trump. In his Nevada remarks Wednesday, Biden repeated his description of Trump’s actions as an “abuse of power” and said the president placed his “own personal gain ahead of the public good.” “I’m not backing down. And I’m not going to be distracted by the lies, smears, distortions and name-calling,” Biden said. “I’m going to let Congress do its job on impeachment.”",
      "date": "10/02/2019 09:51 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_biden"
      }
    },
    {
      "title": "Ukraine Reviews Cases Involving Owner Of Company That Employed Biden Son",
      "url": "https://search.huffpost.com/click/_ylt=Awr9CKkIpKtdNQYAgYFsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558536/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fukraine-cases-burisma-hunter-biden_n_5d97353fe4b0f5bf79731a4f/RK=2/RS=kgG.Qz3ZJ5nxKWDfeyTDkh3jmHU-",
      "subtitle": "There has been no evidence of wrongdoing by either former Vice President Joe Biden or his son.",
      "author": "",
      "content": "ZHYTOMYR, Ukraine (AP) — Ukraine’s Prosecutor General said on Friday that his office is reviewing all the cases that were closed by his predecessors, including several related to the owner of a gas company where former Vice President Joe Biden’s son sat on the board. Ruslan Ryaboshapka’s comments came amid an impeachment inquiry against U.S. President Donald Trump that relates to a call he made to the Ukrainian president asking him to investigate the Democratic presidential candidate and his son’s work in Ukraine. Ryaboshapka told reporters in Kyiv that prosecutors are auditing all the cases that were closed or dismissed by former prosecutors, including several related to Mykola Zlochevsky, owner of the gas company Burisma that hired Hunter Biden in 2014, at the same time his father was leading the Obama administration’s diplomatic dealings with Kyiv. Though the timing raised concerns among anti-corruption advocates, there has been no evidence of wrongdoing by either the former vice president or his son. “We are now reviewing all the cases that were closed or split into several parts or were investigated before, in order to be able to rule to reverse those cases where illegal procedural steps were taken,” Ryaboshapka said. When asked by a reporter if they are reviewing cases related to Burisma and Zlochevsky, he said that there are 15 cases where Zlochevsky and businessman Serhiy Kurchenko are mentioned. He did not specify how many, if any, were related to Hunter Biden’s work at Burisma. Ryaboshapka was mentioned in the July 25 call between Trump and Ukrainian President Volodymyr Zelenskiy, who assured Trump that Ryaboshapka was “his man” and that he would resume investigations into Burisma. The prosecutor general insisted on Friday that he did not feel any pressure over the Burisma case. “Not a single foreign or Ukrainian official or politician has called me or tried to influence my decisions regarding specific criminal cases,” he said. A whistleblower last month revealed that Trump in a phone call asked Zelenskiy to resume the probe into Joe Biden and his son. The July 25 call has since triggered an impeachment inquiry against Trump. ___ Nataliya Vasilyeva contributed to this report from Moscow.",
      "date": "10/04/2019 08:08 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_biden"
      }
    },
    {
      "title": "Former Ukraine President Says Joe Biden Never Asked To Close Cases",
      "url": "https://search.huffpost.com/click/_ylt=Awr9CKkIpKtdNQYAf4FsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558536/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fpetro-poroshenko-joe-biden-trump_n_5d95f5fce4b0da7f66227dcf/RK=2/RS=5Hud0rz1ov0I1YqXG2CE5qVhNBw-",
      "subtitle": "Petro Poroshenko pushed back on Trump’s unsupported claim that Biden pressured Ukraine to shut down a probe into a company connected to his son.",
      "author": "Hayley Miller",
      "content": " Former Ukraine President Petro Poroshenko said Joe Biden never asked him to close an investigation, challenging President Donald Trump’s unsubstantiated claim that Biden abused his power when he was vice president to protect his son. “The former vice president, at least in personal conversations, didn’t raise any requests to open or close any concrete cases,” Poroshenko said in a statement to Bloomberg News published Wednesday. Poroshenko, elected Ukraine’s leader in 2014, left office in May after Volodymyr Zelensky defeated him in the country’s presidential election. According to a whistleblower complaint filed by a U.S. intelligence official, Trump repeatedly pressured Zelensky during a July phone call to investigate Biden, a Democratic front-runner in the 2020 presidential race, and his son, Hunter. Trump has claimed that Biden, as vice president, called for the removal of a corrupt prosecutor in Ukraine to impede an investigation into a Ukrainian gas company that had Hunter Biden on its board. A bipartisan congressional caucus on Ukraine and other world leaders also were calling for the removal of the prosecutor at the time. Ukrainian authorities later cleared Hunter Biden of any wrongdoing. The whistleblower complaint prompted House Speaker Nancy Pelosi (D-Calif.) last week to announce the opening of a formal impeachment inquiry into Trump. The president has claimed his call with Zelensky was “perfect” and that he is the victim of a “witch hunt” orchestrated by the Democrats. Poroshenko told The Los Angeles Times this week that he felt no pressure from Trump or his personal attorney, Rudy Giuliani, to open a questionable investigation into Biden. “If they asked, I would have said, sorry, there is an official channel for that,” Poroshenko said, adding that he may not have been informed if federal prosecutors working in his government had received such requests. “Ukraine should not be involved,” Poroshenko told the LA Times of the political controversy surrounding Trump’s call with Zelensky. “I hate the idea that mistakes involved Ukraine in an internal political matter.”",
      "date": "10/03/2019 11:14 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_biden"
      }
    },
    {
      "title": "What, Me Worry? Marco Rubio Shrugs Off Trump’s Call For China To Probe Biden As Joke",
      "url": "https://search.huffpost.com/click/_ylt=Awr9CKkIpKtdNQYAfYFsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558536/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fmarco-rubio-china-donald-trump-biden-investigation-joke_n_5d9807ece4b0fc935eda4a45/RK=2/RS=Ev3xqJ3jKK3vh_UM3auQexJN0Vs-",
      "subtitle": "“Rubio, thy name is cowardice,” George Takei responds on Twitter.",
      "author": "Mary Papenfuss",
      "content": " Sen. Marco Rubio (R-Fla.) appeared so very unconcerned Friday about Donald Trump calling on China to investigate his political rival Joe Biden that he had a difficult time presenting a coherent defense. Trump, speaking to reporters outside the White House on Thursday, urged China to investigate the former vice president, just hours before CNN reported that he had raised the “political prospects” of Biden — and Sen. Elizabeth Warren (D-Mass.) — in a June phone call with Chinese President Xi Jinping. Trump also repeated his call to Ukraine to investigate Biden and his son — the exact request he made on a phone call in July that drew a whistleblower complaint, leading the House to formally launch an impeachment inquiry. Rubio suggested Trump was merely “needling” the press Thursday. Rubio has been a longtime critic of China’s autocratic government and its imprisonment and torture of dissidents. “I don’t know if that’s a real request or him just needling the press, knowing that you guys were going to get outraged by it,” he said at a Florida news conference. “He’s pretty good at getting everyone fired up. The media responded right on task.” “I think he did it to ... provoke you. He plays it like a violin, and everyone falls right into [it]. That’s not a real request.” Former Acting U.S. Attorney General Sally Yates tweeted Friday that she believes Trump’s remarks — proclaiming impeachable activities out loud — is a way to “hypnotize” the American public and normalize his behavior. Twitter wits had some other observations about Rubio.",
      "date": "10/05/2019 12:08 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_biden"
      }
    },
    {
      "title": "Mike Pence Fully Backs Asking Foreign Leaders To Go After Biden",
      "url": "https://search.huffpost.com/click/_ylt=Awr9CKkIpKtdNQYAe4FsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558536/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fmike-pence-defend-trump-ukraine_n_5d963739e4b0da7f66236fbe/RK=2/RS=LM__jSeE05i3t.dQFz58X9rYuPs-",
      "subtitle": "The vice president defended Trump’s call for both China and Ukraine to investigate Democratic rival Joe Biden in the runup to 2020.",
      "author": "Carla Herreria",
      "content": " Vice President Mike Pence gave his full-throated support to Donald Trump on Thursday after the president openly encouraged foreign leaders to dig up dirt on his potential 2020 opponent Joe Biden. Asked whether he thought it was “appropriate” that Trump suggested both China and Ukraine should investigate the former vice president and his son Hunter Biden, Pence told reporters that he and Trump were elected to “drain the swamp.” “I think the American people have a right to know if the vice president of the United States or his family profited from his position as vice president during the last administration,” he told reporters at the roundtable event with Latino business leaders in Scottsdale, Arizona. Trump is now facing an impeachment inquiry stemming from a whistleblower complaint from within the intelligence community alleging that Trump repeatedly pressured Ukrainian President Volodymyr Zelensky to investigate the Biden family while also withholding hundreds of millions of dollars in military aid for the war-torn country. The complaint also claims that White House officials attempted to cover up the misconduct. After the White House released a summary the July 25 phone call at the center of the complaint and congressional investigators released a redacted version of the complaint, Trump began openly calling on foreign leaders to investigate the Biden family over Hunter Biden’s business dealings while his father was vice president. “China should start an investigation into the Bidens, because what happened in China is just about as bad as what happened with Ukraine,” Trump told reporters at the White House earlier Thursday. “I would say that President Zelensky, if it were me, I would recommend that they start an investigation into the Bidens,” Trump also said. House Speaker Nancy Pelosi (D-Calif.) launched a formal impeachment probe into the growing scandal after the whistleblower complaint pointed to clear evidence of Trump soliciting foreign interference in the election. Pence has been drawn into the scandal after The Washington Post reported Wednesday that the vice president’s top aide was on the phone call in which Trump pushed Zelensky to look into the Bidens. According to the Post, Pence would have had a copy of the transcript of the call before he met with Zelensky in September. However, an official who spoke to the paper said Pence wasn’t aware of Trump’s efforts to encourage an investigation. Speaking at the roundtable on Thursday, Pence said Trump had tasked him with meeting with Zelensky to discuss a “lack of European support” and “corruption.” He continued to defend Trump’s call with Zelensky, insisting that “the president was raising issues that were appropriate and of genuine interest to the American people.” Trump’s calls for a Biden investigation stem from Hunter Biden’s position as a board member of a Ukrainian gas company. The president has been pushing the debunked theory that then-Vice President Joe Biden called for the removal of a corrupt Ukrainian prosecutor to impede an investigation into the company. At the time, a bipartisan group of lawmakers had also pushed for anti-corruption efforts in Ukraine, as CNN reported. Ukrainian authorities later cleared Hunter Biden of any wrongdoing.",
      "date": "10/03/2019 06:05 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_biden"
      }
    },
    {
      "title": "Republicans Signed Letter Supporting The Ukraine Reforms Biden Was Pushing",
      "url": "https://search.huffpost.com/click/_ylt=Awr9CKkIpKtdNQYAeYFsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558536/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fjoe-biden-republican-support-letter-ukraine_n_5d960e2ee4b0da7f6622ccc5/RK=2/RS=RZFT14oeB8eLiYytxhqYAfUESqE-",
      "subtitle": "A 2016 letter expressing bipartisan support for “urgent reforms” within Ukraine’s prosecutor general’s office appears to undermine Trump’s claims.",
      "author": "Hayley Miller",
      "content": " A bipartisan group of lawmakers echoed then-Vice President Joe Biden’s push for anti-corruption reforms in Ukraine, including within the country’s office of the prosecutor general, according to a 2016 letter unearthed by CNN. In the letter, Sens. Rob Portman (R-Ohio) and Dick Durbin (D-Ill.), co-chairs of the bipartisan Senate Ukraine Caucus, pressed Ukraine’s then-President Petro Poroshenko to take action on “entrenched corruption” within his government. “We recognize ‎that your governing coalition faces not only endemic corruption left from decades of mismanagement and cronyism, but also an illegal armed seizure of territory by Russia and its proxies,” they wrote in the letter. ”[We] urge you to press ahead with urgent reforms to the Prosecutor General’s office and judiciary.” The letter ― also signed by Sens. Ron Johnson (R-Wis.), Mark Kirk (R-Ill.), Chris Murphy (D-Conn.), Jeanne Shaheen (D-N.H.), Richard Blumenthal (D-Conn.) and Sherrod Brown (D-Ohio) ― appears to undermine President Donald Trump’s unsubstantiated claim that there was “quid pro quo” when then-Vice President Biden withheld aid to Ukraine to push the country’s leaders to fire its prosecutor general, Viktor Shokin. Trump claims Biden did so for the purpose of impeding an investigation into Burisma, a Ukrainian gas company upon whose board Hunter Biden served. No evidence has been brought to light to suggest this. Biden boasted in 2018 about withholding $1 billion in aid to Ukraine to get them to oust Shokin, which Trump has claimed amounts to a “quid pro quo.” But foreign policy experts, including a former U.S. ambassador to Ukraine, say Biden’s actions were an appropriate form of diplomatic pressure. Biden wasn’t the only person calling for Shokin’s removal from office. Members of Congress (as evidenced by the 2016 letter of support), European leaders and international organizations were all pushing for the notoriously corrupt prosecutor to be fired. Shokin’s office had opened an investigation into Burisma, but it was dormant by the time Biden was working on anti-corruption efforts in Ukraine. Ukrainian authorities have cleared Biden of any wrongdoing related to Shokin’s firing. Neither Portman nor Kirk, who is no longer in office, immediately responded to HuffPost’s requests for comment. Johnson wrote a letter with Sen. Chuck Grassley (R-Iowa) last week that, in part, called on Attorney General William Barr to investigate allegations that Biden called for Shokin’s removal to help his son. “The United States, the European Union, the I.M.F., and Ukraine’s leading reform figures were all pressing for Viktor Shokin to be removed from office because he was one of the biggest obstacles to fighting corruption in the entire country,” Biden campaign spokesman Andrew Bates told HuffPost in a statement. “This was a bipartisan goal in Congress as well,” he added. “It is unfortunate that Senator Johnson seems to have forgotten a time when he put the country’s values over his own politics, but perhaps re-reading his well-articulated words whole-heartedly agreeing with Joe Biden’s push to move the anti-corruption cause in Ukraine forward will help him on his journey back to intellectual consistency.” Asked for comment, a spokesperson for Johnson referred HuffPost to comments the senator made Wednesday during an interview with radio station WRRD. “I don’t know what’s true, I don’t know what’s not true,” Johnson said while discussing some of the issues referenced in the letter he wrote with Grassley. “If something happened, the American people should know. If something didn’t happen, the American people need to know so we can get this behind us. It’s about uncovering the truth.” Trump’s obsession with Biden’s dealings with Ukraine resulted in a whistleblower complaint filed in August by a U.S. intelligence official that alleges Trump repeatedly pressured Ukrainian President Volodymyr Zelensky to investigate Biden and may have withheld military aid as leverage. The complaint prompted House Speaker Nancy Pelosi (D-Calif.) to announce the opening of a formal impeachment inquiry into Trump last week. Democrats say Trump’s exchange with Zelensky amounts to an attempt to seek foreign interference in the 2020 election. Trump has claimed his call with Zelensky was “perfect” and that he withheld aid because he was annoyed that European allies were not paying enough. He praised Portman on Wednesday for backing up that explanation, declaring “there’s nobody more honorable” than him. The White House did not immediately respond to HuffPost’s request for comment.",
      "date": "10/03/2019 01:55 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_biden"
      }
    },
    {
      "title": "Habitually Dishonest Trump Pushes His Biggest Lie Yet About The Democrat He Fears Most",
      "url": "https://search.huffpost.com/click/_ylt=Awr9CKkIpKtdNQYAd4FsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558536/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2ftrump-biden-big-lie_n_5d9cf04ee4b06ddfc50fdff9/RK=2/RS=Ozq2a77z7LEJOnaNIbTNWhwx6AI-",
      "subtitle": "Trump’s accusations against Joe Biden turn reality on its head. Biden’s Ukraine efforts were more likely to hurt his son’s company, not help it.",
      "author": "S.V. Date",
      "content": " Nearly three years and some 7,000 falsehoods into his term and now under threat of impeachment, President Donald Trump continues pushing one of his biggest lies yet: That Joe Biden while vice president intervened overseas on his son’s behalf. “Sleepy Joe Biden … forced a tough prosecutor out from investigating his son’s company by threat of not giving big dollars to Ukraine,” Trump wrote in a statement he posted on Twitter last month. “The Biden family was PAID OFF, pure and simple!” he wrote Sunday. Yet Trump’s claims about Biden are not only unfounded, but a review of the timeline shows they turn facts and recent history on their head ― a black-is-white, night-is-day reinterpretation to advance Trump’s political goal. “It’s pretty hard to wrap your head around,” said Robert Weissman, president of the liberal group Public Citizen, adding that trying to understand Trump’s claims on the topic first requires “a re-read of ‘Alice in Wonderland.’” Biden had been pushing for anti-corruption reforms in Ukraine since shortly after he became vice president in 2009 ― not as a freelance effort, but as part of the entire U.S. government and its Western allies’ attempts to improve the business climate for investment there and nudge the country away from Russia. Biden’s son Hunter did not join the Ukrainian energy company Burisma’s board until 2014. And the push to increase corruption investigations in Ukraine was likely to hurt Burisma, not help it. That’s because the probes were being thwarted to protect Burisma’s owner when Joe Biden told Ukrainian officials that $1 billion in loan guarantees would be blocked if the country’s prosecutor general at the time was not fired. That prosecutor, Viktor Shokin, was generally regarded as corrupt and unwilling to press cases against politically connected targets. Following the vice president’s ultimatum, Shokin was ousted in March 2016. “Donald Trump is so terrified of facing off against Joe Biden in 2020 that he committed an unprecedented abuse of power and threw his presidency into free fall by trying to force Ukraine to spread a universally debunked, right-wing conspiracy theory about him,” said Andrew Bates, a spokesman for Biden’s presidential campaign. “Now he’s melting-down on television and publicly begging other foreign countries to bail his flailing campaign out with lies.” Yet for Trump, attacking Biden while simultaneously trying to enmesh him in a previously separate conspiracy theory that absolves both Trump and Russia from questions about foreign meddling in the 2016 election has become an obsession, one top longtime Trump adviser told HuffPost. Not only is Trump making baseless remarks about it in public and on Twitter, he has dispatched the Justice Department, the State Department and his private lawyer, Rudy Giuliani, to travel the globe to prove it true. “He’s a one-man wrecking crew,” the adviser said on condition of anonymity. “I don’t know why he just doesn’t get over it. Everybody wishes he would knock it off.” Trump’s White House did not respond to HuffPost queries for this story. Authoritarianism expert Ruth Ben-Ghiat, meanwhile, said that Trump’s increasing willingness to use his executive branch agencies to further his re-election campaign and to block investigations into him has dangerous historical parallels ― such as Italian strongman Benito Mussolini in the 1930s. “Mussolini did this before he shut down an investigation that was ruining him by declaring dictatorship,” said Ben-Ghiat, a New York University history professor. “The openness of it all is the next stage of declaring you are above the law.”   Trump and his top advisers decided last year that Biden would be his toughest general election opponent in 2020, and Trump long has been frequently attacking him in Twitter statements and public comments. But earlier this year, that desire to hurt Biden’s candidacy merged with a sweeping conspiracy theory that Giuliani began pushing that wove together many of the president’s longtime angsts ― a unified Trump grievance theory, of sorts. According to this scheme, as described on various right-wing internet pages and talk radio hosts, Russia did not actually interfere in the 2016 election to help Trump but was only made to look as if it had by forces in Ukraine loyal to former President Barack Obama. They worked to get GOP consultant Paul Manafort elevated to run Trump’s campaign in the spring of 2016 so they could then reveal his corruption later that summer, forcing Trump to fire him. Proof of all this, according to these conspiracy theorists, will be revealed when the Democratic National Committee server that was hacked in 2016 is found in Ukraine, possibly along with Democratic nominee Hillary Clinton’s 33,000 deleted emails. (The theory fails to explain why Obama and his supposed Ukrainian operatives did not publicize the Trump campaign’s connections with Russian spies before the election, rather than only afterward, thereby allowing him to win.) Not a single part of the conspiracy theory has any basis in fact. But Trump embraced it because, the White House adviser said, it meshes with his unwillingness to accept that Russia helped him win the 2016 election. Not only did Trump bring up the far-fetched theory during the now-infamous July 25 telephone call with Ukrainian president Volodymyr Zelensky, but he dispatched Attorney General William Barr to find evidence for it, which Barr has been doing much of this year during unpublicized trips overseas, including one last month to Italy. Ironically, Trump’s readiness to accept Giuliani’s debunked conspiracy theory as fact is now likely to get him impeached by the House. “If he continues to focus on that white whale, it’s going to bring him down,” former Trump homeland security adviser Tom Bossert told ABC News last month. “It’s not only a conspiracy, it is completely debunked…. The DNC server and that conspiracy theory has got to go, they have to stop with that, it cannot continue to be repeated in our discourse.” That debunked theory, of course, was one of the topics during that July 25 phone call ― which wound up triggering the House impeachment inquiry after a whistleblower filed a complaint accusing Trump of soliciting campaign help from Ukraine’s president. That account was then backed up by a rough transcript of the call that Trump ordered released late last month. Additional whistleblowers are now corroborating concerns about the call, as well. How much those accounts are even relevant at this point is unclear. Trump has repeatedly defended his decision to hold up $400 million in aid to Ukraine and to then ask Zelensky to investigate Biden. Last week on the White House South Lawn, he asked a second country to target Biden and his son. “By the way, likewise, China should start an investigation into the Bidens, because what happened in China is just about as bad as what happened with ― with Ukraine,” he said before climbing aboard a Marine helicopter on his way to Florida. Democrats are proceeding under the notion that merely asking for that assistance is an impeachable abuse of power. And so far, at least a few Republican senators ― 20 of whom would be needed to remove Trump from office ― are giving signals that they might agree. “I thought the president made a big mistake by asking China to get involved in investigating a political opponent. It’s completely inappropriate,” Sen. Susan Collins of Maine said over the weekend. She added that she would not comment further: “Should the articles of impeachment come to the Senate, and right now I’m going to guess that they will, I will be acting as a juror as I did” in the 1999 impeachment trial of then-President Bil Clinton.   Trump, despite the impeachment inquiry he has sparked, seems undeterred. He continues to repeat his false accusations against Biden, and even had his campaign put $10 million into a TV ad to repeat them on national television. (At least one cable network has refused to run the ad because of its blatant falsehoods.) Yet as galling as Trump critics find the false corruption accusations is the fact that Trump has the audacity to make them. Since taking office, Trump has steered his campaign, his party, other Republican candidates and groups, lobbyists with business before the executive branch and foreign governments to use his hotels and golf courses, from which he personally profits. Currently, he is pushing the U.S. government to host the next G-7 meeting at his own golf resort in Doral, Florida – which would put tens of millions of American taxpayer dollars into his own pocket, as well. Both actions are a dictionary definition of corruption ― using an official position to enrich oneself ― and Trump is doing them out in the open. “This is not just the most corrupt president but the most blatantly corrupt,” said Jordan Libowitz, an official with the watchdog group Citizens for Responsibility and Ethics in Washington. Public Citizen’s Weissman said that Trump’s Orwellian insistence that Americans believe him, rather than the evidence of their own eyes, is even more corrosive to democracy. “There’s a deeper problem in the corruption of our language, and the corruption of our notion of reality, and the corruption of our idea of truth,” he said. And while ethics groups agree that Hunter Biden’s work overseas in the years that his father was vice president created at least the appearance of a conflict of interest for his father, Trump, they say, has little standing to criticize it. Not only does his elder daughter, son-in-law and two adult sons continue to benefit financially from Trump’s presidency, but Trump himself continues to benefit from projects in countries affected by decisions he makes as president. This week, for example, Trump was informed that Turkey intended to move into northern Syria to attack Kurdish forces who had been critical allies in the U.S. war against Islamic State terrorists in Syria and Iraq. Trump responded by deciding to withdraw U.S. troops from the area and then inviting Turkey’s authoritarian ruler, Recep Tayyip Erdogan, to visit the White House next month. Trump has a licensing deal with Trump Towers Istanbul that has provided him as much as $7 million over the last three years ― a business arrangement Trump himself conceded was a “conflict of interest” before he was elected. Libowitz said Turkish officials had also made 14 visits to Trump’s hotel near the White House ― more than by any other country. “If President Trump wants to talk about corruption, we’re all for that,” he said. “But talk of corruption starts at home, or in this case, five blocks from his home.” Trump, nevertheless, appears unfazed by sinking poll numbers and rising public support for his removal from office. On Monday, during a White House photo opportunity, he appeared to lump House Speaker Nancy Pelosi and House Intelligence Committee chairman Adam Schiff, both California Democrats, into the conspiracy against him. “They should really be looked at very strongly because what they did is unthinkable.  What they did to this country is unthinkable,” he said. “It’s so important that we get to the bottom.”",
      "date": "10/08/2019 06:48 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_biden"
      }
    },
    {
      "title": "Joe Biden Takes On Trump",
      "url": "https://search.huffpost.com/click/_ylt=Awr9CKkIpKtdNQYAdYFsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558536/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fjoe-biden-takes-on-trump_n_5d975dd7e4b02911e11a367f/RK=2/RS=EqOpNKmgHDEoCqCtZ8.IjVQgkB0-",
      "subtitle": "null",
      "author": "",
      "content": "",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_biden"
      }
    },
    {
      "title": "White House Officials Absent From Sunday Shows As Ukraine Controversy Grows",
      "url": "https://search.huffpost.com/click/_ylt=Awr9CKkIpKtdNQYAc4FsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558536/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fwhite-house-sunday-morning-shows_n_5d9a17dde4b03b475f9b1cb8/RK=2/RS=tqL0g8VG8PcMNGJNhX8B1no4Zgk-",
      "subtitle": "Trump’s facing an impeachment inquiry and not a single White House official signed on to answer questions about it.",
      "author": "Hayley Miller",
      "content": " As Sunday morning political talk shows debated and discussed the impeachment inquiry into President Donald Trump and his dealings with Ukraine, there was a glaring absence from their lineups: White House officials. Last week, senior White House adviser Stephen Miller defended Trump on “Fox News Sunday.” Secretary of State Mike Pompeo gave interviews to ABC’s “This Week” and CBS’s “Face the Nation” the week before. This week birthed several major developments regarding impeachment and Trump’s push for foreign leaders to investigate former Vice President Joe Biden, his potential Democratic opponent in the 2020 presidential election. But not a single White House official made the Sunday morning rounds this week on the “big five” networks: ABC, CBS, NBC, Fox and CNN. The White House did not immediately respond to HuffPost’s request for comment. Jake Tapper, host of CNN’s “State of the Union,” said Sunday that his show invited the White House to participate, but it did not offer a guest. Trump’s personal attorneys, Rudy Giuliani and Jay Sekulow, as well as top Republicans in the House and Senate were also invited but either declined or did not respond, he said. A spokesperson for Fox News said the network was unable to book a White House official for Sunday’s program. “We reached out for relevant White House guests and we were told they were unavailable, so we went with bipartisan members of the House Intelligence committee leading the impeachment inquiry,” the spokesperson told HuffPost in a statement. ABC, CBS and NBC did not immediately respond to HuffPost’s requests for comment about whether White House officials also snubbed their programs. The lack of White House officials on Sunday shows didn’t stop Trump and his allies from rolling out his defense. Republican lawmakers appeared ready to push the White House’s narrative on Sunday, shrugging off news that a second whistleblower had come forward with firsthand information about Trump’s July call with Ukrainian President Volodymyr Zelensky, the center of the impeachment inquiry. Rep. Chris Stewart (R-Utah), a member of the House Intelligence Committee that’s investigating Trump’s dealings with Ukraine, told “Fox News Sunday” that he’s “not at all” concerned about a second whistleblower. Giuliani appeared on Fox News late Sunday morning, where he shouted at host Howard Kurtz for pushing back on his Ukraine conspiracy theories. “Could you just listen for one second?” Giuliani shouted at Kurtz, who later shook his head in disbelief. “You don’t let me get a sentence out. You contradict me immediately.” It’s unclear whether ABC, CBS and NBC refrained from inviting Giuliani on their programs Sunday after Biden’s campaign sent a letter to the “big five” networks last week urging them to not invite the former New York City mayor as a guest. “Giving Rudy Giuliani valuable time on your air to push these lies in the first place is a disservice to your audience and a disservice to journalism,” a pair of top Biden advisers wrote in the letter. Trump, whose White House hasn’t given a press briefing in months, fired off a spate of tweets during the Sunday morning shows that attacked Democrats and doubled down on his call for Biden to be investigated. “It is INCREDIBLE to watch and read the Fake News and how they pull out all stops to protect Sleepy Joe Biden and his thrown out of the Military son, Hunter,” the president tweeted. “As lawyers & others have stated, as President, I have an OBLIGATION to look into possible, or probable, CORRUPTION!” None of the Republican guests on this week’s Sunday morning talk shows offered a direct answer when asked if there was a record of Trump asking foreign leaders to investigate any other American besides Biden on corruption. This article has been updated to include comment from Fox News.",
      "date": "10/06/2019 04:32 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_biden"
      }
    },
    {
      "title": "Biden Campaign Skewers New York Times For Helping Trump Spread Debunked Conspiracy",
      "url": "https://search.huffpost.com/click/_ylt=Awr9CKkIpKtdNQYAcYFsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558536/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fbiden-new-york-times-conspiracy-theory-debunked-ukraine_n_5d9ebe15e4b02c9da0441876/RK=2/RS=mUfmaQfrOed7OTyK0QeYpQNHBK8-",
      "subtitle": "The Times was criticized for prioritizing “sensationalism” over “truth” in its spread of a “baseless conspiracy theory” about Biden and Ukraine.",
      "author": "Dominique Mosbergen",
      "content": " Democratic presidential hopeful Joe Biden’s campaign has excoriated The New York Times for helping to spread what it described as a “baseless conspiracy theory” advanced by President Donald Trump and his personal attorney Rudy Giuliani, and for prioritizing sensationalism over “truth and judiciousness.” “Are you truly blind to what you got wrong in 2016,” Biden’s deputy campaign manager Kate Bedingfield wrote in a Wednesday letter addressed to the Times’ executive editor Dean Baquet. “Or are you deliberately continuing policies that distort reality for the sake of controversy and the clicks that accompany it?” The letter, obtained by Oliver Darcy, a senior media reporter at CNN, accused the Times of “active participation” in the “smear campaign” against Biden concocted by Trump and his allies. The Trump camp has been pushing a conspiracy theory for months about Biden’s alleged corruption in his dealings with Ukraine. They claim Biden, during his tenure as vice president, withheld $1 billion in aid to Ukraine to compel the country’s firing of a top prosecutor in order to protect his son, Hunter Biden. While it’s true that Biden, following a foreign policy position of the Obama administration, urged Ukrainian leaders to oust the prosecutor, Viktor Shokin, there’s no evidence that he did it to help his son. Despite the facts, the Times still disseminated this conspiracy theory, Bedingfield said. She pointed specifically to a widely criticized article published in the paper on May 1 that said in its headline that Biden was facing “conflict of interest questions” regarding Ukraine that were “being promoted by Trump and allies.” The story, written by reporter Ken Vogel and freelance writer Iuliia Mendel, described how Biden had appealed to Ukrainian leaders for Shokin’s ouster and how his son Hunter Biden had a “stake in the outcome” as he was on the board of Burisma, a Ukrainian energy company that had been in Shokin’s “sights.” Vogel’s and Mendel’s story included a line stating that “no evidence has surfaced that the former vice president intentionally tried to help his son by pressing” for Shokin’s dismissal. However, as The Washington Post’s Erik Wemple pointed out at the time, that caveat comes 19 paragraphs into the story. “In those first 19 paragraphs is a knot of details bound to be mangled by cable-news hosts and pundits in the coming months,” Wemple, the Post’s media critic, wrote in a column. In her letter to Baquet, Bedingfield pointed out that the Times’ reporting had promptly been challenged by Bloomberg News, which said the investigation into Burisma had been “dormant” at the time Biden was discussing Shokin’s future with Ukrainian leaders. Bedingfield also noted that Mendel, one of the co-authors of the Times story, joined the Ukrainian government as a spokesperson for the president of Ukraine just weeks after the article was published. Biden’s campaign also took issue with an op-ed critical of the Bidens published in the Times on Wednesday by author Peter Schweizer, who was lambasted by Bedingfield as a “discredited, right-wing polemicist.” Schweizer “has been one of the top people pushing the claim that Biden abused his office,” Darcy wrote in CNN’s Reliable Sources newsletter, adding that Schweizer ― a senior contributor at right-wing site Breitbart ― previously pushed the debunked conspiracy theory about Hillary Clinton benefiting from a “pay-for-play” scheme involving uranium reserves. In response to the Biden campaign’s letter, the Times defended its coverage of Biden and his son as “fair and accurate.” The Times “will continue to cover Joe Biden with the same tough and fair standards we apply to every candidate in the race and we’re happy to sit down with Biden advisers anytime to discuss news coverage,” a spokesman told Darcy, adding that Schweizer’s op-ed had been published in the Opinion section of the newspaper, “where their mission is to invite intelligent discussion on a range of opinions and ideas.” Bedingfield’s dressing-down of the Times follows two other letters sent this week by the Biden campaign to Facebook and Twitter. In those letters, Biden’s team criticized the companies for allowing a Trump campaign video ad that pushes the Biden-Ukraine conspiracy to run on their platforms ― and urged them to block the clip. Facebook has refused to remove the ad, citing a “fundamental belief in free expression” and “respect for the democratic process.” Twitter has yet to respond publicly to the request. The dissemination of “objectively false information to influence public opinion poisons the public discourse and chips away at our democracy,” Biden campaign spokesman TJ Ducklo said in a statement about the ad to CNN. “Whether it originates from the Kremlin or Trump Tower, these lies and conspiracy theories threaten to undermine the integrity of our elections in America,” Ducklo added. As NBC News’ Dylan Byers reported Wednesday, Facebook and Twitter aren’t the only platforms that have continued to air Trump’s Biden-Ukraine ad despite its unfounded content. CNN is the only media or tech company that’s banned the ad from its airwaves, Byers said. NBC News, ABC News and YouTube are among the organizations that have not.",
      "date": "10/10/2019 06:00 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_biden"
      }
    },
    {
      "title": "Joe Biden Releases Plan To Make College More Affordable",
      "url": "https://search.huffpost.com/click/_ylt=AwrS_AgipKtdORUAfBFsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558563/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fjoe-biden-college-debt-plan_n_5d9bdd99e4b03b475f9eae26/RK=2/RS=jNW9_BjbMHBI174I.KjQBesTLII-",
      "subtitle": "The former vice president isn’t planning to make all college free or erase student debt. But his 2020 campaign insists his higher education plan is just as bold.",
      "author": "Rebecca Klein",
      "content": " The 2020 presidential field is full of candidates with ambitious plans for higher education. Sen. Bernie Sanders (I-Vt.) wants to erase all student debt and make public universities tuition-free. Sen. Elizabeth Warren (D-Ma.) wants to eliminate tuition at public universities and wipe out most student loan debt. Former Vice President Joe Biden’s plan, released Tuesday morning, aims neither to make all public universities free nor eliminate student debt. But his campaign insists his plan is just as big. “We reject any premise this plan is not equally bold as those plans,” said a senior campaign official on the phone with reporters. “The Biden plan reflects the vice president’s and Dr. [Jill] Biden’s deep commitment to making sure every child in this country can pursue a bachelor’s degree or community college.” Biden’s plan focuses on improving access to community college and making all college more affordable for needy students. The Biden family has a strong connection to community college: His wife, Jill, who has a doctorate in education, has spent much of her career teaching in one. “They work so hard and ask for only one thing in return: opportunity,” Jill Biden said on the call. Through legislation, Joe Biden aims to make community college tuition-free for all students for up to two years, with the federal government covering 75% of the cost and states covering the rest. Beyond tuition, qualifying students could use Pell grants and state aid to cover the rest of their expenses, according to the plan. Much of Biden’s vision for higher education builds on what he started with former President Barack Obama, according to campaign officials. The Obama administration proposed tuition-free community college in 2015. However, Biden’s plan also includes a number of measures that would also help students complete their degrees. He proposes a grant that would help community colleges create an emergency fund for students undergoing unexpected financial hardships. The plan also includes an $8 billion investment in community college facilities. Biden’s proposal seeks to make a dent in college debt, albeit one that is specific and targeted to individuals making below a certain amount of money. Biden says he would double the maximum value of Pell grants ― a grant for low-income students that does not need to be repaid. Under a Biden presidency, people making less than $25,000 a year wouldn’t have to make loan repayments or accrue interest, though everyone else would have to pay 5% of their discretionary income. In contrast, Sanders’ and Warren’s student debt plans are far more expansive. Sanders has announced his intention to cancel nearly all student loan debt, regardless of a debtors’ income. Warren would eliminate a portion of debt for every household making below $250,000. Biden’s plan also includes major investments in historically black colleges and universities, tribal colleges and universities, and other minority-serving institutions, including $18 billion in grants and $20 billion for infrastructure. “Student debt both exacerbates and results from [the] racial wealth gap,” according to the plan.",
      "date": "10/07/2019 11:26 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_biden"
      }
    },
    {
      "title": "Giuliani Associates Who Targeted Biden Arrested On Campaign Finance Charges",
      "url": "https://search.huffpost.com/click/_ylt=AwrS_AgipKtdORUAehFsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558563/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2flev-parnas-igor-fruman-giuliani-trump_n_5d9f32f1e4b02c9da045a4c2/RK=2/RS=DF3zNIFiTqcvdE_eic9QOPjkhiM-",
      "subtitle": "Lev Parnas and Igor Fruman, who helped Giuliani investigate Joe Biden, donated to Donald Trump’s presidential campaign.",
      "author": "",
      "content": "Two associates of President Donald Trump’s personal attorney Rudy Giuliani are in law enforcement custody and have been indicted on federal campaign finance charges for allegedly making fraudulent straw donations and funneling foreign money to support Trump and Republican Party candidates. Lev Parnas and Igor Fruman, who helped Giuliani investigate allegations against Joe Biden and his son Hunter, are accused of illegally funding American political campaigns. The Wall Street Journal, which first reported the arrests, said that Parnas and Fruman had donated to Trump’s campaign as well as a pro-Trump super PAC. The charges emerged from the Southern District of New York, but a Justice Department spokesman said the duo would appear at the federal courthouse in Alexandria, Virginia, at 2 p.m., before U.S. Magistrate Judge Michael S. Nachmanoff. U.S. Attorney Geoff Berman said at a press conference Thursday that Parnas and Fruman both had one-way international tickets when they were arrested, and that the investigation is ongoing. Giuliani had lunch with the duo at the Trump International Hotel just hours before their scheduled flight, according to the Journal. Separately on Thursday, House Democrats leading the impeachment inquiry into Trump issued subpoenas to Parnas and Fruman demanding documents related to their work with Giuliani. Before the two were arrested, House investigators had requested that Parnas appear for a deposition Thursday, and Fruman for one on Friday, but their counsel said Tuesday that they would decline. The indictment alleges that Parnas and Fruman committed to raising more than $20,000 for a sitting U.S. congressman, and that Parnas “met with Congressman-1 and sought Congressman-1′s assistance in causing the U.S. Government to remove or recall the then-U.S. Ambassador to Ukraine.” “Congressman-1” is former Rep. Pete Sessions (R-Texas), who sent a letter to Secretary of State Mike Pompeo asking for Marie Yovanovitch to be removed as U.S. ambassador to Ukraine after his meeting with Parnas, according to the Texas Observer. Parnas and Fruman are alleged to have concocted a straw donation scheme to hide their political contributions and give in excess of the campaign contribution limits. A $325,000 donation to the pro-Trump super PAC America First Action was made in the name of Global Energy Producers LLC, a shell corporation purporting to be engaged in the liquified natural gas business, according to the indictment. Donations made to Republican Party candidates in Parnas’ name were actually funded by Fruman, prosecutors allege. It is illegal to make a campaign contribution in someone else’s name. These donations included maximum $2,700 contributions to Sessions and House Republican Minority Leader Kevin McCarthy (R-Calif.). Prosecutors say the illegal foreign donations made through Parnas and Fruman went to “politicians and candidates for federal and state office.” The indictment refers to specific donations to two Nevada state Republican Party politicians. State campaign finance records show the only two Nevada candidates to receive such contributions were gubernatorial candidate Adam Laxalt and attorney general candidate Wes Duncan. The Nevada contributions were allegedly made as part of a failed attempt to secure licenses for a legal cannabis business venture. The foreign donor ― who is only identified as Foreign National-1 and described as a “Russian citizen and businessman” ― allegedly wanted to remain anonymous due to “his Russian roots and current political paranoia about it.” The campaign finance allegations against Parnas and Fruman were first flagged to authorities by the Campaign Legal Center, a nonprofit campaign finance watchdog, in a complaint filed with the Federal Election Commission in July 2018. “The public is now learning just how dangerous dark money can be in U.S. elections, including the potential for illegal foreign funds, which DOJ says were used here,” Trevor Potter, Campaign Legal Center president and former counsel to Sen. John McCain, said in a statement. “The fact that these two individuals were working with Giuliani and Ukrainian government officials to alter U.S. policy in that country will obviously be relevant to the impeachment investigation.” The indictment also names businessmen David Correia and Andrey Kukushkin as defendants. All four defendants are U.S. citizens. Parnas and Kukushkin were born in Ukraine, while Fruman was born in Belarus. Read the indictment below. This story has been updated with comment from the Campaign Legal Center and additional information.",
      "date": "10/10/2019 09:47 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_biden"
      }
    },
    {
      "title": "Mike Pence Won’t Say If He Knew Ukraine Aid Was Tied To Biden Probe",
      "url": "https://search.huffpost.com/click/_ylt=AwrS_AgipKtdORUAeBFsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558563/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fmike-pence-ukraine-joe-biden-investigation-trump_n_5d9f6785e4b087efdbaa7a90/RK=2/RS=CDC3UICM9tMkRkRaBpNVY3hTI2Y-",
      "subtitle": "The vice president dodged the question four times in a row. Not a good look, man!",
      "author": "Jennifer Bendery",
      "content": " The question was straightforward: Did you know that President Donald Trump held up U.S. military aid to Ukraine in order to pressure the foreign government to investigate Trump’s potential 2020 rival, former Vice President Joe Biden? But Vice President Mike Pence stammered and dodged the question four times at a Wednesday press event in Waukee, Iowa. Here’s the White House transcript of Pence’s exchange with NBC News reporter Vaughn Hillyard: Q: But were you ever aware, Mr. Vice President, that interest in the Bidens ― that interest in investigating the Bidens was at least in part of the reason for aid to Ukraine being held up? Were you ever aware? THE VICE PRESIDENT: I ― what ― I never discussed the issue of ― the issue of the Bidens with President Zelensky and ― Q: But within the administration, were you ever aware, within the administration? THE VICE PRESIDENT: What I can tell you is that all of our discussions internally ― I mean the President and our team and our contacts, in my office, with Ukraine ― were entirely focused on the broader issues of the lack of European support and corruption. Q: But you were aware of the interest in the Bidens being investigated ― THE VICE PRESIDENT:  I was ― Q: ― and that being tied to aid to Ukraine being held up? THE VICE PRESIDENT: What I ― well, that’s your question. Let me very clear: The issue of aid and our efforts, with regard to Ukraine, were, from my experience, in no way connected to the very legitimate concern the American people had about corruption that took place, about things that happened in the 2016 election in Ukraine or about ― Q: But were you aware of others in the administration having those conversations? THE VICE PRESIDENT: ― about the issue that former Vice President Biden had his son on the board of a major energy company in Ukraine at a time that Vice President Biden was running the United States’ efforts in Ukraine.  I think the American people have a right to know what was going on. And ― but all of our discussions, all of my discussions with the leadership in Ukraine was entirely focused on President Trump’s priority of supporting (inaudible) ... If Pence did know that Trump had pressed Ukraine’s president to dig up dirt on Biden, that would mean he knew that Trump had potentially committed a federal crime and done nothing about it. It is illegal for anyone, including the president of the United States, to solicit anything of value from a foreign national that relates to a U.S. election. Federal Elections Chair Ellen Weintraub recently reiterated this point on Twitter. “Let me make something 100% clear to the American public and anyone running for public office,” Weintraub said in a statement. “It is illegal for any person to solicit, accept or receive anything of value from a foreign national in connection with a US election.” Watch the video above to see Pence dodge the question about what he knew.",
      "date": "10/10/2019 03:12 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_biden"
      }
    },
    {
      "title": "Facebook Refuses To Pull Trump Campaign Ad That Falsely Accuses Biden Of Corruption",
      "url": "https://search.huffpost.com/click/_ylt=AwrS_AgipKtdORUAdhFsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558563/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2ffacebook-trump-campaign-biden-ad_n_5d9d7f76e4b02c9da040f73b/RK=2/RS=8s8tML48Kvopkw47t.ofmeaAbzU-",
      "subtitle": "Joe Biden has slammed Facebook for allowing the spread of an “objectively false” ad. The clip has already been viewed on Facebook millions of times.",
      "author": "Dominique Mosbergen",
      "content": " A video ad that falsely accuses Joe Biden of withholding $1 billion in aid to Ukraine to benefit his son has been viewed on Facebook millions of times since its release last month by President Donald Trump’s reelection campaign. Biden, who’s vying for the Democratic presidential nomination, has urged Facebook to take the ad down, arguing that it spreads “objectively false information” and “poisons the public discourse.” But Facebook, which has come under scrutiny for its role in spreading misinformation during the 2016 presidential election, has reportedly refused to pull the video, citing its “fundamental belief in free expression” and “respect for the democratic process.” The New York Times, which first reported Facebook’s denial of Biden’s request, reported Tuesday that the social media giant had sent a letter to the former vice president, saying the ad did not violate company policies. “Our approach is grounded in Facebook’s fundamental belief in free expression, respect for the democratic process, and the belief that, in mature democracies with a free press, political speech is already arguably the most scrutinized speech there is,” Katie Harbath, Facebook’s head of global elections policy, said in the letter, per the Times. Harbath’s letter echoed a similar sentiment expressed last month by Nick Clegg, a former U.K. deputy prime minister who is now a Facebook vice president, who said in a speech in Washington that it’s not Facebook’s “role to intervene when politicians speak.” The Biden campaign slammed Facebook’s decision as “unacceptable.” The dissemination of “objectively false information to influence public opinion poisons the public discourse and chips away at our democracy,” Biden campaign spokesman TJ Ducklo told CNN in a statement. “Whether it originates from the Kremlin or Trump Tower, these lies and conspiracy theories threaten to undermine the integrity of our elections in America. It is unacceptable for any social media company to knowingly allow deliberately misleading material to corrupt its platform.” The Trump ad being contested pushes a conspiracy theory that Biden ― according to a narrator in the clip ― “promised Ukraine $1 billion if they fired the prosecutor investigating his son’s company.” While it is true that the elder Biden, then serving as vice president, told Ukrainian leaders in 2016 to fire a top prosecutor if they wanted to get the aid, there’s no evidence that this demand had anything to do with his son, Hunter. The ad has also run on Twitter and YouTube, both told the Times that the ad complied with company policies. Biden’s campaign told CNN that it “would not rule out sending similar letters” to other social media sites requesting the ad’s removal from their platforms. On TV, the ad has run on Fox News, which — like Facebook — denied a Biden campaign request to block the clip. CNN, however, has refused to run the ad. Explaining that decision, a CNN spokesman said last week that the video “makes assertions that have been proven demonstrably false by various news outlets, including CNN.” Facebook has come under fire from the Democratic National Committee, as well as other 2020 presidential hopefuls, for their refusal to block false statements or ads from political candidates. Democratic National Committee CEO Seema Nanda told CNN last week that Facebook was allowing Trump “to mislead the American people on their platform unimpeded.” On Monday, Sen. Elizabeth Warren (D-Mass.) ― who, along with Biden, is considered a front-runner for the Democratic nomination for president ― criticized Facebook’s policies in a series of tweets. “The public deserves to know how Facebook intends to use their influence in this election,” Warren wrote. “For instance, Trump and Zuckerberg met at the White House two weeks ago. What did they talk about?” she added in a subsequent tweet. Warren suggested that Facebook had tweaked misinformation policies to exempt politicians from fact-checking after this meeting with Trump. As Reuters noted, Warren has not offered any evidence to support this claim. “There’s no indication that Zuckerberg or Facebook executives have come to terms with the role their unpreparedness played” in the spread of misinformation during the 2016 election, Warren wrote. “Nor have they shown that they understand what needs to be done to prevent another attack in the 2020 election.”",
      "date": "10/09/2019 05:29 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_biden"
      }
    },
    {
      "title": "Joe Biden Calls For President Trump To Be Impeached",
      "url": "https://search.huffpost.com/click/_ylt=AwrS_AgipKtdORUAdBFsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558563/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fjoe-biden-donald-trump-impeach_n_5d9e1d3ce4b087efdba723a1/RK=2/RS=KwHIjoCxqnBdBuQ6Ldl2KSCMhBs-",
      "subtitle": "“Donald Trump has violated his oath of office, betrayed this nation and committed impeachable acts,” the 2020 Democrat said in New Hampshire Wednesday.",
      "author": "Ryan Grenoble",
      "content": " Former Vice President Joe Biden on Wednesday echoed the calls of rivals in the Democratic presidential primary and called for the impeachment of President Donald Trump. “We all laughed when he said he could stand on Fifth Avenue and shoot someone and get away with it,” Biden told an audience in Rochester, New Hampshire. “No joke! He’s shooting holes in the Constitution and we cannot let him get away with it.” “Donald Trump has violated his oath of office, betrayed this nation and committed impeachable acts. ... He should be impeached,” the 2020 Democratic contender added. “The United States cannot have a president who will abuse whatever power he has available to him in order to get reelected,” Biden continued, adding later, “His lying is matched only by his manifest incompetence as president.” In April, Sen. Elizabeth Warren (D-Mass.) was the first Democratic candidate to call for Trump’s impeachment, based on conclusions made by former special counsel Robert Mueller in his report on Russian influence in the 2016 election and whether Trump obstructed justice. Trump is under fire for having pressured Ukrainian President Volodymyr Zelensky to open an investigation into Biden, whose son Hunter has had business dealings in the country. Trump had, at the time, suspended military aid to Ukraine. “There’s no truth in his charges against me and my son,” Biden said Wednesday. “Zero.” Two separate whistleblowers allege Trump first made the request in a July 25 phone call. The call summary shows the U.S. president asked Zelensky to “do us a favor though” immediately after discussing military aid for his country. Trump has repeatedly denied any wrongdoing, even as he openly called on China to investigate Biden as well. This article has been updated with more information about Trump’s call with Ukraine.",
      "date": "10/09/2019 01:57 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_biden"
      }
    },
    {
      "title": "Trump’s Not Rolling With GOP Theory He Was ‘Joking’ About China Probing Bidens",
      "url": "https://search.huffpost.com/click/_ylt=AwrS_AgipKtdORUAchFsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558563/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2ftrump-china-joke-republicans_n_5da00506e4b06ddfc5175d35/RK=2/RS=PzLBEzeHceHCDRh5QyXVyHx91M0-",
      "subtitle": "Republicans defended the president’s suggestion that China should investigate Joe Biden as a joke. But Trump isn’t laughing.",
      "author": "Josephine Harvey",
      "content": " President Donald Trump was given a chance Thursday to say whether his suggestion that China investigate his political rival Joe Biden was a joke ― and he passed. Trump, asked by reporters on the White House lawn if he had meant his comments in jest, replied: “China has to do whatever they want. If they want to look into something, they can look into it. If they don’t want to look into it, they don’t have to.” He added: “Frankly, as far as I’m concerned, if China wants to look into something, I think that’s great. And if they don’t want to, I think that’s great too. That’s up to China.” Trump told reporters last week that China should start an investigation into Joe Biden and his son Hunter Biden. He made the comments amid impeachment proceedings prompted by his July 25 phone call with Ukranian President Volodymyr Zelensky, in which he requested that foreign government’s aid in digging up dirt on Biden. Multiple Republican lawmakers, when asked if they believed Trump’s China comments were appropriate, defended them as being a joke, including Sen. Marco Rubio (R-Fla.), Rep. Jim Jordan (R-Ohio.), Sen. Roy Blunt (R-Mo.), and Rep. Kevin McCarthy (R-Calif.). “Do you really think he was serious about thinking that China is going to investigate the Biden family?” Jordan said last week. McCarthy commented: “You watch what the president said, he’s not saying China should investigate.” The president’s exact words were: “China should start an investigation into the Bidens.” Trump’s response on Thursday did not suggest he was joking about China. CNN reported last week that Trump raised the topic of Biden’s political prospects during a June 18 phone call with Chinese President Xi Jinping, according to sources familiar with the call. The call record was stored on the same highly secure White House computer system used to house the summary of Trump’s Ukraine call. Trump’s entreaties to China followed GOP questions over Hunter Biden’s position on the board of a Chinese private equity fund in 2013, while his father was the vice president. He accompanied his father on an official trip to China during that time.",
      "date": "10/11/2019 06:39 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_biden"
      }
    },
    {
      "title": "Trump Impeachment Crisis Tees Democratic Candidates Up For Chaotic Fall",
      "url": "https://search.huffpost.com/click/_ylt=AwrS_AgipKtdORUAcBFsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558563/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fdemocratic-candidates-impeachment-trump-chaotic-fall_n_5da1c6b8e4b02c9da04b114d/RK=2/RS=_UjtRgOygCxkt8g_D9qRkb5Fae4-",
      "subtitle": "The Democratic presidential race had largely been static through the summer.",
      "author": "",
      "content": "WASHINGTON (AP) — A Democratic presidential race that had been largely static through the summer has tumbled into a chaotic fall, shaped by unpredictable events and the deepening impeachment crisis surrounding President Donald Trump. Less than four months before voting begins, front-running candidates are facing urgent questions about their ability to challenge Trump, prompted by a health scare for Sen. Bernie Sanders, an uneven response by Joe Biden to the president’s efforts to tie him to the impeachment inquiry and nagging questions about liberal Sen. Elizabeth Warren‘s electability. Lower-tier candidates are struggling just to be heard. The uncertainty is heightening anxieties among Democrats desperate to defeat Trump in 2020. Although impeachment could imperil Trump’s presidency, the process has also highlighted Trump’s skill at discrediting his opponents, sometimes with baseless conspiracy theories. And Democrats appear no closer to sorting out what tactics, what ideology and what person is best-suited to overcome that. Progressive candidates like Sanders and Warren are surging in fundraising and drawing support from a wide swath of voters, according to polls, but face opposition from moderates who question whether now is the time to start the kind of sweeping — and divisive — economic and societal reforms they are pushing. It’s a concern some moderates say has only increased against the backdrop of impeachment. “The divisions we have in the country threaten the health and stability of our democracy. President Trump has fractured so many norms,” former Iowa Gov. Tom Vilsack said in an interview. “Like a patient getting over an illness or injury, we have to first heal the nation’s divisions and reestablish our norms before we have the needed strength to successfully embrace and implement an array of big ideas.” Vilsack, a longtime friend of Biden’s, has not endorsed anyone in the 2020 race. He’s been courted by, and consulted with, numerous candidates, and has spoken regularly with Warren. The Massachusetts senator has energized voters with a menu of detailed policy proposals, a folksy, relatable way of explaining them and a swell of small-dollar donations that brought in more than $24.6 million in the most recent quarter. That’s increasingly turning her into a target for candidates who see her calls for overhauling health care and rebalancing wealth in America as outside the mainstream. Pete Buttigieg, the mayor of South Bend, Indiana, who is trying to break into the upper rung, has focused in particular on Warren’s health care plan, the Sanders’-authored “Medicare for All” single-payer system that Buttigieg describes as a “my-way-or-the-highway approach.” But it’s more than the policy Buttigieg is arguing against. “We have to be able not only to thrill a debate audience or a Twitter following but actually make something happen, which tells us that having the smartest policy is only half the battle when it comes to what will actually make a difference,” Buttigieg said in an interview. For now, Warren advisers are happy to have Sanders still in the race to help absorb those blows rather than becoming the sole target of the attacks. “Politically, it’s good for Warren and Sanders to have each other in the race,” said Adam Green, co-founder of the Progressive Change Campaign Committee. “They bolster each other’s ideas.” The confidence Sanders’ campaign felt last week after announcing a $25.3 million haul in the third quarter — the highest in the race — was lessened after the 78-year-old senator suffered a heart attack. He told reporters this week that he planned to scale back his campaign, then said he had misspoken. He’ll return to the campaign on Tuesday for a debate in Ohio. His advisers privately acknowledge that the timing of the heart attack — which came just as the impeachment inquiry was escalating — may have helped limit the political fallout because attention was focused elsewhere. But they also understand that he will have to more directly address lingering health concerns. Jeff Weaver, Sanders’ chief strategist, dismissed any long-term concerns, noting that the 2020 contest includes several older candidates, including the 73-year-old Trump. “There are a number of older candidates in the race, including the sitting president of the United States, and I can tell you with confidence, there’s only one we can say with assurance whose arteries are completely open,” Weaver said, referencing the stent procedure designed to clear Sanders’ clogged arteries. Biden, 76, stands as the strongest obstacle to Warren and Sanders, fundamentally opposed on policy and pitching a more conciliatory approach to governing. The former vice president was already facing questions about whether he was out of step with the party’s activist liberal base and up for the challenge of taking on Trump before he got pulled into the impeachment inquiry, which centers on Trump’s push for Ukraine to investigate the former vice president and his son. Although Trump’s allegations against Biden are so far without foundation, the president and his allies have aggressively pressed the charges. Biden responded forcefully this week, but only after days of hand-wringing among supporters and advisers who worried he appeared ill-prepared for combatting the kind of asymmetrical political warfare at which Trump excels. Still, Biden backers contend that the mere fact that Trump has appeared focused on trying to take down Biden allows the former vice president to strengthen his electability argument by previewing what a one-on-one race with the president would look like. “He’s able to go out there every day and make this Biden vs. Trump argument,” said John Anzalone, a pollster for Biden. That’s the fear for some lower-tier candidates — that the head-to-head fight between Trump and Biden, and the grassroots support of Warren and Sanders, block out their opportunities for a late surge. Everyone is at risk, including those who have had flashes of success in recent months but are now languishing in the single digits in many polls, including California Sen. Kamala Harris, former Rep. Beto O’Rourke and New Jersey Sen. Cory Booker. Buttigieg said there is no secret strategy for those candidates seeking to break out during this intense fall stride toward the first votes other than engaging in a “respectful and robust” debate of ideas. “Where there’s an important difference, people need to understand that,” he said.",
      "date": "10/12/2019 08:47 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_biden"
      }
    },
    {
      "title": "Donald Trump Is Copying Richard Nixon’s Reelection Misdeeds",
      "url": "https://search.huffpost.com/click/_ylt=AwrS_AgipKtdORUAbhFsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558563/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fdonald-trump-joe-biden-nixon_n_5da4b864e4b0400ea60f57d7/RK=2/RS=rqNWMqUTB_hJElf5Dq1SkpsW5XM-",
      "subtitle": "Nixon’s dirty tricks helped take out his most feared rival Ed Muskie. Trump is trying the same with Joe Biden.",
      "author": "Paul Blumenthal",
      "content": " On a snowy day in Manchester, New Hampshire, Democratic Maine Sen. Edmund Muskie, the front-runner for the party’s 1972 presidential nomination, stood before the offices of the conservative Union Leader newspaper and denounced the paper’s publisher William Loeb for publishing smears against him. “By attacking me, by attacking my wife, he has proved himself to be a gutless coward,” Muskie said in an angry and emotional voice. Some reports claimed tears ran down his cheeks. Muskie, and many historians today, argued those tears were actually the steadily falling snow melting upon impact. But at the time, the reports that Muskie cried fueled a media narrative that he was mentally unstable. He won the New Hampshire primary by a smaller margin than anticipated and rapidly faded in the following contests. Forty-five years later, former vice president Joe Biden, a front-runner for the Democratic Party’s 2020 presidential nomination, stood before a crowd in Las Vegas to give a very similar message as Muskie. “You’re not going to destroy me,” Biden declared on Oct. 2. “And you’re not going to destroy my family. I don’t care how much money you spend or how dirty the attacks get.” What was done to Muskie is precisely what is being done to Biden. The president of the United States orchestrated a secret campaign of smears and deceit meant to destroy the political opponent he perceived as the most threatening to his own reelection. For Muskie, that president was Richard Nixon. For Biden, it’s Donald Trump. Muskie’s downfall was part of a broad operation of illegality orchestrated by the Nixon White House to cover up leaks, spy on political opponents and fix the 1972 Democratic Party primary. It ultimately ended with Nixon’s resignation and pardon. During his career as a California congressman, senator and failed gubernatorial candidate, Nixon was bedeviled by political tricks pulled on him by Democratic Party consultant Dick Tuck. Envious of the tricks deployed against him, Nixon decided to harness them himself. Ahead of the 1972 election, his campaign and the White House hired a host of characters to screw with his opponents in the Democratic Party. The ultimate goal was to get the party to nominate South Dakota Sen. George McGovern, an anti-war figure they believed to be the least electable. (They were right.) One of these characters was Donald Segretti, a University of Southern California frat boy, who was known for pulling political pranks to win student elections. Segretti and his buddies called these pranks “ratfucking.” Segretti and his ratfuckers were given the task of sowing confusion among the Democratic Party presidential candidates Nixon feared the most: former vice president and 1968 presidential candidate Hubert Humphrey, Washington Sen. Henry “Scoop” Jackson and Muskie. Among the many things Segretti and his team did to the Democratic Party presidential field was to forge letters from one campaign making wild allegations against another. They stole Muskie campaign letterhead and sent letters out alleging that sexual misconduct by Humphrey and that Jackson had fathered an illegitimate child with a 17-year-old girl. Muskie had to deny sending the letters while both Jackson and Humphrey were forced to deny the allegations. But what got Muskie up in front of the Union Leader on that snowy day in 1972 was something called the “Canuck Letter.” One of the tricks Segretti and his team pulled was to forge a letter to the editor that purported to be from a Florida man who had asked how Muskie could understand problems faced by African Americans since he represented Maine, a state with a very small African-American population. The letter claimed that Muskie laughed after a staffer said, “Not blacks, but we have Canucks.” At the time, “Canuck” was viewed as a derogatory term for French-Canadians, of which there were many living in New Hampshire. Segretti ended up pleading guilty to three counts of distributing fraudulent campaign material and served four months of his six-month prison sentence. Trump’s attempt to tar Biden with the stench of a Ukrainian corruption investigation is just a grander prank aimed at rigging the 2020 election to his perceived benefit. In a now-infamous July 25 phone call, Trump pressured Ukrainian president Volodymyr Zelensky to investigate a natural gas company that had Biden’s son Hunter Biden on its board. So far, Biden has not suffered in the polls since the controversy erupted after the whistleblower complaint accusing Trump of malfeasance was revealed in September. This is the only way that Trump knows how to do politics. He fanned the flames of birtherism against President Barack Obama, a racist dirty trick aimed at confusing both the public and the press. He latched on to every conspiracy theory imaginable about Hillary Clinton in 2016 ― she was dying, she sold uranium to Russia and so on. He publicly praised the Russian hack of the Democratic National Committee and called for, “Russia, if you’re listening,” to hack some more. And now he’s used the power of his office in an effort to manipulate a foreign country to manufacture a corruption investigation into the potential opponent he fears most. Trump learned these politics from two professional smear merchants. The first was Roy Cohn, the McCarthyite-turned-mob-lawyer with a speciality in character assassination. The second was Nixon’s ultimate fanboy, Roger Stone. Cohn became Trump’s first political adviser starting in the 1970s after the upcoming real estate developer and his father were facing charges of racial discrimination. Cohn taught Trump three key rules for dealing with challenges in business and politics, the author Sam Roberts told Vanity Fair’s Maire Brenner: “1. Never settle, never surrender. 2. Counter-attack, counter-sue immediately. 3. No matter what happens, no matter how deeply into the muck you get, claim victory and never admit defeat.” Before dying of AIDS, Cohn passed off his Trump account to Stone, who had been loosely affiliated with Segretti’s ratfuckers. Stone had pulled his share of dirty tricks as a Nixon hanger-on, including faking a donation from a made-up socialist group to Nixon’s 1972 Republican primary opponent California Rep. Pete McCloskey. It was Stone who pushed Trump to think about a political career as early as 1987 and was one of three advisers who laid the groundwork for his 2016 campaign. The story of the Republican Party’s resurgence in the second half of the 20th century often leapfrogs Nixon. The traditional tale is one of a “remnant” of activists and wealthy oligarchs holding tight through the New Deal. They helped Barry Goldwater, a true conservative ideologue, get the GOP presidential nod in 1964. Then Ronald Reagan, the former New Deal Democrat-turned-conservative reactionary, won their revolution in 1980. Nixon’s transactional politics don’t fit. But Nixon and his destructive politics are the real throughline from his 1972 landslide to Trump’s presidency. The destruction of Muskie and the DNC break-in simply presaged Trump’s use of the presidency to coerce a foreign country to intervene to help him win again ― after a different country helped him the first time. The politics of personal destruction Nixon deployed ultimately destroyed him. But they’ve fueled Trump’s entire career and the party that elected him. As he heads toward his own impeachment, it’s unlikely he’ll heed Nixon’s final message from the White House. “[A]lways remember, others may hate you, but those who hate you don’t win unless you hate them, and then you destroy yourself,” Nixon said in his farewell statement.",
      "date": "10/15/2019 05:45 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_biden"
      }
    },
    {
      "title": "Ted Cruz: ‘Of Course Not’ Appropriate For Trump To Ask China To Investigate Biden",
      "url": "https://search.huffpost.com/click/_ylt=AwrS_AgipKtdORUAbBFsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558563/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fted-cruz-denounces-trump-china-biden_n_5da364aee4b06ddfc51bf005/RK=2/RS=mR5ykUmb9119kiI6oN7CXIklCrM-",
      "subtitle": "“Foreign countries should stay out of American elections,” the Republican senator said.",
      "author": "Hayley Miller",
      "content": " Sen. Ted Cruz (R-Texas) on Sunday denounced President Donald Trump’s decision earlier this month to publicly urge China to investigate former Vice President Joe Biden, a front-runner in the Democratic presidential primary race. Asked during an interview Sunday with CBS’ “Face The Nation” whether he believes it’s appropriate for Trump to ask China to open such a probe, Cruz stammered for a few moments before saying “of course not.” “Elections in the U.S. should be decided by Americans and it’s not the business of foreign countries ― any foreign countries ― to be interfering in our elections,” he said. Trump drew heated backlash from Democrats and some Republicans on Oct. 3 when he told reporters on the White House lawn that China “should start an investigation into the Bidens” while discussing trade talks with the country. His comments echoed remarks he made to Ukrainian President Volodymyr Zelensky during a July phone call in which he urged the foreign leader to look into Biden and his son, Hunter, who served on the board of a Ukrainian gas company. The call became the subject of a subsequent whistleblower complaint filed by a U.S. intelligence official and later the centerpiece of the House’s ongoing impeachment inquiry into Trump. Many of Trump’s Republican defenders have claimed the president was only joking when he encouraged China to investigate the Bidens. But one of Trump’s China advisers, Michael Pillsbury, told the Financial Times that he received “quite a bit of background on Hunter Biden from the Chinese” following Trump’s remarks. CBS’ Margaret Brennan continued to press Cruz on Sunday, asking whether it had been appropriate for Trump to ask Ukraine to get involved. “Do you think that, say, the president’s personal attorney, Rudy Giuliani, who’s been talking about China, who’s been talking about Ukraine, do you want to hear him testify about this sort of shadow foreign policy?” she asked. Senate Judiciary Committee Chairman Lindsey Graham (R-S.C.) said last week that he wants Giuliani, who has been urging foreign officials to investigate the Bidens at the behest of Trump, to testify before his committee. “Listen, foreign countries should stay out of American elections,” Cruz, a member of the Senate Judiciary Committee, told Brennan. “That’s true for Russia, that’s true for Ukraine, that’s true for China ― that’s true for all of them. It should be the American people deciding elections.” He added that it would “make a lot of sense” for Giuliani to testify. Watch Cruz’s full interview with “Face The Nation” below. His comments about Trump’s request to the Chinese begin around the 4:30 mark.",
      "date": "10/13/2019 02:53 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_biden"
      }
    },
    {
      "title": "2018 Was A Breakthrough For Candidates Of Color. Why Isn’t 2020 The Same?",
      "url": "https://search.huffpost.com/click/_ylt=Awr9IlU7pKtdem0AiNNsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558588/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fcandidates-of-color-2020-presidential-campaign_n_5da51ef3e4b01c76560b9566/RK=2/RS=pjpjnRO7HOJmpFwNnUoXncU5xt8-",
      "subtitle": "Three white candidates are dominating the Democratic presidential primary while Kamala Harris, Cory Booker and Julián Castro struggle.",
      "author": "Kevin Robillard",
      "content": " A year after candidates of color flourished in Democratic primaries around the country during the midterm elections, the three leading candidates for the 2020 Democratic presidential nomination are all white, while Asian American, Black and Latino candidates are trapped in single digits in public polling. Heading into the fourth presidential debate in the suburbs of Columbus, Ohio, on Tuesday evening, three of the leading candidates of color find their campaigns in varying degrees of peril. Former San Antonio Mayor Julián Castro has suggested he may drop out of the race if he fails to qualify for the fifth debate in Georgia next month. Sen. Cory Booker (D-N.J.) just threatened to quit the contest unless he raised $1.7 million in 10 days. (He succeeded.) And Sen. Kamala Harris (D-Calif.), who briefly ascended to the race’s top tier during the summer, is rejiggering her campaign with a focus on Iowa and a reworked stump speech. In 2018, the picture was much different, with Democratic voters across the country eager to cast history-making ballots. Black candidates won gubernatorial primaries in Florida, Georgia and Maryland, and Arizona Democrats nominated a Latino. Democrats elected the first two Native American women to Congress, the first two Muslim women, the first Latina to ever represent Texas, and sent Rep. Lauren Underwood, an African American, to Congress from a district that is 86% white. Overall, 216 candidates for House, Senate or governor were people of color in 2018, which included a 42% spike in the number of women of color running for those major offices. (The field for down-ballot contests in 2020 is still developing, but candidates of color could make similar gains this cycle.) Interviews with voters, campaigns, candidates and operatives nationally and in the early primary states indicate there is no single cause for the struggles of the candidates of color. Many of the factors keeping them behind the three leading candidates in polling also affect white candidates who have failed to break into the race’s top tier. But the race’s focus on electability, the structure of the early nominating contests and differences in how the media treat candidates of color compared with white candidates are making things even more difficult. Democratic voters, in poll after poll and conversation after conversation, have indicated their priority when selecting a nominee in 2020 is someone who can beat Donald Trump. There’s plenty of reasons to think voters and pundits are bad at evaluating which candidates stand the best chance of defeating Trump, but that isn’t stopping the conversation. “The conversation has been ‘Hmm, I don’t know if America is ready to elect a Black woman president of the United States,’” Harris told a crowd of about 50 at a block party in Des Moines, Iowa, on Saturday. “It’s been a conversation, ’Oh, I can see it, but I don’t know if my neighbors are ready. Maybe it’s not her turn, maybe it’s not her time, maybe it might be too hard. We got to play it safe. … Maybe we can’t take that bet.’” The riff is a new one for Harris ― she also mentions her undefeated record in elections and her work to persuade an Iowa caucus-goer about Barack Obama’s electability in 2008 ― and it shows how she still needs to convince a broad swath of the electorate that she can win. Booker, similarly, has argued that turning out younger and African American voters is as important as winning over the much-ballyhooed white working class when it comes to defeating Trump. Not everyone is convinced electability is what’s holding back Booker, Harris and Castro. Adrianne Shropshire, the executive director of BlackPAC, which works to turn out Black voters, said Obama’s wins in 2008 and 2012 had largely quieted concerns about whether race was a barrier to winning the country. And Warren, who faced more concerns than any other candidate about her ability to beat Trump in the first half of the year, has managed to persuade voters. But Ross Wilburn, an Iowa state representative who has endorsed Harris, said the constant barrage of news from Trump’s White House and the president’s willingness to engage in out-and-out racist rhetoric have made voters more cautious. “Because of what President Trump is doing, and the hate he spews, and the chaos that he’s creating to divert our attention from illegal acts, people get cautious,” he said after Harris’ block party. “They want to go with the familiar. Part of her message is: ‘We can believe. We’ve believed before.’” The campaigns have also occasionally found themselves trapped in unfriendly media dynamics and dealing with a political press corps that still has a long way to go on the diversity front. Several operatives pointed to Castro’s showdown with former Vice President Joe Biden at the most recent debate. The first person voters heard from after the debate ended? It was former Chicago Mayor Rahm Emanuel, who served with Biden in the Obama administration and criticized Castro for challenging Biden. The post-debate pundits “overwhelmingly tend to be older, white and more moderate or conservative voices, which is absolutely crazy in a primary with this many diverse candidates, where the diversity of our base is going to be what propels us to victory,” said one operative working for a candidate of color, who requested anonymity to freely critique media coverage of the race. Indeed, a post-debate Univision poll found that 64% of Latino voters thought Castro’s attack on Biden was fair. All the candidates of color have also faced another trap: They’re expected to be both representatives of their race on the national stage while also appealing to the broader electorate. No small amount of coverage of businessman Andrew Yang’s campaign has focused on how Asian American voters are reacting to his candidacy. Coverage of Castro has focused on his bold immigration policy. But if his campaign had released a more by-the-numbers plan, the media likely would’ve zeroed in on that and questioned why he wasn’t more aggressive. Similarly, much of the coverage of Harris and Booker has focused on their criminal justice reform plans and records. “If you don’t talk about it, it’s ‘why aren’t you talking about this when it impacts people who look like you?’ But if they do talk about it, it’s ‘She’s just going to be the president of Black people,’” Shropshire noted, while praising the candidates for unveiling expansive platforms regardless. “But they’ve done a good job managing it. None of these people are single-issue candidates.” Harris and Booker have faced another problem. Both are running as candidates trying to find a sweet spot between progressives and moderates, neither embracing policies as liberal as those of Sens. Bernie Sanders (I-Vt.) and Elizabeth Warren (D-Mass.), nor bashing those policies and tacking to the center in the style of Biden. That means they’re occasionally minimized or left out of stories about the race’s central ongoing narrative: the ideological clash within the Democratic Party. “They just really haven’t defined their base yet,” Yvette Simpson, the president of the left-leaning group Democracy for America, said of Booker and Harris. “Biden is sucking all the air out of the room for anyone who’s not a pure progressive, while Sanders and Warren are winning over the votes of progressives.” And generally the candidates’ lower standings in the polls mean they get less media attention. Another operative working for the campaign of a candidate of color complained about struggling to get coverage of major policy rollouts and campaign speeches, “while CNN and MSNBC cover Joe Biden eating an ice cream cone.” Some of the challenges for Harris, Booker and Castro aren’t totally dissimilar from those facing white candidates like former Rep. Beto O’Rourke (D-Texas) or Sen. Amy Klobuchar (D-Minn.). Biden and Sanders, the 2016 runner-up who changed the Democratic Party, were always going to dominate media attention, early polling and fundraising. Warren’s steady rise has ensured she’s joined that group. Now the three top candidates are in a self-fulfilling cycle of sorts: They get more media coverage, money and strong poll results than anyone else, helping them get even more money and media attention, which helps them keep their strong position in the polls. Breaking into this virtuous cycle has proved difficult for most of the candidates, except for Warren, Buttigieg and ― for a time over the summer ― Harris. “There’s the idea of electability, and there’s the idea of anoint-ability,” said the second operative working for a candidate of color. “The media, the [Democratic National Committee], the benchmarks they set, the white candidates were always going to be able to meet them. It’s been a lot harder for candidates of color.” But the early-state voting order ― Iowa, which is the nation’s fifth-whitest state, votes first; and New Hampshire, the nation’s third-whitest state, votes second ― is part of the problem. Much of the public polling, which influences donors, voters and who makes the debate stage, is focused on these two states. During the time period to qualify via polling for the third debate, only one public poll of Nevada, the most diverse of the four early-voting states, was released. Still, it’s not unprecedented for Black candidates to triumph in either state. Obama won the 2008 Iowa caucus, and Deidre DeJear ― now Harris’ Iowa campaign chair ― won an upset victory to become the Democratic nominee for secretary of state in 2018. So far, the lack of a candidate of the color in the top tier has bewildered some Democratic operatives and left some worried about generating sufficient Black and Latino turnout in order to win the nomination. But there is still time for the candidates of color to sprint to the nomination race’s upper ranks. More voters may tune into the race as voting nears, and Tuesday night’s debate stage provides them with another high-profile opportunity. And if Harris or Booker, in particular, manage to break through, there could be immense political rewards. Black voters in South Carolina and in delegate-rich Super Tuesday states, several operatives noted, may flock to support a viable Black candidate. “African Americans and voters of color tend to wait until they’re sure you can win,” said Simpson. “It’s a bit of a Catch-22 for these candidates.” And even if the candidates fail to win, they can still point to personal and historical progress. Castro, little-known nationally before this race, has emerged as a favorite of progressives for his willingness to push the envelope on policy and sharply challenge more moderate Democrats. Few Democratic operatives give the unorthodox campaign of Yang much chance of success, but he’s managed to popularize the idea of a universal basic income and created a mini-movement at his back. “When I began my career a decade ago, it was unimaginable we might one day have two Black candidates for president,” said Rosy Gonzalez Speers, the executive director of Forward Florida. “I’m excited for our party. It’s only October, and there’s a lot of race left to run, so I wouldn’t count any candidates out yet.” Amanda Terkel contributed reporting.",
      "date": "10/15/2019 07:00 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_biden"
      }
    },
    {
      "title": "Joe Biden Tells Matthew Shepard’s Mom That Civil Rights Act Includes LGBTQ People",
      "url": "https://search.huffpost.com/click/_ylt=Awr9IlU7pKtdem0AhtNsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558588/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fjoe-biden-matthew-shepard-mom-civil-rights-act-includes-lgbtq_n_5d9fc151e4b087efdbab8bd9/RK=2/RS=MErmM81TR3vLpS2XayZrfK4_0S8-",
      "subtitle": "At CNN’s town hall, the former vice president and 2020 candidate told the murder victim’s mother about his support for the Equality Act to solidify LGBTQ rights.",
      "author": "Sanjana Karanth",
      "content": " Former Vice President Joe Biden told LGBTQ rights figure Judy Shepard on Thursday that passing the Equality Act would come “first and foremost” if he won the presidency in 2020. Shepard, whose son Matthew Shepard was murdered in 1998 for being gay, asked Biden at CNN’s LGBTQ town hall in Los Angeles how the former senator and 2020 Democratic presidential candidate would reduce hate crimes against LGBTQ people and other marginalized communities. Biden stressed the importance of passing the Equality Act, which cleared the House earlier this year. It would amend the Civil Rights Act of 1964 to also ban discrimination “on the basis of sex, sexual orientation, gender identity, or pregnancy, childbirth, or a related medical condition of an individual, as well as because of sex-based stereotypes.” The bill’s goal is to provide anti-discrimination protections for LGBTQ people in areas such as places of employment on a national level. “That’s important,” he said. “That’s important because it’ll change a whole range of things.” Matthew Shepard was a 21-year-old student at the University of Wyoming when he was killed, and his death became one of the country’s most high-profile hate crimes against LGBTQ people. Judy Shepard and her husband, Dennis, founded the Matthew Shepard Foundation, an LGBTQ nonprofit that runs education and advocacy programs. Biden also said that his administration would track down hate groups and that he believes the correct interpretation of the Civil Rights Act includes LGBTQ people. “This is a civil rights issue. It’s covered by, in my view ― the court may not agree ― this is a civil rights issue protected by the Civil Rights Act,” he said. “And we should be focusing on how to enforce that. My Justice Department ― and I guess any one of the Democrats’ Justice Department ― will, in fact, do that.” The Supreme Court is currently divided on whether the Civil Rights Act, or Title VII, protects LGBTQ people from employment discrimination. A key part of the law bans job discrimination based on sex, though some courts in recent years have read the language to include discrimination against LGBTQ people as part of sex discrimination. Biden’s answers to Judy Shepard’s question were applauded, though the presidential candidate later caused a bit of discomfort in the audience after describing his first public statement supporting same-sex marriage in 2012 as when he “came out.” “For example, when I came out and ... ,” Biden said before catching himself and restarting with: “When I publicly stated.” “Coming out” is a term often used to describe when someone chooses to publicly identify as LGBTQ. CNN hosted the town hall with the Human Rights Campaign, an LGBTQ nonprofit organization.",
      "date": "10/10/2019 10:46 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_biden"
      }
    },
    {
      "title": "Joe Biden Recalls ‘Gay, Gay Bathhouses,’ 24/7 Sex, And People Are So Confused",
      "url": "https://search.huffpost.com/click/_ylt=Awr9IlU7pKtdem0AhNNsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558588/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fjoe-biden-lgbtq-town-hall-gay-bathhouses_n_5d9fca2ce4b02c9da0479a2b/RK=2/RS=lSf.PoOXbvDdPyKvRQ8RbPQcKxI-",
      "subtitle": "The former vice president reminisced about “gay bathhouses” and “round-the-clock sex” at the LGBTQ town hall on CNN.",
      "author": "Josephine Harvey",
      "content": " On prime-time television Thursday night, Joe Biden reminisced about a time when LGBTQ discourse was all about “gay bathhouses” and ”round-the-clock sex” ― and viewers were not sure how to feel about it. The former vice president made the comments to CNN’s Anderson Cooper, who was moderating the Los Angeles town hall event, a forum for nine Democratic presidential candidates to discuss LGBTQ issues. After going on a tangent about stereotypes surrounding gay people, Biden concluded with a reflection on how the discourse about homosexuality had changed in recent years, compared with about two decades ago: “Remember, Anderson? Back 15, 20 years ago, when we talked about this in San Francisco, it was all about, well, gay bathhouses. It was all about round-the-clock sex. Come on, man. Gay couples are more likely to stay together longer than heterosexual couples,” he said. On a more serious note, Biden also discussed curtailing foreign assistance to countries who discriminate against LGBTQ citizens, the importance of passing the Equality Act in order to reduce hate crimes and protecting transgender people’s right to join the military. At one point, he referenced a time when he “came out” but rolled with the joke and walked across the stage to put his arm around Cooper, who is gay. “Well, that would be news,” Cooper joked back. “I kind of figured it out a while ago.” People on Twitter were very confused by, well, all of it. Although, there was one resounding thing viewers could agree with that they wanted out of this: A remix of “gay, gay, gay bathhouses.” It was quickly delivered:",
      "date": "10/10/2019 11:35 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_biden"
      }
    },
    {
      "title": "Trevor Noah Mocks Trump’s Sons For Complaining About Nepotism",
      "url": "https://search.huffpost.com/click/_ylt=Awr9IlU7pKtdem0AgtNsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558588/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fdaily-show-hunter-biden-trump-junior-nepotism_n_5da7f382e4b034f1d69cfd63/RK=2/RS=eMNujdRJEZSky9RODIqZketVDfM-",
      "subtitle": "“The Daily Show” host thinks it’s curious that Donald Trump Jr. and Eric Trump are griping about Hunter Biden.",
      "author": "Josephine Harvey",
      "content": " Trevor Noah mocked President Donald Trump’s sons Eric and Donald Jr. Wednesday night for griping about Hunter Biden receiving favoritism because of his family name. Noah said he could understand why most people would complain about Hunter Biden getting a leg up in life via his last name, but what he couldn’t understand was the Trump children doing it. Trump Jr. drew ire on Twitter Tuesday after he criticized Hunter Biden for acknowledging in an interview that he would not have acquired certain roles on the boards of companies had he not been the son of former Vice President Joe Biden: “If there was ever an example of people who got opportunities because of their names, it’s these two,” Noah said of the Trump offspring on Wednesday night’s “The Daily Show.”",
      "date": "10/17/2019 02:42 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_biden"
      }
    },
    {
      "title": "Hunter Biden To Resign From Board Of Chinese-Backed Firm",
      "url": "https://search.huffpost.com/click/_ylt=Awr9IlU7pKtdem0AgNNsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558588/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fhunter-biden-to-resign-from-board-of-chinese-backed-firm_n_5da32e7de4b06ddfc51b91b8/RK=2/RS=mv8obTZDthqby9adIl7DyY4w1R8-",
      "subtitle": "His attorney says Hunter Biden pledges to avoid conflicts of interest should his father be elected president.",
      "author": "",
      "content": "WASHINGTON (AP) — Hunter Biden is stepping down from the board of directors of a Chinese-backed private equity firm. That’s according to a statement from Biden’s attorney, George Mesires. Hunter Biden’s business dealings in China and Ukraine have become an issue in the 2020 presidential race with President Donald Trump and his allies pressing unproven corruption allegations again Hunter Biden and his father, Democratic presidential candidate Joe Biden. In a statement posted on Medium and first reported by Bloomberg News, Mesires says Hunter Biden intends to resign from the board of BHR Equity Investment Fund Management Co. by Oct. 31. The attorney says Hunter Biden pledges to avoid conflicts of interest should his father be elected president. Hunter Biden will also continue to keep his father out of his business affairs.",
      "date": "10/13/2019 10:12 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_biden"
      }
    },
    {
      "title": "After Taking Presidential Corruption To New Heights, Trump Calls Everyone Else Corrupt",
      "url": "https://search.huffpost.com/click/_ylt=Awr9IlU7pKtdem0AftNsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558588/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2ftrump-corruption-projection_n_5da8bae5e4b034f1d69f56ac/RK=2/RS=1yKSDZwdfPE4bp2jLAbONbWYCsk-",
      "subtitle": "Trump has called Democratic leaders, the news media, former President Barack Obama and the entire 2016 election “corrupt.”",
      "author": "S.V. Date",
      "content": " WASHINGTON — Look up “corrupt” in the dictionary and you could expect to find an illustration of Donald Trump looking right back ― yet that has not kept the president from repeatedly calling others corrupt in recent weeks. Trump has given his daughter and son-in-law prominent White House jobs, steers lobbyists and political groups seeking his favor toward using his Pennsylvania Avenue hotel, and even successfully pushed the U.S. government to host the next G-7 meeting at his own golf resort, which will put tens of millions of American tax dollars into his own cash registers next June. “He has no shame,” said Joe Walsh, a former Illinois congressman who is running against Trump for the 2020 Republican nomination. “He’s incapable of shame. That’s not normal.” Indeed, such actions, had they been taken by a mayor, a county executive or a governor, would in all likelihood result in state or federal public corruption charges. While laws and rules vary by state and locality, ethics laws generally prohibit public officials from profiting from their offices. Giving oneself a large government contract ― as Trump’s White House announced Thursday with the selection of his troubled Doral, Florida, golf course as the site of the next summit of the world’s largest democratic economies ― would almost certainly result in a criminal prosecution, ethics experts said. “This is a president who believes the powers of the presidency are bestowed on him to advance his own personal interests, political and profit-seeking, rather than those of the American people,” said Robert Weissman, president of the liberal watchdog group Public Citizen. But as the sitting president, Trump is immune from both ethics laws and criminal prosecution, and not only has he openly engaged in nepotism and self-dealing, he has, in recent weeks, started accusing political opponents and the news media of “corruption.” At an Oct. 2 news conference, for example, he called former Vice President Joe Biden and his son Hunter “stone, cold corrupt.” At an Oct. 11 rally in Lake Charles, Louisiana, he broadened that to all Democrats: “The radical Democrats’ policies are crazy. Their politicians are corrupt.” In an Oct. 14 statement he posted on Twitter, Trump called The New York Times corrupt. Just two days later, during a photo opportunity with the visiting president of Italy, he called his predecessor Barack Obama corrupt, as well as the entire 2016 election. Others Trump has labeled “corrupt” in recent weeks: former FBI director James Comey, former FBI agent Peter Strzok, former FBI lawyer Lisa Page, the entire Mueller investigation into the help Russia gave Trump in winning the 2016 election, all of the news media, California Democratic congressman Adam Schiff and CNN. To Trump critics, the president’s attacks are part of a predictable pattern: Accuse others of the inappropriate behavior that he himself engages in. Bandy Lee, among a group of mental health professionals who have been warning of Trump’s state of mind for years, said Trump is exhibiting typical behavior for a “paranoid, delusional” leader. “He accuses others exactly of what he is responsible for,” said Lee, a Yale Medical School professor of psychiatry. “It is a psychological defense called ‘projection.’” Josh Schwerin, a former spokesman for 2016 Democratic presidential nominee Hillary Clinton, recalled Trump’s response when Clinton accused Trump of behaving like Russian dictator Vladimir Putin’s puppet. “No puppet. No puppet. You’re the puppet,” Trump replied at the third and final presidential debate. “He accuses other people of doing the bad things he’s doing,” Schwerin said. “He is the most corrupt president in modern times,” said Jennifer Horn, a former chair of the New Hampshire Republican Party. “He has to convince his followers that everyone is corrupt so they will ignore his corruption.” The White House did not respond to HuffPost queries regarding Trump’s self-dealing and nepotism. One top Republican National Committee member, though, said he is not bothered by any of Trump’s behavior, and instead attacked the news media for not reporting sufficiently on the Clinton Foundation, Hunter Biden or the money former Obama has made since leaving office. “A few dollars on his hotels, which are actually a legitimate business, I’m not going to lose much sleep over,” said Shawn Steel, a longtime RNC member from California, urging more scrutiny of Hunter Biden, who served on the board of a Ukrainian gas company. Damaging Joe Biden’s 2020 candidacy was a key objective of Trump’s newfound interest in rooting out “corruption” in Ukraine, according to a top Trump adviser who spoke on condition of anonymity. Trump believes Biden would be his strongest opponent and has sought to pressure the Ukrainian government to investigate a conspiracy theory that Ukrainian officials seeking to help Hillary Clinton win the 2016 election planted false evidence to make it appear that Russia had helped Trump. According to that conspiracy theory, which also manages to tie in the Bidens and Hungarian billionaire George Soros and the framing of former Trump campaign chairman Paul Manafort, the hacked Democratic National Committee server and Clinton’s 33,000 deleted emails have been hidden away somewhere in Ukraine. Trump’s former homeland security adviser, Tom Bossert, has called the claim “completely debunked” and warned that Trump’s obsession with it would be the “white whale” that could bring him down. Indeed, it was Trump’s request of Ukraine’s president in a July 25 phone call to investigate both the Bidens and the 2016 election conspiracy that sparked a whistleblower complaint against Trump, which in turn led to the ongoing impeachment inquiry. White House chief of staff Mick Mulvaney admitted Thursday that those considerations played into Trump’s policy toward Ukraine. “Get over it: There’s going to be political influence in foreign policy,” he said. Kendal Unruh, a former GOP activist from Colorado who led the unsuccessful effort to dump Trump at the 2016 party convention, said it was distressing to see Republicans tolerating the president’s actions. “The Republican Party has become completely corrupted to the core in their habitual defense of Trump’s behavior,” she said. “It’s sad to watch the death of a party that once actually stood for morality and the rule of law.” Yet Yale psychiatrist Lee said increasing pressure on Trump with the threat of impeachment will create a far greater danger to the country than the mere diminishment of a political party. “His emotional drive to project all his own corruption and ineptitude onto others will overwhelm any ability on the part of others to correct or redirect his lies,” she said. “This drive will become more severe with greater pressure and, paradoxically, the sicker he is, the more effective his pathology will be in overcoming any resistance, starting with himself.”",
      "date": "10/17/2019 04:42 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_biden"
      }
    },
    {
      "title": "Read Live Updates From The 4th Democratic Presidential Debate",
      "url": "https://search.huffpost.com/click/_ylt=Awr9IlU7pKtdem0AfNNsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558588/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fdemocratic-debate-cnn-new-york-times_n_5da60d95e4b062bdcb19cd92/RK=2/RS=wfRMa3.Chv541yR7C0Y88FeAgsM-",
      "subtitle": "Twelve candidates face off in the largest presidential primary debate in American history.",
      "author": "Paige Lavender",
      "content": " Twelve 2020 Democratic presidential hopefuls face off Tuesday at a debate hosted by CNN and The New York Times. The debate can be streamed live at CNN’s website. The debate, taking place at Otterbein University in Westerville, Ohio, will feature the following candidates: Former Vice President Joe Biden New Jersey Sen. Cory Booker South Bend, Indiana, Mayor Pete Buttigieg Former Housing and Urban Development Secretary Julián Castro California Sen. Kamala Harris Minnesota Sen. Amy Klobuchar Former Texas Rep. Beto O’Rourke Vermont Sen. Bernie Sanders Massachusetts Sen. Elizabeth Warren Entrepreneur Andrew Yang Hawaii Rep. Tulsi Gabbard Billionaire philanthropist Tom Steyer The winner of the Democratic primary is expected to face President Donald Trump in the general election. Read live updates on the debate below. (You may need to refresh the page to see the latest updates.) 11:08 p.m. ET And that’s a wrap for the fourth Democratic presidential primary debate. Thanks for following along, and be sure to check out even more coverage on HuffPost. ― Paige Lavender 11:02 p.m. ET Also missing tonight: Questions on immigration. ― Sarah Ruiz-Grossman 10:54 p.m. ET Sanders and Castro both mentioned homelessness of their own accord, but there were no questions tonight about affordable housing. The lack of affordable housing is a nationwide crisis. On a given day in January 2018, more than 500,000 people were homeless in the U.S. Trump went on a tear last month about homelessness in California, which has one of the highest rates of homelessness in the U.S., and complained about how people living in tents were ruining the “prestige” of San Francisco and Los Angeles. ― Sarah Ruiz-Grossman 10:53 p.m. ET Klobuchar says her most surprising friendship was with the late Republican Sen. John McCain, whom she says she misses “every day.” She shares a quote from him: “There is nothing more liberating in life than fighting for a cause larger than yourself.” ― Nina Golgowski 10:50 p.m. ET Castro says he agrees with Ellen DeGeneres’ message of practicing kindness but that he also believes we should hold people accountable for what they have done. “I think we can do both things,” he says. ― Nina Golgowski 10:47 p.m. ET The final question of the night is about... Ellen DeGeneres? She caused a stir last week after being spotted palling around with former President George W. Bush at an NFL game. She was criticized for joking with Bush, and then fiercely defended her friendship with him on her show. Despite the cultural relevance, it feels like a weird question to end a debate that had zero questions about climate change. ― Paige Lavender 10:44 p.m. ET Biden accuses Warren of pursuing vague ideas. Warren responds by touting the Obama administration’s push for the consumer protection agency she recommended. “I convinced people to vote for it,” Biden says to Warren, who then thanks Barack Obama. Biden interjects, telling Warren she did a “hell of a job at your job.” “Thank you,” Warren replies ― coolly. ― Ja’han Jones 10:42 p.m. ET Warren and Sanders make the pitch for their “bold” policy plans over more centrist reform policies. Warren says: “People who are struggling to pay health care are fighting today. ... People who are getting stopped by police because of the color of their skin are in a fight today. ... Anybody who doesn’t understand that Americans are already in these fights is not in a position to win them.” Sanders says: “We need bold action if we’re gonna save this planet. … The way you win an election in this time in history is not with the same old, same old.” ― Sarah Ruiz-Grossman 10:33 p.m. ET Biden tries to tout his accomplishments, saying, “I’m the only one on this stage who has actually gotten anything really big done.” Sanders is not having it. “You know what you also got done? ― and I say this as a good friend ― you got the disastrous war in Iraq done,” Sanders says. ― Paige Lavender 10:32 p.m. ET In response to a rare debate question about packing the Supreme Court, Biden and Castro say they would not pack the court and Buttigieg floats the idea of term limits for justices. ― Sarah Ruiz-Grossman 10:29 p.m. ET Harris, Booker, Gabbard, Biden and Warren all say they would codify Roe v. Wade to protect reproductive rights. It’s pointed out that they’re in Ohio, one of several states that has banned abortions after just six weeks into pregnancy — policies that Booker likens to “people trying to punish poverty,” considering how wealthier women typically have the means to circumvent state abortion bans. ― Sara Boboltz 10:23 p.m. ET For the first time this primary season, the moderators ask a question about abortion and reproductive rights. ― Paige Lavender 10:21 p.m. ET Yang, on data rights, says, “Right now our data is worth more than oil.” He questions when Americans received an actual check in the mail for it. ― Nina Golgowski 10:16 p.m. ET Harris urges her fellow contenders to “join” her in calling for Trump to be removed from Twitter. Read more on her calls for the company to suspend the president’s account. ― Sarah Ruiz-Grossman 10:14 p.m. ET Steyer touts his business success as an advantage over Trump in 2020. He says Democrats need a candidate who can show Trump to be “a failure as a businessperson, and a fraud and a failure as a steward of the American economy.” ― Ja’han Jones 10:12 p.m. ET Booker, speaking as “the only vegan on the stage,” argues against questioning any of the Democratic candidates about their health, saying Trump is the unhealthiest person running for president in 2020. ― Paige Lavender 10:11 p.m. ET Yang criticizes Warren’s plan to break up giant tech companies such as Google in the name of enforcing antitrust laws. He says political leaders “have to be realistic that competition doesn’t solve all the problems.” Then, a zinger: “There’s a reason nobody’s using Bing today. Sorry, Microsoft, but it’s true. So it’s not like breaking up these big tech companies will revive Main Street businesses across the country.” ―  Sara Boboltz 10:08 p.m. ET Gabbard, a 38-year-old military combat veteran, would be the youngest president, if elected. When asked about it, she argues that it’s “not fair” to question the oldest three candidates about their health and fitness and not the other candidates. ― Nina Golgowski 10 p.m. ET Front-runners Biden, Sanders and Warren were all asked questions about their age. Biden says, “One of the reasons I’m running is because of my age and my experience,” and points to his yearslong record in the Obama White House and the “wisdom” that comes with years. Warren comes out strong: “I will out-work, out-organize and out-last anyone ― and that includes Donald Trump or whoever the Republicans get stuck with.” ― Sarah Ruiz-Grossman 9:58 p.m. ET As O’Rourke talks about medical marijuana’s potential to help alleviate Americans’ dependence on opioid medications, Yang offers some commentary. “Yes! Preach, Beto!” he shouts, turning his gaze up to the ceiling. ― Sara Boboltz 9:57 p.m. ET When asked about his recent heart attack, Sanders insists he’s healthy and invites people to an upcoming rally. He thanks people for their prayers and well-wishes while he was hospitalized. ― Paige Lavender 9:55 p.m. ET O’Rourke agrees with Yang on decriminalizing opioid use and touts medical marijuana as an alternative treatment for patients. Here’s more from O’Rourke’s plan on legalizing marijuana nationwide and what weed company owners in Oakland, California, told him last month about his plan. ― Sarah Ruiz-Grossman 9:52 p.m. ET Steyer and Yang both blame big corporations and a lack of oversight from the government for the opioid crisis. Yang goes a step further, arguing safe injection sites should be open around the country and opioid addicts should be referred to counseling and rehab instead of prison. He also repeats an argument he’s made before that opiates should be decriminalized for personal use. ― Paige Lavender 9:48 p.m. ET Klobuchar says the people who should pay for treatment for those affected by the opioid epidemic are the people “who got them hooked and killed in the first place.” ― Nina Golgowski 9:46 p.m. ET Castro brings Atatiana Jefferson into the gun violence debate, saying, “Police violence is also gun violence, and we need to address that.” Read more about the officer, who has been charged with murder. ― Sara Boboltz 9:44 p.m. ET Booker and Harris assume roles they’ve assumed in previous debates, speaking ― solitarily ― about gun violence as it relates to Black communities, which experience gun death disproportionately. “The leading cause of death of young Black men in America is gun violence,” Harris says. ― Ja’han Jones 9:41 p.m. ET Booker, Buttigieg and O’Rourke go at it again on gun control, with O’Rourke arguing for a mandatory assault weapons buyback and Buttigieg responding to O’Rourke: “I do not need lessons from you on courage ― political or personal.” Booker jumps in to mention the issue of everyday gun violence. Read more from their arguments online earlier this week. ― Sarah Ruiz-Grossman 9:39 pm. ET Klobuchar, addressing foreign interference in our elections, highlights her Honest Ads Act that would prohibit social media companies from running paid political ads without disclosing the sponsor. She adds that paper ballots need to be available in every voting precinct. ― Nina Golgowski 9:38 p.m. ET Proving that women can tell corny jokes, too, Klobuchar cracks one about foreign interference in the 2016 election: “This wasn’t ‘meddling.’ That’s what I do when I call my daughter on a Saturday night and ask her what she’s doing.” She adds: “Sorry.” ― Sara Boboltz 9:34 p.m. ET O’Rourke dodges a question about how he would enforce a mandatory gun buyback, an idea he floated in the last presidential debate. “I expect my fellow Americans to follow the law,” he says, arguing “we don’t go door to door” to enforce any law in the U.S. He argues certain weapons should be considered “too dangerous to sell,” and by that logic, “too dangerous to own.” ― Paige Lavender 9:28 p.m. ET O’Rourke says: Because the U.S. turned its back on the Kurds, “it makes it more likely that we will have to send another generation of soldiers to fight our battles there.” ― Nina Golgowski 9:25 p.m. ET Castro says Trump has made a “total disaster in Syria.” He also draws a line between what’s happening there and the Trump administration’s border policies. “This president is caging kids on the border and letting ISIS prisoners run free,” he says. ― Paige Lavender 9:24 p.m. ET Harris on Trump’s volatility in the middle east: “Dude gotta go, and when I’m commander in chief we will stop this madness.” ― Ja’han Jones 9:23 p.m. ET Several of the candidates call out Trump for reversing yearslong policy by withdrawing troops from Syria, saying it sends a signal to allies that the U.S. can’t be trusted. Buttigieg, who served in the military, says when he was deployed, one of the things “keeping me safe” was that the U.S. flag on his uniform was trusted. Sanders says: “What country in the world will trust the word of the United States?” ― Sarah Ruiz-Grossman 9:19 p.m. ET A few moments later, Gabbard (a veteran) tries to get Buttigieg (another veteran) to say he supports endless wars, as he shakes his head and visibly sighs. The mayor responds: “What we were doing in Syria is keeping our word. Part of what gets people to put their lives on the line to work with us is to stand by our word.” ― Sara Boboltz 9:17 p.m. ET Gabbard addresses conflict in the Middle East, taking time to call claims she is a “Russian asset” and Bashar Assad apologist “completely despicable.” After saying both parties are responsible for the conflict in the region, Gabbard vows to end U.S. involvement in “regime change.” ― Ja’han Jones 9:13 p.m. ET Biden says Trump withdrawing troops from Syria is the “most shameful thing” he’s ever seen in foreign policy. “This is shameful, shameful what this man has done,” Biden says. Read more about Trump’s decision and reactions to it. ― Sarah Ruiz-Grossman 9:10 p.m. ET Steyer’s campaign releases a statement arguing that he was the first presidential candidate to call for a wealth tax ― back in October of 2018. “Under my own proposal,” he says, “I would pay more than an additional $10 million annually in taxes and have also called for closing the carried interest tax loophole.” ― Nina Golgowski 9:06 p.m. ET Castro makes the second mention of homelessness of the night, saying he’s visited homeless people in Las Vegas who are sleeping “in the shadows of hotels worth hundreds of millions of dollars.” Here’s a look at his visit to homeless encampments in Oakland, California, last month. ― Sarah Ruiz-Grossman 9:05 p.m. ET Booker chimes in with a call for unity: “Tearing each other down because we have a different plan, to me, is unacceptable.” ― Sara Boboltz 9:03 p.m. ET Yang criticizes Warren for her plan to tax wealth, arguing that a value-added tax ― similar to ones implemented in Germany and Denmark ― are more suitable for the United States. “If we give the American people a tiny slice of every Amazon sale, every Google search,” he says, billions of dollars will be funneled to them. ― Ja’han Jones 9:01 p.m. ET “The rich are not like you and me,” Warren says, noting that a wealth tax would yield more than an income tax. (She plans to introduce a wealth tax.) “The really, really billionaires are making money off their accumulated wealth, and it just keeps growing. ... I think that as democrats we will succeed when we dream big and fight hard.” Klobuchar has harsh words for Warren in response, slamming her rival’s progressive, detailed policies. “I think simply because you have big ideas doesn’t mean that you’re fighting for regular people,” Klobuchar says. ― Sara Boboltz 8:59 p.m. ET Harris touts her proposed tax credits for lower-income Americans as a solution to poverty and income inequality. She mentions her single mother who raised her and her sister, saying she would put them to bed and then “sit up at the kitchen table trying to figure out how to make it all work.” ― Sarah Ruiz-Grossman 8:52 p.m. ET Sanders talks about the need to raise taxes on billionaires, saying it’s an “outrage” that a handful of the richest Americans make more than the bottom one-third of Americans. He also makes the first mention of homelessness on stage tonight, lamenting the “half a million Americans sleeping out on the street today.” Steyer then chuckles when the moderator points out he’s the only billionaire on the stage. “There have been 40 years when corporations have bought this government,” Steyer says. “The results are as shameful as Senator Sanders says. It’s absolutely wrong, and it’s absolutely undemocratic and unfair.” He then touts his wealth tax. Warren jumps in. “Why does everyone on this stage think it’s more important to protect billionaires than to invest in an entire generation of Americans?” she asks. ― Sarah Ruiz-Grossman and Sara Boboltz 8:48 p.m. ET General Motors, whose workers are currently striking in the biggest auto industry work stoppage in decades, prompts a discussion about unions and living wages. HuffPost’s Dave Jamieson has more on the GM strike here. ― Paige Lavender 8:46 p.m. ET Booker takes a swipe at Yang’s universal basic income platform, saying it’d be better to raise the minimum wage and put “the dignity back in work.” ― Nina Golgowski 8:43 p.m. ET Castro, like Sanders, says he would create jobs by investing in infrastructure and a Green New Deal. ― Nina Golgowski 8:41 p.m. ET Warren reiterates her argument that corporate greed, not automation, is the leading cause of job loss in the U.S. She argues for greater worker representation on corporate boards and stronger unions. ― Ja’han Jones 8:39 p.m. ET Booker quotes Yogi Berra and says he’s “having deja vu all over again” listening to his peers debate health care and Hunter Biden. He also argues women shouldn’t be the only ones fighting for reproductive rights. ― Paige Lavender 8:38 p.m. ET Sanders vows to put Americans to work by fixing infrastructure, hiring more teachers, canceling student debt, and creating 20 million jobs through his proposed Green New Deal. ― Nina Golgowski 8:36 p.m. ET Harris jumps into the fierce debate on health care to call attention to the issue of women’s reproductive health. She says there has been “not nearly one word” on the topic during previous debates, even as there is a “full-on attack” on abortion access in some states. “Poor women, women of color will die. … People need to keep their hands off of women’s bodies and let women make the decisions about their own lives,” Harris says, to loud cheers. ― Sarah Ruiz-Grossman 8:29 p.m. ET Sanders hits back amid a fierce debate on stage on “Medicare for All”: “As somebody who wrote the damn bill … premiums are gone, co-payments are gone, deductibles are gone. ... The overwhelming majority of people will save money on their health care bills.” He also adds that “it is appropriate to acknowledge that taxes will go up.” ― Sarah Ruiz-Grossman 8:27 p.m. ET Buttigieg, taking his first swipe at Warren over her support for “Medicare for All,” says the senator has a plan for everything except how to pay for her health care bill. ― Ja’han Jones 8:26 p.m. ET Asked to clarify whether her health care plan will raise taxes for the middle class, Warren says she won’t sign a bill into law “that does not lower costs for middle-class families.” “Costs will go up for the wealthy and big corporations; for hardworking middle-class families costs will go down,” she says. ― Paige Lavender 8:23 p.m. ET Biden answers a question on his son Hunter’s business dealings with Ukraine while Biden was vice president. (The moderator notes there was no evidence of wrongdoing.) “Look, my son did nothing wrong. I did nothing wrong,” Biden says, adding that the issue should be “Trump’s corruption ― that’s what we should be focusing on.” He points repeatedly to statements Hunter Biden made earlier on Tuesday. ― Sarah Ruiz-Grossman 8:19 p.m. ET During his first remarks, O’Rourke praises Gabbard and Buttigieg for serving in the military. ― Paige Lavender 8:18 p.m. ET Yang says he supports impeachment but argues Democrats are losing “when we’re talking about Donald Trump” instead of discussing policies the candidates hope to advance. ― Ja’han Jones 8:17 p.m. ET Buttigieg, on impeachment, says that “presidents 10 years or 100 years from now will look back on this moment to see whether the president is above the law.” He adds, though, that he’s running to unify the country. ― Sara Boboltz 8:16 p.m. ET Gabbard, the only member of the House on tonight’s debate stage, says if the Senate doesn’t vote to impeach Trump he will feel “exonerated.” ― Nina Golgowski 8:15 p.m. ET Warren: “Impeachment is the way that we establish that this man will not be permitted to break the law over and over without consequences.” Sanders: “I look forward to not only a speedy and expeditious impeachment process, but Mitch Mcconnell has got to do the right thing and allow a free and fair trial in the Senate.” ― Nina Golgowski 8:14 p.m. ET Klobuchar mentions some of Trump’s recent controversies, saying she’d like to know how abandoning Kurdish allies and asking the Ukrainian president to investigate Biden will “make America great again.” ― Paige Lavender 8:13 p.m. ET Harris says Trump has “committed crimes in plain sight.” “On this issue with Ukraine, he’s been selling out our democracy. ... I don’t think this impeachment process is gonna take very long, because as a former prosecutor, I know a confession when I see it.” — Sarah Grossman 8:12 p.m. ET Booker on impeachment: “This must be fair” and must be about “patriotism, not partisanship.” — Ja’han Jones 8:10 p.m. ET MarianWilliamson would like to remind everyone she’s still in the race. — Sara Boboltz 8:06 p.m. ET Warren on impeachment: “Sometimes there are issues that are bigger than politics and I think that’s the case with this impeachment inquiry. ... No one is above the law, and that includes the president of the United States.” — Sarah Ruiz-Grossman 8:03 p.m. ET The candidates are all officially on the stage and the debate has begun. — Sara Boboltz",
      "date": "10/15/2019 07:06 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_biden"
      }
    },
    {
      "title": "Joe Biden: No Family Members Would ‘Have An Office’ In My White House",
      "url": "https://search.huffpost.com/click/_ylt=Awr9IlU7pKtdem0AetNsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558588/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fjoe-hunter-biden-no-family-in-white-house_n_5da3ade3e4b06ddfc51c1b3e/RK=2/RS=8UDob95aZl9rgDt34j8SyMBYtMY-",
      "subtitle": "The 2020 Democrat’s comments at a UFCW forum came hours after his son Hunter Biden resigned from the board of a Chinese-backed firm.",
      "author": "Sanjana Karanth",
      "content": " Presidential candidate Joe Biden said Sunday that no family member of his would have an office in the White House or act as a diplomat under his potential administration. The Democrat’s comments at a United Food and Commercial Workers (UFCW) forum in Iowa were in response to an NBC reporter’s question of what kind of ethical guidelines Biden would create if elected president. The reporter referenced the candidate’s son, Hunter Biden, whose business dealings in China and Ukraine have been at the center of President Donald Trump’s attempt to investigate unsubstantiated allegations of corruption against the Bidens. “No one in my family will have an office in the White House, will sit in meetings as if they are a cabinet member, will in fact have any business relationship with anyone that relates to a foreign corporation or a foreign country,” the former vice president told reporters. “Period. End of story.” Biden appeared to be drawing a contrast with Trump’s children, some of whom have been involved either as senior advisers in the White House or as diplomats with foreign nations. The Democrat’s remarks came just hours after his son Hunter Biden announced his planned resignation from the board of a Chinese-backed private equity firm. Hunter Biden’s attorney, George Mesires, released a statement earlier Sunday that said the younger Biden intends to resign from the board of directors of BHR Partners by Oct. 31. The statement also said Hunter Biden promises to avoid conflicts of interest if his father is elected president, and will continue to keep the former vice president out of his business affairs. At the forum, Joe Biden continued to stress that he has not discussed his son’s business affairs with him, adding that he was not aware of what was in Mesires’ statement until he read it upon release. “What I’m not going to let you all do is let you take the focus off the problem,” Biden told reporters at the UFCW forum. “No one has asserted my son did a single thing wrong. No one has asserted that I’ve done anything wrong except the lying president. That’s the only thing. That’s the focus.” Hunter Biden had served on the board of Ukrainian gas company Burisma Holdings when Joe Biden was vice president, and stepped down from the position in April. The younger Biden’s attorney has maintained that no law enforcement agency has ever accused his client of wrongdoing during his time on the board. In a July phone call, Trump asked Ukrainian President Volodymyr Zelensky to investigate Hunter Biden’s work in the country while his father, now one of Trump’s political rivals, was vice president. Trump’s phone call, and his request that a foreign government interfere in the 2020 U.S. election, is part of what sparked the House’s impeachment inquiry into the president for abusing the power of his office to benefit his reelection campaign. Trump has repeatedly defended his actions and denied any wrongdoing, saying that the call was “perfect.” Biden announced last week that he believes Trump should be impeached. He was one of the last 2020 Democrats to say so.",
      "date": "10/13/2019 07:38 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_biden"
      }
    },
    {
      "title": "Hunter Biden Says He Did Nothing ‘Improper’ In Ukraine, China Work",
      "url": "https://search.huffpost.com/click/_ylt=Awr9IlU7pKtdem0AeNNsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571558588/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fhunter-biden-interview_n_5da5a769e4b01c76560cc9cb/RK=2/RS=DSpf5UftiUKNXk_y50SNYNJ55uE-",
      "subtitle": "Joe Biden’s son said he exercised “poor judgment,” however, by getting involved in something he compared to a “swamp.”",
      "author": "Hayley Miller",
      "content": " Hunter Biden, the son of former Vice President Joe Biden, denied doing anything “improper” in his work with Ukrainian and Chinese companies as President Donald Trump has repeatedly claimed without evidence. Biden told ABC News, in an interview that aired on Tuesday, that he never made a mistake “based on some ethical lapse,” but acknowledged he exercised “poor judgment” by getting involved in something he compared to a “swamp.” Hunter Biden on Sunday announced he was stepping down from his position as a director for Chinese investment company BHR Partners as Trump continues to accuse him and his father of corrupt activity in Ukraine and China. Trump has urged foreign leaders, including Ukrainian President Volodymyr Zelensky and the Chinese government, to investigate Hunter Biden and Joe Biden, his potential Democratic rival in the 2020 election. House Democrats launched an impeachment inquiry into the president after a whistleblower complaint alleged he repeatedly pressured Zelensky and may have withheld U.S. military aid as leverage. Trump claims Joe Biden, as vice president, called for the removal of a notoriously corrupt prosecutor in Ukraine for the purpose of impeding an investigation into Burisma, a Ukranian gas company where Hunter Biden served on the board of directors. There’s no evidence Joe Biden or Hunter Biden did anything illegal. Hunter Biden told ABC News repeatedly that he never discussed his business dealings in Ukraine and China with his father. Hunter Biden acknowledged that his last name helped him professionally, and that he likely wouldn’t have been asked to serve on Burisma’s board had he not been the vice president’s son. “In retrospect, look, I think that it was poor judgment on my part,” he told ABC News of his foreign business deals. “When I look back on it, I know that [I] did nothing wrong at all. However, was it poor judgment to be in the middle of something that is ... a swamp in many ways? Yeah.” He denied Trump’s claim that he raked in $1.5 billion from an investment deal in China, saying it has “no basis in fact in any way.” In recent weeks, Trump has gone after Hunter Biden during his political rallies and in appearances to reporters, bashing him for avoiding the media while his business dealings have been thrust into the national spotlight. “Where’s Hunter?” Trump tweeted several times over the last week. “I’m here,” Hunter Biden told ABC News. “I’m working and living my life.” Biden said he made a “mistake” in giving a “hook to some very unethical people to act in illegal ways to try to do some harm to my father,” an apparent reference to Trump and his personal attorney Rudy Giuliani’s push for foreign leaders to investigate his family. “Did I do anything improper?” Hunter Biden added. “No, not in any way. Not in any way whatsoever.” Watch ABC’s interview with Hunter Biden below:",
      "date": "10/15/2019 07:35 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Male",
        "target_affiliation": "Neutral",
        "target_name": "Joe_biden"
      }
    }
  ]
}