{
  "articles": [
    {
      "title": "WATCH: Palin Urges GOP-Tea Party Merger, Re-Commits To Convention",
      "url": "https://search.huffpost.com/click/_ylt=Awr9Ilp6qqtdkzkATYtsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560186/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fpalin-urges-gop-tea-party_n_441847/RK=2/RS=KXwNcLDj.Rz1hmroaAJssUNPRbw-",
      "subtitle": "null",
      "author": "Sam Stein",
      "content": " While some of the nation’s most conservative lawmakers have made last-minute decisions to back out of next week’s National Tea Party Convention in Nashville, the headliner is still planning to pick up her check. Former Alaska Governor Sarah Palin told Fox News on Thursday evening that, unlike Reps. Michelle Bachmann (R-Minn) and Marsha Blackburn (R-Tenn.), she still intends to speak at the convention, despite the growing controversy over the obscure for-profit entity running the event. “Oh, you betcha I’m going to be there,” Palin told Greta Van Susteren. “I’m going to speak there because there are people traveling from many miles away to hear what that tea party movement is all about and what that message is that should be received by our politicians in Washington. I’m honored to get to be there.” Palin is getting $100,000 to deliver the keynote address at the conference. The 2008 vice presidential candidate insisted that her fee will “go right back into the cause” in the form of donations “to people and to events, those things that I believe in that will help perpetuate the message, the message being, Government, you have constitutional limits. You better start abiding by them.” Asked by Van Susteren whether she thinks the Republican Party would be best served by merging with the tea party movement, Palin replied with an enthusiastic endorsement of the idea. “They need to merge,” she said. “Definitely, they need to merge. I think those who are wanting the divisions and the divisiveness and the controversy — those are the ones who don’t believe in the message. And they’re the ones, I think, stirring it up. We need to ignore that and we need to forge ahead with a cohesive message. It’s a common sense message. It, again, is, Government, limit yourself so that the private sector, our families, free individuals can grow and thrive and prosper and enjoy America’s freedom!” WATCH Palin on Fox. Her Tea-Party comments start around the four-minute mark: Watch the latest news video at <a href=”http://video.foxnews.com/“>video.foxnews.com</a>",
      "date": "03/31/2010 05:12 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Palin: I’m “Not Gonna Back Off” Death Panel Claim",
      "url": "https://search.huffpost.com/click/_ylt=Awr9Ilp6qqtdkzkAS4tsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560186/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fpalin-im-not-gonna-back-o_n_414188/RK=2/RS=5KZTqjcLQo70amHltAwoCZhG6gU-",
      "subtitle": "null",
      "author": "Sam Stein",
      "content": " Sarah Palin is standing by her claim that Democratic-authored health care legislation includes the infamous “death panels” — even after the assertion was labeled the “lie of the year” by a prize-winning fact checking organization. The former Alaska governor told Sean Hannity, in a taping of the conservative firebrand’s radio program on Wednesday, that she was “not gonna back off” the criticism that the health care bill would pursue cost saving measures by rationing end of life care. “If the health care bill goes the way Obama wants it, we’re gonna have something very much like foreign countries’ systems of health care like the British, and it’s the American people — if we have our health care paid for by the bureaucracy, by government — depending on our health condition, depending on our age — we’re gonna be subject to bureaucrats deciding, panels and commissions deciding — just like they do overseas — who will be worthy of receiving the health care that government is going to provide.” “So that is the death panel that I referred to, and I won’t back off on criticizing that aspect of the health care bill.” COMMENTS COME ABOUT SEVEN MINUTES IN: The remarks come roughly two weeks after Palin took to her Facebook page to re-assert the validity of the much-criticized (and thoroughly debunked) death panel. That entry from the former vice presidential candidate, in turn, was in response to PolitiFact.com post that dubbed the argument the “lie of the year.” Palin scoffed at that critique. But there was one hitch to her re-assertion. She changed the definition about what actually constituted the death panel. In her first go-around, the former governor referenced end-of-life counseling in the health care legislation. In the post-Politifact Facebook entry she insisted that the death panel was coming in the form of a Medicare Advisory Board — a panel that a large number of well-respected economist have deemed important to rein in costs in Medicare (not, say, cut the plug on granny). (Hat tip: GOP12)",
      "date": "03/18/2010 05:12 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Immigration Reform Insults Latinos, Sarah Palin And Other Opponents Say",
      "url": "https://search.huffpost.com/click/_ylt=Awr9Ilp6qqtdkzkASYtsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560186/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fimmigration-reform-palin_n_3529581/RK=2/RS=_hCpLKc0EHHk70RXizlXTqdpy1E-",
      "subtitle": "null",
      "author": "Roque Planas",
      "content": " Opponents to immigration reform have embraced a new talking point. Former Alaska Gov. Sarah Palin joined the debate over the Senate-approved comprehensive immigration reform bill this weekend, saying in a Coulter-esque statement posted to Facebook that a vote for the “amnesty bill” insults Latinos. “You’ve just abandoned the Reagan Democrats with this amnesty bill,” Palin’s statement reads, adding: “You disrespect Hispanics with your assumption that they desire ignoring the rule of Law.” Anyone familiar with polling of Latino voters knows this statement is inaccurate. Polls routinely find that an overwhelming majority of Hispanic voters support offering a pathway to citizenship to the undocumented. A Fox News Latino poll released in March of last year found some 85 percent of Latino voters favored a pathway to citizenship, while a Wall Street Journal-NBC poll from April put the figure at 82 percent. In the words of Glenn Kessler at the Washington Post’s Face Checker blog, “a core part of Palin’s assumply is just simply wrong.” But that hasn’t stopped others from tossing the idea into the news cycle. During an appearance on CNN last week, U.S. Sen. Ted Cruz (R-Texas) slammed Democrats for “playing the race card” on immigration, saying that “a whole lot of Hispanics” in his state preferred ramping up border security to passing a reform with a pathway to citizenship. “I will tell you as the son of a Cuban immigrant, as someone who received over 40 percent of the Hispanic vote in the state of Texas, I think it is condescending to go to Hispanics and say ‘we’re going to buy your vote with amnesty,’” Cruz said. As conservative blogger Jennifer Rubin points out, no poll actually shows that Cruz ever won 40 percent of the Hispanic vote. She continues: Cruz and others opposed to citizenship for illegal immigrants are trying to convince fellow Republicans that they will do fine with Hispanics by voting against immigration reform. There is a mound of data from polling, focus groups and election results that says anti-immigration reform rhetoric and votes matter quite a lot, and not only with Hispanics. If Cruz’s argument that all this data is wrong rests on an inaccurate assertion about his own experience, then Republicans should be wary. Not all of them are. Rep. Lou Barletta (R-Pa.) also endorsed the “immigration reform is offensive to Latinos” line in an interview with the Daily Caller published Saturday. “What’s going on when Democrats and Republicans talk about immigration really is this battle over the Hispanic population now that is growing here in America and trying to win them over for future elections,” Barletta told The Daily Caller. “That is so misguided and also demeaning to the Latino population, to believe that that is more important to people who are here than a good job, a good education, a better life.” In January, the immigration hardliner portrayed Hispanics and Latin American immigrants as uneducated and government-dependent and said the GOP shouldn’t bother winning over Latino voters at all. “Anyone who believes that they’re going to win over the Latino vote is grossly mistaken,” Barletta said in January. “The majority that are here illegally are low-skilled or may not even have a high school diploma. The Republican Party is not going to compete over who can give more social programs out. They will become Democrats because of the social programs they’ll depend on.” Latinos use less than their fair share of government benefits, according to a study by the Center on Budget and Policy Priorities. The talking point is a variation of a strategy adopted during the Mitt Romney campaign last year, which emphasized that polls show the top concern for Latino voters is the economy and jobs rather than immigration. Romney lost the Hispanic vote by 27 percent to 71 percent.",
      "date": "07/01/2013 01:20 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Palin Calls For Rahm Emanuel To Be Fired",
      "url": "https://search.huffpost.com/click/_ylt=Awr9Ilp6qqtdkzkAR4tsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560186/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fpalin-calls-for-rahm-eman_n_445513/RK=2/RS=ps_dqfcF0i7nueGVZ.30i3cgy.E-",
      "subtitle": "null",
      "author": "Sam Stein",
      "content": " Former Alaska governor Sarah Palin is calling on President Barack Obama to fire White House Chief of Staff Rahm Emanuel over Emanuel’s penchant for using profanity and a statement he made that was derogatory of the handicapped. Really. The 2008 vice presidential candidate put up a Facebook post on Monday evening arguing that Emanuel’s offending slur (in which he said that liberal groups thinking of running health care-related ads against Democratic lawmakers were “F—-ing retarded”) was no less the equivalent of using the “N-word.” I would ask the president to show decency in this process by eliminating one member of that inner circle, Mr. Rahm Emanuel, and not allow Rahm’s continued indecent tactics to cloud efforts. Yes, Rahm is known for his caustic, crude references about those with whom he disagrees, but his recent tirade against participants in a strategy session was such a strong slap in many American faces that our president is doing himself a disservice by seeming to condone Rahm’s recent sick and offensive tactic. The Obama Administration’s Chief of Staff scolded participants, calling them, “F—-ing retarded,” according to several participants, as reported in the Wall Street Journal. Just as we’d be appalled if any public figure of Rahm’s stature ever used the “N-word” or other such inappropriate language, Rahm’s slur on all God’s children with cognitive and developmental disabilities - and the people who love them - is unacceptable, and it’s heartbreaking. The Emanuel remark was reported recently by The Wall Street Journal but dates back to  the heat of the health care wars in August. And it certainly wasn’t the first time the chief of staff (known for an acid tongue) has leveled an odious broadside at one group or another from his perch in the West Wing. Palin presumably seized on this one because of her own experience with the issue — her youngest child, of course, suffers from Down syndrome. But it’s hard to ignore the fact that making hay out of “controversies” like these is her political trademark, regardless of whether there is a personal tie to the matter.",
      "date": "04/04/2010 05:12 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin Trademark Status To Be Achieved By Former Alaska Governor",
      "url": "https://search.huffpost.com/click/_ylt=Awr9Ilp6qqtdkzkARYtsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560186/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fsarah-palin-trademark-name_n_880554/RK=2/RS=5mk3hHlYlv7uoCXe8DOmf4pqgjg-",
      "subtitle": "null",
      "author": "",
      "content": "Sarah Palin will soon have her name trademarked, according to U.S. News & World Report. An Alaska lawyer submitted applications to the United States Patent and Trademark Office last year to trademark the former governor’s name, along with that of her daughter Bristol Palin. For Sarah Palin’s application, there are two classes of commercial service for which her name would be a registered trademark. One is for “information about political elections” and “providing a website featuring information about political issues.” The second is for “educational and entertainment services ... providing motivational speaking services in the field of politics, culture, business and values.” The “Bristol Palin” application is for “educational and entertainment services, namely, providing motivational speaking services in the field of life choices.” Reuters reported earlier this year on a hiccup in Palin’s trademark attempt. The former governor and her daughter had neglected to sign the forms submitted to the U.S. Patent and Trademark Office, temporarily delaying the process. According to U.S. News & World Report, there have been no challenges made to Palin or her daughter’s applications and the deadline to do so for each respective filing has passed. Sarah and Bristol Palin can reportedly expect to receive their trademarks within three months. Trademark",
      "date": "06/20/2011 01:49 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "This Clip Of Sarah Palin Totally Botching A Turkey Pardon Will Make Your Thanksgiving",
      "url": "https://search.huffpost.com/click/_ylt=Awr9Ilp6qqtdkzkAQ4tsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560186/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fsarah-palin-turkeys_n_5835a900e4b01ba68ac3b417/RK=2/RS=16UyfXITGj_AXxb_MQ8Tpv_.wo0-",
      "subtitle": "Depending on how you feel about turkeys, it could also break your Thanksgiving.",
      "author": "Nick Wing",
      "content": " This story was first published in 2012, and has been published every year since. For one day each year, the turkey gets its time to shine. While most of that shining is done quite literally, as the glazed centerpiece of Thanksgiving feasts around the nation, a few fortunate fowl are granted pardons and given a chance to live out their not-so-long lives in greener pastures, awkwardly bobbing their heads, crying gobble-gobble and whatever else it is that turkeys do. Those symbolic pardons may make the turkey eaters among us feel somewhat better about stuffing our faces with coma-inducing amounts of gravy-smothered poultry, yet during one such event in 2008, then-Alaska Gov. Sarah Palin (R) managed to tear the mask (or head?) off the whole charade. We’ll call it the greatest turkey-related disaster in the history of politics. Fresh off a defeat in the 2008 presidential election, Palin headed to a turkey farm in her hometown of Wasilla, Alaska, to pardon a local bird ― a common practice among governors. Palin delivered her prepared remarks over frequent interruptions from clucking birds not as fortunate as the turkey getting the reprieve. She even touted herself as a “friend to all creatures great and small” before posing for a photo op. What happened next was entirely unexpected. While many had recently learned that Palin could be unpredictable ― even a maverick, perhaps ― Americans couldn’t have foreseen her conducting a lengthy on-camera interview while live birds were being fed into a machine of mass turkey murder mere feet behind her. Palin seemed to unwittingly nail her remarks, commenting on the need to find “levity” in her job as turkey after turkey was decapitated by the metal cone of death in the background. The man shoving the struggling birds into the device even looked up toward Palin and the camera as the governor presciently predicted that the spectacle would invite skepticism. (The goriest moments have been censored in the video above.) Although her office later denied that she’d known what was playing out behind her, Palin was reportedly asked if she wanted that particular backdrop for her interview, to which she replied, “No worries.”",
      "date": "11/23/2016 12:23 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Lawrence O’Donnell: Mitt Romney ‘Sounds A Lot Like Sarah Palin’ (VIDEO)",
      "url": "https://search.huffpost.com/click/_ylt=Awr9Ilp6qqtdkzkAQYtsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560186/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2flawrence-odonnell-mitt-romney-sarah-palin_n_1709415/RK=2/RS=TKn0UetLJnPEWL1MuqrQh6ydRkU-",
      "subtitle": "null",
      "author": "",
      "content": "Lawrence O’Donnell discussed Mitt Romney’s tough day in London on his MSNBC show Thursday night, saying he agreed with critics who compared the presumptive GOP candidate to Sarah Palin. Romney made a number of unfortunate gaffes in London, and was subsequently lampooned by members of the British press. After going through Romney’s gaffes and the reactions they elicited, O’Donnell said that the former Massachusetts governor reminded him of Sarah Palin. “It started to occur to me last night, actually, when I was listening to his answers to Brian Williams’ interview,” O’Donnell said. “I began to think - that sounds a lot like Sarah Palin...he would string together these words that technically are sentences but have absolutely no meaning.” He added, “When Sarah Palin was doing that, pretty much everyone called her on it. Mitt Romney seems to be getting away with exactly the same thing, and it seems to me that there’s some kind of double standard going on here because he’s a well-dressed man.” O’Donnell’s guest, former Vermont governor Howard Dean, disagreed with the comparison. “Romney is a fairly sophisticated guy,” Dean said. “I don’t think you can compare him to Sarah Palin, but his performance is pretty appalling.” Watch the exchange in the video above at roughly 6 minutes into the clip.",
      "date": "07/27/2012 08:56 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Palin Considering 2012 Run, Defends Limbaugh’s Use Of ‘Retard’ On Fox News Sunday",
      "url": "https://search.huffpost.com/click/_ylt=Awr9Ilp6qqtdkzkAP4tsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560186/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fpalin-considering-2012-ru_n_452602/RK=2/RS=mD3M3o094rB3gAtyFxuCrV4oVxM-",
      "subtitle": "null",
      "author": "Sam Stein",
      "content": " Former Alaska governor Sarah Palin didn’t cage her answer when pressed Sunday morning as to whether she would consider a run for president in 2012. “I would, I would if I believe that is the right thing to do for our country and the Palin family. Certainly I would do so,” she told “Fox News Sunday,” in an interview that was taped before she addressed a Tea Party convention the night before. “I think that it would be absurd to not consider what it is that I could potentially do to help our country ... . I won’t close a door that perhaps could be open for me in the future.” In her first Sunday show appearance, the 2008 vice-presidential candidate predicted that, if the election were held today, President Barack Obama would actually lose the office he won just a year-and-a-half ago. But — citing a column written by Pat Buchanan — she left open the possibility that his fates could change, particularly (she seemed to wish) if a major attack were to be launched against Iran. Palin also used her platform to continue a call for the president to rid himself of his closest advisers. On Attorney General Eric Holder, she labeled his handling of captured terrorists — “allowing them our U.S. constitutional protections when they do not deserve them” — a firing offense. On Chief-of-Staff Rahm Emanuel, she said his comments calling liberal groups “f-ing retards” was “indecent and insensitive” and cause for his dismissal. But the former governor went to great and sometimes awkward lengths to insist that when conservative talk show host Rush Limbaugh used the same exact term to describe the same exact group, it was simply in the role of political humorist. “They are kooks, so I agree with Rush Limbaugh,” she said, when read a quote of Limbaugh calling liberal groups “retards.” “Rush Limbaugh was using satire ... . I didn’t hear Rush Limbaugh calling a group of people whom he did not agree with ‘f-ing retards,’ and we did know that Rahm Emanuel, as has been reported, did say that. There is a big difference there.” In the 30-minute sit down with host Chris Wallace, Palin addressed a wide swath of largely political topics — the policy minutia, undoubtedly, saved for another time and place. She dismissed charges that her husband Todd played an unacceptably active role in guiding her administration as governor, after it was revealed in recently disclosed emails that the “first dude” was often consulted on weighty matters. She acknowledged moderate successes in Obama’s foreign policy — specifically towards Afghanistan and Pakistan — but still questioned why the president “pals around” with domestic terrorists (Bill Ayers). Finally, she declined several attempts to weigh in on other prospective 2012 candidates, citing only Rep. Paul Ryan (R-Wisc.) as someone who she admired and found intriguing. The impression, in the end, was left that she was charting out a candidacy of her own. Pressed about reports that she was being consulted by a group of Washington-based advisers — those insider elites she often bemoans — on issues both domestic and foreign, she didn’t exactly shoot down the idea that it was prep work for a White House run. “Ever since our PAC was formed we have had good people contributing, some, many volunteers, I guess you would call them advisers yes, fire away emails to me every morning saying this is what happened in Washington overnight, you need to be aware of this,” Palin said. “I have no idea how conventionally people [run for the White House]. How they open a door that perhaps isn’t even open. ... I don’t know how any of that stuff works. I’m just appreciative of having some good information at my fingertips now.”",
      "date": "04/09/2010 05:12 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Palin: Sexism Only Matters When It Hurts Me",
      "url": "https://search.huffpost.com/click/_ylt=Awr9Ilp6qqtdkzkAPYtsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560186/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fpalin-sexism-only-matters_n_363922/RK=2/RS=sEEjjhdx7u2FeW3VdvyXaZ5Z7ec-",
      "subtitle": "null",
      "author": "Jason Linkins",
      "content": " On the matter of Sarah Palin, Newsweek magazine, and THE SEXISM, I think that the Washington City Paper‘s Amanda Hess has basically won the entire discussion. Is the Newsweek cover sexist? Yes. But let’s put the photo back into context for a minute: Sarah Palin’s entire existence is sexist. Let’s try to imagine, for a moment, the thought process that went into creating this Newsweek cover image : “We need to convey that Palin sucks really bad! Let’s take some photo of Palin lookin’ sexy, slap it on the cover of Newsweek, and then use her sexuality in attempt to draw attention to all the terrible things this woman has brought upon us.” Hey! That sounds kind of like what John McCain did when he chose Palin as his VP: Found an attractive lady, slapped her on to his campaign, and used her image as a sexy lady in order to distract people from her scant qualifications, her total lack of concern for women’s issues, and her complete suckiness as a candidate. Real talk. As Hess points out, Palin has been subjected to a noticeable share of deplorable treatment. And I think it’s absurd to suggest that Newsweek selected this photo from Runner’s World magazine because they thought it would cast the subject of their cover story in a neutral light or elucidate the magazine’s underlying point. I think that Newsweek made the choice they did to ensure that if they couldn’t manage a discrediting of Palin on the merits, they could plant their discrediting through some cheap subtextual shortcut. But Hess is correct when she points out that “the game works both ways.”  You remember that whole day of our lives that was given over to that riveting discussion over whether the phrase “lipstick on a pig,” was a sexist slag at Sarah Palin?  Because at one point, Palin had used the word “lipstick” in a joke?  That bought Palin a whole day of media figures rising to her defense over something that was plainly nonsensical.  Hess puts it like this: “I am sick and tired of only having to care about it when that sexism means something bad for Sarah Palin.”  But you know what?  That, too, is “oh-so-expected by now.” RELATED:\n\nSarah Palin’s Entire Existence Is Sexist [The Sexist] PREVIOUSLY, on the HUFFINGTON POST:\n\nI’m Officially Shutting Down This ‘Lipstick On A Pig’ Discussion [Would you like to follow me on Twitter? Because why not? Also, please send tips to tv@huffingtonpost.com — learn more about our media monitoring project here.]",
      "date": "03/18/2010 05:12 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Us Weekly Falls For Fake Sarah Palin-Christina Aguilera Story",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DtWQqqtd9dkAnCZsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560209/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fus-weekly-fake-sarah-palin_n_821116/RK=2/RS=vZOoPx4tG20TEuC_rVm6wb0sgSk-",
      "subtitle": "null",
      "author": "",
      "content": "US Weekly’s website published a story (link since deleted) about Sarah Palin Wednesday that turned out to be a complete hoax. The celebrity magazine posted a story claiming that Palin had slammed Christina Aguilera for her national anthem flub during Sunday’s Super Bowl.  The outlet attributed quotes to a Palin appearance on Sean Hannity‘s radio show.  The only problem? They were completely made up. The quotes came from a parody site called SuperTuesdayNews, GossipCop points out. The fake Palin quotes, since deleted from UsMagazine.com, included the Alaska Republican calling the pop singer an “airhead diva” and telling Hannity that Aguilera “doesn’t understand something so basic about America.” “I’m sure Ms. Aguilera is a very nice person, but I just think the American people deserve better than a demanding beauty queen who’s clearly in over her head,” the parody continued. “It boggles the mind that a major outlet could read these obviously satirical, fake quotes and treat them as the real deal,” GossipCop wrote. “However badly Aguilera botched the anthem last Sunday, Us Weekly just did a hundred times worse.”",
      "date": "02/09/2011 07:52 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin’s Sarah PAC Spent $63,000 On Copies Of ‘Going Rogue’",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DtWQqqtd9dkAmiZsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560209/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fsarah-palins-sarah-pac-sp_n_444656/RK=2/RS=KVCDpdgmX0LMDTSC05nyBQfXhl0-",
      "subtitle": "null",
      "author": "",
      "content": "Sarah PAC, Sarah Palin’s political action committee, raised more than $1.4 million in the second-half of 2009, according to the Washington Post’s Chris Cillizza. That figure brings the group’s fundraising haul to $2.1 million for 2009. Cillizza reports: ...Sarah PAC and ended the year with $900,000 in the bank. She donated $64,600 to candidates and party committees. That relatively high burn rate is due to an expansion of the organization’s staff, according to those familiar with its operations. (Remember that with Palin out of office — she resigned the governorship in July 2009 — her PAC is her only political and policy vehicle.) Beyond new staff and donations, what else is Sarah PAC spending money on? Books — her own book — according to ABC News: The former Alaska governor and 2008 Republican vice presidential candidate had her political organization spend more than $63,000 on what her reports describe as “books for fundraising donor fulfillment.” The payments went to Harper Collins, her publisher, and in some instances to HSP Direct, a Virginia-based direct mail fundraising firm that serves a number of well-known conservative politicians and pundits. Sarah PAC spent another $8,000 on colorful bookmarks designed by a Nashville-based event branding firm. And her committee paid her publisher $20,000 for what appears to have been the cost of sending her personal photographer and another aide along on her book tour. Hotline offers a more detailed breakdown of the former governor’s expenditures. How many copies of “Going Rogue” would $63,000 buy? It depends. Without knowing how much sales tax was paid on the books or if the former governor bought them at a bulk rate, Palin’s group could have bought anywhere from 2,173 (at suggested full retail price of $28.99) to 4,666 copies (at a steeply discounted Amazon rate of $13.50).",
      "date": "04/03/2010 05:12 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "How Mitt Romney Tops Sarah Palin",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DtWQqqtd9dkAmCZsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560209/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fhow-mitt-romney-tops-sara_n_5431069/RK=2/RS=DlVaZkDRyY9nmmWjC8Wak5fMCYw-",
      "subtitle": "null",
      "author": "",
      "content": "He may have been a dud with voters, but the former GOP nominee knows how to spot success in others—all the candidates he’s endorsed this cycle have won their primaries. Read more on The Daily Beast",
      "date": "06/02/2014 08:54 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Tina Fey as Sarah Palin",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DtWQqqtd9dkAliZsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560209/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2ftina-fey-as-sarah-palin_n_883908/RK=2/RS=8qC_3zh7Yd6wLQSs56JN5ABqe7k-",
      "subtitle": "null",
      "author": "",
      "content": "",
      "date": "11/03/2010 11:44 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Poll Has Good News For Mitch Daniels, Bad News For Sarah Palin",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DtWQqqtd9dkAlCZsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560209/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fpoll-has-good-news-for-mi_n_833966/RK=2/RS=KNCIiNhafnX5i4XO69IRwnSUTXA-",
      "subtitle": "null",
      "author": "",
      "content": "In the view of Democratic and Republican political operatives, the potential 2012 GOP White House hopefuls whose fortunes are most on the rise are Indiana Gov. Mitch Daniels and former Minnesota Gov. Tim Pawlenty, while former Alaska Gov. Sarah Palin is a rapidly depreciating asset, according to this week’s National Journal Political Insiders Poll. Read more on Hotline On Call",
      "date": "03/10/2011 10:17 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "The One Thing That Hasn't Changed About Sarah Palin's Style Over The Years",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DtWQqqtd9dkAkiZsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560209/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fsarah-palin-style-evolution_n_56afd637e4b057d7d7c7dd15/RK=2/RS=qtrCyOZNDpPMSKnu9P8G4D307mg-",
      "subtitle": "null",
      "author": "",
      "content": "",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez Calls Op-Ed Comparing Her To Sarah Palin ‘Resentful’",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DtWQqqtd9dkAkCZsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560209/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2falexandria-ocasio-cortez-sarah-palin-washington-post_n_5c34db5ce4b0116c11f0dbd8/RK=2/RS=Xf_xGLm9Yj4IjKtZN.HEwPT73Ek-",
      "subtitle": "The congresswoman tweeted back at a Washington Post column that said she’s “already gotten more publicity than she deserves.”",
      "author": "Jenna Amatulli",
      "content": " Rep. Alexandria Ocasio-Cortez (D-N.Y.) slammed as “resentful” a Washington Post op-ed that compared her to former presidential candidate Sarah Palin. “Naturally, the same week we kick-start a nat’l convo on marginal tax rates endorsed by Nobel-Prize winning economists, I’m being described as ‘vacuous,’” tweeted Ocasio-Cortez on Tuesday. “If you’re allowed to characterize female politicians as ‘unlikeable,’ are we allowed to describe takes like these [as] ‘resentful?’” The 29-year-old lawmaker was referencing a column written by Max Boot titled, “Alexandria Ocasio-Cortez shouldn’t approach her facts the way Trump does.” The piece opens by saying that the new congresswoman “has already gotten more publicity than she deserves” and that the “former bartender is a person of little significance — one of the most junior members of the House, she can expect to wait decades before exercising any real power in this hierarchical institution.” Boot praises Ocasio-Cortez as “down-to-earth and quick-witted,” but criticizes her for caring “more about ideological correctness than factual correctness.” Then he ends with a comparison to Palin that “neither woman will appreciate.” “Palin was another talented young communicator who made a big splash in national politics before having her lack of knowledge painfully exposed. Instead of studying up, Palin gave up any pretense of seriousness and has now disappeared from the debate. This is a cautionary tale for Ocasio-Cortez,” Boot writes. A few minutes after snapping back at Boot’s column, Ocasio-Cortez tweeted another missive that said: “Let’s refocus our energy and coverage to policies instead of personality.” Ocasio-Cortez has been an outspoken proponent for reopening the government, as the partial shutdown hits its 18th day. On Tuesday, she later tweeted, “The American people did not organize the biggest midterm election in ~100 years so their new leaders could sit back as the nation waits in crisis. Our class was elected for a very specific reason: to lead differently, propose bold ideas, and create positive change for all people.”",
      "date": "01/08/2019 02:26 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sacha Baron Cohen Reveals The Not-So-Funny Reason He Didn’t Air Sarah Palin Bit",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DtWQqqtd9dkAjiZsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560209/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fsacha-baron-cohen-sarah-palin-interview-reason_n_5cf79733e4b0dc70f44f890b/RK=2/RS=HzKsaQfyneZTHQjs18eB7SSTk7E-",
      "subtitle": "The comedian has finally explained why his undercover interview with Palin never made it into his Showtime series “Who Is America?”",
      "author": "Lee Moran",
      "content": " Sacha Baron Cohen’s undercover interview with GOP former vice presidential candidate Sarah Palin never actually made it into the final cut of his satirical Showtime series “Who Is America?” And the British comedian has finally revealed the awkward reason. “Just like her candidacy for vice president, she wasn’t good enough to make the show,” Baron Cohen said in the latest episode of The Daily Beast’s “The Last Laugh” podcast. Ouch. Palin called out Baron Cohen’s “evil, exploitive, sick ‘humor’” in a blistering Facebook post in July 2018 after he interviewed her for the show while in disguise. The former Alaska governor’s criticism garnered immense publicity for the seven-episode series that was set to debut the following week. Baron Cohen acknowledged feeling “quite a lot of pressure” from Showtime bosses to use the clip in the final edit, but said the interview ultimately “wasn’t very good.” “You need someone to fully engage and answer the questions,” he added, but Palin “gave these rote answers as if she was on a presidential campaign.” He did, however, tauntingly list her as “Special Publicity Consultant” in the last episode’s credits. Baron Cohen did air his interviews with a number of other high profile political names. He successfully got former Vice President Dick Cheney to sign a waterboard kit, punked GOP former Alabama Senate nominee Roy Moore with a spoof pedophile detector and tricked gun rights activist Dan Roberts into putting a dildo in his mouth. Check out the full episode of “The Last Laugh” podcast here.",
      "date": "06/05/2019 07:52 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin Sells Out Her Empathy To Boost Her Personal Brand In Endorsing Donald Trump",
      "url": "https://search.huffpost.com/click/_ylt=Awr9DtWQqqtd9dkAjCZsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560209/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fsarah-palin-donald-trump-endorsement_n_569fb03ce4b0a7026bf9bde1/RK=2/RS=TJhYhS3Tq_yvWCITuZ4Yy5XuQxc-",
      "subtitle": "She once professed to being a champion of John McCain’s heroism and people with disabilities. Now she’s the chief backer of a man who proudly denigrates both.",
      "author": "Scott Conroy",
      "content": " MANCHESTER, N.H. — When most people think back on Sarah Palin’s F5 tornado of a 2008 vice-presidential run, one of a few lasting images might jump immediately to mind. If you’re a fan of hers, maybe it’s the pitch-perfect line about hockey moms and pit bulls that she ad-libbed at her barnburner of a nomination speech at the Republican convention in St. Paul, Minnesota. If you’re not, perhaps it’s the Alaska moose-in-headlights moment when she failed to provide Katie Couric with the name of a single newspaper or magazine that she read to stay informed. For me, it’s something different. During the 2008 general election, I was one of less than a dozen journalists who traveled around the country with Palin from the beginning of her campaign to the end of it as an off-air reporter for CBS News. In this role, I had an up-close view of the woman who most Americans only saw on their TV screens, or — if they were a supporter — from whatever vantage point they managed to secure among the cheering crowds that regularly numbered in the tens of thousands around the country. Palin and I flew on the same chartered campaign plane, laughed in unison as we watched Tina Fey role out her uncanny impression on “Saturday Night Live,” and interacted fairly regularly as fellow travelers on a shared, strange trip — particularly after she “went rogue” and started talking to her assigned press corps more frequently. No matter the campaign’s intended message of the day — or what McCain’s strategists wanted her to say — there were two topics that Palin never failed to bring up on her own wherever she went: People with disabilities and the heroism of her running mate, John McCain. Most of the country saw Palin as a two-dimensional caricature, but I never once questioned her sincerity when it came to these particular causes. After all, I was there when she exchanged a series of heartfelt hugs with a woman afflicted with Down syndrome in Pennsylvania and watched as she lingered to commiserate with Gold Star moms in Indianapolis. And as my co-author Shushannah Walshe and I reported in our 2009 book, Sarah From Alaska, on election night at McCain headquarters in Arizona, Palin sought to give her own heartfelt concession speech that relied heavily on the two subject matters that she was most passionate about. The speech, which McCain campaign aides ultimately barred her from delivering, included a particularly touching recollection of Palin’s interaction with a boy with Down syndrome named Charlie, whom she had met at a rally in Florida. “So tonight, a special shout-out to you, Chuck… darlin’,” Palin intended to say in her address in defeat that night. “And let me repeat what I told you, because it applies to you and to all children and adults with special needs across America: You are beautiful, and I am so proud to know that my boy Trig will grow up to be just like you … it’s time America shows you her good heart.” On her second pet topic — McCain’s exceptional bravery — Palin had intended to deliver another particularly eloquent salute: Above all, I am grateful to the man who took a chance on me. From that moment to this, I have had the rare enough privilege in politics of praising a candidate whose story, character, and personal heroism required no embellishment. I said things about him — about how valiantly he has served and what he has overcome — things he could not say about himself, because he is that kind of man. It would be a happier night if elections were a test of valor and merit alone, but that is not for us to question now. Enough to say it has been the honor of a lifetime to fight at the side of John S. McCain. Perhaps it was for the best that McCain’s aides did not allow her to give the speech that night. If they had, Palin may have felt a tinge of the shame that appeared to be entirely lacking during the full-throated endorsement she gave Donald Trump on Tuesday night. Trump, you’ll recall, is the Republican presidential front-runner, who in July unapologetically declared that McCain — a former Vietnam War prisoner of war who spent five-and-a-half-years in captivity, and endured torture at the Hanoi Hilton — was “not a war hero” before adding a memorable addendum, as only he could. “I like people that weren’t captured, OK?” said Trump, who has pointed to a “foot thing” as one reason why he received a series of deferments during the Vietnam era. And, yes. Trump is also the same guy who in November stood on a stage and performed a crude imitation of a New York Times reporter who suffers from a physical disability. Now, imagine for a moment that we’re back in 2008 during those tumultuous autumn weeks when the markets were melting down and Palin was seeking to lift the GOP ticket to an unlikely comeback through the sheer force of her personality. What if then it had been a Democrat who’d questioned McCain’s heroism or mocked a person with a disability in front of a cheering crowd? How might Sarah Palin have responded to that? I have a pretty good guess. Let’s just say that the echoes of righteous indignation would’ve been audible from here to Wasilla. Until her shameless endorsement of America’s most famous bully, Palin largely had been loyal to McCain — the man who plucked her from relative obscurity in Alaska and made her a household name. At the height of the Tea Party wave, for instance, Palin endorsed and campaigned for McCain against his conservative challenger during a tough 2010 Republican primary fight in Arizona. And McCain, in turn, has offered nothing but public praise for his former running mate in the ensuing years. Still, Palin’s endorsement of her fellow reality TV star shouldn’t come as a complete surprise. Politically, Palin and Trump have much in common in their anti-establishment instincts, ideological fluidity and eagerness to use vitriol as their most potent weapon against adversaries. And in several ways, Trump’s campaign represents the realization of the grievance-driven populism that Palin first brought to national prominence eight years ago. Her endorsement wasn’t a surprise to me. Palin had made her intentions pretty clear on this front back in July when she argued with a straight face that, hey, Donald’s a hero, too — just like McCain! Much like Trump, Palin’s every public move these days appears intended to boost her brand — the brand that has made her untold millions of dollars since she quit her day job in mid term back in 2009, but has become less potent by the year since then. And for a fading celebrity-politician in desperate need of a new jolt of attention and influence, the ability to give Trump a much-needed boost among conservatives in Iowa was a temptation too powerful to turn down — it made sense in the context of Palin’s need to maintain whatever is left of the political image she so carefully protects. It probably didn’t make a whole lot of sense to McCain though — or to Charlie.",
      "date": "01/20/2016 12:39 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Ann Coulter Criticizes Sarah Palin, Says GOP Has A Problem With ‘Con Men And Charlatans’",
      "url": "https://search.huffpost.com/click/_ylt=Awr469yoqqtdKBUAUT1sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560232/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fann-coulter-sarah-palin_n_1345588/RK=2/RS=EgznnW8vWH_sbIpZirj7sXnFv_g-",
      "subtitle": "null",
      "author": "Jason Linkins",
      "content": " Yesterday, while in a deep and ethereal reverie about “Game Change: The Movie,” which was based on “Game Change: The Book,” which was based on “Game Change: The Catchphrase,” Washington Post columnist Richard Cohen surmised that Sarah Palin had personally ruined politics forever. By his reckoning, the emergence of Herman Cain and Michele Bachmann and Rick Perry — really, all of the candidates in the GOP race not named “Mitt Romney” — was evidence of the fact that the GOP had decided to embrace Palinesque qualities in their candidates. And on further review, Cohen told his readers that he was quite sure that the Democrats would one day follow suit and embrace such candidates as well, because everyone knows that politicians who defame government and ridicule compromise typically ascend to stratospheric heights in the Democratic Party. Well, if my counterargument wasn’t enough, let’s turn to the Daily Caller, where Ann Coulter argues that Palin’s legacy in this regard is wholly owned by the GOP. (Countering Cohen with Coulter just feels right to me, you know?) Coulter, having observed that Palin has been one of the loudest voices to promote both a “brokered convention” and herself as the solution to that deadlock, jumped to what she saw as a problem in the GOP: Coulter said that might be a weakness in the Republican Party as a whole — that certain individuals become celebrities and are allowed to profit off that status and yet still interfere in GOP politics, which Democrats have been able to avoid. “And just a more corporate problem is I think our party and particularly our movement, the conservative movement, does have more of a problem with con men and charlatans than the Democratic Party,” she said. “I mean, the incentives seem to be set up to allow people — as long as you have a band of a few million fanatical followers, you can make money. The Democrats have managed to figure out how not to do that.” Coulter’s solution? Another one of those pledge thingies. Hers would preclude Republican presidential candidates from seeking to “profit off of political stardom.” “I want them to sign a pledge,” said Coulter, “saying, ‘If I lose the nomination I pledge I will not take a gig with Fox News or write a book.’” I’m not entirely sure how this would work — the pre-primary season candidate memoir seems to be a perennial fixture of the presidential cycle, and occasionally, they are very profitable. I’d also point out that while Mike Huckabee definitely parlayed his presidential candidacy into a lucrative television career, it seems to me that he has managed to do this in a fairly humble and tasteful way. Besides, in politics, one needn’t achieve “stardom” to end up some sort of well-compensated embarrassment. Just look at Evan Bayh! READ THE WHOLE THING:\n\nCoulter on Palin, brokered convention: GOP has ‘a problem with con men and charlatans’ [The Daily Caller] [Would you like to follow me on Twitter? Because why not?]",
      "date": "03/14/2012 04:19 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin Attempts To Insult Stacey Abrams With ‘Literal Loser’ Tweet",
      "url": "https://search.huffpost.com/click/_ylt=Awr469yoqqtdKBUATz1sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560232/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fsarah-palin-insults-stacey-abrams-with-literal-loser-tweet_n_5c51c8a3e4b0070a3bdb29c5/RK=2/RS=NWQgWqe1PiEl8nJ6.jb_lL0FZ7E-",
      "subtitle": "null",
      "author": "",
      "content": "",
      "date": "null",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sacha Baron Cohen’s ‘Who Is America?’ Character Rebuts Sarah Palin",
      "url": "https://search.huffpost.com/click/_ylt=Awr469yoqqtdKBUATT1sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560232/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fsacha-baron-cohen-sarah-palin_n_5b47a819e4b022fdcc577b90/RK=2/RS=icNXNN5qdjKUx_vMb.h5WtcQoS8-",
      "subtitle": "The actor’s latest alter ego, Dr. Billy Wayne Ruddick Jr., says the former vice presidential candidate is “bleedin’ FAKE NEWS.”",
      "author": "Curtis M. Wong",
      "content": " Former vice presidential candidate Sarah Palin had harsh words for Sacha Baron Cohen earlier this week upon learning she’d been pranked by the actor-comedian for his new TV series, “Who Is America?” Palin claimed to have been “duped” by Cohen, saying in a lengthy Facebook post on Tuesday that she’d flown across the country for an interview she believed was for a “legit Showtime historical documentary.” Instead, Cohen appeared to have disguised himself as a disabled veteran, and proceeded to conduct an interview “full of Hollywoodism’s disrespect and sarcasm,” she said. On Thursday, Cohen fired back at Palin... well, sort of. In a note posted to Twitter, he responded to the former Alaska governor’s claims in character as Billy Wayne Ruddick Jr, Ph.D, the “citizen journalist” of “Who Is America?” The image also contained the URL to Ruddick’s right-wing “website,” which features articles like “Obama is a Kenyan,” “Crooked Hillary” and “Hollywood Satanic Elite.” Palin, it turns out, isn’t the only conservative figure angered by “Who Is America?,” which Showtime is touting as a seven-episode series that “explores the diverse individuals, from the infamous to the unknown across the political and cultural spectrum, who populate our unique nation.” On Thursday, failed Alabama Senate candidate Roy Moore said he was invited to Washington, D.C. earlier this year “to receive an award for my strong support of Israel,” only to discover upon arrival that he’d also been pranked by Cohen. “I am involved in several court cases presently to defend my honor and character against vicious false political attacks by liberals like Cohen,” Moore said. “If Showtime airs a defamatory attack on my character, I may very well be involved in another.”",
      "date": "07/12/2018 06:31 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin’s SarahPAC Has $1.3 Million In The Bank",
      "url": "https://search.huffpost.com/click/_ylt=Awr469yoqqtdKBUASz1sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560232/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fsarah-palin-sarahpac-funds-fec_n_814532/RK=2/RS=uFeFrHlDHqnXaFtd7snmysEYN64-",
      "subtitle": "null",
      "author": "",
      "content": "Former Alaska Gov. Sarah Palin’s political action committee, SarahPAC, is kicking off what is likely to be a busy year with $1.3 million in the bank, Politico’s look at the group’s Federal Election Commission filings finds. The FEC records show that Palin raised $279,000 over a five-week period at the end of the year, donations that came primarily in sums of $200 or less. The PAC also spent nearly $230,000 during the filing period and a total of nearly $2.6 million throughout 2010, according to the report. Perhaps the most interesting tidbit, however, is the apparent lack of any notable fundraising or staffing push from the political arm of a candidate who has been among the most talked-about potential 2012 GOP presidential contenders. From Politico’s report: The filing shows no indication that Palin has started to ramp up for a potential presidential run, as no new staff shows up on SarahPAC’s expenses — which remain very low compared to a campaign of even moderate size. Her PAC spent nearly $230,000 for the period between the end of the campaign and end of the calendar year, and over $2.6 million in 2010. Despite those details, a recent report from RealClearPolitics suggested that Palin’s operatives are, in fact, actively developing a ground game in the key primary state of Iowa, though perhaps not in a manner that would be clear from the FEC filing. From the RealClearPolitics report: Palin’s initial Iowa push appears to differ most clearly from that of other candidates in that no SarahPAC staffer has been assigned to work the state on the ground, and her aides are not yet making hard pushes to lock up experienced operatives. According to RCP, Palin’s pre-campaign architecture has instead been heavily constructed through third-party grassroots activists and private discussions with local Tea Party leaders.",
      "date": "01/26/2011 06:36 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Alexandria Ocasio-Cortez Responds To ‘Basic Civics’ Jab From Sarah Palin",
      "url": "https://search.huffpost.com/click/_ylt=Awr469yoqqtdKBUAST1sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560232/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fsarah-palin-alexandria-ocasio-cortez_n_5bf47a3ae4b03b230f9c45e0/RK=2/RS=JzCZkHbz5TG4TWsnA_pnGi9ivNo-",
      "subtitle": "Palin’s jabs “look like the FWD:RE:FWD:WATCH THIS grandpa emails from the ’08 election they lost,” the representative-elect joked.",
      "author": "Ryan Grenoble",
      "content": " She’s not been sworn into office yet, but Alexandria Ocasio-Cortez is already proving capable at rebuffing attacks ― this time from a former GOP standard-bearer. Former vice presidential candidate Sarah Palin tweeted a jab at the incoming Democratic congresswoman from New York on Thursday, calling out Ocasio-Cortez for misspeaking in an interview and referring to the three branches of government as the “three chambers of Congress,” then the “three chambers of government,” which Ocasio-Cortez called “the presidency, the Senate and the House.” The irony of Palin commenting on someone else’s gaffe wasn’t lost on the Twitter crowd ― after all, the former Alaska governor’s 2008 vice presidential bid was marked by far greater fumbles. Ocasio-Cortez, meanwhile, issued her own tongue-in-cheek response. “Now that’s *TWO* fallen GOP Vice Pres candidates going after a freshman Congresswoman that’s not even sworn in yet,” she tweeted. “Isn’t it a little early to be bringing out the big guns? Especially when they look like the FWD:RE:FWD:WATCH THIS grandpa emails from the ’08 election they lost.” Ocasio-Cortez clarified that the second vice presidential candidate was Joe Lieberman, who ran as a Democrat and served in the Senate as an independent. Her beef with the senator presumably stems from a June Wall Street Journal editorial he wrote, warning readers her non-mainstream candidacy “hurts the party, Congress and even America.”",
      "date": "11/20/2018 06:01 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "John McCain Now Wishes He’d Never Selected Sarah Palin As His 2008 Running Mate",
      "url": "https://search.huffpost.com/click/_ylt=Awr469yoqqtdKBUARz1sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560232/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fjohn-mccain-sarah-palin-regret_n_5aefac46e4b041fd2d28155c/RK=2/RS=IS4OWwFFUujnKixDbnkL4pWJVYw-",
      "subtitle": "The Arizona senator says he ignored his gut on that one.",
      "author": "Ed Mazza",
      "content": " Sen. John McCain (R-Ariz.) reportedly wishes he had never picked former Alaska Gov. Sarah Palin (R) as a running mate for his unsuccessful 2008 presidential campaign. According to The New York Times, McCain had considered Joe Lieberman, then an independent senator from Connecticut, for the job of vice president. However, advisors warned against picking the longtime member of the Democratic Party who still caucused with them. “It was sound advice that I could reason for myself,” McCain wrote in his upcoming autobiography, “The Restless Wave: Good Times, Just Causes, Great Fights and Other Appreciations,” per the Times. “But my gut told me to ignore it and I wish I had.” In an upcoming HBO documentary, McCain described his decision to not select Lieberman as “another mistake that I made.” Lieberman, who endorsed McCain and spoke at the Republican National Convention on the senator’s behalf, had run for vice president as a Democrat on the 2000 ticket headed by Al Gore. In an excerpt of the book posted online by NPR, McCain called Palin “a popular, energetic and accomplished reformer.” But he also admitted there were some problems. “She stumbled in some interviews and had a few misjudgments in the glare of the ceaseless spotlight,” McCain wrote. “Those missteps too are on me. She didn’t put herself on the ticket. I did.” The duo ultimately lost to Barack Obama and Joe Biden. Palin resigned as governor of Alaska the following year and became a leading voice of the “Tea Party” movement. McCain, 81, is now battling brain cancer. “The Restless Wave” will be released later this month. (h/t The Hill) CORRECTION: Due to an editing error, a previous version of this story indicated Joe Lieberman endorsed John McCain for president and later ran for vice president. In fact, he ran for vice president in the 2000 election and endorsed McCain’s 2008 campaign for president.",
      "date": "05/07/2018 12:37 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Showtime To Sarah Palin: Sacha Baron Cohen Never Posed As A Disabled Vet With You",
      "url": "https://search.huffpost.com/click/_ylt=Awr469yoqqtdKBUART1sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560232/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fshowtime-sarah-palin-sacha-baron-cohen-disabled-vet_n_5b4dfa21e4b0fd5c73bf39a4/RK=2/RS=nktno4hkQ0nzugeYTaxZZs428v8-",
      "subtitle": "The cable network defended the comedian amid accusations of “stolen valor.”",
      "author": "Elyse Wanshel",
      "content": " Showtime is standing behind Sacha Baron Cohen. On Monday, the company released a statement defending the comedian and star of its new comedy series “Who Is America?” after former vice presidential candidate Sarah Palin claimed that Baron Cohen “duped” her into an interview by pretending to be a disabled war veteran named Billy Wayne Ruddick Jr., Ph.D. It’s an accusation that Baron Cohen has publicly denied, albeit in character. Last week Ruddick’s Twitter account said, “I did NOT say I was a War Vet. I was in the service ― not military, but United Parcel, and I only fought for my country once ― when I shot a Mexican who came onto my property.” In its more sober response this week, Showtime said: There has been widespread misinformation over the past week about the character of Billy Wayne Ruddick Jr., Ph.D., performed by Sacha Baron Cohen on the Showtime comedy series Who Is America? Baron Cohen did not present himself as a disabled veteran, and viewers nationwide who watched the premiere on Sunday can now attest to that. The premium cable network then pointed to Baron-Cohen-as-Ruddick’s interview of Sen. Bernie Sanders (I-Vt.) in the first episode. Sanders asked Ruddick if he was disabled. “He stated that he is not and uses a mobility scooter to conserve his energy,” Showtime wrote. The network said that in dealing with Palin, Baron Cohen never presented himself as a U.S. military veteran and never wore any military apparel of any kind “during the booking process or during the filming of her interview.” Showtime also noted that Baron Cohen did not appear in a wheelchair. Last week the former Alaska governor published a scathing post on her website and her Facebook page describing her experience with Baron Cohen’s “evil, exploitive, sick ‘humor.’” She called on the former “Borat” star, Showtime and CBS (Showtime’s parent company) to “donate all proceeds to a charitable group that actually respects and supports American Vets.” Disgraced former Alabama senatorial candidate Roy Moore also claimed last week that he was conned into an interview with Baron Cohen and accused the comedian of “trickery, deception and dishonesty.” A #BoycottShowtime campaign has been launched on Twitter. This week, a billboard appeared across the street from CBS studios in Los Angeles, per the Hollywood Reporter. The billboard, which was reportedly created by a “conservative street artist,” reads: “Sacha Baron Cohen Walks Away With a Hit ... and a touch of stolen valor. Who Is America? Sat, 9pm. CBS.” Not every public personality who was interviewed by Baron Cohen as Ruddick has lashed out after discovering that they were misled. Ted Koppel admitted to being fooled by Baron Cohen last week as well. The veteran journalist said he had a feeling that something was off when the man who was interviewing him — whom Koppel described as sitting in a wheelchair with an oxygen tank — kept asking him about the crowd size at President Donald Trump’s inauguration rather than questions pertaining to the subject matter Koppel was told they’d discuss.",
      "date": "07/17/2018 05:45 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sacha Baron Cohen Trolls Sarah Palin With Cheeky Golden Globes Request",
      "url": "https://search.huffpost.com/click/_ylt=Awr469yoqqtdKBUAQz1sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560232/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fsacha-baron-cohen-sarah-palin-golden-globes_n_5c0a3ea2e4b04046345ae4eb/RK=2/RS=J.NHvVmxRrOwdIWIauuUtzIlhd0-",
      "subtitle": "The British comedian received a nomination for his satirical series “Who Is America?”",
      "author": "Lee Moran",
      "content": " Sacha Baron Cohen risked reigniting his feud with former GOP vice presidential candidate Sarah Palin after he cheekily asked her to be his date at the Golden Globes 2019 awards ceremony. Palin slammed the British comedian’s “evil, exploitive, sick ‘humor’” in July after he conducted an interview with her, while in disguise, for his satirical Showtime series “Who Is America?” The segment with the former Alaska governor never actually aired, but credits for the final episode mockingly listed her as “Special Publicity Consultant” because of the media coverage the show garnered from her criticism. On Thursday, Baron Cohen couldn’t resist poking fun at Palin again after the Hollywood Foreign Press Association nominated him for “Best Performance by an Actor in a Television Series, Musical, or Comedy.” “This show was a labour of love for over two years,” he said in a statement to Entertainment Weekly. “It is a shame they overlooked the amazing performances by the rest of the cast, particularly Dick Cheney and Roy Moore,” Baron Cohen jokingly added. “Meanwhile Ms. Palin, despite being cut from the show, I hope you will accept my invitation to be my date for the ceremony.” Those duped by Baron Cohen for the show included disgraced former Arizona sheriff Joe Arpaio, failed GOP U.S. Senate candidate Roy Moore, former Georgia state Rep. Jason Spencer (R) and former Vice President Dick Cheney. Check out the rest of the Golden Globes 2019 nominees here.",
      "date": "12/07/2018 05:27 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin’s Attempt To Mock ‘Literal Loser’ Stacey Abrams Backfires On Twitter",
      "url": "https://search.huffpost.com/click/_ylt=Awr469yoqqtdKBUAQT1sBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560232/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fsarah-palin-stacey-abrams-twitter_n_5c51563de4b0f43e410c571b/RK=2/RS=lVUmT2E4LS7t.Kwf8g6yREtoDBM-",
      "subtitle": "The former vice presidential candidate gets hit with a brutal reminder of her own history.",
      "author": "Ed Mazza",
      "content": " Former vice presidential candidate Sarah Palin attempted to mock Stacey Abrams as a “literal loser” on Tuesday. It didn’t go well. Abrams, a rising star in the Democratic Party after losing a closer-than-expected race in deep red Georgia, has been tapped to deliver the response to President Donald Trump’s State of the Union address next week. But Palin ― the former Alaska governor who was on the literal losing ticket in 2008 when she ran on the Republican ticket alongside John McCain against Barack Obama― tweeted: Chuck Schumer Wants A LITERAL LOSER To Deliver The Democratic SOTU Response https://t.co/NkSD9kLhX3 Palin’s tweet ― including the “literal loser” phrase ― was the headline to a story she was linking to, and not written by her. But given the fact that she shared it without altering it, Palin was given a pretty blunt reminder of her own history: I must have missed when you were sworn in as Vice President, literal loser.",
      "date": "01/30/2019 03:51 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sacha Baron Cohen Trolls Sarah Palin With Cheeky Golden Globes Request",
      "url": "https://search.huffpost.com/click/_ylt=Awr9IlrAqqtdQp8A.NNsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560256/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fsacha-baron-cohen-sarah-palin-golden-globes_n_5c0a3ea2e4b04046345ae4eb/RK=2/RS=njU5rNYsghM68ayHGe5pycI72zg-",
      "subtitle": "The British comedian received a nomination for his satirical series “Who Is America?”",
      "author": "Lee Moran",
      "content": " Sacha Baron Cohen risked reigniting his feud with former GOP vice presidential candidate Sarah Palin after he cheekily asked her to be his date at the Golden Globes 2019 awards ceremony. Palin slammed the British comedian’s “evil, exploitive, sick ‘humor’” in July after he conducted an interview with her, while in disguise, for his satirical Showtime series “Who Is America?” The segment with the former Alaska governor never actually aired, but credits for the final episode mockingly listed her as “Special Publicity Consultant” because of the media coverage the show garnered from her criticism. On Thursday, Baron Cohen couldn’t resist poking fun at Palin again after the Hollywood Foreign Press Association nominated him for “Best Performance by an Actor in a Television Series, Musical, or Comedy.” “This show was a labour of love for over two years,” he said in a statement to Entertainment Weekly. “It is a shame they overlooked the amazing performances by the rest of the cast, particularly Dick Cheney and Roy Moore,” Baron Cohen jokingly added. “Meanwhile Ms. Palin, despite being cut from the show, I hope you will accept my invitation to be my date for the ceremony.” Those duped by Baron Cohen for the show included disgraced former Arizona sheriff Joe Arpaio, failed GOP U.S. Senate candidate Roy Moore, former Georgia state Rep. Jason Spencer (R) and former Vice President Dick Cheney. Check out the rest of the Golden Globes 2019 nominees here.",
      "date": "12/07/2018 05:27 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin’s Attempt To Mock ‘Literal Loser’ Stacey Abrams Backfires On Twitter",
      "url": "https://search.huffpost.com/click/_ylt=Awr9IlrAqqtdQp8A9tNsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560256/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fsarah-palin-stacey-abrams-twitter_n_5c51563de4b0f43e410c571b/RK=2/RS=hoEeEFGqDpmJAuZPQLFLUmeJYxs-",
      "subtitle": "The former vice presidential candidate gets hit with a brutal reminder of her own history.",
      "author": "Ed Mazza",
      "content": " Former vice presidential candidate Sarah Palin attempted to mock Stacey Abrams as a “literal loser” on Tuesday. It didn’t go well. Abrams, a rising star in the Democratic Party after losing a closer-than-expected race in deep red Georgia, has been tapped to deliver the response to President Donald Trump’s State of the Union address next week. But Palin ― the former Alaska governor who was on the literal losing ticket in 2008 when she ran on the Republican ticket alongside John McCain against Barack Obama― tweeted: Chuck Schumer Wants A LITERAL LOSER To Deliver The Democratic SOTU Response https://t.co/NkSD9kLhX3 Palin’s tweet ― including the “literal loser” phrase ― was the headline to a story she was linking to, and not written by her. But given the fact that she shared it without altering it, Palin was given a pretty blunt reminder of her own history: I must have missed when you were sworn in as Vice President, literal loser.",
      "date": "01/30/2019 03:51 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin’s Attempt To Mock Alexandria Ocasio-Cortez’s ‘Fumble’ Backfires On Twitter",
      "url": "https://search.huffpost.com/click/_ylt=Awr9IlrAqqtdQp8A9NNsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560256/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fsarah-palin-alexandria-ocasio-cortez_n_5bf38c4be4b0376c9e6819de/RK=2/RS=YhCZzpe8EgRFdNwqvXOKKr04uB0-",
      "subtitle": "The former vice presidential candidate’s own verbal fumbles come back to haunt her.",
      "author": "Ed Mazza",
      "content": " Sarah Palin fired off a tweet linking to a story on her website that mocked Alexandria Ocasio-Cortez, the incoming Democratic congresswoman from New York, for “fumbling” a statement about “basic civics.” People on Twitter quickly reminded the former Alaska governor and 2008 vice presidential candidate of her own history of fumbling. Palin’s tweet was about a video in which Ocasio-Cortez referred to the “three chambers of Congress,” then the “three chambers of government,” which she called “the presidency, the Senate and the House.” A number of conservative figures mocked Ocasio-Cortez over the misspeak, noting that there are three “branches” rather than chambers, which are the legislative, executive and judiciary. Ocasio-Cortez replied to her critics on Twitter: Palin tweeted a link to the story penned by one of the writers on her website: Many of the replies referred to events from the 2008 presidential campaign when Palin made a few now-famous flubs while serving as John McCain’s running mate on the GOP ticket: The person tweeting this is ... Sarah Palin. https://t.co/Wq5eTjPwvx",
      "date": "11/20/2018 05:25 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin-Backed Congressional Candidate Accused Of Plagiarizing Obama’s 2004 Convention Speech",
      "url": "https://search.huffpost.com/click/_ylt=Awr9IlrAqqtdQp8A8tNsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560256/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fvaughn-ward-tea-party-bac_n_588635/RK=2/RS=TKi7ejZg7M1eZAIskLtEjw4VolE-",
      "subtitle": "null",
      "author": "",
      "content": "Vaughn Ward, a GOP candidate for Idaho’s First Congressional district, is facing charges that he swiped key passages from Barack Obama‘s iconic 2004 Democratic National Convention speech for his own campaign kickoff speech in January. The specific passages in question have since been spliced together by a Tea Party activist who asks, “Who Is Vaughn Ward Really?” Mike Tracy, a spokesman for Ward’s campaign tried to downplay the video, telling Politico that the attack was a sign that “[f]olks are getting desperate — they’re saying anything to get Vaughn to go after him. If anyone thinks he’s anything like Obama, they’re dead wrong.” These allegations come after a series of missteps for the GOP candidate’s campaign. Ward fired his campaign manager following an embarrassing discovery that he had borrowed heavily from the campaign language of various other GOP politicians. Ward later sought to rebound from that hiccup with a high-profile appearance with Sarah Palin, who endorsed him — along with other military veterans — back in March, but the event was slightly tarnished by multiple reports showing that Ward had referred to Puerto Rico as a “country” during a recent debate. Republican voters in Idaho will go to the polls Tuesday to choose between Ward and his challenger, State Rep. Raul Labrador. Recent polling shows Ward leading Labrador 31 percent to 28 percent, with undecideds making up 37 percent. A similar poll from earlier in May had Ward leading 34 percent to 16 percent. The following video is a mashup of Ward and Obama’s remarks, created by Idaho blogger Lucas Baumbach, a tea party activist seeking a State Senate seat:",
      "date": "05/25/2010 11:42 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin On ‘Today’ Show: Former Alaska Governor To Appear As Co-Host",
      "url": "https://search.huffpost.com/click/_ylt=Awr9IlrAqqtdQp8A8NNsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560256/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fsarah-palin-today-show_n_1395502/RK=2/RS=jfuB9YO25ve3jVS06V4csOzLcrs-",
      "subtitle": "null",
      "author": "",
      "content": "In the four years since serving as John McCain’s vice presidential nominee, Sarah Palin has appeared on television as a Fox News commentator and reality show star. Now she’s tackling morning news. CNN reports that the former Alaska governor will co-host NBC’s “Today” Show on Tuesday. A spokesman said that Palin will “reveal a different side of her than you’ve seen before.” Via an NBC rep, E! Online adds that Palin will spend the 7 a.m. hour serving as a live guest on the day’s political news. During the 8 a.m. hour, she will shift over to the co-host position, helping out with some of the show’s segments. Back in October, Palin decided that she would not be throwing her hat into the GOP 2012 presidential race. She has chimed in from time to time — like last week when she praised former Sen. Rick Santorum (R-Pa.) for cursing out a New York Times reporter. The Palin news comes on the heels of ABC announcing that former “Today” Show anchor Katie Couric will be co-hosting rival program “Good Morning America” this week. Couric’s addition is viewed as a push to break the 16-year ratings lead that “Today” has held.",
      "date": "04/01/2012 11:19 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin Endorses Rand Paul For Kentucky Senate",
      "url": "https://search.huffpost.com/click/_ylt=Awr9IlrAqqtdQp8A7tNsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560256/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fsarah-palin-endorses-rand_n_444497/RK=2/RS=yzz5RwaZpOl1NOmZvL2MoKSc78U-",
      "subtitle": "null",
      "author": "Nick Wing",
      "content": " Sarah Palin injected herself into another 2010 campaign Monday, with her endorsement of Rand Paul, son Rep. Ron Paul (R-Tex.), who is running for a U.S. Senate seat in Kentucky. “Governor Palin is providing tremendous leadership as the Tea Party movement and constitutional conservatives strive to take our country back,” Rand Paul said in a statement. “Sarah Palin is a giant in American politics. I am proud to receive her support.” Paul also acknowledged that he “has received a generous donation from Governor Palin’s PAC.” Palin joins a growing list of Rand Paul endorsers, which includes Concerned Women for America, Gun Owners of America, Steve Forbes and RedState.com. Paul has also established himself as a darling of the Tea Party Movement and conservative groups such as Dick Armey’s Freedom Works. One recent poll shows Paul with a sizable lead over his Republican primary opponent, Kentucky Secretary of State Trey Grayson.",
      "date": "04/03/2010 05:12 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin Slams ‘Evil, Sick’ Sacha Baron Cohen After Being Duped Into Interview",
      "url": "https://search.huffpost.com/click/_ylt=Awr9IlrAqqtdQp8A7NNsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560256/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fsarah-palin-sacha-baron-cohen_n_5b4558b2e4b048036ea39643/RK=2/RS=3aBz5y6RmsueQYKa7iTJ6NX4V2A-",
      "subtitle": "The former Fox News pundit and vice presidential candidate said the “Borat” creator’s team also made her miss her flight home.",
      "author": "Rebecca Shapiro",
      "content": " Former Fox News pundit and vice presidential candidate Sarah Palin confirmed on Tuesday that she was duped into an interview with a disguised Sacha Baron Cohen for his upcoming TV show. Responding to a tweet from commentator Matt Drudge that the “Borat” creator had “finked” various public figures, Palin wrote, “I join a long list of American public personalities who have fallen victim to the evil, exploitive, sick ‘humor’ of the British ‘comedian’ Sacha Baron Cohen, enabled and sponsored by CBS/Showtime.” Palin said Baron Cohen was heavily disguised as a disabled veteran, and that she and her daughter flew across the country for an interview that was billed as a “legit Showtime historical documentary.” She said she sat for a long “interview” before removing her mic and leaving the set because she’d had enough. Palin added that Baron Cohen’s team intentionally dropped her and her daughter off at the wrong Washington, D.C., airport, “knowing we’d miss all flights back home to Alaska.” The former vice presidential candidate called on Baron Cohen to donate all proceeds from his new show to charities supporting veterans. “Mock politicians and innocent public personalities all you want, if that lets you sleep at night, but HOW DARE YOU mock those who have fought and served our country,” Palin wrote. Baron Cohen’s upcoming TV show “Who Is America?” is set to debut on July 15. Details are scarce, but the comedian did release a teaser on Sunday showing a clip of former Vice President Dick Cheney signing a “waterboard kit” at the request of someone off-camera who sounded a lot like Baron Cohen in character. Showtime released another trailer on Monday featuring the show’s title and release date. Check it out in the video above.",
      "date": "07/10/2018 10:51 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin: Westboro Baptist Church Ruling Reflects Lack Of ‘Common Sense & Decency’",
      "url": "https://search.huffpost.com/click/_ylt=Awr9IlrAqqtdQp8A6tNsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560256/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fsarah-palin-westboro-bapt_n_830485/RK=2/RS=xYtpUmOE82AqPwBGzPdv3Cca4oE-",
      "subtitle": "null",
      "author": "",
      "content": "Sarah Palin responded to a ruling issued by the Supreme Court on Wednesday upholding an appeals court decision that protesting outside military funerals is protected by the First Amendment of the U.S. Constitution. “Common sense & decency absent as wacko “church” allowed hate msgs spewed@ soldiers’ funerals but we can’t invoke God’s name in public square,” wrote Palin on Twitter shortly after the ruling was struck down. The AP relays background on the decision: The court voted 8-1 in favor of the Westboro Baptist Church of Topeka, Kan. The decision upheld an appeals court ruling that threw out a $5 million judgment to the father of a dead Marine who sued church members after they picketed his son’s funeral. Chief Justice John Roberts wrote the opinion for the court. Justice Samuel Alito dissented. Roberts said free speech rights in the First Amendment shield the funeral protesters, noting that they obeyed police directions and were 1,000 feet from the church. ABC News reports that Westboro leaders signaled on the heels of the ruling that the church plans to “quadruple” the number of demonstrations it holds on a national scale going forward.",
      "date": "03/02/2011 04:18 pm ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    },
    {
      "title": "Sarah Palin’s Popularity In Alaska Slips",
      "url": "https://search.huffpost.com/click/_ylt=Awr9IlrAqqtdQp8A6NNsBmVH;_ylu=X3oDMTByNWU4cGh1BGNvbG8DZ3ExBHBvcwMxBHZ0aWQDBHNlYwNzYw--/RV=2/RE=1571560256/RO=10/RU=https%3a%2f%2fwww.huffpost.com%2fentry%2fsarah-palins-popularity-i_n_442240/RK=2/RS=GXVWXIpZWosw6AK1TO_asWlvKRA-",
      "subtitle": "null",
      "author": "Nick Wing",
      "content": " Alaskans continue to sour on Sarah Palin, according to a new poll released Friday by Public Policy Polling. Forty-five percent of Alaskans surveyed have an unfavorable opinion of their former governor, while 47 percent had a favorable view and 7 percent were unsure. Seventy-four percent of Democrats have an unfavorable opinion of her, as do 55 percent of Independents and 15 percent of Republicans. Palin’s popularity in the Final Frontier has continually slumped since her early departure from office and before, amid sentiment that she wasn’t looking out for the best interests of Alaska. The results of the automated phone survey of 710 Alaska voters comes after her lengthy book tour and contract as a Fox News analyst. One person’s loss can be another one’s gain, however. According to the survey the approval rating of Palin’s replacement, Republican Gov. Sean Parnell, stands at 58 percent, while only 19 percent disapprove. These high marks also remain consistent across party lines, with 51 percent of Democrats and 55 percent of Independents approving. The poll also showed that only 4 percent of Alaska Republicans approve of President Obama’s performance, and only 14 percent of Republicans approve of the job Democratic Sen. Mark Begich is doing. Independent support of the Democratic political figures is tepid, with 43 percent approving of Obama and 37 percent approving of Begich.",
      "date": "03/31/2010 05:12 am ET",
      "labels": {
        "author_gender": "",
        "target_gender": "Female",
        "target_affiliation": "Right",
        "target_name": "Sarah_Palin"
      }
    }
  ]
}